/////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////    АКТУАЛЬНЫЙ РАСЧЕТ В МОДУЛЕ ОБЪЕКТА    //////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура НачислитьПеню(Организация,ПериодНачисления,Район,МКД,Абонент,Документ, ВосстанавливатьВзаиморасчеты = Истина) Экспорт 
	
	// Обратная совместимость
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("Организация", Организация);
	ВходныеПараметры.Вставить("ПериодНачисления", ПериодНачисления);
	ВходныеПараметры.Вставить("Район", Район);
	ВходныеПараметры.Вставить("МКД", МКД);
	энргНачисления.НачислитьПеню(ВходныеПараметры, Абонент, Документ);
	Возврат;
	
	РассчитыватьНаТекущуюДату = Ложь;
	
	ТекущаяДатаНачислений = ТекущаяДата();
	
	НачислятьПеню = Константы.энргНачислятьПеню.Получить();
	
	Если не НачислятьПеню тогда		
		Возврат;
	КонецЕсли;
	
	Если МКД = Неопределено тогда
		НачислитьПенюПоСпискуМКДВсегоРайона(Организация, ПериодНачисления, Район);
		Возврат;
		МКД = Справочники.энргСтроения.ПустаяСсылка();
	КонецЕсли;	
	
	ГраницыПериодаНачисления 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления, Ложь);	
	МВТ 						= Новый МенеджерВременныхТаблиц;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.ПериодНачалаУчетаПени КАК ПериодНачалаУчетаПени,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.ПериодНачалаУчетаДолга КАК ПериодНачалаУчетаДолга,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.НеНачислятьПениПриОтсутствииДолгаНаКонецПериода КАК НеНачислятьПениПриОтсутствииДолгаНаКонецПериода
	|ИЗ
	|	РегистрСведений.энргНастройкаНачалаРасчетаПени.СрезПоследних(, Организация = &Организация) КАК энргНастройкаНачалаРасчетаПениСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаРасчетаПениСрезПоследних.НастройкаРасчета КАК НастройкаРасчета,
	|	энргНастройкаРасчетаПениСрезПоследних.РасчетПоТекущейСтавке КАК РасчетПоТекущейСтавке
	|ИЗ
	|	РегистрСведений.энргНастройкаРасчетаПени.СрезПоследних(&Период, Организация = &Организация) КАК энргНастройкаРасчетаПениСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкиНачисленияПениСрезПоследних.ГлубинаОтсрочки КАК ГлубинаОтсрочки,
	|	энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
	|	энргНастройкиНачисленияПениСрезПоследних.МаксимальнаяГлубинаЗадолженности КАК МаксимальнаяГлубинаЗадолженности,
	|	энргНастройкиНачисленияПениСрезПоследних.РассчитыватьНаТекущуюДату КАК РассчитыватьНаТекущуюДату
	|ИЗ
	|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкиНачисленияПениСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ГраницыПериодаНачисления.ЗавершениеОП-1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена информация по началу расчета пени,
		|	 Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	НачалоРасчетаПени 	= Выборка.ПериодНачалаУчетаПени;
	НачалоУчетаДолга 	= Выборка.ПериодНачалаУчетаДолга;
	НеНачислятьПениПриОтсутствииДолгаНаКонецПериода 	= Выборка.НеНачислятьПениПриОтсутствииДолгаНаКонецПериода;
	
	Если РезультатЗапроса[1].Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки расчет пени, Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса[1].Выбрать();
	Выборка.Следующий();
	
	// Расчет по текущей ставке реф.
	РасчетПоТекущейСтавке = Выборка.РасчетПоТекущейСтавке;
	
	НастройкиРасчетаПени = Выборка.НастройкаРасчета.Получить();
	
	МаксЗначение = 0;
	Соответствие = Новый Соответствие;
	РангКоэффициента = 1;
	Для каждого Строка Из НастройкиРасчетаПени Цикл
		Если Строка.До = 0 Тогда
			НСтр = Новый Структура;
			НСтр.Вставить("Числитель", Строка.Числитель);
			НСтр.Вставить("Знаменатель", Строка.Знаменатель);
			НСтр.Вставить("РангКоэффициента", РангКоэффициента);
			
			Соответствие.Вставить(Строка.До, НСтр);
		Иначе
			Для Сч = Строка.От По Строка.До Цикл
				НСтр = Новый Структура;
				НСтр.Вставить("Числитель", Строка.Числитель);
				НСтр.Вставить("Знаменатель", Строка.Знаменатель);
				НСтр.Вставить("РангКоэффициента", РангКоэффициента);		
				Соответствие.Вставить(Сч, НСтр);	
				МаксЗначение = Макс(МаксЗначение, Сч);
			КонецЦикла;
		КонецЕсли;
		
		РангКоэффициента = РангКоэффициента + 1;
	КонецЦикла;
	
	НастройкиСтавокРефинансирования = ПолучитьСтавкиРефинансирования(ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП, Организация, МВТ, РасчетПоТекущейСтавке);
	Если НастройкиСтавокРефинансирования.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена информация по ставке рефинансирования,
		|	 Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	
	Если РезультатЗапроса[2].Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки начисления пени, Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса[2].Выбрать();
	Выборка.Следующий();
	ГлубинаОтсрочки 					= Выборка.ГлубинаОтсрочки;
	КрайнийСрокОплаты 					= Выборка.КрайнийСрокОплаты;
	МаксимальнаяГлубинаЗадолженности 	= Выборка.МаксимальнаяГлубинаЗадолженности;
	
	КонецПериода = ГраницыПериодаНачисления.ЗавершениеОП;
	
	Если ГраницыПериодаНачисления.ПериодНачисления > НачалоМесяца(ТекущаяДатаНачислений) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяДатаНачислений < ГраницыПериодаНачисления.ЗавершениеОП И ТекущаяДатаНачислений > ГраницыПериодаНачисления.НачалоОП Тогда
		
		Если Выборка.РассчитыватьНаТекущуюДату Тогда
			
			РассчитыватьНаТекущуюДату = Истина;
			
			ГраницыПериодаНачисления.ЗавершениеОП = НачалоДня(ТекущаяДатаНачислений);
			ГраницыПериодаНачисления.ДнейВПериоде = (ГраницыПериодаНачисления.ЗавершениеОП - ГраницыПериодаНачисления.НачалоОП) / (60 * 60 * 24);
			
		КонецЕсли;
		
	КонецЕсли;
		
	// Настройки начисления пени.
	Выборка = РезультатЗапроса[2].Выбрать();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ВернутьТекстЗапросаНачисленияПени(НеНачислятьПениПриОтсутствииДолгаНаКонецПериода);	
	
	Запрос.УстановитьПараметр("ГлубинаОтсрочки", 			ГлубинаОтсрочки);
	Запрос.УстановитьПараметр("КонецПериода", 				ГраницыПериодаНачисления.ЗавершениеОП);
	Запрос.УстановитьПараметр("КонецПериодаДляДокумента",	КонецПериода - 1);
	Запрос.УстановитьПараметр("КрайнийСрокОплаты", 			КрайнийСрокОплаты);
	Запрос.УстановитьПараметр("МКД", 						МКД);
	Запрос.УстановитьПараметр("НачалоПериода", 				ГраницыПериодаНачисления.НачалоОП);
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("Район", 						Район);
	Запрос.УстановитьПараметр("НачалоУчетаДолга", 			НачалоУчетаДолга);
	Запрос.УстановитьПараметр("РасчетПоТекущейСтавке", 		РасчетПоТекущейСтавке);
	Запрос.УстановитьПараметр("ЗавершениеОП", 				ГраницыПериодаНачисления.ЗавершениеОП-1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОтменитьОперациюНачисленийПени(Организация,ПериодНачисления,Район,МКД);
	КонецЕсли;
	
 	НаборНачислениеПени = Неопределено;
	ДокументОбъект = Неопределено; 	
	
	ВыборкаДокументНачисления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	СменаСтавкиВПериоде = СменаСтавкиВПериоде(Организация, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП-1);	
	Пока ВыборкаДокументНачисления.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДокументНачисления.ДокументНачисления) Тогда
			ДокументОбъект = ВыборкаДокументНачисления.ДокументНачисления.ПолучитьОбъект();
		иначе
			ДокументОбъект = Документы.энргНачислениеПени.СоздатьДокумент();
			ДокументОбъект.Район = Район;
			ДокументОбъект.МКД = МКД;
			ДокументОбъект.Организация = Организация;
			ДокументОбъект.ПериодНачисления = ПериодНачисления;
		КонецЕсли;
		
		//ДокументОбъект.Дата = ГраницыПериодаНачисления.ЗавершениеОП-1;
		ДокументОбъект.Дата = КонецПериода - 1;
		
		ДокументОбъект.ПометкаУдаления = Ложь;
		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		НаборНачислениеПени					= РегистрыНакопления.энргНачислениеПени.СоздатьНаборЗаписей();
		НаборНачислениеПени.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
		НаборНачислениеПени.Записать();  	
		
		НовНабор = ДокументОбъект.Движения.энргНачислениеПени;
		
		Если ПериодНачисления < НачалоРасчетаПени  Или  ПериодНачисления < НачалоУчетаДолга Тогда 
			Продолжить;
		КонецЕсли;
		
		ВыборкаПериодНачисления = ВыборкаДокументНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаПериодНачисления.Следующий() Цикл
			
			ВыборкаУслуга = ВыборкаПериодНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаУслуга.Следующий() Цикл
				ВыборкаАбонент = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				Пока ВыборкаАбонент.Следующий() Цикл
					
					НачалоПериода 				= ВыборкаАбонент.ПериодНачало;
					ПериодНачалоДляРасчета 		= ВыборкаАбонент.ПериодНачало;
					ДнейНаДеньНачалаДляРасчета 	= ?(ВыборкаАбонент.ДнейНаДеньНачала = 0, -1, ВыборкаАбонент.ДнейНаДеньНачала);
					ТекПериод 					= ВыборкаАбонент.ПериодНачало;
					ВыборкаДетальныеЗаписи 		= ВыборкаАбонент.Выбрать();	
					СуммаПени 					= 0;
					ДнейПросрочкиВПериоде 		= 0;
					ДнейПросрочки 				= ВыборкаАбонент.ДнейНаДеньНачала;
					Оплата 						= 0;
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 						
						СуммаЗадолженности = ?(ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток = 0, ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток, ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток);
						КоэффициентЧислитель = 1;
						КоэффициентЗнаменатель = 1;
						ПредКоэффициентЧислитель = 1;
						ПредКоэффициентЗнаменатель = 1;
						РангКоэффициента = 0;
						ПредыдущийРанг 						= Неопределено;
						НачисляемПеню 						= Ложь;  						
						
						ЗначениеСтавкиРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;
						ПричинаСменаСтавкиВПериоде = Ложь;
						
						Если СменаСтавкиВПериоде.ЕстьСмена и СменаСтавкиВПериоде.Период < ТекПериод Тогда 
							ЗначениеСтавкиРефинансирования = СменаСтавкиВПериоде.Коэффициент;
						КонецЕсли;
						
						Пока НачалоДня(ТекПериод) < НачалоДня(ВыборкаДетальныеЗаписи.Период) И НачалоДня(ТекПериод) < НачалоДня(ВыборкаДетальныеЗаписи.ДатаЗакрытияЛС) Цикл
							ДнейПросрочки 					= ДнейПросрочки + 1;							
							НачисляемПеню 					= Ложь;
							ПараметрыРасчетаИзменены 		= Ложь;
							Мораторий = Ложь;
							СтруктураКоэффициента 			= Соответствие.Получить(?(ДнейПросрочки>МаксЗначение,0,ДнейПросрочки));
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								ПараметрыРасчетаИзменены 	= НЕ КоэффициентЧислитель = СтруктураКоэффициента.Числитель ИЛИ НЕ КоэффициентЗнаменатель = СтруктураКоэффициента.Знаменатель ИЛИ НЕ РангКоэффициента = СтруктураКоэффициента.РангКоэффициента;  
								НачисляемПеню 				= Истина;								
							КонецЕсли;
							
							Если РассчитыватьНаТекущуюДату И ТекПериод = НАЧАЛОДНЯ(ТекущаяДатаНачислений + 60*60*24) Тогда
								ПараметрыРасчетаИзменены = Истина;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодОстановкиРасчетаПени) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодВозобновленияРасчетаПени) Тогда
								Если ТекПериод >= НачалоДня(ВыборкаДетальныеЗаписи.ПериодОстановкиРасчетаПени) И ТекПериод < НачалоДня(ВыборкаДетальныеЗаписи.ПериодВозобновленияРасчетаПени + 1) Тогда	
									Мораторий = Истина;	
								КонецЕсли;
							КонецЕсли;
							
							Если НачисляемПеню и СменаСтавкиВПериоде.ЕстьСмена и ТекПериод = СменаСтавкиВПериоде.Период Тогда								
								ПараметрыРасчетаИзменены = Истина;
								ПричинаСменаСтавкиВПериоде = Истина;
							КонецЕсли; 						
							
							
							Если НачисляемПеню и ПараметрыРасчетаИзменены И ДнейПросрочкиВПериоде > 1 Тогда
								НСтр						= НовНабор.Добавить();
								ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
								НСтр.Организация			= Организация;
								НСтр.Район					= Район;
								НСтр.МКД					= МКД;
								НСтр.ПериодРасчета			= ПериодНачисления;
								//НСтр.Период					= КонецПериода-1; 
								НСтр.Период					= ДокументОбъект.Дата; 
								НСтр.ДатаНачисленияПени 	= ТекПериод;
								НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки - 1;
								НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
								НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
								НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
								НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
								//НСтр.СтавкаРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;
								НСтр.СтавкаРефинансирования = ЗначениеСтавкиРефинансирования;
								//Если Не Мораторий Тогда
									НСтр.Сумма 					= СуммаПени;
								//Иначе
								//	НСтр.Сумма 					= 0;
								//КонецЕсли;
								НСтр.Оплата	 				= 0;
								НСтр.НачалоПериода 			= НачалоПериода;
								НСтр.КонецПериода 			= ТекПериод - 1;
								
								Если ПричинаСменаСтавкиВПериоде Тогда 
									ЗначениеСтавкиРефинансирования = СменаСтавкиВПериоде.Коэффициент;
								КонецЕсли;
								                                                                                                                   	
								СуммаПени 					= 0;								
								ДнейПросрочкиВПериоде 		= 0;
								НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
								
								НачалоПериода 	= ТекПериод;
							КонецЕсли; 
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								КоэффициентЧислитель 		= СтруктураКоэффициента.Числитель;
								КоэффициентЗнаменатель 		= СтруктураКоэффициента.Знаменатель;
								РангКоэффициента 			= СтруктураКоэффициента.РангКоэффициента; 								
							КонецЕсли;
							
							Если НачисляемПеню Тогда
								
								//СтавкаРефинансированияДоля	= (ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования/100);
								СтавкаРефинансированияДоля	= (ЗначениеСтавкиРефинансирования/100);
								
								Если Не Мораторий Тогда
									СуммаПени 					= СуммаПени + СуммаЗадолженности * (КоэффициентЧислитель / КоэффициентЗнаменатель) * СтавкаРефинансированияДоля;
									ДнейПросрочкиВПериоде 		= ДнейПросрочкиВПериоде + 1;
								Иначе
									СуммаПени 					= СуммаПени + 0;
									ДнейПросрочкиВПериоде 		= ДнейПросрочкиВПериоде + 0;
								КонецЕсли;

							КонецЕсли;
							
							ТекПериод 						= ТекПериод + 86400;							
						КонецЦикла;
						
						Если НачисляемПеню и СуммаПени > 0  и Не ДнейПросрочки = 0  Тогда
							НСтр						= НовНабор.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							//НСтр.Период					= КонецПериода - 1;
							НСтр.Период					= ДокументОбъект.Дата; 
							НСтр.Организация			= Организация;
							НСтр.Район					= Район;
							НСтр.МКД					= МКД;
							НСтр.ПериодРасчета			= ПериодНачисления;							
							НСтр.ДатаНачисленияПени 	= ТекПериод;										
							НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
							
							НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки;
							НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
							НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
							НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
							НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
							//НСтр.СтавкаРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;							
							НСтр.СтавкаРефинансирования = ЗначениеСтавкиРефинансирования;							
							//Если Не Мораторий Тогда
								НСтр.Сумма 					= СуммаПени;
							//Иначе
							//	НСтр.Сумма 					= 0;
							//КонецЕсли;
							
							//НСтр.Оплата	 				= Оплата;
							НСтр.НачалоПериода 			= НачалоПериода;
							НСтр.КонецПериода 			= ТекПериод - 1;
							
							СуммаПени 					= 0;								
							ДнейПросрочкиВПериоде 		= 0;
						КонецЕсли;
						
						Если Не НачисляемПеню И СтруктураКоэффициента = Неопределено И ВыборкаДетальныеЗаписи.ПериодНачало = ПериодНачисления Тогда 
							НСтр						= НовНабор.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							//НСтр.Период					= КонецПериода - 1;
							НСтр.Период					= ДокументОбъект.Дата; 
							НСтр.Организация			= Организация;
							НСтр.Район					= Район;
							НСтр.МКД					= МКД;
							НСтр.ПериодРасчета			= ПериодНачисления;
							НСтр.ДатаНачисленияПени 	= Дата(1,1,1) ;				
							НСтр.ДатаНачалаНачисленияПени = Дата(1,1,1);						
							НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки;
							НСтр.КоэффициентЧислитель 	= 0;
							НСтр.КоэффициентЗнаменатель = 0;
							НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
							НСтр.ДнейПросрочки 			= 0;
							НСтр.СтавкаРефинансирования = 0;							
							НСтр.Сумма	 				= 0;
							НСтр.Оплата	 				= 0;
							НСтр.НачалоПериода 			= НачалоПериода;
							НСтр.КонецПериода 			= ТекПериод - 1;
											
						КонецЕсли;
						
						НачалоПериода 	= ТекПериод;
						Оплата 			= ВыборкаДетальныеЗаписи.Оплата;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		
	КонецЦикла;
	
	// Проверка изменения настроек в периоде. При условии, что "РасчетПоТекущейСтавке" = Истина
	Если РасчетПоТекущейСтавке Тогда
		СнятьНачислениеПени(НовНабор, Организация, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП-1, ПериодНачисления, МКД, Район);
		ДоначислитьСуммыПени(НовНабор, Организация, ПериодНачисления,Район, МКД, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП, ГлубинаОтсрочки, КрайнийСрокОплаты, НачалоУчетаДолга, НачалоРасчетаПени);
	КонецЕсли;
	
	
	Если Не НовНабор = Неопределено Тогда 
		НаборЗаписейНачислений = НовНабор.Выгрузить();
		НаборНачислениеПени.Загрузить(НаборЗаписейНачислений);	
		Если Не НаборНачислениеПени = Неопределено и Не НаборНачислениеПени.Количество() = 0 Тогда
			НаборНачислениеПени.Записать();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	Абонент = Неопределено;

	Если ВосстанавливатьВзаиморасчеты Тогда 
		ПараметрыОперацииВЗ = Новый Структура("Организация,ПериодНачисления,Район,МКД,Абонент,СписокМКД",Организация,ПериодНачисления,Район,МКД, Абонент);
		энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(ПараметрыОперацииВЗ);
	КонецЕсли;
	
КонецПроцедуры

#Область НачисленияПоСпискуМКД

Процедура НачислитьПенюПоСпискуМКДВсегоРайона(Организация, ПериодНачисления, Район) Экспорт 
	
	//НачислитьПенюПоСпискуМКДВсегоРайонаМногопоточно(Организация, ПериодНачисления, Район);
	//Возврат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтроения.Ссылка КАК МКД
		|ИЗ
		|	Справочник.энргСтроения КАК энргСтроения
		|ГДЕ
		|	энргСтроения.ПометкаУдаления = ЛОЖЬ
		|	И энргСтроения.Район = &Район
		|	И энргСтроения.ТипСтроения = &ТипСтроения
		|	И энргСтроения.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	МКД";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТипСтроения", Перечисления.энргТипыСтроений.МКД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Всего 				= Выборка.Количество();	
	Итерация			= 0;
	КоличествоИтераций 	= Итерация;
	КолвоСообщений		= Цел(Всего / 20);
	Постфикс 			= " из " + Всего;

	ПредставлениеРайон = "" + Район;
	Пока Выборка.Следующий() Цикл
		НачислитьПеню(Организация, ПериодНачисления, Район, Выборка.МКД, Неопределено, Неопределено, Ложь);
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			ЗаписьЖурналаРегистрации(
				"Начисление пени." + ПредставлениеРайон,
				УровеньЖурналаРегистрации.Примечание,,,
				"Начислено " + Итерация + Постфикс);
	
			КоличествоИтераций = 0;
		КонецЕсли;
		
		Итерация = Итерация + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;
	
	// по частному
	НачислитьПеню(Организация, ПериодНачисления, Район, Справочники.энргСтроения.ПустаяСсылка(), Неопределено, Неопределено, Ложь);
	
	Абонент = Неопределено;
	
	ПараметрыОперацииВЗ = Новый Структура("Организация,ПериодНачисления,Район,МКД,Абонент,СписокМКД", Организация, ПериодНачисления, Район, Неопределено, Абонент);
	энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(ПараметрыОперацииВЗ);
	
КонецПроцедуры

Процедура НачислитьПенюПоСпискуМКДВсегоРайонаМногопоточно(Организация, ПериодНачисления, Район) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтроения.Ссылка КАК МКД,
		|	энргСтроения.Наименование КАК Наименование
		|ИЗ
		|	Справочник.энргСтроения КАК энргСтроения
		|ГДЕ
		|	энргСтроения.ПометкаУдаления = ЛОЖЬ
		|	И энргСтроения.Район = &Район
		|	И энргСтроения.ТипСтроения = &ТипСтроения
		|	И энргСтроения.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	МКД";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТипСтроения", Перечисления.энргТипыСтроений.МКД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Всего 				= Выборка.Количество();	
	Итерация			= 0;
	КоличествоИтераций 	= Итерация;
	КолвоСообщений		= Цел(Всего / 20);
	Постфикс 			= " из " + Всего;

	ПредставлениеРайон = "" + Район;
	
	ИмяМетода = "Обработки.энргИнструментыНачисленийПени.НачислитьПеню";
	ДлительныеОперацииСписок = Новый Массив;
	КоличествоПотоков = 10;
	ИтерацияПотоков = 0;
	
	ПрефиксОперации = "Начисление пени по району: " + ПредставлениеРайон;
	
	Пока Выборка.Следующий() Цикл
		//НачислитьПеню(Организация, ПериодНачисления, Район, Выборка.МКД, Неопределено, Неопределено, Ложь);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
		ПараметрыВыполнения.ОжидатьЗавершение = 0;
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = ПрефиксОперации + " МКД: " + Выборка.Наименование;
		//ПараметрыВыполнения.Вставить("ИдентификаторФормы", ИдентификаторФормы);
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
			ПараметрыВыполнения,
			ИмяМетода,
			Организация, ПериодНачисления, Район, Выборка.МКД, Неопределено, Неопределено, Ложь); 
			
		ДлительныеОперацииСписок.Добавить(ДлительнаяОперация);
		
		Если КоличествоПотоков = ИтерацияПотоков Тогда 
			
			ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок);
			
			ДлительныеОперацииСписок.Очистить();
			ИтерацияПотоков = 0;
			
		КонецЕсли;
		
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			ЗаписьЖурналаРегистрации(
				"Начисление пени." + ПредставлениеРайон,
				УровеньЖурналаРегистрации.Примечание,,,
				"Начислено " + Итерация + Постфикс);
	
			КоличествоИтераций = 0;
		КонецЕсли;
		
		Итерация = Итерация + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
		ИтерацияПотоков = ИтерацияПотоков + 1;		
	КонецЦикла;
	
	//// по частному
	//НачислитьПеню(Организация, ПериодНачисления, Район, Справочники.энргСтроения.ПустаяСсылка(), Неопределено, Неопределено, Ложь);
	//
	//Абонент = Неопределено;
	//
	//ПараметрыОперацииВЗ = Новый Структура("Организация,ПериодНачисления,Район,МКД,Абонент", Организация, ПериодНачисления, Район, Неопределено, Абонент);
	//энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(ПараметрыОперацииВЗ);
	
КонецПроцедуры


Процедура НачислитьПенюПоСпискуМКДВсегоРайонаИтог(Организация,ПериодНачисления,Район,МКД,Абонент,Документ) Экспорт 
	
	РассчитыватьНаТекущуюДату = Ложь;
	
	ТекущаяДатаНачислений = ТекущаяДата();
	
	НачислятьПеню = Константы.энргНачислятьПеню.Получить();
	
	Если не НачислятьПеню тогда		
		Возврат;
	КонецЕсли;
	
	Если МКД = Неопределено тогда
		МКД = Справочники.энргСтроения.ПустаяСсылка();
	КонецЕсли;	
	
	ГраницыПериодаНачисления 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления, Ложь);	
	МВТ 						= Новый МенеджерВременныхТаблиц;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.ПериодНачалаУчетаПени КАК ПериодНачалаУчетаПени,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.ПериодНачалаУчетаДолга КАК ПериодНачалаУчетаДолга,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.НеНачислятьПениПриОтсутствииДолгаНаКонецПериода КАК НеНачислятьПениПриОтсутствииДолгаНаКонецПериода

	|ИЗ
	|	РегистрСведений.энргНастройкаНачалаРасчетаПени.СрезПоследних(, Организация = &Организация) КАК энргНастройкаНачалаРасчетаПениСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаРасчетаПениСрезПоследних.НастройкаРасчета КАК НастройкаРасчета,
	|	энргНастройкаРасчетаПениСрезПоследних.РасчетПоТекущейСтавке КАК РасчетПоТекущейСтавке
	|ИЗ
	|	РегистрСведений.энргНастройкаРасчетаПени.СрезПоследних(&Период, ) КАК энргНастройкаРасчетаПениСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкиНачисленияПениСрезПоследних.ГлубинаОтсрочки КАК ГлубинаОтсрочки,
	|	энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
	|	энргНастройкиНачисленияПениСрезПоследних.МаксимальнаяГлубинаЗадолженности КАК МаксимальнаяГлубинаЗадолженности,
	|	энргНастройкиНачисленияПениСрезПоследних.РассчитыватьНатекущуюДату КАК РассчитыватьНаТекущуюДату
	|ИЗ
	|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкиНачисленияПениСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ГраницыПериодаНачисления.ЗавершениеОП-1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена информация по началу расчета пени,
		|	 Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	НачалоРасчетаПени 	= Выборка.ПериодНачалаУчетаПени;
	НачалоУчетаДолга 	= Выборка.ПериодНачалаУчетаДолга;
	НеНачислятьПениПриОтсутствииДолгаНаКонецПериода	= Выборка.НеНачислятьПениПриОтсутствииДолгаНаКонецПериода;
	
	Если РезультатЗапроса[1].Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки расчет пени, Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса[1].Выбрать();
	Выборка.Следующий();
	
	// Расчет по текущей ставке реф.
	РасчетПоТекущейСтавке = Выборка.РасчетПоТекущейСтавке;
	
	НастройкиРасчетаПени = Выборка.НастройкаРасчета.Получить();
	
	МаксЗначение = 0;
	Соответствие = Новый Соответствие;
	РангКоэффициента = 1;
	Для каждого Строка Из НастройкиРасчетаПени Цикл
		Если Строка.До = 0 Тогда
			НСтр = Новый Структура;
			НСтр.Вставить("Числитель", Строка.Числитель);
			НСтр.Вставить("Знаменатель", Строка.Знаменатель);
			НСтр.Вставить("РангКоэффициента", РангКоэффициента);
			
			Соответствие.Вставить(Строка.До, НСтр);
		Иначе
			Для Сч = Строка.От По Строка.До Цикл
				НСтр = Новый Структура;
				НСтр.Вставить("Числитель", Строка.Числитель);
				НСтр.Вставить("Знаменатель", Строка.Знаменатель);
				НСтр.Вставить("РангКоэффициента", РангКоэффициента);		
				Соответствие.Вставить(Сч, НСтр);	
				МаксЗначение = Макс(МаксЗначение, Сч);
			КонецЦикла;
		КонецЕсли;
		
		РангКоэффициента = РангКоэффициента + 1;
	КонецЦикла;
	
	НастройкиСтавокРефинансирования = ПолучитьСтавкиРефинансирования(ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП, Организация, МВТ, РасчетПоТекущейСтавке);
	Если НастройкиСтавокРефинансирования.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена информация по ставке рефинансирования,
		|	 Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	
	Если РезультатЗапроса[2].Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки начисления пени, Начисление пени не может быть выполнено");
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса[2].Выбрать();
	Выборка.Следующий();
	ГлубинаОтсрочки 					= Выборка.ГлубинаОтсрочки;
	КрайнийСрокОплаты 					= Выборка.КрайнийСрокОплаты;
	МаксимальнаяГлубинаЗадолженности 	= Выборка.МаксимальнаяГлубинаЗадолженности;
	
	КонецПериода = ГраницыПериодаНачисления.ЗавершениеОП;
	
	Если ГраницыПериодаНачисления.ПериодНачисления > НачалоМесяца(ТекущаяДатаНачислений) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяДатаНачислений < ГраницыПериодаНачисления.ЗавершениеОП И ТекущаяДатаНачислений > ГраницыПериодаНачисления.НачалоОП Тогда
		
		Если Выборка.РассчитыватьНаТекущуюДату Тогда
			
			РассчитыватьНаТекущуюДату = Истина;
			
			ГраницыПериодаНачисления.ЗавершениеОП = НачалоДня(ТекущаяДатаНачислений);
			ГраницыПериодаНачисления.ДнейВПериоде = (ГраницыПериодаНачисления.ЗавершениеОП - ГраницыПериодаНачисления.НачалоОП) / (60 * 60 * 24);
			
		КонецЕсли;
		
	КонецЕсли;
		
	// Настройки начисления пени.
	Выборка = РезультатЗапроса[2].Выбрать();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ВернутьТекстЗапросаНачисленияПени(НеНачислятьПениПриОтсутствииДолгаНаКонецПериода);	
	
	Запрос.УстановитьПараметр("ГлубинаОтсрочки", 			ГлубинаОтсрочки);
	Запрос.УстановитьПараметр("КонецПериода", 				ГраницыПериодаНачисления.ЗавершениеОП);
	Запрос.УстановитьПараметр("КонецПериодаДляДокумента",	КонецПериода - 1);
	Запрос.УстановитьПараметр("КрайнийСрокОплаты", 			КрайнийСрокОплаты);
	Запрос.УстановитьПараметр("МКД", 						МКД);
	Запрос.УстановитьПараметр("НачалоПериода", 				ГраницыПериодаНачисления.НачалоОП);
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("Район", 						Район);
	Запрос.УстановитьПараметр("НачалоУчетаДолга", 			НачалоУчетаДолга);
	Запрос.УстановитьПараметр("РасчетПоТекущейСтавке", 		РасчетПоТекущейСтавке);
	Запрос.УстановитьПараметр("ЗавершениеОП", 				ГраницыПериодаНачисления.ЗавершениеОП-1);
	
	РезультатЗапроса = Запрос.Выполнить();
 
 	НаборНачислениеПени = Неопределено;
	ДокументОбъект = Неопределено; 
	
	
	ВыборкаДокументНачисления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СменаСтавкиВПериоде = СменаСтавкиВПериоде(Организация, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП-1);	
	Пока ВыборкаДокументНачисления.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДокументНачисления.ДокументНачисления) Тогда
			ДокументОбъект = ВыборкаДокументНачисления.ДокументНачисления.ПолучитьОбъект();
		иначе
			ДокументОбъект = Документы.энргНачислениеПени.СоздатьДокумент();
			ДокументОбъект.Район = Район;
			ДокументОбъект.МКД = МКД;
			ДокументОбъект.Организация = Организация;
			ДокументОбъект.ПериодНачисления = ПериодНачисления;
		КонецЕсли;
		
		//ДокументОбъект.Дата = ГраницыПериодаНачисления.ЗавершениеОП-1;
		ДокументОбъект.Дата = КонецПериода - 1;
		
		ДокументОбъект.ПометкаУдаления = Ложь;
		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		НаборНачислениеПени					= РегистрыНакопления.энргНачислениеПени.СоздатьНаборЗаписей();
		НаборНачислениеПени.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
		НаборНачислениеПени.Записать();  	
		
		НовНабор = ДокументОбъект.Движения.энргНачислениеПени;
		
		Если ПериодНачисления < НачалоРасчетаПени  Или  ПериодНачисления < НачалоУчетаДолга Тогда 
			Продолжить;
		КонецЕсли;
		
		ВыборкаПериодНачисления = ВыборкаДокументНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаПериодНачисления.Следующий() Цикл
			
			ВыборкаУслуга = ВыборкаПериодНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаУслуга.Следующий() Цикл
				ВыборкаАбонент = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				Пока ВыборкаАбонент.Следующий() Цикл
					
					НачалоПериода 				= ВыборкаАбонент.ПериодНачало;
					ПериодНачалоДляРасчета 		= ВыборкаАбонент.ПериодНачало;
					ДнейНаДеньНачалаДляРасчета 	= ?(ВыборкаАбонент.ДнейНаДеньНачала = 0, -1, ВыборкаАбонент.ДнейНаДеньНачала);
					ТекПериод 					= ВыборкаАбонент.ПериодНачало;
					ВыборкаДетальныеЗаписи 		= ВыборкаАбонент.Выбрать();	
					СуммаПени 					= 0;
					ДнейПросрочкиВПериоде 		= 0;
					ДнейПросрочки 				= ВыборкаАбонент.ДнейНаДеньНачала;
					Оплата 						= 0;
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 						
						СуммаЗадолженности = ?(ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток = 0, ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток, ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток);
						КоэффициентЧислитель = 1;
						КоэффициентЗнаменатель = 1;
						ПредКоэффициентЧислитель = 1;
						ПредКоэффициентЗнаменатель = 1;
						РангКоэффициента = 0;
						ПредыдущийРанг 						= Неопределено;
						НачисляемПеню 						= Ложь;  						
						
						ЗначениеСтавкиРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;
						ПричинаСменаСтавкиВПериоде = Ложь;
						
						Пока НачалоДня(ТекПериод) < НачалоДня(ВыборкаДетальныеЗаписи.Период) Цикл
							ДнейПросрочки 					= ДнейПросрочки + 1;							
							НачисляемПеню 					= Ложь;
							ПараметрыРасчетаИзменены 		= Ложь;
							Мораторий = Ложь;
							СтруктураКоэффициента 			= Соответствие.Получить(?(ДнейПросрочки>МаксЗначение,0,ДнейПросрочки));
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								ПараметрыРасчетаИзменены 	= НЕ КоэффициентЧислитель = СтруктураКоэффициента.Числитель ИЛИ НЕ КоэффициентЗнаменатель = СтруктураКоэффициента.Знаменатель ИЛИ НЕ РангКоэффициента = СтруктураКоэффициента.РангКоэффициента;  
								НачисляемПеню 				= Истина;								
							КонецЕсли;
							
							Если РассчитыватьНаТекущуюДату И ТекПериод = НАЧАЛОДНЯ(ТекущаяДатаНачислений + 60*60*24) Тогда
								ПараметрыРасчетаИзменены = Истина;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодОстановкиРасчетаПени) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодВозобновленияРасчетаПени) Тогда
								Если ТекПериод >= НачалоДня(ВыборкаДетальныеЗаписи.ПериодОстановкиРасчетаПени) И ТекПериод < НачалоДня(ВыборкаДетальныеЗаписи.ПериодВозобновленияРасчетаПени + 1) Тогда	
									Мораторий = Истина;	
								КонецЕсли;
							КонецЕсли;
							
							Если НачисляемПеню и СменаСтавкиВПериоде.ЕстьСмена и ТекПериод = СменаСтавкиВПериоде.Период Тогда								
								ПараметрыРасчетаИзменены = Истина;
								ПричинаСменаСтавкиВПериоде = Истина;
							КонецЕсли; 						
							
							
							Если НачисляемПеню и ПараметрыРасчетаИзменены И ДнейПросрочкиВПериоде > 1 Тогда
								НСтр						= НовНабор.Добавить();
								ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
								НСтр.Организация			= Организация;
								НСтр.Район					= Район;
								НСтр.МКД					= МКД;
								НСтр.ПериодРасчета			= ПериодНачисления;
								//НСтр.Период					= КонецПериода-1; 
								НСтр.Период					= ДокументОбъект.Дата; 
								НСтр.ДатаНачисленияПени 	= ТекПериод;
								НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки - 1;
								НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
								НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
								НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
								НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
								//НСтр.СтавкаРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;
								НСтр.СтавкаРефинансирования = ЗначениеСтавкиРефинансирования;
								//Если Не Мораторий Тогда
									НСтр.Сумма 					= СуммаПени;
								//Иначе
								//	НСтр.Сумма 					= 0;
								//КонецЕсли;
								НСтр.Оплата	 				= Оплата;
								НСтр.НачалоПериода 			= НачалоПериода;
								НСтр.КонецПериода 			= ТекПериод - 1;
								
								Если ПричинаСменаСтавкиВПериоде Тогда 
									ЗначениеСтавкиРефинансирования = СменаСтавкиВПериоде.Коэффициент;
								КонецЕсли;
								                                                                                                                   	
								СуммаПени 					= 0;								
								ДнейПросрочкиВПериоде 		= 0;
								НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
								
								НачалоПериода 	= ТекПериод;
							КонецЕсли; 
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								КоэффициентЧислитель 		= СтруктураКоэффициента.Числитель;
								КоэффициентЗнаменатель 		= СтруктураКоэффициента.Знаменатель;
								РангКоэффициента 			= СтруктураКоэффициента.РангКоэффициента; 								
							КонецЕсли;
							
							Если НачисляемПеню Тогда
								
								//СтавкаРефинансированияДоля	= (ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования/100);
								СтавкаРефинансированияДоля	= (ЗначениеСтавкиРефинансирования/100);
								
								Если Не Мораторий Тогда
									СуммаПени 					= СуммаПени + СуммаЗадолженности * (КоэффициентЧислитель / КоэффициентЗнаменатель) * СтавкаРефинансированияДоля;
									ДнейПросрочкиВПериоде 		= ДнейПросрочкиВПериоде + 1;
								Иначе
									СуммаПени 					= СуммаПени + 0;
									ДнейПросрочкиВПериоде 		= ДнейПросрочкиВПериоде + 0;
								КонецЕсли;

							КонецЕсли;
							
							ТекПериод 						= ТекПериод + 86400;							
						КонецЦикла;
						
						Если НачисляемПеню и СуммаПени > 0  и Не ДнейПросрочки = 0  Тогда
							НСтр						= НовНабор.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							//НСтр.Период					= КонецПериода - 1;
							НСтр.Период					= ДокументОбъект.Дата; 
							НСтр.Организация			= Организация;
							НСтр.Район					= Район;
							НСтр.МКД					= МКД;
							НСтр.ПериодРасчета			= ПериодНачисления;							
							НСтр.ДатаНачисленияПени 	= ТекПериод;										
							НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
							
							НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки;
							НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
							НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
							НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
							НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
							//НСтр.СтавкаРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;							
							НСтр.СтавкаРефинансирования = ЗначениеСтавкиРефинансирования;							
							//Если Не Мораторий Тогда
								НСтр.Сумма 					= СуммаПени;
							//Иначе
							//	НСтр.Сумма 					= 0;
							//КонецЕсли;
							
							НСтр.Оплата	 				= Оплата;
							НСтр.НачалоПериода 			= НачалоПериода;
							НСтр.КонецПериода 			= ТекПериод - 1;
							
							СуммаПени 					= 0;								
							ДнейПросрочкиВПериоде 		= 0;
						КонецЕсли;
						
						Если Не НачисляемПеню И СтруктураКоэффициента = Неопределено И ВыборкаДетальныеЗаписи.ПериодНачало = ПериодНачисления Тогда 
							НСтр						= НовНабор.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							//НСтр.Период					= КонецПериода - 1;
							НСтр.Период					= ДокументОбъект.Дата; 
							НСтр.Организация			= Организация;
							НСтр.Район					= Район;
							НСтр.МКД					= МКД;
							НСтр.ПериодРасчета			= ПериодНачисления;
							НСтр.ДатаНачисленияПени 	= Дата(1,1,1) ;				
							НСтр.ДатаНачалаНачисленияПени = Дата(1,1,1);						
							НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки;
							НСтр.КоэффициентЧислитель 	= 0;
							НСтр.КоэффициентЗнаменатель = 0;
							НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
							НСтр.ДнейПросрочки 			= 0;
							НСтр.СтавкаРефинансирования = 0;							
							НСтр.Сумма	 				= 0;
							НСтр.Оплата	 				= 0;
							НСтр.НачалоПериода 			= НачалоПериода;
							НСтр.КонецПериода 			= ТекПериод - 1;
											
						КонецЕсли;
						
						НачалоПериода 	= ТекПериод;
						Оплата 			= ВыборкаДетальныеЗаписи.Оплата;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		
	КонецЦикла;
	
	// Проверка изменения настроек в периоде. При условии, что "РасчетПоТекущейСтавке" = Истина
	Если РасчетПоТекущейСтавке Тогда
		СнятьНачислениеПени(НовНабор, Организация, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП-1, ПериодНачисления, МКД, Район);
		ДоначислитьСуммыПени(НовНабор, Организация, ПериодНачисления,Район, МКД, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП, ГлубинаОтсрочки, КрайнийСрокОплаты, НачалоУчетаДолга, НачалоРасчетаПени);
	КонецЕсли;
	
	
	Если Не НовНабор = Неопределено Тогда 
		НаборЗаписейНачислений = НовНабор.Выгрузить();
		НаборНачислениеПени.Загрузить(НаборЗаписейНачислений);	
		Если Не НаборНачислениеПени = Неопределено и Не НаборНачислениеПени.Количество() = 0 Тогда
			НаборНачислениеПени.Записать();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	//Абонент = Неопределено;
	//
	//ПараметрыОперацииВЗ = Новый Структура("Организация,ПериодНачисления,Район,МКД,Абонент",Организация,ПериодНачисления,Район,МКД, Абонент);
	//энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(ПараметрыОперацииВЗ);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СменаСтавкиВПериоде(Организация, НП, КП)
	
	Результат = Новый Структура();
	Результат.Вставить("ЕстьСмена", Ложь);
	Результат.Вставить("Период", Неопределено);
	Результат.Вставить("Коэффициент", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтавкиРефинансирования.Период КАК Период,
		|	энргСтавкиРефинансирования.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансирования
		|ГДЕ
		|	энргСтавкиРефинансирования.Организация = &Организация
		|	И энргСтавкиРефинансирования.Период МЕЖДУ &НП И &КП";
	
	Запрос.УстановитьПараметр("КП", КП);
	Запрос.УстановитьПараметр("НП", НП);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Результат.ЕстьСмена = Истина;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СнятьНачислениеПени(Набор,Организация, НачалоПериода, КонецПериода, ПериодНачисления, МКД = Неопределено, Район)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтавкиРефинансированияСрезПоследних.Период КАК ПериодСтавкиДо,
		|	энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация,
		|	ВложенныйЗапрос.Период КАК ПериодСтавкиС
		|ПОМЕСТИТЬ ИзменениеСтавкиВТекущемПериоде
		|ИЗ
		|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК энргСтавкиРефинансированияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(энргСтавкиРефинансированияСрезПоследних.Период) КАК Период,
		|			энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация
		|		ИЗ
		|			РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансированияСрезПоследних
		|		ГДЕ
		|			энргСтавкиРефинансированияСрезПоследних.Период < &НачалоПериода
		|		
		|		СГРУППИРОВАТЬ ПО
		|			энргСтавкиРефинансированияСрезПоследних.Организация) КАК ВложенныйЗапрос
		|		ПО энргСтавкиРефинансированияСрезПоследних.Организация = ВложенныйЗапрос.Организация
		|ГДЕ
		|	энргСтавкиРефинансированияСрезПоследних.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСтавкиРефинансированияСрезПоследних.Период КАК ПериодСтавкиДо,
		|	энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация,
		|	ВложенныйЗапрос.Период КАК ПериодСтавкиС
		|ПОМЕСТИТЬ ИзменениеНастроекШкалВТекущемПериоде
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(энргСтавкиРефинансированияСрезПоследних.Период) КАК Период,
		|		энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация
		|	ИЗ
		|		РегистрСведений.энргНастройкаРасчетаПени КАК энргСтавкиРефинансированияСрезПоследних
		|	ГДЕ
		|		энргСтавкиРефинансированияСрезПоследних.Период < &НачалоПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		энргСтавкиРефинансированияСрезПоследних.Организация) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаРасчетаПени.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК энргСтавкиРефинансированияСрезПоследних
		|		ПО ВложенныйЗапрос.Организация = энргСтавкиРефинансированияСрезПоследних.Организация
		|ГДЕ
		|	энргСтавкиРефинансированияСрезПоследних.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзменениеСтавкиВТекущемПериоде.ПериодСтавкиДо КАК ПериодСтавкиДо,
		|	ИзменениеСтавкиВТекущемПериоде.Организация КАК Организация,
		|	ИзменениеСтавкиВТекущемПериоде.ПериодСтавкиС КАК ПериодСтавкиС
		|ПОМЕСТИТЬ ПериодыИзмененияНастроек
		|ИЗ
		|	ИзменениеСтавкиВТекущемПериоде КАК ИзменениеСтавкиВТекущемПериоде
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеНастроекШкалВТекущемПериоде.ПериодСтавкиДо,
		|	ИзменениеНастроекШкалВТекущемПериоде.Организация,
		|	ИзменениеНастроекШкалВТекущемПериоде.ПериодСтавкиС
		|ИЗ
		|	ИзменениеНастроекШкалВТекущемПериоде КАК ИзменениеНастроекШкалВТекущемПериоде
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПериодыИзмененияНастроек.ПериодСтавкиДо) КАК ПериодСтавкиДо,
		|	ПериодыИзмененияНастроек.Организация КАК Организация,
		|	МИНИМУМ(ПериодыИзмененияНастроек.ПериодСтавкиС) КАК ПериодСтавкиС
		|ПОМЕСТИТЬ ВТ_ПериодМинМакс
		|ИЗ
		|	ПериодыИзмененияНастроек КАК ПериодыИзмененияНастроек
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыИзмененияНастроек.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоПениОбороты.Организация КАК Организация,
		|	энргВзаиморасчетыПоПениОбороты.Район КАК Район,
		|	энргВзаиморасчетыПоПениОбороты.МКД КАК МКД,
		|	энргВзаиморасчетыПоПениОбороты.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоПениОбороты.Услуга КАК Услуга,
		|	энргВзаиморасчетыПоПениОбороты.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(-энргВзаиморасчетыПоПениОбороты.СуммаОстаток) КАК СУММА
		|ИЗ
		|	ВТ_ПериодМинМакс КАК ИзменениеСтавкиВТекущемПериоде
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
		|				,
		|				Организация = &Организация
		|					И МКД = &МКД
		|					И Район = &Район) КАК энргВзаиморасчетыПоПениОбороты
		|		ПО ИзменениеСтавкиВТекущемПериоде.Организация = энргВзаиморасчетыПоПениОбороты.Организация
		|			И (энргВзаиморасчетыПоПениОбороты.ПериодРасчета МЕЖДУ ИзменениеСтавкиВТекущемПериоде.ПериодСтавкиС И ИзменениеСтавкиВТекущемПериоде.ПериодСтавкиДо)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоПениОбороты.Организация,
		|	энргВзаиморасчетыПоПениОбороты.Район,
		|	энргВзаиморасчетыПоПениОбороты.МКД,
		|	энргВзаиморасчетыПоПениОбороты.Абонент,
		|	энргВзаиморасчетыПоПениОбороты.Услуга,
		|	энргВзаиморасчетыПоПениОбороты.ПериодНачисления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Абонент,
		|	ПериодНачисления";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	Если ЗначениеЗаполнено(МКД) Тогда 
		Запрос.УстановитьПараметр("МКД", МКД);
	иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И МКД = &МКД", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрСнятие = Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрСнятие, ВыборкаДетальныеЗаписи);
		СтрСнятие.ПериодРасчета = ПериодНачисления;
		СтрСнятие.Период = КонецПериода;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ДоначислитьСуммыПени(Набор,Организация, ПериодНачисления, Район, МКД = Неопределено, НачалоПериода, КонецПериода, ГлубинаОтсрочки,КрайнийСрокОплаты,НачалоУчетаДолга,НачалоРасчетаПени)
	
	БылоИзменениеСтавки = Ложь;
	БылоИзменениеШкалы = Ложь;
	МаксЗначение = 0;
	МинЗначение = 0;
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргСтавкиРефинансированияСрезПоследних.Период КАК ПериодСтавкиДо,
	|	энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация,
	|	ВложенныйЗапрос.Период КАК ПериодСтавкиС,
	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент КАК Коэффициент,
	|	ВложенныйЗапрос.Коэффициент КАК КоэффициентДо
	|ПОМЕСТИТЬ ИзменениеСтавкиВТекущемПериоде
	|ИЗ
	|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК энргСтавкиРефинансированияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(энргСтавкиРефинансированияСрезПоследних.Период) КАК Период,
	|			энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация,
	|			МАКСИМУМ(энргСтавкиРефинансированияСрезПоследних.Коэффициент) КАК Коэффициент
	|		ИЗ
	|			РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансированияСрезПоследних
	|		ГДЕ
	|			энргСтавкиРефинансированияСрезПоследних.Период < &НачалоПериода
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргСтавкиРефинансированияСрезПоследних.Организация) КАК ВложенныйЗапрос
	|		ПО энргСтавкиРефинансированияСрезПоследних.Организация = ВложенныйЗапрос.Организация
	|ГДЕ
	|	энргСтавкиРефинансированияСрезПоследних.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Выполнить();
	ТЗ_ИзменениеСтавки = МВТ.Таблицы["ИзменениеСтавкиВТекущемПериоде"].ПолучитьДанные().Выгрузить();
	Если НЕ ТЗ_ИзменениеСтавки.Количество() = 0 Тогда 
		БылоИзменениеСтавки = Истина;
		нРез = МВТ.Таблицы["ИзменениеСтавкиВТекущемПериоде"].ПолучитьДанные();
		Выборка  									= нРез.Выбрать();
		Выборка.Следующий();
		КоэффициентРасчета = Выборка.Коэффициент;
	иначе
		нСтавкаРасчета 					= РегистрыСведений.энргСтавкиРефинансирования.СрезПоследних(НачалоПериода-1, Новый Структура("Организация", Организация));	
		КоэффициентРасчета				= нСтавкаРасчета[0].Коэффициент;
		
	КонецЕсли;
	


	// проверяем изменение шкалы в текущем периоде 
	Запрос = Новый Запрос;
 	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	энргСтавкиРефинансированияСрезПоследних.Период КАК ПериодСтавкиДо,
	|	энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация,
	|	ВложенныйЗапрос.Период КАК ПериодСтавкиС,
	|	энргСтавкиРефинансированияСрезПоследних.НастройкаРасчета КАК НастройкаРасчета
	|ПОМЕСТИТЬ ИзменениеНастроекШкалВТекущемПериоде
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(энргСтавкиРефинансированияСрезПоследних.Период) КАК Период,
	|		энргСтавкиРефинансированияСрезПоследних.Организация КАК Организация
	|	ИЗ
	|		РегистрСведений.энргНастройкаРасчетаПени КАК энргСтавкиРефинансированияСрезПоследних
	|	ГДЕ
	|		энргСтавкиРефинансированияСрезПоследних.Период < &НачалоПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргСтавкиРефинансированияСрезПоследних.Организация) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаРасчетаПени.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК энргСтавкиРефинансированияСрезПоследних
	|		ПО ВложенныйЗапрос.Организация = энргСтавкиРефинансированияСрезПоследних.Организация
	|ГДЕ
	|	энргСтавкиРефинансированияСрезПоследних.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Организация);				  
	
 
	Результат  								= Запрос.Выполнить();

	ТЗ_ИзменениеШкалы = МВТ.Таблицы["ИзменениеНастроекШкалВТекущемПериоде"].ПолучитьДанные().Выгрузить();
	резвыб = МВТ.Таблицы["ИзменениеНастроекШкалВТекущемПериоде"].ПолучитьДанные();
	Если НЕ ТЗ_ИзменениеШкалы.Количество() = 0 Тогда 
		БылоИзменениеШкалы = Истина;
		Выборка  									= резвыб.Выбрать();
		Выборка.Следующий();
				
		НастройкиРасчетаПени = Выборка.НастройкаРасчета.Получить();		
	иначе
		новНастройкиРасчета 					= РегистрыСведений.энргНастройкаРасчетаПени.СрезПоследних(НачалоПериода-1, Новый Структура("Организация", Организация));	
 		НастройкиРасчетаПени 					= новНастройкиРасчета[0].НастройкаРасчета.Получить();
		
	КонецЕсли;
	
	Соответствие = Новый Соответствие;
	РангКоэффициента = 1;
	Для каждого Строка Из НастройкиРасчетаПени Цикл
		Если Строка.До = 0 Тогда
			НСтр = Новый Структура;
			НСтр.Вставить("Числитель", Строка.Числитель);
			НСтр.Вставить("Знаменатель", Строка.Знаменатель);
			НСтр.Вставить("РангКоэффициента", РангКоэффициента);
			
			Соответствие.Вставить(Строка.До, НСтр);
		Иначе
			//МинЗначение = строка.От;
			Для Сч = Строка.От По Строка.До Цикл
				НСтр = Новый Структура;
				НСтр.Вставить("Числитель", Строка.Числитель);
				НСтр.Вставить("Знаменатель", Строка.Знаменатель);
				НСтр.Вставить("РангКоэффициента", РангКоэффициента);
				
				Соответствие.Вставить(Сч, НСтр);
				МаксЗначение = Макс(МаксЗначение, Сч);
			КонецЦикла;
		КонецЕсли;
		
		РангКоэффициента = РангКоэффициента + 1;
	КонецЦикла;

	
	// получаем периоды для переначисления
	Запрос = Новый Запрос;
 	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ИзменениеСтавкиВТекущемПериоде.ПериодСтавкиДо КАК ПериодСтавкиДо,
	              |	ИзменениеСтавкиВТекущемПериоде.Организация КАК Организация,
	              |	ИзменениеСтавкиВТекущемПериоде.ПериодСтавкиС КАК ПериодСтавкиС,
	              |	ИзменениеСтавкиВТекущемПериоде.Коэффициент КАК Коэффициент
	              |ПОМЕСТИТЬ ПериодыИзмененияНастроек
	              |ИЗ
	              |	ИзменениеСтавкиВТекущемПериоде КАК ИзменениеСтавкиВТекущемПериоде
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	ИзменениеНастроекШкалВТекущемПериоде.ПериодСтавкиДо,
	              |	ИзменениеНастроекШкалВТекущемПериоде.Организация,
	              |	ИзменениеНастроекШкалВТекущемПериоде.ПериодСтавкиС,
	              |	NULL
	              |ИЗ
	              |	ИзменениеНастроекШкалВТекущемПериоде КАК ИзменениеНастроекШкалВТекущемПериоде
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	МАКСИМУМ(ПериодыИзмененияНастроек.ПериодСтавкиДо) КАК ПериодСтавкиДо,
	              |	ПериодыИзмененияНастроек.Организация КАК Организация,
	              |	МИНИМУМ(ПериодыИзмененияНастроек.ПериодСтавкиС) КАК ПериодСтавкиС,
	              |	ЕСТЬNULL(ПериодыИзмененияНастроек.Коэффициент, 0) КАК Коэффициент
 	              |ИЗ
	              |	ПериодыИзмененияНастроек КАК ПериодыИзмененияНастроек
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ПериодыИзмененияНастроек.Организация,
	              |	ЕСТЬNULL(ПериодыИзмененияНастроек.Коэффициент, 0)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
 		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ПериодСтавкиС 	= Выборка.ПериодСтавкиС; 
	ПериодСтавкиДо 	= Выборка.ПериодСтавкиДо; 
	
	Пока ПериодСтавкиС < ПериодСтавкиДо Цикл 
		
		ГраницыПериодаНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район, ПериодСтавкиС,Ложь);
		// Настройки начисления пени.
		Запрос = Новый Запрос;
		Запрос.Текст = ВернутьТекстЗапросаНачисленияПениПереначисление();	
		
		Запрос.УстановитьПараметр("ГлубинаОтсрочки", 								ГлубинаОтсрочки);
		Запрос.УстановитьПараметр("КонецПериода", 									ГраницыПериодаНачисления.ЗавершениеОП);
		Запрос.УстановитьПараметр("КрайнийСрокОплаты", 								КрайнийСрокОплаты);
		Запрос.УстановитьПараметр("МКД", 											МКД);
		Запрос.УстановитьПараметр("НачалоПериода", 									ГраницыПериодаНачисления.НачалоОП);
		Запрос.УстановитьПараметр("Организация", 									Организация);
		Запрос.УстановитьПараметр("Район", 											Район);
		Запрос.УстановитьПараметр("НачалоУчетаДолга", 								НачалоУчетаДолга);
		Запрос.УстановитьПараметр("КоэффициентРасчета", 							КоэффициентРасчета);
		Запрос.УстановитьПараметр("КоэффициентРасчета", 							КоэффициентРасчета);
		Запрос.УстановитьПараметр("ЗавершениеОП", 									ГраницыПериодаНачисления.ЗавершениеОП-1);
		
		РезультатЗапроса = Запрос.Выполнить();		
		
		ВыборкаПериодНачисления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаПериодНачисления.Следующий() Цикл
			
			Если ПериодСтавкиС < НачалоРасчетаПени Или ПериодСтавкиС < НачалоУчетаДолга Тогда 
				Продолжить;
			КонецЕсли;
			
			
			ВыборкаУслуга = ВыборкаПериодНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаУслуга.Следующий() Цикл
				ВыборкаАбонент = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				Пока ВыборкаАбонент.Следующий() Цикл
					
					НачалоПериода 				= ВыборкаАбонент.ПериодНачало;
					Оплата 						= 0;
					ПериодНачалоДляРасчета 		= ВыборкаАбонент.ПериодНачало;
					ДнейНаДеньНачалаДляРасчета 	= ?(ВыборкаАбонент.ДнейНаДеньНачала = 0, -1, ВыборкаАбонент.ДнейНаДеньНачала);
					ТекПериод 					= ВыборкаАбонент.ПериодНачало;
					ВыборкаДетальныеЗаписи 		= ВыборкаАбонент.Выбрать();	
					СуммаПени 					= 0;
					ДнейПросрочкиВПериоде 		= 0;
					ДнейПросрочки 				= ВыборкаАбонент.ДнейНаДеньНачала;
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл				
						
						СуммаЗадолженности = ?(ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток = 0, ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток, ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток);
						КоэффициентЧислитель = 1;
						КоэффициентЗнаменатель = 1;
						ПредКоэффициентЧислитель = 1;
						ПредКоэффициентЗнаменатель = 1;
						РангКоэффициента = 0;
						ПредыдущийРанг 						= Неопределено;
						НачисляемПеню 						= Ложь;  						
						Пока ТекПериод < ВыборкаДетальныеЗаписи.Период Цикл
							ДнейПросрочки 					= ДнейПросрочки + 1;							
							НачисляемПеню 					= Ложь;
							ПараметрыРасчетаИзменены 		= Ложь;
							СтруктураКоэффициента 			= Соответствие.Получить(?(ДнейПросрочки>МаксЗначение,0,ДнейПросрочки));
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								ПараметрыРасчетаИзменены 	= НЕ КоэффициентЧислитель = СтруктураКоэффициента.Числитель ИЛИ НЕ КоэффициентЗнаменатель = СтруктураКоэффициента.Знаменатель ИЛИ НЕ РангКоэффициента = СтруктураКоэффициента.РангКоэффициента;  
								НачисляемПеню 				= Истина;								
							КонецЕсли;
							
							Если НачисляемПеню и ПараметрыРасчетаИзменены И ДнейПросрочкиВПериоде > 1 Тогда
								НСтр						= Набор.Добавить();
								ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
								НСтр.Организация			= Организация;
								НСтр.Район					= Район;
								НСтр.МКД					= МКД;
								НСтр.ПериодРасчета			= ПериодНачисления;
								НСтр.Период					 = ГраницыПериодаНачисления.ЗавершениеОП-1;
								НСтр.ДатаНачисленияПени 	= ?(ТекПериод -1 = ГраницыПериодаНачисления.ЗавершениеОП-1,ГраницыПериодаНачисления.ЗавершениеОП-1, ТекПериод) ;
								НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки-1;
								НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
								НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
								НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
								НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
								НСтр.СтавкаРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;
								НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
								НСтр.Сумма 					= СуммаПени;
								НСтр.Оплата	 				= Оплата;
								НСтр.НачалоПериода 			= НачалоПериода;
								НСтр.КонецПериода 			= ТекПериод;								
								
								СуммаПени 					= 0;								
								ДнейПросрочкиВПериоде 		= 0;
								НачалоПериода				= ТекПериод;
							КонецЕсли; 
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								КоэффициентЧислитель 		= СтруктураКоэффициента.Числитель;
								КоэффициентЗнаменатель 		= СтруктураКоэффициента.Знаменатель;
								РангКоэффициента 			= СтруктураКоэффициента.РангКоэффициента; 								
							КонецЕсли;
							
							Если НачисляемПеню Тогда
								ДнейПросрочкиВПериоде 		= ДнейПросрочкиВПериоде + 1;
								СтавкаРефинансированияДоля	= (ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования/100);
								СуммаПени 					= СуммаПени + СуммаЗадолженности *  (КоэффициентЧислитель / КоэффициентЗнаменатель) * СтавкаРефинансированияДоля; 
							КонецЕсли;
							
							ТекПериод 						= ТекПериод + 86400;							
						КонецЦикла;
						
						Если НачисляемПеню и СуммаПени > 0 Тогда
							НСтр						= Набор.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							НСтр.Период					= ГраницыПериодаНачисления.ЗавершениеОП-1;
							НСтр.Организация			= Организация;
							НСтр.Район					= Район;
							НСтр.МКД					= МКД;
							НСтр.ПериодРасчета			= ПериодНачисления;
							НСтр.ДатаНачисленияПени 	= ?(ТекПериод -1 = ГраницыПериодаНачисления.ЗавершениеОП-1,ГраницыПериодаНачисления.ЗавершениеОП-1, ТекПериод) ;
							НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки;
							НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
							НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
							НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
							НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
							НСтр.СтавкаРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;
							НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
							НСтр.Сумма 					= СуммаПени;
							НСтр.Оплата	 				= Оплата;
							НСтр.НачалоПериода 			= НачалоПериода;
							НСтр.КонецПериода 			= ТекПериод - 1;							
							
							СуммаПени 					= 0;								
							ДнейПросрочкиВПериоде 		= 0;
						КонецЕсли;
						
						НачалоПериода 	= ТекПериод;
						Оплата 			= ВыборкаДетальныеЗаписи.Оплата;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			
		КонецЦикла;
		
		ПериодСтавкиС = ДобавитьМесяц(ПериодСтавкиС,1);	
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСтавкиРефинансирования(НачалоОП, ЗавершениеОП, Организация, МВТ, РасчетПоТекущейСтавке)
	
	//// Ставки рефинансирования
	//Запрос  								= Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц 			= МВТ;
	//Если НЕ РасчетПоТекущейСтавке Тогда 
	//	
	//	Запрос.Текст 							=
	//	"ВЫБРАТЬ
	//	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент КАК Коэффициент,
	//	|	энргСтавкиРефинансированияСрезПоследних.Период КАК Период
	//	|ПОМЕСТИТЬ СтавкиРефинансированияНабор
	//	|ИЗ
	//	|	РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансированияСрезПоследних
	//	|ГДЕ
	//	|	энргСтавкиРефинансированияСрезПоследних.Организация = &Организация
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СтавкиРефинансированияНаборЛево.Период КАК ПериодС,
	//	|	СтавкиРефинансированияНаборЛево.Коэффициент КАК ЗначениеСтавкиРефинансирования,
	//	|	МИНИМУМ(ЕСТЬNULL(СтавкиРефинансированияНабор.Период, ВЫБОР
	//	|				КОГДА &ЗавершениеОП > ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СтавкиРефинансированияНаборЛево.Период, МЕСЯЦ), СЕКУНДА, 1)
	//	|					ТОГДА &ЗавершениеОП
	//	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СтавкиРефинансированияНаборЛево.Период, МЕСЯЦ), СЕКУНДА, 1)
	//	|			КОНЕЦ)) КАК ПериодПо
	//	|ПОМЕСТИТЬ ПериодДействияСтавокРефинансирования
	//	|ИЗ
	//	|	СтавкиРефинансированияНабор КАК СтавкиРефинансированияНаборЛево
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиРефинансированияНабор КАК СтавкиРефинансированияНабор
	//	|		ПО СтавкиРефинансированияНаборЛево.Период < СтавкиРефинансированияНабор.Период
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	СтавкиРефинансированияНаборЛево.Период,
	//	|	СтавкиРефинансированияНаборЛево.Коэффициент
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	МАКСИМУМ(ПериодДействияСтавокРефинансирования.ПериодС) КАК ПериодС,
	//	|	МАКСИМУМ(ПериодДействияСтавокРефинансирования.ЗначениеСтавкиРефинансирования) КАК ЗначениеСтавкиРефинансирования,
	//	|	МАКСИМУМ(ПериодДействияСтавокРефинансирования.ПериодПо) КАК ПериодПо
	//	|ПОМЕСТИТЬ СтавкиНаПериод
	//	|ИЗ
	//	|	ПериодДействияСтавокРефинансирования КАК ПериодДействияСтавокРефинансирования
	//	|ГДЕ
	//	|	&НачалоОП МЕЖДУ ПериодДействияСтавокРефинансирования.ПериодС И ПериодДействияСтавокРефинансирования.ПериодПо";

	//Иначе 
	//	Запрос.Текст 							=
	//	"ВЫБРАТЬ
	//	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент КАК Коэффициент,
	//	|	&НачалоОП КАК Период
	//	|ПОМЕСТИТЬ СтавкиРефинансированияНабор
	//	|ИЗ
	//	|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&НачалоОП, Организация = &Организация) КАК энргСтавкиРефинансированияСрезПоследних
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	энргСтавкиРефинансирования.Коэффициент,
	//	|	энргСтавкиРефинансирования.Период
	//	|ИЗ
	//	|	РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансирования
	//	|ГДЕ
	//	|	энргСтавкиРефинансирования.Период МЕЖДУ &НачалоОП И &ЗавершениеОП
	//	|	И энргСтавкиРефинансирования.Организация =&Организация
	//	|
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СтавкиРефинансированияНаборЛево.Период КАК ПериодС,
	//	|	СтавкиРефинансированияНаборЛево.Коэффициент КАК ЗначениеСтавкиРефинансирования,
	//	|	МИНИМУМ(ЕСТЬNULL(СтавкиРефинансированияНабор.Период,&ЗавершениеОП)) КАК ПериодПо
	//	|ПОМЕСТИТЬ СтавкиНаПериод
	//	|ИЗ
	//	|	СтавкиРефинансированияНабор КАК СтавкиРефинансированияНаборЛево
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиРефинансированияНабор КАК СтавкиРефинансированияНабор
	//	|		ПО СтавкиРефинансированияНаборЛево.Период < СтавкиРефинансированияНабор.Период
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	СтавкиРефинансированияНаборЛево.Период,
	//	|	СтавкиРефинансированияНаборЛево.Коэффициент";

	//КонецЕсли;
	
	// Ставки рефинансирования
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	энргСтавкиРефинансированияСрезПоследних.Коэффициент КАК Коэффициент,
		|	&НачалоОП КАК Период
		|ПОМЕСТИТЬ СтавкиРефинансированияНабор
		|ИЗ
		|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&НачалоОП, Организация = &Организация) КАК энргСтавкиРефинансированияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиРефинансированияНаборЛево.Период КАК ПериодС,
		|	СтавкиРефинансированияНаборЛево.Коэффициент КАК ЗначениеСтавкиРефинансирования,
		|	МИНИМУМ(ЕСТЬNULL(СтавкиРефинансированияНабор.Период, &ЗавершениеОП)) КАК ПериодПо
		|ПОМЕСТИТЬ СтавкиНаПериод
		|ИЗ
		|	СтавкиРефинансированияНабор КАК СтавкиРефинансированияНаборЛево
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиРефинансированияНабор КАК СтавкиРефинансированияНабор
		|		ПО СтавкиРефинансированияНаборЛево.Период < СтавкиРефинансированияНабор.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиРефинансированияНаборЛево.Период,
		|	СтавкиРефинансированияНаборЛево.Коэффициент";
	
	Запрос.УстановитьПараметр("НачалоОП", 		НачалоОП);
	Запрос.УстановитьПараметр("ЗавершениеОП", 	ЗавершениеОП);
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	Запрос.Выполнить(); 	
	
	Результат = МВТ.Таблицы["СтавкиРефинансированияНабор"].ПолучитьДанные();
	
	Возврат Результат; 	
	
КонецФункции

Процедура ОтменитьОперациюНачисленийПени(Организация,ПериодНачисления,Район,МКД)
	Запрос  		= Новый Запрос;
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргНачислениеПени.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргНачислениеПени КАК энргНачислениеПени
	|ГДЕ
	|	НЕ энргНачислениеПени.ПометкаУдаления
	|	И энргНачислениеПени.Район = &Район
	|	И энргНачислениеПени.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(энргНачислениеПени.Дата, МЕСЯЦ) = &ПериодНачисления
	|	И энргНачислениеПени.МКД = &Строение";
	
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("Район", 						Район);
    Запрос.УстановитьПараметр("Строение", 					МКД);
	Запрос.УстановитьПараметр("ПериодНачисления", 			ПериодНачисления);
		
	Результат	= Запрос.Выполнить();
	
	ВыборкаДокументыОтменить 					= Результат.Выбрать();
	Пока ВыборкаДокументыОтменить.Следующий() Цикл				
		ДокументОбъектОтменить					= ВыборкаДокументыОтменить.Ссылка.ПолучитьОбъект();
		ДокументОбъектОтменить.УстановитьПометкуУдаления(Истина);
	КонецЦикла;		
		
КонецПроцедуры

#Область ТекЗапросов_НачислениеПени

Функция ВернутьТекстЗапросаНачисленияПени(НеНачислятьПениПриОтсутствииДолгаНаКонецПериода) 
	Текст = "";
	
	Если НеНачислятьПениПриОтсутствииДолгаНаКонецПериода Тогда
		Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.МКД КАК МКД,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
		|	СУММА(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) КАК СуммаОстаток
		|ПОМЕСТИТЬ АбонентыСДолгамиНаКонецПериода
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД
		|				И ПериодНачисления >= &НачалоУчетаДолга) КАК энргВзаиморасчетыПоМесяцамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцамОстатки.Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.МКД,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга
		|
		|ИМЕЮЩИЕ
		|	СУММА(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) > 0" + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|"; 
		
	КонецЕсли;	
	
	Текст = Текст +  
	
	"ВЫБРАТЬ
	|	&Район КАК Район,
	|	НЕОПРЕДЕЛЕНО КАК МКД,
	|	НЕОПРЕДЕЛЕНО КАК Абонент,
	|	НЕОПРЕДЕЛЕНО КАК Услуга,
	|	НЕОПРЕДЕЛЕНО КАК ПериодНачисления,
	|	СтавкиРефинансирования.Период КАК Период,
	|	СтавкиРефинансирования.Коэффициент КАК ЗначениеСтавкиРефинансирования
	|ПОМЕСТИТЬ ДополнительныеПериоды
	|ИЗ
	|	РегистрСведений.энргСтавкиРефинансирования КАК СтавкиРефинансирования
	|ГДЕ
	|	СтавкиРефинансирования.Организация = &Организация
	|	И СтавкиРефинансирования.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.Организация КАК Организация,
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.Район КАК Район,
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиБезПени
	|ИЗ
	|	РегистрСведений.энргНастройкиРасчетаПениПоУслугам.СрезПоследних(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкиРасчетаПениПоУслугамСрезПоследних
	|ГДЕ
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.НеНачислятьПеню
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Район КАК Район,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.МКД КАК МКД,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период МЕЖДУ &НачалоПериода И &ЗавершениеОП
	|			ТОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период
	|		ИНАЧЕ энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период
	|	КОНЕЦ КАК Период,
	//|	ВЫБОР
	//|		КОГДА КОНЕЦПЕРИОДА(энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период, ДЕНЬ) = &ЗавершениеОП
	//|			ТОГДА 0
	//|		ИНАЧЕ энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаНачальныйОстаток
	//|	КОНЕЦ КАК СуммаНачальныйОстаток, 
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период, ДЕНЬ) = &ЗавершениеОП
	|				И энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Регистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток
	|		КОГДА КОНЕЦПЕРИОДА(энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период, ДЕНЬ) = &ЗавершениеОП
	|			ТОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток - энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаОборот
	|		ИНАЧЕ энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток
	|	КОНЕЦ КАК СуммаКонечныйОстаток,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Поставщик КАК Поставщик,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаРасход КАК Оплата
	|ПОМЕСТИТЬ ДанныеЗадолженностиОсновнойНаборПолный
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.ОстаткиИОбороты(
	|			,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПериодНачисления >= &НачалоУчетаДолга
	|				И НЕ Услуга В
	|						(ВЫБРАТЬ
	|							ВТ.Услуга
	|						ИЗ
	|							УслугиБезПени КАК ВТ)) КАК энргВзаиморасчетыПоМесяцамОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Организация КАК Организация,
	|	энргСостояниеЛССрезПоследних.Район КАК Район,
	|	энргСостояниеЛССрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_СостояниеЛС
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&НачалоПериода,
	|			(Район, Абонент) В
	|				(ВЫБРАТЬ
	|					ВТ.Район КАК Район,
	|					ВТ.Абонент КАК Абонент
	|				ИЗ
	|					ДанныеЗадолженностиОсновнойНаборПолный КАК ВТ)) КАК энргСостояниеЛССрезПоследних
	|ГДЕ
	|	энргСостояниеЛССрезПоследних.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛС.Район КАК Район,
	|	энргСостояниеЛС.Абонент КАК Абонент,
	|	энргСостояниеЛС.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ЗакрытыеЛС
	|ИЗ
	|	ВТ_СостояниеЛС КАК ВТ_СостояниеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеЛС КАК энргСостояниеЛС
	|		ПО ВТ_СостояниеЛС.Район = энргСостояниеЛС.Район
	|			И ВТ_СостояниеЛС.Абонент = энргСостояниеЛС.Абонент
	|			И (НЕ энргСостояниеЛС.Состояние)
	|			И (энргСостояниеЛС.Период >= &НачалоПериода)
	|			И (энргСостояниеЛС.Период <= &КонецПериода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженностиОсновнойНаборПолный.Район КАК Район,
	|	ДанныеЗадолженностиОсновнойНаборПолный.МКД КАК МКД,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Абонент КАК Абонент,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Услуга КАК Услуга,
	|	ДанныеЗадолженностиОсновнойНаборПолный.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Период КАК Период,
	|	ДанныеЗадолженностиОсновнойНаборПолный.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДанныеЗадолженностиОсновнойНаборПолный.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДанныеЗадолженностиОсновнойНаборПолный.СуммаОборот КАК СуммаОборот,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Поставщик КАК Поставщик,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Оплата КАК Оплата,
	|	ЕСТЬNULL(ВТ_ЗакрытыеЛС.Период, ДАТАВРЕМЯ(2150, 12, 31)) КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ ДанныеЗадолженностиОсновнойНабор
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНаборПолный КАК ДанныеЗадолженностиОсновнойНаборПолный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СостояниеЛС КАК ВТ_СостояниеЛС
	|		ПО ДанныеЗадолженностиОсновнойНаборПолный.Район = ВТ_СостояниеЛС.Район
	|			И ДанныеЗадолженностиОсновнойНаборПолный.Абонент = ВТ_СостояниеЛС.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗакрытыеЛС КАК ВТ_ЗакрытыеЛС
	|		ПО ДанныеЗадолженностиОсновнойНаборПолный.Район = ВТ_ЗакрытыеЛС.Район
	|			И ДанныеЗадолженностиОсновнойНаборПолный.Абонент = ВТ_ЗакрытыеЛС.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Период КАК Период,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Организация КАК Организация,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Район КАК Район,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.НеРассчитыватьПени КАК НеРассчитыватьПени
	|ПОМЕСТИТЬ ОстановкаРасчетаПениАбонентов
	|ИЗ
	|	РегистрСведений.энргОстановкаРасчетаПениАбонента.СрезПоследних(
	|			&КонецПериода,
	|			(Район, Абонент) В
	|					(ВЫБРАТЬ
	|						ДанныеЗадолженностиОсновнойНабор.Район КАК Район,
	|						ДанныеЗадолженностиОсновнойНабор.Абонент КАК Абонент
	|					ИЗ
	|						ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженностиОсновнойНабор)
	|				И Район = &район
	|				И НеРассчитыватьПени) КАК энргОстановкаРасчетаПениАбонентаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Период КАК Период,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Организация КАК Организация,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Район КАК Район,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.НеРассчитыватьПени КАК НеРассчитыватьПени
	|ПОМЕСТИТЬ ВосстановлениеРасчетаПениАбонентов
	|ИЗ
	|	РегистрСведений.энргОстановкаРасчетаПениАбонента.СрезПоследних(
	|			&КонецПериода,
	|			(Район, Абонент) В
	|					(ВЫБРАТЬ
	|						ДанныеЗадолженностиОсновнойНабор.Район КАК Район,
	|						ДанныеЗадолженностиОсновнойНабор.Абонент КАК Абонент
	|					ИЗ
	|						ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженностиОсновнойНабор)
	|				И Район = &район
	|				И НЕ НеРассчитыватьПени) КАК энргОстановкаРасчетаПениАбонентаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстановкаРасчетаПениАбонентов.Организация КАК Организация,
	|	ОстановкаРасчетаПениАбонентов.Район КАК Район,
	|	ОстановкаРасчетаПениАбонентов.Абонент КАК Абонент,
	|	НАЧАЛОПЕРИОДА(ОстановкаРасчетаПениАбонентов.Период, ДЕНЬ) КАК ПериодОстановкиРасчетаПени,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВосстановлениеРасчетаПениАбонентов.Период, ДЕНЬ), СЕКУНДА, -1), ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -1)) КАК ПериодВозобновленияРасчетаПени,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОстановкаРасчетаПениАбонентов.Период, ДЕНЬ), ЕСТЬNULL(НАЧАЛОПЕРИОДА(ВосстановлениеРасчетаПениАбонентов.Период, ДЕНЬ), &КонецПериода), ДЕНЬ) КАК КоличествоДнейИсключения,
	|	ВЫБОР
	|		КОГДА ВосстановлениеРасчетаПениАбонентов.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьВозобновление
	|ПОМЕСТИТЬ ПериодыОстановкиРасчетаПени
	|ИЗ
	|	ОстановкаРасчетаПениАбонентов КАК ОстановкаРасчетаПениАбонентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВосстановлениеРасчетаПениАбонентов КАК ВосстановлениеРасчетаПениАбонентов
	|		ПО ОстановкаРасчетаПениАбонентов.Организация = ВосстановлениеРасчетаПениАбонентов.Организация
	|			И ОстановкаРасчетаПениАбонентов.Район = ВосстановлениеРасчетаПениАбонентов.Район
	|			И ОстановкаРасчетаПениАбонентов.Абонент = ВосстановлениеРасчетаПениАбонентов.Абонент
	|			И ОстановкаРасчетаПениАбонентов.Период <= ВосстановлениеРасчетаПениАбонентов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.МКД КАК МКД,
	|	ДанныеЗадолженности.Абонент КАК Абонент,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	ДополнительныеПериоды.Период КАК Период,
	|	МАКСИМУМ(ДанныеЗадолженности.Период) КАК ПериодПредыдущейЗаписи,
	|	ДанныеЗадолженности.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ДанныеЗадолженностиДополнительныеПериоды
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДополнительныеПериоды КАК ДополнительныеПериоды
	|		ПО ДанныеЗадолженности.Район = ДополнительныеПериоды.Район
	|			И ДанныеЗадолженности.Период < ДополнительныеПериоды.Период
	|			И (ВЫБОР
	|				КОГДА ДополнительныеПериоды.МКД = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ДанныеЗадолженности.МКД = ДополнительныеПериоды.МКД
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ДополнительныеПериоды.Абонент = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ДанныеЗадолженности.Абонент = ДополнительныеПериоды.Абонент
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ДополнительныеПериоды.Услуга = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ДанныеЗадолженности.Услуга = ДополнительныеПериоды.Услуга
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ДополнительныеПериоды.ПериодНачисления = НЕОПРЕДЕЛЕНО
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ДанныеЗадолженности.ПериодНачисления = ДополнительныеПериоды.ПериодНачисления
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗадолженности.Район,
	|	ДанныеЗадолженности.МКД,
	|	ДанныеЗадолженности.Абонент,
	|	ДанныеЗадолженности.Услуга,
	|	ДанныеЗадолженности.ПериодНачисления,
	|	ДополнительныеПериоды.Период,
	|	ДанныеЗадолженности.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.МКД КАК МКД,
	|	ДанныеЗадолженности.Абонент КАК Абонент,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеЗадолженности.Период КАК Период,
	|	ДанныеЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДанныеЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДанныеЗадолженности.Поставщик КАК Поставщик,
	|	ДанныеЗадолженности.Оплата КАК Оплата,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ ДанныеЗадолженности
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район,
	|	ДанныеЗадолженности.МКД,
	|	ДанныеЗадолженности.Абонент,
	|	ДанныеЗадолженности.Услуга,
	|	ДанныеЗадолженности.ПериодНачисления,
	|	ДанныеЗадолженностиДополнительныеПериоды.Период,
	|	ДанныеЗадолженности.СуммаКонечныйОстаток,
	|	ДанныеЗадолженности.СуммаКонечныйОстаток,
	|	ДанныеЗадолженности.Поставщик,
	|	ДанныеЗадолженности.Оплата,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЗадолженностиДополнительныеПериоды КАК ДанныеЗадолженностиДополнительныеПериоды
	|		ПО ДанныеЗадолженности.Район = ДанныеЗадолженностиДополнительныеПериоды.Район
	|			И ДанныеЗадолженности.МКД = ДанныеЗадолженностиДополнительныеПериоды.МКД
	|			И ДанныеЗадолженности.Абонент = ДанныеЗадолженностиДополнительныеПериоды.Абонент
	|			И ДанныеЗадолженности.Услуга = ДанныеЗадолженностиДополнительныеПериоды.Услуга
	|			И ДанныеЗадолженности.ПериодНачисления = ДанныеЗадолженностиДополнительныеПериоды.ПериодНачисления
	|			И ДанныеЗадолженности.Период = ДанныеЗадолженностиДополнительныеПериоды.ПериодПредыдущейЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.МКД КАК МКД,
	|	ДанныеЗадолженности.Абонент КАК Абонент,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	МИНИМУМ(ДанныеЗадолженности.Период) КАК Период,
	|	ДанныеЗадолженности.Поставщик КАК Поставщик,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ ДатаНачала
	|ИЗ
	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗадолженности.Абонент,
	|	ДанныеЗадолженности.Услуга,
	|	ДанныеЗадолженности.ПериодНачисления,
	|	ДанныеЗадолженности.Район,
	|	ДанныеЗадолженности.МКД,
	|	ДанныеЗадолженности.Поставщик,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.МКД КАК МКД,
	|	ДанныеЗадолженности.Абонент КАК Абонент,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеЗадолженности.Период КАК Период,
	|	ДанныеЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДанныеЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачала.Период КАК НачальныйПериод,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ДатаНачала.Период, МЕСЯЦ), СЕКУНДА, 1), МЕСЯЦ, &ГлубинаОтсрочки), ДЕНЬ, &КрайнийСрокОплаты) КАК ДатаНачалаНачисленияПени,
	|	ДанныеЗадолженности.Поставщик КАК Поставщик,
	|	ДанныеЗадолженности.Оплата КАК Оплата,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ ДатаНачальногоПериода
	|ИЗ
	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачала КАК ДатаНачала
	|		ПО ДанныеЗадолженности.Район = ДатаНачала.Район
	|			И ДанныеЗадолженности.МКД = ДатаНачала.МКД
	|			И ДанныеЗадолженности.Абонент = ДатаНачала.Абонент
	|			И ДанныеЗадолженности.Услуга = ДатаНачала.Услуга
	|			И ДанныеЗадолженности.ПериодНачисления = ДатаНачала.ПериодНачисления"
	+ ?(НеНачислятьПениПриОтсутствииДолгаНаКонецПериода,
	"		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АбонентыСДолгамиНаКонецПериода КАК АбонентыСДолгамиНаКонецПериода
	|		ПО ДанныеЗадолженности.Район = АбонентыСДолгамиНаКонецПериода.Район
	|			И ДанныеЗадолженности.МКД = АбонентыСДолгамиНаКонецПериода.МКД
	|			И ДанныеЗадолженности.Абонент = АбонентыСДолгамиНаКонецПериода.Абонент
	|			И ДанныеЗадолженности.Услуга = АбонентыСДолгамиНаКонецПериода.Услуга", "")
	+ 
	"
	|ГДЕ
	|	ДанныеЗадолженности.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеЗадолженности.СуммаКонечныйОстаток >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(энргНачислениеПени.Ссылка) КАК Ссылка,
	|	энргНачислениеПени.Район КАК Район,
	|	энргНачислениеПени.МКД КАК МКД,
	|	энргНачислениеПени.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыНачисления
	|ИЗ
	|	Документ.энргНачислениеПени КАК энргНачислениеПени
	|ГДЕ
	|	энргНачислениеПени.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДляДокумента
	|	И энргНачислениеПени.Организация = &Организация
	|	И энргНачислениеПени.Район = &Район
	|	И энргНачислениеПени.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Район,
	|	энргНачислениеПени.МКД,
	|	энргНачислениеПени.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаНачальногоПериода.Район КАК Район,
	|	ДатаНачальногоПериода.МКД КАК МКД,
	|	ДатаНачальногоПериода.Абонент КАК Абонент,
	|	ДатаНачальногоПериода.Услуга КАК Услуга,
	|	ДатаНачальногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	ДатаНачальногоПериода.Период КАК Период,
	|	ДатаНачальногоПериода.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДатаНачальногоПериода.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачальногоПериода.НачальныйПериод КАК НачальныйПериод,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПениДо,
	|	ДатаНачальногоПериода.Поставщик КАК Поставщик,
	|	ДатаНачальногоПериода.Оплата КАК Оплата,
	|	ДатаНачальногоПериода.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ датыПериодаНов
	|ИЗ
	|	ДатаНачальногоПериода КАК ДатаНачальногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыОстановкиРасчетаПени КАК ПериодыОстановкиРасчетаПени
	|		ПО ДатаНачальногоПериода.Абонент = ПериодыОстановкиРасчетаПени.Абонент
	|			И ДатаНачальногоПериода.Район = ПериодыОстановкиРасчетаПени.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДокументыНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.энргНачислениеПени.ПустаяСсылка)) КАК ДокументНачисления,
	|	ДатаНачальногоПериода.Абонент КАК Абонент,
	|	ДатаНачальногоПериода.Услуга КАК Услуга,
	|	ДатаНачальногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	ДатаНачальногоПериода.Период КАК Период,
	|	ДатаНачальногоПериода.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДатаНачальногоПериода.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1), МЕСЯЦ)
	|					И НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
	|				ТОГДА &КонецПериода
	|			КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.Период, МЕСЯЦ)
	|				ТОГДА ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|			ИНАЧЕ &НачалоПериода
	|		КОНЕЦ, ДЕНЬ) - ЕСТЬNULL(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ДЕНЬ, 30), МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, МЕСЯЦ)
	|				ТОГДА РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, ДЕНЬ)
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) - ЕСТЬNULL(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, МЕСЯЦ)
	|				ТОГДА РАЗНОСТЬДАТ(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, ДЕНЬ)
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) + ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, МЕСЯЦ, -1), МЕСЯЦ)
	|				И ДатаНачальногоПериода.ДатаНачалаНачисленияПени < ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени
	|			ТОГДА РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, МЕСЯЦ)
	|				И ДатаНачальногоПериода.ДатаНачалаНачисленияПени > ДОБАВИТЬКДАТЕ(ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, ДЕНЬ, -30)
	|			ТОГДА РАЗНОСТЬДАТ(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДнейНаДеньНачала,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ДатаНачальногоПериода.Период, ДЕНЬ) КАК ДнейПросрочкиСДатыНачалаНачисленийПени,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.Период, МЕСЯЦ)
	|			ТОГДА ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|		ИНАЧЕ &НачалоПериода
	|	КОНЕЦ КАК ПериодНачало,
	|	ДатаНачальногоПериода.НачальныйПериод КАК НачальныйПериод,
	|	ЕСТЬNULL(ПериодДействияСтавокРефинансирования.ЗначениеСтавкиРефинансирования, 0) КАК ЗначениеСтавкиРефинансирования,
	|	ДОБАВИТЬКДАТЕ(&ЗавершениеОП, СЕКУНДА, 1) КАК ДатаНачисленияПени,
	|	ДатаНачальногоПериода.Поставщик КАК Поставщик,
	|	ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени КАК ПериодОстановкиРасчетаПени,
	|	ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени КАК ПериодВозобновленияРасчетаПени,
	|	ДатаНачальногоПериода.Оплата КАК Оплата,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо КАК ДатаНачалаНачисленияПениДо,
	|	ПериодыОстановкиРасчетаПени.КоличествоДнейИсключения КАК КоличествоДнейИсключения,
	|	ДатаНачальногоПериода.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ИЗ
	|	датыПериодаНов КАК ДатаНачальногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачисления КАК ДокументыНачисления
	|		ПО ДатаНачальногоПериода.Район = ДокументыНачисления.Район
	|			И ДатаНачальногоПериода.МКД = ДокументыНачисления.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНаПериод КАК ПериодДействияСтавокРефинансирования
	|		ПО (ВЫБОР
	|				КОГДА НЕ &РасчетПоТекущейСтавке
	|					ТОГДА ПериодДействияСтавокРефинансирования.ПериодС < ДатаНачальногоПериода.Период
	|							И ДатаНачальногоПериода.Период <= ПериодДействияСтавокРефинансирования.ПериодПо
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДатаНачальногоПериода.Период = &КонецПериода
	|							ТОГДА ПериодДействияСтавокРефинансирования.ПериодПо = ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 1)
	|						ИНАЧЕ ПериодДействияСтавокРефинансирования.ПериодС < ДатаНачальногоПериода.Период
	|								И ДатаНачальногоПериода.Период <= ПериодДействияСтавокРефинансирования.ПериодПо
	|					КОНЕЦ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыОстановкиРасчетаПени КАК ПериодыОстановкиРасчетаПени
	|		ПО ДатаНачальногоПериода.Абонент = ПериодыОстановкиРасчетаПени.Абонент
	|			И ДатаНачальногоПериода.Район = ПериодыОстановкиРасчетаПени.Район
	|ГДЕ
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени < &КонецПериода
	|	И ДатаНачальногоПериода.Период >= ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|ИТОГИ
	|	МАКСИМУМ(ДнейНаДеньНачала),
	|	МАКСИМУМ(ПериодНачало)
	|ПО
	|	ДокументНачисления,
	|	ПериодНачисления,
	|	Услуга,
	|	Абонент";
	
	
	Возврат Текст;
	
КонецФункции

Функция ВернутьТекстЗапросаНачисленияПениПереначисление() 
	
	 Текст = 	"ВЫБРАТЬ
	         	|	&Район КАК Район,
	         	|	НЕОПРЕДЕЛЕНО КАК МКД,
	         	|	НЕОПРЕДЕЛЕНО КАК Абонент,
	         	|	НЕОПРЕДЕЛЕНО КАК Услуга,
	         	|	НЕОПРЕДЕЛЕНО КАК ПериодНачисления,
	         	|	СтавкиРефинансирования.Период КАК Период,
	         	|	СтавкиРефинансирования.Коэффициент КАК ЗначениеСтавкиРефинансирования
	         	|ПОМЕСТИТЬ ДополнительныеПериоды
	         	|ИЗ
	         	|	РегистрСведений.энргСтавкиРефинансирования КАК СтавкиРефинансирования
	         	|ГДЕ
	         	|	СтавкиРефинансирования.Организация = &Организация
	         	|	И СтавкиРефинансирования.Период МЕЖДУ &НачалоПериода И &КонецПериода
	         	|;
	         	|
	         	|////////////////////////////////////////////////////////////////////////////////
	         	|ВЫБРАТЬ
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Район КАК Район,
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.МКД КАК МКД,
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Абонент КАК Абонент,
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Услуга КАК Услуга,
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период КАК Период,
	         	|	ВЫБОР
	         	|		КОГДА КОНЕЦПЕРИОДА(энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период, ДЕНЬ) = &ЗавершениеОП
	         	|			ТОГДА 0
	         	|		ИНАЧЕ энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаНачальныйОстаток
	         	|	КОНЕЦ КАК СуммаНачальныйОстаток,
	         	|	ВЫБОР
	         	|		КОГДА КОНЕЦПЕРИОДА(энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период, ДЕНЬ) = &ЗавершениеОП
	         	|			ТОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток - энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаОборот
	         	|		ИНАЧЕ энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток
	         	|	КОНЕЦ КАК СуммаКонечныйОстаток,
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Поставщик КАК Поставщик,
	         	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаРасход КАК Оплата
	         	|ПОМЕСТИТЬ ДанныеЗадолженностиОсновнойНабор
	         	|ИЗ
	         	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.ОстаткиИОбороты(
	         	|			,
	         	|			&КонецПериода,
	         	|			День,
	         	|			,
	         	|			Организация = &Организация
	         	|				И Район = &Район
	         	|				И МКД = &МКД
	         	|				И ПериодНачисления >= &НачалоУчетаДолга) КАК энргВзаиморасчетыПоМесяцамОстаткиИОбороты
	         	|;
	         	|
	         	|////////////////////////////////////////////////////////////////////////////////
	         	|ВЫБРАТЬ
	         	|	ДанныеЗадолженности.Район КАК Район,
	         	|	ДанныеЗадолженности.МКД КАК МКД,
	         	|	ДанныеЗадолженности.Абонент КАК Абонент,
	         	|	ДанныеЗадолженности.Услуга КАК Услуга,
	         	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	         	|	ДополнительныеПериоды.Период КАК Период,
	         	|	МАКСИМУМ(ДанныеЗадолженности.Период) КАК ПериодПредыдущейЗаписи,
	         	|	ДанныеЗадолженности.Поставщик КАК Поставщик
	         	|ПОМЕСТИТЬ ДанныеЗадолженностиДополнительныеПериоды
	         	|ИЗ
	         	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	         	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДополнительныеПериоды КАК ДополнительныеПериоды
	         	|		ПО ДанныеЗадолженности.Район = ДополнительныеПериоды.Район
	         	|			И ДанныеЗадолженности.Период < ДополнительныеПериоды.Период
	         	|			И (ВЫБОР
	         	|				КОГДА ДополнительныеПериоды.МКД = НЕОПРЕДЕЛЕНО
	         	|					ТОГДА ИСТИНА
	         	|				ИНАЧЕ ДанныеЗадолженности.МКД = ДополнительныеПериоды.МКД
	         	|			КОНЕЦ)
	         	|			И (ВЫБОР
	         	|				КОГДА ДополнительныеПериоды.Абонент = НЕОПРЕДЕЛЕНО
	         	|					ТОГДА ИСТИНА
	         	|				ИНАЧЕ ДанныеЗадолженности.Абонент = ДополнительныеПериоды.Абонент
	         	|			КОНЕЦ)
	         	|			И (ВЫБОР
	         	|				КОГДА ДополнительныеПериоды.Услуга = НЕОПРЕДЕЛЕНО
	         	|					ТОГДА ИСТИНА
	         	|				ИНАЧЕ ДанныеЗадолженности.Услуга = ДополнительныеПериоды.Услуга
	         	|			КОНЕЦ)
	         	|			И (ВЫБОР
	         	|				КОГДА ДополнительныеПериоды.ПериодНачисления = НЕОПРЕДЕЛЕНО
	         	|					ТОГДА ИСТИНА
	         	|				ИНАЧЕ ДанныеЗадолженности.ПериодНачисления = ДополнительныеПериоды.ПериодНачисления
	         	|			КОНЕЦ)
	         	|
	         	|СГРУППИРОВАТЬ ПО
	         	|	ДанныеЗадолженности.Район,
	         	|	ДанныеЗадолженности.МКД,
	         	|	ДанныеЗадолженности.Абонент,
	         	|	ДанныеЗадолженности.Услуга,
	         	|	ДанныеЗадолженности.ПериодНачисления,
	         	|	ДополнительныеПериоды.Период,
	         	|	ДанныеЗадолженности.Поставщик
	         	|;
	         	|
	         	|////////////////////////////////////////////////////////////////////////////////
	         	|ВЫБРАТЬ
	         	|	ДанныеЗадолженности.Район КАК Район,
	         	|	ДанныеЗадолженности.МКД КАК МКД,
	         	|	ДанныеЗадолженности.Абонент КАК Абонент,
	         	|	ДанныеЗадолженности.Услуга КАК Услуга,
	         	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	         	|	ДанныеЗадолженности.Период КАК Период,
	         	|	ДанныеЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	         	|	ДанныеЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	         	|	ДанныеЗадолженности.Поставщик КАК Поставщик,
	         	|	ДанныеЗадолженности.Оплата КАК Оплата
	         	|ПОМЕСТИТЬ ДанныеЗадолженности
	         	|ИЗ
	         	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	         	|
	         	|ОБЪЕДИНИТЬ ВСЕ
	         	|
	         	|ВЫБРАТЬ
	         	|	ДанныеЗадолженности.Район,
	         	|	ДанныеЗадолженности.МКД,
	         	|	ДанныеЗадолженности.Абонент,
	         	|	ДанныеЗадолженности.Услуга,
	         	|	ДанныеЗадолженности.ПериодНачисления,
	         	|	ДанныеЗадолженностиДополнительныеПериоды.Период,
	         	|	ДанныеЗадолженности.СуммаКонечныйОстаток,
	         	|	ДанныеЗадолженности.СуммаКонечныйОстаток,
	         	|	ДанныеЗадолженности.Поставщик,
	         	|	ДанныеЗадолженности.Оплата
	         	|ИЗ
	         	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	         	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЗадолженностиДополнительныеПериоды КАК ДанныеЗадолженностиДополнительныеПериоды
	         	|		ПО ДанныеЗадолженности.Район = ДанныеЗадолженностиДополнительныеПериоды.Район
	         	|			И ДанныеЗадолженности.МКД = ДанныеЗадолженностиДополнительныеПериоды.МКД
	         	|			И ДанныеЗадолженности.Абонент = ДанныеЗадолженностиДополнительныеПериоды.Абонент
	         	|			И ДанныеЗадолженности.Услуга = ДанныеЗадолженностиДополнительныеПериоды.Услуга
	         	|			И ДанныеЗадолженности.ПериодНачисления = ДанныеЗадолженностиДополнительныеПериоды.ПериодНачисления
	         	|			И ДанныеЗадолженности.Период = ДанныеЗадолженностиДополнительныеПериоды.ПериодПредыдущейЗаписи
	         	|;
	         	|
	         	|////////////////////////////////////////////////////////////////////////////////
	         	|ВЫБРАТЬ
	         	|	ДанныеЗадолженности.Район КАК Район,
	         	|	ДанныеЗадолженности.МКД КАК МКД,
	         	|	ДанныеЗадолженности.Абонент КАК Абонент,
	         	|	ДанныеЗадолженности.Услуга КАК Услуга,
	         	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	         	|	МИНИМУМ(ДанныеЗадолженности.Период) КАК Период,
	         	|	ДанныеЗадолженности.Поставщик КАК Поставщик
	         	|ПОМЕСТИТЬ ДатаНачала
	         	|ИЗ
	         	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	         	|
	         	|СГРУППИРОВАТЬ ПО
	         	|	ДанныеЗадолженности.Абонент,
	         	|	ДанныеЗадолженности.Услуга,
	         	|	ДанныеЗадолженности.ПериодНачисления,
	         	|	ДанныеЗадолженности.Район,
	         	|	ДанныеЗадолженности.МКД,
	         	|	ДанныеЗадолженности.Поставщик
	         	|;
	         	|
	         	|////////////////////////////////////////////////////////////////////////////////
	         	|ВЫБРАТЬ
	         	|	ДанныеЗадолженности.Район КАК Район,
	         	|	ДанныеЗадолженности.МКД КАК МКД,
	         	|	ДанныеЗадолженности.Абонент КАК Абонент,
	         	|	ДанныеЗадолженности.Услуга КАК Услуга,
	         	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	         	|	ДанныеЗадолженности.Период КАК Период,
	         	|	ДанныеЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	         	|	ДанныеЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	         	|	ДатаНачала.Период КАК НачальныйПериод,
	         	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ДатаНачала.Период, МЕСЯЦ), СЕКУНДА, 1), МЕСЯЦ, &ГлубинаОтсрочки), ДЕНЬ, &КрайнийСрокОплаты) КАК ДатаНачалаНачисленияПени,
	         	|	ДанныеЗадолженности.Поставщик КАК Поставщик,
	         	|	ДанныеЗадолженности.Оплата КАК Оплата
	         	|ПОМЕСТИТЬ ДатаНачальногоПериода
	         	|ИЗ
	         	|	ДанныеЗадолженности КАК ДанныеЗадолженности
	         	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачала КАК ДатаНачала
	         	|		ПО ДанныеЗадолженности.Район = ДатаНачала.Район
	         	|			И ДанныеЗадолженности.МКД = ДатаНачала.МКД
	         	|			И ДанныеЗадолженности.Абонент = ДатаНачала.Абонент
	         	|			И ДанныеЗадолженности.Услуга = ДатаНачала.Услуга
	         	|			И ДанныеЗадолженности.ПериодНачисления = ДатаНачала.ПериодНачисления
	         	|ГДЕ
	         	|	ДанныеЗадолженности.Период МЕЖДУ &НачалоПериода И &КонецПериода
	         	|	И ДанныеЗадолженности.СуммаКонечныйОстаток >= 0
	         	|;
	         	|
	         	|////////////////////////////////////////////////////////////////////////////////
	         	|ВЫБРАТЬ
	         	|	МАКСИМУМ(энргНачислениеПени.Ссылка) КАК Ссылка,
	         	|	энргНачислениеПени.Район КАК Район,
	         	|	энргНачислениеПени.МКД КАК МКД,
	         	|	энргНачислениеПени.ПометкаУдаления КАК ПометкаУдаления
	         	|ПОМЕСТИТЬ ДокументыНачисления
	         	|ИЗ
	         	|	Документ.энргНачислениеПени КАК энргНачислениеПени
	         	|ГДЕ
	         	|	энргНачислениеПени.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	         	|	И энргНачислениеПени.Организация = &Организация
	         	|	И энргНачислениеПени.Район = &Район
	         	|	И энргНачислениеПени.МКД = &МКД
	         	|
	         	|СГРУППИРОВАТЬ ПО
	         	|	энргНачислениеПени.Район,
	         	|	энргНачислениеПени.МКД,
	         	|	энргНачислениеПени.ПометкаУдаления
	         	|;
	         	|
	         	|////////////////////////////////////////////////////////////////////////////////
	         	|ВЫБРАТЬ
	         	|	ДатаНачальногоПериода.Абонент КАК Абонент,
	         	|	ДатаНачальногоПериода.Услуга КАК Услуга,
	         	|	ДатаНачальногоПериода.ПериодНачисления КАК ПериодНачисления,
	         	|	ДатаНачальногоПериода.Период КАК Период,
	         	|	ДатаНачальногоПериода.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	         	|	ДатаНачальногоПериода.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	         	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	         	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ВЫБОР
	         	|			КОГДА МЕСЯЦ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени) = МЕСЯЦ(ДатаНачальногоПериода.Период)
	         	|				ТОГДА ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	         	|			ИНАЧЕ &НачалоПериода
	         	|		КОНЕЦ, ДЕНЬ) КАК ДнейНаДеньНачала,
	         	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ДатаНачальногоПериода.Период, ДЕНЬ) КАК ДнейПросрочкиСДатыНачалаНачисленийПени,
	         	|	ВЫБОР
	         	|		КОГДА МЕСЯЦ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени) = МЕСЯЦ(ДатаНачальногоПериода.Период)
	         	|			ТОГДА ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	         	|		ИНАЧЕ &НачалоПериода
	         	|	КОНЕЦ КАК ПериодНачало,
	         	|	ДатаНачальногоПериода.НачальныйПериод КАК НачальныйПериод,
	         	|	&КоэффициентРасчета КАК ЗначениеСтавкиРефинансирования,
	         	|	&ЗавершениеОП + 1 КАК ДатаНачисленияПени,
	         	|	ДатаНачальногоПериода.Поставщик КАК Поставщик,
	         	|	ДатаНачальногоПериода.Оплата КАК Оплата
	         	|ИЗ
	         	|	ДатаНачальногоПериода КАК ДатаНачальногоПериода
	         	|ГДЕ
	         	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени < &КонецПериода
	         	|	И ДатаНачальногоПериода.Период >= ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	         	|ИТОГИ
	         	|	МАКСИМУМ(ДнейНаДеньНачала),
	         	|	МАКСИМУМ(ПериодНачало)
	         	|ПО
	         	|	ПериодНачисления,
	         	|	Услуга,
	         	|	Абонент";
	 
	 Возврат Текст;
	
КонецФункции

#КонецОбласти

Процедура ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок)
	
	ЗавершенныеЗадания = Новый Массив;
	Пока Истина Цикл
		
		//Если ЗавершенныеЗадания.Количество() = ДлительныеОперацииСписок.Количество() Тогда 
		//	Прервать;
		//КонецЕсли;
		
		
		Для Каждого ДлительнаяОперация из ДлительныеОперацииСписок Цикл 
			
			Если НЕ ЗавершенныеЗадания.Найти(ДлительнаяОперация) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			
			Выполнено = Ложь;
			Попытка
				
				Выполнено = ДлительныеОперации.ЗаданиеВыполнено(ДлительнаяОперация.ИдентификаторЗадания);	
				
			Исключение
				// Завершенные аварийно задания помещаем как выполненные
				Выполнено = Истина;
			КонецПопытки;
			
			Если Выполнено Тогда 
				ЗавершенныеЗадания.Добавить(ДлительнаяОперация);
			КонецЕсли; 			
			
		КонецЦикла;
		
		Если ЗавершенныеЗадания.Количество() = ДлительныеОперацииСписок.Количество() Тогда 
			Прервать;
		КонецЕсли;
		
		ОбменДаннымиСервер.Пауза(3);
		
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти