
#Область ПрограммныйИнтерфейс

// Процедура - Отложенные движения документов начисления НП
//
// Параметры:
//  Параметры					 - Структура (Организация - СправочникСсылка.Организации, Район - СправочникСсылка.энргЗоныОтвественности, ПериодНачисления - Дата, МКД_НП - СправочникСсылка.энргСтроения, ИсключаяОтдельностоящие - Булево) 
//  мОбъектыРасчета				 - Массив - Элементы с типом СправочникСсылка.бестОбъектыРасчета 
//  Перерасчет					 - Булево 
//  БратьДанныеИзСтандартныхРС	 - Булево 
//
Процедура ОтложенныеДвиженияДокументовНачисленияНП(Параметры, мОбъектыРасчета = Неопределено, Перерасчет = Ложь, БратьДанныеИзСтандартныхРС = Ложь) Экспорт
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ОтложенныеДвиженияДокументовНачисленияНП(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД_НП, Параметры.ИсключаяОтдельностоящие, Параметры.СбрасыватьСостояниеПоследовательности, мОбъектыРасчета,  Перерасчет, БратьДанныеИзСтандартныхРС);
	
КонецПроцедуры

// Процедура - Выполнить регламетные операции НП
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации 
//  ПериодНачисления - Дата 
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//
Процедура ВыполнитьРегламетныеОперацииНП(Организация, ПериодНачисления,Район) Экспорт  	
	
	Инструменты  		= энргФабрикаИнструментовНачисления.бестРаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВыполнитьРегламетныеОперацииНП(Организация, ПериодНачисления,Район);
	
КонецПроцедуры

// Процедура - Восстановить последовательность по НП
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации 
//  ПериодНачисления - Дата 
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета 
//
Процедура ВосстановитьПоследовательностьПоНП(Организация, ПериодНачисления,Район,ОбъектРасчета) Экспорт  
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьПоНП(Организация, ПериодНачисления,Район,ОбъектРасчета);

КонецПроцедуры

// Процедура - Восстановить последовательность стабильные периоды НП
//
// Параметры:
//  Параметры		 - См выше 
//  мОбъектыРасчета	 - Массив - Элементы с типом СправочникСсылка.бестОбъектыРасчета
//  МВТ				 - МенеджерВременныхТаблиц
//  Перерасчет		 - Булево 
//
Процедура ВосстановитьПоследовательностьСтабильныеПериодыНП(Параметры, мОбъектыРасчета = Неопределено, МВТ = Неопределено, Перерасчет = Ложь) Экспорт 
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьСтабильныеПериодыНП(Параметры.Организация, Параметры.ПериодНачисления,Параметры.Район,Параметры.МКД_НП,Параметры.ИсключаяОтдельностоящие,мОбъектыРасчета,МВТ,Перерасчет);
	
КонецПроцедуры

// Процедура - Восстановить последовательность показания ПУНП
//
// Параметры:
//  Параметры		 - См выше 
//  мОбъектыРасчета	 - Массив - Элементы с типом СправочникСсылка.бестОбъектыРасчет 
//  Перерасчет		 - Булево
//
Процедура ВосстановитьПоследовательностьПоказанияПУНП(Параметры, мОбъектыРасчета = Неопределено, Перерасчет = Ложь) Экспорт 
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьПоказанияПУНП(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район,
		Параметры.МКД_НП, Параметры.ИсключаяОтдельностоящие, мОбъектыРасчета, Перерасчет);
	
КонецПроцедуры

// Процедура - Восстановить последовательность взаиморасчеты НП
// Устаревшая
//
// Параметры:
//  Параметры		 - См выше
//  Договор			 - СправочникСсылка.энргДоговорыКонтрагентов
//
Процедура ВосстановитьПоследовательностьВзаиморасчетыНП(Параметры, Договор = Неопределено) Экспорт 
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено Тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьВзаиморасчетыНПЭЭ(Параметры.Организация, Параметры.ПериодНачисления, 
		Параметры.Район, Договор);

КонецПроцедуры

// Процедура - Восстановить последовательность взаиморасчеты НПЭЭ
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации 
//  ПериодНачисления - Дата 
//  Район			 - СправочникСсылка.энргЗоныОтвественности
//  Договор			 - СправочникСсылка.энргДоговорыКонтрагентов 
//
Процедура ВосстановитьПоследовательностьВзаиморасчетыНПЭЭ(Организация, ПериодНачисления, Район, Договор = Неопределено) Экспорт 
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьВзаиморасчетыНПЭЭ(Организация, ПериодНачисления, Район, Договор);
	
КонецПроцедуры

// Процедура - Заполнить данные почасовой ведомости срез
//
// Параметры:
//  Организация				 - СправочникСсылка.Организации 
//  Район					 - СправочникСсылка.энргЗоныОтвественности 
//  МКД						 - СправочникСсылка.энргСтроения 
//  ИсключаяОтдельностоящие	 - Булево
//  ПериодНачисления		 - Дата 
//  мОбъектыРасчета			 - Массив - Элементы с типом СправочникСсылка.бестОбъектыРасчет 
//
Процедура ЗаполнитьДанныеПочасовойВедомостиСрез(Организация, Район, МКД, ИсключаяОтдельностоящие, ПериодНачисления, мОбъектыРасчета = Неопределено) Экспорт 
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ЗаполнитьДанныеПочасовойВедомостиСрез(Организация, Район, МКД, ИсключаяОтдельностоящие, ПериодНачисления, мОбъектыРасчета);
	
КонецПроцедуры

#Область РегламетныеПроцедуры

// Процедура - Регламетные процедуры биллинг 
// Запуск из РЗ бестРегламентныеПроцедурыНП
//
Процедура РегламетныеПроцедурыБиллинг() Экспорт 
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.энргРегламентныеПроцедуры);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Инструменты  		= энргФабрикаИнструментовНачисления.бестРаботаСПоследовательностямиНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.РегламетныеПроцедурыБиллинг();
	
КонецПроцедуры

// Процедура - Восстановить последовательность взаиморасчетов ЭЭ  
// Запуск из РЗ бестВосстановлениеПоследовательностиВзаиморасчетовЭЭ
//
Процедура ВосстановитьПоследовательностьВзаиморасчетовЭЭ() Экспорт  
	
	Текст  							= 
	"ВЫБРАТЬ
	|	бестВзаиморасчетыПоследовательность.Организация КАК Организация,
	|	бестВзаиморасчетыПоследовательность.Район КАК Район,
	|	МИНИМУМ(бестВзаиморасчетыПоследовательность.ПериодНачисления) КАК ПериодНачисления
	|ИЗ
	|	РегистрСведений.бестВзаиморасчетыПоследовательность КАК бестВзаиморасчетыПоследовательность
	|ГДЕ
	|	НЕ бестВзаиморасчетыПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыПоследовательность.Организация,
	|	бестВзаиморасчетыПоследовательность.Район";
	
	Запрос  						= Новый Запрос(Текст);
	Результат  						= Запрос.Выполнить();
	Выборка 						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыЗадания  			= Новый Массив;
		ПараметрыЗадания.Добавить(Выборка.Организация);
		ПараметрыЗадания.Добавить(Выборка.ПериодНачисления);
		ПараметрыЗадания.Добавить(Выборка.Район);
		ФоновыеЗадания.Выполнить("бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьВзаиморасчетыНПЭЭ",ПараметрыЗадания);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти