 #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	 
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			Строение	= Объект.КлючПомещения.Строение;
			Помещение	= Объект.КлючПомещения.Помещение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда				
				ГраницыОП	= ПолучитьПериодНачисленияСервер(ТекущаяДата(), Объект.Организация, Объект.Район);
				Объект.ПериодНачисления	= ГраницыОП.ПериодНачисления;
				Объект.Дата				= ГраницыОП.НачалоОП;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьСуммуЗадолженности();
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчетаПени <> Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросОткрытияДокумента",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ ""Ручное изменение пени""?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчетаПени") тогда
		ДанныеДляПерерасчетаПени = ДопСвойства.ДанныеДляПерерасчетаПени;		 
	иначе
		ДанныеДляПерерасчетаПени = Неопределено;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ВопросОткрытияДокумента(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			ПараметрыФормы = Новый Структура("Ключ", ДанныеДляПерерасчетаПени);
			ОткрытьФорму("Документ.энргРучноеИзменениеПени.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ГраницыОП	= ПолучитьПериодНачисленияСервер(Объект.Дата, Объект.Организация, Объект.Район);
	Объект.ПериодНачисления	= ГраницыОП.ПериодНачисления;
	Объект.Дата				= ГраницыОП.НачалоОП;
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	ГраницыОП	= ПолучитьПериодНачисленияСервер(Объект.Дата, Объект.Организация, Объект.Район);
	Объект.ПериодНачисления	= ГраницыОП.ПериодНачисления;
	Объект.Дата				= ГраницыОП.НачалоОП;
	
	ЗаполнитьТЧПросуженнаяЗадолженность();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуЗадолженности()	
	ТЗ = Объект.ПросуженнаяЗадолженность.Выгрузить(Новый Структура("Просуженная", Истина), "Сумма");
	ИтоговаяСуммаПросуженнойПени = ТЗ.Итог("Сумма");	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыПросуженнаяЗадолженность

&НаСервере
Процедура ЗаполнитьТЧПросуженнаяЗадолженность()
	Объект.ПросуженнаяЗадолженность.Очистить(); 
	ТаблицаЗначенийЗадолженность = Документы.энргРегистрацияПросуженнойПени.ПолучитьЗадолженностьПени(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
	Объект.ПросуженнаяЗадолженность.Загрузить(ТаблицаЗначенийЗадолженность);
КонецПроцедуры 

&НаКлиенте
Процедура ПросуженнаяЗадолженностьПризнакПросуженнаяПослеПриИзменении(Элемент)
	ЗаполнитьСуммуЗадолженности();
КонецПроцедуры

&НаКлиенте
Процедура ПросуженнаяЗадолженностьЗначениеПросуженнойПениПриИзменении(Элемент)
	ТекСтрока = Элементы.ПросуженнаяЗадолженность.ТекущиеДанные;
	Если ТекСтрока.Просуженная Тогда
		ЗаполнитьСуммуЗадолженности();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПериодНачисленияСервер(ПериодРегистрации, Организация, Район)
	
	Возврат Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПериодРегистрации, Организация, Район)) ;
	 
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Подсистема_ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти