#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 

	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();	
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет Тогда
		
		ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", Истина);
		Возврат;
		
	Иначе
			
		Набор = Движения.энргОбъемНачисленийМКД;
		Для Каждого СтрокаНабора Из Набор Цикл
			СтрокаНабора.Период 		= Дата;
			СтрокаНабора.Активность 	= Истина;
			СтрокаНабора.ПериодРасчета = ПериодНачисления;
			СтрокаНабора.ВидНачисления = Перечисления.энргВидыНачислений.Перерасчет;
			СтрокаНабора.Организация 	= Организация;
			СтрокаНабора.Район			= Район;
			СтрокаНабора.МКД			= МКД;
			Если Не ЗначениеЗаполнено(СтрокаНабора.ТарифнаяЗона) Тогда				 
				СтрокаНабора.ТарифнаяЗона = Справочники.энргТарифныеЗоны.БезРазбивки;
			КонецЕсли;
		КонецЦикла;
		Набор.ДополнительныеСвойства.Вставить("ПериодНачисления", 	ПериодНачисления);
		Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
		Набор.ДополнительныеСвойства.Вставить("Район",				Район);
		Набор.ДополнительныеСвойства.Вставить("МКД",				МКД);
		Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	Дата);
		Набор.Записывать = Истина;	
		
	КонецЕсли;
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли