#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектПечати 	= Параметры.ОбъектПечати;
	ИмяМакета 		= Параметры.ИмяМакета;
	ТаблицаМакета 	= Параметры.ТаблицаМакета;
	Организация 	= Параметры.Организация;
	Если ТипЗнч(Параметры.Период) = Тип("Дата") Тогда
		НачалоПериода			= Параметры.Период;
	ИначеЕсли ТипЗнч(Параметры.Период) = Тип("СтандартныйПериод") Тогда
		НачалоПериода			= Параметры.Период.ДатаНачала;
		КонецПериода			= КонецДня(Параметры.Период.ДатаОкончания);
	КонецЕсли;
	Район			= Параметры.Район;
	Если Параметры.Свойство("Договор") Тогда
		Договор				= Параметры.Договор;
	КонецЕсли;
	Если Параметры.Свойство("ФормироватьЗаПериод") Тогда
		ФормироватьЗаПериод	= Параметры.ФормироватьЗаПериод;
	КонецЕсли;
	ЗаполнитьПодписантов();
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Печать(Команда)
	ДанныеПодписантов = Новый Массив;
	ЗаполнитьДанныеПодписантов(ДанныеПодписантов);
	Результат = Новый Структура("ОбъектПечати,ДанныеПодписантов,НачалоПериода,КонецПериода,Организация,Район,Договор,ФормироватьЗаПериод", 
	ОбъектПечати, ДанныеПодписантов,НачалоПериода,КонецПериода,Организация,Район,Договор,ФормироватьЗаПериод);
		
	МассивОбъектов = ОбъектПечати;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТаблицаМакета,ИмяМакета,МассивОбъектов,ЭтотОбъект,Результат);
	
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область События_Подписанты

&НаКлиенте
Процедура ПодписантыСотрудникПриИзменении(Элемент)
	ТекущиеДанныеПодписанты = Элементы.Подписанты.ТекущиеДанные;
	ТекущиеДанныеПодписанты.Должность = ПолучитьДолжность(ТекущиеДанныеПодписанты.Сотрудник);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПодписантов()	
	
	СтруктураОтборов = Новый Структура("ОбъектПечати,ИмяМакета,ТаблицаМакета,Организация,Район,НачалоПериода");
	
	СтруктураОтборов.ОбъектПечати = ОбъектПечати;
	СтруктураОтборов.ИмяМакета = ИмяМакета;
	СтруктураОтборов.ТаблицаМакета = ТаблицаМакета;
	СтруктураОтборов.Организация = Организация;
	СтруктураОтборов.Район = Район;
	СтруктураОтборов.НачалоПериода = НачалоПериода;
	бестПользовательскийВводСервер.ЗаполнитьПодписантов(СтруктураОтборов, Подписанты);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжность(Сотрудник)
	Возврат РегистрыСведений.энргДолжностиСотрудников.ПолучитьДолжностиСотрудников(НачалоПериода,Организация,Сотрудник);
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПодписантов(ДанныеПодписантов)
	
	Для каждого стр из Подписанты Цикл
		ДанныеПодписантов.Добавить(Новый Структура("Сотрудник,ВидПодписанта,Доверенность,Должность",стр.Сотрудник,стр.ВидПодписанта,стр.Доверенность,стр.Должность));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
