#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 		= Пользователи.ТекущийПользователь();	
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	ДанныеШапки = ДанныеШапки();
	
	энргРаботаСТочкамиУчетаСервер.УстановитьИсториюСоглашенийОРаспределенииСверхнормативногоОДН(ДанныеШапки,Движения,"Услуги");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
		
	ДанныеШапки = Новый Структура;
	//ДанныеШапки.Вставить("Дата",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),ДатаФактическогоСобытия,Дата));
	ДанныеШапки.Вставить("Район",				Район);
	ДанныеШапки.Вставить("Организация",			Организация); 
	ДанныеШапки.Вставить("ПериодРегистрации",	Дата);
	ДанныеШапки.Вставить("ПериодНачисления",	ПериодНачисления);  
	ДанныеШапки.Вставить("МКД",					МКД);
	ДанныеШапки.Вставить("Услуги",				Услуги);
	ДанныеШапки.Вставить("ИмяДокумента",		"энргСоглашениеОРаспределенииСверхнормативногоОДН");
	ДанныеШапки.Вставить("Документ",			Ссылка);
	Возврат ДанныеШапки;	

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли