#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Район", Регион);
	Параметры.Свойство("Договор", Договор);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
    Если Не ПроверитьЗаполнение() Тогда      
        Возврат;  
	КонецЕсли;
	ПараметрыВыгрузки = ПолучитьПараметрыВыгрузки();
	ЗаполнитьДанныеВыгрузки(ПараметрыВыгрузки); 	
	
	Попытка
		СохранитьФайлДанных(ПараметрыВыгрузки);
		ПоказатьПредупреждение(, НСтр("ru = 'Файл успешно выгружен'"));
	Исключение		
		ИнфОшибки		= ИнформацияОбОшибке();
		ТекстСообщения 	= КраткоеПредставлениеОшибки(ИнфОшибки);
		ПоказатьПредупреждение(, НСтр("ru = 'Операция сохранения не может быть выполнена по причине:'") + Символы.ПС + ТекстСообщения);
		ЗаписатьОшибкуРаботыСФайлами(ПодробноеПредставлениеОшибки(ИнфОшибки));
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	СозданныеДокументы.Очистить();
    МассивФайлов = ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогФайла, "Загружен_");
	ПотокиФайлов = РазделитьФайлыНаПотоки(МассивФайлов); 
	МассивОпераций = ЗапуститьДлительныеОперации(ПотокиФайлов);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Для Каждого Операция Из МассивОпераций Цикл
		Оповещение = Новый ОписаниеОповещения("ПриЗавершенииСозданияПочасовки", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Операция, Оповещение, ПараметрыОжидания);		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура КаталогФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КаталогФайла = энргОбщегоНазначенияКлиент.КаталогВыгрузки();
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайлаЗагрузкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	КаталогФайла = энргОбщегоНазначенияКлиент.КаталогВыгрузки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

#Область Выгрузка

&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуРаботыСФайлами(ПодробноеПредставлениеОшибки)
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение файла начислений для почты'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДанныеВыгрузки(ПараметрыВыгрузки)	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
    ОбработкаОбъект.ЗаполнитьДанныеВыгрузки(ПараметрыВыгрузки);
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлДанных(ПараметрыВыгрузки)
	Шаблон = "\%1_%2_%3_%4.xls"; 
	День = Формат(Дата, "ДФ = dd.MM.yyyy"); 
	НомерДоговор = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Номер");
	ИмяФайла = СтрШаблон(Шаблон, День, Организация, Регион, НомерДоговор);
	ИмяФайла	= СтрЗаменить(ИмяФайла, " ", "_");
	ИмяФайла	= СтрЗаменить(ИмяФайла, Символ(34), "");
	ПараметрыВыгрузки.ТабличныйДокумент.Записать(КаталогФайла + ИмяФайла, ТипФайлаТабличногоДокумента.XLS); 
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьПараметрыВыгрузки()
    Возврат Новый Структура("Организация, Район, Дата, Договор, КаталогФайла, ТабличныйДокумент, Доходный", Организация, Регион, Дата, Договор, КаталогФайла, Новый ТабличныйДокумент, ДоходныйПереключатель);
КонецФункции 

#КонецОбласти

#Область Загрузка

&НаКлиенте
Функция ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогПоиска, ПрефиксЗагруженногоФайла) 
	Ответ = Новый Массив;
	//МассивФайловxlsx = НайтиФайлы(КаталогПоиска, "*.xlsx");
    МассивФайловxls = НайтиФайлы(КаталогПоиска, "*.xls");
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивФайловxlsx, МассивФайловxls, Истина);
	Для Каждого ТекФайл Из МассивФайловxls Цикл
		Если СтрНайти(ТекФайл.ИмяБезРасширения, ПрефиксЗагруженногоФайла) > 0 Тогда
			Продолжить;	
		КонецЕсли; 
		Ответ.Добавить(ТекФайл);
	КонецЦикла; 	
	Возврат Ответ;
КонецФункции 

&НаКлиенте
Функция ПолучитьИмяФайлаПослеЗагрузки(ПолныйПуть)
	Файл = Новый Файл(ПолныйПуть);	
	Если Не Файл.Существует() Тогда
		Возврат ПолныйПуть;
	КонецЕсли;
	
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Результат = СтрЗаменить(ПолныйПуть, "\" + ИмяБезРасширения, "\" + "Загружен_" + ИмяБезРасширения);
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция УстановитьПрефиксЗагруженногоФайла(ФайлПолноеИмя)
	НовоеИмяФайла = ПолучитьИмяФайлаПослеЗагрузки(ФайлПолноеИмя);
	ПереместитьФайл(ФайлПолноеИмя, НовоеИмяФайла);
	Возврат НовоеИмяФайла;
КонецФункции

&НаСервере
Функция СформироватьПараметрыДляЗагрузки() 
    Результат = Новый Структура;
	Результат.Вставить("Дата", НачалоМесяца(Дата));
	Результат.Вставить("ДатаФактическогоСобытия", ДатаФакт);
	Результат.Вставить("ФайлДляЧтения");
	Результат.Вставить("ВидОперации", ВидОперации);
	Результат.Вставить("УчитыватьКоэффициентПУ", УчитыватьКоэффициентПУ);
	Результат.Вставить("ТаблицаПУ", ТЗПриборыУчета.Выгрузить()); 
	Результат.Вставить("ПредоставленныеОбъемы", ТЗПредоставленныеОбъемы.Выгрузить());
	Возврат Результат;
КонецФункции 

&НаКлиенте
Функция РазделитьФайлыНаПотоки(МассивФайлов) 
	НастройкиМногопоточнойОперации = НастройкиВыполненияЗадания();
	КоличествоДанных = МассивФайлов.Количество();
	КоличествоПотоков = НастройкиМногопоточнойОперации.КоличествоПотоков;
		
	Если КоличествоДанных <= КоличествоПотоков Тогда
		КоличествоПотоков = 1;	
	КонецЕсли;

	СоответствиеПотоков = Новый Соответствие();
	Для Итератор = 1 По КоличествоПотоков Цикл
		СоответствиеПотоков.Вставить(Итератор, Новый Массив);
	КонецЦикла;
	
	Счетчик = 1;
	Для Каждого ЭлементФайл Из МассивФайлов Цикл
		Файл = Новый ДвоичныеДанные(ЭлементФайл.ПолноеИмя);
		МассивДанных = СоответствиеПотоков.Получить(Счетчик);
		СтруктураМассива = Новый Структура("Файл, ФайлДляЧтения, РасширениеФайла", Файл, ЭлементФайл.ПолноеИмя, ЭлементФайл.Расширение);
        МассивДанных.Добавить(СтруктураМассива);
		
		Если Счетчик = КоличествоПотоков Тогда 
			Счетчик = 0;	
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;  
	
	Возврат СоответствиеПотоков;	
КонецФункции 

&НаСервере
Функция НастройкиВыполненияЗадания()
	Возврат Новый Структура("КоличествоПотоков", 3);
КонецФункции

&НаСервере
Функция ЗапуститьДлительныеОперации(ПотокиФайлов) 
   	ПараметрыФункции = СформироватьПараметрыДляЗагрузки();
	Возврат Обработки.бестВыгрузкаИнтервальныхДанныхExcel.ЗапуститьОбработкуОчередиМногопоточно(ПараметрыФункции, ПотокиФайлов, УникальныйИдентификатор);
КонецФункции    

&НаКлиенте
Процедура ПриЗавершенииСозданияПочасовки(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 
	
	СозданныеДокументыСоответствие = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата); 
	Если СозданныеДокументыСоответствие = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ОбработатьРезультатЧтенияФайлов(СозданныеДокументыСоответствие);
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьРезультатЧтенияФайлов(СозданныеДокументыСоответствие)
	Для Каждого ЭлементСоответсвия Из СозданныеДокументыСоответствие Цикл
		СозданныйДокумент = ЭлементСоответсвия.Ключ;
		ЗагруженныйФайл = ЭлементСоответсвия.Значение;
		СозданныеДокументы.Добавить(СозданныйДокумент);
		УстановитьПрефиксЗагруженногоФайла(ЗагруженныйФайл);
		ШаблонСообщения = СтрШаблон("Документ успешно загружен из файла %1", ЗагруженныйФайл);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ШаблонСообщения);
	КонецЦикла;
КонецПроцедуры 
	
#КонецОбласти

#КонецОбласти   
