#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуНаборомЗаписей(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуНаборомЗаписей());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Регистратор, Период";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачисленийПомещенийСРазделеннымиЛС",Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьНаборЗаписейПоРегистратору(Регистратор) Экспорт
	
	Набор = СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор);
	Набор.Записать();
	
КонецПроцедуры

Функция СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор) Экспорт
	
	Набор  = СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Регистратор);
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УдалитьЗаписиПоПомещению(НаборОбъемНачислений) Экспорт
	
	НаборОбъемНачислений.Прочитать();		
	СтрокиУдалить 							= Новый Массив;
	Строение 								= НаборОбъемНачислений.ДополнительныеСвойства["Строение"];
	МассивПомещений 						= НаборОбъемНачислений.ДополнительныеСвойства["Помещение"];
	Для Каждого СтрокаНабора ИЗ НаборОбъемНачислений Цикл
		Если Строение <> СтрокаНабора.Строение Или МассивПомещений.Найти(СтрокаНабора.Помещение) = Неопределено Тогда
			Продолжить;
		КонецЕсли;			
		СтрокиУдалить.Добавить(СтрокаНабора);
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		НаборОбъемНачислений.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНеЗначащиеЗаписи(Набор) Экспорт
	
	ДобавитьВНачисленныйСредний = СоздатьНаборЗаписей();
	
	СтрокиУдалить 					= Новый Массив;
	ОбнулятьОтрицательныеОбъемы  	= ТипЗнч(Набор.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.энргНачисление");
	
	Для Сч = 0 По Набор.Количество() -1 Цикл		
				
		Если ОбнулятьОтрицательныеОбъемы 
			И Набор[Сч].ВидНачисления = Перечисления.энргВидыНачислений.Начисление
			И Набор[Сч].ОбъемУслуги < 0 Тогда
			Набор[Сч].ОбъемУслуги 				= 0;
		КонецЕсли;
		
		Если ОбнулятьОтрицательныеОбъемы
			И Набор[Сч].ВидНачисления = Перечисления.энргВидыНачислений.Начисление 
			И Набор[Сч].ОбъемУслугиПотребленный < 0 Тогда 
			Набор[Сч].ОбъемУслугиПотребленный 	= 0;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДобавитьВНачисленныйСредний.Добавить(),Набор[Сч]);
		
		Если Набор[Сч].СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
			И Набор[Сч].СниматьНачисленныйСредний Тогда
			СтрокиУдалить.Добавить(Набор[Сч]);					
		ИначеЕсли Набор[Сч].СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
			Продолжить;
		ИначеЕсли Набор[Сч].СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
			Продолжить;	
		ИначеЕсли Набор[Сч].СпособНачисления = Перечисления.энргСпособНачислений.ПоФормуламРасчета Тогда
			Продолжить;	
		ИначеЕсли Набор[Сч].СпособНачисления = Перечисления.энргСпособНачислений.ФиксированныйОбъем Тогда
			Продолжить;
		ИначеЕсли  
			Набор[Сч].ОбъемУслуги = 0 И Набор[Сч].ОбъемУслугиПотребленный = 0 
			И Набор[Сч].Сумма = 0 Тогда
			СтрокиУдалить.Добавить(Набор[Сч]);
		КонецЕсли;		
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		Набор.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;	
	
	Набор.ДополнительныеСвойства.Вставить("ОтложенныеНачисленияПоПриборам", ДобавитьВНачисленныйСредний)
КонецПроцедуры

Функция РезультатНачисленныйСреднийОбъем(тзНабор) Экспорт
	
	Запрос  = Новый Запрос(ТекстЗапросаДанныеНачисленныйСреднийОбъем());
	Запрос.УстановитьПараметр("НаборОтложенные", тзНабор);
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуНаборомЗаписей()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачисленийПомещенийСРазделеннымиЛС.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС КАК ОбъемНачисленийПомещенийСРазделеннымиЛС";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеНачисленныйСреднийОбъем()
	Текст = 
	"ВЫБРАТЬ
	|	Набор.Период КАК Период,
	|	Набор.Организация КАК Организация,
	|	Набор.Район КАК Район,
	|	Набор.СпособНачисления КАК СпособНачисления,
	|	Набор.Услуга КАК Услуга,
	|	Набор.ТочкаУчета КАК ТочкаУчета,
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Шкала КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Набор.ОбъемУслуги * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслуги,
	|	Набор.ОбъемУслугиПотребленный * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслугиПотребленный,
	|	Набор.Сумма * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Сумма,
	|	Набор.Поставщик КАК Поставщик,
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ЧастныйСектор КАК ЧастныйСектор,
	|	Набор.ПериодНачисления КАК ПериодНачисления,
	|	ЛОЖЬ КАК ИзменятьВзаиморасчеты,
	|	Набор.СверхНорматива КАК СверхНорматива,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	|	ВЫБОР
	|		КОГДА Набор.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ Набор.Строение
	|	КОНЕЦ КАК МКД
	|ПОМЕСТИТЬ ВТ_СниматьНачисленныйСредний
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	(НЕ Набор.Сумма = 0
	|			ИЛИ НЕ Набор.ОбъемУслуги = 0
	|			ИЛИ НЕ Набор.ОбъемУслугиПотребленный = 0)
	|	И Набор.СниматьНачисленныйСредний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СниматьНачисленныйСредний.Период КАК Период,
	|	ВТ_СниматьНачисленныйСредний.Организация КАК Организация,
	|	ВТ_СниматьНачисленныйСредний.Район КАК Район,
	|	ВТ_СниматьНачисленныйСредний.СпособНачисления КАК СпособНачисления,
	|	ВТ_СниматьНачисленныйСредний.Услуга КАК Услуга,
	|	ВТ_СниматьНачисленныйСредний.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_СниматьНачисленныйСредний.ПриборУчета КАК ПриборУчета,
	|	ВТ_СниматьНачисленныйСредний.Шкала КАК Шкала,
	|	ВТ_СниматьНачисленныйСредний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_СниматьНачисленныйСредний.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВТ_СниматьНачисленныйСредний.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВТ_СниматьНачисленныйСредний.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_СниматьНачисленныйСредний.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ВТ_СниматьНачисленныйСредний.Сумма КАК Сумма,
	|	ВТ_СниматьНачисленныйСредний.Поставщик КАК Поставщик,
	|	ВТ_СниматьНачисленныйСредний.Строение КАК Строение,
	|	ВТ_СниматьНачисленныйСредний.Помещение КАК Помещение,
	|	ВТ_СниматьНачисленныйСредний.ЧастныйСектор КАК ЧастныйСектор,
	|	ВТ_СниматьНачисленныйСредний.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_СниматьНачисленныйСредний.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты,
	|	ВТ_СниматьНачисленныйСредний.СверхНорматива КАК СверхНорматива,
	|	ВТ_СниматьНачисленныйСредний.ВидНачисления КАК ВидНачисления,
	|	ВТ_СниматьНачисленныйСредний.МКД КАК МКД
	|ИЗ
	|	ВТ_СниматьНачисленныйСредний КАК ВТ_СниматьНачисленныйСредний"; 
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли