#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(ЭтотОбъект,Отказ,Замещение);
	РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.УдалитьНеЗначащиеЗаписи(ЭтотОбъект);
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
	
	ДобавитьОтложенныеДвижения(Регистратор);
	
	Если ЭтотОбъект.Количество() > 0 Тогда		
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
	
	энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если НЕ ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если НЕ ДополнительныеСвойства.Свойство("Организация") Тогда
		Если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Организация") Тогда
			ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
		Иначе
			ДополнительныеСвойства.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Строение") Тогда
		Если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"МКД") Тогда
			ДополнительныеСвойства.Вставить("Строение", Регистратор.МКД);
		Иначе
			ДополнительныеСвойства.Вставить("Строение", Справочники.энргСтроения.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Помещение") Тогда		
		ДополнительныеСвойства.Вставить("Помещение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ЧастныйСектор") Тогда
		ДополнительныеСвойства.Вставить("ЧастныйСектор", Ложь);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Район") Тогда
		Если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Район") Тогда
			ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
		Иначе
			ДополнительныеСвойства.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
			
	НаборыЗаписей  						= Новый Структура;
	
	//РазделыЗаписи 						= Новый Массив;
	//
	//Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачисление") Тогда
	//	 РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.РаспределениеПомещения, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));
	//КонецЕсли;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачисление") Тогда
		
		НаборНачисленныйСреднийОбъем		= РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
		НаборНачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		НаборНачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
		НаборыЗаписей.Вставить("энргНачисленныйСреднийОбъем", 		НаборНачисленныйСреднийОбъем);
	КонецЕсли;
	
	//ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);	  
	
	//Если РазделыЗаписи.Количество() > 0 Тогда
	//	НаборОтложенныеДвижения 			= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	//	НаборОтложенныеДвижения.Отбор.ДокРегистратор.Установить(Регистратор);		
	//	НаборыЗаписей.Вставить("энргОтложенныеДвиженияДокументов", 		НаборОтложенныеДвижения);
	//КонецЕсли;
			
	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	перем НаборВзаиморасчеты, НачисленныйСредний;
	
	НаборыЗаписей 											= ДополнительныеСвойства.НаборыЗаписей;
	
	ЕстьНачисленныйСредний 									= Ложь; 
	
	Если НаборыЗаписей.Свойство("энргНачисленныйСреднийОбъем", НачисленныйСредний) Тогда
		ЕстьНачисленныйСредний 								= Истина;
	КонецЕсли;   	
	
	Если ЕстьНачисленныйСредний тогда
		НачисленныйСреднийПрочитан 							= Ложь;
		Если ДополнительныеСвойства.Свойство("НачисленныйСреднийПрочитан") Тогда
			НачисленныйСреднийПрочитан						= ДополнительныеСвойства.НачисленныйСреднийПрочитан;
		КонецЕсли; 		
		Если НЕ НачисленныйСреднийПрочитан Тогда			
			РезультатНачисленныйСредний 					= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.РезультатНачисленныйСреднийОбъем(ДополнительныеСвойства.ОтложенныеНачисленияПоПриборам.Выгрузить()); ;
			ВыборкаНачисленныйСредний 						= РезультатНачисленныйСредний.Выбрать();
			Пока ВыборкаНачисленныйСредний.Следующий() Цикл
				Запись										= НачисленныйСредний.ДобавитьПриход();
				ЗаполнитьЗначенияСвойств(Запись,ВыборкаНачисленныйСредний);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДобавитьОтложенныеДвижения(Регистратор)
	перем НаборОтложенныеДвижения;
	
	НаборыЗаписей 						= ДополнительныеСвойства.НаборыЗаписей;
	
	Если Не НаборыЗаписей.Свойство("энргОтложенныеДвиженияДокументов", НаборОтложенныеДвижения) Тогда
		Возврат;
	КонецЕсли;
		
	РазделыЗаписи 						= ДополнительныеСвойства.РазделыЗаписи;
		
	Для Каждого СтрокаРаздела Из РазделыЗаписи Цикл	    
		Если ЭтотОбъект.Количество() > 0 Тогда					
			НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
			НоваяЗапись.Организация		 	= ДополнительныеСвойства.Организация;
			НоваяЗапись.ПериодНачисления 	= СтрокаРаздела.ПериодНачисления;
			НоваяЗапись.Район 				= ДополнительныеСвойства.Район;
			НоваяЗапись.РазделЗаписи 		= СтрокаРаздела.Раздел;
			НоваяЗапись.ДокРегистратор 		= Регистратор;
			НоваяЗапись.ДатаРегистратора 	= ДополнительныеСвойства.ДатаРегистратора;
			НоваяЗапись.Строение 			= ДополнительныеСвойства.Строение;
			НоваяЗапись.ЧастныйСектор		= ДополнительныеСвойства.ЧастныйСектор;
		КонецЕсли; 				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти