#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойства массив приборов.
// 
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргРегистрацияПоказанийМКД.ТочкиУчета КАК ТаблицаТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийМКД.ШкалыПриборовУчета КАК энргРегистрацияПоказанийМКДШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийМКД.ПоказанияПриборовУчета КАК энргРегистрацияПоказанийМКДПоказанияПриборовУчета
	|			ПО энргРегистрацияПоказанийМКДШкалыПриборовУчета.IDСтроки = энргРегистрацияПоказанийМКДПоказанияПриборовУчета.IDСтроки
	|				И (НЕ энргРегистрацияПоказанийМКДПоказанияПриборовУчета.ПоказанияПредоставлены)
	|		ПО ТаблицаТочекУчета.IDСтроки = энргРегистрацияПоказанийМКДШкалыПриборовУчета.IDСтрокиТочкиУчета
	|ГДЕ
	|	ТаблицаТочекУчета.Ссылка = &ссылка
	|	И НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И энргРегистрацияПоказанийМКДПоказанияПриборовУчета.Ссылка ЕСТЬ NULL";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	//Для Каждого СтрПоказания из ПоказанияПриборовУчета Цикл 
	//	Если не ЗначениеЗаполнено(СтрПоказания.ТекущиеПоказания) Тогда 
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Конечные показания не заполнены");
	//		Отказ=Истина;
	//	КонецЕсли;
	//КонецЦикла;

	
	ПроведениеПриборыУчета();
				
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПриборыУчета()	
	
	ДанныеШапки  = Новый Структура;
	ДанныеШапки.Вставить("Документ", 				Ссылка);
	ДанныеШапки.Вставить("Дата",	 				Дата);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияМКДРезультатЗапроса(ДанныеШапки,Движения);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли