
Функция ОписаниеДокументаНачисления(ИмяДокумента) Экспорт 
	
КонецФункции

Функция ИзмеренияТаблицыОбъемов(ИмяРегистра) Экспорт 
		
	Описание 				= Новый Структура;
	Измерения 				= "";
	Ресурсы 				= "";
	Реквизиты 				= "";
	ОбъектМетаданных 		= Неопределено;
	
	ОбъектМетаданных 		= Метаданные.РегистрыНакопления.Найти(ИмяРегистра);
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных 	= Метаданные.РегистрыСведений.Найти(ИмяРегистра);		
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Новый Структура("Измерения,Ресурсы,Реквизиты",Измерения,Ресурсы,Реквизиты);
	КонецЕсли;
	
	Сч 						= 0;	
	Для Каждого Измерение из ОбъектМетаданных.Измерения цикл		
		Измерения 			= Измерения + ?(Сч> 0,",","") + Измерение.Имя;
		Сч 					= Сч + 1;
	КонецЦикла;
	
	Сч 						= 0;	
	Для Каждого Ресурс из ОбъектМетаданных.Ресурсы цикл		
		Ресурсы 			= Ресурсы + ?(Сч> 0,",","") + Ресурс.Имя;
		Сч 					= Сч + 1;
	КонецЦикла;
	
	Сч 						= 0;	
	Для Каждого Реквизит из ОбъектМетаданных.Реквизиты цикл		
		Реквизиты 			= Реквизиты + ?(Сч> 0,",","") + Реквизит.Имя;
		Сч 					= Сч + 1;
	КонецЦикла; 
	
	Возврат Новый Структура("Измерения,Ресурсы,Реквизиты",Измерения,Ресурсы,Реквизиты);	
КонецФункции

Функция ТипыРасходовВФормулахРасчета() Экспорт 
	
	ТипыРасходов = Новый Структура();
	ТипыРасходов.Вставить("СуммарныйРасходПоУслуге",					0);
	ТипыРасходов.Вставить("ЗначениеНормативаПоУслуге", 					1);
	ТипыРасходов.Вставить("СуммаРасходовВсехПомещенийПоУслуге", 		2);
	ТипыРасходов.Вставить("РасходМКДПоУслуге",							3);
	ТипыРасходов.Вставить("РасходПоШкале",								4);
	ТипыРасходов.Вставить("РасходПоУслугеТочкиУчета",					5);
	ТипыРасходов.Вставить("РасходИзмерителяПоШкале",					6);
	ТипыРасходов.Вставить("ЗначениеТемпературы",						7);
	ТипыРасходов.Вставить("ЗначениеНормативаНаПодогрев",				8);
	ТипыРасходов.Вставить("ЗначениеТемпературногоКоэффициентаПоВоздуху",9);
	ТипыРасходов.Вставить("ЗначениеТемпературногоКоэффициентаПоВоде",	10);
	ТипыРасходов.Вставить("ЗначениеПлотностиВоды",						11);
	ТипыРасходов.Вставить("РасходПоШкалеЗаПредПериод",					12);



	Возврат ТипыРасходов;
	
КонецФункции
