#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСПоследовательностью

Функция РезультатУслугиДляПогашенияТолькоДеньгами() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаУслугиДляПогашенияТолькоДеньгами();
	
	Результат = Запрос.Выполнить();
	Возврат Результат;
	                     	
КонецФункции

Функция УслугиДляПогашенияТолькоДеньгами(Схема, ПараметрыОтбора, ТаблицаДляПомещения) Экспорт
	 Если Схема = Неопределено Тогда
		Схема  = Новый СхемаЗапроса;
		Пакет  = Схема.ПакетЗапросов[0];
	Иначе
		Пакет  = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаУслугиДляПогашенияТолькоДеньгами());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСПоследовательностью

Функция ТекстЗапросаУслугиДляПогашенияТолькоДеньгами()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргУслугиДляПогашенияТолькоДеньгами.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.энргУслугиДляПогашенияТолькоДеньгами КАК энргУслугиДляПогашенияТолькоДеньгами";	
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
