#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучениеДанныхЛицевогоСчетаСДоговоромДоТП(Абонент) Экспорт
    
    ТабЗнПотери = Новый ТаблицаЗначений;
    ТабЗнПотери.Колонки.Добавить("IDСтроки", Новый ОписаниеТипов("УникальныйИдентификатор"));
    ТабЗнПотери.Колонки.Добавить("ВидПотерь", Новый ОписаниеТипов("СправочникСсылка.энргВидыПотерь"));
    ТабЗнПотери.Колонки.Добавить("ФиксированныйОбъемПотерь", Новый ОписаниеТипов("Число"));
    ТабЗнПотери.Колонки.Добавить("ПроцентПотерь", Новый ОписаниеТипов("Число"));
    ТабЗнПотери.Колонки.Добавить("ДанныеПотерь", Новый ОписаниеТипов("Строка"));
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    энргВводНачальныхОстатковАбоненты.Ссылка КАК Ссылка,
    |    энргВводНачальныхОстатковАбоненты.IDСтроки КАК IDСтроки,
    |    энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент
    |ПОМЕСТИТЬ АбонентыВводНачальныхОстатков
    |ИЗ
    |    Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты
    |ГДЕ
    |    энргВводНачальныхОстатковАбоненты.Абонент = &Абонент
    |    И энргВводНачальныхОстатковАбоненты.ДоговорЗаключенДоТП
    |    И энргВводНачальныхОстатковАбоненты.Ссылка.Проведен
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтроки,
    |    энргВводНачальныхОстатковТочкиУчета.IDСтрокиРодитель КАК IDСтрокиРодитель,
    |    энргВводНачальныхОстатковТочкиУчета.бестСтруктураСети КАК бестСтруктураСети,
    |    энргВводНачальныхОстатковТочкиУчета.ДатаВводПрибораУчета КАК ДатаВводПрибораУчета,
    |    энргВводНачальныхОстатковТочкиУчета.ДатаПоверки КАК ДатаПоверки,
    |    энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги КАК ДатаПодключенияУслуги,
    |    энргВводНачальныхОстатковТочкиУчета.ДатаПриемки КАК ДатаПриемки,
    |    энргВводНачальныхОстатковТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
    |    энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
    |    энргВводНачальныхОстатковТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
    |    энргВводНачальныхОстатковТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
    |    энргВводНачальныхОстатковТочкиУчета.НомерПломбы КАК НомерПломбы,
    |    энргВводНачальныхОстатковТочкиУчета.ОписаниеПрибора КАК ОписаниеПрибора,
    |    энргВводНачальныхОстатковТочкиУчета.ОписаниеТочки КАК ОписаниеТочки,
    |    энргВводНачальныхОстатковТочкиУчета.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
    |    энргВводНачальныхОстатковТочкиУчета.Плательщик КАК Плательщик,
    |    энргВводНачальныхОстатковТочкиУчета.Поставщик КАК Поставщик,
    |    энргВводНачальныхОстатковТочкиУчета.ПриборУчета КАК ПриборУчета,
    |    энргВводНачальныхОстатковТочкиУчета.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
    |    энргВводНачальныхОстатковТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
    |    энргВводНачальныхОстатковТочкиУчета.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
    |    энргВводНачальныхОстатковТочкиУчета.Техническая КАК Техническая,
    |    энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
    |    энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
    |    энргВводНачальныхОстатковТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
    |    энргВводНачальныхОстатковТочкиУчета.ДатаВыводаПрибораУчета КАК ДатаВыводаПрибораУчета,
    |    энргВводНачальныхОстатковТочкиУчета.Ссылка КАК Ссылка
    |ПОМЕСТИТЬ ТочкиУчетаАбонента
    |ИЗ
    |    АбонентыВводНачальныхОстатков КАК АбонентыВводНачальныхОстатков
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
    |        ПО (энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента = АбонентыВводНачальныхОстатков.IDСтроки)
    |            И АбонентыВводНачальныхОстатков.Ссылка = энргВводНачальныхОстатковТочкиУчета.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    энргВводНачальныхОстатковШкалыПриборовУчета.IDСтроки КАК IDСтроки,
    |    энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
    |    энргВводНачальныхОстатковШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
    |    энргВводНачальныхОстатковШкалыПриборовУчета.Шкала КАК Шкала,
    |    энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка КАК Ссылка
    |ПОМЕСТИТЬ ШкалыПрибораУчета
    |ИЗ
    |    ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ШкалыПриборовУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
    |        ПО (энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета = ТочкиУчетаАбонента.IDСтроки)
    |            И (энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка = ТочкиУчетаАбонента.Ссылка)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    Таблица.IDСтроки КАК IDСтроки,
    |    Таблица.ВидПотерь КАК ВидПотерь,
    |    Таблица.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
    |    Таблица.ПроцентПотерь КАК ПроцентПотерь,
    |    Таблица.ДанныеПотерь КАК ДанныеПотерь
    |ПОМЕСТИТЬ Потери
    |ИЗ
    |    &ТаблицаЗначенийПотери КАК Таблица
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    энргВводНачальныхОстатковТочкиПоставки.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
    |    энргВводНачальныхОстатковТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
    |    энргВводНачальныхОстатковТочкиПоставки.МаксимальнаяМощность КАК МаксимальнаяМощность,
    |    энргВводНачальныхОстатковТочкиПоставки.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
    |    энргВводНачальныхОстатковТочкиПоставки.СетеваяОрганизация КАК СетеваяОрганизация,
    |    энргВводНачальныхОстатковТочкиПоставки.СтруктураСети КАК СтруктураСети,
    |    энргВводНачальныхОстатковТочкиПоставки.УровеньНапряжения КАК УровеньНапряжения,
    |    энргВводНачальныхОстатковТочкиПоставки.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
    |    энргВводНачальныхОстатковТочкиПоставки.КатегорияНадежности КАК КатегорияНадежности,
    |    энргВводНачальныхОстатковТочкиПоставки.ДоговорТП КАК ДоговорТП,
    |    энргВводНачальныхОстатковТочкиПоставки.АктТП КАК АктТП
    |ИЗ
    |    ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиПоставки КАК энргВводНачальныхОстатковТочкиПоставки
    |        ПО ТочкиУчетаАбонента.IDСтроки = энргВводНачальныхОстатковТочкиПоставки.IDСтрокиТочкиУчета
    |            И (энргВводНачальныхОстатковТочкиПоставки.Ссылка = ТочкиУчетаАбонента.Ссылка)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    энргВводНачальныхОстатковЗначенияИзмерителей.IDСтроки КАК IDСтроки,
    |    энргВводНачальныхОстатковЗначенияИзмерителей.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
    |    энргВводНачальныхОстатковЗначенияИзмерителей.Значение КАК Значение
    |ИЗ
    |    ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ЗначенияИзмерителей КАК энргВводНачальныхОстатковЗначенияИзмерителей
    |        ПО ТочкиУчетаАбонента.Ссылка = энргВводНачальныхОстатковЗначенияИзмерителей.Ссылка
    |            И ТочкиУчетаАбонента.IDСтроки = энргВводНачальныхОстатковЗначенияИзмерителей.IDСтроки
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    Потери.IDСтроки КАК IDСтроки,
    |    Потери.ВидПотерь КАК ВидПотерь,
    |    Потери.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
    |    Потери.ПроцентПотерь КАК ПроцентПотерь,
    |    Потери.ДанныеПотерь КАК ДанныеПотерь
    |ИЗ
    |    Потери КАК Потери
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    ТочкиУчетаАбонента.IDСтроки КАК IDСтроки,
    |    ТочкиУчетаАбонента.IDСтрокиРодитель КАК IDСтрокиРодитель,
    |    ТочкиУчетаАбонента.бестСтруктураСети КАК бестСтруктураСети,
    |    ТочкиУчетаАбонента.ДатаВводПрибораУчета КАК ДатаВводПрибораУчета,
    |    ТочкиУчетаАбонента.ДатаПоверки КАК ДатаПоверки,
    |    ТочкиУчетаАбонента.ДатаПодключенияУслуги КАК ДатаПодключенияУслуги,
    |    ТочкиУчетаАбонента.ДатаПриемки КАК ДатаПриемки,
    |    ТочкиУчетаАбонента.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
    |    ТочкиУчетаАбонента.КоэффициентПУ КАК КоэффициентПУ,
    |    ТочкиУчетаАбонента.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
    |    ТочкиУчетаАбонента.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
    |    ТочкиУчетаАбонента.НомерПломбы КАК НомерПломбы,
    |    ТочкиУчетаАбонента.ОписаниеПрибора КАК ОписаниеПрибора,
    |    ТочкиУчетаАбонента.ОписаниеТочки КАК ОписаниеТочки,
    |    ТочкиУчетаАбонента.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
    |    ТочкиУчетаАбонента.Плательщик КАК Плательщик,
    |    ТочкиУчетаАбонента.Поставщик КАК Поставщик,
    |    ТочкиУчетаАбонента.ПриборУчета КАК ПриборУчета,
    |    ТочкиУчетаАбонента.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
    |    ТочкиУчетаАбонента.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
    |    ТочкиУчетаАбонента.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
    |    ТочкиУчетаАбонента.Техническая КАК Техническая,
    |    ТочкиУчетаАбонента.ТочкаУчета КАК ТочкаУчета,
    |    ТочкиУчетаАбонента.Услуга КАК Услуга,
    |    ТочкиУчетаАбонента.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
    |    ТочкиУчетаАбонента.ДатаВыводаПрибораУчета КАК ДатаВыводаПрибораУчета
    |ИЗ
    |    ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    энргВводНачальныхОстатковИзмерители.IDСтроки КАК IDСтроки,
    |    энргВводНачальныхОстатковИзмерители.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
    |    энргВводНачальныхОстатковИзмерители.ПриборУчета КАК ПриборУчета,
    |    энргВводНачальныхОстатковИзмерители.ДатаВыпуска КАК ДатаВыпуска,
    |    энргВводНачальныхОстатковИзмерители.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
    |    энргВводНачальныхОстатковИзмерители.НомерПломбы КАК НомерПломбы,
    |    энргВводНачальныхОстатковИзмерители.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
    |    энргВводНачальныхОстатковИзмерители.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
    |    энргВводНачальныхОстатковИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
    |    энргВводНачальныхОстатковИзмерители.ОписаниеПрибора КАК ОписаниеПрибора,
    |    энргВводНачальныхОстатковИзмерители.КоэффициентПУ КАК КоэффициентПУ,
    |    энргВводНачальныхОстатковИзмерители.РегистрируетОбъем КАК РегистрируетОбъем,
    |    энргВводНачальныхОстатковИзмерители.УдалитьВидПараметра КАК УдалитьВидПараметра,
    |    энргВводНачальныхОстатковИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
    |    энргВводНачальныхОстатковИзмерители.ТипПрибораУчета КАК ТипПрибораУчета,
    |    энргВводНачальныхОстатковИзмерители.ВспомогательноеОборудование КАК ВспомогательноеОборудование,
    |    энргВводНачальныхОстатковИзмерители.КодАСКУЭ КАК КодАСКУЭ,
    |    энргВводНачальныхОстатковИзмерители.СобственникАСКУЭ КАК СобственникАСКУЭ,
    |    энргВводНачальныхОстатковИзмерители.ДатаИнтеграцииССистемой КАК ДатаИнтеграцииССистемой,
    |    энргВводНачальныхОстатковИзмерители.СистемаУчетаЭлектроэнергии КАК СистемаУчетаЭлектроэнергии,
    |    энргВводНачальныхОстатковИзмерители.ТипИзмерителя КАК ТипИзмерителя,
    |    энргВводНачальныхОстатковИзмерители.ЗаводскойНомер КАК ЗаводскойНомер,
    |    энргВводНачальныхОстатковИзмерители.ДоступКПУ КАК ДоступКПУ,
    |    энргВводНачальныхОстатковИзмерители.ДатаУстановки КАК ДатаУстановки,
    |    энргВводНачальныхОстатковИзмерители.ДатаОчереднойПоверки КАК ДатаОчереднойПоверки,
    |    энргВводНачальныхОстатковИзмерители.СобственникСИ КАК СобственникСИ,
    |    энргВводНачальныхОстатковИзмерители.Фаза КАК Фаза
    |ИЗ
    |    ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.Измерители КАК энргВводНачальныхОстатковИзмерители
    |        ПО (энргВводНачальныхОстатковИзмерители.IDСтрокиТочкиУчета = ТочкиУчетаАбонента.IDСтроки)
    |            И ТочкиУчетаАбонента.Ссылка = энргВводНачальныхОстатковИзмерители.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    ШкалыПрибораУчета.IDСтроки КАК IDСтроки,
    |    ШкалыПрибораУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
    |    ШкалыПрибораУчета.ВидДифференцированности КАК ВидДифференцированности,
    |    ШкалыПрибораУчета.Шкала КАК Шкала
    |ИЗ
    |    ШкалыПрибораУчета КАК ШкалыПрибораУчета
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    энргВводНачальныхОстатковПоказанияПриборовУчета.IDСтроки КАК IDСтроки,
    |    энргВводНачальныхОстатковПоказанияПриборовУчета.ДатаПоказаний КАК ДатаПоказаний,
    |    энргВводНачальныхОстатковПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
    |    энргВводНачальныхОстатковПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
    |    энргВводНачальныхОстатковПоказанияПриборовУчета.ИсточникПоказаний КАК ИсточникПоказаний,
    |    энргВводНачальныхОстатковПоказанияПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета
    |ИЗ
    |    ШкалыПрибораУчета КАК ШкалыПрибораУчета
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоказанияПриборовУчета КАК энргВводНачальныхОстатковПоказанияПриборовУчета
    |        ПО ШкалыПрибораУчета.Ссылка = энргВводНачальныхОстатковПоказанияПриборовУчета.Ссылка
    |            И (энргВводНачальныхОстатковПоказанияПриборовУчета.IDСтроки = ШкалыПрибораУчета.IDСтроки)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    энргВводНачальныхОстатковНомераПломб.IDСтрокиИзмерителя КАК IDСтрокиИзмерителя,
    |    энргВводНачальныхОстатковНомераПломб.НомерПломбы КАК НомерПломбы,
    |    энргВводНачальныхОстатковНомераПломб.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
    |    энргВводНачальныхОстатковНомераПломб.КлючСтроки КАК КлючСтроки,
    |    энргВводНачальныхОстатковНомераПломб.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
    |    энргВводНачальныхОстатковНомераПломб.ЛицоУстановившееПломбу КАК ЛицоУстановившееПломбу
    |ИЗ
    |    ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.НомераПломб КАК энргВводНачальныхОстатковНомераПломб
    |        ПО (энргВводНачальныхОстатковНомераПломб.IDСтрокиТочкиУчета = ТочкиУчетаАбонента.IDСтроки)
    |            И ТочкиУчетаАбонента.Ссылка = энргВводНачальныхОстатковНомераПломб.Ссылка";
    
    Запрос.УстановитьПараметр("Абонент", Абонент);
    Запрос.УстановитьПараметр("ТаблицаЗначенийПотери", ТабЗнПотери);
    Пакет = Запрос.ВыполнитьПакет();
    
    СтруктураЛицевойСчетСДоговоромДоТП = Новый Структура;
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("ТочкиПоставок", Пакет[4]);
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("ЗначенияИзмерителей", Пакет[5]);
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("Потери", Пакет[6]);
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("ТочкиУчета", Пакет[7]);
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("Измерители", Пакет[8]);
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("ШкалыПриборовУчета", Пакет[9]);
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("ПоказанияПриборовУчета", Пакет[10]);
    СтруктураЛицевойСчетСДоговоромДоТП.Вставить("НомераПломб", Пакет[11]);
    
    Возврат СтруктураЛицевойСчетСДоговоромДоТП;
КонецФункции

#КонецОбласти

#КонецЕсли