#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	энргРаботаСТочкамиУчетаСервер.УстановитьНаправлениеИспользованияТочекУчетаПоУмолчанию(ТочкиУчета);
	
	Ответственный 				= Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ОчиститьВспомогательныеДанные();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	МВТ = Новый МенеджерВременныхТаблиц;
	ИнициализироватьИсходныеДанныеДокумента(МВТ);	
	
	ЗаписатьДанныеАбонентов(МВТ);
	ЗаписатьАдресВМаршрутКонтролера(МВТ);
	ЗаписатьДанныеТочекУчета(МВТ);
	ЗаписатьДанныеТочекПоставок(МВТ);
	ЗаписатьНомераПломбПУ(МВТ);
	ЗаписатьВидДифференцированностиПриборовУчета(МВТ);
	ЗаписатьПоказанияПриборовУчета(МВТ);
	ЗаписатьЗначенияПлощадей(МВТ);
	ЗаписатьЛьготников(МВТ);
	ЗаписатьЖильцов(МВТ);
	ЗаписатьВзаиморасчеты(МВТ);
	ЗаписатьЗначенияНаправленийИзмеренийТУ(МВТ);
	ЗаписатьЗначенияФормулРасчетаТУ(МВТ);
	ЗаписатьПоставщикаУслуг(МВТ);	
	ЗаписатьПлательшикаУслуг(МВТ);
	ЗаписатьОрганизациюПоставщикаСтроений(МВТ);
	ЗаписатьВспомогательныеДанные();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковВзаиморасчеты.ДокументОплаты КАК ДокументОплаты
	|ИЗ
	|	Документ.энргВводНачальныхОстатков.Взаиморасчеты КАК энргВводНачальныхОстатковВзаиморасчеты
	|ГДЕ
	|	энргВводНачальныхОстатковВзаиморасчеты.Ссылка = &Ссылка
	|	И энргВводНачальныхОстатковВзаиморасчеты.Задолженность < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВводНачальныхОстатковВзаиморасчеты.ДокументОплаты";
	
	Результат 		= Запрос.Выполнить();
	Выборка 		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ДокументОплаты) Тогда
			ДокОб =  Выборка.ДокументОплаты.ПолучитьОбъект();
			ДокОб.Движения.энргАвансы.Очистить();
			ДокОб.Движения.энргАвансы.Записать();
			
			ДокОб.Движения.энргАвансыПоступившие.Очистить();
			ДокОб.Движения.энргАвансыПоступившие.Записать();
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИсходныхДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(МВТ)
	ПараметрыЗапроса  	= Новый Структура("Ссылка", Ссылка);
	Схема 				= Неопределено;
	
	ПолучитьШапкуДокумента(Схема);
	ПолучитьТаблицуАбонентов(Схема);
	ПолучитьТаблицуТочекУчета(Схема);
	ПолучитьТаблицуШкалТочекУчета(Схема);
	
	энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса, МВТ);
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Дата КАК Дата,
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатков.МКД КАК МКД,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Ссылка КАК Ссылка,
	|	энргВводНачальныхОстатков.Ответственный КАК Ответственный,
	|	энргВводНачальныхОстатков.Примечание КАК Примечание,
	|	энргВводНачальныхОстатков.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ШапкаДокумента
	|ИЗ
	|	Документ.энргВводНачальныхОстатков КАК энргВводНачальныхОстатков
	|ГДЕ
	|	энргВводНачальныхОстатков.Ссылка = &Ссылка");	
КонецПроцедуры  

Процедура ПолучитьТаблицуАбонентов(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковАбоненты.Ссылка КАК Ссылка,
	|	энргВводНачальныхОстатковАбоненты.IDСтроки КАК IDСтроки,
	|	энргВводНачальныхОстатковАбоненты.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|	энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|	энргВводНачальныхОстатковАбоненты.ГруппаАбонентов КАК ГруппаАбонентов,
	|	энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС КАК ДатаОткрытияЛС,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргВводНачальныхОстатковАбоненты.КоличествоКомнат КАК КоличествоКомнат,
	|	энргВводНачальныхОстатковАбоненты.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргВводНачальныхОстатковАбоненты.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргВводНачальныхОстатковАбоненты.КоличествоСобственников КАК КоличествоСобственников,
	|	энргВводНачальныхОстатковАбоненты.ТипСобственностиЖилья КАК ТипСобственностиЖилья,
	|	энргВводНачальныхОстатковАбоненты.Договор КАК Договор,
	|	энргВводНачальныхОстатковАбоненты.МаршрутКонтролера КАК МаршрутКонтролера,
	|	энргВводНачальныхОстатковАбоненты.СпособДоставкиЕПД КАК СпособДоставкиЕПД
	|ПОМЕСТИТЬ ТаблицаАбонентов
	|ИЗ
	|	Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты
	|ГДЕ
	|	энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка");	
КонецПроцедуры

Процедура ПолучитьТаблицуТочекУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковТочкиУчета.Ссылка КАК Ссылка,
	|	энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтроки,
	|	энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|	энргВводНачальныхОстатковТочкиУчета.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|	энргВводНачальныхОстатковТочкиУчета.бестСтруктураСети КАК бестСтруктураСети,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаВводПрибораУчета КАК ДатаВводПрибораУчета,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаПоверки КАК ДатаПоверки,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги КАК ДатаПодключенияУслуги,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаПриемки КАК ДатаПриемки,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргВводНачальныхОстатковТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргВводНачальныхОстатковТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	энргВводНачальныхОстатковТочкиУчета.НомерПломбы КАК НомерПломбы,
	|	энргВводНачальныхОстатковТочкиУчета.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргВводНачальныхОстатковТочкиУчета.Плательщик КАК Плательщик,
	|	энргВводНачальныхОстатковТочкиУчета.Поставщик КАК Поставщик,
	|	энргВводНачальныхОстатковТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргВводНачальныхОстатковТочкиУчета.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|	энргВводНачальныхОстатковТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	энргВводНачальныхОстатковТочкиУчета.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	энргВводНачальныхОстатковТочкиУчета.Техническая КАК Техническая,
	|	энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
	|	энргВводНачальныхОстатковТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаВыводаПрибораУчета КАК ДатаВыводаПрибораУчета
	|ПОМЕСТИТЬ ТаблицаТочекУчета
	|ИЗ
	|	Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	|ГДЕ
	|	энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка");	
КонецПроцедуры

Процедура ПолучитьТаблицуШкалТочекУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка КАК Ссылка,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.Шкала КАК Шкала
	|ПОМЕСТИТЬ ТаблицаШкалТочекУчета
	|ИЗ
	|	Документ.энргВводНачальныхОстатков.ШкалыПриборовУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
	|ГДЕ
	|	энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка = &Ссылка");	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДаннымиАбонента

Процедура ЗаписатьДанныеАбонентов(МВТ)
	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС КАК Период,
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	ИСТИНА КАК Состояние,
	|	энргВводНачальныхОстатковАбоненты.Договор КАК Договор,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ энргСостояниеЛС
	|ИЗ
	|	ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО энргВводНачальныхОстатковАбоненты.Ссылка = энргВводНачальныхОстатков.Ссылка
	|ГДЕ
	|	НЕ энргВводНачальныхОстатковАбоненты.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛС.ПериодРегистрации КАК Период,
	|	энргСостояниеЛС.Абонент КАК Абонент,
	|	энргСостояниеЛС.Договор КАК Договор
	|ПОМЕСТИТЬ энргДоговорыАбонентов
	|ИЗ
	|	энргСостояниеЛС КАК энргСостояниеЛС
	|ГДЕ
	|	НЕ энргСостояниеЛС.Договор = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛС.ПериодРегистрации КАК Период,
	|	энргСостояниеЛС.Организация КАК Организация,
	|	энргСостояниеЛС.Район КАК Район,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргДоговорыКонтрагентов.Филиал КАК Филиал
	|ПОМЕСТИТЬ энргФилиалыСтроений
	|ИЗ
	|	энргСостояниеЛС КАК энргСостояниеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО энргСостояниеЛС.КлючПомещения = энргКлючиПомещений.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО энргСостояниеЛС.Договор = энргДоговорыКонтрагентов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСостояниеЛС.Организация,
	|	энргСостояниеЛС.Район,
	|	энргСостояниеЛС.ПериодРегистрации,
	|	энргКлючиПомещений.Строение,
	|	энргДоговорыКонтрагентов.Филиал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС КАК Период,
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|	МАКСИМУМ(энргВводНачальныхОстатковАбоненты.КоличествоКомнат) КАК КоличествоКомнат,
	|	МАКСИМУМ(энргВводНачальныхОстатковАбоненты.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(энргВводНачальныхОстатковАбоненты.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	МАКСИМУМ(энргВводНачальныхОстатковАбоненты.КоличествоСобственников) КАК КоличествоСобственников,
	|	МАКСИМУМ(энргВводНачальныхОстатковАбоненты.ТипСобственностиЖилья) КАК ТипСобственностиЖилья,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	МИНИМУМ(энргВводНачальныхОстатковАбоненты.Абонент) КАК Абонент,
	|	МАКСИМУМ(энргВводНачальныхОстатковАбоненты.СпособДоставкиЕПД) КАК СпособДоставкиЕПД
	|ПОМЕСТИТЬ энргКоличество
	|ИЗ
	|	ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО энргВводНачальныхОстатковАбоненты.Ссылка = энргВводНачальныхОстатков.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВводНачальныхОстатков.Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления,
	|	энргВводНачальныхОстатков.Район,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения,
	|	энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС,
	|	энргВводНачальныхОстатков.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоличество.Период КАК Период,
	|	энргКоличество.Организация КАК Организация,
	|	энргКоличество.Район КАК Район,
	|	энргКоличество.КлючПомещения КАК КлючПомещения,
	|	энргКоличество.ТипСобственностиЖилья КАК ТипСобственностиЖилья,
	|	энргКоличество.ПериодНачисления КАК ПериодНачисления,
	|	энргКоличество.ПериодРегистрации КАК ПериодРегистрации,
	|	энргКоличество.Абонент КАК Абонент,
	|	энргКоличество.СпособДоставкиЕПД КАК СпособДоставки
	|ПОМЕСТИТЬ энргТипСобственности
	|ИЗ
	|	энргКоличество КАК энргКоличество
	|ГДЕ
	|	НЕ энргКоличество.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	
	|;
	|

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС КАК Период,
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	МАКСИМУМ(энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	МАКСИМУМ(энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория) КАК ГруппаПотребителей
	|ИЗ
	|	ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО энргВводНачальныхОстатковАбоненты.Ссылка = энргВводНачальныхОстатков.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ВидыБлагоустройстваТарифныеКатегории КАК энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории
	|		ПО (энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.Ссылка = &Ссылка)
	|			И энргВводНачальныхОстатковАбоненты.IDСтроки = энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.IDСтрокиАбонента
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВводНачальныхОстатков.Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления,
	|	энргВводНачальныхОстатков.Район,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения,
	|	энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС,
	|	энргВводНачальныхОстатков.Дата,
	|	энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.Услуга";
	
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Движения.энргСостояниеЛС.Загрузить(Пакет[0].Выгрузить());
	Движения.энргДоговорыАбонентов.Загрузить(Пакет[1].Выгрузить());
	
	Если Не ЗначениеЗаполнено(МКД) Тогда
		Движения.энргФилиалыСтроений.Загрузить(Пакет[2].Выгрузить());
	КонецЕсли;
	
	ТЗ = Пакет[3].Выгрузить();
	ТЗ.Колонки.КоличествоКомнат.Имя = "Количество";
	Движения.энргКоличествоКомнат.Загрузить(ТЗ);
	
	ТЗ.Колонки.Удалить("Количество");
	ТЗ.Колонки.КоличествоПрописанных.Имя = "Количество";
	Движения.энргКоличествоПрописанных.Загрузить(ТЗ);
	
	ТЗ.Колонки.Удалить("Количество");
	ТЗ.Колонки.КоличествоПроживающих.Имя = "Количество";
	Движения.энргКоличествоПроживающих.Загрузить(ТЗ);
	
	ТЗ.Колонки.Удалить("Количество");
	ТЗ.Колонки.КоличествоСобственников.Имя = "Количество";
	Движения.энргКоличествоСобственников.Загрузить(ТЗ);
	
	ТЗ = Пакет[4].Выгрузить();
	Движения.энргТипСобственностиАбонентов.Загрузить(ТЗ);
	Движения.энргСпособыДоставкиКвитанции.Загрузить(ТЗ);
		
	ТЗ	= Пакет[5].Выгрузить();
	Движения.энргВидБлагоустройствАбонента.Загрузить(ТЗ);
	Движения.энргГруппыПотребителейАбонентов.Загрузить(ТЗ);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДаннымиТочекУчета

Процедура ЗаписатьДанныеТочекУчета(МВТ)
	
	Запрос  		= Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатков.МКД КАК МКД,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК АбонентВладелец,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги < энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|			ТОГДА энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|		ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги
	|	КОНЕЦ КАК Период,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаПриемки КАК ДатаПриемки,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргВводНачальныхОстатковТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
	|	энргВводНачальныхОстатковТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВЫБОР
	|		КОГДА энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ = 0
	|			ТОГДА 1
	|		ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ
	|	КОНЕЦ КАК КоэффициентПУ,
	|	энргВводНачальныхОстатковТочкиУчета.НомерПломбы КАК НомерПломбы,
	|	энргВводНачальныхОстатковТочкиУчета.ДатаПоверки КАК ДатаПоверки,
	|	энргВводНачальныхОстатковТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргВводНачальныхОстатковТочкиУчета.Техническая КАК Техническая,
	|	энргВводНачальныхОстатковТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ЕСТЬNULL(энргВводНачальныхОстатковТочкиУчетаРодители.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК РодительТочкиУчета,
	|	энргВводНачальныхОстатковТочкиУчета.бестСтруктураСети КАК СтруктураСети,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена) КАК Состояние
	|ПОМЕСТИТЬ энргВладельцыТочекУчета
	|ИЗ
	|	ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчетаРодители
	|		ПО энргВводНачальныхОстатковТочкиУчета.Ссылка = энргВводНачальныхОстатковТочкиУчетаРодители.Ссылка
	|			И энргВводНачальныхОстатковТочкиУчета.IDСтрокиРодитель = энргВводНачальныхОстатковТочкиУчетаРодители.IDСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|		ПО энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|			И энргВводНачальныхОстатковТочкиУчета.Ссылка = энргВводНачальныхОстатковАбоненты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО энргВводНачальныхОстатковТочкиУчета.Ссылка = энргВводНачальныхОстатков.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиУчета.Организация КАК Организация,
	|	ТочкиУчета.ПериодНачисления КАК ПериодНачисления,
	|	ТочкиУчета.Район КАК Район,
	|	ТочкиУчета.МКД КАК МКД,
	|	ТочкиУчета.АбонентВладелец КАК КлючПомещения,
	|	ТочкиУчета.Абонент КАК Абонент,
	|	ТочкиУчета.Период КАК Период,
	|	ТочкиУчета.ДатаПриемки КАК ДатаПриемки,
	|	ТочкиУчета.ПериодРегистрации КАК ПериодРегистрации,
	|	ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ТочкиУчета.Услуга КАК Услуга,
	|	ТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	ТочкиУчета.НомерПломбы КАК НомерПломбы,
	|	ТочкиУчета.ДатаПоверки КАК ДатаПоверки,
	|	ТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТочкиУчета.Техническая КАК Техническая,
	|	ТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ТочкиУчета.РодительТочкиУчета КАК РодительТочкиУчета,
	|	ТочкиУчета.СтруктураСети КАК СтруктураСети
	|ИЗ
	|	энргВладельцыТочекУчета КАК ТочкиУчета
	|ГДЕ
	|	НЕ ТочкиУчета.РодительТочкиУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(энргВладельцыТочекУчета.Период) КАК Период,
	|	энргВладельцыТочекУчета.Организация КАК Организация,
	|	энргВладельцыТочекУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргВладельцыТочекУчета.Район КАК Район,
	|	энргВладельцыТочекУчета.АбонентВладелец КАК КлючПомещения,
	|	энргВладельцыТочекУчета.Услуга КАК Услуга,
	|	энргВладельцыТочекУчета.Абонент КАК Абонент,
	|	энргВладельцыТочекУчета.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	энргВладельцыТочекУчета КАК энргВладельцыТочекУчета
	|ГДЕ
	|	энргВладельцыТочекУчета.РодительТочкиУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВладельцыТочекУчета.АбонентВладелец,
	|	энргВладельцыТочекУчета.Абонент,
	|	энргВладельцыТочекУчета.Услуга,
	|	энргВладельцыТочекУчета.Организация,
	|	энргВладельцыТочекУчета.Район,
	|	энргВладельцыТочекУчета.ПериодРегистрации,
	|	энргВладельцыТочекУчета.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВладельцыТочекУчета.Организация КАК Организация,
	|	энргВладельцыТочекУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргВладельцыТочекУчета.Район КАК Район,
	|	энргВладельцыТочекУчета.АбонентВладелец КАК КлючПомещения,
	|	энргВладельцыТочекУчета.Услуга КАК Услуга,
	|	энргВладельцыТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргВладельцыТочекУчета.ПриборУчета КАК ПриборУчета,
	|	энргВладельцыТочекУчета.ПериодРегистрации КАК ПериодРегистрации,
	|	энргВладельцыТочекУчета.ДатаПриемки КАК Период,
	|	энргВладельцыТочекУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргВладельцыТочекУчета.КоэффициентПУ КАК Коэффициент,
	|	энргВладельцыТочекУчета.ДатаПоверки КАК ДатаПоверки,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	энргВладельцыТочекУчета.ДатаПоверки КАК ФактическаяДатаПоверки
	|ИЗ
	|	энргВладельцыТочекУчета КАК энргВладельцыТочекУчета
	|ГДЕ
	|	энргВладельцыТочекУчета.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВладельцыТочекУчета.АбонентВладелец,
	|	энргВладельцыТочекУчета.ТочкаУчета,
	|	энргВладельцыТочекУчета.ПриборУчета,
	|	энргВладельцыТочекУчета.Услуга,
	|	энргВладельцыТочекУчета.Организация,
	|	энргВладельцыТочекУчета.Район,
	|	энргВладельцыТочекУчета.ПериодРегистрации,
	|	энргВладельцыТочекУчета.ПериодНачисления,
	|	энргВладельцыТочекУчета.ДатаПриемки,
	|	энргВладельцыТочекУчета.КоэффициентПУ,
	|	энргВладельцыТочекУчета.КоэффициентПУ,
	|	энргВладельцыТочекУчета.ДатаПоверки,
	|	энргВладельцыТочекУчета.ДатаПоверки";
	
	Пакеты	= Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТЗ		= Пакеты[0].Выгрузить();
	Движения.энргВладельцыТочекУчета.Загрузить(ТЗ);
	Движения.энргАктивностьТочекУчета.Загрузить(ТЗ);
	Движения.энргУслугиТочекУчета.Загрузить(ТЗ);
	Движения.энргНаправлениеИспользованияТочекУчета.Загрузить(ТЗ);
	Движения.энргТехническаяВозможностьУстановкиПУ.Загрузить(ТЗ);
	Движения.бестТУНаСтруктуреСети.Загрузить(ТЗ);
	
	ТЗ		= Пакеты[1].Выгрузить();
	Движения.энргРодительТочкиУчета.Загрузить(ТЗ);
	
	ТЗ		= Пакеты[2].Выгрузить();
	Движения.энргАбонентыПомещений.Загрузить(ТЗ);
	
	ТЗ		= Пакеты[3].Выгрузить();
	Движения.энргПриборыТочекУчета.Загрузить(ТЗ);
	Движения.энргКоэффциентыПриборовУчета.Загрузить(ТЗ);
	Движения.энргДатыПоверкиПрибораУчета.Загрузить(ТЗ);
	Движения.энргСостояниеПриборовУчетаАбонента.Загрузить(ТЗ);
		
КонецПроцедуры

Процедура ЗаписатьНомераПломбПУ(МВТ)      
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ таблицаНомераПломб.ДатаУстановкиПломбы = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА таблицаНомераПломб.ДатаУстановкиПломбы
	|		ИНАЧЕ ВложенныйЗапрос.Период
	|	КОНЕЦ КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаНомераПломб.КлючСтроки КАК МестоУстановки,
	|	таблицаНомераПломб.НомерПломбы КАК НомерПломбы,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	таблицаНомераПломб.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	таблицаНомераПломб.ЛицоУстановившееПломбу КАК ЛицоУстановившееПломбу
	|ИЗ
	|	(ВЫБРАТЬ
	|		табШапка.Дата КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табАбоненты.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК табАбоненты
	|				ПО табТочкиУчета.Ссылка = табАбоненты.Ссылка
	|					И табТочкиУчета.IDСтрокиАбонента = табАбоненты.IDСтроки
	|					И (табТочкиУчета.Ссылка = &Ссылка)
	|					И (табАбоненты.Ссылка = &Ссылка)
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка = &Ссылка)
	|				И (табТочкиУчета.Ссылка = &Ссылка)
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.КлючПомещения,
	|		табИзмерители.ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.Ссылка,
	|		табИзмерители.IDСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			табШапка.Дата КАК Период,
	|			табШапка.Организация КАК Организация,
	|			табШапка.Район КАК Район,
	|			табАбоненты.КлючПомещения КАК КлючПомещения,
	|			табШапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табШапка.Ссылка КАК Ссылка,
	|			табТочкиУчета.IDСтроки КАК IDСтроки
	|		ИЗ
	|			ШапкаДокумента КАК табШапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК табАбоненты
	|					ПО табТочкиУчета.Ссылка = табАбоненты.Ссылка
	|						И табТочкиУчета.IDСтрокиАбонента = табАбоненты.IDСтроки
	|						И (табТочкиУчета.Ссылка = &Ссылка)
	|						И (табАбоненты.Ссылка = &Ссылка)
	|				ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|					И (табШапка.Ссылка = &Ссылка)
	|					И (табТочкиУчета.Ссылка = &Ссылка)
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.Измерители КАК табИзмерители
	|			ПО ВложенныйЗапрос.Ссылка = табИзмерители.Ссылка
	|				И ВложенныйЗапрос.IDСтроки = табИзмерители.IDСтрокиТочкиУчета
	|				И (табИзмерители.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.НомераПломб КАК таблицаНомераПломб
	|		ПО ВложенныйЗапрос.Ссылка = таблицаНомераПломб.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаНомераПломб.IDСтрокиИзмерителя
	|			И (таблицаНомераПломб.Ссылка = &Ссылка)";

	
	Результат 				= Запрос.Выполнить();
	Выборка  				= Результат.Выбрать();
		
	Пока Выборка.Следующий() Цикл 		
		УстановитьНомерПломбыПрибораУчета(Выборка);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьЗначенияНаправленийИзмеренийТУ(МВТ)
	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	энргВводНачальныхОстатковЗначенияИзмерителей.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|	энргВводНачальныхОстатковЗначенияИзмерителей.Значение КАК Значение,
	|	ВложенныйЗапрос.ПериодУслуги КАК ПериодУслуги
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатков.Организация КАК Организация,
	|		энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|		энргВводНачальныхОстатков.Район КАК Район,
	|		энргВводНачальныхОстатков.МКД КАК МКД,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|		энргВводНачальныхОстатков.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.ПериодУслуги КАК ПериодУслуги
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|			энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|			энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			энргВводНачальныхОстатковТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтроки,
	|			ВЫБОР
	|				КОГДА энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги < энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|					ТОГДА энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|				ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги
	|			КОНЕЦ КАК ПериодУслуги
	|		ИЗ
	|			ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|				ПО энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|					И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)
	|					И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|			ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ЗначенияИзмерителей КАК энргВводНачальныхОстатковЗначенияИзмерителей
	|		ПО ВложенныйЗапрос.IDСтроки = энргВводНачальныхОстатковЗначенияИзмерителей.IDСтроки
	|			И (НЕ ВложенныйЗапрос.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|			И (энргВводНачальныхОстатковЗначенияИзмерителей.Значение > 0)
	|			И (энргВводНачальныхОстатковЗначенияИзмерителей.Ссылка = &Ссылка)
	|			И ВложенныйЗапрос.Ссылка = энргВводНачальныхОстатковЗначенияИзмерителей.Ссылка";
	
	Результат 		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		УстановитьЗначенияНаправленийИзмерителейТУ(Выборка);
	КонецЦикла;
	
КонецПроцедуры  

Процедура ЗаписатьЗначенияФормулРасчетаТУ(МВТ)
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ТочкаУчета КАК РассчитываемаяТочкаУчета,
	|	ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|	энргВводНачальныхОстатковФормулыРасчета.ДатаНачалаРасчета КАК Период,
	|	энргВводНачальныхОстатковФормулыРасчета.КлючПомещения КАК КлючПомещенияИсточник,
	|	энргВводНачальныхОстатковФормулыРасчета.Коэффициент КАК Коэффициент,
	|	энргВводНачальныхОстатковФормулыРасчета.ТочкаУчета КАК ТочкаИсточник,
	|	энргВводНачальныхОстатковФормулыРасчета.Услуга КАК Услуга
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатков.Организация КАК Организация,
	|		энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|		энргВводНачальныхОстатков.Район КАК Район,
	|		энргВводНачальныхОстатков.МКД КАК МКД,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|		энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|		ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|		энргВводНачальныхОстатков.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.ПериодУслуги КАК ПериодУслуги
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|			энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|			энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			энргВводНачальныхОстатковТочкиУчета.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|			энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтроки,
	|			ВЫБОР
	|				КОГДА энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги < энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|					ТОГДА энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|				ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги
	|			КОНЕЦ КАК ПериодУслуги
	|		ИЗ
	|			ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|				ПО энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|					И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)
	|					И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|			ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ФормулыРасчета КАК энргВводНачальныхОстатковФормулыРасчета
	|		ПО ВложенныйЗапрос.IDСтроки = энргВводНачальныхОстатковФормулыРасчета.IDСтрокиТочкиУчета
	|			И (энргВводНачальныхОстатковФормулыРасчета.Ссылка = &Ссылка)
	|			И ВложенныйЗапрос.Ссылка = энргВводНачальныхОстатковФормулыРасчета.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(ПериодНачисления),
	|	МАКСИМУМ(Район),
	|	МАКСИМУМ(КлючПомещения),
	|	МАКСИМУМ(ПериодРегистрации),
	|	МАКСИМУМ(Период)
	|ПО
	|	РассчитываемаяТочкаУчета";
	
	Результат 		= Запрос.Выполнить();
	ВыборкаРассчитываемаяТочкаУчета  		= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРассчитываемаяТочкаУчета.Следующий() Цикл 
		Выборка = ВыборкаРассчитываемаяТочкаУчета.Выбрать();
		Пока Выборка.Следующий() Цикл
			УстановитьЗначенияФормулыТУ(Выборка);
		КонецЦикла;
		
		Запись  						= Движения.энргРасчетныеСпособыТочекУчета.Добавить();
		Запись.Период  					= ВыборкаРассчитываемаяТочкаУчета.Период;
		Запись.Район					= ВыборкаРассчитываемаяТочкаУчета.Район;
		Запись.Организация				= ВыборкаРассчитываемаяТочкаУчета.Организация;
		Запись.КлючПомещения			= ВыборкаРассчитываемаяТочкаУчета.КлючПомещения;
		Запись.РасчетныйСпособ			= Истина;
		Запись.ПрименятьФормулуВсегда	= ВыборкаРассчитываемаяТочкаУчета.ПрименятьФормулуВсегда;
		Запись.ТочкаУчета 				= ВыборкаРассчитываемаяТочкаУчета.РассчитываемаяТочкаУчета; 
		Запись.ПериодРегистрации		= ВыборкаРассчитываемаяТочкаУчета.ПериодРегистрации;
		Запись.ПериодНачисления			= ВыборкаРассчитываемаяТочкаУчета.ПериодНачисления;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьЗначенияНаправленийИзмерителейТУ(Выборка)
	
	Запись  							= Движения.энргЗначенияИзмерителейТочекУчета.добавить();
	Запись.Период  						= Выборка.ПериодУслуги;
	Запись.Район  						= Выборка.район;
	Запись.Организация  				= Выборка.Организация;
	Запись.КлючПомещения 				= Выборка.КлючПомещения;
	Запись.ТочкаУчета 					= Выборка.ТочкаУчета;
	Запись.НаправлениеИспользованияТУ 	= Выборка.НаправлениеИспользованияТУ;
	Запись.ПериодРегистрации			= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления				= Выборка.ПериодНачисления;
	Запись.Значение 					= Выборка.Значение;
	
КонецПроцедуры

Процедура УстановитьЗначенияФормулыТУ(Выборка)
	
	Запись  						= Движения.энргФормулыРасчетаТочекУчета.Добавить();
	Запись.Период 					= Выборка.Период;
	Запись.Организация 				= Выборка.Организация;
	Запись.Район 					= Выборка.Район;
	Запись.КлючПомещения	 		= Выборка.КлючПомещения;
	Запись.РассчитываемаяТочка 		= Выборка.РассчитываемаяТочкаУчета;
	Запись.ТочкаИсточник 			= Выборка.ТочкаИсточник;
	Запись.КлючПомещенияИсточник 	= Выборка.КлючПомещенияИсточник;
	Запись.Актуальность 			= Истина;
	Запись.Коэффициент	 			= Выборка.Коэффициент;
	Запись.ПериодРегистрации		= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления			= Выборка.ПериодНачисления;
	
КонецПроцедуры

Процедура УстановитьНомерПломбыПрибораУчета(Выборка)
	
	Запись	= Движения.энргНомерПломбПриборовУчета.добавить();
	ЗаполнитьЗначенияСвойств(Запись, Выборка); 
	
КонецПроцедуры

Процедура ЗаписатьПоставщикаУслуг(МВТ)
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПериодУслуги КАК ПериодУслуги,
	|	энргВводНачальныхОстатков.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ДанныеТочекУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|		энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
	|		энргВводНачальныхОстатковТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|		энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтроки,
	|		энргВводНачальныхОстатковТочкиУчета.Поставщик КАК Поставщик,
	|		ВЫБОР
	|			КОГДА энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги < энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|				ТОГДА энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|			ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги
	|		КОНЕЦ КАК ПериодУслуги
	|	ИЗ
	|		ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|				И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТочекУчета.ПериодУслуги КАК Период,
	|	ДанныеТочекУчета.Организация КАК Организация,
	|	ДанныеТочекУчета.Район КАК Район,
	|	ДанныеТочекУчета.КлючПомещения КАК КлючПомещения,
	|	ДанныеТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL
	|			ТОГДА ДанныеТочекУчета.Услуга
	|		ИНАЧЕ ДанныеТабличнойЧастиПоставщики.ЧастьСоставнойУслуги
	|	КОНЕЦ КАК Услуга,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL
	|			ТОГДА ДанныеТочекУчета.Поставщик
	|		ИНАЧЕ ДанныеТабличнойЧастиПоставщики.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЧастьСоставной
	|ИЗ
	|	ДанныеТочекУчета КАК ДанныеТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоставщикиСоставныхУслуг КАК ДанныеТабличнойЧастиПоставщики
	|		ПО ДанныеТочекУчета.Ссылка = ДанныеТабличнойЧастиПоставщики.Ссылка
	|			И (ДанныеТочекУчета.ЭтоСоставнаяУслуга)
	|			И ДанныеТочекУчета.IDСтроки = ДанныеТабличнойЧастиПоставщики.IDСтроки";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		Запись 						= Движения.энргПоставщикиУслугАбонента.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.Период 				= Выборка.Период;
		Запись.ПериодРегистрации	= Дата;
		Запись.ПериодНачисления		= ПериодНачисления;
	КонецЦикла; 	

КонецПроцедуры

Процедура ЗаписатьПлательшикаУслуг(МВТ)
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПериодУслуги КАК ПериодУслуги,
	|	энргВводНачальныхОстатков.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|	ВложенныйЗапрос.Плательщик КАК Плательщик,
	|	ВложенныйЗапрос.Абонент КАК Абонент
	|ПОМЕСТИТЬ ДанныеТочекУчетаДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|		энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
	|		энргВводНачальныхОстатковТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|		энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтроки,
	|		ВЫБОР
	|			КОГДА энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги < энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|				ТОГДА энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС
	|			ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.ДатаПодключенияУслуги
	|		КОНЕЦ КАК ПериодУслуги,
	|		энргВводНачальныхОстатковТочкиУчета.Плательщик КАК Плательщик,
	|		энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент
	|	ИЗ
	|		ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|				И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Дата КАК ПериодРегистрации,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДанныеТочекУчета.ПериодУслуги КАК Период,
	|	ДанныеТочекУчета.Организация КАК Организация,
	|	ДанныеТочекУчета.Район КАК Район,
	|	ДанныеТочекУчета.КлючПомещения КАК КлючПомещения,
	|	ДанныеТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL
	|			ТОГДА ДанныеТочекУчета.Услуга
	|		ИНАЧЕ ДанныеТабличнойЧастиПоставщики.ЧастьСоставнойУслуги
	|	КОНЕЦ КАК Услуга,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеТочекУчета.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ДанныеТочекУчета.Абонент
	|					ИНАЧЕ ДанныеТочекУчета.Плательщик
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеТабличнойЧастиПоставщики.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|					ТОГДА ДанныеТочекУчета.Абонент
	|				ИНАЧЕ ДанныеТабличнойЧастиПоставщики.Плательщик
	|			КОНЕЦ
	|	КОНЕЦ КАК Плательщик,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЧастьСоставной
	|ИЗ
	|	ДанныеТочекУчетаДокумента КАК ДанныеТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоставщикиСоставныхУслуг КАК ДанныеТабличнойЧастиПоставщики
	|		ПО ДанныеТочекУчета.Ссылка = ДанныеТабличнойЧастиПоставщики.Ссылка
	|			И (ДанныеТочекУчета.ЭтоСоставнаяУслуга)
	|			И ДанныеТочекУчета.IDСтроки = ДанныеТабличнойЧастиПоставщики.IDСтроки";
	
	Результат  						= Запрос.Выполнить();
	//Выборка  						= Результат.Выбрать();
	//Пока Выборка.Следующий() цикл
	//	Запись 						= Движения.энргПлательщикиУслугАбонента.добавить();
	//	ЗаполнитьЗначенияСвойств(Запись,Выборка);
	//	Запись.Период 				= Выборка.Период;
	//	Запись.ПериодРегистрации	= Дата;
	//	Запись.ПериодНачисления		= ПериодНачисления;
	//КонецЦикла; 	
	Движения.энргПлательщикиУслугАбонента.Загрузить(Результат.Выгрузить());
КонецПроцедуры

Процедура ЗаписатьОрганизациюПоставщикаСтроений(МВТ)
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ИСТИНА КАК Активна,
	|	энргВводНачальныхОстатков.Дата КАК Период,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	энргВводНачальныхОстатков.Поставщик КАК Поставщик
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргКлючиПомещений.Строение КАК Строение
	|	ИЗ
	|		ТаблицаАбонентов КАК ТаблицаАбонентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО ТаблицаАбонентов.КлючПомещения = энргКлючиПомещений.Ссылка
	|	ГДЕ
	|		энргКлючиПомещений.ЧастныйСектор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргКлючиПомещений.Строение) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		Запись 						= Движения.энргОрганизацииПоставщикиСтроений.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);		
	КонецЦикла;
	

КонецПроцедуры 

#КонецОбласти

#Область РаботаСДаннымиТочекПоставок

Процедура ЗаписатьДанныеТочекПоставок(МВТ)
	
	Если ЗначениеЗаполнено(МКД) Тогда 
		Возврат;
	КонецЕсли;
	
	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Дата КАК Период,
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргВводНачальныхОстатковТочкиПоставки.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргВводНачальныхОстатковТочкиПоставки.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргВводНачальныхОстатковТочкиПоставки.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргВводНачальныхОстатковТочкиПоставки.СтруктураСети КАК СтруктураСети,
	|	энргВводНачальныхОстатковТочкиПоставки.УровеньНапряжения КАК УровеньНапряжения,
	|	энргВводНачальныхОстатковТочкиПоставки.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
	|	энргВводНачальныхОстатковТочкиПоставки.КатегорияНадежности КАК КатегорияНадежности,
	|	энргВводНачальныхОстатковТочкиПоставки.ДоговорТП КАК ДоговорТП,
	|	энргВводНачальныхОстатковТочкиПоставки.АктТП КАК АктТП,
	|	энргВводНачальныхОстатковТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки
	|ПОМЕСТИТЬ ДанныеТочекПоставок
	|ИЗ
	|	ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргВводНачальныхОстатковАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
	|		ПО энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|			И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)
	|			И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)
	|			И энргВводНачальныхОстатковТочкиУчета.Ссылка = энргВводНачальныхОстатковАбоненты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)
	|			И энргВводНачальныхОстатковТочкиУчета.Ссылка = энргВводНачальныхОстатков.Ссылка
	|			И (энргВводНачальныхОстатков.Ссылка = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиПоставки КАК энргВводНачальныхОстатковТочкиПоставки
	|		ПО энргВводНачальныхОстатковТочкиУчета.Ссылка = энргВводНачальныхОстатковТочкиПоставки.Ссылка
	|			И энргВводНачальныхОстатковТочкиУчета.IDСтроки = энргВводНачальныхОстатковТочкиПоставки.IDСтрокиТочкиУчета
	|			И (энргВводНачальныхОстатковТочкиПоставки.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеТочекПоставок.Период КАК Период,
	|	ДанныеТочекПоставок.ТочкаПоставки КАК ТочкаПоставки,
	|	МАКСИМУМ(ДанныеТочекПоставок.МаксимальнаяМощность) КАК МаксимальнаяМощность,
	|	МАКСИМУМ(ДанныеТочекПоставок.ПрисоединеннаяМощность) КАК ПрисоединеннаяМощность,
	|	МАКСИМУМ(ДанныеТочекПоставок.СетеваяОрганизация) КАК СетеваяОрганизация,
	|	МАКСИМУМ(ДанныеТочекПоставок.СтруктураСети) КАК СтруктураСети,
	|	МАКСИМУМ(ДанныеТочекПоставок.УровеньНапряжения) КАК УровеньНапряжения,
	|	МАКСИМУМ(ДанныеТочекПоставок.УровеньНапряженияРасчетный) КАК УровеньНапряженияРасчетный,
	|	МАКСИМУМ(ДанныеТочекПоставок.КатегорияНадежности) КАК КатегорияНадежности,
	|	МАКСИМУМ(ДанныеТочекПоставок.ДоговорТП) КАК ДоговорТП,
	|	МАКСИМУМ(ДанныеТочекПоставок.АктТП) КАК АктТП,
	|	ИСТИНА КАК Состояние
	|ИЗ
	|	ДанныеТочекПоставок КАК ДанныеТочекПоставок
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеТочекПоставок.Период,
	|	ДанныеТочекПоставок.ТочкаПоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТочекПоставок.Период КАК Период,
	|	ДанныеТочекПоставок.Организация КАК Организация,
	|	ДанныеТочекПоставок.Район КАК Район,
	|	ДанныеТочекПоставок.Строение КАК Строение,
	|	ДанныеТочекПоставок.КлючПомещения КАК КлючПомещения,
	|	ДанныеТочекПоставок.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеТочекПоставок.ТочкаПоставки КАК ТочкаПоставки
	|ИЗ
	|	ДанныеТочекПоставок КАК ДанныеТочекПоставок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	Строение,
	|	ТочкаПоставки";
	
	Результат 				= Запрос.ВыполнитьПакет();
	КоличествоПакетов		= Результат.Количество();
	ВыборкаТочкиПоставок	= Результат[КоличествоПакетов - 2].Выбрать(); 
	Пока ВыборкаТочкиПоставок.Следующий() Цикл
		НСтрока = Движения.энргАктивностьТочекПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаТочкиПоставок);
		
		НСтрока = Движения.энргПараметрыТочекПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаТочкиПоставок);	
	КонецЦикла;
	
	
	ТекОрганизация 			= Неопределено;
	ТекРайон			 	= Неопределено;
	ТекСтроение			 	= Неопределено;
	ТекТочкаПоставки		= Неопределено;
	
	ВыборкаТочкиПоставокСтроений = Результат[КоличествоПакетов - 1].Выбрать(); 
	Пока ВыборкаТочкиПоставокСтроений.Следующий() Цикл
		
		НСтрока = Движения.энргТочкиПоставкиТочекУчета.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаТочкиПоставокСтроений);
		
		Если НЕ ТекОрганизация = ВыборкаТочкиПоставокСтроений.Организация
			ИЛИ НЕ ТекРайон = ВыборкаТочкиПоставокСтроений.Район
			ИЛИ НЕ ТекСтроение = ВыборкаТочкиПоставокСтроений.Строение
			ИЛИ НЕ ТекТочкаПоставки = ВыборкаТочкиПоставокСтроений.ТочкаПоставки Тогда			
			
			НСтрока = Движения.энргТочкиПоставкиСтроений.Добавить();
			ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаТочкиПоставокСтроений);			
		КонецЕсли; 		
		
		ТекОрганизация 		= ВыборкаТочкиПоставокСтроений.Организация;
		ТекРайон			= ВыборкаТочкиПоставокСтроений.Район;
		ТекСтроение			= ВыборкаТочкиПоставокСтроений.Строение;
		ТекТочкаПоставки	= ВыборкаТочкиПоставокСтроений.ТочкаПоставки;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоШкаламиТарифнымиЗонами

Процедура ЗаписатьВидДифференцированностиПриборовУчета(МВТ)
	
	Запрос  = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатков.МКД КАК МКД,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВводНачальныхОстатков.Дата КАК Дата,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаПриемки КАК ДатаПриемки
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|		энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		ВложенныйЗапрос.ДатаПриемки КАК ДатаПриемки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргВводНачальныхОстатковТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			энргВводНачальныхОстатковШкалыПриборовУчета.Шкала КАК Шкала,
	|			энргВводНачальныхОстатковШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|			энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|			энргВводНачальныхОстатковТочкиУчета.ДатаПриемки КАК ДатаПриемки
	|		ИЗ
	|			ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалТочекУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
	|				ПО энргВводНачальныхОстатковТочкиУчета.IDСтроки = энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета
	|					И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)
	|					И (энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)
	|				И ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)
	|ГДЕ
	|	ВложенныйЗапрос.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл		
		Запись 							= Движения.энргВидыДифференцированностиПриборовУчета.Добавить();
		Запись.Период  					= Выборка.ДатаПриемки;
		Запись.Район  					= Выборка.Район;
		Запись.Организация				= Выборка.Организация;
		Запись.КлючПомещения			= Выборка.КлючПомещения;
		Запись.ПриборУчета 				= Выборка.ПриборУчета;
		Запись.Шкала 					= Выборка.Шкала;
		Запись.ВидДифференцированности	= ?(НЕ ЗначениеЗаполнено(Выборка.ВидДифференцированности),Справочники.энргВидыДифференцированности.Однотарифный,Выборка.ВидДифференцированности);
		Запись.ПериодРегистрации		= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления			= Выборка.ПериодНачисления;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьПоказанияПриборовУчета(МВТ)
	
	Запрос 			= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|	ВложенныйЗапрос.ПериодПоказаний КАК ПериодПоказаний,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний,
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатков.МКД КАК МКД,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|		ВложенныйЗапрос.ПериодПоказаний КАК ПериодПоказаний,
	|		энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|		энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|			ВложенныйЗапрос.ПериодПоказаний КАК ПериодПоказаний,
	|			энргВводНачальныхОстатковТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.Шкала КАК Шкала,
	|			ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|			ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|			ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний,
	|			энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|				энргВводНачальныхОстатковПоказанияПриборовУчета.ДатаПоказаний КАК ПериодПоказаний,
	|				энргВводНачальныхОстатковШкалыПриборовУчета.Шкала КАК Шкала,
	|				энргВводНачальныхОстатковПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|				энргВводНачальныхОстатковПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|				энргВводНачальныхОстатковПоказанияПриборовУчета.ИсточникПоказаний КАК ИсточникПоказаний
	|			ИЗ
	|				Документ.энргВводНачальныхОстатков.ПоказанияПриборовУчета КАК энргВводНачальныхОстатковПоказанияПриборовУчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалТочекУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
	|					ПО энргВводНачальныхОстатковПоказанияПриборовУчета.IDСтроки = энргВводНачальныхОстатковШкалыПриборовУчета.IDСтроки
	|						И энргВводНачальныхОстатковПоказанияПриборовУчета.Ссылка = энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка
	|						И (энргВводНачальныхОстатковПоказанияПриборовУчета.Ссылка = &Ссылка)
	|						И (энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргВводНачальныхОстатковТочкиУчета
	|				ПО ВложенныйЗапрос.IDСтрокиТочкиУчета = энргВводНачальныхОстатковТочкиУчета.IDСтроки
	|					И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|				И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)";
	
	Результат  						= Запрос.Выполнить();
	Выборка 						= Результат.Выбрать();
	
	МенеджерМаксимальныеПоказания = РегистрыСведений.энргМаксимальныеПоказания;
	НаборЗаписейМП = МенеджерМаксимальныеПоказания.СоздатьНаборЗаписей();
	НаборЗаписейМП.Отбор.ДокРегистратор.Установить(Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
		Запись 						= Движения.энргПоказанияПриборовУчета.Добавить();
		Запись.Период 				= Выборка.ПериодПоказаний;
		Запись.Организация			= Выборка.Организация;
		Запись.Район				= Выборка.Район;
		Запись.КлючПомещения		= Выборка.КлючПомещения;
		Запись.ПриборУчета			= Выборка.ПриборУчета;
		Запись.Шкала				= Выборка.Шкала;
		Запись.ТарифнаяЗона			= Выборка.ТарифнаяЗона;
		Запись.Разделитель			= 0;
		Запись.Показание			= Выборка.ТекущиеПоказания;
		Запись.СостояниеПоказаний	= Перечисления.энргСостояниеПоказаний.Приняты;
		Запись.КС					= Ложь;
		Запись.ИсточникПоказаний	= Выборка.ИсточникПоказаний;
		Запись.Переворот			= Ложь;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ТочкаУчета			= Выборка.ТочкаУчета;
		
		
		//Запись 						= Движения.энргМаксимальныеПоказания.Добавить();
		Запись						= НаборЗаписейМП.Добавить();
		Запись.ДокРегистратор 		= Ссылка;
		Запись.Период 				= Выборка.ПериодПоказаний;
		Запись.Организация			= Выборка.Организация;
		Запись.Район				= Выборка.Район;
		Запись.КлючПомещения		= Выборка.КлючПомещения;
		Запись.ПриборУчета			= Выборка.ПриборУчета;
		Запись.Шкала				= Выборка.Шкала;
		Запись.ТарифнаяЗона			= Выборка.ТарифнаяЗона;
		Запись.Разделитель			= 0;
		Запись.Показание			= Выборка.ТекущиеПоказания;
		Запись.ДатаРегистратора 	= Выборка.ПериодПоказаний;   
		
		Если Не ЗначениеЗаполнено(Выборка.ПериодПоказаний) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата показаний " + Выборка.Абонент + " для прибора " + Выборка.ПриборУчета);	
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписейМП.Записать();
	
КонецПроцедуры 

Процедура ЗаписатьАдресВМаршрутКонтролера(МВТ)  	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
		|	энргВводНачальныхОстатковАбоненты.МаршрутКонтролера КАК МаршрутКонтролера
		|ИЗ
		|	ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещенийМаршрутовКонтролеров КАК энргКлючиПомещенийМаршрутовКонтролеров
		|		ПО энргВводНачальныхОстатковАбоненты.МаршрутКонтролера = энргКлючиПомещенийМаршрутовКонтролеров.МаршрутКонтролера
		|			И энргВводНачальныхОстатковАбоненты.КлючПомещения = энргКлючиПомещенийМаршрутовКонтролеров.КлючПомещения
		|ГДЕ
		|	энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка
		|	И НЕ энргВводНачальныхОстатковАбоненты.МаршрутКонтролера = ЗНАЧЕНИЕ(Справочник.энргМаршрутыКонтроллеров.ПустаяСсылка)
		|	И энргКлючиПомещенийМаршрутовКонтролеров.КлючПомещения ЕСТЬ NULL
		|ИТОГИ ПО
		|	МаршрутКонтролера";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса 			= Запрос.Выполнить();	
	ВыборкаМаршрутКонтролера 	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МенеджерРегистра			= РегистрыСведений.энргКлючиПомещенийМаршрутовКонтролеров;
	
	Пока ВыборкаМаршрутКонтролера.Следующий() Цикл
		НаборМаршрута = МенеджерРегистра.СоздатьНаборЗаписей();
		НаборМаршрута.Отбор.МаршрутКонтролера.Установить(ВыборкаМаршрутКонтролера.МаршрутКонтролера);
	
		ВыборкаДетальныеЗаписи = ВыборкаМаршрутКонтролера.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗапись = НаборМаршрута.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		НаборМаршрута.Записать(Ложь);
	КонецЦикла;  	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательныеданные

Процедура ОчиститьВспомогательныеДанные()
			
	НаборСтабильные 				= РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
	НаборСтабильные.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборСтабильные.Записать();
	
	НаборСтабильные 				= РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
	НаборСтабильные.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборСтабильные.Записать();
	
	НаборСтабильные 				= РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
	НаборСтабильные.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборСтабильные.Записать();
	
	НаборСтабильные 				= РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
	НаборСтабильные.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборСтабильные.Записать();	  
	
КонецПроцедуры

Процедура ЗаписатьВспомогательныеДанные()
	
	НаборОтложенныеДвижения			= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НаборОтложенныеДвижения.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборОтложенныеДвижения.Записать();
	
	НаборОтложенныеДвижения			= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
	НоваяЗапись.Организация		 	= Организация;
	НоваяЗапись.ПериодНачисления 	= ПериодНачисления;
	НоваяЗапись.Район 				= Район;
	НоваяЗапись.РазделЗаписи 		= Перечисления.энргРазделыЗаписи.СтабильныеПериоды;
	НоваяЗапись.ДокРегистратор 		= Ссылка;
	НоваяЗапись.ДатаРегистратора 	= Дата;
	НоваяЗапись.ЧастныйСектор		= НЕ ЗначениеЗаполнено(МКД);
	НоваяЗапись.Строение			= МКД;
	НаборОтложенныеДвижения.Записать(Ложь);
		
КонецПроцедуры

#КонецОбласти

Процедура ЗаписатьЗначенияПлощадей(МВТ)
	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатков.МКД КАК МКД,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ВидПлощади КАК ВидПлощади,
	|	ВложенныйЗапрос.ЗначениеПлощади КАК Площадь,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковЗначениеПлощадей.Период КАК Период,
	|		энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|		энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|		энргВводНачальныхОстатковЗначениеПлощадей.ВидПлощади КАК ВидПлощади,
	|		энргВводНачальныхОстатковЗначениеПлощадей.ЗначениеПлощади КАК ЗначениеПлощади
	|	ИЗ
	|		Документ.энргВводНачальныхОстатков.ЗначениеПлощадей КАК энргВводНачальныхОстатковЗначениеПлощадей
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО энргВводНачальныхОстатковЗначениеПлощадей.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|				И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковЗначениеПлощадей.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		Запись 						= Движения.энргЗначенияПлощадей.Добавить();
		Запись.Период 				= Выборка.Период;
		Запись.Организация 			= Выборка.Организация;
		Запись.Район 				= Выборка.Район;
		Запись.КлючПомещения		= Выборка.КлючПомещения;
		Запись.ВидПлощади 			= Выборка.ВидПлощади;
		Запись.Площадь 				= Выборка.Площадь;
		Запись.ПериодРегистрации 	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления 	= Выборка.ПериодНачисления;		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаписатьЛьготников(МВТ)
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Жилец КАК Жилец,
	|	ВложенныйЗапрос.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
	|	ВложенныйЗапрос.ПроцентЛьготы КАК ПроцентЛьготы,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	ИСТИНА КАК Состояние
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковЖильцы.ДатаНачалаДействия КАК Период,
	|		энргВводНачальныхОстатковЖильцы.Жилец КАК Жилец,
	|		энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|		энргВводНачальныхОстатковЖильцы.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
	|		энргВводНачальныхОстатковЖильцы.ПроцентЛьготы КАК ПроцентЛьготы
	|	ИЗ
	|		Документ.энргВводНачальныхОстатков.Жильцы КАК энргВводНачальныхОстатковЖильцы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО энргВводНачальныхОстатковЖильцы.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|				И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковЖильцы.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковЖильцы.ЛьготнаяКатегория <> ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		Запись 						= Движения.энргЖильцыЛьготныхКатегорий.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);		
	КонецЦикла;		
КонецПроцедуры

Процедура ЗаписатьЖильцов(МВТ)
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Жилец КАК ФизическоеЛицо,
	|	ВложенныйЗапрос.СолидарнаяОплата КАК СолидарнаяОплата,
	|	ИСТИНА КАК Активна,
	|	энргВводНачальныхОстатков.Дата КАК Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковЖильцы.ДатаНачалаДействия КАК Период,
	|		энргВводНачальныхОстатковЖильцы.Жилец КАК Жилец,
	|		энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|		энргВводНачальныхОстатковЖильцы.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
	|		энргВводНачальныхОстатковЖильцы.ПроцентЛьготы КАК ПроцентЛьготы,
	|		энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|		энргВводНачальныхОстатковЖильцы.СолидарнаяОплата КАК СолидарнаяОплата
	|	ИЗ
	|		Документ.энргВводНачальныхОстатков.Жильцы КАК энргВводНачальныхОстатковЖильцы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО энргВводНачальныхОстатковЖильцы.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|				И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковЖильцы.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковЖильцы.СолидарнаяОплата)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		Запись 						= Движения.энргСобственникиПомещений.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);		
	КонецЦикла;		
КонецПроцедуры

Процедура ЗаписатьВзаиморасчеты(МВТ)
	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатков.Организация КАК Организация,
	|	энргВводНачальныхОстатков.Район КАК Район,
	|	энргВводНачальныхОстатков.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПериодНачисления КАК Период,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.Задолженность КАК Сумма,
	|	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	|	энргВводНачальныхОстатков.Дата КАК Дата,
	|	ВложенныйЗапрос.ИсточникОплаты КАК ИсточникОплаты,
	|	ВложенныйЗапрос.ДокументОплаты КАК ДокументОплаты,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ПОМЕСТИТЬ ВТ_ВзаиморасчетыДляПроведения
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|		энргВводНачальныхОстатковВзаиморасчеты.ПериодНачисления КАК ПериодНачисления,
	|		энргВводНачальныхОстатковВзаиморасчеты.Поставщик КАК Поставщик,
	|		энргВводНачальныхОстатковВзаиморасчеты.Задолженность КАК Задолженность,
	|		энргВводНачальныхОстатковВзаиморасчеты.Услуга КАК Услуга,
	|		энргВводНачальныхОстатковВзаиморасчеты.ИсточникОплаты КАК ИсточникОплаты,
	|		энргВводНачальныхОстатковВзаиморасчеты.ДокументОплаты КАК ДокументОплаты
	|	ИЗ
	|		Документ.энргВводНачальныхОстатков.Взаиморасчеты КАК энргВводНачальныхОстатковВзаиморасчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаАбонентов КАК энргВводНачальныхОстатковАбоненты
	|			ПО энргВводНачальныхОстатковВзаиморасчеты.IDСтрокиАбонента = энргВводНачальныхОстатковАбоненты.IDСтроки
	|				И энргВводНачальныхОстатковВзаиморасчеты.Ссылка = энргВводНачальныхОстатковАбоненты.Ссылка
	|				И (энргВводНачальныхОстатковВзаиморасчеты.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковАбоненты.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК энргВводНачальныхОстатков
	|		ПО (энргВводНачальныхОстатков.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВзаиморасчетыДляПроведения.Организация КАК Организация,
	|	ВТ_ВзаиморасчетыДляПроведения.Район КАК Район,
	|	ВТ_ВзаиморасчетыДляПроведения.МКД КАК МКД,
	|	ВТ_ВзаиморасчетыДляПроведения.Абонент КАК Абонент,
	|	ВТ_ВзаиморасчетыДляПроведения.Услуга КАК Услуга,
	|	ВТ_ВзаиморасчетыДляПроведения.ПериодНачисления КАК Период,
	|	ВТ_ВзаиморасчетыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ВзаиморасчетыДляПроведения.Поставщик КАК Поставщик,
	|	ВТ_ВзаиморасчетыДляПроведения.Сумма КАК Сумма,
	|	ВТ_ВзаиморасчетыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_ВзаиморасчетыДляПроведения.Дата КАК Дата,
	|	ВТ_ВзаиморасчетыДляПроведения.ИсточникОплаты КАК ИсточникОплаты,
	|	ВТ_ВзаиморасчетыДляПроведения.ДокументОплаты КАК ДокументОплаты,
	|	ВТ_ВзаиморасчетыДляПроведения.ВидДвижения КАК ВидДвижения
	|ИЗ
	|	ВТ_ВзаиморасчетыДляПроведения КАК ВТ_ВзаиморасчетыДляПроведения
	|ГДЕ
	|	ВТ_ВзаиморасчетыДляПроведения.Сумма > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВзаиморасчетыДляПроведения.Организация КАК Организация,
	|	ВТ_ВзаиморасчетыДляПроведения.Район КАК Район,
	|	ВТ_ВзаиморасчетыДляПроведения.МКД КАК МКД,
	|	ВТ_ВзаиморасчетыДляПроведения.Абонент КАК Абонент,
	|	ВТ_ВзаиморасчетыДляПроведения.Услуга КАК Услуга,
	|	ВТ_ВзаиморасчетыДляПроведения.ПериодНачисления КАК Период,
	|	ВТ_ВзаиморасчетыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ВзаиморасчетыДляПроведения.Поставщик КАК Поставщик,
	|	-ВТ_ВзаиморасчетыДляПроведения.Сумма КАК Сумма,
	|	ВТ_ВзаиморасчетыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_ВзаиморасчетыДляПроведения.Дата КАК Дата,
	|	ВТ_ВзаиморасчетыДляПроведения.ИсточникОплаты КАК ИсточникОплаты,
	|	ВТ_ВзаиморасчетыДляПроведения.ДокументОплаты КАК ДокументОплаты,
	|	ВТ_ВзаиморасчетыДляПроведения.ВидДвижения КАК ВидДвижения
	|ИЗ
	|	ВТ_ВзаиморасчетыДляПроведения КАК ВТ_ВзаиморасчетыДляПроведения
	|ГДЕ
	|	ВТ_ВзаиморасчетыДляПроведения.Сумма < 0";
	
	Пакет 		= Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Движения.энргВзаиморасчеты.Загрузить(Пакет[0].Выгрузить());
	Движения.энргВзаиморасчетыПоМесяцам.Загрузить(Пакет[1].Выгрузить());
	
	ЗаписатьАвансы(Пакет[2].Выгрузить());
	
КонецПроцедуры

Процедура ЗаписатьАвансы(ТЗ)
	
	Движения.энргАвансы.Загрузить(ТЗ);
	Движения.энргАвансыПоступившие.Загрузить(ТЗ);
	
КонецПроцедуры // ЗаписатьАвансы()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли