
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	ЗаполнитьДинамическуюТЧ();
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	бестЛокализацияСервер.ПриСозданииНаСервере_бестПочасоваяВедомость(ЭтотОбъект);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	ОтборПоОбъектуРасчета();
	ОтборПоТочкеУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьТЧ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактаПриИзменении(Элемент)
	ЗаполнитьДинамическуюТЧ(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ОтборПоОбъектуРасчета();
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры 

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	ОтборПоТочкеУчета();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьДинамическуюТЧ(ОчиститьТЧ = Ложь)
	Если ОчиститьТЧ Тогда
		Объект.ПредоставленныеОбъемы.Очистить();
	КонецЕсли;
	Если Объект.ПредоставленныеОбъемы.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
			пДата = Объект.ДатаФактическогоСобытия;
		Иначе
			пДата = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДатаСеанса());
		КонецЕсли;
		ДобавляемыйДень = НачалоМесяца(пДата);
		Пока Месяц(ДобавляемыйДень) = Месяц(пДата) Цикл
			НовСтр 		= ТЗПредоставленныеОбъемы.Добавить();
			НовСтр.День 	= ДобавляемыйДень;
			ТекущийЧас = 0;
			Пока ТекущийЧас < 24 Цикл
				НовСтр["Час" + ТекущийЧас] = -1;
				ТекущийЧас = ТекущийЧас + 1;
			КонецЦикла;
			ДобавляемыйДень = ДобавляемыйДень + 86400;
		КонецЦикла;
	Иначе
		Для каждого стр из Объект.ПредоставленныеОбъемы Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("День", стр.День);
			НайденныеСтроки = ТЗПредоставленныеОбъемы.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполняемаяСтрока = ТЗПредоставленныеОбъемы.Добавить();
			Иначе
				ЗаполняемаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
			ЗаполняемаяСтрока["Час" + стр.Час] 	= стр.Объем;
			ЗаполняемаяСтрока.День 				= стр.День;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТЧ()
	Объект.ПредоставленныеОбъемы.Очистить();
	Для каждого стр Из ТЗПредоставленныеОбъемы Цикл
		ТекущийЧас = 0;
		Пока ТекущийЧас <= 23 Цикл
			НовСтр = Объект.ПредоставленныеОбъемы.Добавить();
			НовСтр.День = стр.День;
			НовСтр.Объем = стр["Час" + ТекущийЧас];
			НовСтр.Час = ТекущийЧас;
			ТекущийЧас = ТекущийЧас + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора(МассивДляВыбора, ИмяРеквизита)
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивДляВыбора));
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(НовыйПараметр);
	Элементы[ИмяРеквизита].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
КонецПроцедуры 

&НаСервере
Процедура ОтборПоОбъектуРасчета() 
	Результат = бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата, Объект.Организация, Объект.Район, Объект.ОбъектРасчета);
	УстановитьПараметрыВыбора(Результат.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"), "ТочкаУчета");
КонецПроцедуры  

&НаСервере
Процедура ОтборПоТочкеУчета() 
	МассивДляВыбора = бестРаботаСприборамиУчетаСервер.ПолучитьМассивДействующихПриборовУчета(Объект.Дата, Объект.Организация, Объект.Район, Объект.ОбъектРасчета, Объект.ТочкаУчета);
	УстановитьПараметрыВыбора(МассивДляВыбора, "ПриборУчета");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти
