#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Функция МассивПриборов() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка"			, Ссылка);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	ТаблицаТочекУчета.КлючПомещения КАК КлючПомещения,
	|	энргОбходнойЛист.ПериодНачисления КАК ПериодНачисления,
	|	энргОбходнойЛист.Организация КАК Организация,
	|	энргОбходнойЛист.Район КАК Район,
	|	энргОбходнойЛист.Дата КАК ПериодРегистрации
	|ПОМЕСТИТЬ АктуальныеПриборы
	|ИЗ
	|	Документ.энргОбходнойЛист.ТочкиУчета КАК ТаблицаТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист КАК энргОбходнойЛист
	|		ПО ТаблицаТочекУчета.Ссылка = энргОбходнойЛист.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ТаблицаТочекУчета.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист.ШкалыПриборовУчета КАК энргОбходнойЛистШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист.ПоказанияПриборовУчета КАК энргОбходнойЛистПоказанияПриборовУчета
	|			ПО энргОбходнойЛистШкалыПриборовУчета.IDСтроки = энргОбходнойЛистПоказанияПриборовУчета.IDСтроки
	|				И энргОбходнойЛистШкалыПриборовУчета.Ссылка = энргОбходнойЛистПоказанияПриборовУчета.Ссылка
	|				И (энргОбходнойЛистПоказанияПриборовУчета.ПоказанияПредоставлены)
	|		ПО ТаблицаТочекУчета.Ссылка = энргОбходнойЛистШкалыПриборовУчета.Ссылка
	|			И ТаблицаТочекУчета.IDСтроки = энргОбходнойЛистШкалыПриборовУчета.IDСтрокиТочкиУчета
	|ГДЕ
	|	ТаблицаТочекУчета.Ссылка = &ссылка
	|	И НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеПриборы.ПриборУчета КАК ПриборУчета,
	|	АктуальныеПриборы.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	АктуальныеПриборы.ИмяТабЧасти КАК ИмяТабЧасти,
	|	АктуальныеПриборы.Разделитель КАК Разделитель,
	|	АктуальныеПриборы.ЧастныйСектор КАК ЧастныйСектор,
	|	АктуальныеПриборы.Строение КАК Строение,
	|	АктуальныеПриборы.Помещение КАК Помещение,
	|	АктуальныеПриборы.КлючПомещения КАК КлючПомещения,
	|	АктуальныеПриборы.ПериодНачисления КАК ПериодНачисления,
	|	АктуальныеПриборы.Организация КАК Организация,
	|	АктуальныеПриборы.Район КАК Район,
	|	АктуальныеПриборы.ПериодРегистрации КАК ПериодРегистрации,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности) КАК СостояниеПроведения
	|ИЗ
	|	АктуальныеПриборы КАК АктуальныеПриборы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргМаксимальныеПоказанияСрез.ПриборУчета,
	|	ЛОЖЬ,
	|	""ПоказанияПриборовУчета"",
	|	0,
	|	энргМаксимальныеПоказанияСрез.ЧастныйСектор,
	|	энргМаксимальныеПоказанияСрез.Строение,
	|	энргМаксимальныеПоказанияСрез.Помещение,
	|	энргКлючиПомещений.КлючПомещения,
	|	энргМаксимальныеПоказанияСрез.ПериодНачисления,
	|	энргМаксимальныеПоказанияСрез.Организация,
	|	энргМаксимальныеПоказанияСрез.Район,
	|	энргМаксимальныеПоказанияСрез.ДатаРегистратора,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеПриборы КАК АктуальныеПриборы
	|		ПО энргМаксимальныеПоказанияСрез.Организация = АктуальныеПриборы.Организация
	|			И энргМаксимальныеПоказанияСрез.ПериодНачисления = АктуальныеПриборы.ПериодНачисления
	|			И энргМаксимальныеПоказанияСрез.Район = АктуальныеПриборы.Район
	|			И энргМаксимальныеПоказанияСрез.ЧастныйСектор = АктуальныеПриборы.ЧастныйСектор
	|			И энргМаксимальныеПоказанияСрез.Строение = АктуальныеПриборы.Строение
	|			И энргМаксимальныеПоказанияСрез.Помещение = АктуальныеПриборы.Помещение
	|			И энргМаксимальныеПоказанияСрез.ПриборУчета = АктуальныеПриборы.ПриборУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО энргМаксимальныеПоказанияСрез.Строение = энргКлючиПомещений.Строение
	|			И энргМаксимальныеПоказанияСрез.Помещение = энргКлючиПомещений.Помещение
	|ГДЕ
	|	АктуальныеПриборы.ПриборУчета ЕСТЬ NULL
	|	И энргМаксимальныеПоказанияСрез.ДокРегистратор = &ссылка
	|	И энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПериодНачисления";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",Истина);
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Отказ = Истина;
		КомментарийОшибки = "Документ не используется";
		ОбщегоНазначения.СообщитьПользователю(КомментарийОшибки);
		ВызватьИсключение КомментарийОшибки;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьВведенныеПоказания(Отказ, РежимПроведения);	 	
		
	Документы.энргОбходнойЛист.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	
	Результат = ПолучитьОбъемыПУ(); 	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(Результат, Движения.энргЗарегистрированныйОбъемПриборов);
	
	Выборка 				= Результат.Выбрать();
	НаборРасчетСреднего 	= РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
	НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНабор = НаборРасчетСреднего.Добавить();		
		ЗаполнитьЗначенияСвойств(СтрокаНабор, Выборка);	
		СтрокаНабор.ОбъемУслуги = Выборка.ОбъемУслугиПотребленный;
		
	КонецЦикла;
	НаборРасчетСреднего.Записать(Ложь);
	
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОбъемыПУ()
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ДокументСсылка КАК ДокРегистратор,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Шкала КАК Шкала,
	               |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ТаблицаПоказанийПриборовУчета.Разница КАК ОбъемУслугиПотребленный,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение,
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	               |		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	               |		ТаблицаШкал.Шкала КАК Шкала,
	               |		ТаблицаШкал.IDСтроки КАК IDСтроки,
	               |		ТаблицаДокумента.Организация КАК Организация,
	               |		ТаблицаДокумента.Район КАК Район,
	               |		энргАбоненты.КлючПомещения КАК КлючПомещения,
	               |		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	               |		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	               |		ТаблицаПриборовУчета.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	               |		&Период КАК Период
	               |	ИЗ
	               |		Документ.энргОбходнойЛист.ТочкиУчета КАК ТаблицаПриборовУчета
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист.ШкалыПриборовУчета КАК ТаблицаШкал
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	               |				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	               |				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	               |			ПО ТаблицаПриборовУчета.Абонент = энргАбоненты.Ссылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист КАК ТаблицаДокумента
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОбходнойЛист.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	               |		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	               |			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	               |			И (ВложенныйЗапрос.РегистрируетОбъем)
	               |			И (ТаблицаПоказанийПриборовУчета.ПоказанияПредоставлены)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка"	,Ссылка);
	Запрос.УстановитьПараметр("Период"			,Дата);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#Область ПроверкаВведенныхПоказаний

Процедура ПроверитьВведенныеПоказания(Отказ, РежимПроведения)
	
	ПоказанияПриняты = Перечисления.энргСостояниеПоказаний.Приняты;
	
	ОтборШкал = Новый Структура("IDСтроки", новый УникальныйИдентификатор);
	ОтборТочек = Новый Структура("IDСтроки", новый УникальныйИдентификатор);
	Для Каждого СтрПоказания из ПоказанияПриборовУчета Цикл 
		
		Если СтрПоказания.ПоказанияПредоставлены И СтрПоказания.СостояниеПоказаний = ПоказанияПриняты 
				И СтрПоказания.ПредыдущиеПоказания > 0 и СтрПоказания.ТекущиеПоказания = 0 Тогда
				
			Постфикс = "";
			ОтборШкал.IDСтроки = СтрПоказания.IDСтроки;
			СтрокиШкал = ШкалыПриборовУчета.НайтиСтроки(ОтборШкал);
			Если СтрокиШкал.Количество() > 0 Тогда
				СтрокаШкал = СтрокиШкал[0];
				
				ОтборТочек.IDСтроки = СтрокаШкал.IDСтрокиТочкиУчета;
				СтрокиТочек = ТочкиУчета.НайтиСтроки(ОтборТочек);
				Если СтрокиТочек.Количество() > 0 Тогда
					СтрокаТочек = СтрокиТочек[0];
					Постфикс = " в строке: " + СтрокаТочек.НомерСтроки;	
				КонецЕсли;				
				
			КонецЕсли;
			
			ТекстСообщения = "Конечные показания не заполнены" + Постфикс;	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли