#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидОперации 				= Параметры.ВидОперации;
	ЗаголовокЗначения 			= Параметры.ЗаголовокЗначения;
	Абонент						= Параметры.Абонент;
	КлючПомещения				= Параметры.КлючПомещения;
	Район						= Параметры.Район;
	Организация					= Параметры.Организация;
	ПериодНачисления			= Параметры.ПериодНачисления;
	Дата						= Параметры.Дата;
	РавноКоличествуПроживающих	= Параметры.РавноКоличествуПроживающих;
	РавноКоличествуПрописанных	= Параметры.РавноКоличествуПрописанных;
	ТекПриборУчета				= Параметры.ПриборУчета;
	
	УправлениеВидимостьюРеквизитов(ВидОперации, ЗаголовокЗначения);
	
	Если Не ТекПриборУчета		= Неопределено Тогда
		ЗаполнитьПоказанияПУ(Дата, Абонент, ТекПриборУчета);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФОрмыПоказания

&НаКлиенте
Процедура ПоказанияТекущееПоказаниеПриИзменении(Элемент)
	текСтрока = Элементы.Показания.ТекущиеДанные;
	ДопПараметры	= Новый Структура;
	//ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТекстВопроса", "");	
	
	ПересчитатьСтрокуПриборовУчета(текСтрока,Дата,Ложь,ДопПараметры);	
	
	Если ЗначениеЗаполнено(ДопПараметры.ТекстВопроса) Тогда
		ДопПараметры.Вставить("ТекСтрока", 		ТекСтрока.ПолучитьИдентификатор());	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Если ВидОперации = "энргУстановитьЗначениеПлощади" Тогда
		ДокументИзменениеПлощади();
	ИначеЕсли ВидОперации = "энргУстановитьКоличествоПроживающих" Тогда	
		ДокументИзменениеКоличестваПроживающих();
	ИначеЕсли ВидОперации = "энргУстановитьКоличествоПрописанных" Тогда
		ДокументИзменениеКоличестваПрописанных();
	ИначеЕсли ВидОперации = "энргУстановитьКоличествоСобственников" Тогда
		ДокументИзменениеКоличестваСобственников();
	ИначеЕсли ВидОперации = "энргУстановитьКоличествоКомнат" Тогда	
		ДокументИзменениеКоличестваКомнат();
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюРеквизитов(ВидОперации, Заголовок)
	Если ВидОперации = "энргУстановитьЗначениеПлощади" Тогда
		Элементы.ВидПлощади.Видимость 					= Истина;
		Элементы.РавноКоличествуПрописанных.Видимость	= Ложь;					
		Элементы.РавноКоличествуПроживающих.Видимость 	= Ложь;
		Элементы.ИсточникПоказаний.Видимость 			= Ложь;
		Элементы.Показания.Видимость 					= Ложь;
	КонецЕсли;
	Если ВидОперации = "энргУстановитьКоличествоКомнат" Тогда
		Элементы.РавноКоличествуПрописанных.Видимость	= Ложь;					
		Элементы.РавноКоличествуПроживающих.Видимость 	= Ложь;
		Элементы.ВидПлощади.Видимость 					= Ложь;
		Элементы.Показания.Видимость 					= Ложь;
		Элементы.ИсточникПоказаний.Видимость 			= Ложь;
	КонецЕсли;
	Если ВидОперации = "энргУстановитьКоличествоПроживающих" Тогда
		Элементы.ВидПлощади.Видимость 					= Ложь;
		Элементы.РавноКоличествуПрописанных.Видимость 	= Истина;					
		Элементы.РавноКоличествуПроживающих.Видимость 	= Ложь;
		Элементы.Показания.Видимость 					= Ложь;
		Элементы.ИсточникПоказаний.Видимость 			= Ложь;
	КонецЕсли;
	Если ВидОперации = "энргУстановитьКоличествоПрописанных" Тогда
		Элементы.ВидПлощади.Видимость 					= Ложь;
		Элементы.РавноКоличествуПроживающих.Видимость 	= Истина;
		Элементы.РавноКоличествуПрописанных.Видимость 	= Ложь;
		Элементы.Показания.Видимость 					= Ложь;
		Элементы.ИсточникПоказаний.Видимость 			= Ложь;
	КонецЕсли;	
	Если ВидОперации = "энргУстановитьКоличествоСобственников" Тогда
		Элементы.ВидПлощади.Видимость 					= Ложь;
		Элементы.РавноКоличествуПроживающих.Видимость 	= Ложь;
		Элементы.РавноКоличествуПрописанных.Видимость 	= Ложь;
		Элементы.Показания.Видимость 					= Ложь;
		Элементы.ИсточникПоказаний.Видимость 			= Ложь;
	КонецЕсли;	
	
	ЭтаФорма.Заголовок				= Заголовок;
	//Элементы.Значение.Заголовок 	= Заголовок;
КонецПроцедуры

&НаСервере
Процедура ДокументИзменениеПлощади()
	ТекДок	= Документы.энргУстановитьЗначениеПлощади.СоздатьДокумент();
	ТекДок.Дата 			= Дата;
	ТекДок.ПериодНачисления = ПериодНачисления;
	ТекДок.Абонент 			= Абонент;
	ТекДок.КлючПомещения	= КлючПомещения;
	ТекДок.Организация		= Организация;
	ТекДок.Район			= Район;
	
	НовСтрока				= ТекДок.Площади.Добавить();
	НовСтрока.ВидПлощади	= ВидПлощади;
	НовСтрока.Значение		= Значение;
	
	ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту " + Строка(Абонент) + " с ЛС " + Абонент.ЛицевойСчет + " создан документ " + Строка(ТекДок.Ссылка));	
КонецПроцедуры

&НаСервере
Процедура ДокументИзменениеКоличестваКомнат()
	ТекДок	= Документы.энргУстановитьКоличествоКомнат.СоздатьДокумент();
	ТекДок.Дата 			= Дата;
	ТекДок.ПериодНачисления = ПериодНачисления;
	ТекДок.Абонент 			= Абонент;
	ТекДок.КлючПомещения	= КлючПомещения;
	ТекДок.Организация		= Организация;
	ТекДок.Район			= Район;
	ТекДок.Количество		= Значение;
	
	ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту " + Строка(Абонент) + " с ЛС " + Абонент.ЛицевойСчет + " создан документ " + Строка(ТекДок.Ссылка));	
КонецПроцедуры

&НаСервере
Процедура ДокументИзменениеКоличестваСобственников()
	ТекДок	= Документы.энргУстановитьКоличествоСобственников.СоздатьДокумент();
	ТекДок.Дата 			= Дата;
	ТекДок.ПериодНачисления = ПериодНачисления;
	ТекДок.Абонент 			= Абонент;
	ТекДок.КлючПомещения	= КлючПомещения;
	ТекДок.Организация		= Организация;
	ТекДок.Район			= Район;
	ТекДок.Количество		= Значение;
	
	ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту " + Строка(Абонент) + " с ЛС " + Абонент.ЛицевойСчет + " создан документ " + Строка(ТекДок.Ссылка)); 
КонецПроцедуры

&НаСервере
Процедура ДокументИзменениеКоличестваПрописанных()
	ТекДок	= Документы.энргУстановитьКоличествоПрописанных.СоздатьДокумент();
	ТекДок.Дата 			= Дата;
	ТекДок.ПериодНачисления = ПериодНачисления;
	ТекДок.Абонент 			= Абонент;
	ТекДок.КлючПомещения	= КлючПомещения;
	ТекДок.Организация		= Организация;
	ТекДок.Район			= Район;
	ТекДок.Количество		= Значение;
	
	ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту " + Строка(Абонент) + " с ЛС " + Абонент.ЛицевойСчет + " создан документ " + Строка(ТекДок.Ссылка));
	Если РавноКоличествуПроживающих Тогда
		ДокументИзменениеКоличестваПроживающих();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДокументИзменениеКоличестваПроживающих()
	ТекДок					= Документы.энргУстановитьКоличествоПроживающих.СоздатьДокумент();
	ТекДок.Дата 			= Дата;
	ТекДок.ПериодНачисления = ПериодНачисления;
	ТекДок.Абонент 			= Абонент;
	ТекДок.КлючПомещения	= КлючПомещения;
	ТекДок.Организация		= Организация;
	ТекДок.Район			= Район;
	ТекДок.Количество		= Значение;
	
	ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту " + Строка(Абонент) + " с ЛС " + Абонент.ЛицевойСчет + " создан документ " + Строка(ТекДок.Ссылка));
	
	Если РавноКоличествуПрописанных Тогда
		ДокументИзменениеКоличестваПрописанных();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьПоказанияПУ(ТекДата, ТекАбонент, ТекПриборУчета)
	Запрос = Новый ЗАпрос;
	Запрос.УстановитьПараметр("Абонент",		ТекАбонент);
	Запрос.УстановитьПараметр("Дата", 			ТекДата);
	Запрос.УстановитьПараметр("ПриборУчета",	ТекПриборУчета);
	Текст = "ВЫБРАТЬ
	        |	ВложенныйЗапрос.Абонент КАК Абонент,
	        |	ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет,
	        |	энргСтроения.Город КАК Город,
	        |	ВложенныйЗапрос.Помещение КАК Квартира,
	        |	энргСтроения.Корпус КАК Корпус,
	        |	энргСтроения.Улица КАК Улица,
	        |	ВложенныйЗапрос.Район КАК Район,
	        |	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	        |	ВложенныйЗапрос.Организация КАК Организация,
	        |	ВложенныйЗапрос.СтарыйЛС КАК СтарыйЛС,
	        |	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	        |	ВложенныйЗапрос.Строение КАК Строение,
	        |	ВложенныйЗапрос.Помещение КАК Помещение,
	        |	энргПомещения.НомерДляСортировки КАК НомерДляСортировки
	        |ПОМЕСТИТЬ ВрТ0
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		энргАбоненты.Ссылка КАК Абонент,
	        |		энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	        |		энргАбоненты.Организация КАК Организация,
	        |		энргАбоненты.Район КАК Район,
	        |		энргАбоненты.СтарыйЛС КАК СтарыйЛС,
	        |		энргАбоненты.КлючПомещения КАК КлючПомещения,
	        |		энргКлючиПомещений.Строение КАК Строение,
	        |		энргКлючиПомещений.Помещение КАК Помещение,
	        |		энргАбоненты.ФизЛицо КАК ФизЛицо
	        |	ИЗ
	        |		Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	        |			ПО (энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка)
	        |	ГДЕ
	        |		1 = 1
	        |		И энргАбоненты.Ссылка = &Абонент
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		энргКлючиПомещений.Строение,
	        |		энргКлючиПомещений.Помещение,
	        |		энргАбоненты.Ссылка,
	        |		энргАбоненты.ЛицевойСчет,
	        |		энргАбоненты.Организация,
	        |		энргАбоненты.Район,
	        |		энргАбоненты.СтарыйЛС,
	        |		энргАбоненты.КлючПомещения,
	        |		энргАбоненты.ФизЛицо) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	        |		ПО ВложенныйЗапрос.Строение = энргСтроения.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	        |		ПО ВложенныйЗапрос.Помещение = энргПомещения.Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВложенныйЗапрос.Абонент,
	        |	ВложенныйЗапрос.ЛицевойСчет,
	        |	ВложенныйЗапрос.Район,
	        |	ВложенныйЗапрос.Организация,
	        |	ВложенныйЗапрос.СтарыйЛС,
	        |	ВложенныйЗапрос.КлючПомещения,
	        |	ВложенныйЗапрос.ФизЛицо,
	        |	энргСтроения.Город,
	        |	ВложенныйЗапрос.Помещение,
	        |	энргСтроения.Корпус,
	        |	энргСтроения.Улица,
	        |	ВложенныйЗапрос.Строение,
	        |	энргПомещения.НомерДляСортировки,
	        |	ВложенныйЗапрос.Помещение
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВрТ0.Абонент КАК Абонент,
	        |	ВрТ0.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВрТ0.Город КАК Город,
	        |	ВрТ0.Квартира КАК Квартира,
	        |	ВрТ0.Корпус КАК Корпус,
	        |	ВрТ0.Улица КАК Улица,
	        |	ВрТ0.Район КАК Район,
	        |	ВрТ0.ФизЛицо КАК ФизЛицо,
	        |	ВрТ0.Организация КАК Организация,
	        |	ВрТ0.СтарыйЛС КАК СтарыйЛС,
	        |	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета.Расположение КАК Расположение,
	        |	ВрТ0.КлючПомещения КАК КлючПомещения,
	        |	ВрТ0.Строение КАК Строение,
	        |	ВрТ0.Помещение КАК Помещение,
	        |	ВрТ0.НомерДляСортировки КАК НомерДляСортировки
	        |ПОМЕСТИТЬ ВрТ1
	        |ИЗ
	        |	ВрТ0 КАК ВрТ0
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(&Дата, ) КАК энргАктивностьТочекУчетаСрезПоследних
	        |		ПО ВрТ0.КлючПомещения = энргАктивностьТочекУчетаСрезПоследних.КлючПомещения
	        |			И ВрТ0.Организация = энргАктивностьТочекУчетаСрезПоследних.Организация
	        |			И ВрТ0.Район = энргАктивностьТочекУчетаСрезПоследних.Район
	        |			И (энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВрТ0.Район,
	        |	ВрТ0.ФизЛицо,
	        |	ВрТ0.СтарыйЛС,
	        |	ВрТ0.Организация,
	        |	ВрТ0.Квартира,
	        |	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета,
	        |	ВрТ0.Абонент,
	        |	ВрТ0.Улица,
	        |	ВрТ0.Город,
	        |	ВрТ0.ЛицевойСчет,
	        |	ВрТ0.Корпус,
	        |	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета.Расположение,
	        |	ВрТ0.КлючПомещения,
	        |	ВрТ0.Строение,
	        |	ВрТ0.Помещение,
	        |	ВрТ0.НомерДляСортировки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВрТ1.Абонент КАК Абонент,
	        |	ВрТ1.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВрТ1.Город КАК Город,
	        |	ВрТ1.Квартира КАК Квартира,
	        |	ВрТ1.Корпус КАК Корпус,
	        |	ВрТ1.Улица КАК Улица,
	        |	ВрТ1.Район КАК Район,
	        |	ВрТ1.ФизЛицо КАК ФизЛицо,
	        |	ВрТ1.Организация КАК Организация,
	        |	ВрТ1.СтарыйЛС КАК СтарыйЛС,
	        |	ВрТ1.ТочкаУчета КАК ТочкаУчета,
	        |	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга,
	        |	ВрТ1.Расположение КАК Расположение,
	        |	ВрТ1.КлючПомещения КАК КлючПомещения,
	        |	ВрТ1.Строение КАК Строение,
	        |	ВрТ1.Помещение КАК Помещение,
	        |	ВрТ1.НомерДляСортировки КАК НомерДляСортировки
	        |ПОМЕСТИТЬ ВрТ2
	        |ИЗ
	        |	ВрТ1 КАК ВрТ1
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(&Дата, ) КАК энргУслугиТочекУчетаСрезПоследних
	        |		ПО ВрТ1.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета
	        |			И ВрТ1.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
	        |			И ВрТ1.Район = энргУслугиТочекУчетаСрезПоследних.Район
	        |			И ВрТ1.Организация = энргУслугиТочекУчетаСрезПоследних.Организация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВрТ2.Абонент КАК Абонент,
	        |	ВрТ2.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВрТ2.Город КАК Город,
	        |	ВрТ2.Квартира КАК Квартира,
	        |	ВрТ2.Корпус КАК Корпус,
	        |	ВрТ2.Улица КАК Улица,
	        |	ВрТ2.Район КАК Район,
	        |	ВрТ2.ФизЛицо КАК ФизЛицо,
	        |	ВрТ2.Организация КАК Организация,
	        |	ВрТ2.СтарыйЛС КАК СтарыйЛС,
	        |	ВрТ2.ТочкаУчета КАК ТочкаУчета,
	        |	ВрТ2.Услуга КАК Услуга,
	        |	ЕСТЬNULL(энргПриборыТочекУчетаСрезПоследних.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)) КАК ПриборУчета,
	        |	ЕСТЬNULL(энргПриборыТочекУчетаСрезПоследних.ПриборУчета.ТипПрибораУчета, ЗНАЧЕНИЕ(Справочник.энргТипыПриборовУчета.ПустаяСсылка)) КАК ТипПрибораУчета,
	        |	ВрТ2.Расположение КАК Расположение,
	        |	ВрТ2.КлючПомещения КАК КлючПомещения,
	        |	ВрТ2.Строение КАК Строение,
	        |	ВрТ2.Помещение КАК Помещение,
	        |	ВрТ2.НомерДляСортировки КАК НомерДляСортировки
	        |ПОМЕСТИТЬ ВрТ3
	        |ИЗ
	        |	ВрТ2 КАК ВрТ2
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПриборыТочекУчета.СрезПоследних(&Дата, ) КАК энргПриборыТочекУчетаСрезПоследних
	        |		ПО ВрТ2.КлючПомещения = энргПриборыТочекУчетаСрезПоследних.КлючПомещения
	        |			И ВрТ2.Район = энргПриборыТочекУчетаСрезПоследних.Район
	        |			И ВрТ2.Организация = энргПриборыТочекУчетаСрезПоследних.Организация
	        |			И ВрТ2.ТочкаУчета = энргПриборыТочекУчетаСрезПоследних.ТочкаУчета
	        |			И (энргПриборыТочекУчетаСрезПоследних.ПриборУчета = &ПриборУчета)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВрТ2.Квартира,
	        |	ВрТ2.ЛицевойСчет,
	        |	ВрТ2.Улица,
	        |	ВрТ2.Корпус,
	        |	ВрТ2.Абонент,
	        |	ВрТ2.Город,
	        |	ВрТ2.Район,
	        |	ВрТ2.ТочкаУчета,
	        |	ВрТ2.Организация,
	        |	ВрТ2.ФизЛицо,
	        |	ВрТ2.Услуга,
	        |	ВрТ2.СтарыйЛС,
	        |	ЕСТЬNULL(энргПриборыТочекУчетаСрезПоследних.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)),
	        |	ЕСТЬNULL(энргПриборыТочекУчетаСрезПоследних.ПриборУчета.ТипПрибораУчета, ЗНАЧЕНИЕ(Справочник.энргТипыПриборовУчета.ПустаяСсылка)),
	        |	ВрТ2.Расположение,
	        |	ВрТ2.КлючПомещения,
	        |	ВрТ2.Строение,
	        |	ВрТ2.Помещение,
	        |	ВрТ2.НомерДляСортировки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВрТ3.Абонент КАК Абонент,
	        |	ВрТ3.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВрТ3.Город КАК Город,
	        |	ВрТ3.Квартира КАК Квартира,
	        |	ВрТ3.Корпус КАК Корпус,
	        |	ВрТ3.Улица КАК Улица,
	        |	ВрТ3.Район КАК Район,
	        |	ВрТ3.ФизЛицо КАК ФизЛицо,
	        |	ВрТ3.Организация КАК Организация,
	        |	ВрТ3.СтарыйЛС КАК СтарыйЛС,
	        |	ВрТ3.ТочкаУчета КАК ТочкаУчета,
	        |	ВрТ3.Услуга КАК Услуга,
	        |	ВрТ3.ПриборУчета КАК ПриборУчета,
	        |	ВрТ3.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВрТ3.Расположение КАК Расположение,
	        |	ВрТ3.КлючПомещения КАК КлючПомещения,
	        |	ВрТ3.Строение КАК Строение,
	        |	ВрТ3.Помещение КАК Помещение,
	        |	ВрТ3.НомерДляСортировки КАК НомерДляСортировки
	        |ПОМЕСТИТЬ ВрТ4
	        |ИЗ
	        |	ВрТ3 КАК ВрТ3
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУчетаАбонента.СрезПоследних(&Дата, ) КАК энргСостояниеПриборовУчетаАбонентаСрезПоследних
	        |		ПО ВрТ3.КлючПомещения = энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения
	        |			И ВрТ3.Район = энргСостояниеПриборовУчетаАбонентаСрезПоследних.Район
	        |			И ВрТ3.Организация = энргСостояниеПриборовУчетаАбонентаСрезПоследних.Организация
	        |			И ВрТ3.ТочкаУчета = энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета
	        |			И ВрТ3.ПриборУчета = энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета
	        |			И (энргСостояниеПриборовУчетаАбонентаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.ВВод))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВрТ3.ЛицевойСчет,
	        |	ВрТ3.Город,
	        |	ВрТ3.Улица,
	        |	ВрТ3.Организация,
	        |	ВрТ3.ТочкаУчета,
	        |	ВрТ3.Корпус,
	        |	ВрТ3.Услуга,
	        |	ВрТ3.ПриборУчета,
	        |	ВрТ3.ФизЛицо,
	        |	ВрТ3.Абонент,
	        |	ВрТ3.Район,
	        |	ВрТ3.СтарыйЛС,
	        |	ВрТ3.Квартира,
	        |	ВрТ3.ТипПрибораУчета,
	        |	ВрТ3.Расположение,
	        |	ВрТ3.КлючПомещения,
	        |	ВрТ3.Строение,
	        |	ВрТ3.Помещение,
	        |	ВрТ3.НомерДляСортировки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВрТ4.Абонент КАК Абонент,
	        |	ВрТ4.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВрТ4.Город КАК Город,
	        |	ВрТ4.Квартира КАК Квартира,
	        |	ВрТ4.Корпус КАК Корпус,
	        |	ВрТ4.Улица КАК Улица,
	        |	ВрТ4.Район КАК Район,
	        |	ВрТ4.ФизЛицо КАК ФизЛицо,
	        |	ВрТ4.Организация КАК Организация,
	        |	ВрТ4.СтарыйЛС КАК СтарыйЛС,
	        |	ВрТ4.ТочкаУчета КАК ТочкаУчета,
	        |	ВрТ4.Услуга КАК Услуга,
	        |	ВрТ4.ПриборУчета КАК ПриборУчета,
	        |	ВрТ4.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВрТ4.Расположение КАК Расположение,
	        |	ВрТ4.КлючПомещения КАК КлючПомещения,
	        |	ВрТ4.Строение КАК Строение,
	        |	ВрТ4.Помещение КАК Помещение,
	        |	ВрТ4.НомерДляСортировки КАК НомерДляСортировки,
	        |	ЕСТЬNULL(энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент, 1) КАК Коэффициент
	        |ПОМЕСТИТЬ ВрТ5
	        |ИЗ
	        |	ВрТ4 КАК ВрТ4
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(&Дата, ) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	        |		ПО ВрТ4.Организация = энргКоэффциентыПриборовУчетаСрезПоследних.Организация
	        |			И ВрТ4.Район = энргКоэффциентыПриборовУчетаСрезПоследних.Район
	        |			И ВрТ4.КлючПомещения = энргКоэффциентыПриборовУчетаСрезПоследних.КлючПомещения
	        |			И ВрТ4.ПриборУчета = энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВрТ4.ЛицевойСчет,
	        |	ВрТ4.Квартира,
	        |	ВрТ4.Корпус,
	        |	ВрТ4.Район,
	        |	ВрТ4.ФизЛицо,
	        |	ВрТ4.Абонент,
	        |	ВрТ4.Город,
	        |	ВрТ4.Улица,
	        |	ВрТ4.Расположение,
	        |	ВрТ4.ТипПрибораУчета,
	        |	ВрТ4.Услуга,
	        |	ВрТ4.Строение,
	        |	ВрТ4.Организация,
	        |	ВрТ4.Помещение,
	        |	ВрТ4.НомерДляСортировки,
	        |	ВрТ4.ТочкаУчета,
	        |	ВрТ4.ПриборУчета,
	        |	ВрТ4.КлючПомещения,
	        |	ВрТ4.СтарыйЛС,
	        |	ЕСТЬNULL(энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент, 1)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВрТ5.Абонент КАК Абонент,
	        |	ВрТ5.ЛицевойСчет КАК ЛицевойСчет,
	        |	ВрТ5.Город КАК Город,
	        |	ВрТ5.Квартира КАК Квартира,
	        |	ВрТ5.Корпус КАК Корпус,
	        |	ВрТ5.Улица КАК Улица,
	        |	ВрТ5.Район КАК Район,
	        |	ВрТ5.ФизЛицо КАК ФизЛицо,
	        |	ВрТ5.Организация КАК Организация,
	        |	ВрТ5.СтарыйЛС КАК СтарыйЛС,
	        |	ВрТ5.ТочкаУчета КАК ТочкаУчета,
	        |	ВрТ5.Услуга КАК Услуга,
	        |	ВрТ5.ПриборУчета КАК ПриборУчета,
	        |	ЕСТЬNULL(энргПоказанияПриборовУчетаСрезПоследних.Шкала, """") КАК Шкала,
	        |	ЕСТЬNULL(энргПоказанияПриборовУчетаСрезПоследних.ТарифнаяЗона, """") КАК ТарифнаяЗона,
	        |	ЕСТЬNULL(энргПоказанияПриборовУчетаСрезПоследних.Показание, 0) КАК ПредыдущиеПоказания,
	        |	ВрТ5.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	энргПоказанияПриборовУчетаСрезПоследних.Период КАК ДатаПоследнихПоказаний,
	        |	ВрТ5.Расположение КАК Расположение,
	        |	ВрТ5.КлючПомещения КАК КлючПомещения,
	        |	ВрТ5.Строение КАК Строение,
	        |	ВрТ5.Помещение КАК Помещение,
	        |	ВрТ5.НомерДляСортировки КАК НомерДляСортировки,
	        |	ВрТ5.Коэффициент КАК КоэффициентПУ
	        |ИЗ
	        |	ВрТ5 КАК ВрТ5
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета.СрезПоследних(&Дата, ) КАК энргПоказанияПриборовУчетаСрезПоследних
	        |		ПО ВрТ5.КлючПомещения = энргПоказанияПриборовУчетаСрезПоследних.КлючПомещения
	        |			И ВрТ5.Район = энргПоказанияПриборовУчетаСрезПоследних.Район
	        |			И ВрТ5.Организация = энргПоказанияПриборовУчетаСрезПоследних.Организация
	        |			И ВрТ5.ПриборУчета = энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	        |			И (энргПоказанияПриборовУчетаСрезПоследних.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВрТ5.ПриборУчета,
	        |	ВрТ5.Абонент,
	        |	ВрТ5.ЛицевойСчет,
	        |	ВрТ5.Город,
	        |	ВрТ5.Улица,
	        |	ВрТ5.Район,
	        |	ВрТ5.ФизЛицо,
	        |	ВрТ5.СтарыйЛС,
	        |	ЕСТЬNULL(энргПоказанияПриборовУчетаСрезПоследних.Шкала, """"),
	        |	ВрТ5.Корпус,
	        |	ВрТ5.Квартира,
	        |	ВрТ5.ТочкаУчета,
	        |	ВрТ5.Организация,
	        |	ВрТ5.Услуга,
	        |	ЕСТЬNULL(энргПоказанияПриборовУчетаСрезПоследних.ТарифнаяЗона, """"),
	        |	ВрТ5.ТипПрибораУчета,
	        |	ЕСТЬNULL(энргПоказанияПриборовУчетаСрезПоследних.Показание, 0),
	        |	энргПоказанияПриборовУчетаСрезПоследних.Период,
	        |	ВрТ5.Расположение,
	        |	ВрТ5.КлючПомещения,
	        |	ВрТ5.Строение,
	        |	ВрТ5.Помещение,
	        |	ВрТ5.НомерДляСортировки,
	        |	ВрТ5.Коэффициент
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	НомерДляСортировки
	        |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст = Текст;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтрока = Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);			
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ТекСтрока,ПериодНачисления,КонтрольныйСъем = ложь, ДопПараметры)
	ТекстОшибки							= "";	
	
	ПоказанияЗа 						= ?(НачалоМесяца(ТекСтрока.ДатаПоследнихПоказаний) - ПериодНачисления = 0 ,1,1 + Цел((ПериодНачисления - ТекСтрока.ДатаПоследнихПоказаний) / (30*86400)));
		
	МаксимальныеВозможныеПоказания 		=  pow(10,СтрДлина(СтрЗаменить(СтрЗаменить(ТекСтрока.ПредыдущиеПоказания,Символы.НПП,"")," ","")));
	
	МаксимальныйРасходЗаПериод 			=  Макс(ТекСтрока.СреднийОбъемПотребления,ТекСтрока.МаксимальноВозможныйОбъемПотребления)*ПоказанияЗа;
	
	//Расход 								= (ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания) * ТекСтрока.КоэффициентПУ;
	Расход 								= ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
	
	//РасходСПереворотом 					= (ТекСтрока.МаксимальноВозможныеПоказания - ТекСтрока.ПредыдущиеПоказания + ТекСтрока.ТекущиеПоказания) *ТекСтрока.КоэффициентПУ;
	РасходСПереворотом 					= ТекСтрока.МаксимальноВозможныеПоказания - ТекСтрока.ПредыдущиеПоказания + ТекСтрока.ТекущиеПоказания;
	
	//РасходПоМодулю 						= ?(ТекСтрока.ТекущиеПоказания>ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ПредыдущиеПоказания -ТекСтрока.ТекущиеПоказания) *ТекСтрока.КоэффициентПУ ;
	РасходПоМодулю 						= ?(ТекСтрока.ТекущиеПоказания>ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ПредыдущиеПоказания -ТекСтрока.ТекущиеПоказания);
	
	
	Если ТекСтрока.СтатусИзмененПользователем  тогда
		Если ТекСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты") тогда
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход); 		
		иначе
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход);			
		КонецЕсли;
		 ТекСтрока.Сумма 				= ТекСтрока.Разница * ТекСтрока.ЗначениеТарифа;
		Возврат;
	КонецЕсли;  	
		
	Если ТекСтрока.ПереворотИзмененПользователем  тогда
		Если ТекСтрока.Переворот тогда
			 ТекСтрока.Разница 			= РасходСПереворотом;
			 ТекСтрока.Сумма 			= ТекСтрока.Разница * ТекСтрока.ЗначениеТарифа;
			 Возврат;
		 КонецЕсли;
	КонецЕсли;
	
	Если ТекСтрока.ПредыдущиеПоказания < 0 тогда
		ТекСтрока.ПредыдущиеПоказания = 0;
	КонецЕсли;
	
	ДопПараметры.Вставить("ТекущиеПоказания", 			ТекСтрока.ТекущиеПоказания);
	ДопПараметры.Вставить("ДатаПоследнихПоказаний", 	ТекСтрока.ДатаПоследнихПоказаний);
	ДопПараметры.Вставить("ПредыдущиеПоказания", 		ТекСтрока.ПредыдущиеПоказания);
	
	Если ТекСтрока.ПредыдущиеПоказания = 0 тогда
		ПорядокНачальных 				= 1;
	иначе
		Порядок 						= Log10(ТекСтрока.ПредыдущиеПоказания);
		ПорядокНачальных 				= Цел(Порядок);
	КонецЕсли;
	
	Если ТекСтрока.ТекущиеПоказания = 0 тогда
		ПорядокКонечных 				= 1;
	иначе
		Порядок 						= Log10(ТекСтрока.ТекущиеПоказания);
		ПорядокКонечных 				= Цел(Порядок);
	КонецЕсли;	 
	
	Если Расход < 0  и ПорядокНачальных = ПорядокКонечных тогда
		 ТекСтрока.Разница 				= Расход;
		 ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		 
		 ДопПараметры.Вставить("Разница", 				ТекСтрока.Разница);
		 ДопПараметры.Вставить("ТекстОшибки", 			"");
		 ДопПараметры.Вставить("СостояниеПоказаний",	ТекСтрока.СостояниеПоказаний);		 
		 Возврат;
	КонецЕсли; 
	
	// определяем расход
	Если ТекСтрока.ТекущиеПоказания < 0 тогда
		ТекСтрока.Разница 				= 0;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ДопПараметры.Вставить("ТекстОшибки", 			"");
	ИначеЕсли КонтрольныйСъем и  Расход >=  0 тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли КонтрольныйСъем  тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= Ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ДопПараметры.Вставить("ТекстОшибки", 			"");
	ИначеЕсли Расход >= 0 И Расход< МаксимальныйРасходЗаПериод тогда	
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли Расход >= 0 и МаксимальныйРасходЗаПериод = 0 тогда	
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	иначе
		ТекСтрока.Разница 				= -РасходПоМодулю;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ДопПараметры.Вставить("ТекстОшибки", 			"");
	КонецЕсли;  	
	ДопПараметры.Вставить("Разница", 			ТекСтрока.Разница);
	ДопПараметры.Вставить("СостояниеПоказаний",	ТекСтрока.СостояниеПоказаний);
	
	ТекСтрока.Сумма 					= ТекСтрока.Разница * ТекСтрока.ЗначениеТарифа; 
	
КонецПроцедуры

#КонецОбласти