#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция МассивПриборов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Текст  			= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПоказаний.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	0 КАК Разделитель,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти
	|ИЗ
	|	Документ.энргУстановитьВидДифференцированностиПриборУчета.ТочкиУчета КАК ТаблицаТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ШкалыПриборовУчета КАК ШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ПоказанияПриборовУчета КАК ТаблицаПоказаний
	|			ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказаний.Ссылка
	|				И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказаний.IDСтроки
	|		ПО ТаблицаТочекУчета.Ссылка = ШкалыПриборовУчета.Ссылка
	|			И ТаблицаТочекУчета.IDСтрокиВывод = ШкалыПриборовУчета.IDСтрокиТочкиУчета
	|			И (ТаблицаТочекУчета.Ссылка = &Ссылка)
	|			И (ШкалыПриборовУчета.Ссылка = &Ссылка)
	|			И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	
	Запрос.Текст 	= Текст; 	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();			
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	ДанныеШапки = ДанныеШапки();
		
	энргРаботаСприборамиУчетаСервер.УстановитьВидДифференцированностиПриборовУчета(ДанныеШапки,Движения);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеШапки,Движения);
	
	Результат = ПолучитьОбъемыПУ(); 	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(Результат, Движения.энргЗарегистрированныйОбъемПриборов);
	
	Выборка = Результат.Выбрать();
	НаборРасчетСреднего = РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
	НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНабор = НаборРасчетСреднего.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНабор,Выборка);	
		СтрокаНабор.ОбъемУслуги = Выборка.ОбъемУслугиПотребленный;
		
	КонецЦикла;
	НаборРасчетСреднего.Записать(Ложь);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район); 
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Документ",				Ссылка);  	
	
	Возврат ДанныеШапки;
	
КонецФункции

Функция ПолучитьОбъемыПУ()
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ДокументСсылка КАК ДокРегистратор,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Шкала КАК Шкала,
	               |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ТаблицаПоказанийПриборовУчета.Разница КАК ОбъемУслугиПотребленный,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение,
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	               |		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	               |		ТаблицаШкал.Шкала КАК Шкала,
	               |		ТаблицаШкал.IDСтроки КАК IDСтроки,
	               |		ТаблицаДокумента.Организация КАК Организация,
	               |		ТаблицаДокумента.Район КАК Район,
	               |		ТаблицаДокумента.КлючПомещения КАК КлючПомещения,
	               |		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	               |		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	               |		ТаблицаПриборовУчета.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	               |		&Период КАК Период
	               |	ИЗ
	               |		Документ.энргУстановитьВидДифференцированностиПриборУчета.ТочкиУчета КАК ТаблицаПриборовУчета
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ШкалыПриборовУчета КАК ТаблицаШкал
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	               |				И ТаблицаПриборовУчета.IDСтрокиВывод = ТаблицаШкал.IDСтрокиТочкиУчета
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	               |				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета КАК ТаблицаДокумента
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчета.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	               |		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	               |			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	               |			И (ВложенныйЗапрос.РегистрируетОбъем)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка"	,Ссылка);
	Запрос.УстановитьПараметр("Период"			,Дата);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли