#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Печатает.
//
// Параметры:
//  МассивОбъектов			-	Массив.
//  ПараметрыПечати			-	Структура.
//  КоллекцияПечатныхФорм	-	ТаблицаЗначений.
//  ОбъектыПечати			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати.
//  ПараметрыВывода			-	Структура.
//           
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета;
	
	Если ИмяМакета = "ПФ_MXL_Квитанция" тогда
		ТабличныйДокумент 		= СформироватьКвитанциюMXL(ПараметрыПечати, МассивОбъектов,ИмяМакета);
	ИначеЕсли ИмяМакета = "ПФ_MXL_бестКвитанция" тогда
		ТабличныйДокумент 		= СформироватьКвитанцию(ПараметрыПечати, МассивОбъектов,ИмяМакета, ОбъектыПечати);
	КонецЕсли;	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета, "Квитанция за " + Формат(ПараметрыПечати.ПериодФормированияКвитанций, "ДФ='MMMM yy'"),
		ТабличныйДокумент, ,
		"Обработка.энргПечатьКвитанций." + ИмяМакета);
	КонецЕсли;
	
	энргФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Формирует квитанцию.
//
// Параметры:
//  ПараметрыПечати	-	Структура.
//  МассивОбъектов	-	Массив,Соответствие	-	данные о печатаемых объектах.
//  ИмяМакета		-	Строка.
//  ОбъектыПечати	-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати.
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьКвитанцию(ПараметрыПечати, МассивОбъектов, ИмяМакета, ОбъектыПечати) Экспорт 
	
	СоотвествиеПараметров					= СоотвествиеПараметровСвойствам("Обработка.энргПечатьДоговора");
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Обработка.энргПечатьКвитанций." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("Шапка");
	ОбластиМакета.Вставить("Шапка_СтрокаПУ");
	ОбластиМакета.Вставить("Шапка_Подвал");
	ОбластиМакета.Вставить("Шапка2");
	ОбластиМакета.Вставить("Шапка3");
	ОбластиМакета.Вставить("Шапка4");
	ОбластиМакета.Вставить("УслугиСтрока");
	ОбластиМакета.Вставить("Итого4");
	ОбластиМакета.Вставить("Шапка5");
	ОбластиМакета.Вставить("Строка5");
	ОбластиМакета.Вставить("ДополнительнаяИнформация");
	ОбластиМакета.Вставить("ДопИнформацияФилиала");
	
	для Каждого КлючЗначение из ОбластиМакета  цикл
		ОбластиМакета[КлючЗначение.ключ]	= Макет.получитьОбласть(КлючЗначение.ключ);
	КонецЦикла;  	
	
	ПоказанияПриборовУчета = Новый ТаблицаЗначений;
	ПоказанияПриборовУчета.Колонки.Добавить("Услуга");
	ПоказанияПриборовУчета.Колонки.Добавить("ПриборУчета");
	ПоказанияПриборовУчета.Колонки.Добавить("Показание");
	ПоказанияПриборовУчета.Колонки.Добавить("ДатаПоверки");
	
	МВТ										= Новый МенеджерВременныхТаблиц;
	СформироватьТаблицуАбонентов(МВТ, МассивОбъектов, ПараметрыПечати);
	
	СтруктураРезультат	= ПолучитьДанныеКвитанция(МВТ, ПараметрыПечати);
	ВыборкаРайонов = СтруктураРезультат.РезультатОсновногоЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПоказанияМКДПустые = СтруктураРезультат.РезультатЗапросаПоказаний.Пустой(); 
	ВыборкаПоказаний = СтруктураРезультат.РезультатЗапросаПоказаний.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	ДанныеОрганизации = Новый Структура("Организация, ИНН, КПП, БИК, ЮрАдресОрганизации, ТелефонОрганизации, БанковскийСчет, КоррСчет, ЭлПочта");
	
	ПериодНачисления						= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПараметрыПечати.ПериодФормированияКвитанций, ПараметрыПечати.Организация, ПараметрыПечати.Район);
	ПериодКвитанции							= Формат(ПериодНачисления, "ДФ='MMMM yyy'");
	
	ВыводитьРазделитель = Истина;
	ВыведенныеПУ = Новый Соответствие;
	
	
	ВыводитьРазделитель = Не ВыводитьРазделитель;
	ВыведенныеПУ.Очистить();
	
	МассивОбъектов.Очистить();	// в МассивОбъектов должны содержаться только Абоненты
	
	Пока ВыборкаРайонов.Следующий() Цикл
		Если ПолучитьФункциональнуюОпцию("энргИспользоватьАбонентскиеОтделы") Тогда
			КонтрагентДляШапки = ВыборкаРайонов.Район;
		ИначеЕсли ВыборкаРайонов.Район.Филиалы.Количество() > 0 Тогда
			Филиал 				= ВыборкаРайонов.Район.Филиалы[0].Филиал;
			
			КонтрагентДляШапки 	= новый Структура("Контрагент", Справочники.энргКонтрагенты.ПустаяСсылка());
			Если ПараметрыПечати.Свойство("Организация") Тогда
				МассивСтрок = Филиал.ИзменяемыеРеквизиты.НайтиСтроки(Новый Структура("Организация",ПараметрыПечати.Организация));
				Если МассивСтрок.Количество() > 0 Тогда
					КонтрагентДляШапки.Контрагент = МассивСтрок[0].Контрагент;
				Иначе 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для абонентского отдела: " + Филиал + " не указаны параметры печати. Заполните табличную часть ""Настройки"".");
					Продолжить;
				КонецЕсли; 				
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для Территориального органа " + ВыборкаРайонов.Район + " не указаны параметры печати. Укажите их в абонентском отделе.");
			Продолжить;
		КонецЕсли;
		
		
		ДанныеОрганизации = Новый Структура("Организация, ИНН, КПП, БИК, ЮрАдресОрганизации, ТелефонОрганизации, БанковскийСчет, КоррСчет, ЭлПочта");
		
		ДанныеОрганизации.Организация 			= ПараметрыПечати.Организация;
		ДанныеОрганизации.ИНН  					= ДанныеОрганизации.Организация.ИНН;
		ДанныеОрганизации.КПП		  			= ДанныеОрганизации.Организация.КПП;	
		ДанныеОрганизации.ЮрАдресОрганизации	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеОрганизации.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		ДанныеОрганизации.ЭлПочта				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеОрганизации.Организация, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
		ДанныеОрганизации.ТелефонОрганизации	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеОрганизации.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		ДанныеОрганизации.БанковскийСчет		= ДанныеОрганизации.Организация.ОсновнойБанковскийСчет;
		ДанныеОрганизации.БИК		  			= ДанныеОрганизации.Организация.ОсновнойБанковскийСчет.Банк.Код;
		ДанныеОрганизации.КоррСчет				= ДанныеОрганизации.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
		
		
		Выборка = ВыборкаРайонов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			МассивОбъектов.Добавить(Выборка.Абонент);
			
			НомерСтрокиНачало	= ТабДок.ВысотаТаблицы + 1;
			ОбластьШапка									= ОбластиМакета.Шапка;
			ОбластьШапка.Параметры.АдресОбъекта				= Выборка.АдресОбъекта;
			ОбластьШапка.Параметры.ЛицевойСчет 				= Выборка.ЛицевойСчет;
			ТабДок.Вывести(ОбластьШапка);
			
			РезультатПриборы 						= энргРаботаСприборамиУчетаСервер.ПоказанияПриборовУчета(Неопределено,ДанныеОрганизации.Организация,Выборка.Абонент.Район,Выборка.КлючПомещения);
			ВыборкаПриборы  						= РезультатПриборы.выбрать();
			
			Пока ВыборкаПриборы.следующий() цикл
				ОбластьШапка_СтрокаПУ				= ОбластиМакета.Шапка_СтрокаПУ;
				ЗаполнитьЗначенияСвойств(ОбластьШапка_СтрокаПУ.Параметры,ВыборкаПриборы);
				ТабДок.Вывести(ОбластьШапка_СтрокаПУ);
			КонецЦикла;
			
			ОбластьШапка_Подвал						= ОбластиМакета.Шапка_Подвал;
			ОбластьШапка_Подвал.Параметры.Абонент 	= Выборка.Абонент;
			ТабДок.Вывести(ОбластьШапка_Подвал);
			
			ОбластьШапка2									= ОбластиМакета.Шапка2;		
			ЗаполнитьЗначенияСвойств(ОбластьШапка2.Параметры, ДанныеОрганизации);
			ЗаполнитьЗначенияСвойств(ОбластьШапка2.Параметры, Выборка);		
			ОбластьШапка2.Параметры.Период 					= ПериодКвитанции;
			
			РеквизитыКвитанции 												= ПолучитьРеквизитыКвитанции(Выборка, ДанныеОрганизации, ПериодНачисления);
			QRСтрока 														= УправлениеПечатью.ФорматнаяСтрокаУФЭБС(РеквизитыКвитанции);
			
			Если Не ПустаяСтрока(QRСтрока) Тогда
				ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 1, 120);
				Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
					Шаблон 													= Нстр("ru = 'Не удалось сформировать QR-код для абонента %1. Технические подробности см. в журнале регистрации.'");
					ТекстСообщения 											= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Выборка.Абонент);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Иначе
					КартинкаQRКода								= Новый Картинка(ДанныеQRКода);
					ОбластьШапка2.Рисунки.QRКод.Картинка		= КартинкаQRКода;
				КонецЕсли;
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьШапка2);
			
			ОбластьШапка3									= ОбластиМакета.Шапка3;
			ЗаполнитьЗначенияСвойств(ОбластьШапка3.Параметры, ДанныеОрганизации);
			ЗаполнитьЗначенияСвойств(ОбластьШапка3.Параметры, Выборка);
			ОбластьШапка3.Параметры.Период 					= ПериодКвитанции;
			ОбластьШапка3.Параметры.ДатаОплатыСчета			= Дата(Год(ДобавитьМесяц(ПериодНачисления, 1)), Месяц(ДобавитьМесяц(ПериодНачисления, 1)), 10);
			ТабДок.Вывести(ОбластьШапка3);
			
			ОбластьШапка4									= ОбластиМакета.Шапка4;
			ОбластьШапка4.Параметры.Период 					= ПериодКвитанции;
			ТабДок.Вывести(ОбластьШапка4);
			
			ОбластьУслугиСтрока								= ОбластиМакета.УслугиСтрока;
			ВыборкаУслуги = Выборка.Выбрать();
			Пока ВыборкаУслуги.Следующий() Цикл	
				Если ЗначениеЗаполнено(ВыборкаУслуги.Услуга) Тогда
					ЗаполнитьЗначенияСвойств(ОбластьУслугиСтрока.Параметры, ВыборкаУслуги);			
					ТабДок.Вывести(ОбластьУслугиСтрока);	
				КонецЕсли;
			КонецЦикла;
			
			ОбластьИтого4									= ОбластиМакета.Итого4;
			ОбластьИтого4.Параметры.Период 					= ПериодКвитанции;
			ЗаполнитьЗначенияСвойств(ОбластьИтого4.Параметры, Выборка);
			ОбластьИтого4.Параметры.КОплате 				= Выборка.КОплате + Выборка.СуммаПени;
			ТабДок.Вывести(ОбластьИтого4);
			
			Если Не ПоказанияМКДПустые Тогда
				ОбластьШапка5									= ОбластиМакета.Шапка5;
				ОбластьШапка5.Параметры.Организация				= ДанныеОрганизации.Организация;
				ТабДок.Вывести(ОбластьШапка5);
				
				ВыборкаПоказаний.Сбросить();
				Если ВыборкаПоказаний.НайтиСледующий(Новый Структура("МКД", Выборка.МКД)) Тогда 
					ВыборкаПоказанийПУ = ВыборкаПоказаний.Выбрать();
					НомерСтроки = 0;
					Пока ВыборкаПоказанийПУ.Следующий() Цикл
						НомерСтроки = НомерСтроки + 1;  
						ОбластьСтрока5	= ОбластиМакета.Строка5;
						ЗаполнитьЗначенияСвойств(ОбластьСтрока5.Параметры, ВыборкаПоказанийПУ);
						ОбластьСтрока5.Параметры.НомерСтроки = НомерСтроки;
						ТабДок.Вывести(ОбластьСтрока5);	
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			//Если ВыводитьРазделитель тогда
			
			ОбластьДопИнформацияФилиала	= ОбластиМакета.ДопИнформацияФилиала; 	
			ЗаполнитьЗначенияСвойств(ОбластьДопИнформацияФилиала.Параметры, Выборка);
			ТабДок.Вывести(ОбластьДопИнформацияФилиала);
			
			ОбластьДополнительнаяИнформация	= ОбластиМакета.ДополнительнаяИнформация; 			
			ТабДок.Вывести(ОбластьДополнительнаяИнформация);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Выборка.Абонент);
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
	КонецЦикла;
	ТабДок.КлючПараметровПечати				= "ПАРАМЕТРЫ_ПЕЧАТИ_Квитанция";
	ТабДок.АвтоМасштаб						= Истина;
	ТабДок.ОриентацияСтраницы				= ОриентацияСтраницы.Портрет;
	
	Возврат ТабДок;	  	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Квитанция

Функция СформироватьКвитанциюMXL(ПараметрыПечати, МассивОбъектов,ИмяМакета) 
	
	СоотвествиеПараметров					= СоотвествиеПараметровСвойствам("Обработка.энргПечатьДоговора");
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Обработка.энргПечатьКвитанций." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("Шапка");
	ОбластиМакета.Вставить("Услуги");
	ОбластиМакета.Вставить("УслугиИтог");
	ОбластиМакета.Вставить("ШапкаПУ");
	ОбластиМакета.Вставить("ПоказанияПУ");
	ОбластиМакета.Вставить("ПоказанияПоМКД");
	ОбластиМакета.Вставить("СправочнаяИнформация");
	ОбластиМакета.Вставить("ДопОбластьРазрыв");
	ОбластиМакета.Вставить("Отступ");
	ОбластиМакета.Вставить("ШапкаПУОтступ");
	
	для Каждого КлючЗначение из ОбластиМакета  цикл
		ОбластиМакета[КлючЗначение.ключ]	= Макет.получитьОбласть(КлючЗначение.ключ);
	КонецЦикла;  	
	
	ПоказанияПриборовУчета = Новый ТаблицаЗначений;
	ПоказанияПриборовУчета.Колонки.Добавить("Услуга");
	ПоказанияПриборовУчета.Колонки.Добавить("ПриборУчета");
	ПоказанияПриборовУчета.Колонки.Добавить("Показание");
	ПоказанияПриборовУчета.Колонки.Добавить("ДатаПоверки");
		
	МВТ										= Новый МенеджерВременныхТаблиц;
	СформироватьТаблицуАбонентов(МВТ, МассивОбъектов, ПараметрыПечати);
	
	Выборка 								= ПолучитьДанныеКвитанция(МВТ, ПараметрыПечати);
	
	ДанныеОрганизации = Новый Структура("Организация, ЮрАдресОрганизации, ТелефонОрганизации, БанковскийСчет");
	
	//ДанныеОрганизации.Организация  			= ОрганизацииСлужебный.ОрганизацияПоУмолчанию();
	ДанныеОрганизации.Организация  			= ПараметрыПечати.Организация;
	ДанныеОрганизации.ЮрАдресОрганизации	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеОрганизации.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ДанныеОрганизации.ТелефонОрганизации	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеОрганизации.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	ДанныеОрганизации.БанковскийСчет		= ДанныеОрганизации.Организация.ОсновнойБанковскийСчет;
	ПериодНачисления						= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПараметрыПечати.ПериодФормированияКвитанций, ПараметрыПечати.Организация, ПараметрыПечати.Район);
	ПериодКвитанции							= Формат(ПериодНачисления, "ДФ='ММММ ггг'");
	
	ВыводитьРазделитель = Истина;
	ВыведенныеПУ = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ВыводитьРазделитель = Не ВыводитьРазделитель;
		ВыведенныеПУ.Очистить();
		
		ОбластьШапка									= ОбластиМакета.Шапка;
		ОбластьШапка.Параметры.Период 					= ПериодКвитанции;
		//ОбластьШапка.Параметры.Абонент					= Выборка.Абонент.Наименование;
		ОбластьШапка.Параметры.Адрес 					= Выборка.АдресАбонента;
		ОбластьШапка.Параметры.КоличествоПроживающих	= Выборка.КоличествоПроживающих;
		//ОбластьШапка.Параметры.НормативПотребления		= Выборка.ЗначениеНормы;
		ОбластьШапка.Параметры.ЛС 						= Выборка.Абонент.ЛицевойСчет;
		
		ТабДок.Вывести(ОбластьШапка);
		
		Если ЗначениеЗаполнено(Выборка.Абонент.МКД) тогда
			ОбластьПоказанияПоМКД						= ОбластиМакета.ПоказанияПоМКД;
			ТабДок.Вывести(ОбластьПоказанияПоМКД);
		КонецЕсли;	
		
		ОбластьСправочнаяИнформация										= ОбластиМакета.СправочнаяИнформация;
		ОбластьСправочнаяИнформация.Параметры.Поставщик					= ДанныеОрганизации.Организация.Наименование;
		ОбластьСправочнаяИнформация.Параметры.ЮрАдресПоставщика			= ДанныеОрганизации.ЮрАдресОрганизации;
		ОбластьСправочнаяИнформация.Параметры.ИНН						= ДанныеОрганизации.Организация.ИНН;
		ОбластьСправочнаяИнформация.Параметры.КПП						= ДанныеОрганизации.Организация.КПП;
		ОбластьСправочнаяИнформация.Параметры.Телефон					= ДанныеОрганизации.ТелефонОрганизации;
				                                           	
		ОбластьСправочнаяИнформация.Параметры.Банк 						= ДанныеОрганизации.БанковскийСчет.Банк.Наименование;
		ОбластьСправочнаяИнформация.Параметры.РС						= ДанныеОрганизации.БанковскийСчет.НомерСчета;
		ОбластьСправочнаяИнформация.Параметры.БИК						= ДанныеОрганизации.БанковскийСчет.Банк.Код;
		ОбластьСправочнаяИнформация.Параметры.КС						= ДанныеОрганизации.БанковскийСчет.Банк.КоррСчет;
		
		ОбластьСправочнаяИнформация.Параметры.Задолженность				= Выборка.Задолженность;
		ОбластьСправочнаяИнформация.Параметры.ДатаПоследнейОплаты		= Формат(Выборка.ДатаПлатежа, "ДЛФ=Д");
		ОбластьСправочнаяИнформация.Параметры.Период 					= ПериодКвитанции;
		
		РеквизитыКвитанции 												= ПолучитьРеквизитыКвитанции(Выборка, ДанныеОрганизации, ПериодНачисления);
		
		QRСтрока 														= УправлениеПечатью.ФорматнаяСтрокаУФЭБС(РеквизитыКвитанции);
		
		ВывестиQRКод 													= Истина;
		
		Если ПустаяСтрока(QRСтрока) Тогда
			ВывестиQRКод 												= Ложь;
		КонецЕсли;
		
		Если ВывестиQRКод тогда
			ДанныеQRКода 												= УправлениеПечатью.ДанныеQRКода(QRСтрока, 1, 120);
			
			Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
				
				Шаблон 													= Нстр("ru = 'Не удалось сформировать QR-код для абонента %1.
						 														|Технические подробности см. в журнале регистрации.'");
				ТекстСообщения 											= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
								 											Выборка.Абонент);
								 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				ВывестиQRКод 											= Ложь;
			КонецЕсли;
		КонецЕсли;	
		
		Если ВывестиQRКод тогда	
			КартинкаQRКода 												= Новый Картинка(ДанныеQRКода);
			ОбластьСправочнаяИнформация.Рисунки.QRКод.Картинка 			= КартинкаQRКода;
		КонецЕсли;	
		
		ТабДок.Вывести(ОбластьСправочнаяИнформация);
		
		ПоказанияПриборовУчета.Очистить();
		
		КоличествоУслуг = 0;
		УслугиВыборка = Выборка.Выбрать();
		Пока УслугиВыборка.Следующий() Цикл	
			Если ЗначениеЗаполнено(УслугиВыборка.Услуга) и УслугиВыборка.КОплате<>0 тогда
					ОбластьУслуги							        = ОбластиМакета.Услуги;
					ОбластьУслуги.Параметры.Услуга					= УслугиВыборка.Услуга;
					ОбластьУслуги.Параметры.ЕдИзм					= УслугиВыборка.ЕдиницаИзмерения;
					ОбластьУслуги.Параметры.Объем					= УслугиВыборка.Объем;
					ОбластьУслуги.Параметры.Тариф					= УслугиВыборка.Тариф;
					ОбластьУслуги.Параметры.Сумма					= УслугиВыборка.СуммаПоТарифу;
					ОбластьУслуги.Параметры.Перерасчет				= УслугиВыборка.Перерасчет;
					ОбластьУслуги.Параметры.КОплате					= УслугиВыборка.КОплате;
					ТабДок.Вывести(ОбластьУслуги);
					КоличествоУслуг = КоличествоУслуг + 1;
			КонецЕсли;
			
			//Если ЗначениеЗаполнено(УслугиВыборка.ПриборУчета) и УслугиВыборка.Показание<>0 тогда
			Если ЗначениеЗаполнено(УслугиВыборка.ПриборУчета) и ВыведенныеПУ.Получить(УслугиВыборка.ПриборУчета) = Неопределено тогда
				ЗаполнитьЗначенияСвойств(ПоказанияПриборовУчета.Добавить(), УслугиВыборка);
				ВыведенныеПУ.Вставить(УслугиВыборка.ПриборУчета, УслугиВыборка.Показание);
			КонецЕсли;
		КонецЦикла;	
		
		ОбластьУслугиИтог									= ОбластиМакета.УслугиИтог;
		ИтогоПоУслугам										= Выборка.КОплате;
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета= "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		ОбластьУслугиИтог.Параметры.ИтогоПрописью			= ЧислоПрописью(ИтогоПоУслугам, ФормСтрока, ПарПредмета);
		ОбластьУслугиИтог.Параметры.ИтогоКОплате			= ИтогоПоУслугам;
		ТабДок.Вывести(ОбластьУслугиИтог);
		
		Если ПоказанияПриборовУчета.Количество()>0 тогда
			ОбластьШапкаПУ 										= ОбластиМакета.ШапкаПУ;
			ТабДок.Вывести(ОбластьШапкаПУ);
		Иначе
			ШапкаПУОтступ 										= ОбластиМакета.ШапкаПУОтступ;
			ТабДок.Вывести(ШапкаПУОтступ);
		КонецЕсли;	
		
		Для каждого ПоказаниеПУ из ПоказанияПриборовУчета Цикл
			ОбластьПоказанияПУ							    = ОбластиМакета.ПоказанияПУ;
			ОбластьПоказанияПУ.Параметры.СчетчикПоУслуге	= ПоказаниеПУ.Услуга;
			ОбластьПоказанияПУ.Параметры.НомерСчетчика		= ПоказаниеПУ.ПриборУчета;
			ОбластьПоказанияПУ.Параметры.ПоследниеПоказания	= ПоказаниеПУ.Показание;
			ОбластьПоказанияПУ.Параметры.СрокПоверки		= Формат(ПоказаниеПУ.ДатаПоверки, "ДЛФ=Д");
			ТабДок.Вывести(ОбластьПоказанияПУ);
		КонецЦикла;
		
		КоличествоДопСтрок = 11 - (КоличествоУслуг + ПоказанияПриборовУчета.Количество());
		
		Если КоличествоДопСтрок > 0 тогда//и НЕ ВыводитьРазделитель тогда
			Для ДопСтрока=1 по КоличествоДопСтрок Цикл
				ОбластьРазрыв = ОбластиМакета.ДопОбластьРазрыв;
				ТабДок.Вывести(ОбластьРазрыв);
			КонецЦикла;	
		КонецЕсли;	
			
		Если ВыводитьРазделитель тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			Отступ = ОбластиМакета.Отступ;
			ТабДок.Вывести(Отступ);
		КонецЕсли;	
	КонецЦикла;	  
	
	ТабДок.КлючПараметровПечати				= "ПАРАМЕТРЫ_ПЕЧАТИ_Квитанция";
	ТабДок.АвтоМасштаб						= Истина;
	//ТабДок.ЭкземпляровНаСтранице			= 2;
	
	Возврат ТабДок;	  	
КонецФункции

#КонецОбласти

Процедура СформироватьТаблицуАбонентов(МВТ, МассивОбъектов,ПараметрыПечати)
	ОтборПоАбонентам 	= Новый Массив;
	ОтборПоРайонам		= Новый Массив;
	ОтборПоДомам		= Новый Массив;
	ОтборПоКонтроллерам	= Новый Массив;
	ОтборПоОрганизациям	= Новый Массив;
	
	Для каждого ОбъектОтбора из МассивОбъектов Цикл
		Если ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргАбоненты") тогда
			ОтборПоАбонентам.Добавить(ОбъектОтбора);
		КонецЕсли;
		
		Если  ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргЗоныОтвественности") тогда
			ОтборПоРайонам.Добавить(ОбъектОтбора);
		КонецЕсли;
		
		Если  ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргСтроения") тогда
			ОтборПоДомам.Добавить(ОбъектОтбора);
		КонецЕсли;
		
		Если  ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргСотрудники") тогда
			ОтборПоКонтроллерам.Добавить(ОбъектОтбора);
		КонецЕсли;
		
		Если  ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.Организации") тогда
			ОтборПоОрганизациям.Добавить(ОбъектОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	энргАбоненты.Ссылка КАК Абонент,
	|	энргАбоненты.Организация КАК Организация,
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.КлючПомещения.Строение КАК МКД,
	|	энргАбоненты.КлючПомещения.Помещение КАК Помещение,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргФилиалыАбонентовСрезПоследних.Филиал КАК Филиал,
	|	ПОДСТРОКА(энргОбъявленияРайоновСрезПоследних.Объявление, 1, 1024) КАК ДопИнформация
	|ПОМЕСТИТЬ ВТ_ТолькоАбонентИзСправочника
	|ИЗ
	|	Справочник.энргАбоненты КАК энргАбоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних(&Период, ) КАК энргФилиалыАбонентовСрезПоследних
	|		ПО энргФилиалыАбонентовСрезПоследних.Абонент = энргАбоненты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргОбъявленияРайонов.СрезПоследних(&Период, ) КАК энргОбъявленияРайоновСрезПоследних
	|		ПО энргОбъявленияРайоновСрезПоследних.Район = энргАбоненты.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ДействующиеЛС
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&ПериодНач,
	|			(Организация, Район, Абонент) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.Абонент
	|				ИЗ
	|					ВТ_ТолькоАбонентИзСправочника КАК ВТ)) КАК энргСостояниеЛССрезПоследних
	|ГДЕ
	|	энргСостояниеЛССрезПоследних.Состояние
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Абонент
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&Период,
	|			(Организация, Район, Абонент) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.Абонент
	|				ИЗ
	|					ВТ_ТолькоАбонентИзСправочника КАК ВТ)) КАК энргСостояниеЛССрезПоследних
	|ГДЕ
	|	энргСостояниеЛССрезПоследних.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТолькоАбонентИзСправочника.Абонент КАК Абонент,
	|	ВТ_ТолькоАбонентИзСправочника.Организация КАК Организация,
	|	ВТ_ТолькоАбонентИзСправочника.Район КАК Район,
	|	ВТ_ТолькоАбонентИзСправочника.Филиал КАК Филиал,
	|	ВТ_ТолькоАбонентИзСправочника.МКД КАК МКД,
	|	ВТ_ТолькоАбонентИзСправочника.Помещение КАК Помещение,
	|	ВТ_ТолькоАбонентИзСправочника.КлючПомещения КАК КлючПомещения,
	|	ВТ_ТолькоАбонентИзСправочника.ДопИнформация
	|ПОМЕСТИТЬ ВТ_ТолькоАбонент
	|ИЗ
	|	ВТ_ТолькоАбонентИзСправочника КАК ВТ_ТолькоАбонентИзСправочника
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДействующиеЛС КАК ВТ_ДействующиеЛС
	//|		ПО ВТ_ТолькоАбонентИзСправочника.Абонент = ВТ_ДействующиеЛС.Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТолькоАбонентИзСправочника.Абонент,
	|	ВТ_ТолькоАбонентИзСправочника.Организация,
	|	ВТ_ТолькоАбонентИзСправочника.Район,
	|	ВТ_ТолькоАбонентИзСправочника.Филиал,
	|	ВТ_ТолькоАбонентИзСправочника.МКД,
	|	ВТ_ТолькоАбонентИзСправочника.Помещение,
	|	ВТ_ТолькоАбонентИзСправочника.КлючПомещения,
	|	ВТ_ТолькоАбонентИзСправочника.ДопИнформация;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД)
	|				ТОГДА энргЗначениеПлощадейМКДСрезПоследних.Площадь
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадьМКД,
	|	энргЗначениеПлощадейМКДСрезПоследних.МКД КАК МКД,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПлощадьМОП)
	|				ТОГДА энргЗначениеПлощадейМКДСрезПоследних.Площадь
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощатьМОП
	|ПОМЕСТИТЬ ВТ_ПлощадьМКД
	|ИЗ
	|	РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД) В
	|					(ВЫБРАТЬ
	|						ВТ.Организация,
	|						ВТ.Район,
	|						ВТ.МКД
	|					ИЗ
	|						ВТ_ТолькоАбонент КАК ВТ)
	|				И ВидПлощади В (ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД), ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПлощадьМОП))) КАК энргЗначениеПлощадейМКДСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргЗначениеПлощадейМКДСрезПоследних.МКД
	|; 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргФормыУправленияМКДСрезПоследних.УК КАК УК,
	|	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД	
	|ПОМЕСТИТЬ ВТ_УКМКД
	|ИЗ
	|	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД) В
	|					(ВЫБРАТЬ
	|						ВТ.Организация,
	|						ВТ.Район,
	|						ВТ.МКД
	|					ИЗ
	|						ВТ_ТолькоАбонент КАК ВТ)
	|				) КАК энргФормыУправленияМКДСрезПоследних
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(энргПомещенияКонтактнаяИнформация.Представление, ЕСТЬNULL(энргСтроенияКонтактнаяИнформация.Представление, """")) КАК СТРОКА(250))) КАК АдресОбъекта,
	|	ВТ_ТолькоАбонент.Абонент.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ТолькоАбонент.Абонент.Наименование КАК ПредставлениеАбонента,
	|	ВТ_ТолькоАбонент.Абонент КАК Абонент
	|ПОМЕСТИТЬ " + ?(ОтборПоКонтроллерам.Количество() > 0, " ВТ_ВсеАдреса", " ВТ_Адреса") + "
	|ИЗ
	|	ВТ_ТолькоАбонент КАК ВТ_ТолькоАбонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	|		ПО (энргПомещенияКонтактнаяИнформация.Ссылка = ВТ_ТолькоАбонент.Помещение)
	|			И (энргПомещенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (энргПомещенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПомещения))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|		ПО (энргСтроенияКонтактнаяИнформация.Ссылка = ВТ_ТолькоАбонент.МКД)
	|			И (энргСтроенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (энргСтроенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТолькоАбонент.Абонент,
	|	ВТ_ТолькоАбонент.Абонент.ЛицевойСчет,
	|	ВТ_ТолькоАбонент.Абонент.Наименование
	|;
	| " + 
	?(ОтборПоКонтроллерам.Количество() > 0, "  
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеАдреса.Абонент КАК Абонент,
	|	ВТ_ВсеАдреса.АдресОбъекта КАК АдресОбъекта,
	|	ВТ_ВсеАдреса.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ВсеАдреса.ПредставлениеАбонента КАК ПредставлениеАбонента,
	|ПОМЕСТИТЬ ВТ_Адреса
	|ИЗ
	|	ВТ_ВсеАдреса КАК ВТ_ВсеАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	|		ПО (ВТ_ВсеАдреса.АдресОбъекта ПОДОБНО ""%"" + энргМаршрутыКонтроллеровАдресаМаршрута.Представление + ""%"")
	|			И (энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка.Владелец В (&Контролер)) ;", "" )	
	+ "ВЫБРАТЬ
	  |	энргКоличествоПрописанныхСрезПоследних.Количество КАК Количество,
	  |	энргКоличествоПрописанныхСрезПоследних.КлючПомещения КАК КлючПомещения
	  |ПОМЕСТИТЬ ВТ_Прописанные
	  |ИЗ
	  |	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
	  |			&Период,
	  |			(Организация, Район, КлючПомещения) В
	  |				(ВЫБРАТЬ
	  |					ВТ.Организация,
	  |					ВТ.Район,
	  |					ВТ.КлючПомещения
	  |				ИЗ
	  |					ВТ_ТолькоАбонент КАК ВТ)) КАК энргКоличествоПрописанныхСрезПоследних
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	энргКоличествоПроживающихСрезПоследних.Количество КАК Количество,
	  |	энргКоличествоПроживающихСрезПоследних.КлючПомещения КАК КлючПомещения
	  |ПОМЕСТИТЬ ВТ_Проживающие
	  |ИЗ
	  |	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
	  |			&Период,
	  |			(Организация, Район, КлючПомещения) В
	  |				(ВЫБРАТЬ
	  |					ВТ.Организация,
	  |					ВТ.Район,
	  |					ВТ.КлючПомещения
	  |				ИЗ
	  |					ВТ_ТолькоАбонент КАК ВТ)) КАК энргКоличествоПроживающихСрезПоследних
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргЖильцыЛьготныхКатегорийСрезПоследних.Жилец) КАК Количество,
	  |	энргЖильцыЛьготныхКатегорийСрезПоследних.Абонент КАК Абонент
	  |ПОМЕСТИТЬ ВТ_Льготники
	  |ИЗ
	  |	РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(
	  |			&Период,
	  |			(Организация, Район) В
	  |				(ВЫБРАТЬ
	  |					ВТ.Организация,
	  |					ВТ.Район
	  |				ИЗ
	  |					ВТ_ТолькоАбонент КАК ВТ)) КАК энргЖильцыЛьготныхКатегорийСрезПоследних
	  |ГДЕ
	  |	энргЖильцыЛьготныхКатегорийСрезПоследних.Абонент В
	  |			(ВЫБРАТЬ
	  |				ВТ.Абонент
	  |			ИЗ
	  |				ВТ_ТолькоАбонент КАК ВТ)
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	энргЖильцыЛьготныхКатегорийСрезПоследних.Абонент
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)
	  |				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
	  |			ИНАЧЕ 0
	  |		КОНЕЦ) КАК ОбщаяПлощадь,
	  |	энргЗначенияПлощадейСрезПоследних.КлючПомещения КАК КлючПомещения,
	  |	МАКСИМУМ(ВЫБОР
	  |			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь)
	  |				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
	  |			ИНАЧЕ 0
	  |		КОНЕЦ) КАК ЖилаяПлощадь
	  |ПОМЕСТИТЬ ВТ_Площадь
	  |ИЗ
	  |	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
	  |			&Период,
	  |			(Организация, Район, КлючПомещения) В
	  |					(ВЫБРАТЬ
	  |						ВТ.Организация,
	  |						ВТ.Район,
	  |						ВТ.КлючПомещения
	  |					ИЗ
	  |						ВТ_ТолькоАбонент КАК ВТ)
	  |				И ВидПлощади В (ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь), ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))) КАК энргЗначенияПлощадейСрезПоследних
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	энргЗначенияПлощадейСрезПоследних.КлючПомещения
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_ТолькоАбонент.Абонент КАК Абонент,
	  |	ВТ_ТолькоАбонент.МКД КАК МКД,
	  |	ВТ_ТолькоАбонент.КлючПомещения КАК КлючПомещения,
	  |	ВТ_Адреса.АдресОбъекта КАК АдресОбъекта,
	  |	ВТ_Адреса.ЛицевойСчет КАК ЛицевойСчет,
	  |	ВТ_Адреса.ПредставлениеАбонента КАК ПредставлениеАбонента,
	  |	ВТ_Площадь.ОбщаяПлощадь КАК ОбщаяПлощадь,
	  |	ВТ_Площадь.ЖилаяПлощадь КАК ЖилаяПлощадь,
	  |	ВТ_Проживающие.Количество КАК Проживающие,
	  |	ВТ_Прописанные.Количество КАК Прописанные,
	  |	ВТ_Льготники.Количество КАК Льготники,
	  |	ВТ_ТолькоАбонент.Абонент.ВидОбъекта КАК ТипКвартиры,
	  |	ВТ_ПлощадьМКД.ОбщаяПлощадьМКД КАК ПлощадьДома,
	  |	ВТ_ПлощадьМКД.ПлощатьМОП КАК ПлощадьМОП,
	  |	ВТ_УКМКД.УК КАК УК,
	  |	ЕСТЬNULL(ВТ_ПлощадьМКД.ОбщаяПлощадьМКД, 0) - ЕСТЬNULL(ВТ_ПлощадьМКД.ПлощатьМОП, 0) КАК ПлощадьЖП,
	  |	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности КАК ТипСобственности,
	  |	ВТ_ТолькоАбонент.Район КАК Район,
	  |	ВТ_ТолькоАбонент.Филиал КАК Филиал,
	  |	ВТ_ТолькоАбонент.ДопИнформация
	  |ПОМЕСТИТЬ ВТ_Абонент
	  |ИЗ
	  |	ВТ_ТолькоАбонент КАК ВТ_ТолькоАбонент
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Адреса КАК ВТ_Адреса
	  |		ПО ВТ_ТолькоАбонент.Абонент = ВТ_Адреса.Абонент
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Прописанные КАК ВТ_Прописанные
	  |		ПО ВТ_ТолькоАбонент.КлючПомещения = ВТ_Прописанные.КлючПомещения
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Льготники КАК ВТ_Льготники
	  |		ПО ВТ_ТолькоАбонент.Абонент = ВТ_Льготники.Абонент
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проживающие КАК ВТ_Проживающие
	  |		ПО ВТ_ТолькоАбонент.КлючПомещения = ВТ_Проживающие.КлючПомещения
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Площадь КАК ВТ_Площадь
	  |		ПО ВТ_ТолькоАбонент.КлючПомещения = ВТ_Площадь.КлючПомещения
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадьМКД КАК ВТ_ПлощадьМКД
	  |		ПО ВТ_ТолькоАбонент.МКД = ВТ_ПлощадьМКД.МКД
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УКМКД КАК ВТ_УКМКД
	  |		ПО ВТ_ТолькоАбонент.МКД = ВТ_УКМКД.МКД
	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргТипСобственностиАбонентов.СрезПоследних(
	  |				,
	  |				(Организация, Район, КлючПомещения) В
	  |					(ВЫБРАТЬ
	  |						ВТ.Организация,
	  |						ВТ.Район,
	  |						ВТ.КлючПомещения
	  |					ИЗ
	  |						ВТ_ТолькоАбонент КАК ВТ)) КАК энргТипСобственностиАбонентовСрезПоследних
	  |		ПО ВТ_ТолькоАбонент.КлючПомещения = энргТипСобственностиАбонентовСрезПоследних.КлючПомещения
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |УНИЧТОЖИТЬ ВТ_ТолькоАбонент
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |УНИЧТОЖИТЬ ВТ_Адреса
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |УНИЧТОЖИТЬ ВТ_Проживающие
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |УНИЧТОЖИТЬ ВТ_Прописанные
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |УНИЧТОЖИТЬ ВТ_Площадь
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |УНИЧТОЖИТЬ ВТ_УКМКД
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |УНИЧТОЖИТЬ ВТ_Льготники";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ЗапросАбонентыОтбор = СхемаЗапроса.ПакетЗапросов[0];
	ОператорВыбораАбонентов = ЗапросАбонентыОтбор.Операторы[0];	
	
	Если ОтборПоАбонентам.Количество() > 0 тогда
		ОператорВыбораАбонентов.Отбор.Добавить("энргАбоненты.Ссылка В (&ОтборПоАбонентам)");
		Запрос.УстановитьПараметр("ОтборПоАбонентам", ОтборПоАбонентам);
	КонецЕсли;
	
	Если ОтборПоРайонам.Количество() > 0 тогда
		ОператорВыбораАбонентов.Отбор.Добавить("энргАбоненты.Район В (&ОтборПоРайонам)");
		Запрос.УстановитьПараметр("ОтборПоРайонам", ОтборПоРайонам);
	КонецЕсли;
	
	Если ОтборПоДомам.Количество() > 0 тогда
		ОператорВыбораАбонентов.Отбор.Добавить("энргАбоненты.КлючПомещения.Строение В (&ОтборПоДомам)");
		Запрос.УстановитьПараметр("ОтборПоДомам", ОтборПоДомам);
	КонецЕсли;
	
	Если ОтборПоОрганизациям.Количество() > 0 тогда
		ОператорВыбораАбонентов.Отбор.Добавить("энргАбоненты.Организация В (&ОтборПоОрганизациям)");
		Запрос.УстановитьПараметр("ОтборПоОрганизациям", ОтборПоОрганизациям);
	КонецЕсли;
	
	Если ОтборПоКонтроллерам.Количество() > 0 тогда
		Запрос.УстановитьПараметр("Контролер", ОтборПоКонтроллерам);		
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Период", КонецМесяца(ПараметрыПечати.ПериодФормированияКвитанций));
	Запрос.УстановитьПараметр("ПериодНач", НачалоМесяца(ПараметрыПечати.ПериодФормированияКвитанций));
	Запрос.Выполнить();
	
КонецПроцедуры	

Функция ПолучитьДанныеКвитанция(МВТ, ПараметрыПечати)	
	ПериодНачисления						= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПараметрыПечати.ПериодФормированияКвитанций, ПараметрыПечати.Организация, ПараметрыПечати.Район);
	ДатаЗадолжности							= Дата(Год(ПериодНачисления), Месяц(ПериодНачисления), 25);
	ДатаРасчета								= КонецМесяца(ПериодНачисления);
	
	
	
	
	
	ПериодНачисленияНачало 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(НачалоМесяца(ПараметрыПечати.ПериодФормированияКвитанций), ПараметрыПечати.Организация,ПараметрыПечати.Район);
	ПериодНачисленияКонец  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(КонецМесяца(ПараметрыПечати.ПериодФормированияКвитанций), ПараметрыПечати.Организация,ПараметрыПечати.Район);
	
	//ПараметрыОПКонец			= энргНачисления.ГраницыОтчетногоПериода(ПараметрыОтчета.Организация, ПериодНачисленияНачало);
	//ПараметрыОПНачало			= энргНачисления.ГраницыОтчетногоПериода(ПараметрыОтчета.Организация, ПериодНачисленияКонец);	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПараметрыПечати.ПериодФормированияКвитанций));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПараметрыПечати.ПериодФормированияКвитанций));
	Запрос.УстановитьПараметр("Организация", ПараметрыПечати.Организация); 
	Запрос.УстановитьПараметр("Район", ПараметрыПечати.Район);
	Запрос.УстановитьПараметр("ПериодНачисленияНачало",ПериодНачисленияНачало);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстГраницыПериодов 		= "ВЫБРАТЬ * ПОМЕСТИТЬ ГраницыОтчетногоПериода  ИЗ (" + энргНачисления.ТекстГраницОтчетногоПериода(ПериодНачисленияНачало,ПериодНачисленияКонец,Ложь) + ") КАК ВложенныйЗапрос";
	
	ОсновнойТекст  				 = 
	"ВЫБРАТЬ
	|	&ПериодНачисленияНачало КАК Период,
	|	энргАвансыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	энргАвансыОстатки.Абонент КАК Абонент
	|ПОМЕСТИТЬ АвансыОстатки
	|ИЗ
	|	РегистрНакопления.энргАвансы.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргАвансыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисленияНачало КАК Период,
	|	СУММА(энргВзаиморасчетыПоПениОбороты.СуммаПриход) КАК СуммаПени,
	|	энргВзаиморасчетыПоПениОбороты.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ПениЗаПериод
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Обороты(&НачалоПериода, &КонецПериода, , (Район,МКД,Абонент) В
	|					(ВЫБРАТЬ
	|						ВТ.Район,
	|						ВТ.МКД,
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)
	|					И Организация = &Организация)  КАК энргВзаиморасчетыПоПениОбороты	
	|СГРУППИРОВАТЬ ПО
	|	&ПериодНачисленияНачало,
	|	энргВзаиморасчетыПоПениОбороты.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисленияНачало КАК Период,
	|	энргАвансыОбороты.СуммаОборот КАК СуммаОборот,
	|	энргАвансыОбороты.Абонент КАК Абонент
	|ПОМЕСТИТЬ АвансыОбороты
	|ИЗ
	|	РегистрНакопления.энргАвансы.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргАвансыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисленияНачало КАК Период,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик,
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК СуммаОстаток,
	|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент
	|ПОМЕСТИТЬ УслугиОстатки
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргВзаиморасчетыПоМесяцамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОбороты.Период КАК Период,
	|	энргВзаиморасчетыПоМесяцамОбороты.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОбороты.Поставщик КАК Поставщик,
	|	энргВзаиморасчетыПоМесяцамОбороты.СуммаОборот КАК СуммаОборот,
	|	энргВзаиморасчетыПоМесяцамОбороты.Абонент КАК Абонент
	|ПОМЕСТИТЬ УслугиОбороты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргВзаиморасчетыПоМесяцамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(ВложенныйЗапрос.ОстатокНач) КАК ОстатокНач,
	|	СУММА(ВложенныйЗапрос.ОстатокКон) КАК ОстатокКон,
	|	ВложенныйЗапрос.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОстаткиАванса
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		АвансыОстатки.СуммаОстаток КАК ОстатокНач,
	|		0 КАК ОстатокКон,
	|		АвансыОстатки.Абонент КАК Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОстатки КАК АвансыОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления = АвансыОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		АвансыОбороты.СуммаОборот,
	|		0,
	|		АвансыОбороты.Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОбороты КАК АвансыОбороты
	|			ПО ГраницыОтчетногоПериода.НачалоОП > АвансыОбороты.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		0,
	|		АвансыОстатки.СуммаОстаток,
	|		АвансыОстатки.Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОстатки КАК АвансыОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления = АвансыОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		0,
	|		АвансыОбороты.СуммаОборот,
	|		АвансыОбороты.Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОбороты КАК АвансыОбороты
	|			ПО ГраницыОтчетногоПериода.ЗавершениеОП > АвансыОбороты.Период) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРасчета КАК ПериодРасчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	СУММА(ВложенныйЗапрос.ОстатокНач) КАК ОстатокНач,
	|	СУММА(ВложенныйЗапрос.ОстатокКон) КАК ОстатокКон,
	|	ВложенныйЗапрос.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОстаткиУслуги
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		УслугиОстатки.Услуга КАК Услуга,
	|		УслугиОстатки.ПериодНачисления КАК ПериодРасчета,
	|		УслугиОстатки.Поставщик КАК Поставщик,
	|		УслугиОстатки.СуммаОстаток КАК ОстатокНач,
	|		0 КАК ОстатокКон,
	|		УслугиОстатки.Абонент КАК Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОстатки КАК УслугиОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления = УслугиОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиОбороты.Услуга,
	|		УслугиОбороты.ПериодНачисления,
	|		УслугиОбороты.Поставщик,
	|		УслугиОбороты.СуммаОборот,
	|		0,
	|		УслугиОбороты.Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОбороты КАК УслугиОбороты
	|			ПО ГраницыОтчетногоПериода.НачалоОП > УслугиОбороты.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиОстатки.Услуга,
	|		УслугиОстатки.ПериодНачисления,
	|		УслугиОстатки.Поставщик,
	|		0,
	|		УслугиОстатки.СуммаОстаток,
	|		УслугиОстатки.Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОстатки КАК УслугиОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления = УслугиОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиОбороты.Услуга,
	|		УслугиОбороты.ПериодНачисления,
	|		УслугиОбороты.Поставщик,
	|		0,
	|		УслугиОбороты.СуммаОборот,
	|		УслугиОбороты.Абонент
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОбороты КАК УслугиОбороты
	|			ПО ГраницыОтчетногоПериода.ЗавершениеОП > УслугиОбороты.Период) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРасчета,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.Поставщик,
	|	ВложенныйЗапрос.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Абонент КАК Абонент,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачисленийОбороты.СуммаОборот КАК НачисленноСумма,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиОборот КАК НачисленноОбъем,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВЫБОР
	|		КОГДА энргОбъемНачисленийОбороты.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)
	|			ТОГДА энргОбъемНачисленийОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Перерасчет
	|ПОМЕСТИТЬ НачисленныйОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргОбъемНачисленийОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОплатаУслугОбороты.Абонент КАК Абонент,
	|	энргОплатаУслугОбороты.Услуга КАК Услуга,
	|	энргОплатаУслугОбороты.Поставщик КАК Поставщик,
	|	энргОплатаУслугОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОплатаУслугОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОплатаУслугОбороты.СуммаОборот КАК Оплачено
	|ПОМЕСТИТЬ ДанныеОплаты
	|ИЗ
	|	РегистрНакопления.энргОплатаУслуг.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргОплатаУслугОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАвансыПоступившиеОбороты.Абонент КАК Абонент,
	|	энргАвансыПоступившиеОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргАвансыПоступившиеОбороты.СуммаОборот КАК ПоступлениеАвансаСумма
	|ПОМЕСТИТЬ АвансыПоступившие
	|ИЗ
	|	РегистрНакопления.энргАвансыПоступившие.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргАвансыПоступившиеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАвансыИспользованныеОбороты.Абонент КАК Абонент,
	|	энргАвансыИспользованныеОбороты.Услуга КАК Услуга,
	|	энргАвансыИспользованныеОбороты.Поставщик КАК Поставщик,
	|	энргАвансыИспользованныеОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргАвансыИспользованныеОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргАвансыИспользованныеОбороты.СуммаОборот КАК ИспользованноСумма
	|ПОМЕСТИТЬ ИспользованиеАванса
	|ИЗ
	|	РегистрНакопления.энргАвансыИспользованные.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ВТ_Абонент КАК ВТ)) КАК энргАвансыИспользованныеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗАпрос.Услуга КАК Услуга,
	|	ВложенныйЗАпрос.Поставщик КАК Поставщик,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачДт) КАК ОстатокНачДт,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачКт) КАК ОстатокНачКт,
	|	СУММА(ВложенныйЗАпрос.НачисленноСумма - ВложенныйЗАпрос.Перерасчет) КАК НачисленноСумма,
	|	СУММА(ВложенныйЗАпрос.НачисленноОбъем) КАК НачисленноОбъем,
	|	СУММА(ВложенныйЗАпрос.Оплачено) КАК Оплачено,
	|	СУММА(ВложенныйЗАпрос.использованоИзАвансов) КАК использованоИзАвансов,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонДт) КАК ОстатокКонДт,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонКт) КАК ОстатокКонКт,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачДт - ВложенныйЗАпрос.ОстатокНачКт) КАК ЗадолженностьНаНачало,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачДт - ВложенныйЗАпрос.ОстатокНачКт + ВложенныйЗАпрос.НачисленноСумма - ВложенныйЗАпрос.Оплачено - ВложенныйЗАпрос.использованоИзАвансов) КАК КОплате,
	|	ВТ_Абонент.Абонент КАК Абонент,
	|	ВТ_Абонент.ТипКвартиры КАК ТипКвартиры,
	|	ВТ_Абонент.ТипСобственности КАК ТипСобственности,
	|	ВТ_Абонент.АдресОбъекта КАК АдресОбъекта,
	|	ВТ_Абонент.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Абонент.ПредставлениеАбонента КАК ПредставлениеАбонента,
	|	ВТ_Абонент.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ВТ_Абонент.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	ВТ_Абонент.Проживающие КАК Проживающие,
	|	ВТ_Абонент.Прописанные КАК Прописанные,
	|	ВТ_Абонент.Льготники КАК Льготники,
	|	ВложенныйЗАпрос.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВложенныйЗАпрос.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	ВТ_Абонент.ПлощадьМОП КАК ПлощадьМОП,
	|	ВТ_Абонент.ПлощадьДома КАК ПлощадьДома,
	|	ВТ_Абонент.УК КАК УК,
	|	ВТ_Абонент.ПлощадьЖП КАК ПлощадьЖП,
	|	ВТ_Абонент.МКД КАК МКД,
	|	СУММА(ВложенныйЗАпрос.Перерасчет) КАК Перерасчет,
	|	ВТ_Абонент.КлючПомещения КАК КлючПомещения,
	|	ВТ_Абонент.Район КАК Район,
	|	ВТ_Абонент.Филиал КАК Филиал,
	|	ВТ_Абонент.ДопИнформация КАК ДопИнформация
	|ПОМЕСТИТЬ ВТ_Итого
	|ИЗ
	|	ВТ_Абонент КАК ВТ_Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиАванса.ПериодНачисления КАК ПериодНачисления,
	|			0 КАК ОстатокНачДт,
	|			ОстаткиАванса.ОстатокНач КАК ОстатокНачКт,
	|			0 КАК ОстатокКонДт,
	|			ОстаткиАванса.ОстатокКон КАК ОстатокКонКт,
	|			ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРасчета,
	|			""Аванс"" КАК Услуга,
	|			ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка) КАК Поставщик,
	|			0 КАК НачисленноСумма,
	|			0 КАК НачисленноОбъем,
	|			0 КАК Оплачено,
	|			0 КАК использованоИзАвансов,
	|			ОстаткиАванса.Абонент КАК Абонент,
	|			0 КАК ЗначениеТарифа,
	|			0 КАК Перерасчет
	|		ИЗ
	|			ОстаткиАванса КАК ОстаткиАванса
	|		ГДЕ
	|			(ОстаткиАванса.ОстатокНач <> 0
	|					ИЛИ ОстаткиАванса.ОстатокКон <> 0)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ОстаткиУслуги.ПериодНачисления,
	|			ОстаткиУслуги.ОстатокНач,
	|			0,
	|			ОстаткиУслуги.ОстатокКон,
	|			0,
	|			ОстаткиУслуги.ПериодРасчета,
	|			ОстаткиУслуги.Услуга,
	|			ОстаткиУслуги.Поставщик,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ОстаткиУслуги.Абонент,
	|			0,
	|			0
	|		ИЗ
	|			ОстаткиУслуги КАК ОстаткиУслуги
	|		ГДЕ
	|			(ОстаткиУслуги.ОстатокНач <> 0
	|					ИЛИ ОстаткиУслуги.ОстатокКон <> 0)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			НачисленныйОбъем.ПериодНачисления,
	|			0,
	|			0,
	|			0,
	|			0,
	|			НачисленныйОбъем.ПериодРасчета,
	|			НачисленныйОбъем.Услуга,
	|			НачисленныйОбъем.Поставщик,
	|			НачисленныйОбъем.НачисленноСумма,
	|			НачисленныйОбъем.НачисленноОбъем,
	|			0,
	|			0,
	|			НачисленныйОбъем.Абонент,
	|			НачисленныйОбъем.ЗначениеТарифа,
	|			НачисленныйОбъем.Перерасчет
	|		ИЗ
	|			НачисленныйОбъем КАК НачисленныйОбъем
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ДанныеОплаты.ПериодНачисления,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ДанныеОплаты.ПериодРасчета,
	|			ДанныеОплаты.Услуга,
	|			ДанныеОплаты.Поставщик,
	|			0,
	|			0,
	|			ДанныеОплаты.Оплачено,
	|			0,
	|			ДанныеОплаты.Абонент,
	|			0,
	|			0
	|		ИЗ
	|			ДанныеОплаты КАК ДанныеОплаты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			АвансыПоступившие.ПериодНачисления,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ДАТАВРЕМЯ(1, 1, 1),
	|			""Аванс"",
	|			ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПУстаяСсылка),
	|			0,
	|			0,
	|			АвансыПоступившие.ПоступлениеАвансаСумма,
	|			0,
	|			АвансыПоступившие.Абонент,
	|			0,
	|			0
	|		ИЗ
	|			АвансыПоступившие КАК АвансыПоступившие
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ИспользованиеАванса.ПериодНачисления,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ИспользованиеАванса.ПериодРасчета,
	|			ИспользованиеАванса.Услуга,
	|			ИспользованиеАванса.Поставщик,
	|			0,
	|			0,
	|			ИспользованиеАванса.ИспользованноСумма,
	|			0,
	|			ИспользованиеАванса.Абонент,
	|			0,
	|			0
	|		ИЗ
	|			ИспользованиеАванса КАК ИспользованиеАванса
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ИспользованиеАванса.ПериодНачисления,
	|			0,
	|			0,
	|			0,
	|			0,
	|			ДАТАВРЕМЯ(1, 1, 1),
	|			""Аванс"",
	|			ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПУстаяСсылка),
	|			0,
	|			0,
	|			-ИспользованиеАванса.ИспользованноСумма,
	|			0,
	|			ИспользованиеАванса.Абонент,
	|			0,
	|			0
	|		ИЗ
	|			ИспользованиеАванса КАК ИспользованиеАванса) КАК ВложенныйЗАпрос
	|		ПО ВТ_Абонент.Абонент = ВложенныйЗАпрос.Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗАпрос.Услуга,
	|	ВложенныйЗАпрос.Поставщик,
	|	ВТ_Абонент.Абонент,
	|	ВТ_Абонент.ТипКвартиры,
	|	ВТ_Абонент.ТипСобственности,
	|	ВТ_Абонент.АдресОбъекта,
	|	ВТ_Абонент.ЛицевойСчет,
	|	ВТ_Абонент.ПредставлениеАбонента,
	|	ВТ_Абонент.ОбщаяПлощадь,
	|	ВТ_Абонент.ЖилаяПлощадь,
	|	ВТ_Абонент.Проживающие,
	|	ВТ_Абонент.Прописанные,
	|	ВТ_Абонент.Льготники,
	|	ВложенныйЗАпрос.Услуга.ЕдиницаИзмерения,
	|	ВТ_Абонент.ПлощадьМОП,
	|	ВТ_Абонент.ПлощадьДома,
	|	ВТ_Абонент.УК,
	|	ВТ_Абонент.ПлощадьЖП,
	|	ВТ_Абонент.МКД,
	|	ВТ_Абонент.КлючПомещения,
	|	ВТ_Абонент.Район,
	|	ВТ_Абонент.Филиал,
	|	ВТ_Абонент.ДопИнформация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итого.Услуга КАК Услуга,
	|	ВТ_Итого.Поставщик КАК Поставщик,
	|	СУММА(ВТ_Итого.ОстатокНачДт) КАК ОстатокНачДт,
	|	СУММА(ВТ_Итого.ОстатокНачКт) КАК ОстатокНачКт,
	|	СУММА(ВТ_Итого.НачисленноСумма) КАК НачисленноСумма,
	|	СУММА(ВТ_Итого.НачисленноОбъем) КАК НачисленноОбъем,
	|	СУММА(ВТ_Итого.Оплачено) КАК Оплачено,
	|	СУММА(ВТ_Итого.использованоИзАвансов) КАК использованоИзАвансов,
	|	СУММА(ВТ_Итого.ОстатокКонДт) КАК ОстатокКонДт,
	|	СУММА(ВТ_Итого.ОстатокКонКт) КАК ОстатокКонКт,
	|	СУММА(ВТ_Итого.ЗадолженностьНаНачало) КАК ЗадолженностьНаНачало,
	|	СУММА(ВТ_Итого.КОплате) КАК КОплате,
	|	ВТ_Итого.Абонент КАК Абонент,
	|	ВТ_Итого.ТипКвартиры КАК ТипКвартиры,
	|	ВТ_Итого.ТипСобственности КАК ТипСобственности,
	|	ВТ_Итого.АдресОбъекта КАК АдресОбъекта,
	|	ВТ_Итого.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Итого.ПредставлениеАбонента КАК ПредставлениеАбонента,
	|	ВТ_Итого.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ВТ_Итого.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	ВТ_Итого.Проживающие КАК Проживающие,
	|	ВТ_Итого.Прописанные КАК Прописанные,
	|	ВТ_Итого.Льготники КАК Льготники,
	|	ВТ_Итого.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ВТ_Итого.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	ВТ_Итого.ПлощадьМОП КАК ПлощадьМОП,
	|	ВТ_Итого.ПлощадьДома КАК ПлощадьДома,
	|	ВТ_Итого.УК КАК УК,
	|	ВТ_Итого.ПлощадьЖП КАК ПлощадьЖП,
	|	ВТ_Итого.МКД КАК МКД,
	|	СУММА(ВТ_Итого.Перерасчет) КАК Перерасчет,
	|	СУММА(ЕстьNull(ВТ_ПениЗаПериод.СуммаПени,0)) КАК СуммаПени,
	|	ВТ_Итого.КлючПомещения КАК КлючПомещения,
	|	ВТ_Итого.Район КАК Район,
	|	ВТ_Итого.Филиал КАК Филиал,
	|	ВТ_Итого.ДопИнформация КАК ДопИнформация
	|ИЗ
	|	ВТ_Итого КАК ВТ_Итого
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПениЗаПериод КАК ВТ_ПениЗаПериод
	|		ПО (ВТ_Итого.Абонент = ВТ_ПениЗаПериод.Абонент)
	|ГДЕ
	|	НЕ(ВТ_Итого.Услуга = ""Аванс""
	|				И ВТ_Итого.КОплате = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итого.Услуга,
	|	ВТ_Итого.Поставщик,
	|	ВТ_Итого.Абонент,
	|	ВТ_Итого.ТипКвартиры,
	|	ВТ_Итого.ТипСобственности,
	|	ВТ_Итого.АдресОбъекта,
	|	ВТ_Итого.ЛицевойСчет,
	|	ВТ_Итого.ПредставлениеАбонента,
	|	ВТ_Итого.ОбщаяПлощадь,
	|	ВТ_Итого.ЖилаяПлощадь,
	|	ВТ_Итого.Проживающие,
	|	ВТ_Итого.Прописанные,
	|	ВТ_Итого.Льготники,
	|	ВТ_Итого.ЕдиницаИзмерения,
	|	ВТ_Итого.ПлощадьМОП,
	|	ВТ_Итого.ПлощадьДома,
	|	ВТ_Итого.УК,
	|	ВТ_Итого.ПлощадьЖП,
	|	ВТ_Итого.МКД,
	|	ВТ_Итого.КлючПомещения,
	|	ВТ_Итого.Район,
	|	ВТ_Итого.Филиал,
	|	ВТ_Итого.ДопИнформация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Абонент,
	|	ВТ_Итого.Услуга
	|ИТОГИ
	|	СУММА(ОстатокНачДт),
	|	СУММА(ОстатокНачКт),
	|	СУММА(НачисленноСумма),
	|	СУММА(НачисленноОбъем),
	|	СУММА(Оплачено),
	|	СУММА(использованоИзАвансов),
	|	СУММА(ОстатокКонДт),
	|	СУММА(ОстатокКонКт),
	|	СУММА(ЗадолженностьНаНачало),
	|	СУММА(КОплате),
	|	МАКСИМУМ(ТипКвартиры),
	|	МАКСИМУМ(СуммаПени),
	|	МАКСИМУМ(ТипСобственности),
	|	МАКСИМУМ(АдресОбъекта),
	|	МАКСИМУМ(ЛицевойСчет),
	|	МАКСИМУМ(ПредставлениеАбонента),
	|	МАКСИМУМ(ОбщаяПлощадь),
	|	МАКСИМУМ(ЖилаяПлощадь),
	|	МАКСИМУМ(Проживающие),
	|	МАКСИМУМ(Прописанные),
	|	МАКСИМУМ(Льготники),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	МАКСИМУМ(ПлощадьМОП),
	|	МАКСИМУМ(ПлощадьДома),
	|	МАКСИМУМ(УК),
	|	МАКСИМУМ(ПлощадьЖП),
	|	МАКСИМУМ(МКД),
	|	СУММА(Перерасчет),
	|	МАКСИМУМ(КлючПомещения),
	|	МАКСИМУМ(ДопИнформация)
	|ПО
	|	" + ?(ПолучитьФункциональнуюОпцию("энргИспользоватьАбонентскиеОтделы"), "Филиал", "Район") + ",
	|	Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийМКД.МКД КАК МКД,
	|	энргОбъемНачисленийМКД.Услуга КАК Услуга,
	|	энргОбъемНачисленийМКД.ПриборУчета.Код КАК НомерПУ,
	|	МИНИМУМ(энргОбъемНачисленийМКД.НачальныеПоказания) КАК НачальныеПоказания,
	|	МАКСИМУМ(энргОбъемНачисленийМКД.КонечныеПоказания) КАК КонечныеПоказания,
	|	СУММА(энргОбъемНачисленийМКД.ОбъемУслуги) КАК ОбъемУслуги,
	|	энргОбъемНачисленийМКД.Шкала КАК Шкала
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийМКД КАК энргОбъемНачисленийМКД
	|ГДЕ
	|	энргОбъемНачисленийМКД.Организация = &Организация
	|	И энргОбъемНачисленийМКД.МКД В
	|			(ВЫБРАТЬ
	|				ВТ.МКД
	|			ИЗ
	|				ВТ_Абонент КАК ВТ)
	|	И энргОбъемНачисленийМКД.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И энргОбъемНачисленийМКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОбъемНачисленийМКД.МКД,
	|	энргОбъемНачисленийМКД.Услуга,
	|	энргОбъемНачисленийМКД.ПриборУчета.Код,
	|	энргОбъемНачисленийМКД.Шкала
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга
	|ИТОГИ ПО
	|	МКД";
	
	
	//ПараметрыОтчета.вставить("ПериодНачисленияНачало",ПериодНачисленияНачало);

	 Запрос.Текст = ТекстГраницыПериодов  
	 + Символы.ПС + ";" 
	 + Символы.ПС + "/////////"
	 + Символы.ПС + ОсновнойТекст;
	
	Пакет = Запрос.ВыполнитьПакет();
	РезультатОсновногоЗапроса = Пакет[Пакет.Количество()-2];
	РезультатЗапросаПоказаний = Пакет[Пакет.Количество()-1];
	СтруктураРезультат = Новый Структура("РезультатОсновногоЗапроса,РезультатЗапросаПоказаний", РезультатОсновногоЗапроса,РезультатЗапросаПоказаний);
	//РезультатЗапроса 	= Запрос.Выполнить();
	//Выборка 			= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МВТ.Закрыть();
	
	Возврат СтруктураРезультат;
КонецФункции	

Функция СоотвествиеПараметровСвойствам(ОбъектМетаданных)
	
	Соотвествие 	= Новый Структура;
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектМетаданных",ОбъектМетаданных);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргНастройкиПечатныхФорм.Параметр,
	|	энргНастройкиПечатныхФорм.ЗначениеПараметра
	|ИЗ
	|	РегистрСведений.энргНастройкиПечатныхФорм КАК энргНастройкиПечатныхФорм
	|ГДЕ
	|	энргНастройкиПечатныхФорм.ОбъектМетаданных = &ОбъектМетаданных";
	Результат  	= Запрос.Выполнить();
	Выборка  	= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		Соотвествие.Вставить(Выборка.Параметр,Выборка.ЗначениеПараметра);
	КонецЦикла;   
	
	Возврат Соотвествие;
КонецФункции

Функция ПолучитьРеквизитыКвитанции(Выборка, ДанныеОрганизации, ПериодНачисления)
	РеквизитыКвитанции = Новый Структура;
	                                                                                                          
	РеквизитыКвитанции.Вставить("ТекстПолучателя", 			СокрЛП(ДанныеОрганизации.Организация.Наименование));
	РеквизитыКвитанции.Вставить("НомерСчетаПолучателя", 			ДанныеОрганизации.БанковскийСчет.НомерСчета);
	РеквизитыКвитанции.Вставить("НаименованиеБанкаПолучателя", 		ДанныеОрганизации.БанковскийСчет.Банк.Наименование);
	РеквизитыКвитанции.Вставить("БИКБанкаПолучателя", 				ДанныеОрганизации.БанковскийСчет.Банк.Код);
	РеквизитыКвитанции.Вставить("СчетБанкаПолучателя", 				ДанныеОрганизации.БанковскийСчет.Банк.КоррСчет);
	РеквизитыКвитанции.Вставить("СуммаЧислом",		 				Выборка.КОплате);
	//РеквизитыКвитанции.Вставить("ИННПолучателя", 					ДанныеОрганизации.Организация.ИНН);
	РеквизитыКвитанции.Вставить("НомерЛицевогоСчетаПлательщика", 	СокрЛП(Выборка.Абонент.ЛицевойСчет));
	
	//РеквизитыКвитанции.Вставить("АдресПлательщика", 				Выборка.АдресОбъекта);
	//РеквизитыКвитанции.Вставить("НазначениеПлатежа", 				"Оплата услуг водоснабжения и водоотведения");
	
	ПериодОплаты = Формат(ПериодНачисления, "ДФ=MM")+"-"+Формат(ПериодНачисления, "ДФ=MM")+"."+Формат(ПериодНачисления, "ДФ=yyyy"); 
	
	РеквизитыКвитанции.Вставить("ПериодОплаты", 					ПериодОплаты);
	РеквизитыКвитанции.Вставить("ФамилияПлательщика", 				СокрЛП(Выборка.Абонент));
	//РеквизитыКвитанции.Вставить("ИмяПлательщика", 				ДанныеОрганизации.Абонент.Имя);
	//РеквизитыКвитанции.Вставить("ОтчествоПлательщика", 			ДанныеОрганизации.Абонент.Отчество);
	Возврат РеквизитыКвитанции;
КонецФункции	

#КонецОбласти

#КонецЕсли