#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить шкалы вида канальности.
//
// Параметры:
//  ВидКанальности	-	СправочникСсылка.энргВидыКанальности.
// 
// Возвращаемое значение:
//  РезультатЗапроса.
//
Функция ПолучитьШкалыВидаКанальности(ВидКанальности) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВидыКанальности.Ссылка КАК ВидКанальности,
		|	энргВидыКанальностиШкалы.Шкала КАК Шкала
		|ИЗ
		|	Справочник.энргВидыКанальности КАК энргВидыКанальности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
		|		ПО энргВидыКанальности.Ссылка = энргВидыКанальностиШкалы.Ссылка
		|			И (энргВидыКанальности.Ссылка = &ВидКанальности)
		|			И (энргВидыКанальностиШкалы.Ссылка = &ВидКанальности)
		|			И (НЕ энргВидыКанальности.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("ВидКанальности", ВидКанальности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#КонецЕсли