#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет действующие приборы учета МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующиеПриборыУчетаМКД(Схема, ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргПриборыУзловУчетаМКД.ПриборыУзловУчетаМКД(Схема,ПараметрыОтбора,"ПриборыУзловУчета"); 
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПриборыУзловУчета" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргПриборыУзловУчетаМКД.ПриборыУзловУчетаМКД(Схема,ПараметрыОтбора,"ПриборыУзловУчета");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеПриборыУчетаМКД());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет активные приборы учета МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктивныеПриборыУчетаМКД(Схема, ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргПриборыТочекМКД.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочекМКД"); 
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПриборыДействующихТочекМКД" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргПриборыТочекМКД.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочекМКД");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктивныеПриборыУчетаМКД());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующиеПриборыУчетаМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Организация КАК Организация,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Район КАК Район,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.МКД КАК МКД,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.УзелУчета КАК УзелУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВведенныеПриборы
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, ТочкаУчета, УзелУчета, ТипИзмерителя, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ПриборыУзловУчета.Организация КАК Организация,
	|					ПриборыУзловУчета.Район КАК Район,
	|					ПриборыУзловУчета.МКД КАК МКД,
	|					ПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|					ПриборыУзловУчета.УзелУчета КАК УзелУчета,
	|					ПриборыУзловУчета.ТипИзмерителя КАК ТипИзмерителя,
	|					ПриборыУзловУчета.ПриборУчета КАК ПриборУчета
	|				ИЗ
	|					ПриборыУзловУчета КАК ПриборыУзловУчета)) КАК энргСостояниеПриборовУзловУчетаМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	
	////
	////"ВЫБРАТЬ
	////|	СостояниеПриборов.Организация КАК Организация,
	////|	СостояниеПриборов.Район КАК Район,
	////|	СостояниеПриборов.МКД КАК МКД,
	////|	СостояниеПриборов.ТочкаУчета КАК ТочкаУчета,
	////|	СостояниеПриборов.ПриборУчета КАК ПриборУчета
	////|ПОМЕСТИТЬ ВведенныеПриборы
	////|ИЗ
	////|	РегистрСведений.энргСостояниеПриборовМКД.СрезПоследних(
	////|			&Период,
	////|			(Организация, Район, МКД, ТочкаУчета, ПриборУчета) В
	////|				(ВЫБРАТЬ
	////|					ПриборыДействующихТочек.Организация,
	////|					ПриборыДействующихТочек.Район,
	////|					ПриборыДействующихТочек.МКД,
	////|					ПриборыДействующихТочек.ТочкаУчета,
	////|					ПриборыДействующихТочек.ПриборУчета
	////|				ИЗ
	////|					ПриборыДействующихТочек КАК ПриборыДействующихТочек)) КАК СостояниеПриборов
	////|ГДЕ
	////|	СостояниеПриборов.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаАктивныеПриборыУчетаМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	СостояниеПриборов.Организация КАК Организация,
	|	СостояниеПриборов.Район КАК Район,
	|	СостояниеПриборов.МКД КАК МКД,
	|	СостояниеПриборов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеПриборов.ПриборУчета КАК ПриборУчета	
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, ТочкаУчета, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ПриборыДействующихТочекМКД.Организация,
	|					ПриборыДействующихТочекМКД.Район,
	|					ПриборыДействующихТочекМКД.МКД,
	|					ПриборыДействующихТочекМКД.ТочкаУчета,
	|					ПриборыДействующихТочекМКД.ПриборУчета
	|				ИЗ
	|					ПриборыДействующихТочекМКД КАК ПриборыДействующихТочекМКД)) КАК СостояниеПриборов
	|ГДЕ
	|	СостояниеПриборов.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли