#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
	энргЛокализацияСервер.ПриСозданииНаСервере_энргНастройкаСезонностиУслуг(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеПрименятьСезонностьПриИзменении(Элемент)
	Запись.ОбъемЗаПрошлыйГод = Запись.НеПрименятьСезонность;
КонецПроцедуры

#КонецОбласти
