#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрефиксТочекУчета = "";
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
		
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"СпособРасчетаНорматива","СпособыРасчетаНормативаСоставныхУслуг","ПараметрыСпособовРасчетаНорматива");
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"Договор","ДоговорыСоставныхУслуг","ПараметрыДоговоров");
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
			
			энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
			
			бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");
		КонецЕсли;	
	КонецЕсли;
	ПрефиксТочекУчета = "";
	ЗаполнитьТекстовыеПоля();
	ЗаполнитьГрафикиРежимаОграничения();
	ЗаполнитьПараметрыТочекПоставки();
	ЗаполнитьТУВПостоянномРасходе();
	бестЛокализацияСервер.ПриСозданииНаСервере_бестЗаключениеДоговоровСЮридическимиЛицами(ЭтотОбъект);
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	ЗаполнитьТекстовыеПоля(); 	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДанныеКварталов();
	НастроитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаписатьГрафикиРежимаОграничения(); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверкаДублированияНаименованийОбъектовРасчета(Отказ);			
	//энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект);
	СоответствиеСтрок 						= Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
	бестПользовательскийВводСервер.ЗаписатьПараметрыОбъекта(Объект.ОбъектыРасчета, ТекущийОбъект);
	
	// Добавлено для УК!
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение и Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение") Тогда
		
		ПроверитьЗаполнениеДанных(Отказ);
		
		НовыеОбъектыРасчета					= Новый Массив;
		
		Сч = 0;
		Для Каждого СтрокаОбъектовРасчета Из ТекущийОбъект.ОбъектыРасчета Цикл
			Если СтрокаОбъектовРасчета.ОписаниеОбъекта <> Объект.ОбъектыРасчета[Сч].ОписаниеОбъекта И Не ПустаяСтрока(Объект.ОбъектыРасчета[Сч].ОписаниеОбъекта)	Тогда
				//Если НЕ ЗначениеЗаполнено(СтрокаОбъектовРасчета.ОбъектРасчета) Тогда
					СтрокаОбъектовРасчета.ОписаниеОбъекта	= Объект.ОбъектыРасчета[Сч].ОписаниеОбъекта;
				//КонецЕсли;
				СтрокаОбъектовРасчета.ОбъектРасчета	= Объект.ОбъектыРасчета[Сч].ОбъектРасчета;
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаОбъектовРасчета.ОписаниеОбъекта) И НЕ ЗначениеЗаполнено(СтрокаОбъектовРасчета.ОбъектРасчета) Тогда
				СтрокаОбъектовРасчета.ОбъектРасчета = Справочники.бестОбъектыРасчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеОбъектыРасчета.Добавить(СтрокаОбъектовРасчета.НомерСтроки);
			КонецЕсли;			
			Сч = Сч +1;
		КонецЦикла;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеОбъектыРасчета",НовыеОбъектыРасчета);
		Если Объект.Договор.ТипДоговора <> Перечисления.бестТипыДоговоров.УправляющаяКомпания Тогда
					
			Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
			// TODO FIX ME
			Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
			
			НовыеТочкиУчета						= Новый Массив;
			НовыеУзлыУчета 						= Новый Массив;
			НовыеПриборыУчета 					= Новый Массив;
			НовыеИзмерители 					= Новый Массив;
			СоответствиеПрибора 				= Новый Соответствие;
			
			Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
				Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
					СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				КонецЕсли;
				
				// Теперь это для узлов --
				//Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				//	СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				//	НовыеУзлыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				//КонецЕсли;
				Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
					СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
					
					ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
					СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
				КонецЕсли;
				// --Теперь это для узлов					
				
			КонецЦикла;
			
			//Для Каждого СтрокаПриборовУчета Из ТекущийОбъект.ПриборыУзловУчета Цикл
			//	
			//	Если Не ПустаяСтрока(СтрокаПриборовУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаПриборовУчета.ПриборУчета) Тогда
			//		СтрокаПриборовУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
			//		НовыеПриборыУчета.Добавить(СтрокаПриборовУчета.НомерСтроки);
			//	КонецЕсли;			
			//	
			//КонецЦикла;
			
			Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
				Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
					//СтрокаИзмерителя.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					//НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
					
					ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
					СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
					
					Если СоздаватьНовый Тогда
						ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
						НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
					КонецЕсли;			
					
					СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
				КонецЕсли;			
			КонецЦикла;

			
			
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
			//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеУзлыУчета", 	НовыеУзлыУчета);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение и Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение") Тогда
		Для каждого стр из Объект.ОбъектыРасчета Цикл
			бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,стр.ОбъектРасчета);
		КонецЦикла;
	КонецЕсли;
	
	//Пока нет
	
	//ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	//Если ДопСвойства.свойство("УстановкаФормулыРасчета") тогда
	//	ДанныеУстановкиФормулыРасчета = ДопСвойства.УстановкаФормулыРасчета;		 
	//иначе
	//	ДанныеУстановкиФормулыРасчета = Неопределено;
	//КонецЕсли;
	//	
	//Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
	//	ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	//иначе
	//	ДанныеДляПерерасчета = Неопределено;
	//КонецЕсли;

	//Пока нет

	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	ЗаполнитьПараметрыТочекПоставки();
	
	ЗаполнитьТекстовыеПоля();
	ЗаполнитьТУВПостоянномРасходе();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Пока нет

	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеДляФормулРасчета(ТекущийОбъект);
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект);
	//КонецЕсли;
	
	//Пока нет
	
	Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение и Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение") Тогда 
		бестРаботаСОбъектамиНПСервер.ПроверитьИСоздатьОбъектыРасчета(ТекущийОбъект,"ОбъектыРасчета");
		// Добавлено для УК!
		Если Объект.Договор.ТипДоговора <> Перечисления.бестТипыДоговоров.УправляющаяКомпания Тогда
			энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
			
			НовыеПриборыУчета 					= Новый Массив;
			Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
				НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
			КонецЕсли;
			
			НовыеИзмерители 					= Новый Массив;
			Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
				НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
			КонецЕсли;
			
			Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
				Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
					ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
				КонецЕсли;			
			КонецЦикла;
			
			Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Для каждого стр из Объект.ОбъектыРасчета Цикл
		ОповеститьОбИзменении(стр.ОбъектРасчета);		
	КонецЦикла;
		
	ОбновитьСуммуПоКварталу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПриИзмененииДатыИлиДоговора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестЗаключениеДоговоровСЮридическимиЛицами",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Договор) тогда
		бестПользовательскийВводКлиент.ПриИзмененииДоговораКонтрагента(Объект, "ДатаФактическогоСобытия");
		ПриИзмененииДатыИлиДоговора();
		ЗаполнитьРеквизитыПоДоговору();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("БлокЮридическихЛиц", Истина);
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер(); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьПениПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа1", "Видимость", Объект.РассчитыватьПени);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПотребителей", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентПени", "Видимость",  Не Объект.РассчитыватьПени);
	Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.бестВариантыРасчетаПени.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентПени", "Видимость", Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.бестВариантыРасчетаПени.ОтСуммы"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПотребителей", "Видимость", Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.бестВариантыРасчетаПени.ОтСтавкиРефинансирования"));
		
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаДоТППриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные.ТочкаУчетаДоТП = ТочкаУчетаДоТП;
	НастроитьВидимостьДанныхОТПДляОбъектовРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаТПДляОбъектаРасчетаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные.ЗаявкаНаТехнологическоеПрисоединение = ЗаявкаНаТПДляОбъектаРасчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорТПДляОбъектаРасчетаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные.ДоговорТехнологическогоПрисоединения = ДоговорТПДляОбъектаРасчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация,Объект.Контрагент,СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ЗаключениеДоговораДоТППриИзменении(Элемент)
	НастроитьВидимостьДанныхОТП();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРасчета

&НаКлиенте
Процедура ОбъектыРасчетаПриАктивизацииСтроки(Элемент)
		
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекОбъектРасчета = ТекДанные.ОбъектРасчета;
	
	ТочкаУчетаДоТП = ТекДанные.ТочкаУчетаДоТП;
	ЗаявкаНаТПДляОбъектаРасчета = ТекДанные.ЗаявкаНаТехнологическоеПрисоединение;
	ДоговорТПДляОбъектаРасчета = ТекДанные.ДоговорТехнологическогоПрисоединения;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкаУчетаДоТП", "Видимость", Истина);
	НастроитьВидимостьДанныхОТПДляОбъектовРасчета();
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ГарантированныеОбъемы,					Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТЗГрафикиРежимаОграничения,			Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ВеличинаБрони,			                Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы["ТочкиУчета"],	Неопределено,		ТекДанные.IDСтроки,, "Владельца");
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы["ТочкиПоставокОбъектовРасчета"],	Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПостоянныйРасходТУ,	Неопределено,	ТекДанные.IDСтроки,, "ОбъектРасчета");
	ЗаполнитьИтогиТочекПоставки(ТекДанные.IDСтроки);
	УстановитьПараметрыВыбораУслуги();
	
	Элементы.ТочкиУчета.КоманднаяПанель.ПодчиненныеЭлементы.ТочкиУчетаДобавить.Доступность = Не ТекДанные.ОбъектУК;
	Элементы.ТочкиУчета.КоманднаяПанель.ПодчиненныеЭлементы.ТочкиУчетаУдалить.Доступность = Не ТекДанные.ОбъектУК;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаТочкиПоставки", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаГруппа17", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаТУ4", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаСредстваИзмерения", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаТехническиеСвойстваТУ", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОбъемы", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафикиРежимаОграничения", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВеличинаБрони", "ТолькоПросмотр", ТекДанные.ОбъектУК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДобавитьСубабонентов", "Доступность", Не ТекДанные.ОбъектУК);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаНаименованиеОбъектаРасчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.НаименованиеОбъектаРасчета) и НЕ ЗначениеЗаполнено(ТекДанные.ОбъектРасчета) Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.Собственник) Тогда
			ТекДанные.Собственник	= Объект.Контрагент;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаОбъектРасчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ОбъектРасчета) Тогда
		
		ТекСтрока 	= 	ТекДанные.ПолучитьИдентификатор();
		Отбор		= 	Новый Структура("ОбъектРасчета", ТекДанные.ОбъектРасчета);
		ИщемСтроки	=	Объект.ОбъектыРасчета.НайтиСтроки(Отбор);
		Если ИщемСтроки.Количество()>1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные по объекту расчета " + ТекДанные.ОбъектРасчета + " уже введены. Строка не будет добавлена");
			Объект.ОбъектыРасчета.Удалить(ТекДанные.НомерСтроки-1);
			Возврат;
		КонецЕсли;		
		
		Если ТекОбъектРасчета = ТекДанные.ОбъектРасчета Тогда
			ДанныеОбъекта = бестРаботаСОбъектамиНПСервер.ПолучитьИнформациюПоОбъекту(ТекДанные.ОбъектРасчета);
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеОбъекта.СтруктураОбъекта);
			ТекДанные.ОписаниеОбъекта = ЗаписатьОписаниеОбъекта(ДанныеОбъекта.СтруктураОбъекта);
		Иначе	
			// Ищем строки по индентификатору
			ТаблицыФормы				= Новый Массив;	
			ТаблицыФормы.Добавить("ГарантированныеОбъемы");
		
			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
			
			ТаблицыФормы				= Новый Массив;	
			ТаблицыФормы.Добавить("ТочкиУчета");
			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "Владельца");
				
			ДанныеОбъекта = бестРаботаСОбъектамиНПСервер.ПолучитьИнформациюПоОбъекту(ТекДанные.ОбъектРасчета);
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеОбъекта.СтруктураОбъекта);
					
			МассивОбъемов = ДанныеОбъекта.МассивОбъемов;
			Для Каждого ТекОбъем Из МассивОбъемов Цикл
				НовСтрока = Объект.ГарантированныеОбъемы.Добавить();
				НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
				ЗаполнитьЗначенияСвойств(НовСтрока, ТекОбъем);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ОбъектыРасчетаОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ОбъектыРасчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("IDСтроки", 		Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;	
		НоваяСтрока = Объект.ОбъектыРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные);
		НоваяСтрока.idСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
		
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",ТекДанные.АдресОбъекта,ТекДанные.АдресОбъектаЗначение);
	
	ПараметрыФормыКонтактнойИнформации.Значение 		= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	Оповещение 											= Новый ОписаниеОповещения("ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Истина);
	Оповещение.ДополнительныеПараметры.Вставить("КлючСтроки", 		 Элементы.ОбъектыРасчета.ТекущаяСтрока);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);


КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
		
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 									= Объект.ОбъектыРасчета.НайтиПоИдентификатору(ДополнительныеПараметры.КлючСтроки);	
	
	ТекущиеДанные.АдресОбъекта 						= РезультатЗакрытия.Представление;
	ТекущиеДанные.АдресОбъектаЗначение 				= РезультатЗакрытия.Значение; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;

	ТекДанные.АдресОбъектаЗначение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекДанные.АдресОбъекта, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаМКДПриИзменении(Элемент)
	Элементы.ОбъектыРасчета.ТекущиеДанные.АдресОбъекта = ПолучитьАдресМКД(Элементы.ОбъектыРасчета.ТекущиеДанные.МКД,ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома")); 
	Элементы.ОбъектыРасчета.ТекущиеДанные.Участвует		= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если Элементы.ОбъектыРасчета.ТекущиеДанные.ОбъектУК Тогда
		Возврат;
	КонецЕсли;
	Если Поле.Имя = "ОбъектыРасчетаДополнительнаяИнформация" Тогда
		ТекущиеДанные		= Элементы.ОбъектыРасчета.ТекущиеДанные;
		КлючДанных 			= бестПользовательскийВводКлиент.ПолучитьКлючЗаполненияИнформацииОбъекта();
		ВходныеДанные		= Новый Структура(КлючДанных);
		ЗаполнитьЗначенияСвойств(ВходныеДанные,ТекущиеДанные);
		
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ИнформацияОбъектаЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные));
		ОткрытьФорму("ОбщаяФорма.бестИнформацияОбъекта", Новый Структура("ВходныеДанные,КлючДанных",ВходныеДанные,КлючДанных),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГарантированныеОбъемы

&НаКлиенте
Процедура ГарантированныеОбъемыПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеОбъемы = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанныеОбъемы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеОбъемы.IDСтроки = ТекДанные.IDСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыЯнварьПриИзменении(Элемент)
	СуммаПоКварталу()
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыПриАктивизацииСтроки(Элемент)
	УстановитьПараметрыВыбораУслуги();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВеличинаБрони

&НаКлиенте
Процедура ВеличинаБрониПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеОбъемы = Элементы.ВеличинаБрони.ТекущиеДанные;
	Если ТекДанныеОбъемы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеОбъемы.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура ВеличинаБрониУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.ВеличинаБрони.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	
	ТаблицаТочкиПоставок	= Элементы.ТочкиПоставки;	
	ТекущиеДанные 			= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаТочкиПоставок,"IDСтроки",ТекущиеДанные.IDСтроки);
	
	УстановитьВидимостьТарифнойКатегории(ТекущиеДанные.ЦеноваяКатегория);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидКанальностиПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомКанальности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомКанальности }
	
	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ВидКанальности);
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	// энргРаботаСПоставщиками {
	бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСПоставщиками } 
	
	УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	СоответствиеЗначенияПоУмолчанию = Новый Соответствие;
	ДоговорОснование = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ОснованиеДопСоглашения");
	СоответствиеЗначенияПоУмолчанию.Вставить("Договор", 
		?(ЗначениеЗаполнено(ДоговорОснование), ДоговорОснование, Объект.Договор));
	
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги,"ДоговорыСоставныхУслуг",СоответствиеЗначенияПоУмолчанию);
	УстановитьУсловноеОФормлениеФормыКлиент("Договор","ПараметрыДоговоров");
	
	Если ИспользоватьШкалыПриборовУчета Тогда
		СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
		бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
	КонецЕсли;
	
	Объект.ГарантированныеОбъемы.Очистить();
	УстановитьПараметрыВыбораУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("IDСтроки", 		Элементы.ТочкиУчета.ТекущиеДанные.IDСтроки);
	ПроверкаУдаленияСтроки(ДопПараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтрокиВладельца = ТекДанные.IDСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСпособРасчетаНормативаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");
	//бестРаботаСоСпособомРасчетаНормативаКлиент.СпособРасчетаНормативаАвтоПодбор(ЭтаФорма,ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСпособРасчетаНормативаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныНачалоДействияКоммерскогоУчета1ПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
		энргРаботаСТочкамиУчетаКлиент.ПриИзмененииДатДействияКоммерческогоУчета(ТекущиеДанные, "НачалоДействияКоммерскогоУчета");
	КонецЕсли;
	
	ПроставитьДатыКомУчетаДляПУ(ТекущиеДанные.IDСтроки, ТекущиеДанные.НачалоДействияКоммерскогоУчета, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныКонецДействияКоммерскогоУчета1ПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
		
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	//	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииДатДействияКоммерческогоУчета(ТекущиеДанные, "КонецДействияКоммерскогоУчета");
	//КонецЕсли;
	ПроставитьДатыКомУчетаДляПУ(ТекущиеДанные.IDСтроки, ТекущиеДанные.КонецДействияКоммерскогоУчета, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета"].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.СредстваИзмерения 		= "Не заполнены";
		ТекущиеДанные.ТехническиеСвойстваТУ		= "Не заполнены"; 
		ТекущиеДанные.НастройкиТарифа		    = "Не заполнены";
		ЗаполнитьРеквизитыПоДоговору(ТекущиеДанные);
	КонецЕсли;
	
	Если Копирование Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета"].ТекущиеДанные;
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.ВидДифференцированности   = Неопределено;
		ТекущиеДанные.ВидКанальности            = Неопределено;
		ТекущиеДанные.ВидДифференцированности   = Неопределено;
		ТекущиеДанные.ДатаВыпуска               = Неопределено;
		ТекущиеДанные.ДатаПоверкиСчетчика       = Неопределено;
		ТекущиеДанные.ДатаУстановкиПломбы       = Неопределено;
		ТекущиеДанные.ЗаводскойНомер            = "";
		ТекущиеДанные.КонецДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.КоэффициентПУ             = 1;
		ТекущиеДанные.НаименованиеТочки         = "";
		ТекущиеДанные.НачалоДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.НетТехническойВозможностиУстановкиПУ = Ложь;
		ТекущиеДанные.НомерПломбы               = "";
		ТекущиеДанные.ОписаниеПрибора 			= "";
		ТекущиеДанные.ОписаниеТочки 			= "";
		ТекущиеДанные.ПриборУчета               = "";
		ТекущиеДанные.Расположение              = Неопределено;
		ТекущиеДанные.ТекущиеПоказания          = 0;
		ТекущиеДанные.ТочкаУчета                = Неопределено;
		ТекущиеДанные.УзелУчета                 = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТипУзлаУчета1ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;		
	Если ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		Если не ЗначениеЗаполнено(ТекущиеДанные.ВладелецУзлаУчета) Тогда
			ТекущиеДанные.ВладелецУзлаУчета = Объект.Контрагент;
		КонецЕсли;
	Иначе		
		ТекущиеДанные.ВладелецУзлаУчета = ПредопределенноеЗначение("Справочник.энргКонтрагенты.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСубабонентов(Команда)
	ТекущиеДанные = Элементы["ТочкиУчета"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СтруктураОтвета = бестРаботаСТочкамиУчетаНПКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект, Истина);
	ПолучитьДанныеТЧСубабонентов(СтруктураОтвета.ПараметрыПередачи);
	бестРаботаСТочкамиУчетаНПКлиент.ДобавитьСубабонентов(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЦеноваяКатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеЦеновыеКатегории = бестРаботаСТочкамиУчетаНПКлиент.ПолучитьСписокЦК(МаксимальнаяМощностьИтог);
	Элемент.СписокВыбора.ЗагрузитьЗначения(ДоступныеЦеновыеКатегории);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСтруктураСетиПриИзменении(Элемент)
	ТекущиеДанные						= Элементы.ТочкиУчета.ТекущиеДанные;
	ТекущиеДанные.ДанныеРасположения 	= ПолучитьСхемуПрисоединения(ТекущиеДанные.СтруктураСети);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеТочкиПоставки 	 = ПолучитьСписокПодключенныхТП();
	Элемент.СписокВыбора.ЗагрузитьЗначения(ДоступныеТочкиПоставки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаПоставкиПриИзменении(Элемент)
	ТекущиеДанные		= Элементы.ТочкиУчета.ТекущиеДанные;
	
	СтруктураПоиска  			= Новый Структура("ТочкаПоставки", ТекущиеДанные.ТочкаПоставки);
	Коллекция  					= Объект["ТочкиПоставки"];
	Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);
	
	
	Для Каждого Стр из Строки Цикл
		Если ЗначениеЗаполнено(Стр.СтруктураСети) Тогда
			ТекущиеДанные.СтруктураСети 		= Стр.СтруктураСети;
			ТекущиеДанные.ДанныеРасположения 	= ПолучитьСхемуПрисоединения(Стр.СтруктураСети);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","Договор"),"ДоговорыСоставныхУслуг","бестФормаВыбораДоговоров","ПараметрыДоговоров");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДоговорАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","Договор"),"ДоговорыСоставныхУслуг","бестФормаВыбораДоговоров","ПараметрыДоговоров");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЦеноваяКатегорияПриИзменении(Элемент)
	ТекущиеДанные 			= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УстановитьВидимостьТарифнойКатегории(ТекущиеДанные.ЦеноваяКатегория);
	НайденныеСтроки = НайтиСвязанныеТУНаселения(ТекущиеДанные);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ТекущиеДанные.ТарифнаяКатегория = НайденныеСтроки[0].ТарифнаяКатегория;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТарифнаяКатегорияПриИзменении(Элемент)
	ТекущиеДанные 			= Элементы.ТочкиУчета.ТекущиеДанные;
	НайденныеСтроки = НайтиСвязанныеТУНаселения(ТекущиеДанные);
	Для каждого Строка Из НайденныеСтроки Цикл
		Строка.ТарифнаяКатегория = ТекущиеДанные.ТарифнаяКатегория;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект, "ЮЛ");
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения);
	ИначеЕсли Поле.Имя = "ТочкиУчетаТехническиеСвойстваТУ" Тогда
		ОткрытьФормуТехническихСвойствТУ();
	ИначеЕсли Поле.Имя = "ТочкиУчетаНастройкиТарифа" Тогда
        ОткрытьФормуНастройкиТарифа();
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикиРежимаОграничения

&НаКлиенте
Процедура ГрафикиРежимаОграниченияПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеОбъемы = Элементы.ТЗГрафикиРежимаОграничения.ТекущиеДанные;
	Если ТекДанныеОбъемы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеОбъемы.IDСтроки = ТекДанные.IDСтроки;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЗГрафикиРежимаОграниченияУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.ТЗГрафикиРежимаОграничения.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиПоставок

&НаКлиенте
Процедура ТочкиПоставокТочкаПоставкиПриИзменении(Элемент)
	ТекДанные						= Элементы.ТочкиПоставокОбъектовРасчета.ТекущиеДанные;
	ЗаполнитьПараметрыТочекПоставки(ТекДанные.ТочкаПоставки);
	
	ТекДанныеОбъектРасчета = Элементы.ОбъектыРасчета.ТекущиеДанные;
	ЗаполнитьИтогиТочекПоставки(ТекДанныеОбъектРасчета.IDСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ТочкиПоставокОбъектовРасчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Выберите точку учета");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда		
		ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элемент.ТекущиеДанные.IDСтроки			= ТекущиеДанные.IDСтроки;
		энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(Элементы.ТочкиПоставки,"IDСтроки",ТекущиеДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиТочкаПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеТочкиПоставки 	 = ПолучитьСписокПодключенныхТП();
	Элемент.СписокВыбора.ЗагрузитьЗначения(ДоступныеТочкиПоставки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиТочкаПоставкиПриИзменении(Элемент)
	ТекущиеДанные		= Элементы.ТочкиУчета.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтруктураСети) Тогда
		СтруктураПоиска  			= Новый Структура("ТочкаПоставки", Элементы.ТочкиПоставки.ТекущиеДанные.ТочкаПоставки);
		Коллекция  					= Объект["ТочкиПоставки"];
		Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);
		
		
		Для Каждого Стр из Строки Цикл
			Если ЗначениеЗаполнено(Стр.СтруктураСети) Тогда
				ТекущиеДанные.СтруктураСети 		= Стр.СтруктураСети;
				ТекущиеДанные.ДанныеРасположения 	= ПолучитьСхемуПрисоединения(Стр.СтруктураСети);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокОбъектовРасчетаПослеУдаления(Элемент)
	ТекДанныеОбъектРасчета = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если Не ТекДанныеОбъектРасчета = Неопределено Тогда
		ЗаполнитьИтогиТочекПоставки(ТекДанныеОбъектРасчета.IDСтроки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиОплаты

&НаКлиенте
Процедура НастройкиОплатыБазаРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы.НастройкиОплаты.ТекущиеДанные;
	
	Если ТекДанные.ТипОплаты <> ПредопределенноеЗначение("Перечисление.бестВидыРасчета.Авансовый") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Базы расчета задаются только для авансового типа оплаты.");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПостоянныйРасходТУ

&НаКлиенте
Процедура ПостоянныйРасходТУТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		
		ЗаполнитьСписокТочек(ДанныеВыбора, ТекущиеДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУТочкаУчетаПриИзменении(Элемент)
	ТекущиеДанныеПостоянногоРасхода = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
	
	СтруктураПоиска  				= Новый Структура("IDСтрокиВладельца, НаименованиеТочки",
		ТекущиеДанныеПостоянногоРасхода.IDСтрокиОбъектРасчета, ТекущиеДанныеПостоянногоРасхода.ТочкаУчета);
	Строки  					= Объект.ТочкиУчета.НайтиСтроки(СтруктураПоиска);
	Если Строки.Количество() > 0 Тогда
		ТекущиеДанныеПостоянногоРасхода.IDСтрокиТочкиУчета = Строки[0].IDСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанныеОбъектРасчета = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекущиеДанныеОбъектРасчета = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Или Копирование Тогда
		ТекущиеДанные = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиОбъектРасчета = ТекущиеДанныеОбъектРасчета.IDСтроки;
    	ТекущиеДанные.IDСтроки = Новый УникальныйИдентификатор;
		ЗаполнитьТЧОбъемов(ТекущиеДанные.IDСтроки);	
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПостоянныйРасходОбъемы, Неопределено, ТекущиеДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУПриАктивизацииСтроки(Элемент)    
	ТекущиеДанные = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПостоянныйРасходОбъемы, Неопределено, ТекущиеДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	ТекущиеДанные = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбораПостоянныйРасход(ТекущиеДанные.IDСтрокиТочкиУчета);
	
	МассивПараметровВыбора = Новый Массив;
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", СписокУслуг);
	МассивПараметровВыбора.Добавить(ПараметрВыбора);
	Элементы.ПостоянныйРасходТУУслуга.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУПередУдалением(Элемент, Отказ) 
	ТекущиеДанные = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
	ТаблицыФормы	= Новый Массив;
	
	ТаблицыФормы.Добавить("ПостоянныйРасходОбъемы");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПостоянныйРасходОбъемы

&НаКлиенте
Процедура ПостоянныйРасходОбъемыПередУдалением(Элемент, Отказ)
	  Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить тип узла учета!");
		Возврат;		
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДоговору(ТекущиеДанные = Неопределено)
	ДанныеДоговора = ПолучитьДанныеДоговора();
	Если ДанныеДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеДоговора, "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");	
	Иначе
		Для Каждого Строка Из Объект.ТочкиУчета Цикл 
			ЗаполнитьЗначенияСвойств(Строка, ДанныеДоговора, "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуНастройкиТарифа() 
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	ПараметрыДоговор = Новый Структура("ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");
	ЗаполнитьЗначенияСвойств(ПараметрыДоговор, ТекущиеДанные);
	
	КлючЗаполнения = "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеНастройкиТарифа", ЭтотОбъект, Новый Структура("ТекущаяСтрока, КлючЗаполнения", Элементы.ТочкиУчета.ТекущаяСтрока, КлючЗаполнения));
	ОткрытьФорму("Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Форма.ФормаНастроекТарифа", ПараметрыДоговор,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаСервере
Процедура ПослеНастройкиТарифа(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	Данные = Результат.РезультатДанные; 
	ТекущиеДанные = Объект.ТочкиУчета.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Данные, ДополнительныеПараметры.КлючЗаполнения); 
	ЗаполнитьСтрокуНастройкиТарифа(Данные, ТекущиеДанные);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДоговора()
	Если Не ЗначениеЗаполнено(Объект.Договор) Или Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");
КонецФункции  

&НаСервере
Процедура ЗаполнитьСтрокуНастройкиТарифа(Данные, ТекущиеДанные)
	СоответствиеИмени = Новый Соответствие;
	СоответствиеИмени.Вставить("ТипТарифа", "Тип тарифа");
	Если ЗначениеЗаполнено(Данные.ЦеноваяКатегория) Тогда 
		СоответствиеИмени.Вставить("ЦеноваяКатегория", "Ценовая категория");
	ИначеЕсли ЗначениеЗаполнено(Данные.ТарифнаяСетка) Тогда
		СоответствиеИмени.Вставить("ТарифнаяСетка", "Тарифная сетка");	
	КонецЕсли;
	СоответствиеИмени.Вставить("ЗначениеСкидки", "Скидка");
	
	Текст = "";
	Для Каждого ЭлементСтруктуры Из Данные Цикл
		ТекстИмя = СоответствиеИмени.Получить(ЭлементСтруктуры.Ключ);
		Если ТекстИмя = Неопределено Тогда 
			Продолжить;	
		КонецЕсли;
		СтрокаВывод = ?(ЗначениеЗаполнено(ЭлементСтруктуры.Значение), ЭлементСтруктуры.Значение, "Нет");
		Текст = Текст + ТекстИмя + " = " + СтрокаВывод + Символы.ПС;
	КонецЦикла; 
	ТекущиеДанные.НастройкиТарифа = Текст;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресМКД(пМКД,ВидКИ)
	 Возврат УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(пМКД,ВидКИ);
КонецФункции

&НаСервере
Процедура ПолучитьДанныеТЧСубабонентов(ПараметрыПередачи)
	 бестРаботаСТочкамиУчетаНПСервер.ПолучитьДанныеДляФормыСубабонентов(ПараметрыПередачи, Объект);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслугДляВыбораЗаИсключениемВыбранных(IDСтрокиОбъекта, ТекУслуга)
	
	ИспользованныеУслуги = ИспользованныеУслугиГарантированныеОбъемы(IDСтрокиОбъекта, ТекУслуга);
	Возврат ПолучитьСписокУслугДляВыбора(IDСтрокиОбъекта, ИспользованныеУслуги);
	
КонецФункции

&НаСервере
Функция ИспользованныеУслугиГарантированныеОбъемы(IDСтрокиОбъекта, ТекУслуга)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтрокиОбъекта);
	НайденныеСтроки = Объект.ГарантированныеОбъемы.НайтиСтроки(ПараметрыОтбора);
	СписокУслуг = Новый Массив;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		Если Не Стр.Услуга = ТекУслуга Тогда
			СписокУслуг.Добавить(Стр.Услуга);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокУслугДляВыбора(IDСтрокиОбъекта, ИспользованныеУслуги = Неопределено)
	
	Если Не ЗначениеЗаполнено(ИспользованныеУслуги) Тогда
		ИспользованныеУслуги = Новый Массив;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтрокиВладельца", IDСтрокиОбъекта);
	НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	СписокУслуг = Новый СписокЗначений;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		Если ИспользованныеУслуги.Найти(Стр.Услуга) = Неопределено Тогда
			СписокУслуг.Добавить(Стр.Услуга);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)";
	
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ИспользованныеУслуги.Найти(ВыборкаДетальныеЗаписи.Услуга) = Неопределено Тогда
			СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаКлиенте
Процедура СуммаПоКварталу()
	ТекСтрока 				= Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если НЕ ТекСтрока		= Неопределено ТОгда
		ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
		ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
		ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
		ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
		//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
		
		ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
		ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
		ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтруктуруОбязательныхРеквизитов(Структура)
	Структура.Вставить("Район", 		Объект.Район);
	Структура.Вставить("Организация", 	Объект.Организация);	
	Структура.Вставить("Договор", 		Объект.Договор);
	Структура.Вставить("Контрагент", 	Объект.Контрагент);
КонецПроцедуры

&НаСервере
Процедура ПолучитьМассивТЧ(Структура)
	Структура.Вставить("ОбъектыРасчета",				Объект.ОбъектыРасчета);
	Структура.Вставить("Услуги",						Объект.ТочкиУчета);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Если ДополнительныеПараметры.ТЧ = "ОбъектыРасчета" Тогда
				УдалитьСвязанныеСОбъектомСтроки(ДополнительныеПараметры.IDСтроки);
			ИначеЕсли ДополнительныеПараметры.ТЧ = "ТочкиУчета" Тогда
				ТаблицыФормы	= Новый Массив;
				ТаблицыФормы.Добавить("ПоказанияПриборовУчета");
				ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
				ТаблицыФормы.Добавить("ШкалыПриборовУчета"); 
				ТаблицыФормы.Добавить("ШкалыИзмерителей");
				ТаблицыФормы.Добавить("НомераПломб");
				ТаблицыФормы.Добавить("Измерители"); 
				ТаблицыФормы.Добавить("ПостоянныйРасходТУ");

				энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.IDСтроки, Объект, ТаблицыФормы,"ТочкиУчета");
				
				
				ТаблицыФормы	= Новый Массив;
				ТаблицыФормы.Добавить("ПоставщикиСоставныхУслуг");
				ТаблицыФормы.Добавить("ТочкиПоставки");
				
				энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.IDСтроки, Объект, ТаблицыФормы);
				
			КонецЕсли;
			УдалитьСтроку(ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаСервере
Процедура ПроверкаДублированияНаименованийОбъектовРасчета(Отказ)
	МассивОбъектовРасчета = Новый ТаблицаЗначений;
	МассивОбъектовРасчета.Колонки.Добавить("НаименованиеОбъектаРасчета");
	МассивОбъектовРасчета.Колонки.Добавить("АдресОбъекта");
	Для каждого стр из Объект.ОбъектыРасчета Цикл
		Отбор		= Новый Структура("НаименованиеОбъектаРасчета, АдресОбъекта", стр.НаименованиеОбъектаРасчета, стр.АдресОбъекта);
		ИщемСтроки 	= МассивОбъектовРасчета.НайтиСтроки(ОТбор);
		Если ИщемСтроки.Количество()> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В ТЧ 'Объекты расчета' обнаружено несколько объектов с наименованием '" + стр.НаименованиеОбъектаРасчета + "' и адресом: " + стр.АдресОбъекта + "! Необходимо переименовать объект расчета");
			Отказ = Истина;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(МассивОбъектовРасчета.Добавить(), Отбор);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеКварталов() 
	
	ОбновитьСуммуПоКварталу();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКанальности) тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.ВидКанальности = ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер(НеПерезаполнятьОбъекты)
	
	Если Не Объект.Договор.ТипДоговора = ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.УправляющаяКомпания") Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ НеПерезаполнятьОбъекты Тогда
		Объект.ОбъектыРасчета.Очистить();
	КонецЕсли;
	Объект.ТочкиПоставки.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ПоставщикиСоставныхУслуг.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ШкалыУслуг.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ПриборыУзловУчета.Очистить();
	
	Результат 									= ПолучитьОбъектыРасчетаУправляющейКомпании(Объект.Дата, Объект.Организация, Объект.Район, Объект.Контрагент, Объект.Договор);
	Выборка  									= Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл		
		Если НеПерезаполнятьОбъекты Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("МКД", Выборка.МКД);
			НайденныеСтроки = Объект.ОбъектыРасчета.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НовСтр = НайденныеСтроки[0];
			Иначе
				НовСтр = Объект.ОбъектыРасчета.Добавить();
				НовСтр.МКД							= Выборка.МКД;
				НовСтр.ГруппаОбъектовРасчета		= Выборка.ГруппаПотребителейПоУмолчанию;
				НовСтр.НаименованиеОбъектаРасчета	= Выборка.МКД;
				НовСтр.Площадь						= Выборка.Площадь;
				НовСтр.IDСтроки						= Новый УникальныйИдентификатор;
			КонецЕсли;
		Иначе
			НовСтр = Объект.ОбъектыРасчета.Добавить();
			НовСтр.МКД							= Выборка.МКД;
			НовСтр.ГруппаОбъектовРасчета		= Выборка.ГруппаПотребителейПоУмолчанию;
			НовСтр.НаименованиеОбъектаРасчета	= Выборка.МКД;
			НовСтр.Площадь						= Выборка.Площадь;
			НовСтр.IDСтроки						= Новый УникальныйИдентификатор;
		КонецЕсли;
		
		НовСтр.ОбъектУК						= Истина;
		//ЗаполнитьУслугиМКД(НовСтр.МКД,НовСтр.IDСтроки);
		
		ЗаполнитьТочками(НовСтр.МКД, НовСтр.IDСтроки);
		
		энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация, Объект.Район,НовСтр.МКД,Ложь);
		
	КонецЦикла;
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьОписаниеОбъекта(СтруктураОбъекта)
	Запись  									= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	Запись.ЗаписатьНачалоОбъекта();
	
	Запись.ЗаписатьИмяСвойства("Наименование");
	Запись.ЗаписатьЗначение(СтруктураОбъекта.НаименованиеОбъектаРасчета);
	Запись.ЗаписатьИмяСвойства("НазначениеНП");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.НазначениеНП.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("ГруппаОбъектовРасчета");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.ГруппаОбъектовРасчета.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("КатегорияОбъекта");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.КатегорияОбъекта.УникальныйИдентификатор());			
	Запись.ЗаписатьИмяСвойства("МКД");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.МКД.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("Контролер");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.Контролер.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("Организация");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.Организация.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("АдресОбъекта");
	Запись.ЗаписатьЗначение(?(ЗначениеЗаполнено(СтруктураОбъекта.АдресОбъекта), СтруктураОбъекта.АдресОбъекта,""));
	Запись.ЗаписатьИмяСвойства("АдресОбъектаЗначение");
	Запись.ЗаписатьЗначение(?(ЗначениеЗаполнено(СтруктураОбъекта.АдресОбъектаЗначение), СтруктураОбъекта.АдресОбъектаЗначение,""));
	
	Запись.ЗаписатьКонецОбъекта();
	Возврат Запись.Закрыть();	
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСуммуПоКварталу()
	Для каждого ТекСтрока из Объект.ГарантированныеОбъемы Цикл
		ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
		ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
		ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
		ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
		//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
		
		ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
		ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
		ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроставитьДатыКомУчетаДляПУ(IDСтрокиТУ, ДатаКомУчета, ЭтоНачалоКомУчета)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтрокиТУ);
	НайденныеСтроки = Объект.ПриборыУзловУчета.НайтиСтроки(ПараметрыОтбора);
	Для каждого стр из НайденныеСтроки Цикл
		Если ЭтоНачалоКомУчета Тогда
			стр.НачалоДействияКоммерскогоУчета = ДатаКомУчета;
		Иначе
			стр.КонецДействияКоммерскогоУчета = ДатаКомУчета;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвязанныеСОбъектомСтроки(IDСтроки)
	ТаблицыФормы = Новый Массив;	
	ТаблицыФормы.Добавить("ГарантированныеОбъемы");
	ТаблицыФормы.Добавить("ТочкиПоставки");
	ТаблицыФормы.Добавить("ГрафикиРежимаОграничения");
	ТаблицыФормы.Добавить("ВеличинаБрони");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы);
	
	ТаблицыФормы = Новый Массив;	
	ТаблицыФормы.Добавить("ПостоянныйРасходТУ"); 
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы, "ОбъектРасчета");
	
	СтруктураПоиска  			= Новый Структура("IDСтрокиВладельца", IDСтроки);
	Коллекция  					= Объект["ТочкиУчета"];
	Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);
	
	
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ПоказанияПриборовУчета");
	Для Каждого УдаляемаяСтрока из Строки Цикл
		энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(УдаляемаяСтрока.IDСтроки, Объект, ТаблицыФормы,"ТочкиУчета");
	КонецЦикла;	
	
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ТочкиПоставки");
	Для Каждого УдаляемаяСтрока из Строки Цикл
		энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(УдаляемаяСтрока.IDСтроки, Объект, ТаблицыФормы);
	КонецЦикла;	
	ТаблицыФормы.Очистить();
	
	
	ТаблицыФормы.Добавить("ТочкиУчета");
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ОбъемыРаспределенияПотерь");
	ТаблицыФормыВторогоУровня.Добавить("ПоставщикиСоставныхУслуг");
	
	Для Каждого УдаляемаяСтрока из Строки Цикл
		энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(УдаляемаяСтрока.IDСтроки, Объект, ТаблицыФормы,"Владельца", ТаблицыФормыВторогоУровня);
		Коллекция.Удалить(УдаляемаяСтрока);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыТочекПоставки(ТекТочкаПоставки = Неопределено)
	
	Если ЗначениеЗаполнено(ТекТочкаПоставки) Тогда
		мТочек = Новый Массив;
		мТочек.Добавить(ТекТочкаПоставки);
	Иначе
		мТочек = Объект.ТочкиПоставки.Выгрузить().ВыгрузитьКолонку("ТочкаПоставки");
	КонецЕсли;
	
	РезультатЗапроса 				= РегистрыСведений.энргПараметрыТочекПоставки.АктуальныеПараметрыТочкиПоставкиПоСсылке(мТочек);
	
	СоответствиеКатегорийНапряжения = РегистрыСведений.энргКатегорииНадежностиТочекПоставок.ПолучитьКатегорииНапряжения(Объект.Дата, мТочек);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ТочкаПоставки", Выборка.ТочкаПоставки);
		мСтрок = Объект.ТочкиПоставки.НайтиСтроки(ПараметрыОтбора);
		Для каждого стр из мСтрок Цикл
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
			Если СоответствиеКатегорийНапряжения[Выборка.ТочкаПоставки] <> Неопределено Тогда
				Стр.КатегорияНадежности = СоответствиеКатегорийНапряжения[Выборка.ТочкаПоставки];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИтогиТочекПоставки(IDСтрокиОбъектРасчета)
	ПараметрыОтбора = Новый Структура("IDСтроки", IDСтрокиОбъектРасчета);
	мСтрок =Объект.ТочкиПоставки.НайтиСтроки(ПараметрыОтбора);
	ПрисоединеннаяМощностьИтог 	= 0;
	МаксимальнаяМощностьИтог 	= 0;
	Для каждого стр из мСтрок Цикл
		ПрисоединеннаяМощностьИтог 	= ПрисоединеннаяМощностьИтог + стр.ПрисоединеннаяМощность;
		МаксимальнаяМощностьИтог	= МаксимальнаяМощностьИтог + стр.МаксимальнаяМощность;
	КонецЦикла;
	
	Элементы.ИнформацияОМощности.Заголовок = бестРаботаСТочкамиУчетаНПКлиент.ПолучитьРасшифровкуМощности(МаксимальнаяМощностьИтог);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПодключенныхТП()
	МассивТочкиПоставки = энргОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(Объект.ТочкиПоставки.Выгрузить(,"ТочкаПоставки").ВыгрузитьКолонку("ТочкаПоставки"));
	Возврат МассивТочкиПоставки;
КонецФункции

&НаСервере
Функция ПолучитьСхемуПрисоединения(ТекСтруктураСети)
	Возврат Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ТекСтруктураСети);
КонецФункции

&НаКлиенте
Процедура ИнформацияОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);
	ТекущиеДанные.ДополнительнаяИнформация 		= бестРаботаСОбъектамиНПСервер.ЗаполнитьТекстИнформацииОбъекта(Результат);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьЭлементов()
	ЭтоЗаявка = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение");
	//Элементы.ГруппаНастройкиОплаты.Видимость 		= ЭтоЗаявка;
	Элементы.ГруппаДанныеЗаявки.Видимость 			= ЭтоЗаявка;
	Элементы.ЗаключениеДоговораДоТП.Видимость 		= ЭтоЗаявка;
	Элементы.ФормаСоздатьНаОсновании.Видимость 		= ЭтоЗаявка;

	Элементы.ДокументОснование.Видимость			= ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Если ЭтоЗаявка Тогда
		НастроитьВидимостьДанныхОТП();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа1", "Видимость", Объект.РассчитыватьПени);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПотребителей", "Видимость", Объект.РассчитыватьПени);
	Если Объект.РассчитыватьПени и НЕ Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.бестВариантыРасчетаПени.ОтСтавкиРефинансирования") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПотребителей", "Видимость", Ложь);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентПени", "Видимость", Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.бестВариантыРасчетаПени.ОтСуммы"));

	НезависимыйСбыт = бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаГруппа3", "Видимость", Не НезависимыйСбыт);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаНастройкиТарифа", "Видимость", НезависимыйСбыт);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДанныхОТП()
	Элементы.ЗаявкаНаТехнологическоеПрисоединение.Видимость = Объект.ЗаключениеДоговораДоТП;
	Элементы.ДоговорТехнологическогоПрисоединения.Видимость = Объект.ЗаключениеДоговораДоТП;
	Элементы.ТочкиПоставокОбъектовРасчета.Видимость 		= НЕ Объект.ЗаключениеДоговораДоТП;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДанныхОТПДляОбъектовРасчета()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаявкаНаТПДляОбъектаРасчета", "Видимость", ТочкаУчетаДоТП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорТПДляОбъектаРасчета", "Видимость", ТочкаУчетаДоТП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиПоставокОбъектовРасчета", "Видимость", Не ТочкаУчетаДоТП);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикиРежимаОграничения()
	Объект.ГрафикиРежимаОграничения.Сортировать("КодРежима");
	КодРежима = Неопределено;
	Для каждого стр из Объект.ГрафикиРежимаОграничения Цикл
		Если стр.КодРежима <> КодРежима Тогда
			НовСтр = ТЗГрафикиРежимаОграничения.Добавить();
		КонецЕсли;
		КодРежима = стр.КодРежима;
		ЗаполнитьЗначенияСвойств(НовСтр, стр); 
		НовСтр["Значение" + стр.Месяц] = стр.Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГрафикиРежимаОграничения()
	Объект.ГрафикиРежимаОграничения.Очистить();
	Для каждого стр Из ТЗГрафикиРежимаОграничения Цикл
		ТекущийЧас = 1;
		Пока ТекущийЧас <= 12 Цикл
			Если стр["Значение" + ТекущийЧас] <> 0 Тогда
				НовСтр 				= Объект.ГрафикиРежимаОграничения.Добавить();
				НовСтр.Услуга 		= стр.Услуга;
				НовСтр.КодРежима 	= стр.КодРежима;
				НовСтр.IDСтроки 	= стр.IDСтроки;
				НовСтр.Значение 	= стр["Значение" + ТекущийЧас];
				НовСтр.Месяц 		= ТекущийЧас;
			КонецЕсли;
			ТекущийЧас = ТекущийЧас + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьТарифнойКатегории(ЦК)
	ВидимостьКатегории = ЦК = ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.Население");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаТарифнаяКатегория", 
		"Видимость", ВидимостьКатегории);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте                                                                                                                                          	
Процедура УстановитьПараметрыВыбораУслуги()
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	МассивПараметровВыбора = Новый Массив;
	Если Элементы.ГарантированныеОбъемы.ТекущиеДанные = Неопределено Тогда
		ТекУслуга = Неопределено;
	Иначе
		ТекУслуга = Элементы.ГарантированныеОбъемы.ТекущиеДанные.Услуга;
	КонецЕсли;
	СписокУслуг = ПолучитьСписокУслугДляВыбораЗаИсключениемВыбранных(ТекДанные.IDСтроки, ТекУслуга);
	МассивУслуг = Новый ФиксированныйМассив(СписокУслуг.ВыгрузитьЗначения());
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", СписокУслуг);
	МассивПараметровВыбора.Добавить(ПараметрВыбора);
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.ИспользоватьРасчетРеактивнойЭнергии", Ложь);
	МассивПараметровВыбора.Добавить(ПараметрВыбора);
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.СоставнаяУслуга", Ложь);
	МассивПараметровВыбора.Добавить(ПараметрВыбора);
	Элементы.ГарантированныеОбъемыУслуга.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСвязанныеТУНаселения(ТекущиеДанные)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтрокиВладельца", ТекущиеДанные.IDСтрокиВладельца);
	ПараметрыОтбора.Вставить("Услуга", ТекущиеДанные.Услуга);
	ПараметрыОтбора.Вставить("ЦеноваяКатегория", ПредопределенноеЗначение("Перечисление.бестЦеновыеКатегории.Население"));
	
	Возврат Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеДанных(Отказ)
	СтруктураОбязательныхРеквизитов = Новый Структура;
	ПолучитьСтруктуруОбязательныхРеквизитов(СтруктураОбязательныхРеквизитов);
	СтруктураОбязательныхТЧ = Новый Структура;
	ПолучитьМассивТЧ(СтруктураОбязательныхТЧ);
	
	Для каждого стр из СтруктураОбязательныхРеквизитов Цикл
		Если Не ЗначениеЗаполнено(стр.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение реквизита '" + стр.Ключ +"'");
			Отказ = Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Для каждого стр из СтруктураОбязательныхТЧ Цикл
		Если стр.Значение.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена ТЧ '" + стр.Ключ +"'");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДатыИлиДоговора()
	
	ЗаполнитьДанныеДоговораСервер(Ложь);
	ЗаполнитьПериодНачисленияСервер();
	//--СДЕЛАНО ВРЕМЕННО
	Если ПолучитьТипДоговора() = ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.УправляющаяКомпания") Тогда
		
		Для Каждого ТекСтрока Из Объект.ТочкиУчета Цикл
			ТекущиеДанные 							= ТекСтрока; 
			
			энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);				
			ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга); 				
			// энргРаботаСПоставщиками {
			бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
			// энргРаботаСПоставщиками } 				
			
			// энргРаботаСоСпособамиРасчетаНорматива {
			бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
			// энргРаботаСоСпособамиРасчетаНорматива } 
			
			СоответствиеЗначенияПоУмолчанию = Новый Соответствие;
			СоответствиеЗначенияПоУмолчанию.Вставить("Договор", Объект.Договор);
			бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги,"ДоговорыСоставныхУслуг",СоответствиеЗначенияПоУмолчанию);
			
			Если ИспользоватьШкалыПриборовУчета Тогда
				СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
				бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
			КонецЕсли;
			
		КонецЦикла;	
		ЗаполнитьПоставщика();
		
		УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
		УстановитьУсловноеОФормлениеФормыКлиент("Договор","ПараметрыДоговоров");
	КонецЕсли;
	//--СДЕЛАНО ВРЕМЕННО
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокТочек(ДанныеВыбора, IDСтроки)
	СтруктураПоиска  			= Новый Структура("IDСтрокиВладельца",IDСтроки);
	Строки  					= Объект.ТочкиУчета.НайтиСтроки(СтруктураПоиска);	
	Для Каждого Стр из Строки Цикл 
		ДанныеВыбора.Добавить(Стр.НаименованиеТочки);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслугДляВыбораПостоянныйРасход(IDСтрокиТочкиУчета)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтрокиТочкиУчета);
	НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	СписокУслуг = Новый Массив;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		СписокУслуг.Добавить(Стр.Услуга);
	КонецЦикла;
		
	Возврат Справочники.энргВидыУслуг.ПолучитьПростыеУслуги(СписокУслуг);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТЧОбъемов(IDСтроки)
	Месяц = 1;
	Пока Месяц <= 12 Цикл
		НоваяСтрока 			= Объект.ПостоянныйРасходОбъемы.Добавить();
		НоваяСтрока.Месяц 		= Месяц;
		НоваяСтрока.IDСтроки 	= IDСтроки;
		Месяц = Месяц + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТУВПостоянномРасходе() 
	Для каждого СтрокаПостоянногоРасхода из Объект.ПостоянныйРасходТУ Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("IDСтроки", СтрокаПостоянногоРасхода.IDСтрокиТочкиУчета);
		НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаПостоянногоРасхода.ТочкаУчета = НайденныеСтроки[0].НаименованиеТочки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#Область ЗАПОЛНИТЬ_УК

Процедура ЗаполнитьТочками(МКД, IDСтрокиВладельца)
	
	РезультатТП 								= Неопределено;
	Результат 									= энргРаботаСприборамиУчетаСервер.ПриборыВсехТочекУчетаМКД(Объект.Дата, Объект.Организация, Объект.Район, МКД, РезультатТП);
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	//ПоставщикПоУмолчанию	= ЭтаФорма.ПараметрыПоставщиков.ПоставщикПоУмолчанию;
	Пока Выборка.следующий() цикл		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда 			
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
			СтрокаТочкиУчета.IDСтрокиВладельца	= IDСтрокиВладельца;
			//СтрокаТочкиУчета.Поставщик			= ПоставщикПоУмолчанию;
			СтрокаТочкиУчета.Расположение		= Выборка.ТочкаУчета.Расположение;
			СтрокаТочкиУчета.Головная			= Выборка.ТочкаУчета.Головная;;
			СтрокаТочкиУчета.ОбъектУК			= Истина;
			Если ЗначениеЗаполнено( Выборка.УзелУчета) Тогда
				СтрокаТочкиУчета.ТипУзлаУчета		= Выборка.УзелУчета.ТипУзлаУчета;
			КонецЕсли;
						
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) и НЕ ТекПрибор = Выборка.ПриборУчета Тогда 			
			
			СтрокаПриборов  					= Объект.ПриборыУзловУчета.Добавить();
			IDСтрокиШкалы						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаПриборов, Выборка);
			СтрокаПриборов.IDСтроки 			= IDСтрокиТочки;
			СтрокаПриборов.IDСтрокиШкалы 		= IDСтрокиШкалы;		
			
			ЗаполнитьДанныеПрибора(СтрокаПриборов,Выборка.ПриборУчета,МКД);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда //НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиТарифнаяЗона				= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.IDСтрокиТарифнаяЗона 	= IDСтрокиТарифнаяЗона;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидПараметра 			= Выборка.ВидПараметра;			
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтрокиТочкиУчета		= IDСтрокиТочки;
			СтрокаПоказаний.IDСтроки 				= IDСтрокиТарифнаяЗона;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли; 		
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекПрибор 								= Выборка.ПриборУчета;
	КонецЦикла;
	
	ВыборкаТП = РезультатТП.Выбрать();
	Пока ВыборкаТП.Следующий() Цикл
		СтрокаТП = Объект.ТочкиПоставки.Добавить();
		СтрокаТП.IDСтроки = IDСтрокиВладельца;
		СтрокаТП.ОбъектУК = Истина;
		ЗаполнитьЗначенияСвойств(СтрокаТП, ВыборкаТП);
	КонецЦикла;
	
	ЗаполнитьПараметрыТочекПоставки();
	ЗаполнитьТекстовыеПоля();
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПрибора(ТекСтрока, ПриборУчета, МКД)
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета.Код КАК ЗаводскойНомер,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета.ТипПрибораУчета КАК ТипПрибораУчета,
	|	энргДатыПоверкиПрибораУчетаСрезПоследних.ПериодРегистрации КАК ДатаВыпуска,
	|	энргДатыПоверкиПрибораУчетаСрезПоследних.ДатаПоверки КАК ДатаПоверкиСчетчика,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.НомерПломбы КАК НомерПломбы,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.Период КАК ДатаУстановкиПломбы,
	|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.КонецПериодаКоммерскогоУчета КАК КонецДействияКоммерскогоУчета
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПриборУчета = &ПриборУчета) КАК энргСостояниеПриборовУзловУчетаМКДСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДатыПоверкиПрибораУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И КлючПомещения = &МКД
	|					И ПриборУчета = &ПриборУчета) КАК энргДатыПоверкиПрибораУчетаСрезПоследних
	|		ПО энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета = энргДатыПоверкиПрибораУчетаСрезПоследних.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНомерПломбПриборовУчетаМКД.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &МКД
	|					И ПриборУчета = &ПриборУчета) КАК энргНомерПломбПриборовУчетаМКДСрезПоследних
	|		ПО энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета = энргНомерПломбПриборовУчетаМКДСрезПоследних.ПриборУчета,
	|	РегистрСведений.энргДопускПриборовУчетаККоммерческомуУчетуМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПриборУчета = &ПриборУчета) КАК энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Запрос.УстановитьПараметр("МКД"				, МКД);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("Период"			, Новый Граница(Объект.Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район"			, Объект.Район);
	Запрос.УстановитьПараметр("ПриборУчета"		, ПриборУчета);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	ВыборкаТочкиУчета	= РезультатЗапроса.Выбрать();
	Пока  ВыборкаТочкиУчета.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТекСтрока, ВыборкаТочкиУчета);
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьТипДоговора()
	Возврат Объект.Договор.ТипДоговора;
КонецФункции

&НаСервере
Процедура ЗаполнитьПоставщика()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПоставщикиУслугМКДСрезПоследних.МКД КАК МКД,
		|	энргПоставщикиУслугМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргПоставщикиУслугМКДСрезПоследних.Услуга КАК Услуга,
		|	энргПоставщикиУслугМКДСрезПоследних.ЧастьСоставной КАК ЧастьСоставной,
		|	энргПоставщикиУслугМКДСрезПоследних.Поставщик КАК Поставщик
		|ИЗ
		|	РегистрСведений.энргПоставщикиУслугМКД.СрезПоследних(&Дата, МКД в (&МКД)) КАК энргПоставщикиУслугМКДСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("МКД"	, Объект.ОбъектыРасчета.Выгрузить(,"МКД"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица			 = РезультатЗапроса.Выгрузить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	Для каждого стр из Объект.ПоставщикиСоставныхУслуг Цикл
		СтрокиТУ = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки",стр.IDСтроки));
		Если СтрокиТУ.Количество() > 0 Тогда
			СтрокиПоставщиков = Таблица.НайтиСтроки(Новый Структура("ТочкаУчета,Услуга", СтрокиТУ[0].ТочкаУчета,стр.ЧастьСоставнойУслуги));
			Если СтрокиПоставщиков.Количество() > 0 Тогда
				стр.Поставщик = СтрокиПоставщиков[0].Поставщик;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	СтрокиНеСоставныхУслуг = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("ЭтоСоставнаяУслуга",Ложь));
	Для каждого стр из СтрокиНеСоставныхУслуг Цикл
		СтрокиПоставщиков = Таблица.НайтиСтроки(Новый Структура("ТочкаУчета,Услуга", стр.ТочкаУчета,стр.Услуга));
		Если СтрокиПоставщиков.Количество() > 0 Тогда
			стр.Поставщик = СтрокиПоставщиков[0].Поставщик;
		КонецЕсли;
	КонецЦикла;
	//СтрокиПоставщиков = Объект.ПоставщикиСоставныхУслуг.НайтиСтроки(Новый Структура("IDСтроки",ТекСтрока.IDСтроки));
	//Для Каждого СтрокаПоставщика Из СтрокиПоставщиков Цикл
	//	МассивСтрок =  Таблица.НайтиСтроки(Новый Структура("ТочкаУчета,",ТекСтрока.IDСтроки));
	//	
	//КонецЦикла;
	//
	//Поставщик = Константы.энргПоставщикПоУмолчанию.Получить();
	//Для Каждого СтрокаПоставщика Из Объект.ПоставщикиСоставныхУслуг Цикл
	//	СтрокаПоставщика.Поставщик = Поставщик;		
	//КонецЦикла;
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область РАБОТА_С_УЗЛАМИ

#Область ДОБАВЛЕНИЕ_ПУ_К_УЗЛАМ

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи, IDСтроки, ТипУзлаУчета, НачалоДействияКоммерскогоУчета, КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

#КонецОбласти

#Область ПЕРЕОПРЕДЕЛЕННЫЕ_ПРОЦЕДУРЫ

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область НОВАЯ_РАБОТА_С_УЗЛАМИ

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПараметрыОбновления) Экспорт 
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ);
	ТекСтрока = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", ПараметрыОбновления.IDСтроки));
	
	МассивИзмерители = ПараметрыОбновления.Результат.Измерители;
	Для каждого Структура Из МассивИзмерители Цикл
		Если Не Структура.ВспомогательноеОборудование Тогда
			ПриборУчета = Структура.ПриборУчета;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	ТекСтрока[0].ПриборУчета = ПриборУчета;
	ТекСтрока[0].КоэффициентПУ = ПараметрыОбновления.Результат.КоэффициентПУ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()	
	Для Каждого ТекСтрока ИЗ Объект.ТочкиУчета Цикл
		ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
		ТекСтрока.ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(ТекСтрока, Объект.Потери,"ЮЛ");
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстДанныеРасположения(ТекСтрока);
		ТекСтрока.ДанныеРасположения = Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ТекСтрока.СтруктураСети);
		
		ДанныеТарифа = Новый Структура("ТипТарифа, ТарифнаяСетка, ЦеноваяКатегория, ЗначениеСкидки"); 
		ЗаполнитьЗначенияСвойств(ДанныеТарифа, ТекСтрока);
		ЗаполнитьСтрокуНастройкиТарифа(ДанныеТарифа, ТекСтрока);
	КонецЦикла;	
	
	Для Каждого ТекСтрока ИЗ Объект.ОбъектыРасчета Цикл
		ТекСтрока.ДополнительнаяИнформация = бестРаботаСОбъектамиНПСервер.ЗаполнитьТекстИнформацииОбъекта(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция, СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(бестРаботаСТочкамиУчетаНПСервер.ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= бестРаботаСТочкамиУчетаНПСервер.СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#Область РаботаСТехническимиСвойствамиТУ

&НаКлиенте
Процедура ОткрытьФормуТехническихСвойствТУ()
	ТекущиеДанные		= Элементы.ТочкиУчета.ТекущиеДанные;
	КлючиДанных			= ПолучитьКлючиДанныхТехСвойств();
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ТехническиеСвойстваТУЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные, КлючиДанных", ТекущиеДанные, КлючиДанных));
	ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаТехническиеСвойстваТУ", ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


/////////////////////////////////////////////
// Получение входных данных

&НаКлиенте
Функция ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных)
	ТехническиеСвойстваТУ 	= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);	
	ЗаполнитьЗначенияСвойств(ТехническиеСвойстваТУ, ТекущиеДанные, КлючиДанных.Реквизиты);
		
	ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, ТекущиеДанные.IDСтроки);
	ТехническиеСвойстваТУ.Вставить("ВызывающаяПодсистема", "ЮЛ");
	ТехническиеСвойстваТУ.Вставить("ИспользоватьТарифныеЗоны", ИспользоватьТарифныеЗоны);
	
	Возврат Новый Структура("ВходныеПараметры", ТехническиеСвойстваТУ);
КонецФункции

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, IDСтроки)
	ИдентификаторФормы 				= ЭтаФорма.УникальныйИдентификатор;
	Если ИспользоватьТарифныеЗоны Тогда
		Потери = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки), "ТарифнаяЗона, ФиксированныйОбъемПотерь, ПроцентПотерь");
		Шкалы = Объект.ШкалыПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки), "ВидДифференцированности");
		ТаблицаПотерь = Обработки.энргОперацияУзламиУчета.ПолучитьТаблицуПотерь(Шкалы, Потери);
	Иначе
		ТаблицаПотерь = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки));
	КонецЕсли;
	ТехническиеСвойстваТУ.Потери = ПоместитьВоВременноеХранилище(ТаблицаПотерь, ИдентификаторФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючиДанныхТехСвойств()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияТехническихСвойствТУ("ЮЛ");
КонецФункции


/////////////////////////////////////////////
// Обработка возврата результата

&НаКлиенте
Процедура ТехническиеСвойстваТУЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	КлючиДанных 	= ДополнительныеПараметры.КлючиДанных;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, КлючиДанных.Реквизиты);
	ТехническиеСвойстваТУ = "";
	ЗаполнитьПотериИзРезультата(ТекущиеДанные.IDСтроки, Результат, ТехническиеСвойстваТУ);
	ТекущиеДанные.ТехническиеСвойстваТУ 		= ТехническиеСвойстваТУ;//энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстТехническихСвойств(Результат, Результат.Потери);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПотериИзРезультата(IDСтроки, Результат, ТехническиеСвойстваТУ)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери, Новый Структура("IDСтроки", IDСтроки));
	
	ПотериРезультат = ПолучитьИзВременногоХранилища(Результат.Потери);
	Для каждого Строка Из ПотериРезультат Цикл
		НоваяСтрока = Объект.Потери.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.IDСтроки = IDСтроки;
	КонецЦикла;	
	
	ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(Результат, ПотериРезультат,"ЮЛ");	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти