
#Область ПрограммныйИнтерфейс

#Область РегламентноеЗадание

// Процедура - Загрузить показания из пирамиды
//
Процедура ЗагрузитьПоказанияИзПирамиды() Экспорт
	ОбработкаЗагрузки 	= ОбъектЗагрузкиПоказанийИзПирамиды();
	КаталогФайлов		= ДанныеНастроек();
	
	Если ПустаяСтрока(КаталогФайлов) Тогда
		Возврат;
	КонецЕсли;	
	
	ФайлыДляЗагрузки	= ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогФайлов, ПрефиксЗагруженногоФайла());
	
	Если ФайлыДляЗагрузки.Количество() = 0 Тогда
		ЗафиксироватьОтсутствиеФайлаЗагрузкиИзПирамиды("");
		Возврат;
	КонецЕсли;
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	Для Каждого ТекФайл Из ФайлыДляЗагрузки Цикл				
		АдресХранилища = УпаковатьВоВременноеХранилище(ТекФайл.ПолноеИмя, УникальныйИдентификатор);
		
		НачатьТранзакцию(); 		
		Попытка
			ОбъектРегистрацииПоказаний = ИнициализироватьОбъектРегистрацииПоказанийИзВнешнихИсточников(ТекФайл);		
			ОбъектРегистрацииПоказаний.Записать(РежимЗаписиДокумента.Запись);			
			ОбработкаЗагрузки.ЗагрузитьПоказанияИзРегламентногоЗадания(ОбъектРегистрацииПоказаний, АдресХранилища);
			
			НовоеИмяФайла 								= УстановитьПрефиксЗагруженногоФайла(ТекФайл);			
			ОбъектРегистрацииПоказаний.ФайлДляЧтения 	= НовоеИмяФайла;
			ОбъектРегистрацииПоказаний.Записать(РежимЗаписиДокумента.Запись);
			
			ЗафиксироватьТранзакцию();		
		Исключение
			ОтменитьТранзакцию();
			
			ОписаниеОшибки 	= ИнформацияОбОшибке();
			ДопИнформация 	= "Путь к файлу: " + ТекФайл.ПолноеИмя;
			ЗафиксироватьОшибкуЗаписиОбъектРегистрацииПоказанийИзВнешнихИсточников(ОписаниеОшибки, ДопИнформация);
		КонецПопытки;
			
	КонецЦикла;
КонецПроцедуры
	
#КонецОбласти


#Область РаботаСНастройкамиОбмена

// Функция - Объект загрузки показаний из пирамиды
// 
// Возвращаемое значение:
//  Строка - описание параметров функции/процедуры.
//
Функция ОбъектЗагрузкиПоказанийИзПирамиды() Экспорт 
	Возврат Обработки.энргЗагрузкаПоказанийПирамида.Создать();
КонецФункции

// Функция - Объект настроек обмена
// 
// Возвращаемое значение:
//  Строка - описание параметров функции/процедуры.
//
Функция ОбъектНастроекОбмена() Экспорт 
	Возврат Константы.энргНастройкаИнтеграцииСПирамидой;
КонецФункции

// Функция - Данные настроек
// 
// Возвращаемое значение:
//  Строка - описание параметров функции/процедуры.
//
Функция ДанныеНастроек() Экспорт 
	ОбъектНастроекОбмена 	= ОбъектНастроекОбмена();
	ДанныеНастроек 			= ОбъектНастроекОбмена.Получить();
	
	Возврат ДанныеНастроек.Получить();
КонецФункции

#КонецОбласти

#Область РаботаСФайлами

// Функция - Префикс загруженного файла
// 
// Возвращаемое значение:
//  Строка- описание параметров функции/процедуры.
//
Функция ПрефиксЗагруженногоФайла() Экспорт 
	Возврат "Загружен_";
КонецФункции

// Функция - Получить файлы для загрузки из каталога
//
// Параметры:
//  КаталогПоиска			 - Строка- описание параметров функции/процедуры. 
//  ПрефиксЗагруженногоФайла - 	Строка- описание параметров функции/процедуры. 
//  Маска					 - Строка- описание параметров функции/процедуры.
// 
// Возвращаемое значение:
//  Строка- описание параметров функции/процедуры. 
//
Функция ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогПоиска, ПрефиксЗагруженногоФайла, Маска = "*.xml") Экспорт 
	Ответ = Новый Массив;

	НайденныеФайлы = НайтиФайлы(КаталогПоиска, Маска);
	Для Каждого ТекФайл Из НайденныеФайлы Цикл
		Если СтрНайти(ТекФайл.ИмяБезРасширения, ПрефиксЗагруженногоФайла) > 0 Тогда
			Продолжить;	
		КонецЕсли; 
		
		Ответ.Добавить(ТекФайл);
	КонецЦикла; 	
	
	Возврат Ответ;
КонецФункции

// Функция - Получить имя файла после загрузки
//
// Параметры:
//  ПолныйПуть	 - Строка- описание параметров функции/процедуры. 
// 
// Возвращаемое значение:
//  Строка- описание параметров функции/процедуры.
//
Функция ПолучитьИмяФайлаПослеЗагрузки(ПолныйПуть) Экспорт 
	Результат	= ПолныйПуть;
	
	Файл 		= Новый Файл(ПолныйПуть);	
	Если НЕ Файл.Существует() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Результат			= СтрЗаменить(ПолныйПуть, "\" + ИмяБезРасширения, "\" + ПрефиксЗагруженногоФайла() + ИмяБезРасширения);
	Возврат Результат;	
КонецФункции

// Функция - Установить префикс загруженного файла
//
// Параметры:
//  ТекФайл	 - Строка- описание параметров функции/процедуры. 
// 
// Возвращаемое значение:
//  Строка- описание параметров функции/процедуры.
//
Функция УстановитьПрефиксЗагруженногоФайла(ТекФайл) Экспорт
	НовоеИмяФайла = ПолучитьИмяФайлаПослеЗагрузки(ТекФайл.ПолноеИмя);
	ПереместитьФайл(ТекФайл.ПолноеИмя, НовоеИмяФайла);
	
	Возврат НовоеИмяФайла;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Имя задания для интеграции с пирамидой
// 
// Возвращаемое значение:
// Строка- описание параметров функции/процедуры. 
//
Функция ИмяЗаданияДляИнтеграцииСПирамидой() Экспорт 
	Возврат Метаданные.РегламентныеЗадания.энргЗагрузитьПоказанияИзПирамида.Синоним;
КонецФункции

// Процедура - Зафиксировать отсутствие файла загрузки из пирамиды
//
// Параметры:
//  ИсточникПоступления	 - Строка- описание параметров функции/процедуры. 
//
Процедура ЗафиксироватьОтсутствиеФайлаЗагрузкиИзПирамиды(ИсточникПоступления) Экспорт
	ИмяЗадания 				= ИмяЗаданияДляИнтеграцииСПирамидой();	
	Комментарий 			= "Не найден файл в каталоге для загрузки";
	ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
КонецПроцедуры

// Процедура - Зафиксировать ошибку записи объект регистрации показаний из внешних источников
//
// Параметры:
//  ОписаниеОшибки	 - 	Строка- описание параметров функции/процедуры. 
//  ДопИнформация	 - 	Строка- описание параметров функции/процедуры.
//
Процедура ЗафиксироватьОшибкуЗаписиОбъектРегистрацииПоказанийИзВнешнихИсточников(ОписаниеОшибки, ДопИнформация) Экспорт
	ИмяЗадания 				= ИмяЗаданияДляИнтеграцииСПирамидой();	
	Комментарий 			= "Не удалось загрузить файл с показаниями. " + ДопИнформация + " по причине: " + ПодробноеПредставлениеОшибки(ОписаниеОшибки);
	ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьОбъектРегистрацииПоказанийИзВнешнихИсточников(ФайлДанных)
	ДокументОснование 					= Документы.энргЗагрузкаПоказанийИзВнешнихИсточников.СоздатьДокумент();
	ДокументОснование.Дата 				= ТекущаяДата();
	ДокументОснование.Организация		= Справочники.Организации.НашаОрганизация;
	ДокументОснование.ФайлДляЧтения 	= ФайлДанных.ПолноеИмя;	
	ДокументОснование.ИсточникПоказаний	= Справочники.энргИсточникиПоказаний.ЛичныйКабинет;
	ДокументОснование.ПериодНачисления	= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДокументОснование.Дата, ДокументОснование.Организация, Справочники.энргЗоныОтвественности.ПустаяСсылка());	
	
	Возврат ДокументОснование;
КонецФункции 

Функция УпаковатьВоВременноеХранилище(ФайлДляЧтения, УникальныйИдентификатор)
	Файл 	= Новый ДвоичныеДанные(ФайлДляЧтения);
	Адрес 	= ПоместитьВоВременноеХранилище(Файл, УникальныйИдентификатор);
	
	Возврат Адрес;
КонецФункции

#КонецОбласти