#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;	
		
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 	= Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект); 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЕстьПринятыеПоказанияДатойПозже() Тогда  
		Отказ = Истина;
		Комментарий = НСтр("ru = 'В системе зарегистрированы показания со статусом ""Приняты"" датой позже текущего документа'");
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.энргИстечениеДатыПоверкиПУ.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьПринятыеПоказанияДатойПозже()
	ПараметрыПроверки = Новый Структура("Дата, Организация, Район, КлючПомещения, Ссылка");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект); 
	
	ТЗ = ТочкиУчета.Выгрузить(, "ПриборУчета");	
	Возврат энргРаботаСПоказаниямиПриборовУчетаСервер.ЕстьПринятыеПоказанияДатойПозже(ТЗ.ВыгрузитьКолонку("ПриборУчета"), ПараметрыПроверки);
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли