#Область ОбработчикиСобытий

&НаКлиенте
Процедура ЗаполнитьПериод(Команда)
 	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    
    Диалог.Период.ДатаНачала    = ДатаНач;
    Диалог.Период.ДатаОкончания = ДатаКон;
	Диалог.Показать(ОписаниеОповещенияВыборПериода); 	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;	
	ДатаНач = ИнтервалУстановлен.ДатаНачала;
	ДатаКон = ИнтервалУстановлен.ДатаОкончания;
	
	УстановитьПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	УстановитьПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	УстановитьПараметры();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметры()
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНач",	ДатаНач);
	Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКон",	КонецДня(ДатаКон));
КонецПроцедуры;






#КонецОбласти
