#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить данные по отборам
//
// Параметры:
//  Отборы	 - Структура - Поля отбора
// 
// Возвращаемое значение:
// Результат запроса - 
//
Функция ПолучитьДанныеПоОтборам(Отборы) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТарифныеКатегорииВидовБлагоустройств.ТарифнаяКатегория КАК ТарифнаяКатегория,
		|	энргТарифныеКатегорииВидовБлагоустройств.ВидБлагоустройства КАК ВидБлагоустройства
		|ИЗ
		|	РегистрСведений.энргТарифныеКатегорииВидовБлагоустройств КАК энргТарифныеКатегорииВидовБлагоустройств
		|ГДЕ" + ЗаполнитьУсловияОтбора("энргТарифныеКатегорииВидовБлагоустройств", Отборы);
		
	
	Для Каждого ТекУсловие из Отборы Цикл
		Запрос.УстановитьПараметр(ТекУсловие.Ключ, ТекУсловие.Значение)
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьУсловияОтбора(ИмяТаблицы, Отборы)
		
	ТекстУсловия = "";
	Для Каждого ТекУсловие из Отборы Цикл
		ТекстУсловия = ТекстУсловия + Символы.ПС + ?(ТекстУсловия = "", "", "И ") + ИмяТаблицы + "." + ТекУсловие.Ключ + " = &" + ТекУсловие.Ключ;
	КонецЦикла;
	
	Если  ТекстУсловия = "" Тогда
		ТекстУсловия = Символы.ПС + "ИСТИНА";
	КонецЕсли;
	
	Возврат ТекстУсловия;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
