#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли; 

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	//ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаСервере
Процедура РаспределитьПоУслугамНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоУслугам(Команда)
	РаспределитьПоУслугамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

#КонецОбласти

#Область СобытияКомандФормы
&НаКлиенте
Процедура ЗаполнитьСудебнуюЗадолженность(Команда)
	ОписОпов = Новый ОписаниеОповещения("ДобавитьСтрокиСудебнойЗадолженности", ЭтаФорма);
	ПарамФормы = Новый Структура("Организация, Район", Объект.Организация, Объект.Район);
	ОткрытьФорму("Документ.бестПлатежноеПоручениеВходящееЮрЛица.Форма.ФормаВыбораДоговора", ПарамФормы, ЭтаФорма,,,, ОписОпов);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокиСудебнойЗадолженности(НовыеСтроки, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(НовыеСтроки) Тогда
		Для каждого СтрокаДолг Из НовыеСтроки Цикл
		
			СтрокаТЗ = Объект.ОплатаСудебнойЗадолженности.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаДолг);
		
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти