#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидОтветственностиСтрока = "Солидарно";
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	Результат = Задачи.энргЗадачаПИД.ПолучитьЗадолженностьИОплаты(Задача, Перерасчет);
	
	ПакетКорректировка = Результат[Результат.Количество()-2];
	Если Не ПакетКорректировка.Пустой() Тогда
		ЗначениеВРеквизитФормы(ПакетКорректировка.Выгрузить(), "Корректировака");
	КонецЕсли;
	
	Выборка = ПакетКорректировка.Выбрать();
	СуммаДолгаНачисленная	= 0;
	СуммаПениНачисленная	= 0;
	
	Контрагент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Абонент, "ФизЛицо");
	Пока Выборка.Следующий() Цикл
	
		СтрокаОтветчик = Ответчики.Добавить();
		СтрокаОтветчик.Основной 		= Истина;
		СтрокаОтветчик.Контрагент		= Контрагент; 
		СтрокаОтветчик.ПериодНачисления = Выборка.ПериодНачисления;
		СтрокаОтветчик.ОсновнойДолг		= Выборка.СуммаОстаток;
		СтрокаОтветчик.Пеня 			= Выборка.Пеня;
		
		СуммаДолгаНачисленная = СуммаДолгаНачисленная + Выборка.СуммаОстаток;
		СуммаПениНачисленная  = СуммаПениНачисленная  + Выборка.Пеня;
	КонецЦикла;
	
	
	ПериодНачисленияПерерасчета = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ТекущаяДата(), Организация, Район);
	
	СтрокаОтветчик = Ответчики.Добавить();
	СтрокаОтветчик.Основной			= Истина;
	СтрокаОтветчик.Контрагент 		= Контрагент;
	СтрокаОтветчик.ПериодНачисления = ПериодНачисленияПерерасчета;
	СтрокаОтветчик.ОсновнойДолг 	= ?(ОсновнойДолг < СуммаДолгаНачисленная, 	0, ОсновнойДолг-СуммаДолгаНачисленная);
	СтрокаОтветчик.Пеня 			= ?(Пеня < СуммаПениНачисленная, 			0, Пеня-СуммаПениНачисленная);
	СтрокаОтветчик.Госпошлина 		= Госпошлина;
	
	ПакетОплаты = Результат[Результат.Количество()-1];
	Если Не ПакетОплаты.Пустой() Тогда
		ЗначениеВРеквизитФормы(ПакетОплаты.Выгрузить(), "Оплаты");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

 &НаКлиенте
Процедура ОсновнойДолгПриИзменении(Элемент)
	ПеренестиИзмененияСуммыДолга("ОсновнойДолг", "ОсновнойДолг");
КонецПроцедуры

&НаКлиенте
Процедура ПеняПриИзменении(Элемент)
	ПеренестиИзмененияСуммыДолга("Пеня", "Пеня");
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеПриИзменении(Элемент)
	ПеренестиИзмененияСуммыДолга("Прочие", "Прочие");
КонецПроцедуры

&НаКлиенте
Процедура ГоспошлинаПриИзменении(Элемент)
	ПеренестиИзмененияСуммыДолга("Госпошлина", "Госпошлина");
КонецПроцедуры

&НаКлиенте
Процедура ВидОтветственностиСтрокаПриИзменении(Элемент)
	ВидОтветственности = ВидОтветственностиСтрока = "Субсидиарно";
	УстановитьВидимость();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплаты

&НаКлиенте
Процедура ОплатыФлагПриИзменении(Элемент)
	ТекСтрока = Элементы.Оплаты.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ОсновнойДолг = ОсновнойДолг + ?(ТекСтрока.Флаг, -1, 1) * ТекСтрока.Сумма;
		Пеня = Пеня + ?(ТекСтрока.Флаг, -1, 1) * ТекСтрока.Пеня;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтветчики

&НаКлиенте
Процедура ОтветчикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Ответчики.ТекущиеДанные.ПериодНачисления 	= ПериодНачисленияПерерасчета;
		Элементы.Ответчики.ТекущиеДанные.Основной 			= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветчикиПериодНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПериодНачисления = Элементы.Ответчики.ТекущиеДанные.ПериодНачисления;
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораПериодаНачисления", ЭтотОбъект);
	
	ПараметрыФормыВыбораПериода = Новый Структура("Значение, РежимВыбораПериода", ПериодНачисления, "МЕСЯЦ");
	ОткрытьФорму("ОбщаяФорма.энргВыборПериода", ПараметрыФормыВыбораПериода, ЭтотОбъект, 
					ЭтотОбъект.УникальныйИдентификатор,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьРешение(Команда)
	Если ПроверкаКорректностиВводаЗадолженности() Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Если ПрименитьРешениеНаСервере() Тогда 
		СуммыДляИспол = Новый Структура("СуммаЗадолженности, СуммаПени, Прочие, СуммаГоспошлина, ДокПерерасчет", ОсновнойДолг, Пеня, Прочие, Госпошлина, Перерасчет);
		Закрыть(СуммыДляИспол);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПрименитьРешениеНаСервере()
	Если Не ЗначениеЗаполнено(Корректировака) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПервааяСтрока = Корректировака[0];
	Если ЗначениеЗаполнено(Перерасчет) Тогда
		ДокПерерасчет = Перерасчет.ПолучитьОбъект();
		ДокПерерасчет.ПометкаУдаления = Ложь;
		ДокПерерасчет.УменьшениеОбъемаИСуммы.Очистить();
		ДокПерерасчет.ЗадолженностьПоРешениюСуда.Очистить();
		ДокПерерасчет.Ответственный = Неопределено;
	Иначе
	    ДокПерерасчет = Документы.энргПерерасчет.СоздатьДокумент();
	КонецЕсли;
	
	ДокПерерасчет.Дата 					= ТекущаяДата();
	ДокПерерасчет.ПериодНачисления		= ПериодНачисленияПерерасчета;
	ДокПерерасчет.ВидОперации 			= Перечисления.энргВидыОпераций.энргПерерасчет_СписаниеЗадолженности;
	ДокПерерасчет.Организация			= Организация;
	ДокПерерасчет.Район					= Район;
	ДокПерерасчет.Строение				= ПервааяСтрока.МКД;
	ДокПерерасчет.Абонент				= ПервааяСтрока.Абонент;
	ДокПерерасчет.СуммаНачисления 		= ОсновнойДолг + Прочие + Госпошлина;
	ДокПерерасчет.СуммаНачисленияПени 	= Пеня;

	Для каждого СтрокаДолга Из Корректировака Цикл
		СтрокаТЧ = ДокПерерасчет.УменьшениеОбъемаИСуммы.Добавить();
		
		СтрокаТЧ.Услуга 			= СтрокаДолга.Услуга;
		СтрокаТЧ.ПериодНачисления 	= СтрокаДолга.ПериодНачисления;
		СтрокаТЧ.Поставщик 			= СтрокаДолга.Поставщик;
		СтрокаТЧ.СуммаПерерасчет 	= СтрокаДолга.СуммаОстаток;
		СтрокаТЧ.Пеня				= СтрокаДолга.Пеня;
	КонецЦикла;
	
	СтартоваяЗадача	= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "СтартоваяЗадача", Истина);
	ТипыДолга		= Перечисления.бестТипДолга;
	Если ВидОтветственности Тогда
	
		Для каждого СтрокаТЧ Из Ответчики Цикл
			ДобавитьСтрокуЗадолженности(ДокПерерасчет, СтрокаТЧ.Контрагент, СтартоваяЗадача, ТипыДолга.ОсновнойДолг, СтрокаТЧ.ОсновнойДолг, СтрокаТЧ.ПериодНачисления);
			ДобавитьСтрокуЗадолженности(ДокПерерасчет, СтрокаТЧ.Контрагент, СтартоваяЗадача, ТипыДолга.Госпошлина, 	 СтрокаТЧ.Госпошлина, 	СтрокаТЧ.ПериодНачисления);
			ДобавитьСтрокуЗадолженности(ДокПерерасчет, СтрокаТЧ.Контрагент, СтартоваяЗадача, ТипыДолга.Пеня, 		 СтрокаТЧ.Пеня, 		СтрокаТЧ.ПериодНачисления);
			ДобавитьСтрокуЗадолженности(ДокПерерасчет, СтрокаТЧ.Контрагент, СтартоваяЗадача, ТипыДолга.Прочие,		 СтрокаТЧ.Прочие, 		СтрокаТЧ.ПериодНачисления);
		КонецЦикла;
	
	Иначе
		Контрагент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Абонент, "ФизЛицо");
	
		//ДобавитьСтрокуЗадолженности(ДокПерерасчет, Контрагент, СтартоваяЗадача, ТипыДолга.ОсновнойДолг, ОсновнойДолг);
		//ДобавитьСтрокуЗадолженности(ДокПерерасчет, Контрагент, СтартоваяЗадача, ТипыДолга.Госпошлина, 	Госпошлина);
		//ДобавитьСтрокуЗадолженности(ДокПерерасчет, Контрагент, СтартоваяЗадача, ТипыДолга.Пеня, 		Пеня);
		ДобавитьСтрокуЗадолженности(ДокПерерасчет, Контрагент, СтартоваяЗадача, ТипыДолга.Прочие, Прочие, ПериодНачисленияПерерасчета);
		
		Для каждого СтрокаТЧ Из Ответчики Цикл
			ДобавитьСтрокуЗадолженности(ДокПерерасчет, СтрокаТЧ.Контрагент, СтартоваяЗадача, ТипыДолга.Госпошлина, СтрокаТЧ.Госпошлина, ПериодНачисленияПерерасчета);
			
			Если СтрокаТЧ.Основной И СтрокаТЧ.Контрагент = Контрагент Тогда
				ДобавитьСтрокуЗадолженности(ДокПерерасчет, СтрокаТЧ.Контрагент, СтартоваяЗадача, ТипыДолга.ОсновнойДолг, СтрокаТЧ.ОсновнойДолг, 	СтрокаТЧ.ПериодНачисления);
				ДобавитьСтрокуЗадолженности(ДокПерерасчет, СтрокаТЧ.Контрагент, СтартоваяЗадача, ТипыДолга.Пеня, СтрокаТЧ.Пеня,			СтрокаТЧ.ПериодНачисления);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Попытка
	
		ДокПерерасчет.Записать(РежимЗаписиДокумента.Запись);
		Перерасчет = ДокПерерасчет.Ссылка;
		
		Возврат Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ перерасчет по причине: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуЗадолженности(ДокПерерасчет, Контрагент, СтартоваяЗадача, ВидДолга, Сумма, ПериодНачисления)
	
	Перем СтрокаТЧ;
	
	Если Не ЗначениеЗаполнено(Сумма) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ = ДокПерерасчет.ЗадолженностьПоРешениюСуда.Добавить();
	
	СтрокаТЧ.Субсидиарно 		= ВидОтветственности; 
	СтрокаТЧ.Контрагент			= Контрагент;
	СтрокаТЧ.ПериодНачисления 	= ПериодНачисления;
	СтрокаТЧ.ВидДолга 			= ВидДолга;
	СтрокаТЧ.Сумма			 	= Сумма;
	СтрокаТЧ.Задача				= СтартоваяЗадача;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	//Элементы.ОтветчикиОсновнойДолг.Видимость = ВидОтветственности;
	//Элементы.ОтветчикиПеня.Видимость 		 = ВидОтветственности;
	Элементы.ОтветчикиПрочие.Видимость 		 = ВидОтветственности;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаКорректностиВводаЗадолженности()
	Отказ = Ложь;
	ИтогСуммы = Новый Структура("ОсновнойДолг, Пеня, Госпошлина", 0, 0, 0);
	Если ВидОтветственности Тогда 
		ИтогСуммы.Вставить("Прочие", 0);
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из Ответчики Цикл
	 	Для каждого ЭлемСумм Из ИтогСуммы Цикл
			ИтогСуммы[ЭлемСумм.Ключ] = ЭлемСумм.Значение + СтрокаТЗ[ЭлемСумм.Ключ];
		КонецЦикла;
	КонецЦикла;
	
	Для каждого ЭлемСумм Из ИтогСуммы Цикл
		Если ЭлемСумм.Значение <> ЭтаФорма[ЭлемСумм.Ключ] Тогда
			СумПоле =?(ЭлемСумм.Ключ = "ОсновнойДолг", "Основной долг", ЭлемСумм.Ключ); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СумПоле + " не равна суммарной.");
			Отказ = Истина;
		КонецЕсли; 
	КонецЦикла;

	Возврат Отказ;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораПериодаНачисления(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		Элементы.Ответчики.ТекущиеДанные.ПериодНачисления = ВыбранныйПериод;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиИзмененияСуммыДолга(Знач ИмяКолонки, Знач ИмяРеквизита)
	
	Перем Долг, ИтогСуммы, Контрагент, СтрокаТЗ, СтрокиОтветчика;
	
	ИтогСуммы = 0;
	
	Долг = ЭтаФорма[ИмяРеквизита];
	Для каждого СтрокаТЗ Из Ответчики Цикл
		ИтогСуммы = ИтогСуммы + СтрокаТЗ[ИмяКолонки];
	КонецЦикла;
	
	Если ИтогСуммы <> Долг Тогда 
		Контрагент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Абонент, "ФизЛицо");
		СтрокиОтветчика = Ответчики.НайтиСтроки(Новый Структура("Основной, ПериодНачисления, Контрагент", Истина, ПериодНачисленияПерерасчета, Контрагент));
		
		Если ЗначениеЗаполнено(СтрокиОтветчика)  Тогда
			СтрокаТЗ = СтрокиОтветчика[0];
			
		Иначе 
			СтрокаТЗ = Ответчики.Добавить();
			
			СтрокаТЗ.Основной			= Истина;
			СтрокаТЗ.ПериодНачисления 	= ПериодНачисленияПерерасчета;
			СтрокаТЗ.Контрагент 	  	= Контрагент;
		КонецЕсли;
		
		СтрокаТЗ[ИмяКолонки] = ?(Долг - СтрокаТЗ[ИмяКолонки] > ИтогСуммы, Долг - ИтогСуммы, 0);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


