#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Договор,Организация,Район", ПараметрКоманды, энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды,"Организация"), энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды,"Район"));
	ОткрытьФорму("Обработка.бестЗагрузитьДанныеИзВнешнихИсточников.Форма.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти