#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		ПолучаемыеРеквизиты = "Строение,Помещение,ЧастныйСектор";
		
		ЗначенияРеквизитовАбонента 	= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Объект.Абонент,ПолучаемыеРеквизиты);
		Строение		 			= ЗначенияРеквизитовАбонента.Строение;
		Помещение 					= ЗначенияРеквизитовАбонента.Помещение;
		ЧастныйСектор 				= ЗначенияРеквизитовАбонента.ЧастныйСектор;
		
		ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСНТСтало();
	ВычитатьОбъемИзОбъемаЮЛ = ЗначениеЗаполнено(Объект.ТочкаПоставкиЮЛПотребление);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
			
		ДанныеНеИзменены = (Объект.СНТДНТПривязан = СНТДНТПривязанДо
							и Объект.СНТДНТПотребление = СНТДНТПотреблениеДо
							и Объект.ТочкаПоставкиЮЛПотребление = ТочкаПоставкиЮЛПотреблениеДо);
		
		Если ДанныеНеИзменены Тогда 
			Отказ = Истина;  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Измените параметры подключения абонента СНТ/ДНТ (Стало).'"));
		КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура СНТДНТПривязанПриИзменении(Элемент)
	УстановитьВидимостьСНТСтало();
	Если Не ЗначениеЗаполнено(Объект.СНТДНТПривязан) Тогда   
		Объект.ТочкаПоставкиЮЛПотребление = ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");
		Объект.СНТДНТПотребление = ПредопределенноеЗначение("Справочник.энргДоговорыКонтрагентов.ПустаяСсылка");
		ВычитатьОбъемИзОбъемаЮЛ	 = Ложь;
	Иначе 
		Если Не ЗначениеЗаполнено(Объект.СНТДНТПотребление) Тогда
			Объект.СНТДНТПотребление = Объект.СНТДНТПривязан;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиЮЛПотреблениеПриИзменении(Элемент)
	ВычитатьОбъемИзОбъемаЮЛ = ЗначениеЗаполнено(Объект.ТочкаПоставкиЮЛПотребление);
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
	иначе
		ИначеЗаполнитьРеквизитыПустойСсылкой();
	КонецЕсли; 
	
	СНТСталоПриИзмененииШапки();

КонецПроцедуры 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		ПолучитьДанныеСНТ(Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент);
	иначе
		ИначеЗаполнитьРеквизитыПустойСсылкой();
	КонецЕсли; 
	
	СНТСталоПриИзмененииШапки();

КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиЮЛПотреблениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МассивПараметров 	= Новый Массив;
    НовыйПараметр 		= Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьТППоДоговору(Объект.Дата, Объект.СНТДНТПотребление));
    МассивПараметров.Добавить(НовыйПараметр);
	ЗначениеСвойства = Новый ФиксированныйМассив(МассивПараметров);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкаПоставкиЮЛПотребление", "ПараметрыВыбора", ЗначениеСвойства);
КонецПроцедуры 

&НаКлиенте
Процедура СНТДНТПотреблениеПриИзменении(Элемент)  
	
	Если Не ЗначениеЗаполнено(Объект.СНТДНТПотребление) Тогда   
		Объект.ТочкаПоставкиЮЛПотребление = ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");
		ВычитатьОбъемИзОбъемаЮЛ	 = Ложь;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ПолучитьДанныеСНТ(Период, Организация, Район, Абонент)
	
	ПериодЗапроса = Новый Граница(Период, ВидГраницы.Исключая);
	
	ВыборкаДанныеСНТ =  РегистрыСведений.энргТочкиПоставкиСНТ.ПолучитьДанныеСНТ(ПериодЗапроса, Организация, Район, Абонент);
	
	ЗапросПустой = Истина;
	
	Пока ВыборкаДанныеСНТ.Следующий() Цикл
		ТочкаПоставкиЮЛПотреблениеДо = ВыборкаДанныеСНТ.ТочкаПоставки;
		СНТДНТПривязанДо 			 = ВыборкаДанныеСНТ.СНТДНТПривязан;
		СНТДНТПотреблениеДо 		 = ВыборкаДанныеСНТ.СНТДНТПотребление;
		ЗапросПустой = Ложь;
	КонецЦикла;
	
	Если ЗапросПустой Тогда
		ТочкаПоставкиЮЛПотреблениеДо = Справочники.энргТочкиУчета.ПустаяСсылка();   
		СНТДНТПривязанДо 			 = Справочники.энргДоговорыКонтрагентов.ПустаяСсылка();
		СНТДНТПотреблениеДо 		 = Справочники.энргДоговорыКонтрагентов.ПустаяСсылка();	
	КонецЕсли;
	
	ВычитатьОбъемИзОбъемаЮЛДо = ЗначениеЗаполнено(ТочкаПоставкиЮЛПотреблениеДо);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСНТСтало()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСкрываемаяСНТСтало", 
		"Видимость", ЗначениеЗаполнено(Объект.СНТДНТПривязан));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТППоДоговору(Период, СНТДНТПотребление)
	 Возврат бестРаботаСТочкамиУчетаНПСервер.ПолучитьТППоДоговору(Период, СНТДНТПотребление);	
КонецФункции 
 
&НаКлиенте
Процедура СНТСталоПриИзмененииШапки()
	Объект.ТочкаПоставкиЮЛПотребление = ТочкаПоставкиЮЛПотреблениеДо;
	Объект.СНТДНТПривязан 			  = СНТДНТПривязанДо;
	Объект.СНТДНТПотребление 		  = СНТДНТПотреблениеДо;
	ВычитатьОбъемИзОбъемаЮЛ = ЗначениеЗаполнено(Объект.ТочкаПоставкиЮЛПотребление);
	УстановитьВидимостьСНТСтало(); 	
КонецПроцедуры  

&НаКлиенте
Процедура ИначеЗаполнитьРеквизитыПустойСсылкой()
	Объект.КлючПомещения		 = ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	ЭтаФорма.Помещение 			 = ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
	ЭтаФорма.Строение 			 = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	ТочкаПоставкиЮЛПотреблениеДо = ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");   
	СНТДНТПривязанДо 			 = ПредопределенноеЗначение("Справочник.энргДоговорыКонтрагентов.ПустаяСсылка");
	СНТДНТПотреблениеДо 		 = ПредопределенноеЗначение("Справочник.энргДоговорыКонтрагентов.ПустаяСсылка");
	ВычитатьОбъемИзОбъемаЮЛДо	 = Ложь;	
КонецПроцедуры

#КонецОбласти














