
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Район") Тогда
		Район = Параметры.Район;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		Договор = Параметры.Договор;
	КонецЕсли;
	бестЛокализацияСервер.ПриСозданииНаСервере_бестАктСверки(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Сформировать(Команда)
	ПараметрыФормы = Новый Структура("ОбъектПечати, ИмяМакета, ТаблицаМакета, Организация, Район, Период, Договор, ФормироватьЗаПериод", ПредопределенноеЗначение("Документ.бестПлатежныйДокумент.ПустаяСсылка"),"ПФ_MXL_АктСверки","Документ.бестПлатежныйДокумент",Организация,Район, ПериодФормирования, Договор, Истина);
	ОткрытьФорму("ОбщаяФорма.бестФормаПечатныхФорм", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаДату(Команда)
	ПараметрыФормы = Новый Структура("ОбъектПечати, ИмяМакета, ТаблицаМакета, Организация, Район, Период, Договор, ФормироватьЗаПериод", ПредопределенноеЗначение("Документ.бестПлатежныйДокумент.ПустаяСсылка"),"ПФ_MXL_АктСверки","Документ.бестПлатежныйДокумент",Организация,Район, ПериодФормирования, Договор, Ложь);
	ОткрытьФорму("ОбщаяФорма.бестФормаПечатныхФорм", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы


#КонецОбласти