
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсторияПоказаний.Параметры.УстановитьЗначениеПараметра("Организация",  		 Параметры.Организация);
	ИсторияПоказаний.Параметры.УстановитьЗначениеПараметра("Район", 			 Параметры.Район);
	ИсторияПоказаний.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета",		 Параметры.ОбъектРасчета);
	ИсторияПоказаний.Параметры.УстановитьЗначениеПараметра("ТочкаУчета",		 Параметры.ТочкаУчета);
	ИсторияПоказаний.Параметры.УстановитьЗначениеПараметра("ПриборУчета",		 Параметры.ПриборУчета);
КонецПроцедуры
