#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задает расширенные настройки отчетов конфигурации.
//
// Параметры:
//	 Настройки - ТаблицаЗначений - коллекция предопределенных вариантов отчетов
//	 НастройкиОтчета - Структура
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по судебной работе'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьОтчет(ТабДок, ПараметрыОтчета) Экспорт
	
	ТабДок.Очистить();
	
	
	Макет	= ПолучитьМакет("Макет");
	
	ОбластьШапка					= Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	РезультатЗапроса = ПолучитьДанныеПочасовогоПотребления(ПараметрыОтчета);
	
	ВыборкаДень = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДень.Следующий() Цикл
		
		ОбластьДанные					= Макет.ПолучитьОбласть("Данные");
		ОбластьДанные.Параметры.День 	= Формат(ВыборкаДень.День,"ДФ=dd.MM.yyyy");
		
		ВыборкаДетальныеЗаписи = ВыборкаДень.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ОтклонениеОтПлана = Перечисления.бестТипыЦенНаЭЭ.ПревышениеНадПланом Тогда
				ПостФикс = "П";
			ИначеЕсли ВыборкаДетальныеЗаписи.ОтклонениеОтПлана = Перечисления.бестТипыЦенНаЭЭ.ПревышениеНадФактом Тогда
				ПостФикс = "Ф";
			Иначе 
				ПостФикс = "";
			КонецЕсли;
			ОбластьДанные.Параметры["Объем" + ПостФикс + ВыборкаДетальныеЗаписи.Час] = ВыборкаДетальныеЗаписи.ОбъемУслуги;
			ОбластьДанные.Параметры["Сумма" + ПостФикс + ВыборкаДетальныеЗаписи.Час] = ВыборкаДетальныеЗаписи.СуммаСредневзвешенная;
			ОбластьДанные.Параметры["НерегЦена" + ПостФикс + ВыборкаДетальныеЗаписи.Час] = ВыборкаДетальныеЗаписи.ЗначениеТарифа;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеПочасовогоПотребления(ПараметрыОтчета)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.День КАК День,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.Час КАК Час,
		|	СУММА(бестПочасовойОбъемНачисленийЭлектроэнергии.ОбъемУслуги) КАК ОбъемУслуги,
		|	СУММА(бестПочасовойОбъемНачисленийЭлектроэнергии.СуммаСредневзвешенная) КАК СуммаСредневзвешенная,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ОтклонениеОтПлана КАК ОтклонениеОтПлана,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ЗначениеТарифа КАК ЗначениеТарифа
		|ИЗ
		|	РегистрНакопления.бестПочасовойОбъемНачисленийЭлектроэнергии КАК бестПочасовойОбъемНачисленийЭлектроэнергии
		|ГДЕ
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.Организация = &Организация
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.Район = &Район
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.ПериодНачисления = &ПериодНачисления
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.ОбъектРасчета = &ОбъектРасчета
		|	И бестПочасовойОбъемНачисленийЭлектроэнергии.Услуга = &Услуга
		|
		|СГРУППИРОВАТЬ ПО
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.День,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.Час,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ОтклонениеОтПлана,
		|	бестПочасовойОбъемНачисленийЭлектроэнергии.ЗначениеТарифа
		|ИТОГИ ПО
		|	День";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", 		ПараметрыОтчета.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", 		ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПараметрыОтчета.ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 				ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("Услуга", 			ПараметрыОтчета.Услуга);
	
	Возврат Запрос.Выполнить();
	
КонецФункции 

#КонецОбласти

#КонецЕсли