#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет схему структуры сети действующих точек.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуСтруктураСетиДействующихТочек(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыОтбора,"ДействующиеТочкиУчета");		
	Иначе
		ЕстьТочкиУчетаПомещения 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочкиУчета" Тогда
				ЕстьТочкиУчетаПомещения = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьТочкиУчетаПомещения Тогда
			РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыОтбора,"ДействующиеТочкиУчета");		
		КонецЕсли;
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуСтруктураСетиДействующихТочек());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры; 	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, Строение, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуСтруктураСетиДействующихТочек()
	
	Текст =
	"ВЫБРАТЬ
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.Организация КАК Организация,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.Район КАК Район,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.Строение КАК МКД,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргТУМКДНаСтруктуреСетиСрезПоследних.СтруктураСети КАК СтруктураСети
	|ИЗ
	|	РегистрСведений.энргТУМКДНаСтруктуреСети.СрезПоследних(
	|			,
	|			(Организация, Район, Строение, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ДействующиеТочкиУчета.Организация,
	|					ДействующиеТочкиУчета.Район,
	|					ДействующиеТочкиУчета.МКД,
	|					ДействующиеТочкиУчета.ТочкаУчета
	|				ИЗ
	|					ДействующиеТочкиУчета КАК ДействующиеТочкиУчета)) КАК энргТУМКДНаСтруктуреСетиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли