#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргУстановитьПроцентРаспределенияОтрицательногоОДН(ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли; 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти


#Область СобытияРеквизитовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
	
	ЗаполнитьАктивнымиУслугами();
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьАктивнымиУслугами();
КонецПроцедуры 

#КонецОбласти

#Область ВспомогательныеМетоды

&НаСервере
Процедура ЗаполнитьАктивнымиУслугами() 	
		
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");   
	//ДокументОбъект.ЗаполнитьАктивнымиУслугами();     
	//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Период  = Новый МоментВремени(Объект.Дата, Объект.Ссылка);
	Иначе
		Период 	= Объект.Дата;
	КонецЕсли;
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район",			Объект.Район);
	Запрос.УстановитьПараметр("МКД", 			Объект.МКД);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВсеТочкиУчета
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргВладельцыТочекУчетаСрезПоследних
	|ГДЕ
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргАктивностьТочекУчетаМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУчетаМКД.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ДействующиеТочкиУчета
	|ИЗ
	|	ВсеТочкиУчета КАК ВсеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД
	|		ПО ВсеТочкиУчета.ТочкаУчета = АктивныеТочкиУчетаМКД.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргУслугиТочекУчетаМКДСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргУслугиТочекУчетаМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиТочекУчета.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СоставныеУслуги
	|ИЗ
	|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
	|		ПО ДействующиеТочкиУчета.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиТочекУчета.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВТ_СоставныеУслуги.Услуга) КАК Услуга
	|ИЗ
	|	ВТ_СоставныеУслуги КАК ВТ_СоставныеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВТ_СоставныеУслуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВТ_СоставныеУслуги.Услуга)";
	
	Результат 		= Запрос.Выполнить();
	Выборка  		= Результат.Выгрузить();
	
	Объект.ПроцентРаспределения.Загрузить(Выборка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
