#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Есть условия по этапу
//
// Параметры:
//  Этап		 - СправочникСсылка.энргВидыОперацийПИД - Этап. 
//  Организация	 - СправочникСсылка.Организации - Организация. 
//  Район		 - СправочникСсылка.энргЗоныОтвественности - Район. 
//  АбонентВИП	 - Булево - 
// 
// Возвращаемое значение:
//  Булево - есть ли условия по этапу ПИР. 
//
Функция ЕстьУсловияПоЭтапу(Этап, Организация, Район, АбонентВИП) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргНастройкаУсловийДляПереходаНаЭтап.Этап КАК Этап,
		|	энргНастройкаУсловийДляПереходаНаЭтап.Организация КАК Организация,
		|	энргНастройкаУсловийДляПереходаНаЭтап.Район КАК Район,
		|	энргНастройкаУсловийДляПереходаНаЭтап.КратностьСуммыЗадолженности КАК КратностьСуммыЗадолженности,
		|	энргНастройкаУсловийДляПереходаНаЭтап.КоличествоПериодовЗадолженности КАК КоличествоПериодовЗадолженности
		|ИЗ
		|	РегистрСведений.энргНастройкаУсловийДляПереходаНаЭтап КАК энргНастройкаУсловийДляПереходаНаЭтап
		|ГДЕ
		|	энргНастройкаУсловийДляПереходаНаЭтап.Этап = &Этап
		|	И энргНастройкаУсловийДляПереходаНаЭтап.Организация = &Организация
		|	И энргНастройкаУсловийДляПереходаНаЭтап.Район = &Район
		|	И энргНастройкаУсловийДляПереходаНаЭтап.АбонентВИП = &АбонентВИП";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район",		 Район);
	Запрос.УстановитьПараметр("Этап",		 Этап);
	Запрос.УстановитьПараметр("АбонентВИП",	 АбонентВИП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

#КонецОбласти

#КонецЕсли