#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает сколько осталось создать документов регистратора.
//
// Параметры:
//  ДокументОснование	-	ОпределяемыйТип.энргДокументОснованиеЗагрузкиПоказаний.
// 
// Возвращаемое значение:
//   Число.
//
Функция КоличествоОсталосьСоздатьДокументовРегистратора(ДокументОснование) Экспорт
	
	Результат = 0;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргЗагрузкаПоказанийТочкиУчета.IDСтроки) КАК КоличествоОсталось
		|ИЗ
		|	РегистрСведений.энргЗагрузкаПоказанийТочкиУчета КАК энргЗагрузкаПоказанийТочкиУчета
		|ГДЕ
		|	энргЗагрузкаПоказанийТочкиУчета.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.КоличествоОсталось;
	
	Возврат Результат;
	
КонецФункции   

#КонецОбласти

#КонецЕсли