#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗапуститьФормированиеРегистрацииПоказаний(ДокументОснование, КоличествоПотоков, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ДанныеПотоков = ДополнительныеПараметры.ДанныеПотоков;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЗагрузкаПоказанийТочкиУчета.IDСтроки КАК IDСтроки
	|ИЗ
	|	РегистрСведений.энргЗагрузкаПоказанийТочкиУчета КАК энргЗагрузкаПоказанийТочкиУчета
	|ГДЕ
	|	энргЗагрузкаПоказанийТочкиУчета.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	IDСтроки";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбщееКоличество = Выборка.Количество();
	Если ОбщееКоличество <= КоличествоПотоков Тогда 
		Порция = ОбщееКоличество;
	Иначе 
		Порция = Цел(ОбщееКоличество / КоличествоПотоков);
		Если (ОбщееКоличество % КоличествоПотоков) > 0 Тогда
			Порция = Порция + 1;
		КонецЕсли;
	КонецЕсли;
	
	Итерация = 0;
	ИдентификаторыПотока = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		Если Итерация = Порция Тогда
			
			ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, ИдентификаторыПотока);
			ДанныеПотоков.Добавить(ДлительнаяОперация);
			
			ИдентификаторыПотока = Новый Массив;
			Итерация = 0;
			
		КонецЕсли;
		
		ИдентификаторыПотока.Добавить(Выборка.IDСтроки);
		
		Итерация = Итерация + 1;
	КонецЦикла; 
	
	Если ИдентификаторыПотока.Количество() > 0 Тогда 
		ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, ИдентификаторыПотока);
		ДанныеПотоков.Добавить(ДлительнаяОперация); 
	КонецЕсли;
	
	Если ДанныеПотоков.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Все строки с показаниями обработаны'"));		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам(ДокументОснование, Идентификаторы, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗаписьЖурналаРегистрации(
	"Создание показаний при загрузке показаний", 
	УровеньЖурналаРегистрации.Примечание,
	Метаданные.Документы.энргЗагрузкаПоказанийИзВнешнихИсточников,
	ДокументОснование,
	"Начало " + ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЗагрузкаПоказанийТочкиУчета.ДокументОснование КАК ДокументОснование,
	|	энргЗагрузкаПоказанийТочкиУчета.IDСтроки КАК IDСтроки,
	|	энргЗагрузкаПоказанийТочкиУчета.Абонент КАК Абонент,
	|	энргЗагрузкаПоказанийТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргЗагрузкаПоказанийТочкиУчета.Услуга КАК Услуга,
	|	энргЗагрузкаПоказанийТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргЗагрузкаПоказанийТочкиУчета.ДатаДокумента КАК ДатаДокумента,
	|	энргЗагрузкаПоказанийТочкиУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргЗагрузкаПоказанийТочкиУчета.Организация КАК Организация,
	|	ЕстьNULL(энргЗагрузкаПоказанийТочкиУчета.Абонент.Район, энргЗагрузкаПоказанийТочкиУчета.МКД.Район) КАК Район,
	|	энргЗагрузкаПоказанийТочкиУчета.КлючПомещения КАК КлючПомещения,
	|	ВЫБОР
	|		КОГДА энргЗагрузкаПоказанийТочкиУчета.Абонент <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА энргЗагрузкаПоказанийТочкиУчета.Договор <> ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА 1
	|		КОГДА энргЗагрузкаПоказанийТочкиУчета.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ТипДокумента,
	|	энргЗагрузкаПоказанийТочкиУчета.Договор КАК Договор,
	|	энргЗагрузкаПоказанийТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	энргЗагрузкаПоказанийТочкиУчета.МКД КАК МКД
	|ПОМЕСТИТЬ СтрокиСоздания
	|ИЗ
	|	РегистрСведений.энргЗагрузкаПоказанийТочкиУчета КАК энргЗагрузкаПоказанийТочкиУчета
	|ГДЕ
	|	энргЗагрузкаПоказанийТочкиУчета.ДокументОснование = &ДокументОснование
	|	И энргЗагрузкаПоказанийТочкиУчета.IDСтроки В(&Идентификаторы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСоздания.ДокументОснование КАК ДокументОснование,
	|	СтрокиСоздания.IDСтроки КАК IDСтрокиТочкиУчета,
	|	СтрокиСоздания.Абонент КАК Абонент,
	|	СтрокиСоздания.ТочкаУчета КАК ТочкаУчета,
	|	СтрокиСоздания.Услуга КАК Услуга,
	|	СтрокиСоздания.ПриборУчета КАК ПриборУчета,
	|	СтрокиСоздания.ДатаДокумента КАК ДатаДокумента,
	|	СтрокиСоздания.ПериодНачисления КАК ПериодНачисления,
	|	СтрокиСоздания.Организация КАК Организация,
	|	СтрокиСоздания.Район КАК Район,
	|	СтрокиСоздания.КлючПомещения КАК КлючПомещения,
	|	энргЗагрузкаПоказанийШкалыПриборовУчета.IDСтроки КАК IDСтрокиШкалы,
	|	энргЗагрузкаПоказанийШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	энргЗагрузкаПоказанийШкалыПриборовУчета.Шкала КАК Шкала,
	|	СтрокиСоздания.ТипДокумента КАК ТипДокумента,
	|	СтрокиСоздания.Договор КАК Договор,
	|	СтрокиСоздания.ОбъектРасчета КАК ОбъектРасчета,
	|	СтрокиСоздания.МКД КАК МКД
	|ПОМЕСТИТЬ ТаблицаШкалыПриборовУчета
	|ИЗ
	|	СтрокиСоздания КАК СтрокиСоздания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗагрузкаПоказанийШкалыПриборовУчета КАК энргЗагрузкаПоказанийШкалыПриборовУчета
	|		ПО СтрокиСоздания.ДокументОснование = энргЗагрузкаПоказанийШкалыПриборовУчета.ДокументОснование
	|			И СтрокиСоздания.IDСтроки = энргЗагрузкаПоказанийШкалыПриборовУчета.IDСтрокиТочкиУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаШкалыПриборовУчета.ДокументОснование КАК ДокументОснование,
	|	ТаблицаШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	ТаблицаШкалыПриборовУчета.Абонент КАК Абонент,
	|	ТаблицаШкалыПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаШкалыПриборовУчета.Услуга КАК Услуга,
	|	ТаблицаШкалыПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаШкалыПриборовУчета.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаШкалыПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаШкалыПриборовУчета.Организация КАК Организация,
	|	ТаблицаШкалыПриборовУчета.Район КАК Район,
	|	ТаблицаШкалыПриборовУчета.КлючПомещения КАК КлючПомещения,
	|	ТаблицаШкалыПриборовУчета.IDСтрокиШкалы КАК IDСтрокиШкалы,
	|	ТаблицаШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	ТаблицаШкалыПриборовУчета.Шкала КАК Шкала,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.МаксимальноВозможныйОбъемПотребления КАК МаксимальноВозможныйОбъемПотребления,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.Переворот КАК Переворот,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.Разница КАК Разница,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.Сумма КАК Сумма,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.СреднийОбъемПотребления3 КАК СреднийОбъемПотребления3,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	энргЗагрузкаПоказанийПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ТаблицаШкалыПриборовУчета.ТипДокумента КАК ТипДокумента,
	|	ТаблицаШкалыПриборовУчета.Договор КАК Договор,
	|	ТаблицаШкалыПриборовУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаШкалыПриборовУчета.МКД КАК МКД,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний) КАК ВидОперации
	|ИЗ
	|	ТаблицаШкалыПриборовУчета КАК ТаблицаШкалыПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗагрузкаПоказанийПоказанияПриборовУчета КАК энргЗагрузкаПоказанийПоказанияПриборовУчета
	|		ПО ТаблицаШкалыПриборовУчета.ДокументОснование = энргЗагрузкаПоказанийПоказанияПриборовУчета.ДокументОснование
	|			И ТаблицаШкалыПриборовУчета.IDСтрокиТочкиУчета = энргЗагрузкаПоказанийПоказанияПриборовУчета.IDСтрокиТочкиУчета
	|			И ТаблицаШкалыПриборовУчета.IDСтрокиШкалы = энргЗагрузкаПоказанийПоказанияПриборовУчета.IDСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДокумента,
	|	IDСтрокиТочкиУчета,
	|	Шкала";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыЗаписи.Вставить("МенеджерТочек", РегистрыСведений.энргЗагрузкаПоказанийТочкиУчета);
	ПараметрыЗаписи.Вставить("МенеджерШкал", РегистрыСведений.энргЗагрузкаПоказанийШкалыПриборовУчета);
	ПараметрыЗаписи.Вставить("МенеджерПоказаний", РегистрыСведений.энргЗагрузкаПоказанийПоказанияПриборовУчета);
	ПараметрыЗаписи.Вставить("ИдентификаторТочки", Неопределено);
	
	МенеджерыДокументов = Новый Соответствие;
    МенеджерыДокументов.Вставить(0, Документы.энргРегистрацияПоказанийАбонента);
	МенеджерыДокументов.Вставить(1, Документы.бестРегистрацияПоказанийНП);
	МенеджерыДокументов.Вставить(2, Документы.энргРегистрацияПоказанийМКД);	
	
	ДокументОбъект 		= Неопределено;
	Примечание 			= "Создан автоматически";
	ИсточникПоказаний 	= ПредопределенноеЗначение("Справочник.энргИсточникиПоказаний.РеестрПлатежей");
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, "ИсточникПоказаний") Тогда
		ИсточникПоказаний = ДокументОснование.ИсточникПоказаний;	
	КонецЕсли;
	
	ТекТочкаУчета 			= Неопределено;
	ТекТипДокумента			= Неопределено;
	ТекШкала 				= Неопределено;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего 			= Выборка.Количество();
	Счетчик			= 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений	= Цел(Всего / 15);
	
	Пока Выборка.Следующий() Цикл 	 			
		
		Если ТекТипДокумента <> Выборка.ТипДокумента Тогда
			МенеджерДокумента = МенеджерыДокументов[Выборка.ТипДокумента];
		КонецЕсли;		
		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.IDСтрокиТочкиУчета Тогда			
			
			Если НЕ ДокументОбъект = Неопределено Тогда				
				ЗаписатьДокументРегистрацииПоказаний(ПараметрыЗаписи, ДокументОбъект);
			КонецЕсли;
			
			ДокументОбъект = МенеджерДокумента.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
			ДокументОбъект.Дата 				= Выборка.ДатаДокумента;
			ДокументОбъект.ИсточникПоказаний 	= ИсточникПоказаний;
			ДокументОбъект.ДокументОснование 	= ДокументОснование;
			ДокументОбъект.Примечание 			= Примечание;
			
			НоваяТочка = Истина;
			СтрокаТочкиУчета = ДокументОбъект.ТочкиУчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			IDСтрокиТочки 				= Новый УникальныйИдентификатор(Выборка.IDСтрокиТочкиУчета);
			СтрокаТочкиУчета.IDСтроки 	= IDСтрокиТочки;
			
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы = ДокументОбъект.ШкалыПриборовУчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШкалы, Выборка);
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
		КонецЕсли;
		
		СтрокаПоказаний = ДокументОбъект.ПоказанияПриборовУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, Выборка);
		СтрокаПоказаний.IDСтроки = IDСтрокиШкалы; 		
		
		ТекТочкаУчета 	= Выборка.IDСтрокиТочкиУчета;
		ПараметрыЗаписи.ИдентификаторТочки = ТекТочкаУчета;
		ТекШкала 		= Выборка.Шкала;
		ТекТипДокумента	= Выборка.ТипДокумента; 
		
		КоличествоИтераций = КоличествоИтераций + 1;
		Счетчик = Счетчик + 1;
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент);
			КоличествоИтераций = 0;
		КонецЕсли;
		
	КонецЦикла; 		
	
	Если НЕ ДокументОбъект = Неопределено Тогда
		ЗаписатьДокументРегистрацииПоказаний(ПараметрыЗаписи, ДокументОбъект);
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации(
	"Создание показаний при загрузке показаний", 
	УровеньЖурналаРегистрации.Примечание,
	Метаданные.Документы.энргЗагрузкаПоказанийИзВнешнихИсточников,
	ДокументОснование,
	"Конец " + ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Обработать данные при загрузке
// Событие при загрузке данных из файла
//
// Параметры:
//  ДокументОснование	 - 	 - 
//  РезультатПакет		 - 	 - 
//  СвязанныеДокументы	 - 	 - 
//  ДокументыПроведения	 - 	 - 
//
Функция ОбработатьДанныеПриЗагрузке(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, ОчищатьТЧЛиста = Истина, ВспомогательныеПараметры = Неопределено) Экспорт 
	
	Если Не ВспомогательныеПараметры.Свойство("Период") Тогда
		ВспомогательныеПараметры.Вставить("Период", ДокументОснование.ПериодНачисления);
	КонецЕсли;  
	
	Если Не ВспомогательныеПараметры.Свойство("КонтрольныйСъем") Тогда
		ВспомогательныеПараметры.Вставить("КонтрольныйСъем", Ложь);
	КонецЕсли;  
	
	ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения); 	
	Результат = ПровестиМодифицированныеДокументы(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры);
	
	Возврат Результат;
	
КонецФункции

// Процедура - Обработать исправленные данные
// Событие при исправлении ошибок в документе основания
//
// Параметры:
//  ДокументОснование	 - 	 - 
//  РезультатЗапроса	 - 	 - 
//  Успешно				 - 	 - 
//
Процедура ОбработатьИсправленныеДанные(ДокументОснование, РезультатЗапроса, Успешно, ДополнительныеПараметры = Неопределено, ВспомогательныеПараметрыДляОтклонения = Неопределено) Экспорт
	
	СвязанныеДокументы 		= Новый Соответствие;	
	ДокументыПроведения 	= Новый Массив;
	
	ДанныеДокумента = РезультатЗапроса.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Абонент КАК Абонент,
	|	ДанныеДокумента.МКД КАК МКД,
	|	ДанныеДокумента.ДатаПоказаний КАК ДатаПоказаний,
	|	ДанныеДокумента.IDСтроки КАК IDСтроки,
	|	ДанныеДокумента.КлючПомещения КАК КлючПомещения,
	|	ДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ДанныеДокумента.Шкала КАК Шкала,
	|	ДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДокумента.ТекущиеПоказанияФайла КАК ТекущиеПоказанияФайла,
	|	ДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДокумента.Район КАК Район
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеДокумента КАК ДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеДокумента.Организация КАК Организация,
	|	ВТДанныеДокумента.IDСтроки КАК IDСтроки,
	|	ВТДанныеДокумента.Абонент КАК Абонент,
	|	ВТДанныеДокумента.МКД КАК МКД,
	|	ВТДанныеДокумента.Шкала КАК Шкала,
	|	ВТДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ВТДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ВТДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ВТДанныеДокумента.ДатаПоказаний КАК ДатаПоказаний,
	|	ВТДанныеДокумента.Район КАК Район,
	|	ВТДанныеДокумента.КлючПомещения КАК КлючПомещения,
	|	ВТДанныеДокумента.Услуга КАК Услуга,
	|	ВТДанныеДокумента.ТекущиеПоказанияФайла КАК ТекущиеПоказанияФайла,
	|	ВЫБОР
	|		КОГДА ВТДанныеДокумента.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипДокумента
	|ИЗ
	|	ВТДанныеДокумента КАК ВТДанныеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	МКД,
	|	КлючПомещения,
	|	IDСтроки,
	|	ТочкаУчета,
	|	ПриборУчета,
	|	Шкала
	|ИТОГИ ПО
	|	ДатаПоказаний";
	
	Запрос.УстановитьПараметр("ДанныеДокумента", ДанныеДокумента);
	РезультатЗапроса = Запрос.Выполнить();	
	
	ЗафиксироватьНайденныеДанныеПриИсправленииДанных(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, Ложь); 	
	
	Успешно = Истина;
	ДополнительныеПараметры.Вставить("МассивID", Новый Массив);
	Для Каждого ТекДокументОбъект Из ДокументыПроведения Цикл
		
		ДокументОбъект = ТекДокументОбъект;  
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.энргРегистрацияПоказанийАбонента") Тогда
			ПрочитатьПредыдущиеПоказанияПриИсправленииДанных(ДокументОбъект, ВспомогательныеПараметрыДляОтклонения);		
		КонецЕсли;
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ДокументОбъект.ТочкиУчета.Количество() > 0 Тогда 
				ДополнительныеПараметры.МассивID.Добавить(ДокументОбъект.ТочкиУчета[0].IDСтроки);
			КонецЕсли;						
			
		Исключение		 	
			
			ИнфаОбОшибке 									= ИнформацияОбОшибке();
			ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
			ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
			ПараметрыЖурнала.ТекстПользователю 				= "Не удалось провести документы по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
			энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка показаний", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала); 
			
		КонецПопытки;
		
	КонецЦикла; 	
	
КонецПроцедуры 

Процедура ЗафиксироватьНеНайденныеДанные(ДокументОснование, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли; 	
	
	ТекИд 				= Неопределено;
	ТекЛицевойСчет		= Неопределено;
	ТекЗаводскойНомер	= Неопределено;
	ИдентификаторСтроки = Новый УникальныйИдентификатор();
	ТаблицаПриборов 	= ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказания;
	ТаблицаТарифнойЗоны = ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона;	
	
	ТаблицаПриборов.Очистить();
	ТаблицаТарифнойЗоны.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если НЕ ТекЛицевойСчет = Выборка.ЛицевойСчет ИЛИ НЕ ТекЗаводскойНомер = Выборка.ПорядковыйНомерПрибора ИЛИ НЕ ТекИд = Выборка.IDСтроки Тогда
			ИдентификаторСтроки = Новый УникальныйИдентификатор();			
			
			НСтрокаПрибора = ТаблицаПриборов.Добавить();
			ЗаполнитьЗначенияСвойств(НСтрокаПрибора, Выборка);
			НСтрокаПрибора.IDСтроки = ИдентификаторСтроки;
		КонецЕсли;
		
		НСтрокаТарифнойЗоны = ТаблицаТарифнойЗоны.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрокаТарифнойЗоны, Выборка);
		НСтрокаТарифнойЗоны.IDСтроки = ИдентификаторСтроки;
		
		ТекИд 				= Выборка.IDСтроки;
		ТекЛицевойСчет 		= Выборка.ЛицевойСчет;
		ТекЗаводскойНомер 	= Выборка.ПорядковыйНомерПрибора; 		
	КонецЦикла;
	
КонецПроцедуры

#Область ПриборыДляОтклоненияПоказаний

Функция ПриборыДляОтклоненияПоказаний(Период, Организация, ТаблицаПриборов, ВспомогательныеПараметры) Экспорт
	
	ВспомогательныеПараметры.ЭтоЗагрузкаПоказанийИзВнешнийИсточников = Истина;	
	//ВспомогательныеПараметры.ПроверятьЗапретПриемаВПУ = Ложь;	
	РезультатЗапроса = энргРаботаСПоказаниямиПриборовУчетаСервер.ПриборыДляОтклоненияПоказаний(Период, Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСДокументами

Процедура ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, ОчищатьТЧЛиста = Истина) 
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ВидОперации				= Перечисления.энргВидыОпераций.энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников;
	ЕстьНеЗагруженныеДанные	= ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказания.Количество() > 0; 	
	
	Примечание 			= ИмяСобытияОшибки();
	ИсточникПоказаний   = ДокументОснование.ИсточникПоказаний;
	сДокументОснование	= ДокументОснование.Ссылка;

	МенеджерыДокументов = Новый Соответствие;
    МенеджерыДокументов.Вставить(0, Документы.энргОбходнойЛист);
	МенеджерыДокументов.Вставить(1, Документы.энргОбходнойЛистМКД);
	//МенеджерыДокументов.Вставить(2, Документы.энргРегистрацияПоказанийМКД);
	
	ВыбораДатаПоказаний = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыбораДатаПоказаний.Следующий() Цикл 
		
		

		ОбходнойЛистОбъект	= Неопределено;
		ТекРайон 			= Неопределено;
		ТекИД 				= Неопределено;
		ТекТочкаУчета 		= Неопределено;
		ТекШкала 			= Неопределено;
		IDСтрокиТочки 		= Неопределено;
		IDСтрокиШкалы 		= Неопределено;		
		
		ДатаПоказаний 			= НачалоДня(ВыбораДатаПоказаний.ДатаПоказаний);
		СвязанныеДокументыДаты 	= СвязанныеДокументы[ДатаПоказаний];
		
		Выборка = ВыбораДатаПоказаний.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ТекРайон = Выборка.Район Тогда 

				ОбходнойЛистОбъект = Неопределено;
				Если НЕ СвязанныеДокументыДаты = Неопределено Тогда
					ОбходнойЛистОбъект = СвязанныеДокументыДаты[Выборка.Район];
				КонецЕсли;					
				
				Если ОбходнойЛистОбъект = Неопределено Тогда 
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "ТипДокумента") Тогда
						МенеджерДокумента	= МенеджерыДокументов[Выборка.ТипДокумента];
						ОбходнойЛистОбъект	= МенеджерДокумента.СоздатьДокумент();
					Иначе
						ОбходнойЛистОбъект	= Документы.энргОбходнойЛист.СоздатьДокумент();
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(ОбходнойЛистОбъект, Выборка);
					ОбходнойЛистОбъект.Дата 				= ДатаПоказаний; //ДокументОснование.Дата;
					ОбходнойЛистОбъект.ВидОперации 			= ВидОперации;
					ОбходнойЛистОбъект.ИсточникПоказаний 	= ИсточникПоказаний;
					ОбходнойЛистОбъект.ДокументОснование 	= сДокументОснование;
					ОбходнойЛистОбъект.Примечание 			= Примечание;					
				Иначе
					Если ОчищатьТЧЛиста Тогда 
						ОбходнойЛистОбъект.ТочкиУчета.Очистить();
						ОбходнойЛистОбъект.ШкалыПриборовУчета.Очистить();
						ОбходнойЛистОбъект.ПоказанияПриборовУчета.Очистить();
					КонецЕсли;
				КонецЕсли;
				
				ТаблицаТочекУчета	= ОбходнойЛистОбъект.ТочкиУчета;
				ТаблицаШкалы       	= ОбходнойЛистОбъект.ШкалыПриборовУчета;
				ТаблицаПоказания	= ОбходнойЛистОбъект.ПоказанияПриборовУчета;
				ДокументыПроведения.Добавить(ОбходнойЛистОбъект);
			КонецЕсли; 			
			
			НоваяТочка = Ложь;
			//Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			Если НЕ ТекИД = Выборка.IDСтроки Тогда	
				энргОбщегоНазначения.ОчиститьДанныеПоказанийПоТочкеУчета(Выборка.IDСтроки, ТаблицаТочекУчета, ТаблицаШкалы, ТаблицаПоказания);
				
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= ОбходнойЛистОбъект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор(Выборка.IDСтроки);
				ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				//СтрокаТочкиУчета.КлючПомещения 		= Выборка.КлючПомещения;
				//СтрокаТочкиУчета.Абонент 			= Выборка.Абонент;
				//СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				//СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				//СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			КонецЕсли;
			
			Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= ОбходнойЛистОбъект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			КонецЕсли;
			
			СтрокаПоказаний 						= ОбходнойЛистОбъект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.ТекущиеПоказания 		= Выборка.ТекущиеПоказанияФайла;
			СтрокаПоказаний.ПоказанияПредоставлены	= Истина;
			
			ТекРайон 		= Выборка.Район;
			ТекИД 			= Выборка.IDСтроки;
			ТекТочкаУчета 	= Выборка.ТочкаУчета;
			ТекПрибор 		= Выборка.ПриборУчета;
			ТекШкала 		= Выборка.Шкала;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

#Область РаботаСОтработкойОшибок

Процедура ЗафиксироватьНайденныеДанныеПриИсправленииДанных(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, ОчищатьТЧЛиста = Истина) 
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	МенеджерПериода 	= Обработки.энргГраницыПериодаНачисленияМенеджер;
	МенеджерДокумента	= Документы.энргРегистрацияПоказанийАбонента;

	МенеджерыДокументов = Новый Соответствие;
    МенеджерыДокументов.Вставить(0, Документы.энргРегистрацияПоказанийАбонента);
	МенеджерыДокументов.Вставить(1, Документы.энргРегистрацияПоказанийМКД);

	
	Примечание 			= "Создан автоматически при исправлении данных";
	ИсточникПоказаний   = ДокументОснование.ИсточникПоказаний;
	сДокументОснование	= ДокументОснование.Ссылка;
	
	ВыбораДатаПоказаний = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыбораДатаПоказаний.Следующий() Цикл 		
		
		ТекТочкаУчета 		= Неопределено;
		ТекШкала 			= Неопределено;
		IDСтрокиТочки 		= Неопределено;
		IDСтрокиШкалы 		= Неопределено;		
		ДатаПоказаний 		= НачалоДня(ВыбораДатаПоказаний.ДатаПоказаний);	
		
		Выборка = ВыбораДатаПоказаний.Выбрать();
		Пока Выборка.Следующий() Цикл	 			
			
			НоваяТочка = Ложь;
			Если НЕ ТекТочкаУчета = Выборка.IDСтроки Тогда
				
				ПериодНачисления = МенеджерПериода.ОпределитьПериодНачисления(ДатаПоказаний, Выборка.Организация, Выборка.Район);
				НоваяТочка = Истина;
				//энргОбщегоНазначения.ОчиститьДанныеПоказанийПоТочкеУчета(Выборка.IDСтроки, ТаблицаТочекУчета, ТаблицаШкалы, ТаблицаПоказания);
				
				МенеджерДокумента	= МенеджерыДокументов[Выборка.ТипДокумента];
				
				ДокументОбъект = МенеджерДокумента.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
				ДокументОбъект.Дата 			 = ДатаПоказаний;
				ДокументОбъект.ПериодНачисления	 = ПериодНачисления;
				ДокументОбъект.Примечание		 = Примечание;
				ДокументОбъект.ДокументОснование = сДокументОснование;
				ДокументОбъект.ИсточникПоказаний = ИсточникПоказаний;
				ДокументыПроведения.Добавить(ДокументОбъект); 				
				
				СтрокаТочкиУчета  					= ДокументОбъект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Выборка.IDСтроки;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
				
			КонецЕсли;
			
			Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
				
				СтрокаШкалы  						= ДокументОбъект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
				
			КонецЕсли;
			
			СтрокаПоказаний 						= ДокументОбъект.ПоказанияПриборовУчета.Добавить();
			//СтрокаПоказаний.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.ТекущиеПоказания 		= Выборка.ТекущиеПоказанияФайла;
			СтрокаПоказаний.ПоказанияПредоставлены	= Истина;
			
			ТекТочкаУчета 	= Выборка.IDСтроки;			
			ТекШкала 		= Выборка.Шкала;
			
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПрочитатьПредыдущиеПоказанияПриИсправленииДанных(ДокументОбъект, ВспомогательныеПараметрыДляОтклонения)
	
	ТаблицаПоказанийДляЗаполнения 		= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(ДокументОбъект.Организация, ДокументОбъект.ТочкиУчета, ДокументОбъект.ШкалыПриборовУчета, ДокументОбъект.ПоказанияПриборовУчета, ДокументОбъект.Район, ДокументОбъект.КлючПомещения);
	РезультатДанныеЗаполненияПоказаний 	= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(ДокументОбъект.Организация, ДокументОбъект.Район, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.Дата);
	
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.ПоказанияПриборовУчета);
	Для Каждого СтрокаПоказаний из ДокументОбъект.ПоказанияПриборовУчета Цикл
		СтрокаПоказаний.ПоказанияПредоставлены = Истина;	
	КонецЦикла;
	
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказанийПриИсправленииДанных(ДокументОбъект, РезультатДанныеЗаполненияПоказаний, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.ПоказанияПриборовУчета, ВспомогательныеПараметрыДляОтклонения);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказанийПриИсправленииДанных(ДокументОбъект, РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения, ТабличнаяЧасть, ВспомогательныеПараметрыДляОтклонения)
	
	ТаблицаПриборов = НоваяТаблицаПриборовДляПроверки();
	НомерСтроки = 1;
	Для Каждого ТекСтрока из ДокументОбъект.ТочкиУчета Цикл
		НСтрока = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		НСтрока.Район 			= ДокументОбъект.Район;
		НСтрока.КлючПомещения 	= ДокументОбъект.КлючПомещения;
		НСтрока.НомерСтроки	 	= НомерСтроки;
		НСтрока.IDСтроки		= ТекСтрока.IDСтроки;
		НомерСтроки = НомерСтроки+1;
	КонецЦикла;
	
	ПериодЗапроса = Новый Граница(ДокументОбъект.Дата, ВидГраницы.Исключая);	
	//РезультатЗапроса = Обработки.рксИнтеграцияСМобильнымПриложениемКонтролера.ПриборыДляОтклоненияПоказаний(ПериодЗапроса, ДокументОбъект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	РезультатЗапроса = ПриборыДляОтклоненияПоказаний(ПериодЗапроса, ДокументОбъект.Организация, ТаблицаПриборов, ВспомогательныеПараметрыДляОтклонения);
	ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатЗапроса, ДокументОбъект, ТаблицаПриборов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Функция ПровестиМодифицированныеДокументы(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры)
	
	Результат = Новый Структура("Статус", Истина);
	НаборыЗаписей = ПодготовитьНаборыЗаписей(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры);
	
	МенеджерыРегистров = Новый Структура;
	МенеджерыРегистров.Вставить("ТочкиУчета", РегистрыСведений.энргЗагрузкаПоказанийТочкиУчета);
	МенеджерыРегистров.Вставить("ШкалыПриборовУчета", РегистрыСведений.энргЗагрузкаПоказанийШкалыПриборовУчета);
	МенеджерыРегистров.Вставить("ПоказанияПриборовУчета", РегистрыСведений.энргЗагрузкаПоказанийПоказанияПриборовУчета);
	
	НачатьТранзакцию();	
	Попытка
		
		ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, "ТочкиУчета");
		ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, "ШкалыПриборовУчета");
		ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, "ПоказанияПриборовУчета");
		
		Для Каждого СтрокаНабора из НаборыЗаписей Цикл
			
			ТаблицыЗаписи = СтрокаНабора.Значение;
			
			ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, "ТочкиУчета");
			ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, "ШкалыПриборовУчета");
			ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, "ПоказанияПриборовУчета");		
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию(); 	
		
		Результат.Статус = Ложь;
		ИнфаОбОшибке 									= ИнформацияОбОшибке();
		ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
		ПараметрыЖурнала.ТекстПользователю 				= "Не удалось провести документы по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка показаний", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьНаборыЗаписей(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры)
	
	Результат = Новый Соответствие;
	Итерация = 1;
	ОписаниеТипа = Новый ОписаниеТипов("ДокументСсылка.энргЗагрузкаПоказанийИзВнешнихИсточников");
	ОписаниеТипаОрг = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ОписаниеТипаРайон = Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности");
	ОписаниеТипаДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
	
	МенеджерПериода = Обработки.энргГраницыПериодаНачисленияМенеджер;
	
	Для Каждого ТекДокументОбъект Из ДокументыПроведения Цикл
		ДокументОбъект = ТекДокументОбъект;
		ДокументОбъект.ПериодНачисления = МенеджерПериода.ОпределитьПериодНачисления(ДокументОбъект.Дата, ДокументОбъект.Организация, ДокументОбъект.Район);
		ПрочитатьПредыдущиеПоказания(ДокументОбъект, ВспомогательныеПараметры);
		
		СрокаДанных = Новый Структура;
		СрокаДанных.Вставить("ТочкиУчета", ДокументОбъект.ТочкиУчета.Выгрузить());
		СрокаДанных.ТочкиУчета.Колонки.Добавить("ДокументОснование", ОписаниеТипа);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("Организация", ОписаниеТипаОрг);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("Район", ОписаниеТипаРайон);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("ДатаДокумента", ОписаниеТипаДата);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("ПериодНачисления", ОписаниеТипаДата);
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОснование.Организация, "Организация");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОснование.Район, "Район");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОснование.Ссылка, "ДокументОснование");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОбъект.ПериодНачисления, "ПериодНачисления");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОбъект.Дата, "ДатаДокумента");
		
		СрокаДанных.Вставить("ШкалыПриборовУчета", ДокументОбъект.ШкалыПриборовУчета.Выгрузить());
		СрокаДанных.ШкалыПриборовУчета.Колонки.Добавить("ДокументОснование", ОписаниеТипа);
		СрокаДанных.ШкалыПриборовУчета.ЗаполнитьЗначения(ДокументОснование.Ссылка, "ДокументОснование");
		
		СрокаДанных.Вставить("ПоказанияПриборовУчета", ДокументОбъект.ПоказанияПриборовУчета.Выгрузить());
		СрокаДанных.ПоказанияПриборовУчета.Колонки.Добавить("ДокументОснование", ОписаниеТипа);
		СрокаДанных.ПоказанияПриборовУчета.ЗаполнитьЗначения(ДокументОснование.Ссылка, "ДокументОснование"); 
		
		Результат.Вставить("Набор" + Итерация, СрокаДанных);
		Итерация = Итерация + 1;
		//ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Процедура ПрочитатьПредыдущиеПоказания(ДокументОбъект, ВспомогательныеПараметры)
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.энргОбходнойЛист") Тогда 
		ТаблицаПоказанийДляЗаполнения 		= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(ДокументОбъект.Организация, ДокументОбъект.ТочкиУчета, ДокументОбъект.ШкалыПриборовУчета, ДокументОбъект.ПоказанияПриборовУчета, ДокументОбъект.Район);
		РезультатДанныеЗаполненияПоказаний 	= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(ДокументОбъект.Организация, ДокументОбъект.Район, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.Дата);
		
		энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.ПоказанияПриборовУчета, ВспомогательныеПараметры);
		ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ДокументОбъект,РезультатДанныеЗаполненияПоказаний, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.ПоказанияПриборовУчета, ВспомогательныеПараметры);
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.энргОбходнойЛистМКД") Тогда  
		энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(ДокументОбъект.ТочкиУчета,ДокументОбъект.ШкалыПриборовУчета,ДокументОбъект.ПоказанияПриборовУчета,ДокументОбъект.Дата,ДокументОбъект.Организация,ДокументОбъект.Район,Неопределено,Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ДокументОбъект, РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения, ТабличнаяЧасть, ВспомогательныеПараметры)
	

	ТаблицаПриборов = НоваяТаблицаПриборовДляПроверки();
	НомерСтроки = 1;
	Для Каждого ТекСтрока из ДокументОбъект.ТочкиУчета Цикл
		НСтрока = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		НСтрока.Район 			= ДокументОбъект.Район;
		НСтрока.КлючПомещения 	= ТекСтрока.КлючПомещения;
		НСтрока.НомерСтроки	 	= НомерСтроки;
		НСтрока.IDСтроки		= ТекСтрока.IDСтроки;
		НомерСтроки = НомерСтроки+1;
	КонецЦикла;
	
	ПериодЗапроса = Новый Граница(ДокументОбъект.Дата, ВидГраницы.Исключая);
	//РезультатЗапроса = Обработки.рксИнтеграцияСМобильнымПриложениемКонтролера.ПриборыДляОтклоненияПоказаний(ПериодЗапроса, ДокументОбъект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	РезультатЗапроса = ПриборыДляОтклоненияПоказаний(ПериодЗапроса, ДокументОбъект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатЗапроса, ДокументОбъект, ТаблицаПриборов);
	
КонецПроцедуры

Функция НоваяТаблицаПриборовДляПроверки()
	
	Результат = энргРаботаСПоказаниямиПриборовУчетаСервер.НоваяТаблицаПриборовДляПроверки();
	Результат.Колонки.Добавить("НомерСтроки"	, Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("IDСтроки"		, Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	Возврат Результат;
	
КонецФункции 

Процедура ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатЗапроса,ДокументОбъект,ТаблицаПриборов)
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		СтрокаТочкиУчета 	= ТаблицаПриборов[Выборка.НомерСтроки -1].IDСтроки;		
		СтрокиШкал 			= ДокументОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета));		
		СтрокиПоказаний 	= ДокументОбъект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокиШкал[0].IDСтроки));
		
		Если Выборка.IDСтроки =  СтрокаТочкиУчета тогда
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл 			
				СтрокаПоказаний.СостояниеПоказаний = Выборка.СостояниеПоказаний;
				СтрокаПоказаний.ПричинаОтклонения  = Выборка.ПричинаОтклонения;			
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

#Область РаботаСРегистрами

Процедура ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, ИмяНабора)
	
	Набор = МенеджерыРегистров[ИмяНабора].СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);	
	Набор.Отбор.ДокументОснование.Установить(ДокументОснование.Ссылка);	
	Набор.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, ИмяНабора)
	
	Набор = МенеджерыРегистров[ИмяНабора].СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.Загрузить(ТаблицыЗаписи[ИмяНабора]); 
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

Функция ИмяСобытияОшибки()
	
	Возврат "Загрузка показаний";
	
КонецФункции

#Область РазборОчередиПоказаний

Процедура ЗаписатьДокументРегистрацииПоказаний(ПараметрыЗаписи, ДокументОбъект)
	
	НаборТочек = ПараметрыЗаписи.МенеджерТочек.СоздатьНаборЗаписей();
	НаборТочек.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборТочек.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборТочек.Отбор.IDСтроки.Установить(ПараметрыЗаписи.ИдентификаторТочки);
	
	НаборШкал = ПараметрыЗаписи.МенеджерШкал.СоздатьНаборЗаписей();
	НаборШкал.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборШкал.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборШкал.Отбор.IDСтрокиТочкиУчета.Установить(ПараметрыЗаписи.ИдентификаторТочки);
	
	НаборПоказаний = ПараметрыЗаписи.МенеджерПоказаний.СоздатьНаборЗаписей();
	НаборПоказаний.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборПоказаний.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборПоказаний.Отбор.IDСтрокиТочкиУчета.Установить(ПараметрыЗаписи.ИдентификаторТочки);	
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НаборТочек.Записать();	
		НаборШкал.Записать();
		НаборПоказаний.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию(); 
		
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"Создание показаний при загрузке показаний", 
		УровеньЖурналаРегистрации.Ошибка,,,
		"Идентификатор точки: " + ПараметрыЗаписи.ИдентификаторТочки + " причина: " + ПодробноеПредставлениеОшибки(Инфо));	
		
	КонецПопытки;
	
КонецПроцедуры

Функция ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, Идентификаторы)
	
	Шаблон = "ru = '%1'";
	НаимДок = "Создание регистрации показаний. Основание: " + ДокументОснование;
	ИмяФункции = "энргРаботаСПоказаниямиПриборовУчетаСервер.ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр(СтрШаблон(Шаблон, НаимДок));
	//ПараметрыВыполнения.КлючФоновогоЗадания = УникальныйИдентификатор;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
	ПараметрыВыполнения, 
	ИмяФункции,
	ДокументОснование,
	Идентификаторы);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли