#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Результат = ПолучитьДанныеДляПроведения();
		
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(Результат,	Движения.бестТарифыНаПередачуЭлектроэнергии);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергии.Дата КАК Период,
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергии.Организация КАК Организация,
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергииЗначения.Услуга КАК Услуга,
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергииЗначения.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергииЗначения.НДСВнутри КАК НДСВнутри,
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергииЗначения.Значение КАК Значение,
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергииЗначения.КатегорияНапряжения КАК КатегорияНапряжения,
	      		  |	ЕСТЬNULL(энргЗоныОтвественности.Ссылка, бестИзменитьТарифНаПередачуЭлектроэнергии.Район) КАК Район
	      		  |ИЗ
	      		  |	Документ.бестИзменитьТарифНаПередачуЭлектроэнергии.Значения КАК бестИзменитьТарифНаПередачуЭлектроэнергииЗначения
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьТарифНаПередачуЭлектроэнергии КАК бестИзменитьТарифНаПередачуЭлектроэнергии
	      		  |		ПО бестИзменитьТарифНаПередачуЭлектроэнергииЗначения.Ссылка = бестИзменитьТарифНаПередачуЭлектроэнергии.Ссылка
				  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	      		  |		ПО (бестИзменитьТарифНаПередачуЭлектроэнергии.Район = ЗНАЧЕНИЕ(Справочник.энргЗоныОтвественности.ПустаяСсылка))
				  |ГДЕ
	      		  |	бестИзменитьТарифНаПередачуЭлектроэнергии.Ссылка = &Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли