#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет значения измерителей точек учета действующих точек.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначенияИзмерителейТочекУчетаДействующихТочек(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	ЕстьДействующиеТочки 			= Ложь;
	Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
		Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочки" Тогда
			ЕстьДействующиеТочки 	= Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если НЕ ЕстьДействующиеТочки Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияИзмерителейТочекУчета());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
				
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначенияИзмерителейТочекУчета()
	Текст =
	"ВЫБРАТЬ
	|	энргЗначенияИзмерителейТочекУчетаСрезПоследних.Организация КАК Организация,
	|	энргЗначенияИзмерителейТочекУчетаСрезПоследних.Район КАК Район,
	|	энргЗначенияИзмерителейТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргЗначенияИзмерителейТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргЗначенияИзмерителейТочекУчетаСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргЗначенияИзмерителейТочекУчетаСрезПоследних.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.энргЗначенияИзмерителейТочекУчета.СрезПоследних(
	|			&Период,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						ДействующиеТочки.Организация,
	|						ДействующиеТочки.Район,
	|						ДействующиеТочки.КлючПомещения,
	|						ДействующиеТочки.ТочкаУчета
	|					ИЗ
	|						ДействующиеТочки КАК ДействующиеТочки)) КАК энргЗначенияИзмерителейТочекУчетаСрезПоследних";
	
	Возврат Текст;
		
КонецФункции

#КонецОбласти

#КонецЕсли