#Область ОбработчикиСобытий

&НаСервере
Функция СформироватьОтчет()
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет 		= ОтчетОбъект.ПолучитьМакет("ИсковоеЗаявление");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Дата 			= Формат(Документ.Дата,"ДФ=dd.MM.yyyy"); 
	ОбластьШапка.Параметры.Район 			= Документ.Район;//?(Документ.Район = ЗначениеЗАполнено(Документ.Район),Документ.Район,""); 
	ОбластьШапка.Параметры.Номер 			= Документ.Номер; 
	ОбластьШапка.Параметры.Поставщик 		= Документ.Организации; 
	ОбластьШапка.Параметры.Абонент 			= Документ.Абонент; 
	ОбластьШапка.Параметры.Адрес 			= Документ.АдресОбъекта; 
	ОбластьШапка.Параметры.Сумма 			= Документ.СуммаЗадолженности; 
	ОбластьШапка.Параметры.Банк 			= Документ.Поставщик.ОсновнойБанковскийСчет.Банк; 
	ОбластьШапка.Параметры.БИК 				= Документ.Поставщик.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьШапка.Параметры.КПП 				= Документ.Поставщик.КПП;
	
	Если ЗначениеЗаполнено(Должность) Тогда
		Сотрудник = РегистрыСведений.энргРуководителиОрганизации.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Организация,Должность",Документ.Поставщик,Должность)).ФИОСотрудника;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните должность, чтобы узнать кто является представителем от организации");
		Сотрудник = "";
	КонецЕсли;
	
	// ОбластьШапка.Параметры.Руководитель 	= Документ.Поставщик.Сотрудник;
	
	ОбластьШапка.Параметры.Руководитель 	= Сотрудник;	
	ОбластьШапка.Параметры.РС 				= Документ.Поставщик.ОсновнойБанковскийСчет;  
	ОбластьШапка.Параметры.КС 				= Документ.Поставщик.ОсновнойБанковскийСчет.Банк.КоррСчет;
	ОбластьШапка.Параметры.ИНН 				= Документ.Поставщик.ИНН;                           
	
	Адрес = "";
	
	Для каждого Стр из Документ.Поставщик.КонтактнаяИнформация Цикл
		Если Стр.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации Тогда
			Адрес = Стр.Представление;
		КонецЕсли;
	КонецЦикла;
	
	
	ОбластьШапка.Параметры.АдресПоставщика 	= Адрес;	
	
	ТабДок.Вывести(ОбластьШапка);
	
	Возврат ТабДок
	
	
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ЗначениеЗаполнено(Документ) Тогда
		СформироватьОтчет().Показать();
	Иначе
		Предупреждение("Выберите документ!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти