#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеНачисленийЗаПериод(Знач Организация,Знач Район,Знач ПериодНачисления, Знач НачПериода,Знач КонПериода,Знач тзРасшифровка, Знач тзПомещения, Ссылка = Неопределено) Экспорт 
		
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Распределение"	, Ложь);
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("НачалоПериода"	, НачПериода);
	//ПараметрыЗапроса.Вставить("КонецПериода", 	?(НачалоМесяца(КонПериода) = ПериодНачисления,НачалоМесяца(КонПериода)-1,КонецМесяца(КонПериода))); Было
	ПараметрыЗапроса.Вставить("КонецПериода"	, КонПериода);
	ПараметрыЗапроса.Вставить("Расшифровка"		, тзРасшифровка); 	
	ПараметрыЗапроса.Вставить("КлючиПомещений"	, тзПомещения.ВыгрузитьКолонку("КлючПомещения"));
	ПараметрыЗапроса.Вставить("Регистратор"		, Ссылка);
	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,Распределение","Организация","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("ПериодНачисления", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипМеньшеРавно(Новый Структура("ПериодНачисления","КонецПериода")));

	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	Если Ссылка <> Неопределено Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипНеРавно(Новый Структура("Регистратор","Регистратор")));
	КонецЕсли;
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	Схема 				= Неопределено;
	РегистрыНакопления.энргОбъемНачислений.ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы, "НаборЗаписейПоОрганизации"); 
	  	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район,Распределение","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("ПериодНачисления", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипМеньшеРавно(Новый Структура("ПериодНачисления","КонецПериода")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	Если Ссылка <> Неопределено Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипНеРавно(Новый Структура("Регистратор","Регистратор")));
	КонецЕсли;
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	РегистрыНакопления.энргОбъемНачислений.ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы, "НаборЗаписейБезОрганизации");
		
	ЗаполнитьСхемуДанныеРасшифровки(Схема,"Расшифровка");
	ЗаполнитьСхемуУслугиТочекДругихОрганизаций(Схема,"НачислениеПоПлательщикам");
	Пакет 				= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеНачисленийЗаПериод());
		
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
	
КонецФункции

Функция ДанныеРаспределенияЗаПериод(Знач Организация,Знач Район,Знач ПериодНачисления, Знач НачПериода,Знач КонПериода, Знач тзПомещения, АбонентСтарый) Экспорт 
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Распределение"	, Истина);
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("НачалоПериода"	, НачПериода);
	ПараметрыЗапроса.Вставить("КонецПериода"	, КонПериода);
	ПараметрыЗапроса.Вставить("КлючиПомещений"	, тзПомещения.ВыгрузитьКолонку("КлючПомещения"));
	ПараметрыЗапроса.Вставить("Абоненты"		, АбонентСтарый);
	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,Распределение","Организация","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("Абонент","Абоненты")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	Схема 				= Неопределено;
	РегистрыНакопления.энргОбъемНачислений.ЗаполнитьСхемуНаборомЗаписейРаспределенияПоКлючуПомещения(Схема,ПараметрыСхемы, "НаборЗаписейПоРаспределению"); 
	  	
	Пакет 				= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеРаспределенияЗаПериод());
		
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
	
КонецФункции

Функция ДанныеНачисленныйСреднийЗаПериод(Знач Организация,Знач Район, Знач ПериодНачисления, Знач НачПериода,Знач КонПериода, Знач тзПомещения, Ссылка = Неопределено) Экспорт 
	ПараметрыЗапроса  		= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район);
	ПараметрыЗапроса.Вставить("КлючиПомещений"	, тзПомещения.ВыгрузитьКолонку("КлючПомещения"));
	ПараметрыЗапроса.Вставить("НачалоПериода"	, НачПериода);
	//ПараметрыЗапроса.Вставить("КонецПериода", 	?(НачалоМесяца(КонПериода) = ПериодНачисления,НачалоМесяца(КонПериода)-1,КонецМесяца(КонПериода))); Было
	ПараметрыЗапроса.Вставить("КонецПериода"	, КонПериода);
	ПараметрыЗапроса.Вставить("Регистратор"		, Ссылка);
	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,Распределение","Организация","Район","Распределение")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
	Если Ссылка <> Неопределено Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипНеРавно(Новый Структура("Регистратор","Регистратор")));
	КонецЕсли;
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	Схема 			= Неопределено;
	РегистрыНакопления.энргНачисленныйСреднийОбъем.ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы, "ДействующиеТочки");
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Период","КонецПериода")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	РегистрыСведений.энргРодительТочкиУчета.АктуальныеРодителиТочекУчета(Схема,ПараметрыСхемы, "РодителиТУ");
	
	Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеНачисленныйСреднийЗаПериод());
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСхемуДанныеРасшифровки(Схема, ТаблицаДляПомещения)
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаРасшифровкаНачислений());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения; 
	
КонецПроцедуры

Процедура ЗаполнитьСхемуУслугиТочекДругихОрганизаций(Схема, ТаблицаДляПомещения)
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаУслугиТочекДругихОрганизаций());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения; 
	
КонецПроцедуры

Функция ТекстЗапросаРасшифровкаНачислений()
	
	Текст = 
	"ВЫБРАТЬ
	|	Расшифровка.ТочкаУчета КАК ТочкаУчета,
	|	Расшифровка.Организация КАК Организация,
	|	Расшифровка.Услуга КАК Услуга
	|ИЗ
	|	&Расшифровка КАК Расшифровка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаУслугиТочекДругихОрганизаций()
	
	Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расшифровка.ТочкаУчета КАК ТочкаУчета,
	|	Расшифровка.Организация КАК Организация,
	|	Расшифровка.Услуга КАК Услуга	
	|ИЗ
	|	Расшифровка КАК Расшифровка
	|ГДЕ
	|	Расшифровка.Организация <> &Организация";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеНачисленийЗаПериод()
	
	Текст 	=
	"ВЫБРАТЬ
	|	НаборЗаписейПоОрганизации.*
	|ИЗ
	|	НаборЗаписейПоОрганизации КАК НаборЗаписейПоОрганизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборЗаписейБезОрганизации.*
	|ИЗ
	|	НаборЗаписейБезОрганизации КАК НаборЗаписейБезОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачислениеПоПлательщикам КАК НачислениеПоПлательщикам
	|		ПО НаборЗаписейБезОрганизации.Услуга = НачислениеПоПлательщикам.Услуга
	|			И НаборЗаписейБезОрганизации.Организация = НачислениеПоПлательщикам.Организация
	|			И НаборЗаписейБезОрганизации.ТочкаУчета = НачислениеПоПлательщикам.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачислений.Активность КАК Активность,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Распределение КАК Распределение,
	|	энргОбъемНачислений.Строение КАК Строение,
	|	энргОбъемНачислений.Помещение КАК Помещение,
	|	энргОбъемНачислений.КлючПомещения КАК КлючПомещения,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачислений.Измеритель КАК Измеритель,
	|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачислений.Шкала КАК Шкала,
	|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачислений.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	энргОбъемНачислений.ОбъемУслугиПотребленныйСоцНорма КАК ОбъемУслугиПотребленныйСоцНорма,
	|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачислений.Сумма КАК Сумма,
	|	энргОбъемНачислений.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	энргОбъемНачислений.СуммаСниженияСтоимости КАК СуммаСниженияСтоимости,
	|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачислений.ВидПлощади КАК ВидПлощади,
	|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачислений.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления,
	|	энргОбъемНачислений.ЕстьСреднийПоВсемТочкамУслуги КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачислений.ВладелецЗависимойТочкиУчета КАК ВладелецЗависимойТочкиУчета,
	|	энргОбъемНачислений.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачислений.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	энргОбъемНачислений.ЗначениеСоциальнойНормыРасчетныйСпособ КАК ЗначениеСоциальнойНормыРасчетныйСпособ,
	|	энргОбъемНачислений.ЗначениеТарифаРЭК КАК ЗначениеТарифаРЭК,
	|	энргОбъемНачислений.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	энргОбъемНачислений.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	энргОбъемНачислений.КлючНорматива КАК КлючНорматива,
	|	энргОбъемНачислений.КлючСоцНорматива КАК КлючСоцНорматива,
	|	энргОбъемНачислений.КоличествоИзмеретелейНаправления КАК КоличествоИзмеретелейНаправления,
	|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачислений.КоэффициентНорматива КАК КоэффициентНорматива,
	|	энргОбъемНачислений.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачислений.КоэффициентСезоности КАК КоэффициентСезоности,
	|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
	|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачислений.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	энргОбъемНачислений.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачислений.СоциальнаяНормаПотребления КАК СоциальнаяНормаПотребления,
	|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачислений.Техническая КАК Техническая,
	|	энргОбъемНачислений.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	энргОбъемНачислений.УдалитьКлючПомещения КАК УдалитьКлючПомещения,
	|	энргОбъемНачислений.УдалитьНеПрименятьСезонность КАК УдалитьНеПрименятьСезонность,
	|	энргОбъемНачислений.ФизЛицо КАК ФизЛицо,
	|	энргОбъемНачислений.ПотериОбъем КАК ПотериОбъем,
	|	энргОбъемНачислений.ПотериПроцент КАК ПотериПроцент,
	|	энргОбъемНачислений.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	энргОбъемНачислений.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	энргОбъемНачислений.УслугаПолностьюОприборена КАК УслугаПолностьюОприборена,
	|	энргОбъемНачислений.ПоставщикиНеНачислять КАК ПоставщикиНеНачислять,
	|	энргОбъемНачислений.УслугаОграничена КАК УслугаОграничена,
	|	энргОбъемНачислений.ЭтоСторно КАК ЭтоСторно,
	|	энргОбъемНачислений.НомерСторнируемойСтроки КАК НомерСторнируемойСтроки,
	|	энргОбъемНачислений.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП,
	|	энргОбъемНачислений.КоличествоДнейИспользованияУслуги КАК КоличествоДнейИспользованияУслуги,
	|	энргОбъемНачислений.ОбъемУслугиТехнический КАК ОбъемУслугиТехнический,
	|	энргОбъемНачислений.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		
	|ГДЕ
	|	энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет
	|	И энргОбъемНачислений.Организация = &Организация
	|	И энргОбъемНачислений.Район = &Район
	|	И энргОбъемНачислений.Распределение = &Распределение
	|	И (энргОбъемНачислений.Период < &НачалоПериода)
	//|			ИЛИ ОбъемНачислений.Период > &КонецПериода)
	|	И энргОбъемНачислений.КлючПомещения В(&КлючиПомещений)
	|	И энргОбъемНачислений.ПериодНачисления МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргОбъемНачислений.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)";
	Возврат Текст;

КонецФункции

Функция ТекстЗапросаДанныеРаспределенияЗаПериод()
	
	Текст 	=
	"ВЫБРАТЬ
	|	НаборЗаписейПоРаспределению.*
	|ИЗ
	|	НаборЗаписейПоРаспределению КАК НаборЗаписейПоРаспределению
	|";
	Возврат Текст;

КонецФункции

Функция ТекстЗапросаДанныеНачисленныйСреднийЗаПериод()
	
	Текст 	=
	"ВЫБРАТЬ
	|	ДействующиеТочки.*,
	|	ЕСТЬNULL(РодителиТУ.РодительТочкиУчета,ДействующиеТочки.ТочкаУчета) КАК ТочкаУчетаСУчетомРодителя,
	|	ВЫБОР
	|		КОГДА энргУслугиТочекУчетаСрезПоследних.Услуга.СоставнаяУслуга
	|			ТОГДА энргУслугиТочекУчетаСрезПоследних.Услуга
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|	КОНЕЦ КАК СоставнаяУслуга
	|ИЗ
	|	ДействующиеТочки КАК ДействующиеТочки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РодителиТУ КАК РодителиТУ
	|		ПО ДействующиеТочки.ТочкаУчета = РодителиТУ.ТочкаУчета 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|				&КонецПериода,
	|				(Организация, Район, КлючПомещения, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						ВТ.Организация,
	|						ВТ.Район,
	|						ВТ.КлючПомещения,
	|						ВТ.ТочкаУчета
	|					ИЗ
	|						ДействующиеТочки КАК ВТ)) КАК энргУслугиТочекУчетаСрезПоследних 
	|		ПО ДействующиеТочки.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета";
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецЕсли