#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Дата смены постановления. Было добавлено понятие диапазонов потребления
// 
// Возвращаемое значение:
// Дата  - Дата
//
Функция ДатаСменыПостановленияДобавлениеДиапазонов() Экспорт 
	
	Возврат Дата(2024, 7, 1);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДиапазонПоУмолчанию() Экспорт 
	
	Возврат Справочники.энргДиапазоныДифференцированныхТарифов.ДиапазонПоУмолчанию;
	
КонецФункции

Функция Дипазоны() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргДиапазоныДифференцированныхТарифов.Ссылка КАК Диапазон
		|ИЗ
		|	Справочник.энргДиапазоныДифференцированныхТарифов КАК энргДиапазоныДифференцированныхТарифов
		|ГДЕ
		|	НЕ энргДиапазоныДифференцированныхТарифов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	энргДиапазоныДифференцированныхТарифов.Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли