#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеДанных

Процедура АктуальныеФиксированныеОбъемыМКД(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	ТаблицаДляПоиска = "МКДСФиксированнымиОбъемами";
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргСостояниеФиксированныхОбъемовМКД.МКДСФиксированнымиОбъемами(Схема, ПараметрыОтбора, ТаблицаДляПоиска);
	Иначе	
		ЕстьДействующиеФиксОбъемы = Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = ТаблицаДляПоиска Тогда
				ЕстьДействующиеФиксОбъемы = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеФиксОбъемы Тогда 
			РегистрыСведений.энргСостояниеФиксированныхОбъемовМКД.МКДСФиксированнымиОбъемами(Схема, ПараметрыОтбора, ТаблицаДляПоиска);
		КонецЕсли;
	КонецЕсли;	
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеФиксированныеОбъемыМКД());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	ПараметрПериод 		= Параметры[0];
	ДоступныеПараметры	= "Организация,Район,МКД,Услуга";
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса("");
	Иначе 
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;		
		
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанных

Функция ТекстЗапросаАктуальныеФиксированныеОбъемыМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргФиксированныеОбъемыМКДСрезПоследних.Организация КАК Организация,
	|	энргФиксированныеОбъемыМКДСрезПоследних.Район КАК Район,
	|	энргФиксированныеОбъемыМКДСрезПоследних.МКД КАК МКД,
	|	энргФиксированныеОбъемыМКДСрезПоследних.Услуга КАК Услуга,
	|	энргФиксированныеОбъемыМКДСрезПоследних.ОбъемПотребления КАК ОбъемПотребления
	|ИЗ
	|	РегистрСведений.энргФиксированныеОбъемыМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, Услуга) В
	|				(ВЫБРАТЬ
	|					МКДСФиксированнымиОбъемами.Организация,
	|					МКДСФиксированнымиОбъемами.Район,
	|					МКДСФиксированнымиОбъемами.МКД,
	|					МКДСФиксированнымиОбъемами.Услуга
	|				ИЗ
	|					МКДСФиксированнымиОбъемами КАК МКДСФиксированнымиОбъемами)) КАК энргФиксированныеОбъемыМКДСрезПоследних";
	
	Возврат Текст;
	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#КонецЕсли




