#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 	
	
	ГраницыПериода  			= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата 					= ГраницыПериода.ЗавершениеОП -1;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ГраницыПериода", ГраницыПериода);
	
	Ответственный 				= Пользователи.ТекущийПользователь();
			
	Инструменты  				= энргФабрикаИнструментовНачисления.РаботаСПериодомДействия();			
	Если Инструменты = Неопределено тогда 		
		Отказ 					= истина;
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	РезультатПоследовательность = Инструменты.ПоследовательностьНарушена(ПериодНачисления,Район);
	ПоследовательностьНарушена 	= НЕ РезультатПоследовательность.Пустой();

	Если ПоследовательностьНарушена Тогда
		Отказ 					= истина;
		Выборка  				= РезультатПоследовательность.Выбрать();
		ТекстОшибки 			= "Не выполнены следующие операции:
		|";
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = ТекстОшибки + Выборка.ВидОперации + Символы.ПС;
		КонецЦикла;		
		ТекстОшибки 			= ТекстОшибки + "закрытие периоды не выполнено";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли