#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполнить табличную часть активными услугами.
//
Процедура ЗаполнитьАктивнымиУслугами() Экспорт	
	ПроцентРаспределения.Очистить();
	
	АктивныеУслуги 	= ПолучитьАктивныеУслуги();
	Выборка	 		= АктивныеУслуги.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ПроцентРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
	ПроцентРаспределения.Свернуть("Услуга");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("Строение", МКД);
	
	Документы.энргУстановитьПроцентРаспределенияОтрицательногоОДН.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	Документы.энргУстановитьПроцентРаспределенияОтрицательногоОДН.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьАктивныеУслуги()  
	
	Схема 			= новый СхемаЗапроса;  	
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("МКД", 			"МКД"), 			Неопределено));
			
	Параметры 	= Новый Структура;	
	Параметры.Вставить("ПараметрыВТ", 	ПараметрыВТ);
	Параметры.Вставить("Период",  		Новый Структура("ИмяПараметра", "Период"));
			
	РегистрыСведений.энргУслугиТочекУчетаМКД.УслугиДействующихТочек(Схема, Параметры);	
	
	Запрос  	= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Период",					Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район); 	
	Запрос.УстановитьПараметр("МКД",					МКД);
		
	Результат  	= Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли