
#Область СтандартныеПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	Структура = Новый Структура;
	для Каждого стр из СоставНастроек цикл
		Структура.Вставить(стр.Настройка,стр.Значение);
	КонецЦикла;
	ОповеститьОВыборе(Структура);
КонецПроцедуры

&НаКлиенте
Процедура СоставНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипЗнч(НастройкиОтчета)  = Тип("Структура") тогда
		для Каждого  стр из НастройкиОтчета цикл
			Строка = СоставНастроек.Добавить();
			Строка.Настройка =  стр.ключ;
			Строка.Значение =  стр.Значение;
		КонецЦикла; 		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

