
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("Организация",			Параметры.Организация);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("Район",					Параметры.Район);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета",			Параметры.ОбъектРасчета);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("ГоловнаяТочкаУчета",	Параметры.ГоловнаяТочкаУчета);
	//ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("СписокТУ_ПоФормуле", Параметры.СписокТУ_ПоФормуле);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("Период",				Параметры.Период);
КонецПроцедуры
