#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

Процедура НастройкиРасчетовПриРегистрацииАктаНедопуска(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиРасчетовПриРегистрацииАктаНедопуска());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли; 		
КонецПроцедуры

Процедура НастройкиРасчетовПриРегистрацииАктаНедопускаКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаПериодов, ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиРасчетовПриРегистрацииАктаНедопускаКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	//ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	//Источник 						= ОператорВыбора.Источники[1].Источник;		
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаНастройкиРасчетовПриРегистрацииАктаНедопуска() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргНастройкиРасчетовПриРегистрацииАктаНедопуска.КоличествоПериодовНачисленийПоСреднему КАК КоличествоПериодовНачисленийПоСреднему,
	|	энргНастройкиРасчетовПриРегистрацииАктаНедопуска.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	|	энргНастройкиРасчетовПриРегистрацииАктаНедопуска.ПереходНаНормативПосле КАК ПереходНаНормативПосле
	|ИЗ
	|	РегистрСведений.энргНастройкиРасчетовПриРегистрацииАктаНедопуска.СрезПоследних КАК энргНастройкиРасчетовПриРегистрацииАктаНедопуска";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНастройкиРасчетовПриРегистрацииАктаНедопускаКоллекцияПериодов()
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаНастроек.КоличествоПериодовНачисленийПоСреднему КАК КоличествоПериодовНачисленийПоСреднему,
	|	ТаблицаНастроек.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	|	ТаблицаНастроек.ПереходНаНормативПосле КАК ПереходНаНормативПосле
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаНастроек.КоличествоПериодовНачисленийПоСреднему КАК КоличествоПериодовНачисленийПоСреднему,
	|		ТаблицаНастроек.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	|		ТаблицаНастроек.ПереходНаНормативПосле КАК ПереходНаНормативПосле,
	|		МАКСИМУМ(ТаблицаНастроек.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргНастройкиРасчетовПриРегистрацииАктаНедопуска КАК ТаблицаНастроек
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ТаблицаНастроек.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ТаблицаНастроек.КоличествоПериодовНачисленийПоСреднему,
	|		ТаблицаНастроек.ПовышающийКоэффициент,
	|		ТаблицаНастроек.ПереходНаНормативПосле) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиРасчетовПриРегистрацииАктаНедопуска КАК ТаблицаНастроек
	|		ПО ВложенныйЗапрос.Период = ТаблицаНастроек.Период";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли