#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  	= ГраницыПериода.ЗавершениеОП-1;
		
	Ответственный 			= Пользователи.ТекущийПользователь();	
			
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	//СторнируемыеЗаписи 	= ПолучитьСторнируемыеЗаписи();
	НовыеЗаписи			= ПолучитьНовыеЗаписи();
	
	//ЗаписатьВРегистрэнргНераспознаннаяОплатаФизЛица(СторнируемыеЗаписи);		
	ЗаписатьНовыеЗаписиВРегистры(НовыеЗаписи);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция ПолучитьСторнируемыеЗаписи()
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Организация", 		Организация);
//	Запрос.УстановитьПараметр("Район", 				Район);
//	Запрос.УстановитьПараметр("Период", 			?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
//	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
//	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
//	Запрос.Текст = "ВЫБРАТЬ
//	|	&Организация КАК Организация,
//	|	&Район КАК Район,
//	|	&Период КАК Период,
//	|	энргПереносОплатыИсточник.ИсточникПоступления КАК ИсточникПоступления,
//	|	энргПереносОплатыИсточник.НомерПлатежногоПоручения КАК НомерПлатежногоПоручения,
//	|	энргПереносОплатыИсточник.ДатаПлатежногоПоручения КАК ДатаПлатежногоПоручения,
//	|	энргПереносОплатыИсточник.СуммаОплаты КАК СуммаОплаты,
//	|	энргПереносОплатыИсточник.ФИОПлательщика КАК ФИОПлательщика,
//	|	энргПереносОплатыИсточник.НазначениеПлатежа КАК НазначениеПлатежа,
//	|	энргПереносОплатыИсточник.Абонент КАК Абонент,
//	|	энргПереносОплатыИсточник.ЛицевойСчет КАК ЛицевойСчет,
//	|	&ПериодНачисления КАК ПериодНачисления
//	|ИЗ
//	|	Документ.энргПереносОплаты.Источник КАК энргПереносОплатыИсточник
//	|ГДЕ
//	|	энргПереносОплатыИсточник.Ссылка = &Ссылка";
//	Результат = Запрос.Выполнить();
//	Выборка		= Результат.Выбрать();
//	
//	Возврат Выборка;
//КонецФункции


Функция ПолучитьНовыеЗаписи()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Период", 			?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.Текст = "ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&Период КАК Период,
	|	энргПереносОплатыПриемник.ИсточникПоступления КАК ИсточникПоступления,
	|	энргПереносОплатыПриемник.НомерПлатежногоПоручения КАК НомерПлатежногоПоручения,
	|	энргПереносОплатыПриемник.ДатаПлатежногоПоручения КАК ДатаПлатежногоПоручения,
	|	энргПереносОплатыПриемник.СуммаОплаты КАК СуммаОплаты,
	|	энргПереносОплатыПриемник.ФИОПлательщика КАК ФИОПлательщика,
	|	энргПереносОплатыПриемник.НазначениеПлатежа КАК НазначениеПлатежа,
	|	энргПереносОплатыПриемник.Абонент КАК Абонент,
	|	энргПереносОплатыПриемник.ЛицевойСчет КАК ЛицевойСчет,
	|	&ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргПереносОплаты.Приемник КАК энргПереносОплатыПриемник
	|ГДЕ
	|	энргПереносОплатыПриемник.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Возврат Выборка;	
КонецФункции

//Процедура ЗаписатьВРегистрэнргНераспознаннаяОплатаФизЛица(Таблица)
//	Пока Таблица.следующий() цикл
//		Запись 						= Движения.энргНераспознаннаяОплатаФизЛица.ДобавитьРасход();	
//		ЗаполнитьЗначенияСвойств(Запись,Таблица);
//	КонецЦикла;	
//КонецПроцедуры	

Процедура ЗаписатьНовыеЗаписиВРегистры(Таблица)
	Пока Таблица.следующий() цикл
		Запись 						= Движения.энргВзаиморасчеты.ДобавитьРасход();	
		ЗаполнитьЗначенияСвойств(Запись,Таблица);
		
		Запись 						= Движения.энргОплатаУслуг.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,Таблица);		
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли