#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочекУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.ОбъектРасчета.МКД КАК МКД,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	&ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ПоказанияТЧ
	|ИЗ
	|	Документ.бестРегистрацияПоказанийНПОбщий.ТочкиУчета КАК ТаблицаТочекУчета
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И ТаблицаТочекУчета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестМаксимальныеПоказанияСрезНП.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрезНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрезНП.МКД КАК МКД,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	бестМаксимальныеПоказанияСрезНП.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ДанныеИзСрезаМаксимальных
	|ИЗ
	|	РегистрСведений.бестМаксимальныеПоказанияСрезНП КАК бестМаксимальныеПоказанияСрезНП
	|ГДЕ
	|	бестМаксимальныеПоказанияСрезНП.ДокРегистратор = &Ссылка
	|	И НЕ (бестМаксимальныеПоказанияСрезНП.ОбъектРасчета, бестМаксимальныеПоказанияСрезНП.ПриборУчета) В
	|				(ВЫБРАТЬ
	|					ПоказанияТЧ.ОбъектРасчета КАК ОбъектРасчета,
	|					ПоказанияТЧ.ПриборУчета КАК ПриборУчета
	|				ИЗ
	|					ПоказанияТЧ КАК ПоказанияТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияТЧ.ПриборУчета КАК ПриборУчета,
	|	ПоказанияТЧ.ОбъектРасчета КАК ОбъектРасчета,
	|	ПоказанияТЧ.МКД КАК МКД,
	|	ПоказанияТЧ.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ПоказанияТЧ.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ПоказанияТЧ.Разделитель КАК Разделитель,
	|	ПоказанияТЧ.ПериодНачисления КАК ПериодНачисления,
	|	ЛОЖЬ КАК ИсключатьИзПоследовательности
	|ИЗ
	|	ПоказанияТЧ КАК ПоказанияТЧ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеИзСрезаМаксимальных.ПриборУчета,
	|	ДанныеИзСрезаМаксимальных.ОбъектРасчета,
	|	ДанныеИзСрезаМаксимальных.МКД,
	|	ДанныеИзСрезаМаксимальных.ВыводПрибораУчета,
	|	ДанныеИзСрезаМаксимальных.ИмяТабЧасти,
	|	ДанныеИзСрезаМаксимальных.Разделитель,
	|	ДанныеИзСрезаМаксимальных.ПериодНачисления,
	|	ИСТИНА
	|ИЗ
	|	ДанныеИзСрезаМаксимальных КАК ДанныеИзСрезаМаксимальных";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	ДополнительныеСвойства.Вставить("МассивОбъектовРасчета",Истина);
	ДополнительныеСвойства.Вставить("ОчищатьМаксимальныеПоказанияСрез",Истина);
	
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	ПроверитьСостояниеПоказаний();
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
					
	бестРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеПоказанийПриборовУчета(),Движения);
				
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПоказанийПриборовУчета()  	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	
	Запрос.Текст	= 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Шкала КАК Шкала,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТекущиеПоказания КАК Показание,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ВЫБОР
	|		КОГДА бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияКонтрольногоСъема)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КС,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Переворот КАК Переворот,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	&Период КАК ПериодРегистрации,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Разница КАК Разница
	|ИЗ
	|	Документ.бестРегистрацияПоказанийНПОбщий.ТочкиУчета КАК бестРегистрацияПоказанийНПОбщийТочкиУчета
	|ГДЕ
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();  	
КонецФункции 

Процедура ПроверитьСостояниеПоказаний()
	Для Каждого СтрокаТЧ из ТочкиУчета цикл
		Если СтрокаТЧ.СостояниеПоказаний = Перечисления.энргСостояниеПоказаний.Отклонены Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отклонены показания для прибора учета в строке №" + СтрокаТЧ.НомерСтроки);				
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли