#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда              

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 		= Пользователи.ТекущийПользователь();	
	ДополнительныеСвойства.Вставить("Кассир",				Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.Касса);
	ДополнительныеСвойства.Вставить("ДанныеОплаты",			Новый Структура("ПериодОплатыНачало,ПериодОплатыКонец,СуммаОплаты,Услуга,ЭтоОплата",ПериодОплатыНачало,ПериодОплатыКонец,СуммаОплаты,Справочники.энргВидыУслуг.ПустаяСсылка(),Истина));
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
					
	ПроведениеПриборыУчета();
	
	УменьшитьЗадолженностьАбонента(); 
		
	УменьшитьЗадолженностьПоРассрочке();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПриборыУчета()			
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеПоказанийПриборовУчета(),Движения);		
КонецПроцедуры

Процедура УменьшитьЗадолженностьАбонента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргКвитанция.Дата КАК Период,
	               |	энргКвитанция.Район КАК Район,
	               |	энргКвитанция.МКД КАК МКД,
	               |	энргКвитанция.Абонент КАК Абонент,
	               |	энргКвитанция.СуммаОплаты КАК Сумма,
	               |	энргКвитанция.Ответственный КАК Кассир,
	               |	энргКвитанция.ПериодНачисления КАК ПериодНачисления,
	               |	энргКвитанция.Организация КАК Организация
	               |ИЗ
	               |	Документ.энргКвитанция КАК энргКвитанция
	               |ГДЕ
	               |	энргКвитанция.Ссылка = &Ссылка
	               |	И энргКвитанция.СуммаОплаты > 0";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат 						= Запрос.Выполнить();
	Выборка		 					= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 		
		Запись 						= Движения.энргВзаиморасчеты.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);    
		
		// регистр сведений оплата услуг
		Запись						= Движения.энргИсторияОплаты.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.ДатаПлатежа			= Дата;
		Запись.СуммаПлатежа			= Выборка.Сумма;
		
		Запись 						= Движения.энргОплатаУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.ИсточникПоступления 	= Справочники.энргИсточникиПоступления.Касса;
	КонецЦикла;
	
КонецПроцедуры

Процедура УменьшитьЗадолженностьПоРассрочке()
	
	Если ОплатаОсновногоДолгаРассрочки > 0 тогда		
		Запись 							= Движения.энргЗадолженностьПоРассрочке.ДобавитьРасход();
		Запись.Период 					= Дата;
		Запись.Район 					= Район;
		Запись.Организация 				= Организация;
		Запись.МКД 						= МКД;
		Запись.Абонент 					= Абонент;
		Запись.СуммаЗадолженности 		= ОплатаОсновногоДолгаРассрочки;
	КонецЕсли;
	
	для Каждого стр из ОплатаПоРассрочке цикл
		Если стр.Оплачено > 0 тогда
			Запись 						= Движения.энргПроцентыПоРассрочке.ДобавитьРасход();
			Запись.Период 				= Дата;
			Запись.Район 				= Район;
			Запись.Организация 			= Организация;
			Запись.МКД 					= МКД;
			Запись.Абонент 				= Абонент;
			Запись.ПериодНачисления		= стр.ПериодНачисления;
			Запись.СуммаЗадолженности 	= стр.Оплачено; 
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета,
	|	ТАблицаПоказаний.ТарифнаяЗона,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргКвитанция.ПоказанияПриборовУчета КАК ТАблицаПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргКвитанция.ТочкиУчета КАК ТаблицаТочекУчета
	|		ПО ТАблицаПоказаний.IDСтроки = ТаблицаТочекУчета.IDСтроки
	|			И ТАблицаПоказаний.Ссылка = ТаблицаТочекУчета.Ссылка
	|			И (ТАблицаПоказаний.Ссылка = &ссылка)
	|			И (ТаблицаТочекУчета.Ссылка = &ссылка)
	|			И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());

	
КонецФункции

Функция ДанныеПоказанийПриборовУчета()  	
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Абонент",			Абонент);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				Дата);
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);
	Текст 		= 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	&Район КАК Район,
	|	&Организация КАК Организация,
	|	&Абонент КАК Абонент,
	|	ТаблицаПриборовУчета.ПриборУчета,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ЛОЖЬ КАК КС,
	|	ЛОЖЬ КАК Переворот,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ
	|ИЗ
	|	Документ.энргКвитанция.ТочкиУчета КАК ТаблицаПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргКвитанция.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ТаблицаПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ТаблицаПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПриборовУчета.Ссылка = &ссылка)
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
	|			И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
		
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить();  	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли