Процедура ПроверкаИстеченияСроковПоверки(ТекДата = Неопределено) Экспорт
	
	если ТекДата = Неопределено Тогда
		Период = КонецДня(ТекущаяДата());
	Иначе
		Период = ТекДата;
	КонецЕсли;
	
	МассивОрганизаций = ПолучитьСписокОрганизаций();
	
	Для Каждого ТекОрганизация Из МассивОрганизаций Цикл
		
		РезультатПакет 		= ДействующиеТочкиИИхПриборы(Период, ТекОрганизация);
		
		КоличествоПакетов 		= РезультатПакет.Количество();
		
		СоздатьДокументыИстеченияСрокаПоверки(Период, ТекОрганизация, РезультатПакет[КоличествоПакетов - 1]);
		
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьСписокОрганизаций()
	
	МассивОрганизаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОрганизаций.Добавить(Выборка.Организация);
	КонецЦикла;
	
	Возврат МассивОрганизаций;

КонецФункции

Функция ДействующиеТочкиИИхПриборы(Период, Организация) Экспорт 
	
	Схема			= Новый СхемаЗапроса;
	Параметры 		= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", "Организация")	, Неопределено));	
	
	Параметры.Вставить("Период"		, Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	энргСостояниеТочекУчета.ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры);
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВведенныеПриборыДействующихТочек.Организация КАК Организация,
		|	ВведенныеПриборыДействующихТочек.Район КАК Район,
		|	ВведенныеПриборыДействующихТочек.КлючПомещения КАК КлючПомещения,
		|	ВведенныеПриборыДействующихТочек.ТочкаУчета КАК ТочкаУчета,
		|	ВведенныеПриборыДействующихТочек.ПриборУчета КАК ПриборУчета,
		|	ОкончаниеСрокаПоверки.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
		|	ОкончаниеСрокаПоверки.ДатаОкончанияПоверки КАК ДатаОкончанияПоверки,
		|	энргАбоненты.Ссылка КАК Абонент,
		|	ОкончаниеСрокаПоверки.МежповерочныйИнтервал КАК МежповерочныйИнтервал
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДействующиеПриборыУчетаПомещения КАК ВведенныеПриборыДействующихТочек
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ДатыПоверокДействующихПриборовУчета.Организация КАК Организация,
		|				ДатыПоверокДействующихПриборовУчета.Район КАК Район,
		|				ДатыПоверокДействующихПриборовУчета.КлючПомещения КАК КлючПомещения,
		|				ДатыПоверокДействующихПриборовУчета.ПриборУчета КАК ПриборУчета,
		|				ДатыПоверокДействующихПриборовУчета.ДатаПоверки КАК ДатаПоверкиСчетчика,
		|				ВЫБОР
		|					КОГДА энргМаркиПриборовУчета.Ссылка ЕСТЬ NULL
		|						ТОГДА ДатыПоверокДействующихПриборовУчета.ДатаПоверки
		|					ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДатыПоверокДействующихПриборовУчета.ДатаПоверки, ГОД, энргМаркиПриборовУчета.МежповерочныйИнтервал), ДЕНЬ)
		|				КОНЕЦ КАК ДатаОкончанияПоверки,
		|				ЕСТЬNULL(энргМаркиПриборовУчета.МежповерочныйИнтервал, 0) КАК МежповерочныйИнтервал
		|			ИЗ
		|				ДатыПоверкиВведенныхПриборовДействующихТочек КАК ДатыПоверокДействующихПриборовУчета
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
		|							ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргМаркиПриборовУчета КАК энргМаркиПриборовУчета
		|							ПО энргТипыПриборовУчета.МаркаПУ = энргМаркиПриборовУчета.Ссылка
		|						ПО энргПриборыУчетаАбонента.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка
		|					ПО ДатыПоверокДействующихПриборовУчета.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ОкончаниеСрокаПоверки
		|			ПО ВведенныеПриборыДействующихТочек.Организация = ОкончаниеСрокаПоверки.Организация
		|				И ВведенныеПриборыДействующихТочек.Район = ОкончаниеСрокаПоверки.Район
		|				И ВведенныеПриборыДействующихТочек.КлючПомещения = ОкончаниеСрокаПоверки.КлючПомещения
		|				И ВведенныеПриборыДействующихТочек.ПриборУчета = ОкончаниеСрокаПоверки.ПриборУчета
		|		ПО энргАбоненты.КлючПомещения = ВведенныеПриборыДействующихТочек.КлючПомещения
		|ГДЕ
		|	ОкончаниеСрокаПоверки.ДатаОкончанияПоверки = &Период
		|ИТОГИ
		|	МАКСИМУМ(Район),
		|	МАКСИМУМ(КлючПомещения)
		|ПО
		|	Абонент");

				
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"			, Период);
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса);	
	
КонецФункции

Процедура СоздатьДокументыИстеченияСрокаПоверки(Период, Организация, Результат)
	
	ВыборкаАбонент 							= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаАбонент.Следующий() Цикл
		ДокИстечениеПоверки							= Документы.энргИстечениеДатыПоверкиПУ.СоздатьДокумент();
		ДокИстечениеПоверки.Дата 					= Период;
		ДокИстечениеПоверки.Организация 			= Организация;
		ДокИстечениеПоверки.Район 					= ВыборкаАбонент.Район;
		ДокИстечениеПоверки.Абонент 				= ВыборкаАбонент.Абонент;
		ДокИстечениеПоверки.КлючПомещения 			= ВыборкаАбонент.КлючПомещения;
		ДокИстечениеПоверки.ДатаФактическогоСобытия = Период;
		ДокИстечениеПоверки.Примечание 				= "Документ сформирован автоматически";
		ДокИстечениеПоверки.ПериодНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Период, Организация,ВыборкаАбонент.Район);	

		ВыборкаДЗ = ВыборкаАбонент.Выбрать();
		
		Пока ВыборкаДЗ.Следующий() Цикл
			СтрТочкиУчета  						= ДокИстечениеПоверки.ТочкиУчета.Добавить();
			СтрТочкиУчета.ТочкаУчета 			= ВыборкаДЗ.ТочкаУчета;
			СтрТочкиУчета.ПриборУчета 			= ВыборкаДЗ.ПриборУчета;
			СтрТочкиУчета.ДатаПоверкиСчетчика 	= ВыборкаДЗ.ДатаПоверкиСчетчика;
			СтрТочкиУчета.МежповерочныйИнтервал = ВыборкаДЗ.МежповерочныйИнтервал;
		КонецЦикла;
		
		ДокИстечениеПоверки.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
КонецПроцедуры


