#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	перем КлючПомещения;
	
	Если Параметры.ДополнительныеПараметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.Организация) Тогда
		Организация = Параметры.ДополнительныеПараметры.Организация; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Организация",Организация,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;

	Если Параметры.ДополнительныеПараметры.Свойство("Район") И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.Район) Тогда
		Район = Параметры.ДополнительныеПараметры.Район; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Район",Район,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.ДополнительныеПараметры.Свойство("КлючПомещения") И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.КлючПомещения) Тогда
		КлючПомещения = Параметры.ДополнительныеПараметры.КлючПомещения; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ИначеЕсли Параметры.Свойство("КлючПомещения") И ЗначениеЗаполнено(Параметры.КлючПомещения) Тогда
		КлючПомещения = Параметры.КлючПомещения; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"КлючПомещения",КлючПомещения,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.ДополнительныеПараметры.Свойство("Строение") И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.Строение) и КлючПомещения = Неопределено Тогда
		Строение = Параметры.ДополнительныеПараметры.Строение; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"КлючПомещения.Строение",Строение,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.ДополнительныеПараметры.Свойство("Помещение") И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.Помещение)  и КлючПомещения = Неопределено Тогда
		Помещение = Параметры.ДополнительныеПараметры.Помещение; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"КлючПомещения.Помещение",Помещение,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.ДополнительныеПараметры.Свойство("Архив") Тогда
		Архив = Параметры.ДополнительныеПараметры.Архив; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Архив",Архив,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти