#Область ОбработчикиСобытий

Процедура ЗарегистрироватьВПоследовательностиПриЗаписи(Источник, Отказ) Экспорт

	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностямиСобытия();
	Инструменты.ЗарегистрироватьВПоследовательностиПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

Процедура ЗарегистрироватьВПоследовательностиМКДПриЗаписи(Источник, Отказ) Экспорт
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностямиСобытия();
	Инструменты.ЗарегистрироватьВПоследовательностиМКДПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

Процедура ЗарегистрироватьВПоследовательностиПоказанияПУПриЗаписи(Источник, Отказ) Экспорт
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностямиСобытия();
	Инструменты.ЗарегистрироватьВПоследовательностиПоказанияПУПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

Процедура ЗарегистрироватьВПоследовательностиПоказанияМКДПриЗаписи(Источник, Отказ) Экспорт
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностямиСобытия();
	Инструменты.ЗарегистрироватьВПоследовательностиПоказанияМКДПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

Процедура ЗарегистрироватьВПоследовательностиВзаиморасчеты(Источник, Отказ) Экспорт
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностямиСобытия();
	Инструменты.ЗарегистрироватьВПоследовательностиВзаиморасчеты(Источник, Отказ);
		
КонецПроцедуры

#КонецОбласти
