#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеДокументы 		= ПолучитьДанныеЗадолженности();
	ВыборкаЗадолженность 	= ДанныеДокументы[0].Выбрать();
	ВыборкаОплата			= ДанныеДокументы[1].Выбрать();
	
	СтавкаНДСРС 			= РегистрыСведений.бестСтавкиНДС.ПолучитьСтавкуНДС(Дата,Организация);
	
	Пока ВыборкаЗадолженность.Следующий() Цикл
		Если ВыборкаЗадолженность.ТипЗадолженности = Перечисления.бестВидыРасчета.Фактический Тогда
			ЗаписьВзаиморасчетыПоМесяцам 				= Движения.бестВзаиморасчетыПоМесяцамЭЭ.ДобавитьПриход();
		Иначе
			ЗаписьВзаиморасчетыПоМесяцам 				= Движения.бестВзаиморасчетыПоПениЭЭ.ДобавитьПриход();
		КонецЕсли;
			
		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчетыПоМесяцам, ВыборкаЗадолженность);
		
		ЗаписьВзаиморасчеты 						= Движения.бестВзаиморасчетыЭЭ.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчеты, ВыборкаЗадолженность);
	КонецЦикла;
	
	Пока ВыборкаОплата.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(ВыборкаОплата.СтавкаНДСЗадолженности) Тогда
			СтавкаНДС = ВыборкаОплата.СтавкаНДСЗадолженности
		ИначеЕсли СтавкаНДСРС <> Неопределено Тогда
			СтавкаНДС = СтавкаНДСРС;
		Иначе
			СтавкаНДС = 0;
		КонецЕсли;
		
		Если ВыборкаОплата.ТипЗадолженности = Перечисления.бестВидыРасчета.Фактический Тогда
			ЗаписьВзаиморасчетыПоМесяцам 				= Движения.бестВзаиморасчетыПоМесяцамЭЭ.ДобавитьРасход();
		ИначеЕсли ВыборкаОплата.ТипЗадолженности = Перечисления.бестВидыРасчета.Пеня Тогда
			ЗаписьВзаиморасчетыПоМесяцам 				= Движения.бестВзаиморасчетыПоПениЭЭ.ДобавитьРасход();
		Иначе
			ЗаписьАвансы 						= Движения.бестАвансыЭЭ.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(ЗаписьАвансы, ВыборкаОплата, , "Сумма");
			ЗаписьАвансы.Сумма 		= ВыборкаОплата.Сумма - ВыборкаОплата.СуммаЗадолженности;
			ЗаписьАвансы.СуммаНДС 	= ЗаписьАвансы.Сумма - ЗаписьАвансы.Сумма / (1 + СтавкаНДС / 100);
			Продолжить;
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчетыПоМесяцам, ВыборкаОплата);

		ЗаписьВзаиморасчеты 				= Движения.бестВзаиморасчетыЭЭ.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчеты, ВыборкаОплата);
		ЗаписьВзаиморасчеты.СуммаНДС 	= ЗаписьВзаиморасчеты.Сумма - ЗаписьВзаиморасчеты.Сумма / (1 + СтавкаНДС / 100);
		
		Если ВыборкаОплата.Сумма = ВыборкаОплата.СуммаЗадолженности Тогда
			ЗаписьВзаиморасчетыПоМесяцам.СуммаНДС = ВыборкаОплата.СуммаНДСЗадолженности;
		ИначеЕсли ВыборкаОплата.Сумма < ВыборкаОплата.СуммаЗадолженности Тогда
			ЗаписьВзаиморасчетыПоМесяцам.СуммаНДС = ВыборкаОплата.Сумма - ВыборкаОплата.Сумма / (1 + СтавкаНДС / 100);
		Иначе
			ЗаписьВзаиморасчетыПоМесяцам.Сумма 		= ВыборкаОплата.СуммаЗадолженности;
			ЗаписьВзаиморасчетыПоМесяцам.СуммаНДС 	= ВыборкаОплата.СуммаНДСЗадолженности - ВыборкаОплата.СуммаНДСЗадолженности / (1 + СтавкаНДС / 100);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеЗадолженности()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка КАК ПлатежныйДокумент,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.Сумма + ВЫБОР
	|			КОГДА НЕ бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокумент.Дата КАК Период,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	бестПлатежныйДокумент.ТипЗадолженности КАК ТипЗадолженности
	|ПОМЕСТИТЬ Задолженность
	|ИЗ
	|	Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ПО (бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка)
	|ГДЕ
	|	бестПлатежныйДокумент.ДокументОснование = &Ссылка
	|	И бестПлатежныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бествидыопераций.ПлатежныйДокумент_Расчетный)
	|	И бестПлатежныйДокумент.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка,
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	бестПлатежныйДокумент.ТипЗадолженности,
	|	бестПлатежныйДокумент.ПериодНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка,
	|	СУММА(бестПлатежныйДокументПеня.СуммаПени),
	|	СУММА(бестПлатежныйДокументПеня.СуммаПениНДС),
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	ЕСТЬNULL(бестПлатежныйДокументПеня.СтавкаНДС, 0),
	|	бестПлатежныйДокумент.ТипЗадолженности
	|ИЗ
	|	Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент.Пеня КАК бестПлатежныйДокументПеня
	|		ПО (бестПлатежныйДокументПеня.Ссылка = бестПлатежныйДокумент.Ссылка)
	|ГДЕ
	|	бестПлатежныйДокумент.ДокументОснование = &Ссылка
	|	И бестПлатежныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бествидыопераций.ПлатежныйДокумент_Пеня)
	|	И бестПлатежныйДокумент.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка,
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокументПеня.СтавкаНДС,
	|	бестПлатежныйДокумент.ТипЗадолженности,
	|	бестПлатежныйДокумент.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.СуммаОплаты КАК Сумма,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Ссылка КАК ДокументОплаты,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Организация КАК Организация,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Район КАК Район,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки КАК IDСтрокиОплаты,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Дата КАК Период,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Договор КАК Договор,
	|	ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления, ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.ПустаяСсылка)) КАК ПлатежныйДокумент,
	|	ЕСТЬNULL(Задолженность.Сумма, 0) КАК СуммаЗадолженности,
	|	ЕСТЬNULL(Задолженность.СтавкаНДС, 0) КАК СтавкаНДСЗадолженности,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ПериодНачисления КАК ПериодРасчета,
	|	ЕСТЬNULL(Задолженность.СуммаНДС, 0) КАК СуммаНДСЗадолженности,
	|	ЕСТЬNULL(Задолженность.ТипЗадолженности, ЗНАЧЕНИЕ(перечисление.бестВидыРасчета.пустаяссылка)) КАК ТипЗадолженности
	|ИЗ
	|	Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица КАК бестПлатежноеПоручениеВходящееЭЭЮрЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.ДокументыНачисления КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ Задолженность КАК Задолженность
	|				ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления = Задолженность.ПлатежныйДокумент
	|			ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.Ссылка
	|				И бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.IDСтроки
	|		ПО (бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = бестПлатежноеПоручениеВходящееЭЭЮрЛица.Ссылка)
	|ГДЕ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.ДокументОснование = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли