#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки  					= ДанныеШапки();
	
	МКДОткрыт 						= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Новый Граница(МоментВремени(),ВидГраницы.Исключая),Район,МКД,Организация);
	Если Не МКДОткрыт тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный многоквартирный дом закрыт!");
		
		Отказ = истина;
	КонецЕсли;	
	
	
	Если Не Отказ Тогда
		энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьФормуУправленияМКД(Движения, ДанныеШапки);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",						?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",						Район); 
	ДанныеШапки.Вставить("Организация",					Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",			Дата);
	ДанныеШапки.Вставить("ПериодНачисления",			ПериодНачисления);
	ДанныеШапки.Вставить("МКД",							МКД);
	ДанныеШапки.Вставить("ФормаУправления",				ФормаУправления);
	ДанныеШапки.Вставить("УК",							УК);
	ДанныеШапки.Вставить("РасчетОбъемовВыполняетУК",	РасчетОбъемовВыполняетУК);
	Возврат ДанныеШапки;	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли