#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
		
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ЗначениеТарифа();
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЕстьСоставныеУслуги() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В табличной части указаны строки для составных услуг");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗначениеТарифа()
	для Каждого стр из Значения цикл
		Движение 						= Движения.энргЗначенияТарифов.Добавить();
		Движение.Период 				= Дата; 
		Движение.Организация 			= Организация;
		Движение.Район		 			= Район;
		Движение.Поставщик 				= стр.Поставщик;
		Движение.ГруппаПотребителей 	= стр.ГруппаПотребителей;
		Движение.Услуга 				= стр.Услуга;
		Движение.ТарифнаяЗона 			= стр.ТарифнаяЗона;
		Движение.Значение 				= стр.ЗначениеТарифа;
		Движение.ЗначениеСверхНорматива	= стр.ЗначениеТарифаСверхНорматива;
		Движение.СтавкаНДС 				= стр.СтавкаНДС;
		Движение.НДСВнутри 				= стр.НДСВнутри;
	КонецЦикла;
	
	для Каждого стр из ЗначенияСписокРайонов цикл
		Движение 						= Движения.энргЗначенияТарифов.Добавить();
		Движение.Период 				= Дата; 
		Движение.Организация 			= Организация;
		Движение.Район		 			= стр.Район;
		Движение.Поставщик 				= стр.Поставщик;
		Движение.ГруппаПотребителей 	= стр.ГруппаПотребителей;
		Движение.Услуга 				= стр.Услуга;
		Движение.ТарифнаяЗона 			= стр.ТарифнаяЗона;
		Движение.Значение 				= стр.ЗначениеТарифа;
		Движение.ЗначениеСверхНорматива	= стр.ЗначениеТарифаСверхНорматива;
		Движение.СтавкаНДС 				= стр.СтавкаНДС;
		Движение.НДСВнутри 				= стр.НДСВнутри;
	КонецЦикла; 	
	
КонецПроцедуры

Функция ЕстьСоставныеУслуги()	
	мУслуги 		= Значения.ВыгрузитьКолонку("Услуга");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мУслуги, ЗначенияСписокРайонов.ВыгрузитьКолонку("Услуга"));
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("мУслуги", мУслуги);
	Запрос.Текст 	=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргВидыУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргВидыУслуг КАК энргВидыУслуг
	|ГДЕ
	|	энргВидыУслуг.Ссылка В(&мУслуги)
	|	И энргВидыУслуг.СоставнаяУслуга";
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли