#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает Истину или Ложь в зависимости от факта заключения договора.
//
// Параметры:
//  Дата		-	Граница.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Договор		-	СправочникСсылка.энргДоговорыКонтрагентов.
// 
// Возвращаемое значение:
//   Булево	-	заключен или не заключен договор.
//
Функция ДоговорЗаключен(Дата, Организация, Район, Договор) Экспорт
	ДоговорЗаключен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестСостояниеДоговоровСрезПоследних.Состояние КАК Состояние,
	|	бестСостояниеДоговоровСрезПоследних.Организация КАК Организация,
	|	бестСостояниеДоговоровСрезПоследних.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	РегистрСведений.бестСостояниеДоговоров.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Договор = &Договор
	|				И Район = &Район) КАК бестСостояниеДоговоровСрезПоследних
	|ГДЕ
	|	бестСостояниеДоговоровСрезПоследних.Состояние";
	
	Запрос.УстановитьПараметр("Дата",			Дата);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("Договор",		Договор);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДоговорЗаключен = Истина;
	КонецЕсли;
	
	Возврат ДоговорЗаключен;
КонецФункции

#КонецОбласти

#КонецЕсли