
&НаСервере
Процедура ОтборПоБлагоустройствуПриИзмененииНаСервере()
	Если ОтборПоБлагоустройству.Количество() = 0 Тогда
		Список.Отбор.Элементы.Очистить();
	Иначе		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СписокБлагоустройств", ОтборПоБлагоустройству.ВыгрузитьЗначения());
		Запрос.Текст = "ВЫБРАТЬ
		|	энргВидыБлагоустройствБлагоустройства.Ссылка КАК Ссылка,
		|	энргВидыБлагоустройствБлагоустройства.Благоустройство КАК Благоустройство
		|ИЗ
		|	Справочник.энргВидыБлагоустройств.Благоустройства КАК энргВидыБлагоустройствБлагоустройства
		|ГДЕ
		|	энргВидыБлагоустройствБлагоустройства.Благоустройство В (&СписокБлагоустройств)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВидыБлагоустройствБлагоустройства.Ссылка,
		|	энргВидыБлагоустройствБлагоустройства.Благоустройство";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Список.Отбор.Элементы.Очистить();
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= Выборка;
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоБлагоустройствуПриИзменении(Элемент)
	ОтборПоБлагоустройствуПриИзмененииНаСервере();
КонецПроцедуры
#Область ОбработчикиСобытий

#КонецОбласти
