
#Область СтандартныеПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОткрытьФорму("Обработка.энргПечатьКвитанций.Форма.Форма",,,,,,
					Новый ОписаниеОповещения("ОбработатьРезультатПолученияДатыФормированияКвитанций", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды)), 
						РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПолученияДатыФормированияКвитанций(Результат, ДополнительныеПараметры)
	
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ИмяМакета  			= "ПФ_MXL_ДолговаяКвитанция";
	ТаблицаМакета 		= "Обработка.энргПечатьКвитанций";
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТаблицаМакета,ИмяМакета,ДополнительныеПараметры.ПараметрКоманды,ЭтотОбъект, 
																						Новый Структура("ПериодФормированияКвитанций",Результат));
	
КонецПроцедуры	

#КонецОбласти
