
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ЗаполнитьДокумент") тогда 
		
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
		
		ЗаполнитьДокумент  = Ложь;
		
		Если Параметры.Свойство("ЗаполнитьДокумент") тогда
			Если Параметры.ЗаполнитьДокумент тогда
				ЗаполнитьДокумент = истина;
			КонецЕсли;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Объект.КлючПомещения) и ЗаполнитьДокумент тогда
			Если не ЗначениеЗаполнено(Объект.Дата) тогда
				Объект.Дата 	= ТекущаяДата();
			КонецЕсли;			
			ЗаполнитьПриборыУчетаСервер();
		КонецЕсли; 	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);	
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтаФорма,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,Неопределено);
	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,ТекущийОбъект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,"УслугиДерево");
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");	
	ЗаполнитьДеревоУслугНаОснованииТочекУчета(Объект, УслугиДерево, ПустойКлючСтроки.ПривестиЗначение());
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОчиститьТабличныеЧасти("ТочкиУчета");
	ЗаполнитьТочкиНаОснованииДереваУслуг(УслугиДерево.ПолучитьЭлементы(), Неопределено);	
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Объект.ТочкиУчета.Очистить();
	//ЗаполнитьТочкиНаОснованииДереваУслуг(УслугиДерево.ПолучитьЭлементы(), Неопределено);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);	

КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчета", энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Шапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	ОчиститьТабличныеЧасти();
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		ЗаполнитьПриборыУчетаСервер();
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
	
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);
	
	ОчиститьТабличныеЧасти();
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		ЗаполнитьПриборыУчетаСервер();
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ОчиститьТабличныеЧасти();
	ЗаполнитьПриборыУчетаСервер();	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненнуюУслугу(Команда)	
	Отказ 						= Истина;
	ТаблицаФормы 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	Родитель  					= УслугиДерево.НайтиПоИдентификатору(ТаблицаФормы.ТекущаяСтрока);
	НоваяСтрока  				= Родитель.ПолучитьЭлементы().Добавить();
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();		
КонецПроцедуры

#КонецОбласти

#Область СобытияИзмененияТабличнойЧастиУслугиДерево

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	ОчиститьТабличныеЧасти("ТочкиУчета");
	Модифицированность = Истина;
	ЗаполнитьТочкиНаОснованииДереваУслуг(УслугиДерево.ПолучитьЭлементы(), Неопределено);
КонецПроцедуры

//&НаСервере
//Процедура ТочкиУчетаПриИзмененииНаСервере()
//		
//КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТочкиУчета(Элемент)
	//ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	//ТекущаяСтрока = ТекущиеДанные.НомерСтроки;
	
	ТекущаяСтрока = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущаяСтрока;
	
	ЗаполнитьПриборыУчетаСервер(ТекущаяСтрока);
	ТочкиУчетаПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	перем ТаблицаФормыШкал, ТаблицаФормыПоказания;
	
	ИмяТаблицыТочек 							= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал								= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказаний							= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	
	ТекущиеДанные 								= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 					= Новый УникальныйИдентификатор;
	КонецЕсли;
		
	Если НЕ Элементы.Найти(ИмяТаблицыШкал) = Неопределено Тогда
		ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	КонецЕсли;
	
	Если НЕ Элементы.Найти(ИмяТаблицыПоказаний) = Неопределено Тогда
		ТаблицаФормыПоказания	 				= Элементы[ИмяТаблицыПоказаний];
	КонецЕсли;
	
	Если НЕ ТаблицаФормыШкал = Неопределено Тогда
		// энргРаботаСВидомДифференцированности {
		энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
		// энргРаботаСВидомДифференцированности }		
		Возврат;
	КонецЕсли;
	
	Если НЕ ТаблицаФормыПоказания = Неопределено Тогда
		// энргРаботаСВидомДифференцированности {
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
		// энргРаботаСВидомДифференцированности }		
		Возврат;
	КонецЕсли; 
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СобытияИзмененияТабличнойЧастиПоказаний

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата, Новый Структура("СтатусИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата, Новый Структура("ПереворотИзмененПользователем", Истина));
КонецПроцедуры


&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата, Новый Структура("СтатусИзмененПользователем", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата, Новый Структура("ПереворотИзмененПользователем", Истина));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти     

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьТочкиНаОснованииДереваУслуг(Строки, Родитель)
	
	Для Каждого Строка Из Строки Цикл 		
		СтрокаТочки  						= Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочки, Строка);
		Если Не Родитель = Неопределено Тогда
			СтрокаТочки.IDСтрокиРодитель	= Родитель;
		Иначе			
			СтрокаТочки.IDСтрокиРодитель	= ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
		КонецЕсли;
		ЗаполнитьТочкиНаОснованииДереваУслуг(Строка.ПолучитьЭлементы(), Строка.IDСтроки);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныеЧасти(ИмяТЧ = "")
	
	Если НЕ ПустаяСтрока(ИмяТЧ) Тогда 
		Объект[ИмяТЧ].Очистить();
		Возврат;
	КонецЕсли;
	
	УслугиДерево.ПолучитьЭлементы().Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУслугНаОснованииТочекУчета(ТекущийОбъект, СтрокаРодитель, Родитель)
	
	Вершины 				= ТекущийОбъект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиРодитель", Родитель));
	Строки  				= СтрокаРодитель.ПолучитьЭлементы();
		
	Для Сч = 0 По Вершины.ВГраница() Цикл
		Если ЗначениеЗаполнено(Вершины[Сч].IDСтроки) Тогда
			СтрокаДерева  	= Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Вершины[Сч]);						
			ЗаполнитьДеревоУслугНаОснованииТочекУчета(ТекущийОбъект, СтрокаДерева, Вершины[Сч].IDСтроки);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ИдентификаторСтроки = Неопределено)
		
	ТочкаУчета  									= Неопределено;
	Если ИдентификаторСтроки = Неопределено Тогда
		ТаблицаТЧ 									= Объект.ПоказанияПриборовУчета.Выгрузить();
		Объект.ШкалыПриборовУчета.Очистить();
		Объект.ПоказанияПриборовУчета.Очистить();
		Объект.ТочкиУчета.Очистить();
	Иначе
		СтрокаТочкиУчета  							= УслугиДерево.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТочкаУчета 									= СтрокаТочкиУчета.ТочкаУчета;
		ПоискШкал	 								= Новый Структура("IDСтрокиТочкиУчета",СтрокаТочкиУчета.IDСтроки);
		СтрокиШкал  								= Объект.ШкалыПриборовУчета.НайтиСтроки(ПоискШкал);
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			ПоискПоказаний 							= Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки);
			СтрокиПоказаний 						= Объект.ПоказанияПриборовУчета.НайтиСтроки(ПоискПоказаний);
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
			КонецЦикла;
			Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
		КонецЦикла;		
	КонецЕсли;

	//ОчиститьТабличныеЧасти();
	
	
	Результат 										= Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы(Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения,ТочкаУчета); 
	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	НомерСтроки 									= 1;
	КлючСтрокРодителей 								= Новый Соответствие;
	
	Пока Выборка.следующий() цикл
		
		IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			Если ИдентификаторСтроки = Неопределено Тогда
				//Если Не ЗначениеЗаполнено(Выборка.РодительТочкиУчета) Тогда
				//	СтрокаТочкиУчета  				= УслугиДерево.ПолучитьЭлементы().Добавить();
				//	КлючСтрокРодителей.Вставить(Выборка.ТочкаУчета, СтрокаТочкиУчета);
				//Иначе					
				//	ТекущаяСтрокаРодителя 			= КлючСтрокРодителей[Выборка.РодительТочкиУчета];
				//	СтрокаТочкиУчета 				= ТекущаяСтрокаРодителя.ПолучитьЭлементы().Добавить();
				//КонецЕсли;
				
				СтрокаТочкиУчета                    = Объект.ТочкиУчета.Добавить();
				
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки			= IDСтрокиТочки; 
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				//СтрокаТочкиУчета.НомерСтроки 		= НомерСтроки;
				СтрокаТочкиУчета.IDСтрокиШкалы = IDСтрокиШкалы;
				НомерСтроки 						= НомерСтроки + 1;
				ТекущаяСтрокаРодителя 				= СтрокаТочкиУчета;
				
			иначе 				
				СтрокаТочкиУчета  					= УслугиДерево.НайтиПоИдентификатору(ИдентификаторСтроки);
				IDСтрокиТочки 						= СтрокаТочкиУчета.IDСтроки;
				
			КонецЕсли;
			СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета			= Выборка.ПриборУчета;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;
		ТекШкала 									= Выборка.Шкала;
	КонецЦикла; 
	
	СоответствиеКолонок 							= Новый Структура;
	СоответствиеКолонок.Вставить("ПриборУчета"	,"ПриборУчета");
	СоответствиеКолонок.Вставить("IDСтроки"		,"IDСтроки");
	
	Если ИдентификаторСтроки = Неопределено Тогда
		ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район,Объект.КлючПомещения,ИдентификаторСтроки,СоответствиеКолонок); 		
	иначе 				
		ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,УслугиДерево,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район,Объект.КлючПомещения,ИдентификаторСтроки,СоответствиеКолонок); 		
	КонецЕсли; 
	
	ДатаЗаполненияПоказаний = ?(Объект.ДатаФактическогоСобытия = Дата(1,1,1), Объект.Дата, Объект.ДатаФактическогоСобытия);
	
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,Объект.Район,ТаблицаПоказанийДляЗаполнения,ДатаЗаполненияПоказаний);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
			
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,"УслугиДерево");
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, Объект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	Если ИдентификаторСтроки = Неопределено Тогда
		ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");	
		ЗаполнитьДеревоУслугНаОснованииТочекУчета(Объект, УслугиДерево, ПустойКлючСтроки.ПривестиЗначение());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти