#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДокумент  				= Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		ЗаполнитьДокумент 			= Параметры.ЗаполнитьДокумент; 		 		
	КонецЕсли;  	
	
	// ВводНаОсновании
	//ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	//ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("Контрагент"), Метаданные.Документы.бестРеализацияЮрЛица);
	// -- Акимов Д.В.
	
	ОтборВДинамическихСписках();
	
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
	
	Объект.Договор 		= Неопределено;
	Объект.Контрагент 	= Неопределено;
	Объект.Район 		= Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Договор) тогда
		бестПользовательскийВводКлиент.ПриИзмененииДоговораКонтрагента(Объект,"ДатаФактическогоСобытия");
		Объект.Контрагент = ПолучениеЗначенияРеквизита(Объект.Договор, "Контрагент");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучениеЗначенияРеквизита(ИмяОбъекта, ИмяРеквизита)
	Возврат ИмяОбъекта[ИмяРеквизита];	
КонецФункции

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока.ЕдиницаИзмерения = ПолучениеЗначенияРеквизита(ТекСтрока.Услуга, "ЕдиницаИзмерения");
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

&НаСервере
Процедура ОтборВДинамическихСписках()
	НомераСФ.Отбор.Элементы.Очистить();
	ЭлементОтбора = НомераСФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Начисление");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = ПолучениеЗначенияРеквизита(Объект.Район, "Организация");
КонецПроцедуры

&НаСервере
Процедура ПечатьАктаВыполненныхРаботНаСервере(Массив, ТабДок, ДатаПечати)
	Документы.бестРеализацияЮрЛица.ФормированиеПечатнойФормыАктаВыполненныхРабот(Массив, ТабДок, ДатаПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктаВыполненныхРабот(Команда)
	ТабДок 						= Новый ТабличныйДокумент;
	Массив 						= Новый Массив;
	Массив.Добавить(Объект.Ссылка);	
	ПечатьАктаВыполненныхРаботНаСервере(Массив, ТабДок, Объект.Дата);
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Защита 				= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПечатьСчетаНаОплатуНаСервере(Массив, ТабДок, ДатаПечати)
	Документы.бестРеализацияЮрЛица.ФормированиеПечатнойФормыСчетаНаОплату(Массив, ТабДок, ДатаПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетаНаОплату(Команда)
	ТабДок 						= Новый ТабличныйДокумент;
	Массив 						= Новый Массив;
	Массив.Добавить(Объект.Ссылка);	
	ПечатьСчетаНаОплатуНаСервере(Массив, ТабДок, Объект.Дата);
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Защита 				= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПечатьСчетаФактурыНаСервере(Массив, ТабДок, ДатаПечати)
	Документы.бестРеализацияЮрЛица.ФормированиеПечатнойФормыСчетаФактурыВыданный(Массив, ТабДок, ДатаПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетаФактуры(Команда)
	ТабДок 						= Новый ТабличныйДокумент;
	Массив 						= Новый Массив;
	Массив.Добавить(Объект.Ссылка);	
	ПечатьСчетаФактурыНаСервере(Массив, ТабДок, Объект.Дата);
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Защита 				= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Показать();	
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти