
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопСоглашения.Параметры.УстановитьЗначениеПараметра("Ссылка",?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка));
	Если Параметры.Свойство("ОснованиеДопСоглашения") Тогда
		Объект.ОснованиеДопСоглашения = Параметры.ОснованиеДопСоглашения;
	КонецЕсли;
	
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	энргЛокализацияСервер.ПриСозданииНаСервере_бестДоговорыКонтрагентов(ЭтотОбъект);	
	ЗаполнитьЗначенияСвойств(Объект, Параметры); 	
	Если Не ЗначениеЗаполнено(Объект.Организация) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
	РеквизитБлокЮридическихЛицПредзаполнен = Параметры.Свойство("БлокЮридическихЛиц");
	
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтотОбъект, Новый Структура("ПрисоединитьФайлСУказаниемТипа"), Метаданные.Справочники.энргДоговорыКонтрагентов, "Редактирование");
		
	бестРаботаСФормойДоговораНезависимыйСбыт.НастроитьЭлементыИнтерфейсаДоговор(ЭтотОбъект);
	УстановитьЗапретИзмененияПоСтатусу();
	ЗаполнениеБанковскогоСчетаКонтрагента(); 
	//ЗаполнениеКонтактныхЛицКонтрагента(КонтактныеЛицаКонтрагента, Объект.Контрагент);

	СписокКЛиц = Объект.КонтактныеЛицаКонтрагентов.Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо");
	КонтактныеЛицаКонтрагента.ЗагрузитьЗначения(СписокКЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСНезависимымСбытом.ДополнительныеПараметрыЗаписиДатыИзменения(ТекущийОбъект, ЭтотОбъект.Модифицированность, ПараметрыЗаписи);
	РеквизитДоходный = бестРаботаСФормойДоговораНезависимыйСбыт.ИмяРеквизитаДоходный(); 
	Если бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, РеквизитДоходный) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДоходныйОснование", ЭтотОбъект[РеквизитДоходный]);
	КонецЕсли;
	
	ТекущийОбъект.КонтактныеЛицаКонтрагентов.Очистить();
	Если КонтактныеЛицаКонтрагента.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееКонтактноеЛицо Из КонтактныеЛицаКонтрагента Цикл
		
		НоваяСтрока                = ТекущийОбъект.КонтактныеЛицаКонтрагентов.Добавить();
		НоваяСтрока.КонтактноеЛицо = ТекущееКонтактноеЛицо.Значение; 
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() Тогда 
		бестРаботаСФормойДоговораНезависимыйСбыт.ЗаполнитьСвязьНесколькихДоговоров(ЭтотОбъект);
	КонецЕсли;
	УстановитьЗапретИзмененияПоСтатусу();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не РеквизитБлокЮридическихЛицПредзаполнен Тогда
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить(Истина,	"Юридическим лицом");
		СписокОтветов.Добавить(Ложь,	"Физическим лицом");
		
		Объект.БлокЮридическихЛиц = Вопрос("Договор заключается с",СписокОтветов);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.НаименованиеДляПечати = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СформироватьНаименованиеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СформироватьНаименованиеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Район) Тогда
		Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнениеБанковскогоСчетаКонтрагента();
	ЗаполнениеКонтактныхЛицКонтрагента(КонтактныеЛицаКонтрагента, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ТипТарифаПриИзменении(Элемент)
	УстановитьСвойстваЭлементовСвязанныхСТарифом();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьЗапретИзмененияПоСтатусу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьРасходный(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выполнением операции необходимо записать объект.");
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ЗаписьСвязиПослеВыбора", ЭтотОбъект);			
    МассивВидыДоговора = Новый Массив;
	МассивВидыДоговора.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыДоговоров.ДоговорЭнергоснабжения"));
	МассивВидыДоговора.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыДоговоров.ДоговорКуплиПродажи"));
	МассивВидыДоговора.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыДоговоров.ОптовыйДоговор"));
	ЗначениеОтбора = Новый Структура("ТипДоговора, ВидДоговора", ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.Расходный"), МассивВидыДоговора);
	ПараметрыПриОткрытии = Новый Структура("Отбор", ЗначениеОтбора);	
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыПриОткрытии, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед добавлением запишите объект.");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.Форма.ФормаЭлемента", Новый Структура("ОснованиеДопСоглашения,Организация,Район,Контрагент", Объект.Ссылка,Объект.Организация,Объект.Район,Объект.Контрагент), Команда,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#Область РаботаСПрикрепляемымиФайлами

&НаКлиенте
Процедура ПрисоединитьФайлСУказаниемТипа(Команда)
	
	энргРаботаСПрикрепленнымиФайламиКлиент.ОткрытьФормуПрикрепленияФайлов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
    ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НезависимыйСбыт

&НаСервере
Процедура УстановитьСвойстваЭлементовСвязанныхСТарифом()
	бестРаботаСФормойДоговораНезависимыйСбыт.НастроитьСвойстваРеквизитовТарифа(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура УстановитьЗапретИзмененияПоСтатусу()
	бестРаботаСФормойДоговораНезависимыйСбыт.ПроверкаЗаблокироватьРеквизитыПоСтатусу(ЭтотОбъект);
КонецПроцедуры 

&НаСервере
Процедура ЗаписьСвязиПослеВыбора(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	бестРаботаСНезависимымСбытом.ЗаписатьВРегистрСвязиДоговоров(Результат, Объект.Ссылка);
	бестРаботаСФормойДоговораНезависимыйСбыт.ЗаполнитьСвязьНесколькихДоговоров(ЭтотОбъект);
КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	
	ЭтоДопСоглашение = ЗначениеЗаполнено(Объект.ОснованиеДопСоглашения);
	Объект.Наименование = ?(ЭтоДопСоглашение, "Дополнительное соглашение", "Договор")
	+ ?(ЗначениеЗаполнено(Объект.Номер), " № " + Объект.Номер, "") 
	+ " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") 
	+ ?(ЭтоДопСоглашение, " к " + СтрЗаменить(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОснованиеДопСоглашения, "Наименование"), "Договор", "договору"), "");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеБанковскогоСчетаКонтрагента()
	
	МассивСчетов = бестРаботаСФормойДоговораНезависимыйСбыт.ВыборБанковскогоСчетаКонтрагента(Объект.Контрагент);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивСчетов));
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(НовыйПараметр);
  	Элементы.БанковскийСчетКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	Если МассивСчетов.Количество() = 1 Тогда
		Объект.БанковскийСчетКонтрагента = МассивСчетов[0];
	Иначе
		Объект.БанковскийСчетКонтрагента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.БанковскиеСчета.ПустаяСсылка");
	КонецЕсли;   
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнениеКонтактныхЛицКонтрагента(КонтактныеЛицаКонтрагента, Контрагент)
	КонтактныеЛицаКонтрагента.ЗагрузитьЗначения(Справочники.бестКонтактныеЛицаКонтрагентов.ПолучитьКонтактныеЛица(Контрагент)); 
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи = Новый Структура();
		ПараметрыЗаписи.Вставить("Закрыть", Истина);
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть(Объект.Ссылка);
		КонецЕсли;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДопСоглашенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДопСоглашения.ТекущиеДанные;
	
	ПараметрыОткрытия = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДопСоглашенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти