#Область СлужебныйПрограммныйИнтерфейс

Процедура ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,РегистрацияОбъема,Период, ДанныеСтроки = Неопределено, КонтрольныйСъем = Ложь, ДополнительныеПараментры = Неопределено) Экспорт 
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные,ДанныеСтроки);
	КонецЕсли;
	
	Если РегистрацияОбъема Тогда
		энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПеречитатьСтрокуСОбъемом(ТекущиеДанные,Период,Ложь);
	Иначе
		энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,Период,КонтрольныйСъем, ДополнительныеПараментры);
	КонецЕсли;  		
	
	Если ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены");
	Иначе
		ТекущиеДанные.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("ПоказанияПредоставлены") Тогда
		ТекущиеДанные.ПоказанияПредоставлены = Истина;
	КонецЕсли;       	
	
КонецПроцедуры

Процедура ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,РегистрацияОбъема,Период, ДанныеСтроки = Неопределено, КонтрольныйСъем = Ложь, ДополнительныеПараментры = Неопределено) Экспорт 
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные,ДанныеСтроки);
	КонецЕсли;
	
	Если РегистрацияОбъема Тогда
		энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПеречитатьСтрокуСОбъемомМКД(ТекущиеДанные,Период,Ложь);
	Иначе
		энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,Период,КонтрольныйСъем,ДополнительныеПараментры);
	КонецЕсли;  		
	
	Если ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены");
	Иначе
		ТекущиеДанные.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");	
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("ПоказанияПредоставлены") Тогда
		ТекущиеДанные.ПоказанияПредоставлены = Истина;
	КонецЕсли;       	
	
КонецПроцедуры


Функция ОпределитьСостояниеПоказанийПоСтроке(ПриборУчета, ФормаОбъекта, СтрокаПоказаний) Экспорт 
	Ответ = энргРаботаСПоказаниямиПриборовУчетаСервер.ПараметрыОтветаОпределитьСостояниеПоказанийПоСтроке(); 
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаОбъекта, "ПриборыДляОтклоненияПоказаний") Тогда 
		Возврат Ответ;
	КонецЕсли; 	
	
	ПриборыДляОтклоненияПоказаний 	= ФормаОбъекта.ПриборыДляОтклоненияПоказаний;
	СтрокиСПрибором 				= ПриборыДляОтклоненияПоказаний.НайтиСтроки(Новый Структура("ПриборУчета", ПриборУчета));
	Если СтрокиСПрибором.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(Ответ, СтрокиСПрибором[0]);
		
		Расход 							= СтрокаПоказаний.ТекущиеПоказания - СтрокаПоказаний.ПредыдущиеПоказания;
		РасходСПереворотом 				= СтрокаПоказаний.МаксимальноВозможныеПоказания - СтрокаПоказаний.ПредыдущиеПоказания + СтрокаПоказаний.ТекущиеПоказания;
		
		Ответ.СостояниеИзменено 		= Истина;
		Ответ.ПоказанияПредоставлены 	= Истина;
		Ответ.Разница 					= ?(СтрокаПоказаний.Переворот, РасходСПереворотом, Расход);
		Ответ.Сумма 					= Ответ.Разница * СтрокаПоказаний.ЗначениеТарифа; 		
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

#КонецОбласти

