#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область РеализацияИнтерефейса_Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;

	ДобавитьТекстЗапросаПодписанты(Схема, Регистры);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПодписанты(Схема, Регистры)
	
	ИмяРегистра = "энргПодписанты";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргРегистрацияУполномоченныхЛиц.Дата КАК Период,
	|	энргРегистрацияУполномоченныхЛиц.Организация КАК Организация,
	|	энргРегистрацияУполномоченныхЛиц.ТипМетаданных КАК ТипМетаданных,
	|	энргРегистрацияУполномоченныхЛицПодписанты.Сотрудник КАК Сотрудник,
	|	энргРегистрацияУполномоченныхЛицПодписанты.ВидПодписанта КАК ВидПодписанта,
	|	энргРегистрацияУполномоченныхЛицПодписанты.Доверенность КАК Доверенность,
	|	энргРегистрацияУполномоченныхЛиц.Район КАК Район
	|ИЗ
	|	Документ.энргРегистрацияУполномоченныхЛиц.Подписанты КАК энргРегистрацияУполномоченныхЛицПодписанты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияУполномоченныхЛиц КАК энргРегистрацияУполномоченныхЛиц
	|		ПО энргРегистрацияУполномоченныхЛицПодписанты.Ссылка = энргРегистрацияУполномоченныхЛиц.Ссылка
	|ГДЕ
	|	энргРегистрацияУполномоченныхЛиц.Ссылка В(&мДокументы)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли