#Область ОписаниеПеременных

перем ПериодНачисления Экспорт; // Период начисления услуги
перем Организация Экспорт; // Организация предоставляющая услуги
перем Район Экспорт; // Район, в котором оказывается услуга
перем ЧастныйСектор Экспорт; // Булево - Является ли строение частным сектором
перем Строение Экспорт; // Адрес, по которому оказавается услуга
перем Помещение Экспорт; // Помещение, в котором оказывается услуга

перем Строения Экспорт; // Строения для изменения структуры запроса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВосстановитьПоследовательность() Экспорт 
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления); 	
	
	Отбор = Новый Структура;
	Отбор.Вставить("НачалоПериодаРасчета"	, ГраницыПериода.НачалоОП);
	Отбор.Вставить("КонецПериодаРасчета"	, ГраницыПериода.ЗавершениеОП);
	Отбор.Вставить("ПриборУчета"			, Неопределено);
	Отбор.Вставить("КолвоНедопусковПодряд"	, энргРаботаСКонстантами.ЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний());	
	 
	Отказ 	= Ложь;
	Ошибки 	= Новый Массив;

	МВТ  		= Новый МенеджерВременныхТаблиц;
	Результат  	= РезультатЗапросаПоказанияПУ(МВТ, Отбор);
	
	ДанныеМаксимальногоПотребления 	= ДанныеМаксимальногоПотребления(Отбор.НачалоПериодаРасчета);
	
	РезультатСреднийОбъем	= РезультатСреднийОбъемПотребления(МВТ, Отбор);
	ВыборкаСреднийОбъем 	= РезультатСреднийОбъем.Выбрать();
	
	ПериодыПриемаПоказаний 	= РегистрыСведений.энргПериодыПриемаПоказаний.ПолучитьПоследнее(ПериодНачисления, Новый Структура("Организация", Организация));
	
	ПредыдущиеМакс 			= 0;
	Выборка  				= Результат.Выбрать();
	ТекЧастныйСектор		= Неопределено;
	ТекСтроение				= Неопределено;
	ТекПомещение			= Неопределено;
	ТекКлючПомещения		= Неопределено;
	ТекПрибор 				= Неопределено;
	ТекШкала		 		= Неопределено;
	ТекТарифнаяЗона 		= Неопределено;
	ТекРегистрируетОбъем 	= Неопределено;
	МассивДокументов		= Неопределено;
	НомерПозиции 			= Неопределено;
	ДанныеСреднегоОбъема 	= Неопределено;
	ТекНедопускПрибора		= Неопределено;
	
	ОписаниеСтроки 				= ОписаниеСтрокиМассивДокументов();
	ОписаниеПараметрыПроведений	= ОписаниеСтрокиПараметрыПроведения();		
	
	//
	МенеджерэнргПоказанияПУПоследовательность = РегистрыСведений.энргПоказанияПУПоследовательность;
	МенеджерэнргПредоставленныеПоказания	  = РегистрыСведений.энргПредоставленныеПоказания;
	МенеджерэнргРасчетСреднегоОбъема		  =	РегистрыСведений.энргРасчетСреднегоОбъема;
	МенеджерэнргМаксимальныеПоказания		  = РегистрыСведений.энргМаксимальныеПоказания;
	МенеджерэнргМаксимальныеПоказанияСрез	  = РегистрыСведений.энргМаксимальныеПоказанияСрез;
	
	МенеджерыРегистров = Новый Структура;
	МенеджерыРегистров.Вставить("энргПоказанияПУПоследовательность", МенеджерэнргПоказанияПУПоследовательность);
	МенеджерыРегистров.Вставить("энргПредоставленныеПоказания", МенеджерэнргПредоставленныеПоказания);
	МенеджерыРегистров.Вставить("энргРасчетСреднегоОбъема", МенеджерэнргРасчетСреднегоОбъема);
	МенеджерыРегистров.Вставить("энргМаксимальныеПоказания", МенеджерэнргМаксимальныеПоказания);
	МенеджерыРегистров.Вставить("энргМаксимальныеПоказанияСрез", МенеджерэнргМаксимальныеПоказанияСрез);
	
	// 
	СтатичныеДопПараметры = СтатичныеДополнительныеПараметрыПоказаний(ПериодыПриемаПоказаний, Отбор.НачалоПериодаРасчета);
	ЗапросПоследовательности = ЗапросПоследовательности();
	
	Всего 				= Выборка.Количество();	
	Итерация			= 0;
	КоличествоИтераций 	= Итерация;
	КолвоСообщений		= Цел(Всего / 10);
	Постфикс 			= " из " + Всего;
	
	Если Всего > 0 тогда
		ВыборкаСреднийОбъем.Следующий();
		НачатьТранзакцию();
	КонецЕсли;
	
	Пока Выборка.Следующий() цикл
		Если НЕ ТекЧастныйСектор = Выборка.ЧастныйСектор
			ИЛИ НЕ ТекСтроение = Выборка.Строение 
			ИЛИ ТекПомещение<> Выборка.Помещение
			ИЛИ ТекПрибор <> Выборка.ПриборУчета
			ИЛИ ТекШкала <> Выборка.Шкала
			ИЛИ ТекТарифнаяЗона <> Выборка.ТарифнаяЗона Тогда  			  			
			
			Если ТекПомещение <> Неопределено Тогда
				
				Если Не Отказ Тогда
					ПараметрыПроведений = Новый Структура(ОписаниеПараметрыПроведений,
						ТекЧастныйСектор, ТекСтроение, ТекПомещение, ТекКлючПомещения, ТекПрибор, ТекШкала, 
						ТекТарифнаяЗона, НомерПозиции, ТекРегистрируетОбъем, ТекНедопускПрибора);
						
					ОтказПоТарифнойЗоне	= Ложь;
					ОтказПоТарифнойЗоне	= ПровестиПоказанияПриборовУчета(
						ПараметрыПроведений,
						МассивДокументов,
						ДанныеСреднегоОбъема,
						ДанныеМаксимальногоПотребления,
						Ошибки,
						МенеджерыРегистров,
						СтатичныеДопПараметры);
					
					Если ОтказПоТарифнойЗоне Тогда
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если ТекПомещение <> Выборка.Помещение или ТекПрибор <> Выборка.ПриборУчета тогда
									
					Если НЕ Отказ Тогда
						
						Попытка
							
							ЗаписатьНаборыЗаписейПоПрибору(СтатичныеДопПараметры.НаборПредоставленных);
							ЗаписатьНаборыЗаписейПоПрибору(СтатичныеДопПараметры.НаборРасчетСреднего);
							ЗаписатьНаборыЗаписейПоПрибору(СтатичныеДопПараметры.НаборМаксимальныеПоказания);
							ЗаписатьНаборыЗаписей(СтатичныеДопПараметры.НаборМаксимальныеПоказанияСрез);							
							
							УстановитьУспешныйСтатусПроведенияВПоследовательности(
								МенеджерыРегистров,
								ПараметрыПроведений,
								СтатичныеДопПараметры.ПроведенСНарушением,
								СтатичныеДопПараметры.ПроведенВПоследовательности,
								ЗапросПоследовательности);
							
							ЗафиксироватьТранзакцию();
							
						Исключение
							ОтменитьТранзакцию();				
							
							ИнформацияОбОшибке = ИнформацияОбОшибке();
							ППО = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
							Ошибки.Добавить(ППО);
							
						КонецПопытки;					
						
					Иначе 
						
						ОтменитьТранзакцию();				
						
					КонецЕсли;
					
					Отказ = Ложь;
					НачатьТранзакцию();					
					
					СтатичныеДопПараметры.НаборПредоставленных.Очистить();
					СтатичныеДопПараметры.НаборРасчетСреднего.Очистить();
					СтатичныеДопПараметры.НаборМаксимальныеПоказания.Очистить();
					СтатичныеДопПараметры.НаборМаксимальныеПоказанияСрез.Очистить();					
					
				КонецЕсли;
				
				МассивДокументов.Очистить();
			КонецЕсли;
			
			Если ТекПомещение <> Выборка.Помещение Тогда
				ДанныеСреднегоОбъема = ДанныеСреднегоОбъемаАбонента(ВыборкаСреднийОбъем, Выборка);
			КонецЕсли;
			
			МассивДокументов	= Новый Массив;
			НомерПозиции 		= Выборка.НомерПозици + 1;			
			
		КонецЕсли; 	
		
		ДанныеСтроки = Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
		МассивДокументов.Добавить(ДанныеСтроки);		
		
		ДополнитьНаборЗаписейВСоответствиеПредоставленныеПоказания(СтатичныеДопПараметры, МенеджерэнргПредоставленныеПоказания, Выборка);
		ДополнитьНаборЗаписейВСоответствиеРасчетСреднегоОбъема(СтатичныеДопПараметры, МенеджерэнргРасчетСреднегоОбъема, Выборка);
		ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказания(СтатичныеДопПараметры, МенеджерэнргМаксимальныеПоказания, Выборка);
		ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказанияСрез(СтатичныеДопПараметры, МенеджерэнргМаксимальныеПоказанияСрез, Выборка); 		
				 		
		ТекЧастныйСектор 						= Выборка.ЧастныйСектор;
		ТекСтроение								= Выборка.Строение;
		ТекПомещение  							= Выборка.Помещение;
		ТекКлючПомещения						= Выборка.КлючПомещения;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекТарифнаяЗона 						= Выборка.ТарифнаяЗона;
		ТекРегистрируетОбъем					= Выборка.РегистрируетОбъем;
		ТекНедопускПрибора						= Выборка.НедопускПрибора;
		
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Итерация / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Восстановление последовательности показаний физ.лица: " + Итерация + Постфикс);
			КоличествоИтераций = 0;
		КонецЕсли;
		
		Итерация = Итерация + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;
	
	Если НЕ ТекПомещение = Неопределено  тогда
		
		Если НЕ Отказ Тогда
			ПараметрыПроведений = Новый Структура(ОписаниеПараметрыПроведений,
				ТекЧастныйСектор, ТекСтроение, ТекПомещение, ТекКлючПомещения, ТекПрибор, ТекШкала, 
				ТекТарифнаяЗона, НомерПозиции, ТекРегистрируетОбъем, ТекНедопускПрибора);
			
			ОтказПоТарифнойЗоне	= Ложь;
			ОтказПоТарифнойЗоне	= ПровестиПоказанияПриборовУчета(
				ПараметрыПроведений,
				МассивДокументов,
				ДанныеСреднегоОбъема,
				ДанныеМаксимальногоПотребления,
				Ошибки,
				МенеджерыРегистров,
				СтатичныеДопПараметры);
			
			Если ОтказПоТарифнойЗоне Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Отказ тогда
			
			Попытка
				
				ЗаписатьНаборыЗаписейПоПрибору(СтатичныеДопПараметры.НаборПредоставленных);
				ЗаписатьНаборыЗаписейПоПрибору(СтатичныеДопПараметры.НаборРасчетСреднего);
				ЗаписатьНаборыЗаписейПоПрибору(СтатичныеДопПараметры.НаборМаксимальныеПоказания);
				ЗаписатьНаборыЗаписей(СтатичныеДопПараметры.НаборМаксимальныеПоказанияСрез);  				
				
				УстановитьУспешныйСтатусПроведенияВПоследовательности(
					МенеджерыРегистров,
					ПараметрыПроведений,
					СтатичныеДопПараметры.ПроведенСНарушением,
					СтатичныеДопПараметры.ПроведенВПоследовательности,
					ЗапросПоследовательности);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();				
				
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ППО = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				Ошибки.Добавить(ППО);
				
			КонецПопытки;			
			
		иначе
			ОтменитьТранзакцию(); 			 
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Ошибки, Символы.ПС);
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанных

Функция РезультатЗапросаПоказанияПУ(МВТ, Отбор) 
	
	Запрос  = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Текст =
	"ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МинимальныйПериод
	|ИЗ
	|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|ГДЕ
	|	энргПоказанияПУПоследовательность.Организация = &Организация
	|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
	|	И энргПоказанияПУПоследовательность.Район = &Район
	|	И энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор
	|	И энргПоказанияПУПоследовательность.Строение = &Строение
	|	И энргПоказанияПУПоследовательность.Помещение = &Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПУПоследовательность.Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение,
	|	энргПоказанияПУПоследовательность.Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйПериод.Организация КАК Организация,
	|	МинимальныйПериод.ПериодНачисления КАК ПериодНачисления,
	|	МинимальныйПериод.Район КАК Район,
	|	МинимальныйПериод.ЧастныйСектор КАК ЧастныйСектор,
	|	МинимальныйПериод.Строение КАК Строение,
	|	МинимальныйПериод.Помещение КАК Помещение,
	|	МинимальныйПериод.ПриборУчета КАК ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации КАК ПериодРегистрации,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МинимальнаяДатаРегистратора
	|ИЗ
	|	МинимальныйПериод КАК МинимальныйПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО МинимальныйПериод.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальныйПериод.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальныйПериод.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальныйПериод.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И МинимальныйПериод.Строение = энргПоказанияПУПоследовательность.Строение
	|			И МинимальныйПериод.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И МинимальныйПериод.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальныйПериод.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныйПериод.Организация,
	|	МинимальныйПериод.ПериодНачисления,
	|	МинимальныйПериод.Район,
	|	МинимальныйПериод.ЧастныйСектор,
	|	МинимальныйПериод.Строение,
	|	МинимальныйПериод.Помещение,
	|	МинимальныйПериод.ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальнаяДатаРегистратора.Организация КАК Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район КАК Район,
	|	МинимальнаяДатаРегистратора.ЧастныйСектор КАК ЧастныйСектор,
	|	МинимальнаяДатаРегистратора.Строение КАК Строение,
	|	МинимальнаяДатаРегистратора.Помещение КАК Помещение,
	|	МинимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации КАК ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МинимальныйРегистратор
	|ИЗ
	|	МинимальнаяДатаРегистратора КАК МинимальнаяДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО МинимальнаяДатаРегистратора.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальнаяДатаРегистратора.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальнаяДатаРегистратора.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальнаяДатаРегистратора.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И МинимальнаяДатаРегистратора.Строение = энргПоказанияПУПоследовательность.Строение
	|			И МинимальнаяДатаРегистратора.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И МинимальнаяДатаРегистратора.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальнаяДатаРегистратора.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальнаяДатаРегистратора.Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район,
	|	МинимальнаяДатаРегистратора.ЧастныйСектор,
	|	МинимальнаяДатаРегистратора.Строение,
	|	МинимальнаяДатаРегистратора.Помещение,
	|	МинимальнаяДатаРегистратора.ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.Разделитель КАК Разделитель,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрацииПоказаний,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ Граница
	|ИЗ
	|	(ВЫБРАТЬ
	|		МинимальныйРегистратор.Организация КАК Организация,
	|		МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
	|		МинимальныйРегистратор.Район КАК Район,
	|		МинимальныйРегистратор.ЧастныйСектор КАК ЧастныйСектор,
	|		МинимальныйРегистратор.Строение КАК Строение,
	|		МинимальныйРегистратор.Помещение КАК Помещение,
	|		МинимальныйРегистратор.ПриборУчета КАК ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации КАК ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора КАК ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор КАК ДокРегистратор,
	|		МИНИМУМ(энргПоказанияПУПоследовательность.Разделитель) КАК Разделитель
	|	ИЗ
	|		МинимальныйРегистратор КАК МинимальныйРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|			ПО МинимальныйРегистратор.Организация = энргПоказанияПУПоследовательность.Организация
	|				И МинимальныйРегистратор.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|				И МинимальныйРегистратор.Район = энргПоказанияПУПоследовательность.Район
	|				И МинимальныйРегистратор.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|				И МинимальныйРегистратор.Строение = энргПоказанияПУПоследовательность.Строение
	|				И МинимальныйРегистратор.Помещение = энргПоказанияПУПоследовательность.Помещение
	|				И МинимальныйРегистратор.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|				И МинимальныйРегистратор.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|				И МинимальныйРегистратор.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|				И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|				И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|				И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|				И (энргПоказанияПУПоследовательность.Район = &Район)
	|				И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|				И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|				И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимальныйРегистратор.Организация,
	|		МинимальныйРегистратор.ПериодНачисления,
	|		МинимальныйРегистратор.Район,
	|		МинимальныйРегистратор.ЧастныйСектор,
	|		МинимальныйРегистратор.Строение,
	|		МинимальныйРегистратор.Помещение,
	|		МинимальныйРегистратор.ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.Строение = энргКлючиПомещений.Строение
	|			И ВложенныйЗапрос.Помещение = энргКлючиПомещений.Помещение
	|			И (энргКлючиПомещений.Строение = &Строение)
	|			И (энргКлючиПомещений.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ НаборПроведенныхВПоследовательности
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И Граница.Строение = энргПоказанияПУПоследовательность.Строение
	|			И Граница.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель > энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор > энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора > энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации > энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности))
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПроведенныхВПоследовательности.Организация КАК Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район КАК Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	НаборПроведенныхВПоследовательности.Строение КАК Строение,
	|	НаборПроведенныхВПоследовательности.Помещение КАК Помещение,
	|	НаборПроведенныхВПоследовательности.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МаксимальныйПериодРегистрацииПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПроведенныхВПоследовательности.Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.ЧастныйСектор,
	|	НаборПроведенныхВПоследовательности.Строение,
	|	НаборПроведенныхВПоследовательности.Помещение,
	|	НаборПроведенныхВПоследовательности.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйПериодРегистрацииПроведенных.Организация КАК Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район КАК Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйПериодРегистрацииПроведенных.Строение КАК Строение,
	|	МаксимальныйПериодРегистрацииПроведенных.Помещение КАК Помещение,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МаксимальнаяДатаПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериодРегистрацииПроведенных КАК МаксимальныйПериодРегистрацииПроведенных
	|		ПО НаборПроведенныхВПоследовательности.Организация = МаксимальныйПериодРегистрацииПроведенных.Организация
	|			И НаборПроведенныхВПоследовательности.ПериодНачисления = МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления
	|			И НаборПроведенныхВПоследовательности.Район = МаксимальныйПериодРегистрацииПроведенных.Район
	|			И НаборПроведенныхВПоследовательности.СостояниеПроведения = МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения
	|			И НаборПроведенныхВПоследовательности.ЧастныйСектор = МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор
	|			И НаборПроведенныхВПоследовательности.Строение = МаксимальныйПериодРегистрацииПроведенных.Строение
	|			И НаборПроведенныхВПоследовательности.Помещение = МаксимальныйПериодРегистрацииПроведенных.Помещение
	|			И НаборПроведенныхВПоследовательности.ПриборУчета = МаксимальныйПериодРегистрацииПроведенных.ПриборУчета
	|			И НаборПроведенныхВПоследовательности.ПериодРегистрации = МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйПериодРегистрацииПроведенных.Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор,
	|	МаксимальныйПериодРегистрацииПроведенных.Строение,
	|	МаксимальныйПериодРегистрацииПроведенных.Помещение,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаПроведенных.Организация КАК Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район КАК Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальнаяДатаПроведенных.Строение КАК Строение,
	|	МаксимальнаяДатаПроведенных.Помещение КАК Помещение,
	|	МаксимальнаяДатаПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныйРегистраторПроведенных
	|ИЗ
	|	МаксимальнаяДатаПроведенных КАК МаксимальнаяДатаПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальнаяДатаПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальнаяДатаПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальнаяДатаПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальнаяДатаПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальнаяДатаПроведенных.ЧастныйСектор = НаборПроведенныхВПоследовательности.ЧастныйСектор
	|			И МаксимальнаяДатаПроведенных.Строение = НаборПроведенныхВПоследовательности.Строение
	|			И МаксимальнаяДатаПроведенных.Помещение = НаборПроведенныхВПоследовательности.Помещение
	|			И МаксимальнаяДатаПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальнаяДатаПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальнаяДатаПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаПроведенных.Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.ЧастныйСектор,
	|	МаксимальнаяДатаПроведенных.Строение,
	|	МаксимальнаяДатаПроведенных.Помещение,
	|	МаксимальнаяДатаПроведенных.ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРегистраторПроведенных.Организация КАК Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район КАК Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйРегистраторПроведенных.Строение КАК Строение,
	|	МаксимальныйРегистраторПроведенных.Помещение КАК Помещение,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор КАК ДокРегистратор,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.Разделитель) КАК Разделитель
	|ПОМЕСТИТЬ МаксимальныйРазделительПроведенных
	|ИЗ
	|	МаксимальныйРегистраторПроведенных КАК МаксимальныйРегистраторПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальныйРегистраторПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальныйРегистраторПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальныйРегистраторПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальныйРегистраторПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальныйРегистраторПроведенных.ЧастныйСектор = НаборПроведенныхВПоследовательности.ЧастныйСектор
	|			И МаксимальныйРегистраторПроведенных.Строение = НаборПроведенныхВПоследовательности.Строение
	|			И МаксимальныйРегистраторПроведенных.Помещение = НаборПроведенныхВПоследовательности.Помещение
	|			И МаксимальныйРегистраторПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальныйРегистраторПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальныйРегистраторПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|			И МаксимальныйРегистраторПроведенных.ДокРегистратор = НаборПроведенныхВПоследовательности.ДокРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйРегистраторПроведенных.Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.ЧастныйСектор,
	|	МаксимальныйРегистраторПроведенных.Строение,
	|	МаксимальныйРегистраторПроведенных.Помещение,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРазделительПроведенных.Организация КАК Организация,
	|	МаксимальныйРазделительПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРазделительПроведенных.Район КАК Район,
	|	МаксимальныйРазделительПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйРазделительПроведенных.Строение КАК Строение,
	|	МаксимальныйРазделительПроведенных.Помещение КАК Помещение,
	|	МаксимальныйРазделительПроведенных.ПриборУчета КАК ПриборУчета,
	|	энргПредоставленныеПоказания.Шкала КАК Шкала,
	|	энргПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныйРазделительПроведенных.Разделитель КАК Разделитель,
	|	энргПредоставленныеПоказания.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ПоследниеНомераПозиции
	|ИЗ
	|	МаксимальныйРазделительПроведенных КАК МаксимальныйРазделительПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|		ПО МаксимальныйРазделительПроведенных.Организация = энргПредоставленныеПоказания.Организация
	|			И МаксимальныйРазделительПроведенных.ПериодНачисления = энргПредоставленныеПоказания.ПериодНачисления
	|			И МаксимальныйРазделительПроведенных.Район = энргПредоставленныеПоказания.Район
	|			И МаксимальныйРазделительПроведенных.ЧастныйСектор = энргПредоставленныеПоказания.ЧастныйСектор
	|			И МаксимальныйРазделительПроведенных.Строение = энргПредоставленныеПоказания.Строение
	|			И МаксимальныйРазделительПроведенных.Помещение = энргПредоставленныеПоказания.Помещение
	|			И МаксимальныйРазделительПроведенных.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И МаксимальныйРазделительПроведенных.ПериодРегистрации = энргПредоставленныеПоказания.ДатаРегистратора
	|			И МаксимальныйРазделительПроведенных.ДокРегистратор = энргПредоставленныеПоказания.ДокРегистратор
	|			И МаксимальныйРазделительПроведенных.Разделитель = энргПредоставленныеПоказания.Разделитель
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПредоставленныеПоказания.Строение = &Строение)
	|			И (энргПредоставленныеПоказания.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор КАК ДокРегистратор,
	|	Граница.Разделитель КАК Разделитель,
	|	МАКСИМУМ(энргМаксимальныеПоказания.Период) КАК ПериодМаксПоказаний
	|ПОМЕСТИТЬ МаксПерПоказаний
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО Граница.Организация = энргМаксимальныеПоказания.Организация
	|			И Граница.Район = энргМаксимальныеПоказания.Район
	|			И Граница.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И Граница.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор = энргМаксимальныеПоказания.ДокРегистратор
	|						И Граница.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор > энргМаксимальныеПоказания.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор,
	|	Граница.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	МаксПерПоказаний.Разделитель КАК Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	МАКСИМУМ(энргМаксимальныеПоказания.ДокРегистратор) КАК РегистраторМаксПоказаний
	|ПОМЕСТИТЬ РегМакПок
	|ИЗ
	|	МаксПерПоказаний КАК МаксПерПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО МаксПерПоказаний.Организация = энргМаксимальныеПоказания.Организация
	|			И МаксПерПоказаний.Район = энргМаксимальныеПоказания.Район
	|			И МаксПерПоказаний.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И МаксПерПоказаний.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И МаксПерПоказаний.Шкала = энргМаксимальныеПоказания.Шкала
	|			И МаксПерПоказаний.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И МаксПерПоказаний.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И (ВЫБОР
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор = энргМаксимальныеПоказания.ДокРегистратор
	|						И МаксПерПоказаний.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор > энргМаксимальныеПоказания.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ МаксПерПоказаний.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор,
	|	МаксПерПоказаний.Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	МАКСИМУМ(ЕСТЬNULL(энргМаксимальныеПоказания.Разделитель, 0)) КАК РазделительМаксПоказаний
	|ПОМЕСТИТЬ РазделительМакПок
	|ИЗ
	|	РегМакПок КАК РегМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО РегМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РегМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РегМакПок.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И РегМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РегМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РегМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РегМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РегМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.ДокРегистратор
	|			И (ВЫБОР
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор = энргМаксимальныеПоказания.ДокРегистратор
	|						И РегМакПок.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор > энргМаксимальныеПоказания.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ РегМакПок.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделительМакПок.Организация КАК Организация,
	|	РазделительМакПок.Район КАК Район,
	|	РазделительМакПок.КлючПомещения КАК КлючПомещения,
	|	РазделительМакПок.ПриборУчета КАК ПриборУчета,
	|	РазделительМакПок.Шкала КАК Шкала,
	|	РазделительМакПок.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РазделительМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РазделительМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	энргМаксимальныеПоказания.ДатаРегистратора КАК ДатаРегистратораМаксимальных,
	|	энргМаксимальныеПоказания.Показание КАК МаксПоказания
	|ПОМЕСТИТЬ ДанныеМаксПоказаний
	|ИЗ
	|	РазделительМакПок КАК РазделительМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО РазделительМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РазделительМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РазделительМакПок.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И РазделительМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РазделительМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РазделительМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РазделительМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РазделительМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.ДокРегистратор
	|			И РазделительМакПок.РазделительМаксПоказаний = энргМаксимальныеПоказания.Разделитель
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель,
	|	энргПоказанияПУПоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	энргПоказанияПУПоследовательность.ИмяТабЧасти КАК ИмяТабЧасти,
	|	Граница.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности) КАК ИсключенИзПоследовательности
	|ПОМЕСТИТЬ НаборДокументов
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И Граница.Строение = энргПоказанияПУПоследовательность.Строение
	|			И Граница.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель <= энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор < энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора < энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации < энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.Организация КАК Организация,
	|	энргПоказанияПриборовУчета.Район КАК Район,
	|	энргПоказанияПриборовУчета.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргПоказанияПриборовУчета.Переворот
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БылПереворот
	|ПОМЕСТИТЬ ДанныеПоПереворотам
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.Район = энргПоказанияПриборовУчета.Район
	|			И НаборДокументов.КлючПомещения = энргПоказанияПриборовУчета.КлючПомещения
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И (энргПоказанияПриборовУчета.Период МЕЖДУ НаборДокументов.ДатаРегистратора И НаборДокументов.ПериодРегистрации)
	|			И (энргПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
	|			И НаборДокументов.ДокРегистратор <> энргПоказанияПриборовУчета.Регистратор
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПриборовУчета.Организация,
	|	энргПоказанияПриборовУчета.Район,
	|	энргПоказанияПриборовУчета.КлючПомещения,
	|	энргПоказанияПриборовУчета.ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборДокументов.Организация КАК Организация,
	|	НаборДокументов.ПериодНачисления КАК ПериодНачисления,
	|	НаборДокументов.Район КАК Район,
	|	НаборДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	НаборДокументов.Строение КАК Строение,
	|	НаборДокументов.Помещение КАК Помещение,
	|	НаборДокументов.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор КАК ДокРегистратор,
	|	НаборДокументов.Разделитель КАК Разделитель,
	|	НаборДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	энргПоказанияПриборовУчета.Показание КАК Показание,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	энргПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|	энргПоказанияПриборовУчета.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	энргПоказанияПриборовУчета.КС КАК КС,
	|	энргПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	НаборДокументов.КлючПомещения КАК КлючПомещения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргОперацияСЛицевымСчетом)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргОперацияСУслугами)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргОперацияСУслугами).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргОперацияСПриборомУчета)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргОперацияСПриборомУчета).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргАктированиеНедопускаДопускаВПомещение)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргАктированиеНедопускаДопускаВПомещение).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргПерерасчет)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.ПустаяСсылка)
	|	КОНЕЦ КАК ВидОперации,
	|	энргПоказанияПриборовУчета.ПериодНачисления КАК ПериодНачисленияКорректировки   // если это корректировка показаний, то этот период меньше НаборДокументов.ПериодНачисления
	|ПОМЕСТИТЬ ДанныеДокументов
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.ПериодРегистрации = энргПоказанияПриборовУчета.Период
	|			И НаборДокументов.ДокРегистратор = энргПоказанияПриборовУчета.Регистратор
	|			И НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.КлючПомещения = энргПоказанияПриборовУчета.КлючПомещения
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И НаборДокументов.Разделитель = энргПоказанияПриборовУчета.Разделитель
	|			И (НаборДокументов.ИсключенИзПоследовательности = ЛОЖЬ)
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.Район = &Район)
	|			И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборДокументов.Организация,
	|	НаборДокументов.ПериодНачисления,
	|	НаборДокументов.Район,
	|	НаборДокументов.ЧастныйСектор,
	|	НаборДокументов.Строение,
	|	НаборДокументов.Помещение,
	|	НаборДокументов.ПриборУчета,
	|	ДанныеМаксПоказаний.Шкала,
	|	ДанныеМаксПоказаний.ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор,
	|	НаборДокументов.Разделитель,
	|	НаборДокументов.ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены),
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	НаборДокументов.КлючПомещения,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.ПустаяСсылка),
	|	НаборДокументов.ПериодНачисления
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО НаборДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И НаборДокументов.Район = ДанныеМаксПоказаний.Район
	|			И НаборДокументов.КлючПомещения = ДанныеМаксПоказаний.КлючПомещения
	|			И НаборДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И (НаборДокументов.ИсключенИзПоследовательности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоэффциентыПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент КАК коэффициент
	|ПОМЕСТИТЬ КоэффициентыПриборов
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И (Организация, Район, КлючПомещения, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ДанныеДокументов.Организация КАК Организация,
	|						ДанныеДокументов.Район КАК Район,
	|						ДанныеДокументов.КлючПомещения КАК КлючПомещения,
	|						ДанныеДокументов.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ДанныеДокументов КАК ДанныеДокументов)) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокументов.Район КАК Район,
	|	ДанныеДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДокументов.Строение КАК Строение,
	|	ДанныеДокументов.Помещение КАК Помещение,
	|	ДанныеДокументов.ПриборУчета КАК ПриборУчета,
	|	ДанныеДокументов.Шкала КАК Шкала,
	|	ДанныеДокументов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	ДанныеДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	ДанныеДокументов.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеДокументов.Разделитель КАК Разделитель,
	|	ДанныеДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ДанныеДокументов.Показание КАК Показание,
	|	ДанныеДокументов.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ДанныеДокументов.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ДанныеДокументов.Переворот КАК Переворот,
	|	ДанныеДокументов.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ДанныеДокументов.КС КАК КС,
	|	ДанныеДокументов.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(КоэффициентыПриборов.коэффициент, 1) КАК коэффициентПУ,
	|	ЕСТЬNULL(ПоследниеНомераПозиции.НомерПозиции, -1) КАК НомерПозици,
	|	ЕСТЬNULL(ДанныеПоПереворотам.БылПереворот, 0) КАК БылПереворот,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ПериодМаксПоказаний, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.МаксПоказания, -1) КАК МаксПоказания,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.РегистраторМаксПоказаний, ЗНАЧЕНИЕ(Документ.энргРегистрацияПоказанийАбонента.ПустаяСсылка)) КАК РегистраторМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ДатаРегистратораМаксимальных, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратораМаксимальных,
	|	ДанныеДокументов.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	ЛОЖЬ КАК НедопускПрибора,
	|	ДанныеДокументов.ВидОперации КАК ВидОперации,
	|	ДанныеДокументов.ПериодНачисленияКорректировки КАК ПериодНачисленияКорректировки
	|ИЗ
	|	ДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ДанныеДокументов.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриборов КАК КоэффициентыПриборов
	|		ПО ДанныеДокументов.КлючПомещения = КоэффициентыПриборов.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = КоэффициентыПриборов.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеНомераПозиции КАК ПоследниеНомераПозиции
	|		ПО ДанныеДокументов.Организация = ПоследниеНомераПозиции.Организация
	|			И ДанныеДокументов.ПериодНачисления = ПоследниеНомераПозиции.ПериодНачисления
	|			И ДанныеДокументов.Район = ПоследниеНомераПозиции.Район
	|			И ДанныеДокументов.ЧастныйСектор = ПоследниеНомераПозиции.ЧастныйСектор
	|			И ДанныеДокументов.Строение = ПоследниеНомераПозиции.Строение
	|			И ДанныеДокументов.Помещение = ПоследниеНомераПозиции.Помещение
	|			И ДанныеДокументов.ПриборУчета = ПоследниеНомераПозиции.ПриборУчета
	|			И ДанныеДокументов.Шкала = ПоследниеНомераПозиции.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ПоследниеНомераПозиции.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПереворотам КАК ДанныеПоПереворотам
	|		ПО ДанныеДокументов.Организация = ДанныеПоПереворотам.Организация
	|			И ДанныеДокументов.Район = ДанныеПоПереворотам.Район
	|			И ДанныеДокументов.КлючПомещения = ДанныеПоПереворотам.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = ДанныеПоПереворотам.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеПоПереворотам.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеПоПереворотам.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО ДанныеДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И ДанныеДокументов.Район = ДанныеМаксПоказаний.Район
	|			И ДанныеДокументов.КлючПомещения = ДанныеМаксПоказаний.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеМаксПоказаний.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеМаксПоказаний.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	Помещение,
	|	ПриборУчета,
	|	Шкала,
	|	ТарифнаяЗона,
	|	ПериодРегистрации,
	|	ДатаРегистратора,
	|	ДокРегистратор,
	|	Разделитель";
	
	Если НЕ Строения = Неопределено Тогда
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
		Текст 			= СтрЗаменить(Текст,".Строение = &Строение", ".Строение В(&Строения)");
		
	ИначеЕсли ЧастныйСектор = Неопределено Тогда
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
	ИначеЕсли Не ЗначениеЗаполнено(Помещение) И Не ЧастныйСектор Тогда
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
	КонецЕсли;
		
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Период",						Отбор.КонецПериодаРасчета); 	
	Запрос.УстановитьПараметр("ПериодНачисления",			ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Район",						Район); 	
	Запрос.УстановитьПараметр("ЧастныйСектор",				ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение",					Строение);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",		Отбор.НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",		Отбор.НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КолвоНедопусковПодряд",		Отбор.КолвоНедопусковПодряд); 	
	
	Если НЕ Строения = Неопределено Тогда 
		Запрос.УстановитьПараметр("Строения", Строения);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Помещение) Или ЗначениеЗаполнено(Строение) И ЧастныйСектор Тогда
		СтруктураКлючПомещения = РегистрыСведений.энргКлючиПомещений.ПолучитьДанныеПомещенияСОтбором(Строение, Помещение);
		
		Запрос.УстановитьПараметр("КлючПомещения",			СтруктураКлючПомещения.КлючПомещения);
		Запрос.УстановитьПараметр("Помещение",				Помещение);
		
		Если Не Отбор.ПриборУчета  = Неопределено Тогда
			Запрос.УстановитьПараметр("ПриборУчета",		Отбор.ПриборУчета);
		КонецЕсли; 	
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДанныеМаксимальногоПотребления(НачалоПериодаРасчета)
	
	Результат = Новый Соответствие;
	
	Схема = Неопределено;
	СоотвествиеПолей = Новый Структура("Организация", "Организация");
	ПараметрыЗапроса = Новый Структура("Организация", Организация); 
	ПараметрыЗапроса.Вставить("Период", КонецМесяца(НачалоПериодаРасчета) + 1);
		
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	ПараметрПериод = энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период");
	
	ПараметрыСхемы = Новый Структура(
		"ПараметрыВТ, Период", 
		ПараметрыВТ, ПараметрПериод);
	
	РегистрыСведений.энргМаксимальныеПоказателиПотребления.МаксимальныеПоказателиПотребления(Схема, ПараметрыСхемы);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
	
	//Запрос  		= Новый Запрос;
	//Запрос.УстановитьПараметр("Период", КонецМесяца(НачалоПериодаРасчета) + 1);
	//Запрос.Текст 	= "ВЫБРАТЬ
	//|	энргМаксимальныеПоказателиПотребленияСрезПоследних.Услуга,
	//|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ТарифнаяЗона,
	//|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ПовышающийКоэффициент,
	//|	энргМаксимальныеПоказателиПотребленияСрезПоследних.МаксимальноеПотребления
	//|ИЗ
	//|	РегистрСведений.энргМаксимальныеПоказателиПотребления.СрезПоследних(&Период, ) КАК энргМаксимальныеПоказателиПотребленияСрезПоследних";
	//РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДобавления = Новый Структура("ПовышающийКоэффициент,МаксимальноеПотребления", Выборка.ПовышающийКоэффициент, Выборка.МаксимальноеПотребления);
		Результат.Вставить(Выборка.Услуга, СтрокаДобавления);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСоСреднимОбъемомАбонентов

Функция РезультатСреднийОбъемПотребления(МВТ, Отбор)
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияАбонентов.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияАбонентов.Район КАК Район,
	|	энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСреднийОбъемПотребленияАбонентов.Строение КАК Строение,
	|	энргСреднийОбъемПотребленияАбонентов.Помещение КАК Помещение,
	|	энргСреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияАбонентов.Объем КАК Объем
	|ПОМЕСТИТЬ СреднийОбъем
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК энргСреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	энргСреднийОбъемПотребленияАбонентов.Организация = &Организация
	|	И энргСреднийОбъемПотребленияАбонентов.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребленияАбонентов.Район = &Район
	|	И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор
	|	И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение
	|	И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Граница.Организация КАК Организация,
	|	Граница.ПериодНачисления КАК ПериодНачисления,
	|	Граница.Район КАК Район,
	|	Граница.ЧастныйСектор КАК ЧастныйСектор,
	|	Граница.Строение КАК Строение,
	|	Граница.Помещение КАК Помещение,
	|	ЕСТЬNULL(СреднийОбъем.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчета,
	|	ЕСТЬNULL(СреднийОбъем.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СреднийОбъем.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(СреднийОбъем.Объем, 0) КАК СреднееПотребление
	|ИЗ
	|	Граница КАК Граница
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъем КАК СреднийОбъем
	|		ПО Граница.Организация = СреднийОбъем.Организация
	|			И Граница.ПериодНачисления = СреднийОбъем.ПериодНачисления
	|			И Граница.Район = СреднийОбъем.Район
	|			И Граница.ЧастныйСектор = СреднийОбъем.ЧастныйСектор
	|			И Граница.Строение = СреднийОбъем.Строение
	|			И Граница.Помещение = СреднийОбъем.Помещение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	Помещение,
	|	Шкала,
	|	ТарифнаяЗона"; 
	
	Если НЕ Строения = Неопределено Тогда
		
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
		
		Текст 						= СтрЗаменить(Текст,".Строение = &Строение", ".Строение В(&Строения)");
		
	ИначеЕсли ЧастныйСектор  = Неопределено Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	ИначеЕсли Не ЗначениеЗаполнено(Строение) Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	ИначеЕсли Не ЗначениеЗаполнено(Помещение) И Не ЧастныйСектор Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	КонецЕсли;
	
	Запрос = Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Организация"		, Организация);	
	Запрос.УстановитьПараметр("Район"			, Район);  	
	Запрос.УстановитьПараметр("ЧастныйСектор"	, ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение"		, Строение);
	
	Если НЕ Строения = Неопределено Тогда 
		Запрос.УстановитьПараметр("Строения", Строения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Помещение) Или ЗначениеЗаполнено(Строение) И ЧастныйСектор Тогда
		Запрос.УстановитьПараметр("Помещение", Помещение);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Возврат РезультатЗапроса
	
КонецФункции

Функция ДанныеСреднегоОбъемаАбонента(ВыборкаСреднийОбъем, Выборка) 
	
	ТекТочкаУчета					= Неопределено;
	ТекШкала 						= Неопределено;
	СоотвествиеТочек 				= Новый Соответствие;
	СоответствиеЗоны 				= Неопределено;
	СоотвествиеШкал 				= Неопределено;
	Пока ВыборкаСреднийОбъем.ЧастныйСектор  = Выборка.ЧастныйСектор и ВыборкаСреднийОбъем.Строение = Выборка.Строение и ВыборкаСреднийОбъем.Помещение = Выборка.Помещение цикл		
		Если ЗначениеЗаполнено(ВыборкаСреднийОбъем.Шкала) и ЗначениеЗаполнено(ВыборкаСреднийОбъем.ТарифнаяЗона) Тогда
			Если ТекШкала <> ВыборкаСреднийОбъем.Шкала Тогда
				Если ТекШкала <> Неопределено тогда
					СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли;
			
			Если ТекТочкаУчета <> ВыборкаСреднийОбъем.ТочкаУчета тогда
				Если ТекТочкаУчета <> Неопределено тогда
					СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли; 	
			
			СоответствиеЗоны.Вставить(ВыборкаСреднийОбъем.ТарифнаяЗона, ВыборкаСреднийОбъем.СреднееПотребление);
		КонецЕсли;
	
		Если не ВыборкаСреднийОбъем.Следующий() тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	 	
	Если ТекШкала <> Неопределено тогда
		СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
	КонецЕсли;		
		
	Если ТекТочкаУчета <> Неопределено тогда
		СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
	КонецЕсли;	  
	
	Возврат СоотвествиеТочек;
	
КонецФункции
	
#КонецОбласти

#Область ПроцессВосстановления

Функция ПровестиПоказанияПриборовУчета(ПараметрыПроведений, МассивДокументов, ДанныеСреднегоОбъема, ДанныеМаксимальногоПотребления, Ошибки, МенеджерыРегистров, СтатичныеДопПараметры)
	
	МенеджерэнргПоказанияПУПоследовательность = МенеджерыРегистров.энргПоказанияПУПоследовательность;	
	МенеджерэнргПредоставленныеПоказания	  = МенеджерыРегистров.энргПредоставленныеПоказания;	
	МенеджерэнргРасчетСреднегоОбъема		  =	МенеджерыРегистров.энргРасчетСреднегоОбъема;
	МенеджерэнргМаксимальныеПоказания		  =	МенеджерыРегистров.энргМаксимальныеПоказания;	
	МенеджерэнргМаксимальныеПоказанияСрез	  =	МенеджерыРегистров.энргМаксимальныеПоказанияСрез;
	
	ПриборУчета 			= ПараметрыПроведений.ПриборУчета;
	НомерПозиции 			= ПараметрыПроведений.НомерПозиции;    
	ПоказанияС 				= СтатичныеДопПараметры.ПоказанияС;
	ПоказанияПО 			= СтатичныеДопПараметры.ПоказанияПО;
	НачалоПериодаРасчета 	= СтатичныеДопПараметры.НачалоПериодаРасчета;
	РегистрируетОбъем		= ПараметрыПроведений.РегистрируетОбъем;
	НедопускПрибора         = ПараметрыПроведений.НедопускПрибора;
	ПричиныОтклоненияИсключая = СтатичныеДопПараметры.ПричиныОтклоненияИсключая;
	
	РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу 	= СтатичныеДопПараметры.РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу;
	НачПокНеЯвляютсяКонечнымиПриУстПрибора				= СтатичныеДопПараметры.НачПокНеЯвляютсяКонечнымиПриУстПрибора;
	
	Исключен  										= СтатичныеДопПараметры.Исключен;
	ПоказанияОтклонены 								= СтатичныеДопПараметры.ПоказанияОтклонены;
	ПоказанияПриняты 								= СтатичныеДопПараметры.ПоказанияПриняты;
	
	НаборПредоставленныхВерхнийУровень 				= СтатичныеДопПараметры.НаборПредоставленных;
	НаборРасчетСреднегоВерхнийУровень 				= СтатичныеДопПараметры.НаборРасчетСреднего;
	НаборМаксимальныеПоказанияВерхнийУровень 		= СтатичныеДопПараметры.НаборМаксимальныеПоказания;
	НаборМаксимальныеПоказанияСрезВерхнийУровень 	= СтатичныеДопПараметры.НаборМаксимальныеПоказанияСрез;
	
	Попытка
		
		ТекНомерПозиции = НомерПозиции;
		
		ПредыдущиеМакс 					= Макс(МассивДокументов[0].МаксПоказания,0);
		ПериодПредыдущихМаксПок 		= МассивДокументов[0].ПериодМаксПоказаний;
		РегистраторМаксимальных 		= МассивДокументов[0].РегистраторМаксПоказаний;
		ДатаРегистратораМаксимальных 	= МассивДокументов[0].ДатаРегистратораМаксимальных;
		
		МаксимальныеПоказания = Новый Соответствие; 		
		
		для Каждого Выборка из МассивДокументов цикл
			
			Если Выборка.СостояниеПроведения = Исключен тогда 
				
				ОчиститьДанныеИсключенногоИзПоследовательности(МенеджерыРегистров, Выборка, ПараметрыПроведений);
				Продолжить;
				
			КонецЕсли;
			
			Если НЕ ПричиныОтклоненияИсключая.Найти(Выборка.ПричинаОтклонения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			 				
			СостояниеПоказаний  					= Выборка.состояниеПоказаний;
			ПричинаОтклонения						= Выборка.ПричинаОтклонения;
			Переворот  								= Выборка.Переворот;
			
			ОбновлятьДанные 						= Истина;
			ЭтоОткрытие 							= Ложь;
			ЭтоДокументнСДатойФакта					= Ложь;
			ЭтоИзменениеПоказаний					= Ложь;
			
			Текущие  								= Выборка.Показание;
			
			ЭтоМаксимальные 						= Ложь;			
			Если РегистрируетОбъем Тогда
				ЭтоМаксимальные 					= СостояниеПоказаний = ПоказанияПриняты;
			Иначе
				ЭтоМаксимальные 					= (ПредыдущиеМакс <=  Текущие или Переворот);
			КонецЕсли;
			
			// Обновляем показания в документа.
			ТипДокумента = ТипЗнч(Выборка.ДокРегистратор);
			Если Выборка.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС Тогда
				ОбновлятьДанные = Ложь;
				ЭтоОткрытие 	= Истина;
				ЭтоМаксимальные = Истина;
				Если НачалоДня(Выборка.ДатаРегистратора) = НачалоДня(Выборка.ПериодРегистрации) Тогда
					ЭтоДокументнСДатойФакта	= Истина;
				КонецЕсли;
				
			ИначеЕсли Выборка.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги Тогда 
				ОбновлятьДанные = Ложь;
				ЭтоМаксимальные = Истина;
				ЭтоОткрытие 	= Истина;
				Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
					ЭтоДокументнСДатойФакта	= Истина;
				КонецЕсли;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.энргПерерасчет") Тогда
				ОбновлятьДанные 		= Ложь;
				ЭтоМаксимальные 		= Истина;
				ЭтоИзменениеПоказаний	= Истина;
			ИначеЕсли Выборка.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ Тогда				
				ОбновлятьДанные = Ложь;
				ЭтоМаксимальные = Истина;
				ЭтоОткрытие 	= Истина;
				Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
					ЭтоДокументнСДатойФакта	= Истина;
				КонецЕсли;
			ИначеЕсли Выборка.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ Тогда
				
				ТабЧасть  		= Выборка.ДокРегистратор["ТочкиУчета"];
				СтрокиПрибора	= ТабЧасть.найтиСтроки(Новый Структура("ПриборУчета", ПриборУчета));
				Если НЕ СтрокиПрибора.Количество() = 0 Тогда
					ОбновлятьДанные = Ложь;
					ЭтоМаксимальные = Истина;
					ЭтоОткрытие 	= Истина;
					Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
						ЭтоДокументнСДатойФакта	= Истина;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли Выборка.ВидОперации = Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение Тогда				
				
				ОбновлятьДанные = Ложь;
				ЭтоМаксимальные = Истина;
				ЭтоОткрытие 	= Истина;
				Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
					ЭтоДокументнСДатойФакта	= Истина;
				КонецЕсли;	
				
				
			КонецЕсли;   			
			
			
			Если РегистрируетОбъем Тогда
				ОбновлятьДанные = Ложь;
			КонецЕсли;
			
			Если ОбновлятьДанные Тогда 
					
				ПараметрыОперации = СтатичныеДопПараметры.ПараметрыОперации;
				ЗаполнитьЗначенияСвойств(ПараметрыОперации, ПараметрыПроведений, "КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,НедопускПрибора");
				ЗаполнитьЗначенияСвойств(ПараметрыОперации, Выборка, "СостояниеПоказаний,ПричинаОтклонения,Переворот,НомерСтрокиТЧ,Разделитель,МаксимальноВозможныеПоказания,КоэффициентПУ,ИмяТабЧасти,КС");
				ПараметрыОперации.ПредыдущиеМакс 					= ПредыдущиеМакс;
				ПараметрыОперации.ПериодПредыдущихМаксПок 			= ПериодПредыдущихМаксПок;
				ПараметрыОперации.ДанныеМаксимальногоПотребления 	= ДанныеМаксимальногоПотребления;
				ПараметрыОперации.ДанныеСреднегоОбъема 				= ДанныеСреднегоОбъема;
				
				ОбновитьДанныеВДокументе(ПериодНачисления, Выборка.ДокРегистратор, ПараметрыОперации);
				
				СостояниеПоказаний 	= ПараметрыОперации.СостояниеПоказаний;
				Переворот 			= ПараметрыОперации.Переворот;
				
			КонецЕсли;	
			
			ВСрок = Истина;
			
			Если ЭтоДокументнСДатойФакта  Тогда 
				// показания от документов с датой факта всегда не в срок 
				ВСрок = Ложь;
			КонецЕсли;
			
			Если НЕ ЭтоОткрытие Или ЭтоДокументнСДатойФакта Тогда 
				// Проверять "ВСрок" только документы регистрации показаний 
				ВСрок = Выборка.ПериодРегистрации >= НачалоПериодаРасчета и День(Выборка.ПериодРегистрации) >= ПоказанияС и День(Выборка.ПериодРегистрации) <= ПоказанияПО И НЕ НедопускПрибора;
			КонецЕсли;			
			
			Если ЭтоИзменениеПоказаний Тогда 
				ВСрок = Ложь;
			КонецЕсли;

			Если РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу и ВСрок и СостояниеПоказаний = Перечисления.энргСостояниеПоказаний.Отклонены Тогда
				Продолжить;
			КонецЕсли;
			
			Если НачПокНеЯвляютсяКонечнымиПриУстПрибора И ЭтоОткрытие и ВСрок Тогда 
				// Показания ввода прибора учета не должны учитываться как конечные при непредоставлении показаний
				ВСрок = Ложь;
			КонецЕсли;
			
					
			Если Выборка.ДатаРегистратора < Выборка.ПериодРегистрации тогда
				// Может быть либо у потерянной квитанции или у контрольного съема который НЕ с 23-26.
				Если Выборка.БылПереворот = 1 тогда
					ЭтоМаксимальные = Ложь;			 
				КонецЕсли; 			 
			КонецЕсли;
									
			Если НЕ СостояниеПоказаний = ПоказанияПриняты тогда
				ЭтоМаксимальные = Ложь;
			КонецЕсли;
						
			Если СостояниеПоказаний = ПоказанияПриняты и Не ЭтоОткрытие Тогда
				
				Если НаборРасчетСреднегоВерхнийУровень[Выборка.ДокРегистратор] <> Неопределено И НаборРасчетСреднегоВерхнийУровень[Выборка.ДокРегистратор][ПриборУчета] <> Неопределено Тогда 
					НаборРасчетСреднего = НаборРасчетСреднегоВерхнийУровень[Выборка.ДокРегистратор][ПриборУчета];
					СтрокаНабор = НаборРасчетСреднего.Добавить();
					СтрокаНабор.ПериодНачисления = НаборРасчетСреднего.Отбор.ПериодНачисления.Значение;
					СтрокаНабор.Организация 	 = Организация;
					СтрокаНабор.Район			 = Район;
					ЗаполнитьЗначенияСвойств(СтрокаНабор, ПараметрыПроведений, "Строение,Помещение,ЧастныйСектор,Шкала,ТарифнаяЗона");
					ЗаполнитьЗначенияСвойств(СтрокаНабор, Выборка, "ТочкаУчета,ДокРегистратор,Разделитель");
					Если РегистрируетОбъем Тогда
						СтрокаНабор.ОбъемУслуги = Текущие;
					Иначе	
						СтрокаНабор.ОбъемУслуги = Текущие - ПредыдущиеМакс;
					КонецЕсли; 				
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтоИзменениеПоказаний Тогда
				ПоказанияТекущегоПериода = Ложь;
			Иначе 
				ПоказанияТекущегоПериода = Выборка.ПериодРегистрации >= НачалоПериодаРасчета;
			КонецЕсли;
			
			Если ЭтоМаксимальные тогда
				
				ПериодПредыдущихМаксПок 		= Выборка.ПериодРегистрации;
				ПредыдущиеМакс 					= Текущие;				
				РегистраторМаксимальных 		= Выборка.ДокРегистратор;
				ДатаРегистратораМаксимальных 	= Выборка.ДатаРегистратора;
				
				НаборМаксПоказаний = НаборМаксимальныеПоказанияВерхнийУровень[Выборка.ДокРегистратор][ПриборУчета];
				СтрокаМаксимальных = НаборМаксПоказаний.Добавить();				
				ЗаполнитьЗначенияСвойств(СтрокаМаксимальных, ПараметрыПроведений, "КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона");
				ЗаполнитьЗначенияСвойств(СтрокаМаксимальных, Выборка, "ДокРегистратор,Разделитель,Показание,ДатаРегистратора");
				СтрокаМаксимальных.Период 		= Выборка.ПериодРегистрации;
				СтрокаМаксимальных.Организация 	= Организация;
				СтрокаМаксимальных.Район 		= Район;
								
			КонецЕсли; 			 			
			
			Если СостояниеПоказаний = ПоказанияПриняты ИЛИ ВСрок Тогда
				
				ЭтоПерерасчет = ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.энргПерерасчет");
				
				НаборПредоставленных = НаборПредоставленныхВерхнийУровень[Выборка.ДокРегистратор][ПриборУчета];
				СтрокаНабор = НаборПредоставленных.Добавить();
				СтрокаНабор.Организация 	 	= Организация;
				СтрокаНабор.ПериодНачисления 	= ПериодНачисления;
				СтрокаНабор.ПериодНачисленияКорректировки 	= Выборка.ПериодНачисленияКорректировки;
				СтрокаНабор.Район				= Район;
				ЗаполнитьЗначенияСвойств(СтрокаНабор, ПараметрыПроведений, "Строение,Помещение,ЧастныйСектор,ПриборУчета,Шкала,ТарифнаяЗона");
				ЗаполнитьЗначенияСвойств(СтрокаНабор, Выборка, "ДокРегистратор,Разделитель");
				СтрокаНабор.НомерПозиции  			= ?(ЭтоПерерасчет, -1, ТекНомерПозиции);
				СтрокаНабор.ДатаРегистратора  		= Выборка.ПериодРегистрации;
				СтрокаНабор.ВСрок  					= ВСрок;
				СтрокаНабор.ПоказанияТекущегоПериода= ПоказанияТекущегоПериода;
				Если РегистрируетОбъем Тогда
					СтрокаНабор.Показания  = ?(СостояниеПоказаний = ПоказанияПриняты, Текущие, 0);
				Иначе
					СтрокаНабор.Показания  = ?(ПредыдущиеМакс < 0, 0, ПредыдущиеМакс);
				КонецЕсли;				
				
				Если ЭтоПерерасчет = Ложь Тогда 
					ТекНомерПозиции = ТекНомерПозиции + 1;
				КонецЕсли; 				
				
			КонецЕсли;			
						
		КонецЦикла;		
		
		Набор = НаборМаксимальныеПоказанияСрезВерхнийУровень[ПриборУчета];
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.Организация 		= Организация;
		СтрокаНабора.ПериодНачисления 	= ПериодНачисления;
		СтрокаНабора.Район				= Район;
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ПараметрыПроведений, "Строение,Помещение,ЧастныйСектор,ПриборУчета,Шкала,ТарифнаяЗона");
		СтрокаНабора.Показания 			= ПредыдущиеМакс;
		СтрокаНабора.ДокРегистратор 	= РегистраторМаксимальных;
		СтрокаНабора.ДатаРегистратора 	= ДатаРегистратораМаксимальных;		 	
		
		Возврат Ложь;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ППО = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Ошибки.Добавить(ППО); 		
		
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

Функция НовыеПараметрыОперации()
	
	Результат = Новый Структура(
		"КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,
		|ПериодПредыдущихМаксПок,СостояниеПоказаний,ПричинаОтклонения,ДанныеМаксимальногоПотребления,
		|Переворот,НомерСтрокиТЧ,Разделитель,ДанныеСреднегоОбъема,МаксимальноВозможныеПоказания,
		|КоэффициентПУ,ИмяТабЧасти,КС,НедопускПрибора");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеДанныхВДокументе

Процедура ОбновитьДанныеВДокументе(ПериодНачисления, ДокРегистратор, ПараметрыОперации)
	
	ПоказанияПриняты 									= Перечисления.энргСостояниеПоказаний.Приняты;
	ЭтоОперацияСПрибором								= ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчета");
	ЭтоСменаВидаДиффер									= ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргУстановитьВидДифференцированностиПриборУчета");
	ДокОбъект  											= ДокРегистратор.получитьОбъект();
	ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
	
	Если ЗначениеЗаполнено(ПараметрыОперации.ИмяТабЧасти) тогда
		ИмяТЧ 											= ПараметрыОперации.ИмяТабЧасти;
	иначе
		ИмяТЧ 											= ИмяТабличнойЧастиПоказаний(ДокРегистратор);
	КонецЕсли;
	
	тчТочкиУчета 										= ДокОбъект["ТочкиУчета"];
	тчШкалыПриборов 									= ДокОбъект["ШкалыПриборовУчета"];
	тчПоказания 										= ДокОбъект["ПоказанияПриборовУчета"];
	
	Если ПараметрыОперации.НомерСтрокиТЧ > 0 тогда
		СтрокаПоказаний									= тчПоказания[ПараметрыОперации.НомерСтрокиТЧ-1];
		СтрокиШкал										= тчШкалыПриборов.НайтиСтроки(Новый Структура("IDСтроки", СтрокаПоказаний.IDСтроки));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;		
		СтрокаШкалы 									= СтрокиШкал[0];
		СтрокиТочки										= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", 		СтрокаШкалы.IDСтрокиТочкиУчета));
		ЭтоНовыйВидДифф									= Истина;
		
		Если ЭтоОперацияСПрибором и СтрокиТочки.Количество() = 0 Тогда
			СтрокиТочки									= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиВывод", СтрокаШкалы.IDСтрокиТочкиУчета));
		КонецЕсли; 
		Если ЭтоСменаВидаДиффер и СтрокиТочки.Количество() = 0 Тогда
			СтрокиТочки									= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиВывод", СтрокаШкалы.IDСтрокиТочкиУчета));
			ЭтоНовыйВидДифф								= Ложь;
		КонецЕсли;
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;
		Если ЭтоСменаВидаДиффер И ЭтоНовыйВидДифф Тогда
			// Тарифная зона по новому виду дифференцированности. По строкам нового вида диф не должны обновляться строки 
			Возврат;
		КонецЕсли;
		
		СтрокаТочки 									= СтрокиТочки[0];
	иначе		
		СтрокиТочки		 								= тчТочкиУчета.найтиСтроки(Новый Структура("ПриборУчета",ПараметрыОперации.ПриборУчета));
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;		
		СтрокаТочки  									= СтрокиТочки[0];
		
		СтрокиШкал 										= тчШкалыПриборов.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета, Шкала",СтрокаТочки.IDСтроки, ПараметрыОперации.Шкала));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаШкалы                                    	= СтрокиШкал[0];
		СтрокиПоказаний 								= тчПоказания.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", СтрокаШкалы.IDСтроки, ПараметрыОперации.ТарифнаяЗона));
		Если СтрокиПоказаний.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета " +  ПараметрыОперации.ПриборУчета + " и тарифной зоны " +  ПараметрыОперации.ТарифнаяЗона  + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаПоказаний 								= СтрокиПоказаний[0];
		
	КонецЕсли;  
	
	ДанныеСреднегоОбъема 								= ПараметрыОперации.ДанныеСреднегоОбъема; 	
	
	Если СтрокаТочки = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли  ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона] = Неопределено тогда
		СреднийОбъема 									= 0;
	иначе
		СреднийОбъема 									= ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона];
	КонецЕсли;
	
	ДанныеМаксимальногоПотребления 						= ПараметрыОперации.ДанныеМаксимальногоПотребления;
	Если ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга] = Неопределено тогда
		МаксимальноВозможныйОбъемПотребления 			= 1000;
	иначе 
		СтрокаСоотвествия 								= ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга];
		МаксимальноВозможныйОбъемПотребления 			= СтрокаСоотвествия.ПовышающийКоэффициент * СтрокаСоотвествия.МаксимальноеПотребления;	
	КонецЕсли;
	
	ДанныеСтроки 										= энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ДанныеСтрокиПоказаний();
	ЗаполнитьЗначенияСвойств(
		ДанныеСтроки,
		СтрокаПоказаний,
		"ТекущиеПоказания,Разница,ПереворотИзмененПользователем,СтатусИзмененПользователем,Сумма,ЗначениеТарифа");
	ЗаполнитьЗначенияСвойств(
		ДанныеСтроки,
		ПараметрыОперации,
		"СостояниеПоказаний,ПричинаОтклонения,МаксимальноВозможныеПоказания,КоэффициентПУ,Переворот");	
		
	//ДанныеСтроки.ТекущиеПоказания	 					= СтрокаПоказаний.ТекущиеПоказания;
	//ДанныеСтроки.Разница 								= СтрокаПоказаний.Разница;
	//ДанныеСтроки.ПереворотИзмененПользователем 			= СтрокаПоказаний.ПереворотИзмененПользователем;
	//ДанныеСтроки.СтатусИзмененПользователем 			= СтрокаПоказаний.СтатусИзмененПользователем;
	//ДанныеСтроки.Сумма				 					= СтрокаПоказаний.Сумма;
	//ДанныеСтроки.ЗначениеТарифа				 			= СтрокаПоказаний.ЗначениеТарифа;
	
	ДанныеСтроки.ПредыдущиеПоказания 					= ПараметрыОперации.ПредыдущиеМакс;
	ДанныеСтроки.ДатаПоследнихПоказаний 				= НачалоДня(ПараметрыОперации.ПериодПредыдущихМаксПок);
	ДанныеСтроки.СреднийОбъемПотребления 				= СреднийОбъема;
	ДанныеСтроки.МаксимальноВозможныйОбъемПотребления	= МаксимальноВозможныйОбъемПотребления;
	//ДанныеСтроки.СостояниеПоказаний 					= ПараметрыОперации.СостояниеПоказаний;
	//ДанныеСтроки.ПричинаОтклонения 						= ПараметрыОперации.ПричинаОтклонения;	
	//ДанныеСтроки.МаксимальноВозможныеПоказания			= ПараметрыОперации.МаксимальноВозможныеПоказания;	 
	//ДанныеСтроки.КоэффициентПУ							= ПараметрыОперации.КоэффициентПУ; 	
	//ДанныеСтроки.Переворот 								= ПараметрыОперации.Переворот;			
	КонтрольныйСъем 									= ПараметрыОперации.КС;
	ДопПараменты	= Новый Структура("ПриборУчета", СтрокаТочки.ПриборУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(ДанныеСтроки, ПериодНачисления,КонтрольныйСъем,ДопПараменты);
	
	Если ПараметрыОперации.НедопускПрибора Тогда
		ДанныеСтроки.СостояниеПоказаний 				= Перечисления.энргСостояниеПоказаний.Отклонены;
	КонецЕсли;	
	
	Если ДанныеСтрокиИзменены(ДанныеСтроки,СтрокаПоказаний) тогда
		// Если что то изменилось в документе.
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний,ДанныеСтроки);				
		ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);	
		ДокОбъект.записать();
	КонецЕсли;
	
	Если ДанныеСтроки.СостояниеПоказаний <> ПараметрыОперации.СостояниеПоказаний или ДанныеСтроки.Переворот <> ПараметрыОперации.Переворот тогда
		
		МенеджерэнргПоказанияПриборовУчета = РегистрыСведений.энргПоказанияПриборовУчета;
		// Если данные изменились записываем их.
		НаборПоказаний 								= СоздатьНаборЗаписей(МенеджерэнргПоказанияПриборовУчета);//РегистрыСведений.энргПоказанияПриборовУчета.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Прочитать();
		ТаблицаПоказаний  							= НаборПоказаний.Выгрузить();
		для Каждого стр из ТаблицаПоказаний цикл
			стр.активность 							= истина;
		КонецЦикла;   			
		НаборПоказаний.Очистить();
		НаборПоказаний.Записать();
		СтрокиПоказаний  							= ТаблицаПоказаний.НайтиСтроки(Новый Структура("КлючПомещения,ПриборУчета,ТарифнаяЗона,Разделитель",ПараметрыОперации.КлючПомещения,ПараметрыОперации.ПриборУчета,ПараметрыОперации.ТарифнаяЗона,ПараметрыОперации.Разделитель)); 
		Если СтрокиПоказаний.Количество() = 0 тогда 	
			// Движений по данному пу нету.	
			Если СтрокаПоказаний.ТекущиеПоказания > 0 тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
			КонецЕсли;				
		иначеЕсли СтрокиПоказаний.Количество() > 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
		иначе
			СтрокаПоказаний  						= СтрокиПоказаний[0];
			СтрокаПоказаний.Показание 				= ДанныеСтроки.ТекущиеПоказания;
			СтрокаПоказаний.Переворот 				= ДанныеСтроки.Переворот;
			СтрокаПоказаний.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
		КонецЕсли;			
		
		// Записываем новый набор показаний.
		НаборПоказаний 								= СоздатьНаборЗаписей(МенеджерэнргПоказанияПриборовУчета);//РегистрыСведений.энргПоказанияПриборовУчета.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Загрузить(ТаблицаПоказаний);
		НаборПоказаний.Записать(Ложь);			
		ПараметрыОперации.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
		ПараметрыОперации.Переворот 				= ДанныеСтроки.Переворот;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеСтрокиИзменены(Источник,Приемник)	
	
	для Каждого КлючЗначение из Источник цикл
		Если Источник[КлючЗначение.ключ] <> Приемник[КлючЗначение.ключ] тогда
			Возврат Истина;
			Прервать;				
		КонецЕсли;  		
	КонецЦикла; 	
	Возврат Ложь;
	
КонецФункции

Функция ИмяТабличнойЧастиПоказаний(Регистратор)
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргКвитанция") тогда
		Возврат "ПриборыУчета";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОбходнойЛист")	тогда
		Возврат "ПриборыУчета";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСЛицевымСчетом")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС тогда
			Возврат "ТочкиУчетаЗакрытие";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли  ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчета")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ тогда
			Возврат "ПоказанияПУВВод";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ тогда
			Возврат "ПоказанияПУЗамена";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ тогда
			Возврат "ПоказанияПУВывод";	
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСУслугами")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги тогда
			Возврат "ТочкиУчета";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие")	тогда	
		Возврат "Показания";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента")	тогда	
		Возврат "ПриборыУчета";			
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера")	тогда	
		Возврат "ПриборыУчета";		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера")	тогда	
		Возврат "ПриборыУчета";		
	иначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргРегистрацияПоказанийМКД") тогда
		Возврат "ПриборыУчета";
	ИначеЕсли  ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчетаМКД")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ тогда
			Возврат "ПоказанияПУВВод";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ тогда
			Возврат "ПоказанияПУЗамена";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ тогда
			Возврат "ПоказанияПУВывод";	
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСУслугамиМКД")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги тогда
			Возврат "ТочкиУчетаВывод";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОткрытиеМКД")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие тогда
			Возврат "ТочкиУчетаВывод";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли; 
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОбходнойЛистМКД")	тогда
		Возврат "ПриборыУчета";

	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
	КонецЕсли; 	
КонецФункции

#КонецОбласти

#Область СменаСтатусаПроведенияВПоследовательности

Процедура УстановитьУспешныйСтатусПроведенияВПоследовательности(МенеджерыРегистров, ПараметрыПроведений, ПроведенСНарушением, ПроведенВПоследовательности, ЗапросПоследовательности)
	
	//// Если все выполнено тогда изменяем состояние в последовательности.
	//МенеджерэнргПоказанияПУПоследовательность = МенеджерыРегистров.энргПоказанияПУПоследовательность;
	//
	//НаборПоследовательности  = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);
	//НаборПоследовательности.Отбор.Организация.установить(Организация);
	//НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
	//НаборПоследовательности.Отбор.Район.установить(Район);
	//НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
	//НаборПоследовательности.Отбор.ЧастныйСектор.установить(ПараметрыПроведений.ЧастныйСектор);
	//НаборПоследовательности.Отбор.Строение.установить(ПараметрыПроведений.Строение);
	//НаборПоследовательности.Отбор.Помещение.установить(ПараметрыПроведений.Помещение);
	//НаборПоследовательности.Отбор.ПриборУчета.установить(ПараметрыПроведений.ПриборУчета);
	//НаборПоследовательности.Прочитать();
	//
	//ТаблицаНабора = НаборПоследовательности.Выгрузить();
	//НаборПоследовательности.Очистить();
	//НаборПоследовательности.Записать();
	//
	//ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности, "СостояниеПроведения");
	//
	//НаборПоследовательности  = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);
	//НаборПоследовательности.Загрузить(ТаблицаНабора);
	//НаборПоследовательности.Записать(Ложь);
	
	МенеджерэнргПоказанияПУПоследовательность = МенеджерыРегистров.энргПоказанияПУПоследовательность;
	
	Запрос = ЗапросПоследовательности;	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("СостояниеПроведения", ПроведенСНарушением);
	Запрос.УстановитьПараметр("ЧастныйСектор", ПараметрыПроведений.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение", ПараметрыПроведений.Строение);
	Запрос.УстановитьПараметр("Помещение", ПараметрыПроведений.Помещение);
	Запрос.УстановитьПараметр("ПриборУчета", ПараметрыПроведений.ПриборУчета);
	Запрос.УстановитьПараметр("ПроведенВПоследовательности", ПроведенВПоследовательности); 	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаНабора = РезультатЗапроса.Выгрузить();
	
	
	НаборПоследовательности  = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);
	НаборПоследовательности.Отбор.Организация.установить(Организация);
	НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборПоследовательности.Отбор.Район.установить(Район);
	НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
	НаборПоследовательности.Отбор.ЧастныйСектор.установить(ПараметрыПроведений.ЧастныйСектор);
	НаборПоследовательности.Отбор.Строение.установить(ПараметрыПроведений.Строение);
	НаборПоследовательности.Отбор.Помещение.установить(ПараметрыПроведений.Помещение);
	НаборПоследовательности.Отбор.ПриборУчета.установить(ПараметрыПроведений.ПриборУчета);
	НаборПоследовательности.Записать();
	
	
	НаборПоследовательности  = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);
	НаборПоследовательности.Загрузить(ТаблицаНабора);
	НаборПоследовательности.Записать(Ложь);
	
	
КонецПроцедуры

Функция ЗапросПоследовательности()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПоказанияПУПоследовательность.Организация КАК Организация,
		|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
		|	энргПоказанияПУПоследовательность.Район КАК Район,
		|	&ПроведенВПоследовательности КАК СостояниеПроведения,
		|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
		|	энргПоказанияПУПоследовательность.Строение КАК Строение,
		|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
		|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
		|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
		|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель,
		|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
		|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
		|	энргПоказанияПУПоследовательность.УдалитьАбонент КАК УдалитьАбонент,
		|	энргПоказанияПУПоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	энргПоказанияПУПоследовательность.ИмяТабЧасти КАК ИмяТабЧасти
		|ИЗ
		|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
		|ГДЕ
		|	энргПоказанияПУПоследовательность.Организация = &Организация
		|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргПоказанияПУПоследовательность.Район = &Район
		|	И энргПоказанияПУПоследовательность.СостояниеПроведения = &СостояниеПроведения
		|	И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор
		|	И энргПоказанияПУПоследовательность.Строение = &Строение
		|	И энргПоказанияПУПоследовательность.Помещение = &Помещение
		|	И энргПоказанияПУПоследовательность.ПриборУчета = &ПриборУчета";
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область РаботаСИсключеннымВПоследовательности

Процедура ОчиститьДанныеИсключенногоИзПоследовательности(МенеджерыРегистров, Выборка, ПараметрыПроведений)
	
	МенеджерэнргПоказанияПУПоследовательность = МенеджерыРегистров.энргПоказанияПУПоследовательность;	
	МенеджерэнргМаксимальныеПоказания		  =	МенеджерыРегистров.энргМаксимальныеПоказания;
	МенеджерэнргПредоставленныеПоказания	  = МенеджерыРегистров.энргПредоставленныеПоказания;	
	МенеджерэнргМаксимальныеПоказанияСрез	  =	МенеджерыРегистров.энргМаксимальныеПоказанияСрез;
	
	// Очищаем данные.	
	НаборПоследовательности = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);
	НаборПоследовательности.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	НаборПоследовательности.Отбор.Организация.установить(Организация);
	НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборПоследовательности.Отбор.Район.установить(Район);
	НаборПоследовательности.Отбор.СостояниеПроведения.установить(Выборка.СостояниеПроведения);
	НаборПоследовательности.Отбор.ЧастныйСектор.установить(ПараметрыПроведений.ЧастныйСектор);
	НаборПоследовательности.Отбор.Строение.установить(ПараметрыПроведений.Строение);
	НаборПоследовательности.Отбор.Помещение.установить(ПараметрыПроведений.Помещение);
	НаборПоследовательности.Отбор.ПриборУчета.установить(ПараметрыПроведений.ПриборУчета);
	НаборПоследовательности.Отбор.ПериодРегистрации.установить(Выборка.ПериодРегистрации);
	НаборПоследовательности.Отбор.ДатаРегистратора.установить(Выборка.ДатаРегистратора);
	НаборПоследовательности.Записать();
	
	// Получаем таблицу максимальных показаний по регистратору.
	НаборМаксПоказаний  = СоздатьНаборЗаписей(МенеджерэнргМаксимальныеПоказания);
	НаборМаксПоказаний.Отбор.Период.установить(Выборка.ПериодРегистрации);
	НаборМаксПоказаний.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	НаборМаксПоказаний.Отбор.Организация.установить(Организация);
	НаборМаксПоказаний.Отбор.Район.установить(Район);
	НаборМаксПоказаний.Отбор.КлючПомещения.установить(ПараметрыПроведений.КлючПомещения);
	НаборМаксПоказаний.Отбор.ПриборУчета.установить(ПараметрыПроведений.ПриборУчета);	
	НаборМаксПоказаний.Записать();
	
	НаборПредоставленных = СоздатьНаборЗаписей(МенеджерэнргПредоставленныеПоказания);
	НаборПредоставленных.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	НаборПредоставленных.Отбор.Организация.установить(Организация);
	НаборПредоставленных.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборПредоставленных.Отбор.Район.установить(Район);
	НаборПредоставленных.Отбор.ЧастныйСектор.установить(ПараметрыПроведений.ЧастныйСектор);
	НаборПредоставленных.Отбор.Строение.установить(ПараметрыПроведений.Строение);
	НаборПредоставленных.Отбор.Помещение.установить(ПараметрыПроведений.Помещение);
	НаборПредоставленных.Отбор.ПриборУчета.установить(ПараметрыПроведений.ПриборУчета);
	НаборПредоставленных.Записать();
	
	НаборМаксПоказанийСрез	= СоздатьНаборЗаписей(МенеджерэнргМаксимальныеПоказанияСрез);
	НаборМаксПоказанийСрез.Отбор.Организация.установить(Организация);
	НаборМаксПоказанийСрез.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборМаксПоказанийСрез.Отбор.Район.установить(Район);
	НаборМаксПоказанийСрез.Отбор.ЧастныйСектор.установить(ПараметрыПроведений.ЧастныйСектор);
	НаборМаксПоказанийСрез.Отбор.Строение.установить(ПараметрыПроведений.Строение);
	НаборМаксПоказанийСрез.Отбор.Помещение.установить(ПараметрыПроведений.Помещение);
	НаборМаксПоказанийСрез.Отбор.ПриборУчета.установить(ПараметрыПроведений.ПриборУчета); 				
	//НаборМаксПоказанийСрез.Отбор.Шкала.установить(Шкала);
	//НаборМаксПоказанийСрез.Отбор.ТарифнаяЗона.установить(ТарифнаяЗона);	
	НаборМаксПоказанийСрез.Записать();
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСНаборамиЗаписей

Процедура ДополнитьНаборЗаписейВСоответствиеПредоставленныеПоказания(СтатичныеДопПараметры, МенеджерРегистра, Выборка)
	
	// ПредоставленныеПоказания
	Если СтатичныеДопПараметры.НаборПредоставленных[Выборка.ДокРегистратор] = Неопределено Тогда
		Набор = СоздатьНаборЗаписейПредоставленныеПоказания(МенеджерРегистра, Выборка);
		
		УровеньПрибора = Новый Соответствие;
		УровеньПрибора.Вставить(Выборка.ПриборУчета, Набор);
		
		СтатичныеДопПараметры.НаборПредоставленных.Вставить(Выборка.ДокРегистратор, УровеньПрибора);
		
	ИначеЕсли СтатичныеДопПараметры.НаборПредоставленных[Выборка.ДокРегистратор][Выборка.ПриборУчета] = Неопределено Тогда
		Набор = СоздатьНаборЗаписейПредоставленныеПоказания(МенеджерРегистра, Выборка);
		
		УровеньПрибора = Новый Соответствие;
		УровеньПрибора.Вставить(Выборка.ПриборУчета, Набор);
		
		СтатичныеДопПараметры.НаборПредоставленных[Выборка.ДокРегистратор].Вставить(Выборка.ПриборУчета, УровеньПрибора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьНаборЗаписейВСоответствиеРасчетСреднегоОбъема(СтатичныеДопПараметры, МенеджерРегистра, Выборка)
	
	Если Выборка.ВидОперации = СтатичныеДопПараметры.АктЗамены И Выборка.ВыводПрибораУчета = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// РасчетСреднегоОбъема
	Если СтатичныеДопПараметры.НаборРасчетСреднего[Выборка.ДокРегистратор] = Неопределено Тогда
		Набор = СоздатьНаборЗаписейРасчетСреднегоОбъема(МенеджерРегистра, Выборка);
		
		УровеньПрибора = Новый Соответствие;
		УровеньПрибора.Вставить(Выборка.ПриборУчета, Набор);
		
		СтатичныеДопПараметры.НаборРасчетСреднего.Вставить(Выборка.ДокРегистратор, УровеньПрибора);
		
	ИначеЕсли СтатичныеДопПараметры.НаборРасчетСреднего[Выборка.ДокРегистратор][Выборка.ПриборУчета] = Неопределено Тогда
		Набор = СоздатьНаборЗаписейРасчетСреднегоОбъема(МенеджерРегистра, Выборка);
		
		УровеньПрибора = Новый Соответствие;
		УровеньПрибора.Вставить(Выборка.ПриборУчета, Набор);
		
		СтатичныеДопПараметры.НаборРасчетСреднего[Выборка.ДокРегистратор].Вставить(Выборка.ПриборУчета, УровеньПрибора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказания(СтатичныеДопПараметры, МенеджерРегистра, Выборка)
	
	// МаксимальныеПоказания
	Если СтатичныеДопПараметры.НаборМаксимальныеПоказания[Выборка.ДокРегистратор] = Неопределено Тогда
		Набор = СоздатьНаборЗаписейМаксимальныеПоказания(МенеджерРегистра, Выборка);
		
		УровеньПрибора = Новый Соответствие;
		УровеньПрибора.Вставить(Выборка.ПриборУчета, Набор);
		
		СтатичныеДопПараметры.НаборМаксимальныеПоказания.Вставить(Выборка.ДокРегистратор, УровеньПрибора);
		
	ИначеЕсли СтатичныеДопПараметры.НаборМаксимальныеПоказания[Выборка.ДокРегистратор][Выборка.ПриборУчета] = Неопределено Тогда
		Набор = СоздатьНаборЗаписейМаксимальныеПоказания(МенеджерРегистра, Выборка);
		
		УровеньПрибора = Новый Соответствие;
		УровеньПрибора.Вставить(Выборка.ПриборУчета, Набор);
		
		СтатичныеДопПараметры.НаборМаксимальныеПоказания[Выборка.ДокРегистратор].Вставить(Выборка.ПриборУчета, УровеньПрибора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказанияСрез(СтатичныеДопПараметры, МенеджерРегистра, Выборка)
	
	// МаксимальныеПоказанияСРЕЗ
	Если СтатичныеДопПараметры.НаборМаксимальныеПоказанияСрез[Выборка.ПриборУчета] = Неопределено Тогда
		
		Набор = СоздатьНаборЗаписейМаксимальныеПоказанияСрез(МенеджерРегистра, Выборка);
		СтатичныеДопПараметры.НаборМаксимальныеПоказанияСрез.Вставить(Выборка.ПриборУчета, Набор);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьНаборЗаписейПредоставленныеПоказания(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
	Набор.Отбор.Строение.установить(Выборка.Строение);
	Набор.Отбор.Помещение.установить(Выборка.Помещение);
	Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
	
	Возврат Набор;
	
КонецФункции

Функция СоздатьНаборЗаписейРасчетСреднегоОбъема(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
	Набор.Отбор.Строение.установить(Выборка.Строение);
	Набор.Отбор.Помещение.установить(Выборка.Помещение);
	Набор.Отбор.ТочкаУчета.установить(Выборка.ТочкаУчета);
	//Набор.Отбор.Шкала.установить(Выборка.Шкала);
	//Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
	Если Выборка.ПериодРегистрации <> Выборка.ДатаРегистратора Тогда
		Набор.Отбор.ПериодНачисления.установить(энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Выборка.ПериодРегистрации, Выборка.Организация, Выборка.Район));
	Иначе
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	КонецЕсли;
	
	Возврат Набор;
	
КонецФункции

Функция СоздатьНаборЗаписейМаксимальныеПоказания(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.Период.установить(Выборка.ПериодРегистрации);
	Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.КлючПомещения.установить(Выборка.КлючПомещения);
	Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
	//Набор.Отбор.Шкала.установить(Выборка.Шкала);
	//Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
	
	Возврат Набор;
	
КонецФункции

Функция СоздатьНаборЗаписейМаксимальныеПоказанияСрез(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
	Набор.Отбор.Строение.установить(Выборка.Строение);
	Набор.Отбор.Помещение.установить(Выборка.Помещение);
	Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
	//Набор.Отбор.Шкала.установить(Шкала);
	//Набор.Отбор.ТарифнаяЗона.установить(ТарифнаяЗона);
	
	Возврат Набор;
	
КонецФункции

Процедура ЗаписатьНаборыЗаписейПоПрибору(СоответствиеНаборов)
	
	Для Каждого УровеньРегистратораКлючЗначение из СоответствиеНаборов Цикл
		
		НаборыЗаписей = УровеньРегистратораКлючЗначение.Значение;
		ЗаписатьНаборыЗаписей(НаборыЗаписей);
		//Для Каждого УровеньПрибораКлючЗначение из УровеньРегистратораКлючЗначение.Значение Цикл
		//	УровеньПрибораКлючЗначение.Значение.Записать();
		//КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаписатьНаборыЗаписей(НаборыЗаписей)
	
	Для Каждого УровеньПрибораКлючЗначение из НаборыЗаписей Цикл
		УровеньПрибораКлючЗначение.Значение.Записать();
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция СтатичныеДополнительныеПараметрыПоказаний(ПериодыПриемаПоказаний, НачалоПериодаРасчета)
	
	Результат = Новый Структура;
	Результат.Вставить("НачалоПериодаРасчета", НачалоПериодаРасчета);
	
	Результат.Вставить("Исключен", Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности);
	Результат.Вставить("ПроведенСНарушением", Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности);
	Результат.Вставить("ПроведенВПоследовательности", Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности);
	
	Результат.Вставить("ПоказанияОтклонены"			, Перечисления.энргСостояниеПоказаний.Отклонены);
	Результат.Вставить("ПоказанияПриняты"			, Перечисления.энргСостояниеПоказаний.Приняты);
	Результат.Вставить("ПустоеСостояниеПоказаний"	, Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	
	Результат.Вставить("НаборПредоставленных"			, Новый Соответствие);
	Результат.Вставить("НаборРасчетСреднего"			, Новый Соответствие);
	Результат.Вставить("НаборМаксимальныеПоказания"		, Новый Соответствие);
	Результат.Вставить("НаборМаксимальныеПоказанияСрез"	, Новый Соответствие);
	
	Результат.Вставить("НачПокНеЯвляютсяКонечнымиПриУстПрибора", энргРаботаСКонстантами.ЗначениеКонстантыНачальныеПоказанияПУНеРавныКонечнымВПериодеВведенияВЭксплуатациюПУ());
	Результат.Вставить("РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу", энргРаботаСКонстантами.ЗначениеКонстантыРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу());
	
	Результат.Вставить("ПоказанияС"	, ?(не ЗначениеЗаполнено(ПериодыПриемаПоказаний.ДатаС),	1, ПериодыПриемаПоказаний.ДатаС));
	Результат.Вставить("ПоказанияПО", ?(не ЗначениеЗаполнено(ПериодыПриемаПоказаний.ДатаПо), 31, ПериодыПриемаПоказаний.ДатаПо));	
	
	Результат.Вставить("ПараметрыОперации",	НовыеПараметрыОперации());
	Результат.Вставить("ПричиныОтклоненияИсключая", энргРаботаСПоказаниямиПриборовУчетаСервер.ПричиныОтклоненияИсключая());
	
	Результат.Вставить("АктЗамены", Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ);
	Возврат Результат;
	
КонецФункции

Функция ОписаниеСтрокиМассивДокументов()
	
	Результат = Новый ФиксированнаяСтруктура("
	|ДокРегистратор,ВидОперации,СостояниеПроведения,ПериодРегистрации,ДатаРегистратора,
	|СостояниеПоказаний,ПричинаОтклонения,Показание,Переворот,МаксПоказания,ПериодМаксПоказаний,	 
	|РегистраторМаксПоказаний,ДатаРегистратораМаксимальных,БылПереворот,Разделитель,НомерСтрокиТЧ,
	|КоэффициентПУ,МаксимальноВозможныеПоказания,ВыводПрибораУчета,ИмяТабЧасти,КС,ТочкаУчета,ПериодНачисленияКорректировки");
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеСтрокиПараметрыПроведения()
	
	Результат = "ЧастныйСектор,Строение,Помещение,КлючПомещения,
		|ПриборУчета,Шкала,ТарифнаяЗона,НомерПозиции,
		|РегистрируетОбъем,НедопускПрибора";
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьНаборЗаписей(МенеджерРегистраСведений)
	
	НаборЗаписей = МенеджерРегистраСведений.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	
	Возврат НаборЗаписей;
	
КонецФункции

Функция ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления)
	Отказ = Ложь;
	
	ДокДляПроверки = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ДокДляПроверки.Организация	= Организация;
	ДокДляПроверки.Дата			= ПериодНачисления;
	ДокДляПроверки.Район		= Район;	
	Попытка
		ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ДокДляПроверки, Отказ, Истина, Истина);
	Исключение
		Отказ	= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для пользователя " + Пользователи.ТекущийПользователь() + " район " + Район + " период " + ПериодНачисления + " закрыт для редактирования");
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#КонецОбласти