#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные прибора учета.
//
// Параметры:
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  Период			-	Дата.
//  ПриборУчета		-	СправочникСсылка.энргПриборыУчетаАбонента.
//  ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   РузультатЗапроса.
//
Функция ПолучитьДанныеПрибораУчета(Организация, Район, Период, ПриборУчета = Неопределено, ОбъектРасчета = Неопределено, ТочкаУчета = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПриборыТочекУчетаНП.ТочкаУчета КАК ТочкаУчета,
		|	бестПриборыТочекУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
		|	бестПриборыТочекУчетаНП.ПриборУчета КАК ПриборУчета
		|ИЗ
		|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестПриборыТочекУчетаНП
		|ГДЕ
		|	бестПриборыТочекУчетаНП.ПриборУчета = &ПриборУчета";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(ПриборУчета) Тогда
		Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестПриборыТочекУчетаНП.ПриборУчета = &ПриборУчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТочкаУчета) Тогда
		Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТочкаУчета = &ТочкаУчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета = &ОбъектРасчета", "Истина");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#КонецЕсли
