#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
		
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииУстановитьФормулуРасчетаТочекУчета(КомандыСоздатьНаОсновании);
	
КонецФункции

// Возвращает соответствие изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;
	ИзменяемыеПараметры 		= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета,Услуга","РасчетПоФормуле,ПрименятьФормулуВсегда"));
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета,Услуга",
		"ЗависимаяТочкаУчета,КоэффициентФормула,ВладелецЗависимойТочкиУчета"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт	
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамТочкиПоФормуле(Схема,ВыбираемыеТаблицы);
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамПараметрыФормулы(Схема,ВыбираемыеТаблицы);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамТочкиПоФормуле(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьФормулуРасчетаТочкиПоФормуле";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамТочкаПоФормуле());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
		
КонецПроцедуры

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамПараметрыФормулы(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьФормулуРасчетаПараметрыФормулы";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамПараметрыФормулы());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;

КонецПроцедуры

Функция ТекстДляПроведенияПоСтабильнымПериодамТочкаПоФормуле() 
	
	Текст 					=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА энргВидУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА ВложенныйЗапрос.Услуга
	|		ИНАЧЕ энргВидУслугСоставляющиеУслуг.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|	0 КАК Порядок 
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|		Шапка.Дата КАК ДатаРегистратора,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		НЕОПРЕДЕЛЕНО КАК ВидОперации,
	|		Шапка.РассчитываемаяТочкаУчета КАК ТочкаУчета,
	|		Шапка.Услуга КАК Услуга,
	|		ИСТИНА КАК РасчетПоФормуле,
	|		Шапка.ПрименятьВсегда КАК ПрименятьФормулуВсегда
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьФормулуРасчетаТочекУчета КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидУслугСоставляющиеУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидУслугСоставляющиеУслуг.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамПараметрыФормулы()
	
	Текст 					=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	НЕОПРЕДЕЛЕНО КАК ВидОперации,
	|	энргФормулыРасчетаТочекУчета.ТочкаИсточник КАК ТочкаУчета,
	|	Шапка.РассчитываемаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВЫБОР
	|		КОГДА энргФормулыРасчетаТочекУчета.Актуальность
	|			ТОГДА энргФормулыРасчетаТочекУчета.Коэффициент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентФормула,
	|	Шапка.Абонент КАК Абонент,
	|	энргФормулыРасчетаТочекУчета.КлючПомещенияИсточник КАК КлючПомещенияИсточник
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьФормулуРасчетаТочекУчета КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета КАК энргФормулыРасчетаТочекУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргФормулыРасчетаТочекУчета.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТУ.Организация КАК Организация,
	|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ТУ.Район КАК Район,
	|	ВТ_ТУ.ЧастныйСектор КАК ЧастныйСектор,
	|	ВТ_ТУ.Строение КАК Строение,
	|	ВТ_ТУ.Помещение КАК Помещение,
	|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_ТУ.ДатаРегистратора КАК ДатаРегистратора,
	|	ВТ_ТУ.ДокРегистратор КАК ДокРегистратор,
	|	ВТ_ТУ.ВидОперации КАК ВидОперации,
	|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТУ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВТ_ТУ.КоэффициентФормула КАК КоэффициентФормула,
	|	ВТ_ТУ.Абонент КАК Абонент,
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_УслугиТУ
	|ИЗ
	|	ВТ_ТУ КАК ВТ_ТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|				,
	|				(Организация, Район, ТочкаУчета, КлючПомещения) В
	|					(ВЫБРАТЬ
	|						ВТ.Организация,
	|						ВТ.Район,
	|						ВТ.ТочкаУчета,
	|						ВТ.КлючПомещенияИсточник
	|					ИЗ
	|						ВТ_ТУ КАК ВТ)) КАК энргУслугиТочекУчетаСрезПоследних
	|		ПО ВТ_ТУ.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВТ_ТУ.Организация = энргУслугиТочекУчетаСрезПоследних.Организация
	|			И ВТ_ТУ.Район = энргУслугиТочекУчетаСрезПоследних.Район
	|			И ВТ_ТУ.КлючПомещенияИсточник = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УслугиТУ.Организация КАК Организация,
	|	ВТ_УслугиТУ.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_УслугиТУ.Район КАК Район,
	|	ВТ_УслугиТУ.ЧастныйСектор КАК ЧастныйСектор,
	|	ВТ_УслугиТУ.Строение КАК Строение,
	|	ВТ_УслугиТУ.Помещение КАК Помещение,
	|	ВТ_УслугиТУ.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_УслугиТУ.ДатаРегистратора КАК ДатаРегистратора,
	|	ВТ_УслугиТУ.ДокРегистратор КАК ДокРегистратор,
	|	ВТ_УслугиТУ.ВидОперации КАК ВидОперации,
	|	ВТ_УслугиТУ.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА энргВидУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА ВТ_УслугиТУ.Услуга
	|		ИНАЧЕ энргВидУслугСоставляющиеУслуг.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВТ_УслугиТУ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВТ_УслугиТУ.КоэффициентФормула КАК КоэффициентФормула,
	|	ВТ_УслугиТУ.Абонент КАК ВладелецЗависимойТочкиУчета,
	|	1 КАК Порядок
	|ИЗ
	|	ВТ_УслугиТУ КАК ВТ_УслугиТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидУслугСоставляющиеУслуг
	|		ПО ВТ_УслугиТУ.Услуга = энргВидУслугСоставляющиеУслуг.Ссылка";

	Возврат Текст;

КонецФункции 

#КонецОбласти

#КонецЕсли