#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает свойства строения из строки JSON.
//
// Параметры:
//  ОписаниеСтроения	-	ДокументОбъект.
//  ПолучаемыеСвойства	-	Строка.
// 
// Возвращаемое значение:
//   Структура.
//
Функция СвойстваСтроенияИзСтрокиJSON(ОписаниеСтроения, ПолучаемыеСвойства) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргОткрытиеМКДМенеджер.СвойстваСтроенияИзСтрокиJSON";
		ПараметрыМетода 			= Новый Структура("ОписаниеСтроения, ПолучаемыеСвойства", ОписаниеСтроения, ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");	
	КонецЕсли;
	
	Результат 						= Документы.энргОткрытиеМКД.СвойстваСтроенияИзСтрокиJSON(ОписаниеСтроения, ПолучаемыеСвойства);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргОткрытиеМКДМенеджер.СвойстваСтроенияИзСтрокиJSON";
		ПараметрыМетода 			= Новый Структура("ОписаниеСтроения, ПолучаемыеСвойства", ОписаниеСтроения, ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли