#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// проверяем составные услуги
	Если ЕстьСоставныеУслуги() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В табличной части указаны строки для составных услуг");
		Отказ 				= Истина;
	КонецЕсли;
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, Режим)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	ЗначениеТарифа();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗначениеТарифа()
	для Каждого стр из ИспользованиеМерСоциальноПоддержки цикл
		Движение 										= Движения.энргИспользованиеМерСоциальнойПоддержки.Добавить();
		Движение.Период 								= Дата; 
		Движение.Организация 							= Организация;
		Движение.Район		 							= Район;
		Движение.Услуга 								= стр.Услуга;
		Движение.ИспользоватьМерыСоциальноцПоддержки	= стр.ИспользоватьМеруСоциальнойПоддержки;
	КонецЦикла;
КонецПроцедуры

Функция ЕстьСоставныеУслуги()
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргУстановитьИспользованиеМерСоциальнойПоддержки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргУстановитьИспользованиеМерСоциальнойПоддержки.ИспользованиеМерСоциальноПоддержки КАК энргУстановитьИспользованиеМерСоциальнойПоддержки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО энргУстановитьИспользованиеМерСоциальнойПоддержки.Услуга = энргВидыУслуг.Ссылка
	|			И (энргВидыУслуг.СоставнаяУслуга)
	|			И (энргУстановитьИспользованиеМерСоциальнойПоддержки.Ссылка = &Ссылка)";
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли