#Область ОбработчикиСобытий

// Процедура - Обновить показания приборов учета
//
// Параметры:
//  Район	 - СправочникСсылкаРайоны	 	-.
												// Используется для отбора в среднем объеме потребления.
//  Дом		 - 	 - 
//  Абонент	 - 	 - 
//  Дата	 - 	 - 
Функция РезультатДанныеЗаполненияТаблицыПоказаний(Организация, Район, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем = Ложь) Экспорт 
		
	мРайоны 						= ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзТаблицаПоказаний.ВыгрузитьКолонку("Район"));
	мКлючиПомещений 				= ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзТаблицаПоказаний.ВыгрузитьКолонку("КлючПомещения"));
	
	МВТ  							= Новый МенеджерВременныхТаблиц;
	
	Параметры  						= Новый Структура; 	
	ПараметрыВТ						= Новый Массив;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("Организация","Организация")));
	КонецЕсли;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("ПериодНачисления","ПериодНачисления")));
	
	Если мРайоны.Количество() = 1 Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("Район","мРайоны")));
	ИначеЕсли мРайоны.Количество() > 1 Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраВСписке", 	Новый Структура("Район","мРайоны")));
	КонецЕсли; 
	
	Если мКлючиПомещений.Количество() = 1 Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("КлючПомещения","мКлючПомещений")));
	Иначе
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраВСписке", 	Новый Структура("КлючПомещения","мКлючПомещений")));
	КонецЕсли;
		
	Параметры.Вставить("ПараметрыВТ", 			ПараметрыВТ);
	
	Если ЗначениеЗаполнено(МоментВремени) Тогда
		Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра","Период"));
	КонецЕсли;	
	
	Параметры.Вставить("ВыбиратьРазрешенные", 	Ложь);
	Схема  							= Неопределено;
	РегистрыСведений.энргМаксимальныеПоказателиПотребления.МаксимальныеПоказателиПотребления(Схема,Параметры,"МаксимальныеПоказателиПотребления");
	РегистрыСведений.энргКоэффциентыПриборовУчета.КоэффциентыПриборовУчета(Схема,Параметры,"КоэффциентыПриборовУчета");
	РегистрыСведений.энргСреднийОбъемПотребленияАбонентов.СреднийОбъемПотребленияАбонентов(Схема,Параметры,"СреднийОбъемПотребленияАбонентов");
	РегистрыСведений.энргМаксимальныеПоказания.МаксимальныеПоказанияСрез(Схема,Параметры,"МаксимальныеПоказанияСрез");
	энргРаботаСТочкамиУчетаСервер.ЗначенияТарифовУслугАбонентовВоВременную(МВТ, Схема, Параметры, Организация, МоментВремени, мРайоны, мКлючиПомещений);
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ТекущиеДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанныеДокумента.Организация КАК Организация,
	|	ТекущиеДанныеДокумента.Район КАК Район,
	|	ТекущиеДанныеДокумента.КлючПомещения КАК КлючПомещения,
	|	ТекущиеДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ТекущиеДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанныеДокумента.Шкала КАК Шкала,
	|	ТекущиеДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанныеДокумента.Услуга КАК Услуга,
	|	ТекущиеДанныеДокумента.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанныеДокумента.Переворот КАК Переворот,
	|	ТекущиеДанныеДокумента.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанныеДокумента.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТекущиеДанныеДокумента.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанныеДокумента"); 	
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ТекущиеДанные.Организация КАК Организация,
	|	ТекущиеДанные.Район КАК Район,
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанные.КлючПомещения КАК КлючПомещения,
	|	ТекущиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанные.Шкала КАК Шкала,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.Переворот КАК ТекущийПереворот,
	|	ТекущиеДанные.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанные.СостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ЕСТЬNULL(КоэффциентыПриборовУчета.Коэффициент, 1) КАК Коэффициент,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможные,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	ЕСТЬNULL(МаксимальныеПоказателиПотребления.МаксимальноеПотребления, 0) КАК МаксимальныйОбъемПотребления,
	|	ЕСТЬNULL(МаксимальныеПоказателиПотребления.ПовышающийКоэффициент, 1) КАК ПовышающийКоэффициентМаксимальноеПотребления,
	|	ЕСТЬNULL(ТаблицаЗначенийТарифовТочекУчета.ЗначениеТарифа, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ТаблицаЗначенийТарифовТочекУчета.ПредставлениеЗначениеТарифа, """") КАК ПредставлениеЗначениеТарифа
	|ПОМЕСТИТЬ ДанныеДокументаСПоказаниями
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффциентыПриборовУчета КАК КоэффциентыПриборовУчета
	|		ПО ТекущиеДанные.КлючПомещения = КоэффциентыПриборовУчета.КлючПомещения И ТекущиеДанные.КлючПомещения = КоэффциентыПриборовУчета.КлючПомещения
	|			И ТекущиеДанные.ПриборУчета = КоэффциентыПриборовУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ТекущиеДанные.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказателиПотребления КАК МаксимальныеПоказателиПотребления
	|		ПО ТекущиеДанные.Услуга = МаксимальныеПоказателиПотребления.Услуга
	|			И ТекущиеДанные.ТарифнаяЗона = МаксимальныеПоказателиПотребления.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийТарифовТочекУчета КАК ТаблицаЗначенийТарифовТочекУчета
	|		ПО ТекущиеДанные.КлючПомещения = ТаблицаЗначенийТарифовТочекУчета.КлючПомещения
	|			И ТекущиеДанные.ТочкаУчета = ТаблицаЗначенийТарифовТочекУчета.ТочкаУчета
	|			И ТекущиеДанные.ТарифнаяЗона = ТаблицаЗначенийТарифовТочекУчета.ТарифнаяЗона");
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ПоследниеПоказания КАК ПоследниеПоказания,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	ВложенныйЗапрос.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	(ВложенныйЗапрос.ТекущиеПоказания - ВложенныйЗапрос.ПоследниеПоказания) * ВложенныйЗапрос.Коэффициент КАК Расход,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ТекущиеПоказания < ВложенныйЗапрос.ПоследниеПоказания
	|			ТОГДА (ВложенныйЗапрос.ПоследниеПоказания - ВложенныйЗапрос.ТекущиеПоказания) * ВложенныйЗапрос.Коэффициент
	|		ИНАЧЕ (ВложенныйЗапрос.ТекущиеПоказания - ВложенныйЗапрос.ПоследниеПоказания) * ВложенныйЗапрос.Коэффициент
	|	КОНЕЦ КАК РасходПоМодулю,
	|	(ВложенныйЗапрос.МаксимальноВозможные - ВложенныйЗапрос.ПоследниеПоказания + ВложенныйЗапрос.ТекущиеПоказания) * ВложенныйЗапрос.Коэффициент КАК РасходСПереворотом,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СреднийОбъемПотребления > ВложенныйЗапрос.МаксимальныйОбъемПотребления
	|				И ВложенныйЗапрос.СреднийОбъемПотребления > 0
	|			ТОГДА ВложенныйЗапрос.СреднийОбъемПотребления
	|		ИНАЧЕ ВложенныйЗапрос.МаксимальныйОбъемПотребления
	|	КОНЕЦ * ВложенныйЗапрос.ПовышающийКоэффициентМаксимальноеПотребления * ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК МаксимальныйРасходЗаПериод,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК РазностьМесяцев,
	|	ВложенныйЗапрос.Коэффициент КАК КоэффициентПУ,
	|	ВложенныйЗапрос.ТекущийПереворот КАК ТекущийПереворот,
	|	ВложенныйЗапрос.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ВложенныйЗапрос.ТекущиеСостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ВложенныйЗапрос.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ВложенныйЗапрос.МаксимальноВозможные КАК МаксимальноВозможныеПоказания,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВложенныйЗапрос.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа
	|ПОМЕСТИТЬ ДанныеДляАнализа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокументаСПоказаниями.Организация КАК Организация,
	|		ДанныеДокументаСПоказаниями.Район КАК Район,
	|		ДанныеДокументаСПоказаниями.КлючПомещения КАК КлючПомещения,
	|		ДанныеДокументаСПоказаниями.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеДокументаСПоказаниями.Шкала КАК Шкала,
	|		ДанныеДокументаСПоказаниями.НомерСтроки КАК НомерСтроки,
	|		ДанныеДокументаСПоказаниями.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ДанныеДокументаСПоказаниями.Коэффициент КАК Коэффициент,
	|		ДанныеДокументаСПоказаниями.ТекущийПереворот КАК ТекущийПереворот,
	|		ДанныеДокументаСПоказаниями.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|		ДанныеДокументаСПоказаниями.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ДанныеДокументаСПоказаниями.ТекущиеСостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|		ДанныеДокументаСПоказаниями.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|		ДанныеДокументаСПоказаниями.МаксимальноВозможные КАК МаксимальноВозможные,
	|		ДанныеДокументаСПоказаниями.МаксимальныйОбъемПотребления КАК МаксимальныйОбъемПотребления,
	|		ДанныеДокументаСПоказаниями.ПовышающийКоэффициентМаксимальноеПотребления КАК ПовышающийКоэффициентМаксимальноеПотребления,
	|		ДанныеДокументаСПоказаниями.РегистрируетОбъем КАК РегистрируетОбъем,
	|		ДанныеДокументаСПоказаниями.ЗначениеТарифа КАК ЗначениеТарифа,
	|		ДанныеДокументаСПоказаниями.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа,
	|		ЕСТЬNULL(СреднийОбъемПотребленияАбонентов.Объем, 0) КАК СреднийОбъемПотребления,
	|		ЕСТЬNULL(МаксимальныеПоказанияСрез.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнихПоказаний,
	|		ЕСТЬNULL(МаксимальныеПоказанияСрез.Показание, 0) КАК ПоследниеПоказания
	|	ИЗ
	|		ДанныеДокументаСПоказаниями КАК ДанныеДокументаСПоказаниями
	|			ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|			ПО ДанныеДокументаСПоказаниями.КлючПомещения = МаксимальныеПоказанияСрез.КлючПомещения
	|				И ДанныеДокументаСПоказаниями.ПриборУчета = МаксимальныеПоказанияСрез.ПриборУчета
	|				И ДанныеДокументаСПоказаниями.Шкала = МаксимальныеПоказанияСрез.Шкала
	|				И ДанныеДокументаСПоказаниями.ТарифнаяЗона = МаксимальныеПоказанияСрез.ТарифнаяЗона
	|			ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъемПотребленияАбонентов КАК СреднийОбъемПотребленияАбонентов
	|			ПО ДанныеДокументаСПоказаниями.КлючПомещения = СреднийОбъемПотребленияАбонентов.КлючПомещения
	|				И ДанныеДокументаСПоказаниями.ТочкаУчета = СреднийОбъемПотребленияАбонентов.ТочкаУчета
	|				И ДанныеДокументаСПоказаниями.ТарифнаяЗона = СреднийОбъемПотребленияАбонентов.ТарифнаяЗона
	|				И ДанныеДокументаСПоказаниями.Шкала = СреднийОбъемПотребленияАбонентов.Шкала) КАК ВложенныйЗапрос");
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеДляАнализа.Организация КАК Организация,
	|	ДанныеДляАнализа.Район КАК Район,
	|	ДанныеДляАнализа.НомерСтроки КАК НомерСтроки,
	|	ДанныеДляАнализа.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляАнализа.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущийПереворот
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК Переворот,
	|	ДанныеДляАнализа.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	ДанныеДляАнализа.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляАнализа.ТекущийПереворот
	|						ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|					ИНАЧЕ ДанныеДляАнализа.Расход
	|				КОНЕЦ
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА 0
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ДанныеДляАнализа.Расход
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|					ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|				ИНАЧЕ -ДанныеДляАнализа.РасходПоМодулю
	|			КОНЕЦ
	|	КОНЕЦ КАК Разница,
	|	ЛОЖЬ КАК ПереворотИзмененПользователем,
	|	ЛОЖЬ КАК СтатусИзмененПользователем,
	|	ДанныеДляАнализа.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляАнализа.МаксимальныйРасходЗаПериод КАК МаксимальноВозможныйОбъемПотребления,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущиеСостояниеПоказаний
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|							И ДанныеДляАнализа.ПоследниеПоказания = 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|				КОНЕЦ
	|		КОГДА ДанныеДляАнализа.Расход = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		КОГДА &КонтрольныйСъем
	|				И ВЫБОР
	|					КОГДА ДанныеДляАнализа.Расход >= 0
	|						ТОГДА ДанныеДляАнализа.Расход
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|								ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|							ИНАЧЕ -ДанныеДляАнализа.РасходПоМодулю
	|						КОНЕЦ
	|				КОНЕЦ >= 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		КОГДА ВЫБОР
	|				КОГДА ДанныеДляАнализа.Расход >= 0
	|					ТОГДА ДанныеДляАнализа.Расход
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|							ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|						ИНАЧЕ ДанныеДляАнализа.Расход
	|					КОНЕЦ
	|			КОНЕЦ >= 0
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ДанныеДляАнализа.Расход >= 0
	|								ТОГДА ДанныеДляАнализа.Расход
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|										ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|									ИНАЧЕ ДанныеДляАнализа.РасходПоМодулю
	|								КОНЕЦ
	|						КОНЕЦ > ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|	КОНЕЦ КАК СостояниеПоказаний,
	|	ДанныеДляАнализа.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеДляАнализа.ПоследниеПоказания КАК ПредыдущиеПоказания,
	|	ДанныеДляАнализа.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ДанныеДляАнализа.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа
	|ИЗ
	|	ДанныеДляАнализа КАК ДанныеДляАнализа");  
	
	ДатаОпределенияПериодаНачисления 	= ТекущаяДата();
	Если ТипЗнч(МоментВремени) = Тип("Дата") И ЗначениеЗаполнено(МоментВремени) Тогда
		ДатаОпределенияПериодаНачисления 	= МоментВремени; 
	Иначе
		// 
	КонецЕсли;
	
	ПериодНачисления 					= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДатаОпределенияПериодаНачисления, Организация, Район);
	ПараметрыЗапроса 					= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация",			Организация);
	ПараметрыЗапроса.Вставить("ПериодНачисления",		ПериодНачисления);
	ПараметрыЗапроса.Вставить("ТекущиеДанные",			тзТаблицаПоказаний);
	ПараметрыЗапроса.Вставить("КонтрольныйСъем",		КонтрольныйСъем);
	ПараметрыЗапроса.Вставить("Период",					МоментВремени);
	
	Если мРайоны.Количество() = 1 Тогда
		ПараметрыЗапроса.Вставить("мРайоны",			мРайоны[0]);
	Иначе
		ПараметрыЗапроса.Вставить("мРайоны",			мРайоны);
	КонецЕсли;
	
	Если мКлючиПомещений.Количество() = 1 Тогда
		ПараметрыЗапроса.Вставить("мКлючПомещений",		мКлючиПомещений[0]);
	Иначе
		ПараметрыЗапроса.Вставить("мКлючПомещений",		мКлючиПомещений);
	КонецЕсли;
		
	РезультатЗапроса				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса, МВТ);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргРаботаСПоказаниямиПриборовУчетаСервер.РезультатДанныеЗаполненияТаблицыПоказаний";
		ПараметрыМетода 			= Новый Структура("Организация, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем",Организация, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
		
КонецФункции

Функция ТаблицаПоказаний(Организация, ТочкиУчета, ШкалыПриборов, ТаблицаПоказаний, Район = Неопределено, КлючПомещения = Неопределено, ИдентификаторСтроки = Неопределено, СоответствиеКолонок = Неопределено) Экспорт 
	
	ИсходноеСоотвествиеКолонок  			= Новый Структура;
	ИсходноеСоотвествиеКолонок.Вставить("IDСтроки", 	"IDСтроки");
	ИсходноеСоотвествиеКолонок.Вставить("ПриборУчета", 	"ПриборУчета");
	
	Если НЕ СоответствиеКолонок = Неопределено Тогда
		Для Каждого КлючЗначение Из СоответствиеКолонок Цикл
			ИсходноеСоотвествиеКолонок[КлючЗначение.Ключ] 	= КлючЗначение.Значение;
		КонецЦикла;		
	КонецЕсли;
	
	КоллекцияТочек 							= ТочкиУчета;
	Если ТипЗнч(ТочкиУчета)  = Тип("ТаблицаЗначений") тогда
		ТекущиеДанные 						= ТочкиУчета;
		Индекс 								= 0;
	ИначеЕсли ТипЗнч(ТочкиУчета)  = Тип("ДанныеФормыДерево") и ИдентификаторСтроки = Неопределено тогда
		ТочкиУчетаДерево					= ДанныеФормыВЗначение(ТочкиУчета,Тип("ДеревоЗначений"));
		ТекущиеДанные 						= Новый ТаблицаЗначений;
		КоллекцияТочек 						= ТочкиУчетаДерево.Строки;
		Для Каждого КолонкаДерева Из ТочкиУчетаДерево.Колонки Цикл
			ТекущиеДанные.Колонки.Добавить(КолонкаДерева.Имя,КолонкаДерева.ТипЗначения);
		КонецЦикла;
		
		Индекс 								= 0;	
		Для Каждого СтрокаДерева ИЗ ТочкиУчетаДерево.Строки Цикл
			ЗаполнитьЗначенияСвойств(ТекущиеДанные.Добавить(), СтрокаДерева);
		КонецЦикла;
	ИначеЕсли  ТипЗнч(ТочкиУчета)  = Тип("ДанныеФормыДерево") Тогда
		
		ТочкиУчетаДерево					= ДанныеФормыВЗначение(ТочкиУчета,Тип("ДеревоЗначений"));
		ТекущиеДанные 						= Новый ТаблицаЗначений;
		КоллекцияТочек 						= ТочкиУчетаДерево.Строки;
		
		Для Каждого КолонкаДерева Из ТочкиУчетаДерево.Колонки Цикл
			ТекущиеДанные.Колонки.Добавить(КолонкаДерева.Имя,КолонкаДерева.ТипЗначения);
		КонецЦикла;
		
		Индекс 								= 0;	
		
		ЗаполнитьЗначенияСвойств(ТекущиеДанные.Добавить(), ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки));		
		
	ИначеЕсли НЕ ИдентификаторСтроки = Неопределено Тогда
		ТекущиеДанные  						= ТочкиУчета.Выгрузить();
		ТекущиеДанные.Очистить();
		Строка  							= ТекущиеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки));
	Иначе	
		ТекущиеДанные  						= ТочкиУчета.Выгрузить();
		Индекс  							= -1;
	КонецЕсли;
	
	СтрокиУдалить  							= ТекущиеДанные.НайтиСтроки(Новый Структура("ПриборУчета", Справочники.энргПриборыУчетаАбонента.ПустаяСсылка()));
	
	Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
		ТекущиеДанные.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	Если ТипЗнч(ТаблицаПоказаний)  = Тип("ТаблицаЗначений") тогда
		тзТаблицаПоказаний 							= ТаблицаПоказаний;		
	ИначеЕсли  НЕ ИдентификаторСтроки = Неопределено Тогда
		тзТаблицаПоказаний							= ТаблицаПоказаний.Выгрузить();
		тзТаблицаПоказаний.очистить();
		СтрокаТочкиУчета 							= ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокиШкал 									= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]]));
		НомерСтроки 								= 1;
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			СтрокиПоказаний  						= ТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));			
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				СтрокаТаблицаПоказаний 				= тзТаблицаПоказаний.добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаПоказаний,СтрокаПоказаний);
				СтрокаТаблицаПоказаний.НомерСтроки 	= НомерСтроки;
				НомерСтроки 						= НомерСтроки + 1;
			КонецЦикла;			  
		КонецЦикла;			
	Иначе		
		тзТаблицаПоказаний					= ТаблицаПоказаний.Выгрузить();
	КонецЕсли;
	
	тзТаблицаПоказаний.Колонки.добавить("Организация",						Новый ОписаниеТипов("СправочникСсылка.Организации"));
	тзТаблицаПоказаний.Колонки.добавить("Район",							Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	тзТаблицаПоказаний.Колонки.добавить("КлючПомещения",					Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	тзТаблицаПоказаний.Колонки.добавить("ТочкаУчета",						Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	тзТаблицаПоказаний.Колонки.добавить("Услуга",							Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	тзТаблицаПоказаний.Колонки.добавить("ПриборУчета",						Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	
	Если тзТаблицаПоказаний.Колонки.Найти("IDСтрокиТочкиУчета") = Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("IDСтрокиТочкиУчета",			Новый ОписаниеТипов("УникальныйИдентификатор"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("ВидДифференцированности") = Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("ВидДифференцированности",		Новый ОписаниеТипов("СправочникСсылка.энргВидыДифференцированности"));
	КонецЕсли;
	Если тзТаблицаПоказаний.Колонки.Найти("Шкала") = Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("Шкала",						Новый ОписаниеТипов("СправочникСсылка.энргШкалыПриборовУчета"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("ТекущиеПоказания") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("ТекущиеПоказания",				Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,4)));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("Переворот") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("Переворот",					Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("СтатусИзмененПользователем") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("СтатусИзмененПользователем",		Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("СостояниеПоказаний") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("СостояниеПоказаний",				Новый ОписаниеТипов("ПеречислениеСсылка.энргСостояниеПоказаний"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("ПереворотИзмененПользователем") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("ПереворотИзмененПользователем",	Новый ОписаниеТипов("Булево"));
	КонецЕсли;	
	
	Если ИдентификаторСтроки = Неопределено Тогда
		Для Каждого СтрокаТочкиУчета из КоллекцияТочек цикл
			//яРайон  											= ?(Район = Неопределено, СтрокаТочкиУчета.Район, Район);
			//Если мРайоны.Найти(яРайон) = Неопределено Тогда
			//	мРайоны.Добавить(яРайон);
			//КонецЕсли;
			
			СтрокиШкал 											= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]]));		
			Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
				СтрокиТарифнойЗоны								= тзТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки",СтрокаШкалы.IDСтроки));
				Для Каждого СтрокаТарифнойЗоны из СтрокиТарифнойЗоны цикл
					//СтрокаТарифнойЗоны.Абонент	 				= ?(СтрокаТочкиУчета.Свойство("Абонент"),СтрокаТочкиУчета.Абонент,Абонент);
					СтрокаТарифнойЗоны.Организация		 		= Организация;
					СтрокаТарифнойЗоны.Район			 		= ?(НЕ Район = Неопределено,Район,СтрокаТочкиУчета["Район"]);
					СтрокаТарифнойЗоны.КлючПомещения	 		= ?(КлючПомещения = Неопределено, СтрокаТочкиУчета.КлючПомещения, КлючПомещения);
					СтрокаТарифнойЗоны.ТочкаУчета 				= СтрокаТочкиУчета.ТочкаУчета;
					СтрокаТарифнойЗоны.Услуга 					= СтрокаТочкиУчета.Услуга;
					СтрокаТарифнойЗоны.ПриборУчета 				= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["ПриборУчета"]];
					СтрокаТарифнойЗоны.IDСтрокиТочкиУчета 		= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]];
					СтрокаТарифнойЗоны.IDСтроки 				= СтрокаШкалы.IDСтроки;
					СтрокаТарифнойЗоны.ВидДифференцированности 	= СтрокаШкалы.ВидДифференцированности;
					СтрокаТарифнойЗоны.Шкала 					= СтрокаШкалы.Шкала;
					
					//яКлючПомещения  							= ?(КлючПомещения = Неопределено, СтрокаТочкиУчета.КлючПомещения, КлючПомещения);
					//Если мКлючиПомещений.Найти(яКлючПомещения) = Неопределено Тогда
					//	мКлючиПомещений.Добавить(яКлючПомещения);
					//КонецЕсли;										
				КонецЦикла;
			КонецЦикла; 		
		КонецЦикла;
	Иначе
		СтрокаТочкиУчета 										= ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		//яРайон  												= ?(Район = Неопределено, СтрокаТочкиУчета.Район, Район);
		//Если мРайоны.Найти(яРайон) = Неопределено Тогда
		//	мРайоны.Добавить(яРайон);
		//КонецЕсли;
		
		СтрокиШкал 												= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]]));		
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			СтрокиТарифнойЗоны									= тзТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки",СтрокаШкалы.IDСтроки));
			Для Каждого СтрокаТарифнойЗоны из СтрокиТарифнойЗоны цикл
				//СтрокаТарифнойЗоны.Абонент	 				= ?(СтрокаТочкиУчета.Свойство("Абонент"),СтрокаТочкиУчета.Абонент,Абонент);
				СтрокаТарифнойЗоны.Организация		 			= Организация;
				СтрокаТарифнойЗоны.Район			 			= ?(НЕ Район = Неопределено,Район,СтрокаТочкиУчета["Район"]);
				СтрокаТарифнойЗоны.КлючПомещения	 			= ?(КлючПомещения = Неопределено, СтрокаТочкиУчета.КлючПомещения, КлючПомещения);
				СтрокаТарифнойЗоны.ТочкаУчета 					= СтрокаТочкиУчета.ТочкаУчета;
				СтрокаТарифнойЗоны.Услуга 						= СтрокаТочкиУчета.Услуга;
				СтрокаТарифнойЗоны.ПриборУчета 					= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["ПриборУчета"]];
				СтрокаТарифнойЗоны.IDСтрокиТочкиУчета 			= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]];
				СтрокаТарифнойЗоны.IDСтроки 					= СтрокаШкалы.IDСтроки;
				СтрокаТарифнойЗоны.ВидДифференцированности 		= СтрокаШкалы.ВидДифференцированности;
				СтрокаТарифнойЗоны.Шкала 						= СтрокаШкалы.Шкала;
				
				//яКлючПомещения  								= ?(КлючПомещения = Неопределено, СтрокаТочкиУчета.КлючПомещения, КлючПомещения);
				//Если мКлючиПомещений.Найти(яКлючПомещения) = Неопределено Тогда
				//	мКлючиПомещений.Добавить(яКлючПомещения);
				//КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат тзТаблицаПоказаний;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения, ТабличнаяЧасть, ВспомогательныеПараметры = Неопределено) Экспорт 
	ВыборкаДанныеЗаполненияПоказаний = РезультатДанныеЗаполненияПоказаний.Выбрать();
	НаличиеВспомогательныхПараметров = Не ВспомогательныеПараметры = Неопределено;
	
	Пока ВыборкаДанныеЗаполненияПоказаний.Следующий() цикл		 
		IDСтроки  									= ТаблицаПоказанийДляЗаполнения[ВыборкаДанныеЗаполненияПоказаний.НомерСтроки -1].IDСтроки;
		ТарифнаяЗона								= ТаблицаПоказанийДляЗаполнения[ВыборкаДанныеЗаполненияПоказаний.НомерСтроки -1].ТарифнаяЗона;
		СтрокаПоказаний 							= ТабличнаяЧасть.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", IDСтроки, ТарифнаяЗона))[0];
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний,ВыборкаДанныеЗаполненияПоказаний);
		
		Если НаличиеВспомогательныхПараметров Тогда
			энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(СтрокаПоказаний,ВспомогательныеПараметры.Период,ВспомогательныеПараметры.КонтрольныйСъем);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция НовыеВспомогательныеПараметрыПриЗаполненииТабличнойЧастиПоказания() Экспорт
	
Результат = Новый Структура;
Результат.Вставить("Период", ТекущаяДата());
Результат.Вставить("КонтрольныйСъем", Ложь);
Возврат Результат;

КонецФункции

Процедура ОбновитьПоказанияПриборовУчетаМКД(ТочкиУчета,ШкалыПриборов,ТаблицаПоказаний,МоментВремени,Организация,Район,МКД,КонтрольныйСъем = ложь,ПриборУчета = Неопределено, СоответствиеКолонок = Неопределено, ИдентификаторСтроки = Неопределено) Экспорт 
			
	ИсходноеСоотвествиеКолонок  							= Новый Структура;
	ИсходноеСоотвествиеКолонок.Вставить("IDСтроки", 	"IDСтроки");
	ИсходноеСоотвествиеКолонок.Вставить("ПриборУчета", 	"ПриборУчета");
	
	Если НЕ СоответствиеКолонок = Неопределено ТОгда
		Для Каждого КлючЗначение Из СоответствиеКолонок Цикл
			 ИсходноеСоотвествиеКолонок[КлючЗначение.Ключ] 	= КлючЗначение.Значение;
		КонецЦикла;		
	КонецЕсли;
	
	// заполняем табличную часть приборы
	Если ТипЗнч(МоментВремени) = тип("Граница") тогда
		ПериодНачисления 					= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(МоментВремени.Значение, Организация, Район);
	иначе
		ПериодНачисления 					= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(МоментВремени, Организация, Район);
	КонецЕсли;
	
	Если ТипЗнч(ТочкиУчета)  = Тип("ТаблицаЗначений") тогда
		ТекущиеДанные 						= ТочкиУчета;
		Индекс 								= 0; 
	ИначеЕсли НЕ ИдентификаторСтроки = Неопределено Тогда
		ТекущиеДанные  						= ТочкиУчета.Выгрузить();
		ТекущиеДанные.Очистить();
		Строка  							= ТекущиеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки));
	Иначе	
		ТекущиеДанные  						= ТочкиУчета.Выгрузить();
		Индекс  							= -1;
	КонецЕсли;
	
	СтрокиУдалить  							= ТекущиеДанные.НайтиСтроки(Новый Структура("ПриборУчета", Справочники.энргПриборыУчетаАбонента.ПустаяСсылка()));
	
	Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
		ТекущиеДанные.Удалить(СтрокаУдалить);
	КонецЦикла;
	  	
	Если ТипЗнч(ТаблицаПоказаний)  = Тип("ТаблицаЗначений") тогда
		тзТаблицаПоказаний 							= ТаблицаПоказаний;		
	ИначеЕсли  НЕ ИдентификаторСтроки = Неопределено Тогда
		тзТаблицаПоказаний							= ТаблицаПоказаний.Выгрузить();
		тзТаблицаПоказаний.очистить();
		СтрокаТочкиУчета 							= ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокиШкал 									= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]]));
		НомерСтроки 								= 1;
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			СтрокиПоказаний  						= ТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));			
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				СтрокаТаблицаПоказаний 				= тзТаблицаПоказаний.добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаПоказаний,СтрокаПоказаний);
				СтрокаТаблицаПоказаний.НомерСтроки 	= НомерСтроки;
				НомерСтроки 						= НомерСтроки + 1;
			КонецЦикла;			  
		КонецЦикла;			
	Иначе		
		тзТаблицаПоказаний					= ТаблицаПоказаний.Выгрузить();
	КонецЕсли;
	
	тзТаблицаПоказаний.Колонки.добавить("МКД",								Новый ОписаниеТипов("СправочникСсылка.энргСтроения"));
	тзТаблицаПоказаний.Колонки.добавить("ТочкаУчета",						Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	тзТаблицаПоказаний.Колонки.добавить("Услуга",							Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	тзТаблицаПоказаний.Колонки.добавить("ПриборУчета",						Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента")); 		
	тзТаблицаПоказаний.Колонки.добавить("ВидДифференцированности",			Новый ОписаниеТипов("СправочникСсылка.энргВидыДифференцированности"));
	тзТаблицаПоказаний.Колонки.добавить("Шкала",							Новый ОписаниеТипов("СправочникСсылка.энргШкалыПриборовУчета"));
	
	Если тзТаблицаПоказаний.Колонки.Найти("IDСтрокиТочкиУчета") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("IDСтрокиТочкиУчета",		Новый ОписаниеТипов("УникальныйИдентификатор"));
	КонецЕсли;

	
	Если тзТаблицаПоказаний.Колонки.Найти("ТекущиеПоказания") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("ТекущиеПоказания",		Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,4)));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("Переворот") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("Переворот",					Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("СтатусИзмененПользователем") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("СтатусИзмененПользователем",		Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("СостояниеПоказаний") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("СостояниеПоказаний",				Новый ОписаниеТипов("ПеречислениеСсылка.энргСостояниеПоказаний"));
	КонецЕсли;
	
	Если тзТаблицаПоказаний.Колонки.Найти("ПереворотИзмененПользователем") =Неопределено Тогда
		тзТаблицаПоказаний.Колонки.добавить("ПереворотИзмененПользователем",	Новый ОписаниеТипов("Булево"));
	КонецЕсли;	
	
	Если ИдентификаторСтроки = Неопределено Тогда
		Для Каждого СтрокаТочкиУчета из ТочкиУчета цикл
			СтрокиШкал 											= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]]));		
			Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
				СтрокиТарифнойЗоны								= тзТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки",СтрокаШкалы.IDСтроки));
				Для Каждого СтрокаТарифнойЗоны из СтрокиТарифнойЗоны цикл
					//СтрокаТарифнойЗоны.Абонент	 				= ?(СтрокаТочкиУчета.Свойство("Абонент"),СтрокаТочкиУчета.Абонент,Абонент);
					СтрокаТарифнойЗоны.МКД				 		= ?(МКД = Неопределено, СтрокаТочкиУчета.МКД, МКД);
					СтрокаТарифнойЗоны.ТочкаУчета 				= СтрокаТочкиУчета.ТочкаУчета;
					СтрокаТарифнойЗоны.Услуга 					= СтрокаТочкиУчета.Услуга;
					СтрокаТарифнойЗоны.ПриборУчета 				= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["ПриборУчета"]];
					СтрокаТарифнойЗоны.IDСтрокиТочкиУчета 		= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]];
					СтрокаТарифнойЗоны.IDСтроки 				= СтрокаШкалы.IDСтроки;
					СтрокаТарифнойЗоны.ВидДифференцированности 	= СтрокаШкалы.ВидДифференцированности;
					СтрокаТарифнойЗоны.Шкала 					= СтрокаШкалы.Шкала;
				КонецЦикла;
			КонецЦикла; 		
		КонецЦикла;
	Иначе
		СтрокаТочкиУчета 										= ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокиШкал 												= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]]));		
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			СтрокиТарифнойЗоны									= тзТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки",СтрокаШкалы.IDСтроки));
			Для Каждого СтрокаТарифнойЗоны из СтрокиТарифнойЗоны цикл
				//СтрокаТарифнойЗоны.Абонент	 				= ?(СтрокаТочкиУчета.Свойство("Абонент"),СтрокаТочкиУчета.Абонент,Абонент);
				СтрокаТарифнойЗоны.МКД				 			= ?(МКД = Неопределено, СтрокаТочкиУчета.МКД, МКД);
				СтрокаТарифнойЗоны.ТочкаУчета 					= СтрокаТочкиУчета.ТочкаУчета;
				СтрокаТарифнойЗоны.Услуга 						= СтрокаТочкиУчета.Услуга;
				СтрокаТарифнойЗоны.ПриборУчета 					= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["ПриборУчета"]];
				СтрокаТарифнойЗоны.IDСтрокиТочкиУчета 			= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]];
				СтрокаТарифнойЗоны.IDСтроки 					= СтрокаШкалы.IDСтроки;
				СтрокаТарифнойЗоны.ВидДифференцированности 		= СтрокаШкалы.ВидДифференцированности;
				СтрокаТарифнойЗоны.Шкала 						= СтрокаШкалы.Шкала;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
	Если НЕ СоответствиеКолонок = Неопределено ТОгда
		Для Каждого КлючЗначение Из СоответствиеКолонок Цикл
			 ИсходноеСоотвествиеКолонок[КлючЗначение.Ключ] 		= КлючЗначение.Значение;
		КонецЦикла;		
	КонецЕсли;
	
	Поставщик 												= энргОбщегоНазначения.ЗначениеКонстанты("энргПоставщикПоУмолчанию");
	
	МВТ  													= Новый МенеджерВременныхТаблиц;	
	Параметры  												= Новый Структура("Организация,Район,МоментВремени",Организация, Район,МоментВремени);
	Если МКД <> Неопределено тогда
		 Параметры.Вставить("МКД",МКД);
	КонецЕсли;   	
	
	МаксимальныеПоказанияСрезПоследнихМКД(МВТ,"энргМаксимальныеПоказанияСрезПоследних",Параметры);
	     	
	Запрос  													= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 								= МВТ;
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("МоментВремени",			МоментВремени);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("ТекущиеДанные",			тзТаблицаПоказаний);
	Запрос.УстановитьПараметр("МКД",					МКД);
	Запрос.УстановитьПараметр("КонтрольныйСъем",		КонтрольныйСъем);
	Запрос.УстановитьПараметр("Коэффициент",			1);
	Текст 														=
	"ВЫБРАТЬ
	|	ТекущиеДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанныеДокумента.МКД КАК МКД,
	|	ТекущиеДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ТекущиеДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанныеДокумента.Шкала КАК Шкала,
	|	ТекущиеДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанныеДокумента.Услуга КАК Услуга,
	|	ТекущиеДанныеДокумента.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанныеДокумента.Переворот КАК Переворот,
	|	ТекущиеДанныеДокумента.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанныеДокумента.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТекущиеДанныеДокумента.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоэффциентыПриборовУчетаСрезПоследних.КлючПомещения КАК МКД,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ КоэффциентыПриборовУчета
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(
	|			&МоментВремени,
	|			Район = &Район
	|				И КлючПомещения В
	|					(ВЫБРАТЬ
	|						ТекущиеДанные.МКД
	|					ИЗ
	|						ТекущиеДанные КАК ТекущиеДанные)) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанные.МКД КАК МКД,
	|	ТекущиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанные.Шкала КАК Шкала,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.Переворот КАК ТекущийПереворот,
	|	ТекущиеДанные.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанные.СостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ЕСТЬNULL(КоэффциентыПриборовУчета.Коэффициент, 0) КАК Коэффициент,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможные
	|ПОМЕСТИТЬ ДанныеДокументаСПоказаниями
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффциентыПриборовУчета КАК КоэффциентыПриборовУчета
	|		ПО ТекущиеДанные.МКД = КоэффциентыПриборовУчета.МКД
	|			И ТекущиеДанные.ПриборУчета = КоэффциентыПриборовУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ТекущиеДанные.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&МКД КАК МКД,
	|	СреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	СреднийОбъемПотребленияАбонентов.Объем КАК Объем
	|ПОМЕСТИТЬ СреднийОбъемПотребления
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК СреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	СреднийОбъемПотребленияАбонентов.ПериодНачисления = &ПериодНачисления
	|	И СреднийОбъемПотребленияАбонентов.Район = &Район
	|	И СреднийОбъемПотребленияАбонентов.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументаСПоказаниями.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокументаСПоказаниями.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) КАК ПоследниеПоказания,
	|	ДанныеДокументаСПоказаниями.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ЕСТЬNULL(СреднийОбъемПотребления.Объем, 0) КАК СреднийОбъемПотребления,
	|	ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнихПоказаний,
	|	(ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)) * ДанныеДокументаСПоказаниями.Коэффициент КАК Расход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) < ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)
	|			ТОГДА (ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) - ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0)) * ДанныеДокументаСПоказаниями.Коэффициент
	|		ИНАЧЕ (ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)) * ДанныеДокументаСПоказаниями.Коэффициент
	|	КОНЕЦ КАК РасходПоМодулю,
	|	(ДанныеДокументаСПоказаниями.МаксимальноВозможные - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) + ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0)) * ДанныеДокументаСПоказаниями.Коэффициент КАК РасходСПереворотом,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК РазностьМесяцев,
	|	ДанныеДокументаСПоказаниями.Коэффициент КАК КоэффициентПУ,
	|	ДанныеДокументаСПоказаниями.ТекущийПереворот КАК ТекущийПереворот,
	|	ДанныеДокументаСПоказаниями.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ДанныеДокументаСПоказаниями.ТекущиеСостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ДанныеДокументаСПоказаниями.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ДанныеДокументаСПоказаниями.МаксимальноВозможные КАК МаксимальноВозможныеПоказания
	|ПОМЕСТИТЬ ДанныеДляАнализа
	|ИЗ
	|	ДанныеДокументаСПоказаниями КАК ДанныеДокументаСПоказаниями
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргМаксимальныеПоказанияСрезПоследних КАК энргМаксимальныеПоказанияСрезПоследних
	|		ПО ДанныеДокументаСПоказаниями.МКД = энргМаксимальныеПоказанияСрезПоследних.МКД
	|			И ДанныеДокументаСПоказаниями.ПриборУчета = энргМаксимальныеПоказанияСрезПоследних.ПриборУчета
	|			И ДанныеДокументаСПоказаниями.Шкала = энргМаксимальныеПоказанияСрезПоследних.Шкала
	|			И ДанныеДокументаСПоказаниями.ТарифнаяЗона = энргМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъемПотребления КАК СреднийОбъемПотребления
	|		ПО ДанныеДокументаСПоказаниями.МКД = СреднийОбъемПотребления.МКД
	|			И ДанныеДокументаСПоказаниями.ТочкаУчета = СреднийОбъемПотребления.ТочкаУчета
	|			И ДанныеДокументаСПоказаниями.ТарифнаяЗона = СреднийОбъемПотребления.ТарифнаяЗона
	|			И ДанныеДокументаСПоказаниями.Шкала = СреднийОбъемПотребления.Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляАнализа.НомерСтроки КАК НомерСтроки,
	|	ДанныеДляАнализа.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляАнализа.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущийПереворот
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Переворот,
	|	ДанныеДляАнализа.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	ДанныеДляАнализа.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляАнализа.ТекущийПереворот
	|						ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|					ИНАЧЕ ДанныеДляАнализа.Расход
	|				КОНЕЦ
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА 0
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ДанныеДляАнализа.Расход
	|		ИНАЧЕ ДанныеДляАнализа.РасходСПереворотом
	|	КОНЕЦ КАК Разница,
	|	ЛОЖЬ КАК ПереворотИзмененПользователем,
	|	ЛОЖЬ КАК СтатусИзмененПользователем,
	|	ДанныеДляАнализа.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущиеСостояниеПоказаний
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|		КОГДА ДанныеДляАнализа.Расход = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		КОГДА &КонтрольныйСъем
	|				И ВЫБОР
	|					КОГДА ДанныеДляАнализа.Расход >= 0
	|						ТОГДА ДанныеДляАнализа.Расход
	|					ИНАЧЕ ДанныеДляАнализа.РасходСПереворотом
	|				КОНЕЦ >= 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|	КОНЕЦ КАК СостояниеПоказаний,
	|	ДанныеДляАнализа.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеДляАнализа.ПоследниеПоказания КАК ПредыдущиеПоказания
	|ИЗ
	|	ДанныеДляАнализа КАК ДанныеДляАнализа";  
	
	Если Не энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьТарифныеЗоны") Тогда
		Текст = СтрЗаменить(Текст, "И ДанныеДокументаСПоказаниями.ТарифнаяЗона = энргМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона", "");
		Текст = СтрЗаменить(Текст, "И ДанныеДокументаСПоказаниями.ТарифнаяЗона = СреднийОбъемПотребления.ТарифнаяЗона", "");
	КонецЕсли;
	
	Запрос.Текст 					= Текст;	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	
	Пока выборка.Следующий() цикл		 
		IDСтроки  					= тзТаблицаПоказаний[Выборка.НомерСтроки -1].IDСтроки;
		ТарифнаяЗона				= тзТаблицаПоказаний[Выборка.НомерСтроки -1].ТарифнаяЗона;
		СтрокаПоказаний 			= ТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", IDСтроки, ТарифнаяЗона))[0];
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний,Выборка);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ОбновитьПоказанияПриборовУчетаТеплоисточников(ТочкиУчета,ШкалыПриборов,ТаблицаПоказаний,МоментВремени,Организация,Район,Теплоисточник,КонтрольныйСъем = ложь, приборучета=Неопределено) Экспорт 
			
	// заполняем табличную часть приборы
	Если ТипЗнч(МоментВремени) = тип("Граница") тогда
		ПериодНачисления 					= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(МоментВремени.Значение, Организация,Район);
	иначе
		ПериодНачисления 					= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(МоментВремени, Организация,Район);
	КонецЕсли;
	
	Если ТипЗнч(ТочкиУчета)  = Тип("ТаблицаЗначений") тогда
		ТекущиеДанные 						= ТочкиУчета;
		Индекс 								= 0; 
	иначе                  		
		ТекущиеДанные  						= ТочкиУчета.Выгрузить();
		Индекс  							= -1;
	КонецЕсли;
	              	
	Если ТипЗнч(ТаблицаПоказаний)  = Тип("ТаблицаЗначений") тогда
		тзТаблицаПоказаний 					= ТаблицаПоказаний;		
	иначе                  		
		тзТаблицаПоказаний					= ТаблицаПоказаний.Выгрузить();
	КонецЕсли;
	
	
	тзТаблицаПоказаний.Колонки.добавить("ТочкаУчета",				Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	тзТаблицаПоказаний.Колонки.добавить("Услуга",					Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	тзТаблицаПоказаний.Колонки.добавить("ПриборУчета",				Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	тзТаблицаПоказаний.Колонки.добавить("IDСтрокиТочкиУчета",		Новый ОписаниеТипов("УникальныйИдентификатор"));
	тзТаблицаПоказаний.Колонки.добавить("ВидДифференцированности",	Новый ОписаниеТипов("СправочникСсылка.энргВидыДифференцированности"));
	тзТаблицаПоказаний.Колонки.добавить("Шкала",					Новый ОписаниеТипов("СправочникСсылка.энргШкалыПриборовУчета"));
	
	ИсходноеСоотвествиеКолонок  							= Новый Структура;
	ИсходноеСоотвествиеКолонок.Вставить("IDСтроки", 	"IDСтроки");
	ИсходноеСоотвествиеКолонок.Вставить("ПриборУчета", "ПриборУчета");
	
	Для Каждого СтрокаТочкиУчета из ТочкиУчета цикл
		СтрокиШкал 											= ШкалыПриборов.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]]));		
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			СтрокиТарифнойЗоны								= тзТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки",СтрокаШкалы.IDСтроки));
			Для Каждого СтрокаТарифнойЗоны из СтрокиТарифнойЗоны цикл
				СтрокаТарифнойЗоны.ТочкаУчета 				= СтрокаТочкиУчета.ТочкаУчета;
				СтрокаТарифнойЗоны.Услуга 					= СтрокаТочкиУчета.Услуга;
				СтрокаТарифнойЗоны.ПриборУчета 				= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["ПриборУчета"]];
				СтрокаТарифнойЗоны.IDСтрокиТочкиУчета 		= СтрокаТочкиУчета[ИсходноеСоотвествиеКолонок["IDСтроки"]];
				СтрокаТарифнойЗоны.IDСтроки 				= СтрокаШкалы.IDСтроки;
				СтрокаТарифнойЗоны.ВидДифференцированности 	= СтрокаШкалы.ВидДифференцированности;
				СтрокаТарифнойЗоны.Шкала 					= СтрокаШкалы.Шкала;
			КонецЦикла;
		КонецЦикла; 		
	КонецЦикла;			
	
	МВТ  													= Новый МенеджерВременныхТаблиц;	
	Параметры  												= Новый Структура("Организация,Район,МоментВремени",Организация, Район,МоментВремени);
	Если Теплоисточник <> Неопределено тогда
		 Параметры.Вставить("Теплоисточник",Теплоисточник);
	КонецЕсли;   	
	
	МаксимальныеПоказанияСрезПоследнихТеплоисточник(МВТ,"энргМаксимальныеПоказанияСрезПоследних",Параметры);
	     	
	Запрос  								= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 			= МВТ;
	Запрос.УстановитьПараметр("МоментВремени",			МоментВремени);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("ТекущиеДанные",			тзТаблицаПоказаний);
	Запрос.УстановитьПараметр("Теплоисточник",			Теплоисточник);
	Запрос.УстановитьПараметр("КонтрольныйСъем",		КонтрольныйСъем);
	Запрос.УстановитьПараметр("Коэффициент",			1);
	
	Текст 								=
	"ВЫБРАТЬ
	|	ТекущиеДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанныеДокумента.Теплоисточник КАК Теплоисточник,
	|	ТекущиеДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ТекущиеДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанныеДокумента.Шкала КАК Шкала,
	|	ТекущиеДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанныеДокумента.Услуга КАК Услуга,
	|	ТекущиеДанныеДокумента.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанныеДокумента.Переворот КАК Переворот,
	|	ТекущиеДанныеДокумента.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанныеДокумента.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТекущиеДанныеДокумента.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанныеДокумента
	|ГДЕ
	|	НЕ ТекущиеДанныеДокумента.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоэффциентыПриборовУчетаСрезПоследних.КлючПомещения КАК Теплоисточник,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ КоэффциентыПриборовУчета
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &Теплоисточник) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанные.Теплоисточник КАК Теплоисточник,
	|	ТекущиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанные.Шкала КАК Шкала,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.Переворот КАК ТекущийПереворот,
	|	ТекущиеДанные.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанные.СостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ЕСТЬNULL(КоэффциентыПриборовУчета.Коэффициент, 0) КАК Коэффициент,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможные
	|ПОМЕСТИТЬ ДанныеДокументаСПоказаниями
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффциентыПриборовУчета КАК КоэффциентыПриборовУчета
	|		ПО ТекущиеДанные.ПриборУчета = КоэффциентыПриборовУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ТекущиеДанные.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументаСПоказаниями.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокументаСПоказаниями.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) КАК ПоследниеПоказания,
	|	ДанныеДокументаСПоказаниями.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнихПоказаний,
	|	(ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)) * ДанныеДокументаСПоказаниями.Коэффициент КАК Расход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) < ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)
	|			ТОГДА (ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) - ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0)) * ДанныеДокументаСПоказаниями.Коэффициент
	|		ИНАЧЕ (ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0) - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0)) * ДанныеДокументаСПоказаниями.Коэффициент
	|	КОНЕЦ КАК РасходПоМодулю,
	|	(ДанныеДокументаСПоказаниями.МаксимальноВозможные - ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Показание, 0) + ЕСТЬNULL(ДанныеДокументаСПоказаниями.ТекущиеПоказания, 0)) * ДанныеДокументаСПоказаниями.Коэффициент КАК РасходСПереворотом,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(энргМаксимальныеПоказанияСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК РазностьМесяцев,
	|	ДанныеДокументаСПоказаниями.Коэффициент КАК КоэффициентПУ,
	|	ДанныеДокументаСПоказаниями.ТекущийПереворот КАК ТекущийПереворот,
	|	ДанныеДокументаСПоказаниями.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ДанныеДокументаСПоказаниями.ТекущиеСостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ДанныеДокументаСПоказаниями.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ДанныеДокументаСПоказаниями.МаксимальноВозможные КАК МаксимальноВозможныеПоказания
	|ПОМЕСТИТЬ ДанныеДляАнализа
	|ИЗ
	|	ДанныеДокументаСПоказаниями КАК ДанныеДокументаСПоказаниями
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргМаксимальныеПоказанияСрезПоследних КАК энргМаксимальныеПоказанияСрезПоследних
	|		ПО ДанныеДокументаСПоказаниями.Теплоисточник = энргМаксимальныеПоказанияСрезПоследних.Теплоисточник
	|			И ДанныеДокументаСПоказаниями.ПриборУчета = энргМаксимальныеПоказанияСрезПоследних.ПриборУчета
	|			И ДанныеДокументаСПоказаниями.Шкала = энргМаксимальныеПоказанияСрезПоследних.Шкала
	|			И ДанныеДокументаСПоказаниями.ТарифнаяЗона = энргМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляАнализа.НомерСтроки КАК НомерСтроки,
	|	ДанныеДляАнализа.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляАнализа.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущийПереворот
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Переворот,
	|	ДанныеДляАнализа.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляАнализа.ТекущийПереворот
	|						ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|					ИНАЧЕ ДанныеДляАнализа.Расход
	|				КОНЕЦ
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА 0
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ДанныеДляАнализа.Расход
	|		ИНАЧЕ ДанныеДляАнализа.РасходСПереворотом
	|	КОНЕЦ КАК Разница,
	|	ЛОЖЬ КАК ПереворотИзмененПользователем,
	|	ЛОЖЬ КАК СтатусИзмененПользователем,
	|	ДанныеДляАнализа.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущиеСостояниеПоказаний
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|		КОГДА ДанныеДляАнализа.Расход = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		КОГДА ВЫБОР
	|				КОГДА ДанныеДляАнализа.Расход >= 0
	|					ТОГДА ДанныеДляАнализа.Расход
	|				ИНАЧЕ ДанныеДляАнализа.РасходСПереворотом
	|			КОНЕЦ >= 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|	КОНЕЦ КАК СостояниеПоказаний,
	|	ДанныеДляАнализа.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеДляАнализа.ПоследниеПоказания КАК ПредыдущиеПоказания
	|ИЗ
	|	ДанныеДляАнализа КАК ДанныеДляАнализа";  
	
	Если Теплоисточник <> Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"ТекущиеДанныеДокумента.Теплоисточник","&Теплоисточник");
		Запрос.УстановитьПараметр("Теплоисточник",Теплоисточник);
	иначе
		Текст 						= СтрЗаменить(Текст,"И СреднийОбъемПотребленияАбонентов.Теплоисточник = &Теплоисточник","");
	КонецЕсли;
	
	Запрос.Текст 					= Текст;	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	
	Пока выборка.Следующий() цикл		 
		IDСтроки  					= тзТаблицаПоказаний[Выборка.НомерСтроки -1].IDСтроки;
		ТарифнаяЗона				= тзТаблицаПоказаний[Выборка.НомерСтроки -1].ТарифнаяЗона;
		СтрокаПоказаний 			= ТаблицаПоказаний.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", IDСтроки, ТарифнаяЗона))[0];
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний,Выборка);
	КонецЦикла;  
	
КонецПроцедуры

Процедура МаксимальныеПоказанияСрезПоследнихМКД(МВТ,ИмяТаблицы,Параметры)  Экспорт 
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст = "ВЫБРАТЬ
	|	энргМаксимальныеПоказания.МКД,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	энргМаксимальныеПоказания.Период,
	|	энргМаксимальныеПоказания.Регистратор,
	|	энргМаксимальныеПоказания.Разделитель,
	|	энргМаксимальныеПоказания.Показание
	|ПОМЕСТИТЬ Набор
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияМКД КАК энргМаксимальныеПоказания
	|ГДЕ
	|	энргМаксимальныеПоказания.Организация = &Организация
	|	И энргМаксимальныеПоказания.Район = &Район
	|	И энргМаксимальныеПоказания.МКД = &МКД
	|	И энргМаксимальныеПоказания.ПриборУчета = &ПриборУчета
	|	И энргМаксимальныеПоказания.Период <= &МоментВремениПериод
	|	И энргМаксимальныеПоказания.Регистратор <= &МоментВремениРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.МКД,
	|	Набор.ПриборУчета,
	|	Набор.Шкала,
	|	Набор.ТарифнаяЗона,
	|	МАКСИМУМ(Набор.Период) КАК Период
	|ПОМЕСТИТЬ МаксимальнаяДатаРегистратора
	|ИЗ
	|	Набор КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.МКД,
	|	Набор.ПриборУчета,
	|	Набор.Шкала,
	|	Набор.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаРегистратора.МКД,
	|	МаксимальнаяДатаРегистратора.ПриборУчета,
	|	МаксимальнаяДатаРегистратора.Шкала,
	|	МаксимальнаяДатаРегистратора.ТарифнаяЗона,
	|	МаксимальнаяДатаРегистратора.Период,
	|	МАКСИМУМ(Набор.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ МаксимумРегистратор
	|ИЗ
	|	МаксимальнаяДатаРегистратора КАК МаксимальнаяДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Набор КАК Набор
	|		ПО МаксимальнаяДатаРегистратора.МКД = Набор.МКД
	|			И МаксимальнаяДатаРегистратора.ПриборУчета = Набор.ПриборУчета
	|			И МаксимальнаяДатаРегистратора.Шкала = Набор.Шкала
	|			И МаксимальнаяДатаРегистратора.ТарифнаяЗона = Набор.ТарифнаяЗона
	|			И МаксимальнаяДатаРегистратора.Период = Набор.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаРегистратора.МКД,
	|	МаксимальнаяДатаРегистратора.ПриборУчета,
	|	МаксимальнаяДатаРегистратора.Шкала,
	|	МаксимальнаяДатаРегистратора.ТарифнаяЗона,
	|	МаксимальнаяДатаРегистратора.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимумРегистратор.МКД,
	|	МаксимумРегистратор.ПриборУчета,
	|	МаксимумРегистратор.Шкала,
	|	МаксимумРегистратор.ТарифнаяЗона,
	|	МаксимумРегистратор.Период,
	|	МаксимумРегистратор.Регистратор,
	|	МАКСИМУМ(Набор.Разделитель) КАК Разделитель
	|ПОМЕСТИТЬ МаксимумРазделить
	|ИЗ
	|	МаксимумРегистратор КАК МаксимумРегистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Набор КАК Набор
	|		ПО МаксимумРегистратор.МКД = Набор.МКД
	|			И МаксимумРегистратор.ПриборУчета = Набор.ПриборУчета
	|			И МаксимумРегистратор.Шкала = Набор.Шкала
	|			И МаксимумРегистратор.ТарифнаяЗона = Набор.ТарифнаяЗона
	|			И МаксимумРегистратор.Период = Набор.Период
	|			И МаксимумРегистратор.Регистратор = Набор.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимумРегистратор.Регистратор,
	|	МаксимумРегистратор.ПриборУчета,
	|	МаксимумРегистратор.Шкала,
	|	МаксимумРегистратор.ТарифнаяЗона,
	|	МаксимумРегистратор.МКД,
	|	МаксимумРегистратор.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.МКД,
	|	Набор.ПриборУчета,
	|	Набор.Шкала,
	|	Набор.ТарифнаяЗона,
	|	Набор.Период КАК Период,
	|	Набор.Регистратор,
	|	Набор.Разделитель,
	|	Набор.Показание
	|ПОМЕСТИТЬ энргМаксимальныеПоказанияСрезПоследних
	|ИЗ
	|	Набор КАК Набор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимумРазделить КАК МаксимумРазделить
	|		ПО Набор.МКД = МаксимумРазделить.МКД
	|			И Набор.ПриборУчета = МаксимумРазделить.ПриборУчета
	|			И Набор.Шкала = МаксимумРазделить.Шкала
	|			И Набор.ТарифнаяЗона = МаксимумРазделить.ТарифнаяЗона
	|			И Набор.Период = МаксимумРазделить.Период
	|			И Набор.Регистратор = МаксимумРазделить.Регистратор
	|			И Набор.Разделитель = МаксимумРазделить.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Набор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимальнаяДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРазделить";
	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	Если не Параметры.свойство("Район") тогда
		Текст = СтрЗаменить(Текст,"энргМаксимальныеПоказанияРазделитель.Район = &Район","Истина");
	иначе
		Запрос.УстановитьПараметр("Район",Параметры.Район);
	КонецЕсли;
	 	
	Если не Параметры.свойство("МКД") тогда
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",Параметры.МКД);
	КонецЕсли;

	Если не Параметры.свойство("ПриборУчета") тогда
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.ПриборУчета = &ПриборУчета","");
	ИначеЕсли ТипЗнч(Параметры.ПриборУчета) = тип("Массив") тогда
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.ПриборУчета = &ПриборУчета","И энргМаксимальныеПоказания.ПриборУчета в (&ПриборыУчета)");
		Запрос.УстановитьПараметр("ПриборыУчета",Параметры.ПриборУчета)
	иначе	
		Запрос.УстановитьПараметр("ПриборУчета",Параметры.ПриборУчета);
	КонецЕсли;

	Если не Параметры.свойство("МоментВремени") тогда
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.Период <= &МоментВремениПериод","");
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.Регистратор <= &МоментВремениРегистратор","");
	ИначеЕсли Параметры.МоментВремени = Неопределено тогда
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.Период <= &МоментВремениПериод","");
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.Регистратор <= &МоментВремениРегистратор","");
	ИначеЕсли ТипЗнч(Параметры.МоментВремени) = Тип("Дата") тогда 
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.Регистратор <= &МоментВремениРегистратор","");
		Запрос.УстановитьПараметр("МоментВремениПериод",Параметры.МоментВремени); 
		
	ИначеЕсли  ТипЗнч(Параметры.МоментВремени) = Тип("Граница")
		и  Параметры.МоментВремени.ВидГраницы = ВидГраницы.Исключая
		и ТипЗнч(Параметры.МоментВремени.Значение) = Тип("Дата")  тогда	
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.Период <= &МоментВремениПериод","И энргМаксимальныеПоказания.Период < &МоментВремениПериод");
		Текст = СтрЗаменить(Текст,"И энргМаксимальныеПоказания.Регистратор <= &МоментВремениРегистратор","");
		Запрос.УстановитьПараметр("МоментВремениПериод",Параметры.МоментВремени.Значение);
	иначе 		
		Запрос.УстановитьПараметр("МоментВремениПериод",Параметры.МоментВремени.дата);
		Запрос.УстановитьПараметр("МоментВремениРегистратор",Параметры.МоментВремени.ссылка);
	КонецЕсли;
	
	Текст 			= СтрЗаменить(Текст,"ПОМЕСТИТЬ энргМаксимальныеПоказанияСрезПоследних","ПОМЕСТИТЬ " + ИмяТаблицы);	
	Запрос.Текст 	= Текст;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура МаксимальныеПоказанияСрезПоследнихТеплоисточник(МВТ,ИмяТаблицы,Параметры)  Экспорт 
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст = 
	"ВЫБРАТЬ
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.Теплоисточник КАК Теплоисточник,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.Период КАК Период,
	|	МАКСИМУМ(энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.Показание) КАК Показание
	|ПОМЕСТИТЬ энргМаксимальныеПоказанияСрезПоследних
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчетаТеплоисточников.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Теплоисточник = &Теплоисточник
	|				И СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)) КАК энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.Теплоисточник,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.ПриборУчета,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.Шкала,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.ТарифнаяЗона,
	|	энргПоказанияПриборовУчетаТеплоисточниковСрезПоследних.Период";
	
	Запрос.УстановитьПараметр("Организация",	Параметры.Организация);
	Запрос.УстановитьПараметр("Район",			Параметры.Район);
	Запрос.УстановитьПараметр("Теплоисточник",	Параметры.Теплоисточник);
	Запрос.УстановитьПараметр("МоментВремени",	Параметры.МоментВремени);

	Текст 			= СтрЗаменить(Текст,"ПОМЕСТИТЬ энргМаксимальныеПоказанияСрезПоследних","ПОМЕСТИТЬ " + ИмяТаблицы);	
	Запрос.Текст 	= Текст;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ЗаполнитьДанныеПрибораУчетаПлатежноеПоручение(ТекущиеДанные, ДатаОплаты,ПериодНачисления,Район) Экспорт
		
	Запрос  	= Новый Запрос;	
	Запрос.УстановитьПараметр("Район",Район);
	Запрос.УстановитьПараметр("ПериодНачисления",ПериодНачисления);
	Запрос.УстановитьПараметр("Период",ДатаОплаты);
	Запрос.УстановитьПараметр("ТекущиеДанные",ТекущиеДанные);  
	
	СоотвествиеКолонок  = Новый Структура;
	СоотвествиеКолонок.Вставить("СуммаПолив","Полив");
	СоотвествиеКолонок.Вставить("СуммаСливГВС","СливГВС");
	СоотвествиеКолонок.Вставить("СуммаСливХВС","СливХВС");
	СоотвествиеКолонок.Вставить("СуммаХВС","ХВС");	
	
	Текст ="ВЫБРАТЬ
	|	ТекущиеДанные.ТекущиеПоказания,
	|	ТекущиеДанные.СуммаПолив,
	|	ТекущиеДанные.СуммаСливХВС,
	|	ТекущиеДанные.СуммаСливГВС,
	|	ТекущиеДанные.СуммаХВС,
	|	ТекущиеДанные.ДатаОперации,
	|	ТекущиеДанные.ФИО,
	|	ТекущиеДанные.ЛС,
	|	ТекущиеДанные.НомерПУ
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(энргАбоненты.Ссылка, ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)) КАК АбонентСсылка,
	|	ЕСТЬNULL(энргАбоненты.Район, ЗНАЧЕНИЕ(Справочник.энргЗоныОтвественности.ПустаяСсылка)) КАК Район,
	|	ТекущиеДанные.ЛС,
	|	ТекущиеДанные.ТекущиеПоказания,
	|	ТекущиеДанные.СуммаПолив,
	|	ТекущиеДанные.СуммаСливХВС,
	|	ТекущиеДанные.СуммаСливГВС,
	|	ТекущиеДанные.СуммаХВС,
	|	ТекущиеДанные.ДатаОперации,
	|	ТекущиеДанные.ФИО,
	|	ТекущиеДанные.НомерПУ
	|ПОМЕСТИТЬ ПоискАбонента
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ТекущиеДанные.ЛС = энргАбоненты.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоискАбонента.АбонентСсылка,
	|	ПоискАбонента.Район,
	|	ПоискАбонента.ЛС,
	|	ПоискАбонента.ТекущиеПоказания,
	|	ПоискАбонента.СуммаПолив,
	|	ПоискАбонента.СуммаСливХВС,
	|	ПоискАбонента.СуммаСливГВС,
	|	ПоискАбонента.СуммаХВС,
	|	ПоискАбонента.ДатаОперации,
	|	ПоискАбонента.ФИО,
	|	ПоискАбонента.НомерПУ
	|ПОМЕСТИТЬ НайденныеАбоненты
	|ИЗ
	|	ПоискАбонента КАК ПоискАбонента
	|ГДЕ
	|	НЕ ПоискАбонента.АбонентСсылка = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеАбоненты.АбонентСсылка,
	|	НайденныеАбоненты.ДатаОперации,
	|	НайденныеАбоненты.Район,
	|	МАКСИМУМ(ЕСТЬNULL(энргСостояниеЛС.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодОткрытияЛС
	|ПОМЕСТИТЬ МаксПериодСостояниеЛС
	|ИЗ
	|	НайденныеАбоненты КАК НайденныеАбоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеЛС КАК энргСостояниеЛС
	|		ПО НайденныеАбоненты.АбонентСсылка = энргСостояниеЛС.Абонент
	|			И НайденныеАбоненты.Район = энргСостояниеЛС.Район
	|			И НайденныеАбоненты.ДатаОперации >= энргСостояниеЛС.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеАбоненты.АбонентСсылка,
	|	НайденныеАбоненты.Район,
	|	НайденныеАбоненты.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксПериодСостояниеЛС.АбонентСсылка,
	|	МаксПериодСостояниеЛС.Район,
	|	МаксПериодСостояниеЛС.ДатаОперации,
	|	МаксПериодСостояниеЛС.ПериодОткрытияЛС,
	|	МАКСИМУМ(ЕСТЬNULL(энргСостояниеЛС.Регистратор, НЕОПРЕДЕЛЕНО)) КАК РегистраторСосоятонияЛС
	|ПОМЕСТИТЬ МаксРегСостоянияЛс
	|ИЗ
	|	МаксПериодСостояниеЛС КАК МаксПериодСостояниеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеЛС КАК энргСостояниеЛС
	|		ПО МаксПериодСостояниеЛС.АбонентСсылка = энргСостояниеЛС.Абонент
	|			И МаксПериодСостояниеЛС.Район = энргСостояниеЛС.Район
	|			И МаксПериодСостояниеЛС.ПериодОткрытияЛС = энргСостояниеЛС.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксПериодСостояниеЛС.АбонентСсылка,
	|	МаксПериодСостояниеЛС.Район,
	|	МаксПериодСостояниеЛС.ДатаОперации,
	|	МаксПериодСостояниеЛС.ПериодОткрытияЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксРегСостоянияЛс.АбонентСсылка,
	|	МаксРегСостоянияЛс.Район КАК Район,
	|	МаксРегСостоянияЛс.ДатаОперации,
	|	ЕСТЬNULL(энргСостояниеЛС.Состояние, ЛОЖЬ) КАК ЛСОткрыт
	|ПОМЕСТИТЬ СостояниеЛС
	|ИЗ
	|	МаксРегСостоянияЛс КАК МаксРегСостоянияЛс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеЛС КАК энргСостояниеЛС
	|		ПО МаксРегСостоянияЛс.АбонентСсылка = энргСостояниеЛС.Абонент
	|			И МаксРегСостоянияЛс.Район = энргСостояниеЛС.Район
	|			И МаксРегСостоянияЛс.ПериодОткрытияЛС = энргСостояниеЛС.Период
	|			И МаксРегСостоянияЛс.РегистраторСосоятонияЛС = энргСостояниеЛС.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостояниеЛС.АбонентСсылка КАК Абонент,
	|	СостояниеЛС.Район КАК Район,
	|	МАКСИМУМ(энргАктивностьТочекУчета.Период) КАК Период,
	|	СостояниеЛС.ДатаОперации,
	|	энргАктивностьТочекУчета.ТочкаУчета
	|ПОМЕСТИТЬ АктивностьТУ
	|ИЗ
	|	СостояниеЛС КАК СостояниеЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	|		ПО СостояниеЛС.АбонентСсылка = энргАктивностьТочекУчета.Абонент
	|			И СостояниеЛС.ДатаОперации >= энргАктивностьТочекУчета.Период
	|			И СостояниеЛС.Район = энргАктивностьТочекУчета.Район
	|
	|СГРУППИРОВАТЬ ПО
	|	СостояниеЛС.АбонентСсылка,
	|	СостояниеЛС.Район,
	|	энргАктивностьТочекУчета.ТочкаУчета,
	|	СостояниеЛС.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивностьТУ.Абонент,
	|	АктивностьТУ.Район,
	|	АктивностьТУ.ДатаОперации,
	|	АктивностьТУ.Период,
	|	энргАктивностьТочекУчета.ТочкаУчета,
	|	МАКСИМУМ(энргАктивностьТочекУчета.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ МаксРегистраторТУ
	|ИЗ
	|	АктивностьТУ КАК АктивностьТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	|		ПО АктивностьТУ.Абонент = энргАктивностьТочекУчета.Абонент
	|			И АктивностьТУ.Период = энргАктивностьТочекУчета.Период
	|			И АктивностьТУ.ТочкаУчета = энргАктивностьТочекУчета.ТочкаУчета
	|			И АктивностьТУ.Район = энргАктивностьТочекУчета.Район
	|
	|СГРУППИРОВАТЬ ПО
	|	АктивностьТУ.Абонент,
	|	АктивностьТУ.Район,
	|	АктивностьТУ.ДатаОперации,
	|	АктивностьТУ.Период,
	|	энргАктивностьТочекУчета.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксРегистраторТУ.Абонент,
	|	МаксРегистраторТУ.Район,
	|	МаксРегистраторТУ.ДатаОперации,
	|	энргАктивностьТочекУчета.ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочкиУчета
	|ИЗ
	|	МаксРегистраторТУ КАК МаксРегистраторТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	|		ПО МаксРегистраторТУ.Абонент = энргАктивностьТочекУчета.Абонент
	|			И МаксРегистраторТУ.Регистратор = энргАктивностьТочекУчета.Регистратор
	|			И МаксРегистраторТУ.Период = энргАктивностьТочекУчета.Период
	|			И МаксРегистраторТУ.Район = энргАктивностьТочекУчета.Район
	|			И (энргАктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУчета.Абонент,
	|	АктивныеТочкиУчета.Район,
	|	АктивныеТочкиУчета.ТочкаУчета,
	|	АктивныеТочкиУчета.ДатаОперации,
	|	МАКСИМУМ(энргПриборыТочекУчета.Период) КАК МаксПериодПрибора
	|ПОМЕСТИТЬ МаксПериодПрибораУчета
	|ИЗ
	|	АктивныеТочкиУчета КАК АктивныеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПриборыТочекУчета КАК энргПриборыТочекУчета
	|		ПО АктивныеТочкиУчета.ДатаОперации >= энргПриборыТочекУчета.Период
	|			И АктивныеТочкиУчета.Абонент = энргПриборыТочекУчета.Абонент
	|			И (энргПриборыТочекУчета.Район = энргПриборыТочекУчета.Район)
	|			И АктивныеТочкиУчета.ТочкаУчета = энргПриборыТочекУчета.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	АктивныеТочкиУчета.Абонент,
	|	АктивныеТочкиУчета.Район,
	|	АктивныеТочкиУчета.ТочкаУчета,
	|	АктивныеТочкиУчета.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксПериодПрибораУчета.Абонент,
	|	МаксПериодПрибораУчета.Район,
	|	МаксПериодПрибораУчета.ТочкаУчета,
	|	МаксПериодПрибораУчета.МаксПериодПрибора,
	|	МАКСИМУМ(энргПриборыТочекУчета.Регистратор) КАК МаксимальныйРегистраторПрибора,
	|	МаксПериодПрибораУчета.ДатаОперации
	|ПОМЕСТИТЬ МаксРегПриборыТУ
	|ИЗ
	|	МаксПериодПрибораУчета КАК МаксПериодПрибораУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПриборыТочекУчета КАК энргПриборыТочекУчета
	|		ПО МаксПериодПрибораУчета.Абонент = энргПриборыТочекУчета.Абонент
	|			И МаксПериодПрибораУчета.ТочкаУчета = энргПриборыТочекУчета.ТочкаУчета
	|			И МаксПериодПрибораУчета.МаксПериодПрибора = энргПриборыТочекУчета.Период
	|			И МаксПериодПрибораУчета.Район = энргПриборыТочекУчета.Район
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксПериодПрибораУчета.Абонент,
	|	МаксПериодПрибораУчета.Район,
	|	МаксПериодПрибораУчета.ТочкаУчета,
	|	МаксПериодПрибораУчета.МаксПериодПрибора,
	|	МаксПериодПрибораУчета.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксРегПриборыТУ.Абонент,
	|	МаксРегПриборыТУ.Район,
	|	МаксРегПриборыТУ.ТочкаУчета,
	|	МаксРегПриборыТУ.ДатаОперации,
	|	ЕСТЬNULL(энргПриборыТочекУчета.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)) КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочекУчета
	|ИЗ
	|	МаксРегПриборыТУ КАК МаксРегПриборыТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПриборыТочекУчета КАК энргПриборыТочекУчета
	|		ПО МаксРегПриборыТУ.МаксимальныйРегистраторПрибора = энргПриборыТочекУчета.Регистратор
	|			И МаксРегПриборыТУ.Район = энргПриборыТочекУчета.Район
	|			И МаксРегПриборыТУ.МаксПериодПрибора = энргПриборыТочекУчета.Период
	|			И МаксРегПриборыТУ.Абонент = энргПриборыТочекУчета.Абонент
	|			И МаксРегПриборыТУ.ТочкаУчета = энргПриборыТочекУчета.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыТочекУчета.Абонент,
	|	ПриборыТочекУчета.Район,
	|	ПриборыТочекУчета.ТочкаУчета,
	|	ПриборыТочекУчета.ДатаОперации,
	|	ПриборыТочекУчета.ПриборУчета,
	|	МАКСИМУМ(энргСостояниеПриборовУчетаАбонента.Период) КАК МаксПериод
	|ПОМЕСТИТЬ МаксПериодСостояниеПриборов
	|ИЗ
	|	ПриборыТочекУчета КАК ПриборыТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК энргСостояниеПриборовУчетаАбонента
	|		ПО ПриборыТочекУчета.ДатаОперации >= энргСостояниеПриборовУчетаАбонента.Период
	|			И ПриборыТочекУчета.Район = энргСостояниеПриборовУчетаАбонента.Район
	|			И ПриборыТочекУчета.Абонент = энргСостояниеПриборовУчетаАбонента.Абонент
	|			И ПриборыТочекУчета.ТочкаУчета = энргСостояниеПриборовУчетаАбонента.ТочкаУчета
	|			И ПриборыТочекУчета.ПриборУчета = энргСостояниеПриборовУчетаАбонента.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриборыТочекУчета.Абонент,
	|	ПриборыТочекУчета.Район,
	|	ПриборыТочекУчета.ТочкаУчета,
	|	ПриборыТочекУчета.ДатаОперации,
	|	ПриборыТочекУчета.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксПериодСостояниеПриборов.Абонент,
	|	МаксПериодСостояниеПриборов.Район,
	|	МаксПериодСостояниеПриборов.ТочкаУчета,
	|	МаксПериодСостояниеПриборов.ДатаОперации,
	|	МаксПериодСостояниеПриборов.ПриборУчета,
	|	МаксПериодСостояниеПриборов.МаксПериод,
	|	МАКСИМУМ(энргСостояниеПриборовУчетаАбонента.Регистратор) КАК МаксРегистратор
	|ПОМЕСТИТЬ МаксРегистраторСостояниеПриборов
	|ИЗ
	|	МаксПериодСостояниеПриборов КАК МаксПериодСостояниеПриборов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК энргСостояниеПриборовУчетаАбонента
	|		ПО МаксПериодСостояниеПриборов.МаксПериод = энргСостояниеПриборовУчетаАбонента.Период
	|			И МаксПериодСостояниеПриборов.Район = энргСостояниеПриборовУчетаАбонента.Район
	|			И МаксПериодСостояниеПриборов.Абонент = энргСостояниеПриборовУчетаАбонента.Абонент
	|			И МаксПериодСостояниеПриборов.ТочкаУчета = энргСостояниеПриборовУчетаАбонента.ТочкаУчета
	|			И МаксПериодСостояниеПриборов.ПриборУчета = энргСостояниеПриборовУчетаАбонента.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксПериодСостояниеПриборов.Абонент,
	|	МаксПериодСостояниеПриборов.Район,
	|	МаксПериодСостояниеПриборов.ТочкаУчета,
	|	МаксПериодСостояниеПриборов.ДатаОперации,
	|	МаксПериодСостояниеПриборов.ПриборУчета,
	|	МаксПериодСостояниеПриборов.МаксПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксРегистраторСостояниеПриборов.Район,
	|	МаксРегистраторСостояниеПриборов.Абонент,
	|	МаксРегистраторСостояниеПриборов.ТочкаУчета,
	|	МаксРегистраторСостояниеПриборов.ДатаОперации,
	|	МаксРегистраторСостояниеПриборов.ПриборУчета
	|ПОМЕСТИТЬ ВведенныеПриборы
	|ИЗ
	|	МаксРегистраторСостояниеПриборов КАК МаксРегистраторСостояниеПриборов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК энргСостояниеПриборовУчетаАбонента
	|		ПО МаксРегистраторСостояниеПриборов.МаксПериод = энргСостояниеПриборовУчетаАбонента.Период
	|			И МаксРегистраторСостояниеПриборов.МаксРегистратор = энргСостояниеПриборовУчетаАбонента.Регистратор
	|			И МаксРегистраторСостояниеПриборов.Район = энргСостояниеПриборовУчетаАбонента.Район
	|			И МаксРегистраторСостояниеПриборов.Абонент = энргСостояниеПриборовУчетаАбонента.Абонент
	|			И МаксРегистраторСостояниеПриборов.ТочкаУчета = энргСостояниеПриборовУчетаАбонента.ТочкаУчета
	|			И МаксРегистраторСостояниеПриборов.ПриборУчета = энргСостояниеПриборовУчетаАбонента.ПриборУчета
	|			И (энргСостояниеПриборовУчетаАбонента.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВведенныеПриборы.Абонент,
	|	ВведенныеПриборы.Район,
	|	ВведенныеПриборы.ТочкаУчета,
	|	ВведенныеПриборы.ДатаОперации,
	|	ВведенныеПриборы.ПриборУчета,
	|	МАКСИМУМ(энргУслугиТочекУчета.Период) КАК МаксПериодУслуги
	|ПОМЕСТИТЬ МаксПериодУслугиТочек
	|ИЗ
	|	ВведенныеПриборы КАК ВведенныеПриборы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета КАК энргУслугиТочекУчета
	|		ПО ВведенныеПриборы.ДатаОперации >= энргУслугиТочекУчета.Период
	|			И ВведенныеПриборы.Абонент = энргУслугиТочекУчета.Абонент
	|			И ВведенныеПриборы.Район = энргУслугиТочекУчета.Район
	|			И ВведенныеПриборы.ТочкаУчета = энргУслугиТочекУчета.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВведенныеПриборы.Абонент,
	|	ВведенныеПриборы.Район,
	|	ВведенныеПриборы.ТочкаУчета,
	|	ВведенныеПриборы.ДатаОперации,
	|	ВведенныеПриборы.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксПериодУслугиТочек.Абонент,
	|	МаксПериодУслугиТочек.Район,
	|	МаксПериодУслугиТочек.ТочкаУчета,
	|	МаксПериодУслугиТочек.ПриборУчета,
	|	МаксПериодУслугиТочек.МаксПериодУслуги,
	|	МАКСИМУМ(энргУслугиТочекУчета.Регистратор) КАК МаксимальныйРегистраторУслуг,
	|	МаксПериодУслугиТочек.ДатаОперации
	|ПОМЕСТИТЬ МаксРегУСлугиТУ
	|ИЗ
	|	МаксПериодУслугиТочек КАК МаксПериодУслугиТочек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета КАК энргУслугиТочекУчета
	|		ПО МаксПериодУслугиТочек.Абонент = энргУслугиТочекУчета.Абонент
	|			И МаксПериодУслугиТочек.ТочкаУчета = энргУслугиТочекУчета.ТочкаУчета
	|			И МаксПериодУслугиТочек.МаксПериодУслуги = энргУслугиТочекУчета.Период
	|			И МаксПериодУслугиТочек.Район = энргУслугиТочекУчета.Район
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксПериодУслугиТочек.Абонент,
	|	МаксПериодУслугиТочек.Район,
	|	МаксПериодУслугиТочек.ТочкаУчета,
	|	МаксПериодУслугиТочек.ПриборУчета,
	|	МаксПериодУслугиТочек.МаксПериодУслуги,
	|	МаксПериодУслугиТочек.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксРегУСлугиТУ.Абонент,
	|	МаксРегУСлугиТУ.Район,
	|	МаксРегУСлугиТУ.ТочкаУчета,
	|	МаксРегУСлугиТУ.ПриборУчета,
	|	МаксРегУСлугиТУ.ДатаОперации,
	|	ЕСТЬNULL(энргУслугиТочекУчета.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПУстаяСсылка)) КАК Услуга
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	МаксРегУСлугиТУ КАК МаксРегУСлугиТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета КАК энргУслугиТочекУчета
	|		ПО МаксРегУСлугиТУ.МаксимальныйРегистраторУслуг = энргУслугиТочекУчета.Регистратор
	|			И МаксРегУСлугиТУ.Район = энргУслугиТочекУчета.Район
	|			И МаксРегУСлугиТУ.МаксПериодУслуги = энргУслугиТочекУчета.Период
	|			И МаксРегУСлугиТУ.Абонент = энргУслугиТочекУчета.Абонент
	|			И МаксРегУСлугиТУ.ТочкаУчета = энргУслугиТочекУчета.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиТочекУчета.Абонент,
	|	энргПриборыУчетаАбонента.Наименование КАК ЗаводскойНомерПУ,
	|	УслугиТочекУчета.Район,
	|	УслугиТочекУчета.ТочкаУчета,
	|	УслугиТочекУчета.ПриборУчета,
	|	УслугиТочекУчета.ДатаОперации,
	|	УслугиТочекУчета.Услуга,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания
	|ПОМЕСТИТЬ ЗаводскиеНомераПУ
	|ИЗ
	|	УслугиТочекУчета КАК УслугиТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО УслугиТочекУчета.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаводскиеНомераПУ.Абонент,
	|	ЗаводскиеНомераПУ.ЗаводскойНомерПУ,
	|	ЗаводскиеНомераПУ.Район,
	|	ЗаводскиеНомераПУ.ТочкаУчета,
	|	ЗаводскиеНомераПУ.ПриборУчета,
	|	ЗаводскиеНомераПУ.ДатаОперации,
	|	ЗаводскиеНомераПУ.Услуга,
	|	МАКСИМУМ(энргКоэффциентыПриборовУчета.Период) КАК Период,
	|	ЗаводскиеНомераПУ.МаксимальноВозможныеПоказания
	|ПОМЕСТИТЬ макПериодКоэффициентПрибора
	|ИЗ
	|	ЗаводскиеНомераПУ КАК ЗаводскиеНомераПУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКоэффциентыПриборовУчета КАК энргКоэффциентыПриборовУчета
	|		ПО ЗаводскиеНомераПУ.ПриборУчета = энргКоэффциентыПриборовУчета.ПриборУчета
	|			И ЗаводскиеНомераПУ.Район = энргКоэффциентыПриборовУчета.Район
	|			И ЗаводскиеНомераПУ.Абонент = энргКоэффциентыПриборовУчета.Абонент
	|			И ЗаводскиеНомераПУ.ДатаОперации >= энргКоэффциентыПриборовУчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаводскиеНомераПУ.Абонент,
	|	ЗаводскиеНомераПУ.ЗаводскойНомерПУ,
	|	ЗаводскиеНомераПУ.Район,
	|	ЗаводскиеНомераПУ.ТочкаУчета,
	|	ЗаводскиеНомераПУ.ПриборУчета,
	|	ЗаводскиеНомераПУ.ДатаОперации,
	|	ЗаводскиеНомераПУ.Услуга,
	|	ЗаводскиеНомераПУ.МаксимальноВозможныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	макПериодКоэффициентПрибора.Абонент,
	|	макПериодКоэффициентПрибора.ЗаводскойНомерПУ,
	|	макПериодКоэффициентПрибора.Район,
	|	макПериодКоэффициентПрибора.ТочкаУчета,
	|	макПериодКоэффициентПрибора.ПриборУчета,
	|	макПериодКоэффициентПрибора.ДатаОперации,
	|	макПериодКоэффициентПрибора.Услуга,
	|	энргКоэффциентыПриборовУчета.Период КАК Период,
	|	МАКСИМУМ(энргКоэффциентыПриборовУчета.Регистратор) КАК Регистратор,
	|	макПериодКоэффициентПрибора.МаксимальноВозможныеПоказания
	|ПОМЕСТИТЬ максРегистраторКоэффициентПрибора
	|ИЗ
	|	макПериодКоэффициентПрибора КАК макПериодКоэффициентПрибора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКоэффциентыПриборовУчета КАК энргКоэффциентыПриборовУчета
	|		ПО макПериодКоэффициентПрибора.ПриборУчета = энргКоэффциентыПриборовУчета.ПриборУчета
	|			И макПериодКоэффициентПрибора.Район = энргКоэффциентыПриборовУчета.Район
	|			И макПериодКоэффициентПрибора.Абонент = энргКоэффциентыПриборовУчета.Абонент
	|			И макПериодКоэффициентПрибора.Период = энргКоэффциентыПриборовУчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	макПериодКоэффициентПрибора.Абонент,
	|	макПериодКоэффициентПрибора.ЗаводскойНомерПУ,
	|	макПериодКоэффициентПрибора.Район,
	|	макПериодКоэффициентПрибора.ТочкаУчета,
	|	макПериодКоэффициентПрибора.ПриборУчета,
	|	макПериодКоэффициентПрибора.ДатаОперации,
	|	макПериодКоэффициентПрибора.Услуга,
	|	энргКоэффциентыПриборовУчета.Период,
	|	макПериодКоэффициентПрибора.МаксимальноВозможныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	максРегистраторКоэффициентПрибора.Абонент,
	|	максРегистраторКоэффициентПрибора.ЗаводскойНомерПУ,
	|	максРегистраторКоэффициентПрибора.Район,
	|	максРегистраторКоэффициентПрибора.ТочкаУчета,
	|	максРегистраторКоэффициентПрибора.ПриборУчета,
	|	максРегистраторКоэффициентПрибора.ДатаОперации,
	|	максРегистраторКоэффициентПрибора.Услуга,
	|	энргКоэффциентыПриборовУчета.Коэффицент КАК КоэффициентПУ,
	|	максРегистраторКоэффициентПрибора.МаксимальноВозможныеПоказания
	|ПОМЕСТИТЬ КоэффициентыПрибров
	|ИЗ
	|	максРегистраторКоэффициентПрибора КАК максРегистраторКоэффициентПрибора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКоэффциентыПриборовУчета КАК энргКоэффциентыПриборовУчета
	|		ПО максРегистраторКоэффициентПрибора.ПриборУчета = энргКоэффциентыПриборовУчета.ПриборУчета
	|			И максРегистраторКоэффициентПрибора.Период = энргКоэффциентыПриборовУчета.Период
	|			И максРегистраторКоэффициентПрибора.Регистратор = энргКоэффциентыПриборовУчета.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияАбонентов.Абонент,
	|	энргСреднийОбъемПотребленияАбонентов.Услуга КАК Услуга,
	|	энргСреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияАбонентов.Объем,
	|	энргСреднийОбъемПотребленияАбонентов.Объем3
	|ПОМЕСТИТЬ СредниеПоказателиПотребления
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК энргСреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	энргСреднийОбъемПотребленияАбонентов.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребленияАбонентов.Район = &Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.Услуга,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.МаксимальноеПотребления
	|ПОМЕСТИТЬ МаксимальныеПоказателиПотребления
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказателиПотребления.СрезПоследних(&Период, ) КАК энргМаксимальныеПоказателиПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоэффициентыПрибров.Абонент,
	|	КоэффициентыПрибров.ЗаводскойНомерПУ,
	|	КоэффициентыПрибров.Район,
	|	КоэффициентыПрибров.ТочкаУчета,
	|	КоэффициентыПрибров.ПриборУчета,
	|	КоэффициентыПрибров.ДатаОперации,
	|	КоэффициентыПрибров.Услуга,
	|	КоэффициентыПрибров.КоэффициентПУ,
	|	КоэффициентыПрибров.МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(МаксимальныеПоказателиПотребления.МаксимальноеПотребления, 0) КАК МаксимальноВозможныйОбъемПотребления,
	|	ЕСТЬNULL(СредниеПоказателиПотребления.Объем, 0) КАК СреднийОбъемПотребления
	|ПОМЕСТИТЬ ДанныеПриборовУчета
	|ИЗ
	|	КоэффициентыПрибров КАК КоэффициентыПрибров
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказателиПотребления КАК МаксимальныеПоказателиПотребления
	|		ПО КоэффициентыПрибров.Услуга = МаксимальныеПоказателиПотребления.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ СредниеПоказателиПотребления КАК СредниеПоказателиПотребления
	|		ПО КоэффициентыПрибров.Абонент = СредниеПоказателиПотребления.Абонент
	|			И КоэффициентыПрибров.Услуга = СредниеПоказателиПотребления.Услуга
	|			И КоэффициентыПрибров.ТочкаУчета = СредниеПоказателиПотребления.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПриборовУчета.Район,
	|	ДанныеПриборовУчета.Абонент,
	|	НайденныеАбоненты.ЛС КАК ЛицевойСчет,
	|	НайденныеАбоненты.ФИО КАК ФИОПлательщика,
	|	ДанныеПриборовУчета.ДатаОперации,
	|	ДанныеПриборовУчета.ТочкаУчета,
	|	ДанныеПриборовУчета.Услуга,
	|	ДанныеПриборовУчета.ПриборУчета,
	|	НайденныеАбоненты.ТекущиеПоказания,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК СостояниеПрибораУчета,
	|	ДанныеПриборовУчета.КоэффициентПУ,
	|	ДанныеПриборовУчета.МаксимальноВозможныеПоказания,
	|	ДанныеПриборовУчета.МаксимальноВозможныйОбъемПотребления КАК МаксимальноВозможныйОбъемПотребления,
	|	ДанныеПриборовУчета.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|  %%СтрокаСумма%% КАК СуммаОплаты
	|ИЗ
	|	НайденныеАбоненты КАК НайденныеАбоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПриборовУчета КАК ДанныеПриборовУчета
	|		ПО НайденныеАбоненты.АбонентСсылка = ДанныеПриборовУчета.Абонент
	|			И НайденныеАбоненты.ДатаОперации = ДанныеПриборовУчета.ДатаОперации
	|			И НайденныеАбоненты.НомерПУ = ДанныеПриборовУчета.ЗаводскойНомерПУ";
	
	
	ТекстВыбораУслуги  ="Выбор ";
	Для Каждого стр из СоотвествиеКолонок цикл
		  ТекстВыбораУслуги = ТекстВыбораУслуги + Символы.ПС+" когда ДанныеПриборовУчета.Услуга = Значение(Справочник.энргВидыУслуг." + стр.Значение + ")" + Символы.ПС + "тогда НайденныеАбоненты." + стр.Ключ;  
	КонецЦикла;
	ТекстВыбораУслуги 	= ТекстВыбораУслуги +Символы.ПС +" конец";
	Текст 				= СтрЗаменить(Текст," %%СтрокаСумма%%",ТекстВыбораУслуги);
	Запрос.Текст 		= Текст;	   
	
	Запрос.Текст 		= Текст;
	Результат  			= Запрос.Выполнить();
	Выборка  			= Результат.Выбрать();	 
	
	Возврат Выборка; 		   
	
КонецФункции

Функция ПроверитьПоказанияПоВсемЗонамСуток(Объект) Экспорт 
	Ответ 							= Новый Структура("Успешно, ТекстОшибки", Истина, "");
	Массив							= Новый Массив;
	ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета 	= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	
	Если НЕ ИспользоватьТарифныеЗоны и НЕ ИспользоватьШкалыПриборовУчета Тогда 
		Возврат Ответ;	
	КонецЕсли;
	
	
	Для Каждого ТекСтрока Из Объект.ТочкиУчета Цикл 
		ИтоговаяСтрока 	= "";
		МассивШкал 		= Объект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки));
		ОшибкиВШкалах 	= Новый Массив;
		Для Каждого ТекШкала Из МассивШкал Цикл
			МассивПоказаний 			= Объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", ТекШкала.IDСтроки));
			ПоказанияНеУказаны 			= Новый Массив;
			ВсегоСтрок 					= МассивПоказаний.Количество();
			КолвоУказанныхПоказаний		= 0;
			Для Каждого ТекСтрокаПоказаний Из МассивПоказаний Цикл
				Если ТекСтрокаПоказаний.ПоказанияПредоставлены Тогда
					КолвоУказанныхПоказаний = КолвоУказанныхПоказаний + 1;
				Иначе 
					ПоказанияНеУказаны.Добавить(ТекСтрокаПоказаний.ТарифнаяЗона);
				КонецЕсли;				
			КонецЦикла;
			
			Если КолвоУказанныхПоказаний > 0 И ВсегоСтрок <> КолвоУказанныхПоказаний Тогда	
				Если ИспользоватьШкалыПриборовУчета Тогда
					ИтоговаяСтрока = ИтоговаяСтрока + " в шкале: " + ТекШкала.Шкала;
				КонецЕсли;
				
				Если ИспользоватьТарифныеЗоны Тогда
					ИтоговаяСтрока = ИтоговаяСтрока + " не указаны показания по тарифным зонам: " + СтрСоединить(ПоказанияНеУказаны, ",");
				Иначе 
					ИтоговаяСтрока = ИтоговаяСтрока + " не указаны показания";
				КонецЕсли;
				
				ОшибкиВШкалах.Добавить(ИтоговаяСтрока);               				
			КонецЕсли;	
			
		КонецЦикла;
		
		Если ОшибкиВШкалах.Количество() > 0 Тогда	
			Массив.Добавить("У прибора учета: " + ТекСтрока.ПриборУчета + СтрСоединить(ОшибкиВШкалах, ","));
		КонецЕсли;		
		
	КонецЦикла; 
	
	Если Массив.Количество() > 0 Тогда
		Ответ.Успешно 		= Ложь;	
		Ответ.ТекстОшибки 	= СтрСоединить(Массив, ". ");	
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ЕстьПринятыеПоказанияДатойПозже(МассивПУ, ПараметрыПроверки) Экспорт 
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивПУ, Справочники.энргПриборыУчетаАбонента.ПустаяСсылка());
	Если НЕ ЗначениеЗаполнено(МассивПУ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|ГДЕ
	|	энргПоказанияПриборовУчета.Организация = &Организация
	|	И энргПоказанияПриборовУчета.Район = &Район
	|	И энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения
	|	И энргПоказанияПриборовУчета.ПриборУчета В(&МассивПУ)
	|	И энргПоказанияПриборовУчета.Период >= &Дата
	|	И энргПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|	И НЕ энргПоказанияПриборовУчета.Регистратор = &ТекРегистратор";
	
	Запрос.УстановитьПараметр("Организация"		, ПараметрыПроверки.Организация);
	Запрос.УстановитьПараметр("Район"			, ПараметрыПроверки.Район);
	Запрос.УстановитьПараметр("КлючПомещения"	, ПараметрыПроверки.КлючПомещения); 
	Запрос.УстановитьПараметр("Дата"			, ПараметрыПроверки.Дата); 
	Запрос.УстановитьПараметр("ТекРегистратор"	, ПараметрыПроверки.Ссылка);
	Запрос.УстановитьПараметр("МассивПУ"		, МассивПУ);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();  
	
КонецФункции

#КонецОбласти 

#Область СервисПроверкиПоказанийПриборовУчета

Функция ПриборыДляОтклоненияПоказаний(Период, Организация, ТаблицаПриборов, ВспомогательныеПараметры) Экспорт
	ТекстСНеДопуском = РегистрыСведений.энргСостояниеДопускаВПомещение.ТекстЗапросаПриборыБезДопускаПодрядБольшеОпределенногоЧисла("ТаблицаДанных");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Район КАК Район,
		|	ТаблицаДанных.КлючПомещения КАК КлючПомещения,
		|	ТаблицаДанных.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаДанных.ПриборУчета КАК ПриборУчета,
		|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДанных.IDСтроки КАК IDСтроки
		|ПОМЕСТИТЬ ТаблицаДанныхНачало
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	&Организация КАК Организация,
		|	ТаблицаДанныхНачало.Район КАК Район,
		|	ТаблицаДанныхНачало.КлючПомещения КАК КлючПомещения,
		|	ТаблицаДанныхНачало.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаДанныхНачало.ПриборУчета КАК ПриборУчета,
		|	энргКлючиПомещений.Строение КАК Строение,
		|	энргКлючиПомещений.Помещение КАК Помещение,
		|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
		|	ТаблицаДанныхНачало.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДанныхНачало.IDСтроки КАК IDСтроки
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	ТаблицаДанныхНачало КАК ТаблицаДанныхНачало
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО ТаблицаДанныхНачало.КлючПомещения = энргКлючиПомещений.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргАбонентыПомещенийСрезПоследних.Абонент КАК Абонент,
		|	энргАбонентыПомещенийСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАбонентыПомещенийСрезПоследних.Район КАК Район
		|ПОМЕСТИТЬ ТаблицаАбоненты
		|ИЗ
		|	РегистрСведений.энргАбонентыПомещений.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И (КлючПомещения, Район) В
		|					(ВЫБРАТЬ
		|						ТаблицаДанных.КлючПомещения,
		|						ТаблицаДанных.Район
		|					ИЗ
		|						ТаблицаДанных КАК ТаблицаДанных)) КАК энргАбонентыПомещенийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.Район КАК Район,
		|	ТаблицаДанных.КлючПомещения КАК КлючПомещения,
		|	ТаблицаДанных.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаДанных.ПриборУчета КАК ПриборУчета,
		|	ТаблицаДанных.Строение КАК Строение,
		|	ТаблицаДанных.Помещение КАК Помещение,
		|	ТаблицаДанных.ЧастныйСектор КАК ЧастныйСектор,
		|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДанных.IDСтроки КАК IDСтроки,
		|	ЕСТЬNULL(ТаблицаАбоненты.Абонент, ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)) КАК Абонент
		|ПОМЕСТИТЬ ТаблицаДанныхСАбонентом
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаАбоненты КАК ТаблицаАбоненты
		|		ПО ТаблицаДанных.КлючПомещения = ТаблицаАбоненты.КлючПомещения
		|			И (ТаблицаАбоненты.Район = ТаблицаДанных.Район)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос1.Организация КАК Организация,
		|	ВложенныйЗапрос1.Район КАК Район,
		|	ВложенныйЗапрос1.ЧастныйСектор КАК ЧастныйСектор,
		|	ВложенныйЗапрос1.Строение КАК Строение,
		|	ВложенныйЗапрос1.Помещение КАК Помещение,
		|	ВложенныйЗапрос1.Абонент КАК Абонент,
		|	энргРегистрацияВременногоОтсутствия.ПериодС КАК ПериодС,
		|	энргРегистрацияВременногоОтсутствия.ПериодПо КАК ПериодПо,
		|	ВложенныйЗапрос1.ГраницаПериода КАК ГраницаПериода
		|ПОМЕСТИТЬ ПолноеОтсутствиеАбонентаВРасчетномПериоде
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Район КАК Район,
		|		ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
		|		ВложенныйЗапрос.Строение КАК Строение,
		|		ВложенныйЗапрос.Помещение КАК Помещение,
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
		|		ВложенныйЗапрос.ГраницаПериода КАК ГраницаПериода,
		|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
		|		ВложенныйЗапрос.Абонент КАК Абонент,
		|		ВложенныйЗапрос.Дата КАК Дата,
		|		МАКСИМУМ(энргРегистрацияВременногоОтсутствия.Ссылка) КАК Ссылка
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ТаблицаДанных.Район КАК Район,
		|			ТаблицаДанных.ЧастныйСектор КАК ЧастныйСектор,
		|			ТаблицаДанных.Строение КАК Строение,
		|			ТаблицаДанных.Помещение КАК Помещение,
		|			&Организация КАК Организация,
		|			&ПериодНачисления КАК ПериодНачисления,
		|			&ГраницаПериода КАК ГраницаПериода,
		|			ТаблицаДанных.КлючПомещения КАК КлючПомещения,
		|			ТаблицаДанных.Абонент КАК Абонент,
		|			МАКСИМУМ(энргРегистрацияВременногоОтсутствия.Дата) КАК Дата
		|		ИЗ
		|			ТаблицаДанныхСАбонентом КАК ТаблицаДанных
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияВременногоОтсутствия КАК энргРегистрацияВременногоОтсутствия
		|				ПО ТаблицаДанных.Район = энргРегистрацияВременногоОтсутствия.Район
		|					И ТаблицаДанных.КлючПомещения = энргРегистрацияВременногоОтсутствия.КлючПомещения
		|					И ТаблицаДанных.Абонент = энргРегистрацияВременногоОтсутствия.Абонент
		|					И (энргРегистрацияВременногоОтсутствия.Проведен)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТаблицаДанных.Район,
		|			ТаблицаДанных.ЧастныйСектор,
		|			ТаблицаДанных.Строение,
		|			ТаблицаДанных.КлючПомещения,
		|			ТаблицаДанных.Помещение,
		|			ТаблицаДанных.Абонент) КАК ВложенныйЗапрос
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияВременногоОтсутствия КАК энргРегистрацияВременногоОтсутствия
		|			ПО ВложенныйЗапрос.Район = энргРегистрацияВременногоОтсутствия.Район
		|				И ВложенныйЗапрос.КлючПомещения = энргРегистрацияВременногоОтсутствия.КлючПомещения
		|				И ВложенныйЗапрос.Абонент = энргРегистрацияВременногоОтсутствия.Абонент
		|				И (энргРегистрацияВременногоОтсутствия.Проведен)
		|				И ВложенныйЗапрос.Дата = энргРегистрацияВременногоОтсутствия.Дата
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Дата,
		|		ВложенныйЗапрос.ЧастныйСектор,
		|		ВложенныйЗапрос.Организация,
		|		ВложенныйЗапрос.ПериодНачисления,
		|		ВложенныйЗапрос.ГраницаПериода,
		|		ВложенныйЗапрос.Строение,
		|		ВложенныйЗапрос.Помещение,
		|		ВложенныйЗапрос.КлючПомещения,
		|		ВложенныйЗапрос.Абонент,
		|		ВложенныйЗапрос.Район) КАК ВложенныйЗапрос1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияВременногоОтсутствия КАК энргРегистрацияВременногоОтсутствия
		|		ПО ВложенныйЗапрос1.Ссылка = энргРегистрацияВременногоОтсутствия.Ссылка
		|			И (ВложенныйЗапрос1.ГраницаПериода <= КОНЕЦПЕРИОДА(энргРегистрацияВременногоОтсутствия.ПериодПо, ДЕНЬ))
		|;
		| " + ТекстСНеДопуском + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.УПрибораУчетаИстекМПИ) КАК ПричинаОтклонения,
		|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДанных.IDСтроки КАК IDСтроки,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ПриборыДляОтклоненияПоказаний
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПриборыУчетаСИстекшимСрокомПоверки.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И (Район, КлючПомещения, ПриборУчета) В
		|						(ВЫБРАТЬ
		|							ТаблицаДанных.Район КАК Район,
		|							ТаблицаДанных.КлючПомещения КАК КлючПомещения,
		|							ТаблицаДанных.ПриборУчета КАК ПриборУчета
		|						ИЗ
		|							ТаблицаДанных КАК ТаблицаДанных)) КАК энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних
		|		ПО (энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.Организация = &Организация)
		|			И ТаблицаДанных.Район = энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.Район
		|			И ТаблицаДанных.КлючПомещения = энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.КлючПомещения
		|			И ТаблицаДанных.ПриборУчета = энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.ПриборУчета
		|ГДЕ
		|	энргПриборыУчетаСИстекшимСрокомПоверкиСрезПоследних.ПоверкаВыполнена = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДанных.ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ОРП),
		|	ТаблицаДанных.НомерСтроки,
		|	ТаблицаДанных.IDСтроки,
		|	2
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И (Район, КлючПомещения, ТочкаУчета) В
		|						(ВЫБРАТЬ
		|							ТаблицаДанных.Район КАК Район,
		|							ТаблицаДанных.КлючПомещения КАК КлючПомещения,
		|							ТаблицаДанных.ТочкаУчета КАК ТочкаУчета
		|						ИЗ
		|							ТаблицаДанных КАК ТаблицаДанных)) КАК энргАктивностьТочекУчетаСрезПоследних
		|		ПО (энргАктивностьТочекУчетаСрезПоследних.Организация = &Организация)
		|			И ТаблицаДанных.Район = энргАктивностьТочекУчетаСрезПоследних.Район
		|			И ТаблицаДанных.КлючПомещения = энргАктивностьТочекУчетаСрезПоследних.КлючПомещения
		|			И ТаблицаДанных.ТочкаУчета = энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП)
		|	И (&ПроверятьОРП)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДанных.ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.АбонентОтсутствует),
		|	ТаблицаДанных.НомерСтроки,
		|	ТаблицаДанных.IDСтроки,
		|	3
		|ИЗ
		|	ПолноеОтсутствиеАбонентаВРасчетномПериоде КАК ПолноеОтсутствиеАбонентаВРасчетномПериоде
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхСАбонентом КАК ТаблицаДанных
		|		ПО ПолноеОтсутствиеАбонентаВРасчетномПериоде.Район = ТаблицаДанных.Район
		|			И ПолноеОтсутствиеАбонентаВРасчетномПериоде.ЧастныйСектор = ТаблицаДанных.ЧастныйСектор
		|			И ПолноеОтсутствиеАбонентаВРасчетномПериоде.Строение = ТаблицаДанных.Строение
		|			И ПолноеОтсутствиеАбонентаВРасчетномПериоде.Помещение = ТаблицаДанных.Помещение
		|			И ПолноеОтсутствиеАбонентаВРасчетномПериоде.Абонент = ТаблицаДанных.Абонент
		|ГДЕ
		|	ПолноеОтсутствиеАбонентаВРасчетномПериоде.ГраницаПериода >= ПолноеОтсутствиеАбонентаВРасчетномПериоде.ПериодС
		|	И ПолноеОтсутствиеАбонентаВРасчетномПериоде.ГраницаПериода <= ПолноеОтсутствиеАбонентаВРасчетномПериоде.ПериодПо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДанных.ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ЗапретПриемаВПУ),
		|	ТаблицаДанных.НомерСтроки,
		|	ТаблицаДанных.IDСтроки,
		|	4
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|		ПО ТаблицаДанных.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
		|			И (НЕ энргПриборыУчетаАбонента.СистемаУчетаЭлектроэнергии = ЗНАЧЕНИЕ(Справочник.энргСистемыУчетаЭлектроэнергии.ПустаяСсылка))
		|			И (&ПроверятьЗапретПриемаВПУ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриборыСНЕДопуском.ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.АктНедопуска),
		|	ТаблицаДанных.НомерСтроки,
		|	ТаблицаДанных.IDСтроки,
		|	5
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриборыСНЕДопуском КАК ПриборыСНЕДопуском
		|		ПО (ТаблицаДанных.Организация = ПриборыСНЕДопуском.Организация)
		|			И ТаблицаДанных.Район = ПриборыСНЕДопуском.Район
		|			И ТаблицаДанных.КлючПомещения = ПриборыСНЕДопуском.КлючПомещения
		|			И ТаблицаДанных.ПриборУчета = ПриборыСНЕДопуском.ПриборУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДанных.ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПоказанияПредоставленыНеВСрок),
		|	ТаблицаДанных.НомерСтроки,
		|	ТаблицаДанных.IDСтроки,
		|	6
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|ГДЕ
		|	&ПоказанияНеВСрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриборыДляОтклоненияПоказаний.ПриборУчета КАК ПриборУчета,
		|	ПриборыДляОтклоненияПоказаний.ПричинаОтклонения КАК ПричинаОтклонения,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены) КАК СостояниеПоказаний,
		|	ПриборыДляОтклоненияПоказаний.НомерСтроки КАК НомерСтроки,
		|	ПриборыДляОтклоненияПоказаний.IDСтроки КАК IDСтроки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПриборыДляОтклоненияПоказаний.ПриборУчета КАК ПриборУчета,
		|		ПриборыДляОтклоненияПоказаний.НомерСтроки КАК НомерСтроки,
		|		ПриборыДляОтклоненияПоказаний.IDСтроки КАК IDСтроки,
		|		МИНИМУМ(ПриборыДляОтклоненияПоказаний.Приоритет) КАК Приоритет
		|	ИЗ
		|		ПриборыДляОтклоненияПоказаний КАК ПриборыДляОтклоненияПоказаний
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПриборыДляОтклоненияПоказаний.ПриборУчета,
		|		ПриборыДляОтклоненияПоказаний.НомерСтроки,
		|		ПриборыДляОтклоненияПоказаний.IDСтроки) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриборыДляОтклоненияПоказаний КАК ПриборыДляОтклоненияПоказаний
		|		ПО ВложенныйЗапрос.Приоритет = ПриборыДляОтклоненияПоказаний.Приоритет
		|			И ВложенныйЗапрос.ПриборУчета = ПриборыДляОтклоненияПоказаний.ПриборУчета
		|			И ВложенныйЗапрос.НомерСтроки = ПриборыДляОтклоненияПоказаний.НомерСтроки
		|			И ВложенныйЗапрос.IDСтроки = ПриборыДляОтклоненияПоказаний.IDСтроки";
	
	ЭтоЗагрузкаПоказанийИзВнешнийИсточников = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ВспомогательныеПараметры, 
		"ЭтоЗагрузкаПоказанийИзВнешнийИсточников", 
		Ложь);
	ПроверятьЗапретПриемаВПУ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ВспомогательныеПараметры,
		"ПроверятьЗапретПриемаВПУ",
		Истина);
	ПроверятьОРП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ВспомогательныеПараметры,
		"ПроверятьОРП",
		Истина);
		
	Если НЕ ЭтоЗагрузкаПоказанийИзВнешнийИсточников Тогда 
		ТаблицаПриборов.Колонки.Добавить("НомерСтроки"	, ОбщегоНазначения.ОписаниеТипаЧисло(10));
		ТаблицаПриборов.Колонки.Добавить("IDСтроки"		, ОбщегоНазначения.ОписаниеТипаСтрока(36));
	КонецЕсли; 	
	
	Запрос.УстановитьПараметр("Период"					, Период);
	Запрос.УстановитьПараметр("Организация"				, Организация);
	Запрос.УстановитьПараметр("ТаблицаДанных"			, ТаблицаПриборов);
	Запрос.УстановитьПараметр("ПоказанияНеВСрок"		, НЕ ВспомогательныеПараметры.ПоказанияВСрок);	
	Запрос.УстановитьПараметр("ПериодНачисления"		, ВспомогательныеПараметры.ПериодНачисления);	
	Запрос.УстановитьПараметр("ГраницаПериода"			, Период.Значение);
	Запрос.УстановитьПараметр("ПроверятьЗапретПриемаВПУ", ПроверятьЗапретПриемаВПУ);
	Запрос.УстановитьПараметр("ПроверятьОРП"			, ПроверятьОРП);
	Запрос.УстановитьПараметр("КолвоНедопусковПодряд"	, энргРаботаСКонстантами.ЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний());
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ФормаОбъекта, РезультатЗапроса, ОчищатьТаблицуПриборов = Истина) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаОбъекта, "ПриборыДляОтклоненияПоказаний") Тогда 
		Возврат;
	КонецЕсли;
	
	ПриборыДляОтклоненияПоказаний = ФормаОбъекта.ПриборыДляОтклоненияПоказаний;
	Если ОчищатьТаблицуПриборов Тогда 
		ПриборыДляОтклоненияПоказаний.Очистить();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		НСтрока = ПриборыДляОтклоненияПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры


Функция ПоказанияПредоставляютсяВСрок(ПериодНачисления, ПериодРегистрации, Организация, Район) Экспорт
	ПериодРегистрации		= ?(ПериодРегистрации = Дата(1, 1, 1), ТекущаяДата(), ПериодРегистрации);
	
	СтруктураСреза  		= РегистрыСведений.энргПериодыПриемаПоказаний.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Организация", Организация));
	ПоказанияС				= ?(Не ЗначениеЗаполнено(СтруктураСреза.ДатаС), 1, СтруктураСреза.ДатаС);
	ПоказанияПО 			= ?(Не ЗначениеЗаполнено(СтруктураСреза.ДатаПо), 31, СтруктураСреза.ДатаПо);
	
	ГраницыПериода  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);	
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;
	
	ВСрок 					= ПериодРегистрации >= НачалоПериодаРасчета И День(ПериодРегистрации) >= ПоказанияС И День(ПериодРегистрации) <= ПоказанияПО;
	Возврат ВСрок;
КонецФункции


Функция НоваяТаблицаПриборовДляПроверки() Экспорт 
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Район"			, Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	Результат.Колонки.Добавить("КлючПомещения"	, Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	Результат.Колонки.Добавить("ТочкаУчета"		, Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	Результат.Колонки.Добавить("ПриборУчета"	, Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	
	Возврат Результат;
	
КонецФункции 

Функция НовыеВспомогательныеПараметрыПроверкиОтклоненияПоказаний() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПоказанияВСрок"			, Ложь);
	Результат.Вставить("ПериодНачисления"		, Дата(1,1,1));
	Результат.Вставить("ЭтоЗагрузкаПоказанийИзВнешнийИсточников", Ложь);
	Результат.Вставить("ПроверятьЗапретПриемаВПУ", Истина);
	Результат.Вставить("ПроверятьОРП", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыОтветаОпределитьСостояниеПоказанийПоСтроке() Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("СостояниеИзменено"		, Ложь);
	Результат.Вставить("СостояниеПоказаний"		, Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	Результат.Вставить("ПричинаОтклонения"		, Перечисления.энргПричиныОтклоненияПоказаний.ПустаяСсылка());
	Результат.Вставить("ПоказанияПредоставлены"	, Ложь);
	Результат.Вставить("Разница"				, 0);
	Результат.Вставить("Сумма"					, 0);
	
	Возврат Результат;
	
КонецФункции

Функция ПричиныОтклоненияИсключая() Экспорт 
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.энргПричиныОтклоненияПоказаний.ЗапретПриемаВПУ);
	Результат.Добавить(Перечисления.энргПричиныОтклоненияПоказаний.АктНедопуска);
	Результат.Добавить(Перечисления.энргПричиныОтклоненияПоказаний.ПоказанияПредоставленыНеВСрок);
	Результат.Добавить(Перечисления.энргПричиныОтклоненияПоказаний.АбонентОтсутствует);
	Результат.Добавить(Перечисления.энргПричиныОтклоненияПоказаний.ОРП);
	
	Возврат Результат;
	
КонецФункции

Функция РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Организация, Район, тзТаблицаПоказаний, МоментВремени, тзПриборыДляОтклоненияПоказаний, КонтрольныйСъем = Ложь) Экспорт 
		
	мРайоны 						= ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзТаблицаПоказаний.ВыгрузитьКолонку("Район"));
	мКлючиПомещений 				= ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзТаблицаПоказаний.ВыгрузитьКолонку("КлючПомещения"));
	
	МВТ  							= Новый МенеджерВременныхТаблиц;
	
	Параметры  						= Новый Структура; 	
	ПараметрыВТ						= Новый Массив;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("Организация","Организация")));
	КонецЕсли;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("ПериодНачисления","ПериодНачисления")));
	
	Если мРайоны.Количество() = 1 Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("Район","мРайоны")));
	ИначеЕсли мРайоны.Количество() > 1 Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраВСписке", 	Новый Структура("Район","мРайоны")));
	КонецЕсли; 
	
	Если мКлючиПомещений.Количество() = 1 Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", 	Новый Структура("КлючПомещения","мКлючПомещений")));
	Иначе
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраВСписке", 	Новый Структура("КлючПомещения","мКлючПомещений")));
	КонецЕсли;
		
	Параметры.Вставить("ПараметрыВТ", 			ПараметрыВТ);
	
	Если ЗначениеЗаполнено(МоментВремени) Тогда
		Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра","Период"));
	КонецЕсли;	
	
	Параметры.Вставить("ВыбиратьРазрешенные", 	Ложь);
	Схема  							= Неопределено;
	РегистрыСведений.энргМаксимальныеПоказателиПотребления.МаксимальныеПоказателиПотребления(Схема,Параметры,"МаксимальныеПоказателиПотребления");
	РегистрыСведений.энргКоэффциентыПриборовУчета.КоэффциентыПриборовУчета(Схема,Параметры,"КоэффциентыПриборовУчета");
	РегистрыСведений.энргСреднийОбъемПотребленияАбонентов.СреднийОбъемПотребленияАбонентов(Схема,Параметры,"СреднийОбъемПотребленияАбонентов");
	РегистрыСведений.энргМаксимальныеПоказания.МаксимальныеПоказанияСрез(Схема,Параметры,"МаксимальныеПоказанияСрез");
	энргРаботаСТочкамиУчетаСервер.ЗначенияТарифовУслугАбонентовВоВременную(МВТ, Схема, Параметры, Организация, МоментВремени, мРайоны, мКлючиПомещений);
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ТекущиеДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанныеДокумента.Организация КАК Организация,
	|	ТекущиеДанныеДокумента.Район КАК Район,
	|	ТекущиеДанныеДокумента.КлючПомещения КАК КлючПомещения,
	|	ТекущиеДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ТекущиеДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанныеДокумента.Шкала КАК Шкала,
	|	ТекущиеДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанныеДокумента.Услуга КАК Услуга,
	|	ТекущиеДанныеДокумента.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	ТекущиеДанныеДокумента.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанныеДокумента.Переворот КАК Переворот,
	|	ТекущиеДанныеДокумента.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанныеДокумента.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТекущиеДанныеДокумента.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанныеДокумента"); 
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ТаблицаПриборыДляОтклоненияПоказаний.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПриборыДляОтклоненияПоказаний.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТаблицаПриборыДляОтклоненияПоказаний.ПричинаОтклонения КАК ПричинаОтклонения
	|ПОМЕСТИТЬ ПриборыДляОтклоненияПоказаний
	|ИЗ
	|	&ПриборыДляОтклоненияПоказаний КАК ТаблицаПриборыДляОтклоненияПоказаний"); 
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ТекущиеДанные.Организация КАК Организация,
	|	ТекущиеДанные.Район КАК Район,
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ТекущиеДанные.КлючПомещения КАК КлючПомещения,
	|	ТекущиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанные.Шкала КАК Шкала,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.Переворот КАК ТекущийПереворот,
	|	ТекущиеДанные.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ТекущиеДанные.СостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ЕСТЬNULL(КоэффциентыПриборовУчета.Коэффициент, 1) КАК Коэффициент,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможные,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	ЕСТЬNULL(МаксимальныеПоказателиПотребления.МаксимальноеПотребления, 0) КАК МаксимальныйОбъемПотребления,
	|	ЕСТЬNULL(МаксимальныеПоказателиПотребления.ПовышающийКоэффициент, 1) КАК ПовышающийКоэффициентМаксимальноеПотребления,
	|	ЕСТЬNULL(ТаблицаЗначенийТарифовТочекУчета.ЗначениеТарифа, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ТаблицаЗначенийТарифовТочекУчета.ПредставлениеЗначениеТарифа, """") КАК ПредставлениеЗначениеТарифа
	|ПОМЕСТИТЬ ДанныеДокументаСПоказаниями
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффциентыПриборовУчета КАК КоэффциентыПриборовУчета
	|		ПО ТекущиеДанные.КлючПомещения = КоэффциентыПриборовУчета.КлючПомещения И ТекущиеДанные.КлючПомещения = КоэффциентыПриборовУчета.КлючПомещения
	|			И ТекущиеДанные.ПриборУчета = КоэффциентыПриборовУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ТекущиеДанные.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказателиПотребления КАК МаксимальныеПоказателиПотребления
	|		ПО ТекущиеДанные.Услуга = МаксимальныеПоказателиПотребления.Услуга
	|			И ТекущиеДанные.ТарифнаяЗона = МаксимальныеПоказателиПотребления.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийТарифовТочекУчета КАК ТаблицаЗначенийТарифовТочекУчета
	|		ПО ТекущиеДанные.КлючПомещения = ТаблицаЗначенийТарифовТочекУчета.КлючПомещения
	|			И ТекущиеДанные.ТочкаУчета = ТаблицаЗначенийТарифовТочекУчета.ТочкаУчета
	|			И ТекущиеДанные.ТарифнаяЗона = ТаблицаЗначенийТарифовТочекУчета.ТарифнаяЗона");
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ПоследниеПоказания КАК ПоследниеПоказания,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	ВложенныйЗапрос.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	(ВложенныйЗапрос.ТекущиеПоказания - ВложенныйЗапрос.ПоследниеПоказания) * ВложенныйЗапрос.Коэффициент КАК Расход,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ТекущиеПоказания < ВложенныйЗапрос.ПоследниеПоказания
	|			ТОГДА (ВложенныйЗапрос.ПоследниеПоказания - ВложенныйЗапрос.ТекущиеПоказания) * ВложенныйЗапрос.Коэффициент
	|		ИНАЧЕ (ВложенныйЗапрос.ТекущиеПоказания - ВложенныйЗапрос.ПоследниеПоказания) * ВложенныйЗапрос.Коэффициент
	|	КОНЕЦ КАК РасходПоМодулю,
	|	(ВложенныйЗапрос.МаксимальноВозможные - ВложенныйЗапрос.ПоследниеПоказания + ВложенныйЗапрос.ТекущиеПоказания) * ВложенныйЗапрос.Коэффициент КАК РасходСПереворотом,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СреднийОбъемПотребления > ВложенныйЗапрос.МаксимальныйОбъемПотребления
	|				И ВложенныйЗапрос.СреднийОбъемПотребления > 0
	|			ТОГДА ВложенныйЗапрос.СреднийОбъемПотребления
	|		ИНАЧЕ ВложенныйЗапрос.МаксимальныйОбъемПотребления
	|	КОНЕЦ * ВложенныйЗапрос.ПовышающийКоэффициентМаксимальноеПотребления * ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК МаксимальныйРасходЗаПериод,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВложенныйЗапрос.ДатаПоследнихПоказаний, &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК РазностьМесяцев,
	|	ВложенныйЗапрос.Коэффициент КАК КоэффициентПУ,
	|	ВложенныйЗапрос.ТекущийПереворот КАК ТекущийПереворот,
	|	ВложенныйЗапрос.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	ВложенныйЗапрос.ТекущиеСостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ВложенныйЗапрос.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	ВложенныйЗапрос.МаксимальноВозможные КАК МаксимальноВозможныеПоказания,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВложенныйЗапрос.ПриборДляОтклоненияПоказаний КАК ПриборДляОтклоненияПоказаний,
	|	ВложенныйЗапрос.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ВложенныйЗапрос.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа
	|ПОМЕСТИТЬ ДанныеДляАнализа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокументаСПоказаниями.Организация КАК Организация,
	|		ДанныеДокументаСПоказаниями.Район КАК Район,
	|		ДанныеДокументаСПоказаниями.КлючПомещения КАК КлючПомещения,
	|		ДанныеДокументаСПоказаниями.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеДокументаСПоказаниями.Шкала КАК Шкала,
	|		ДанныеДокументаСПоказаниями.НомерСтроки КАК НомерСтроки,
	|		ДанныеДокументаСПоказаниями.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ДанныеДокументаСПоказаниями.Коэффициент КАК Коэффициент,
	|		ДанныеДокументаСПоказаниями.ТекущийПереворот КАК ТекущийПереворот,
	|		ДанныеДокументаСПоказаниями.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|		ДанныеДокументаСПоказаниями.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ДанныеДокументаСПоказаниями.ТекущиеСостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|		ДанныеДокументаСПоказаниями.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|		ДанныеДокументаСПоказаниями.МаксимальноВозможные КАК МаксимальноВозможные,
	|		ДанныеДокументаСПоказаниями.МаксимальныйОбъемПотребления КАК МаксимальныйОбъемПотребления,
	|		ДанныеДокументаСПоказаниями.ПовышающийКоэффициентМаксимальноеПотребления КАК ПовышающийКоэффициентМаксимальноеПотребления,
	|		ДанныеДокументаСПоказаниями.РегистрируетОбъем КАК РегистрируетОбъем,
	|		ДанныеДокументаСПоказаниями.ЗначениеТарифа КАК ЗначениеТарифа,
	|		ДанныеДокументаСПоказаниями.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа,
	|		ЕСТЬNULL(СреднийОбъемПотребленияАбонентов.Объем, 0) КАК СреднийОбъемПотребления,
	|		ЕСТЬNULL(МаксимальныеПоказанияСрез.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнихПоказаний,
	|		ЕСТЬNULL(МаксимальныеПоказанияСрез.Показание, 0) КАК ПоследниеПоказания,
	|		ВЫБОР КОГДА ПриборыДляОтклоненияПоказаний.ПриборУчета ЕСТЬ NULL ТОГДА ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) ИНАЧЕ ПриборыДляОтклоненияПоказаний.ПричинаОтклонения КОНЕЦ КАК ПричинаОтклонения,
	|		ВЫБОР КОГДА ПриборыДляОтклоненияПоказаний.ПриборУчета ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ПриборДляОтклоненияПоказаний
	|	ИЗ
	|		ДанныеДокументаСПоказаниями КАК ДанныеДокументаСПоказаниями
	|			ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|			ПО ДанныеДокументаСПоказаниями.КлючПомещения = МаксимальныеПоказанияСрез.КлючПомещения
	|				И ДанныеДокументаСПоказаниями.ПриборУчета = МаксимальныеПоказанияСрез.ПриборУчета
	|				И ДанныеДокументаСПоказаниями.Шкала = МаксимальныеПоказанияСрез.Шкала
	|				И ДанныеДокументаСПоказаниями.ТарифнаяЗона = МаксимальныеПоказанияСрез.ТарифнаяЗона
	|			ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъемПотребленияАбонентов КАК СреднийОбъемПотребленияАбонентов
	|			ПО ДанныеДокументаСПоказаниями.КлючПомещения = СреднийОбъемПотребленияАбонентов.КлючПомещения
	|				И ДанныеДокументаСПоказаниями.ТочкаУчета = СреднийОбъемПотребленияАбонентов.ТочкаУчета
	|				И ДанныеДокументаСПоказаниями.ТарифнаяЗона = СреднийОбъемПотребленияАбонентов.ТарифнаяЗона
	|				И ДанныеДокументаСПоказаниями.Шкала = СреднийОбъемПотребленияАбонентов.Шкала
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПриборыДляОтклоненияПоказаний КАК ПриборыДляОтклоненияПоказаний
	|			ПО ДанныеДокументаСПоказаниями.ПриборУчета = ПриборыДляОтклоненияПоказаний.ПриборУчета) КАК ВложенныйЗапрос");
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеДляАнализа.Организация КАК Организация,
	|	ДанныеДляАнализа.Район КАК Район,
	|	ДанныеДляАнализа.НомерСтроки КАК НомерСтроки,
	|	ДанныеДляАнализа.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляАнализа.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ДанныеДляАнализа.ТекущийПереворот
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|	КОНЕЦ КАК Переворот,
	|	ДанныеДляАнализа.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	ДанныеДляАнализа.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПереворотИзмененПользователем
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеДляАнализа.ТекущийПереворот
	|						ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|					ИНАЧЕ ДанныеДляАнализа.Расход
	|				КОНЕЦ
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|			ТОГДА 0
	|		КОГДА ДанныеДляАнализа.Расход >= 0
	|			ТОГДА ДанныеДляАнализа.Расход
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДанныеДляАнализа.РасходСПереворотом < ДанныеДляАнализа.МаксимальныйРасходЗаПериод
	|					ТОГДА ДанныеДляАнализа.РасходСПереворотом
	|				ИНАЧЕ -ДанныеДляАнализа.РасходПоМодулю
	|			КОНЕЦ
	|	КОНЕЦ КАК Разница,
	|	ЛОЖЬ КАК ПереворотИзмененПользователем,
	|	ЛОЖЬ КАК СтатусИзмененПользователем,
	|	ДанныеДляАнализа.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляАнализа.МаксимальныйРасходЗаПериод КАК МаксимальноВозможныйОбъемПотребления,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ПриборДляОтклоненияПоказаний
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены)
	|		ИНАЧЕ ДанныеДляАнализа.ТекущиеСостояниеПоказаний
	|	КОНЕЦ КАК СостояниеПоказаний,
	|	ДанныеДляАнализа.КоэффициентПУ КАК КоэффициентПУ,
	|	ВЫБОР
	|		КОГДА ДанныеДляАнализа.ТекущиеПоказания = 0
	|				И ДанныеДляАнализа.РегистрируетОбъем = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеДляАнализа.ПоследниеПоказания
	|	КОНЕЦ КАК ПредыдущиеПоказания,
	|	ДанныеДляАнализа.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ДанныеДляАнализа.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ДанныеДляАнализа.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа
	|ИЗ
	|	ДанныеДляАнализа КАК ДанныеДляАнализа");   
	
	ДатаОпределенияПериодаНачисления 	= ТекущаяДата();
	Если ТипЗнч(МоментВремени) = Тип("Дата") И ЗначениеЗаполнено(МоментВремени) Тогда
		ДатаОпределенияПериодаНачисления 	= МоментВремени; 
	Иначе
		// 
	КонецЕсли;
	
	ПериодНачисления 					= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДатаОпределенияПериодаНачисления, Организация, Район);
	ПараметрыЗапроса 					= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация",			Организация);
	ПараметрыЗапроса.Вставить("ПериодНачисления",		ПериодНачисления);
	ПараметрыЗапроса.Вставить("ТекущиеДанные",			тзТаблицаПоказаний);
	ПараметрыЗапроса.Вставить("ПриборыДляОтклоненияПоказаний",			тзПриборыДляОтклоненияПоказаний);
	ПараметрыЗапроса.Вставить("КонтрольныйСъем",		КонтрольныйСъем);
	ПараметрыЗапроса.Вставить("Период",					МоментВремени);
	
	Если мРайоны.Количество() = 1 Тогда
		ПараметрыЗапроса.Вставить("мРайоны",			мРайоны[0]);
	Иначе
		ПараметрыЗапроса.Вставить("мРайоны",			мРайоны);
	КонецЕсли;
	
	Если мКлючиПомещений.Количество() = 1 Тогда
		ПараметрыЗапроса.Вставить("мКлючПомещений",		мКлючиПомещений[0]);
	Иначе
		ПараметрыЗапроса.Вставить("мКлючПомещений",		мКлючиПомещений);
	КонецЕсли;
		
	РезультатЗапроса				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса, МВТ);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргРаботаСПоказаниямиПриборовУчетаСервер.РезультатДанныеЗаполненияТаблицыПоказаний";
		ПараметрыМетода 			= Новый Структура("Организация, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем",Организация, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
		
КонецФункции

#КонецОбласти

#Область РаботаСЗагрузкойПоказанийИзВнешнихИсточников

#Область ФормированиеДокументов

Процедура ЗапуститьФормированиеРегистрацииПоказаний(ДокументОснование, КоличествоПотоков, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Обработка = Документы.энргЗагрузкаПоказанийИзВнешнихИсточников;
	Обработка.ЗапуститьФормированиеРегистрацииПоказаний(ДокументОснование, КоличествоПотоков, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам(ДокументОснование, Идентификаторы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Обработка = Документы.энргЗагрузкаПоказанийИзВнешнихИсточников;
	Обработка.ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам(ДокументОснование, Идентификаторы, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

Функция СвязанныеДокументыСЗагрузкойПоказанийИзВнешнихИсточников(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргОбходнойЛист.Ссылка КАК Ссылка,
		|	энргОбходнойЛист.Район КАК Район,
		|	НАЧАЛОПЕРИОДА(энргОбходнойЛист.Дата, ДЕНЬ) КАК Дата
		|ИЗ
		|	Документ.энргОбходнойЛист КАК энргОбходнойЛист
		|ГДЕ
		|	энргОбходнойЛист.ДокументОснование = &ДокументОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Район";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция СоответствиеПоРайонуСвязанныхДокументовСЗагрузкойПоказанийИзВнешнихИсточников(ДокументОснование) Экспорт
	Результат = Новый Соответствие;
	
	РезультатЗапроса = СвязанныеДокументыСЗагрузкойПоказанийИзВнешнихИсточников(ДокументОснование); 	
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Район, Выборка.Ссылка.ПолучитьОбъект());
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция СоответствиеПоРайонуДатеСвязанныхДокументовСЗагрузкойПоказанийИзВнешнихИсточников(ДокументОснование) Экспорт
	Результат = Новый Соответствие;
	
	РезультатЗапроса = СвязанныеДокументыСЗагрузкойПоказанийИзВнешнихИсточников(ДокументОснование); 	
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Результат[Выборка.Дата] = Неопределено Тогда			
			СоотвествиРайон	= Новый Соответствие;
			СоотвествиРайон.Вставить(Выборка.Район, Выборка.Ссылка.ПолучитьОбъект()); 
			
			Результат.Вставить(Выборка.Дата, СоотвествиРайон);			
		Иначе			
			Результат[Выборка.Дата].Вставить(Выборка.Район, Выборка.Ссылка.ПолучитьОбъект());			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#Область ПолучениеАктуальныйПриборовИИхПоказаний

Функция РезультатЗапросаАктуальныхПриборовИИхПоказаний(Период, ВходныеПараметры) Экспорт 
	
	Схема 			= Неопределено;  	
	ПараметрыВТ 	= Новый Массив;
	
	СоответствиеРавно = Новый Структура("Организация, Район, КлючПомещения, АбонентВладелец", "Организация", "Район", "КлючПомещения", "КлючПомещения");	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоответствиеРавно));
				
	Параметры = Новый Структура;	
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	Параметры.Вставить("Период",  Новый Структура("ИмяПараметра,ТипПараметра", "Период", "ГраницаИсключая"));
	Параметры.Вставить("ВключаяОРП", Истина);
	
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, Параметры, "ДействующиеПриборыУчетаПомещения");
	РегистрыСведений.энргВидыДифференцированностиПриборовУчета.ВидДифференцированностиВведенныхПриборов(Схема, Параметры, "ВидДифференцированностиВведенныхПриборов");	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Район КАК Район,
		|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
		|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
		|	ЕСТЬNULL(энргВидыКанальностиШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
		|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер
		|ПОМЕСТИТЬ ДанныеПоПриборам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДействующиеПриборыУчетаПомещения.Организация КАК Организация,
		|		ДействующиеПриборыУчетаПомещения.Район КАК Район,
		|		ДействующиеПриборыУчетаПомещения.КлючПомещения КАК КлючПомещения,
		|		ДействующиеПриборыУчетаПомещения.ТочкаУчета КАК ТочкаУчета,
		|		ДействующиеПриборыУчетаПомещения.ПриборУчета КАК ПриборУчета,
		|		ЕСТЬNULL(энргПриборыУчетаАбонента.ВидКанальности, ЗНАЧЕНИЕ(Справочник.энргВидыКанальности.ПустаяСсылка)) КАК ВидКанальности,
		|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
		|		энргПриборыУчетаАбонента.Код КАК ЗаводскойНомер
		|	ИЗ
		|		ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|			ПО ДействующиеПриборыУчетаПомещения.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
		|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	Вложенныйзапрос.Организация КАК Организация,
		|	Вложенныйзапрос.Район КАК Район,
		|	Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
		|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
		|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
		|	Вложенныйзапрос.Шкала КАК Шкала,
		|	Вложенныйзапрос.ЗаводскойНомер КАК ЗаводскойНомер,
		|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
		|ПОМЕСТИТЬ ДанныеПоПриборамИтог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеПоПриборам.Организация КАК Организация,
		|		ДанныеПоПриборам.Район КАК Район,
		|		ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
		|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
		|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
		|		ДанныеПоПриборам.Шкала КАК Шкала,
		|		ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
		|		ДанныеПоПриборам.ЗаводскойНомер КАК ЗаводскойНомер
		|	ИЗ
		|		ДанныеПоПриборам КАК ДанныеПоПриборам
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
		|			ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
		|				И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
		|				И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
		|				И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
		|				И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
		|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка");
	
	
	ПоляОтбораПоказаний = Новый Структура("ПриборУчета,Шкала,ТарифнаяЗона", "ПриборУчета","Шкала","ТарифнаяЗона");
	ОтборПоказаний = энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("ДанныеПоПриборамИтог", ПоляОтбораПоказаний);
	ПараметрыВТ.Добавить(ОтборПоказаний);
	РегистрыСведений.энргМаксимальныеПоказания.МаксимальныеПоказанияСрез(Схема, Параметры, "МаксимальныеПоказанияСрез");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеПоПриборамИтог.Организация КАК Организация,
	|	ДанныеПоПриборамИтог.Район КАК Район,
	|	ДанныеПоПриборамИтог.КлючПомещения КАК КлючПомещения,
	|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
	|	ДанныеПоПриборамИтог.ЗаводскойНомер КАК ЗаводскойНомерПриборУчета,
	|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
	|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(МаксимальныеПоказанияСрез.Показание, 0) КАК Показание,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеПоПриборамИтог.ТарифнаяЗона) КАК ТарифнаяЗонаИмя
	|ИЗ
	|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|		ПО ДанныеПоПриборамИтог.Организация = МаксимальныеПоказанияСрез.Организация
	|			И ДанныеПоПриборамИтог.Район = МаксимальныеПоказанияСрез.Район
	|			И ДанныеПоПриборамИтог.КлючПомещения = МаксимальныеПоказанияСрез.КлючПомещения
	|			И ДанныеПоПриборамИтог.ПриборУчета = МаксимальныеПоказанияСрез.ПриборУчета
	|			И ДанныеПоПриборамИтог.Шкала = МаксимальныеПоказанияСрез.Шкала
	|			И ДанныеПоПриборамИтог.ТарифнаяЗона = МаксимальныеПоказанияСрез.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриборУчета,
	|	Шкала");
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			Период);
	ПараметрыЗапроса.Вставить("Организация",	ВходныеПараметры.Организация);
	ПараметрыЗапроса.Вставить("Район",			ВходныеПараметры.Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения",	ВходныеПараметры.КлючПомещения);			
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса); 
	Возврат РезультатЗапроса;
	
КонецФункции

Функция РезультатЗапросаАктуальныхПриборовМКДИхПоказаний(Период, ВходныеПараметры) Экспорт 
	
	Схема 			= Неопределено;  	
	ПараметрыВТ 	= Новый Массив;
	
	СоответствиеРавно = Новый Структура("Организация, Район, МКД, АбонентВладелец", "Организация", "Район", "МКД", "МКД");	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоответствиеРавно));
				
	Параметры = Новый Структура;	
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	Параметры.Вставить("Период",  Новый Структура("ИмяПараметра,ТипПараметра", "Период", "ГраницаИсключая"));
	Параметры.Вставить("ВключаяОРП", Истина);
	
	РегистрыСведений.энргСостояниеПриборовМКД.АктивныеПриборыУчетаМКД(Схема, Параметры, "ДействующиеПриборыУчетаМКД");
	РегистрыСведений.энргУслугиТочекУчетаМКД.УслугиДействующихТочек(Схема, Параметры, "УслугиДействующихТочекМКД"); 	
	РегистрыСведений.энргВидыДифференцированностиПриборовУчетаМКД.ВидДифференцированностиВведенныхПриборов(Схема, Параметры, "ВидДифференцированностиВведенныхПриборов");


	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Район КАК Район,
		|	ВложенныйЗапрос.МКД КАК МКД,
		|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
		|	ЕСТЬNULL(энргВидыКанальностиШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
		|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер
		|ПОМЕСТИТЬ ДанныеПоПриборам
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДействующиеПриборыУчетаМКД.Организация КАК Организация,
		|		ДействующиеПриборыУчетаМКД.Район КАК Район,
		|		ДействующиеПриборыУчетаМКД.МКД КАК МКД,
		|		ДействующиеПриборыУчетаМКД.ТочкаУчета КАК ТочкаУчета,
		|		ДействующиеПриборыУчетаМКД.ПриборУчета КАК ПриборУчета,
		|		ЕСТЬNULL(энргПриборыУчетаАбонента.ВидКанальности, ЗНАЧЕНИЕ(Справочник.энргВидыКанальности.ПустаяСсылка)) КАК ВидКанальности,
		|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
		|		энргПриборыУчетаАбонента.Код КАК ЗаводскойНомер
		|	ИЗ
		|		ДействующиеПриборыУчетаМКД КАК ДействующиеПриборыУчетаМКД
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|			ПО ДействующиеПриборыУчетаМКД.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
		|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	Вложенныйзапрос.Организация КАК Организация,
		|	Вложенныйзапрос.Район КАК Район,
		|	Вложенныйзапрос.МКД КАК МКД,
		|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
		|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
		|	Вложенныйзапрос.Шкала КАК Шкала,
		|	Вложенныйзапрос.ЗаводскойНомер КАК ЗаводскойНомер,
		|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
		|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности
		|ПОМЕСТИТЬ ДанныеПоПриборамИтог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеПоПриборам.Организация КАК Организация,
		|		ДанныеПоПриборам.Район КАК Район,
		|		ДанныеПоПриборам.МКД КАК МКД,
		|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
		|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
		|		ДанныеПоПриборам.Шкала КАК Шкала,
		|		ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
		|		ДанныеПоПриборам.ЗаводскойНомер КАК ЗаводскойНомер
		|	ИЗ
		|		ДанныеПоПриборам КАК ДанныеПоПриборам
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
		|			ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
		|				И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
		|				И ДанныеПоПриборам.МКД = ВидДифференцированностиВведенныхПриборов.МКД
		|				И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
		|				И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
		|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка");
	
	
	ПоляОтбораПоказаний = Новый Структура("ПриборУчета,Шкала,ТарифнаяЗона", "ПриборУчета","Шкала","ТарифнаяЗона");
	ОтборПоказаний = энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("ДанныеПоПриборамИтог", ПоляОтбораПоказаний);
	ПараметрыВТ.Добавить(ОтборПоказаний);
	РегистрыСведений.энргМаксимальныеПоказанияМКД.МаксимальныеПоказанияСрез(Схема, Параметры, "МаксимальныеПоказанияСрез");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеПоПриборамИтог.Организация КАК Организация,
	|	ДанныеПоПриборамИтог.Район КАК Район,
	|	ДанныеПоПриборамИтог.МКД КАК МКД,
	|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
	|	ДанныеПоПриборамИтог.ЗаводскойНомер КАК ЗаводскойНомерПриборУчета,
	|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
	|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(МаксимальныеПоказанияСрез.Показание, 0) КАК Показание,
	|	ПРЕДСТАВЛЕНИЕ(ДанныеПоПриборамИтог.ТарифнаяЗона) КАК ТарифнаяЗонаИмя,
	|	УслугиДействующихТочекМКД.Услуга КАК Услуга,
	|	ДанныеПоПриборамИтог.ВидДифференцированности КАК ВидДифференцированности
	|ИЗ
	|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|		ПО ДанныеПоПриборамИтог.Организация = МаксимальныеПоказанияСрез.Организация
	|			И ДанныеПоПриборамИтог.Район = МаксимальныеПоказанияСрез.Район
	|			И ДанныеПоПриборамИтог.МКД = МаксимальныеПоказанияСрез.МКД
	|			И ДанныеПоПриборамИтог.ПриборУчета = МаксимальныеПоказанияСрез.ПриборУчета
	|			И ДанныеПоПриборамИтог.Шкала = МаксимальныеПоказанияСрез.Шкала
	|			И ДанныеПоПриборамИтог.ТарифнаяЗона = МаксимальныеПоказанияСрез.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочекМКД КАК УслугиДействующихТочекМКД
	|		ПО ДанныеПоПриборамИтог.МКД = УслугиДействующихТочекМКД.МКД
	|			И ДанныеПоПриборамИтог.ТочкаУчета = УслугиДействующихТочекМКД.ТочкаУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриборУчета,
	|	Шкала");
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			Период);
	ПараметрыЗапроса.Вставить("Организация",	ВходныеПараметры.Организация);
	ПараметрыЗапроса.Вставить("Район",			ВходныеПараметры.Район); 	
	ПараметрыЗапроса.Вставить("МКД",			ВходныеПараметры.МКД);			
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса); 
	Возврат РезультатЗапроса;
	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область ВосстановлениеПоследовательности

Процедура ВосстановитьПоказанияМногопоточно(Отборы, ДополнительныеПараметры) Экспорт 
	
	КоличествоПотоков = ДополнительныеПараметры.КоличествоПотоков;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПоказанияПУПоследовательность.Строение КАК Строение,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргПоказанияПУПоследовательность.ПриборУчета) КАК ПриборУчета
		|ПОМЕСТИТЬ СбитыеВПоследоватеьности
		|ИЗ
		|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
		|ГДЕ
		|	энргПоказанияПУПоследовательность.Организация = &Организация
		|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргПоказанияПУПоследовательность.Район = &Район
		|	И НЕ энргПоказанияПУПоследовательность.СостояниеПроведения = &СостояниеПроведения
		|
		|СГРУППИРОВАТЬ ПО
		|	энргПоказанияПУПоследовательность.Строение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СбитыеВПоследоватеьности.Строение КАК Строение
		|ИЗ
		|	СбитыеВПоследоватеьности КАК СбитыеВПоследоватеьности
		|
		|УПОРЯДОЧИТЬ ПО
		|	СбитыеВПоследоватеьности.ПриборУчета УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Отборы.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", Отборы.ПериодНачисления);
	Запрос.УстановитьПараметр("Район", Отборы.Район);
	Запрос.УстановитьПараметр("СостояниеПроведения", ПредопределенноеЗначение("Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбщееКоличество = Выборка.Количество();		
	Если ОбщееКоличество <= КоличествоПотоков Тогда 
		Порция = ОбщееКоличество;
	Иначе 
		Порция = Цел(ОбщееКоличество / КоличествоПотоков);
		Если (ОбщееКоличество % КоличествоПотоков) > 0 Тогда			
			Порция = Порция + 1;
		КонецЕсли;
	КонецЕсли;	
	
	Итерация = 0; 
	ПодготовленныеПотоки = Новый Массив;
	Для Сч = 1 По КоличествоПотоков Цикл
		
		ПодготовленныеПотоки.Добавить(Новый Массив);		
		
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		Если Итерация >  КоличествоПотоков - 1 Тогда
			Итерация = 0;
		КонецЕсли;
		
		ПодготовленныеПотоки[Итерация].Добавить(Выборка.Строение);
		
		Итерация = Итерация + 1;
	КонецЦикла;
	
	ДлительныеОперацииСписок = Новый Массив;
	Для Каждого Поток из ПодготовленныеПотоки Цикл 
		ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(Отборы, Поток);
		ДлительныеОперацииСписок.Добавить(ДлительнаяОперация);
	КонецЦикла;
	           	
	ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок);
	
КонецПроцедуры

Функция ЗапуститьФоновоеЗаданиеСервер(Отборы, Идентификаторы)

	Инструмент = Новый Структура("Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Строения");
	Инструмент.Организация  	= Отборы.Организация;
	Инструмент.ПериодНачисления	= Отборы.ПериодНачисления;
	Инструмент.Район			= Отборы.Район;
	Инструмент.Строения			= Идентификаторы;	
	
	Шаблон = "ru = '%1'";
	НаимДок = "";
	ИмяФункции = "энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУМногопоточно";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр(СтрШаблон(Шаблон, НаимДок));
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяФункции,
		Инструмент);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок)
	
	ЗавершенныеЗадания = Новый Массив;
	Пока Истина Цикл
		
		Если ЗавершенныеЗадания.Количество() = ДлительныеОперацииСписок.Количество() Тогда 
			Прервать;
		КонецЕсли;
		
		
		Для Каждого ДлительнаяОперация из ДлительныеОперацииСписок Цикл 
			
			Если НЕ ЗавершенныеЗадания.Найти(ДлительнаяОперация) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			
			Выполнено = Ложь;
			Попытка
				
				Выполнено = ДлительныеОперации.ЗаданиеВыполнено(ДлительнаяОперация.ИдентификаторЗадания);	
				
			Исключение
				// Завершенные аварийно задания помещаем как выполненные
				Выполнено = Истина;
			КонецПопытки;
			
			Если Выполнено Тогда 
				ЗавершенныеЗадания.Добавить(ДлительнаяОперация);
			КонецЕсли; 			
			
		КонецЦикла;
		
		ОбменДаннымиСервер.Пауза(5);
		
	КонецЦикла; 	
	
КонецПроцедуры
	
#КонецОбласти