#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПраваДокументаПерерасчет(Отказ);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере 
Процедура ПроверитьПраваДокументаПерерасчет(Отказ) 
	
	ЕстьПравоЧтение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Чтение"); 
	ЕстьПравоИзменение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Изменение");
	Если Не ЕстьПравоИзменение И (Не ЕстьПравоЧтение Или ЕстьПравоЧтение И Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		Отказ = Истина;
		ВызватьИсключение "Нарушение прав доступа";
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр = ЕстьПравоЧтение И Не ЕстьПравоИзменение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОсновании", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);	
КонецПроцедуры

#КонецОбласти