#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргУстановленныеПараметрыРасчетаНорматива(ЭтотОбъект);
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазрезНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоСобственников"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих"));
	
КонецПроцедуры

#КонецОбласти