#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_бестДоговорыКонтрагентов(ЭтотОбъект);
	
	Если Параметры.ДополнительныеПараметры.Свойство("Контрагент") И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.Контрагент) Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Контрагент",Параметры.ДополнительныеПараметры.Контрагент,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;	
	
	Если Параметры.Свойство("Район") И ЗначениеЗаполнено(Параметры.Район)  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Район",Параметры.Район,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация)  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Организация",Параметры.Организация,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("Филиал") И ЗначениеЗаполнено(Параметры.Филиал)  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Филиал",Параметры.Филиал,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;

	СписокДоговоров = Неопределено;
	Если Параметры.Свойство("СписокДоговоров") Тогда
		СписокДоговоров	= Параметры.СписокДоговоров;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("бестБиллингПроект") Тогда
		Модуль  = ОбщегоНазначения.ОбщийМодуль("бестПользовательскийВводСервер");
		Модуль.ЗаполнитьСписокСсылок(ЭтаФорма, СписокДоговоров, "Договор");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СписокДоговоров)  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокДоговоров,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 
	КонецЕсли;
	
	бестРаботаСФормойДоговораНезависимыйСбыт.НастроитьЭлементыИнтерфейсаДоговор(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти