#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Организация, Район, Период, ТочкаУчета, Услуга, ТолькоДоТП;
	
	Если Параметры.Свойство("Период") Тогда
		Период 			= Параметры.Период;
	КонецЕсли;
	
	Если Параметры.Свойство("Район") Тогда
		Район 			= Параметры.Район;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация 	= Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Договор") Тогда
		Договор 		= Параметры.Договор;
	КонецЕсли;
	
	Если Параметры.Свойство("ТочкаУчета") Тогда
		ТочкаУчета 		= Параметры.ТочкаУчета;
	КонецЕсли;
	
	Если Параметры.Свойство("Услуга") Тогда
		Услуга 			= Параметры.Услуга;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоДоТП") Тогда
		ТолькоДоТП 		= Параметры.ТолькоДоТП;
	КонецЕсли;

	Если ЗначениеЗаполнено(Организация) 
		И ЗначениеЗаполнено(Период) Тогда
		
		Результат = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(Организация, Район, Период, Договор, , ТочкаУчета, Услуга, , ТолькоДоТП);		
		
		Выборка  					= Результат.Выбрать();
		
		СписокОбъектов				= Новый СписокЗначений;
		
		Пока Выборка.следующий() цикл
			СписокОбъектов.Добавить(Выборка.ОбъектРасчета);
		КонецЦикла;  	
		
		// накладываем отбор на точки динамический список
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокОбъектов,ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорДляОтбораПриИзменении(Элемент)	
	ОтборПоДоговору();
КонецПроцедуры                                                  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборПоДоговору()
	
	Если ЗначениеЗаполнено(Договор) Тогда
				
		РезультатЗапроса 		= РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(Договор.Организация, Договор.Район, ТекущаяДатаСеанса(), Договор, , , , , );	       
		ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
		
		СписокОбъектов			= Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                   
			СписокОбъектов.Добавить(ВыборкаДетальныеЗаписи.ОбъектРасчета);
		КонецЦикла;  	
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокОбъектов,ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);			
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокОбъектов,ВидСравненияКомпоновкиДанных.ВСписке,,Ложь,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);			
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
