#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает пустой массив плательщиков.
// 
// Возвращаемое значение:
//   Массив.
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДатаФактическогоСобытия) Тогда
		Возврат МассивПлательщиков;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",		Ссылка);
	Запрос.УстановитьПараметр("ДатаФакта",	ДатаФактическогоСобытия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргСтабильныеПериоды.Плательщик КАК Плательщик,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьКоличествоПрописанных КАК энргУстановитьКоличествоПрописанных
	|		ПО энргСтабильныеПериоды.Абонент = энргУстановитьКоличествоПрописанных.Абонент
	|			И (энргСтабильныеПериоды.Плательщик <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка))
	|			И (энргСтабильныеПериоды.ПериодНачисления >= &ДатаФакта)
	|			И (энргСтабильныеПериоды.Абонент <> энргСтабильныеПериоды.Плательщик)
	|			И (энргУстановитьКоличествоПрописанных.Ссылка = &Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргСтабильныеПериоды.Плательщик = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Плательщик,
	|	энргАбоненты.КлючПомещения";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		МассивПлательщиков.Добавить(Новый Структура("Абонент,КлючПомещения", Результат.Плательщик, Результат.КлючПомещения));
	КонецЦикла;

	Возврат МассивПлательщиков;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
 	ПериодРегистрации =	?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата);	
	ДополнительныеСвойства.ПараметрыПроведения.Вставить("ПериодРегистрации", ПериодРегистрации);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	ЛСОТкрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеЛС(Момент,Абонент,Район,Организация);
			
	МКДОткрыт 		= Истина;

	Если НЕ ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор тогда		
		Строение 		= ДополнительныеСвойства.ДанныеСтроения.Строение;
		МКДОткрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Момент,Район,Строение,Организация);			
	КонецЕсли;
	
	Если не ЛСОТкрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " лицевой счет закрыт");
	КонецЕсли;
	
	Если не МКДОткрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " мкд закрыт");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();	
	
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоПрописанных(ДанныеШапки,Движения);
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьИзменениеПрописанныхЖильцов(ДанныеШапки,Движения);
	
	Если РавноКоличествуПроживающих Тогда
		ДанныеШапки.Вставить("КоличествоПроживающих",	Количество);
		энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоПроживающих(ДанныеШапки,Движения);	
	КонецЕсли;
	
	ПолучаемыеСвойства  = Новый Структура("ТипПомещения, КлючПомещенияРодителя");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата),ПолучаемыеСвойства);
	
	Если ПолучаемыеСвойства.ТипПомещения = Перечисления.энргТипыПомещений.Комната И ПолучаемыеСвойства.КлючПомещенияРодителя <> Неопределено Тогда
		
		энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоЖильцов(ДанныеШапки,ПолучаемыеСвойства.КлючПомещенияРодителя,Движения);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);   
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("КоличествоПрописанных",	Количество);
	ДанныеШапки.Вставить("Ссылка",					Ссылка);
	ДанныеШапки.Вставить("КоличествоЖильцов",		ПолучитьКоличествоЖильцов());

	Возврат ДанныеШапки; 
КонецФункции

Функция ПолучитьКоличествоЖильцов()
	
	ДатаГраницы 		= ?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		МоментВремени 	= Новый МоментВремени(ДатаГраницы, Ссылка);
	Иначе
		МоментВремени 	= ДатаГраницы;
	КонецЕсли;
	
	
	Если Количество = 0 Тогда
		ПолучаемыеСвойства  = Новый Структура("КоличествоПроживающих, КоличествоСобственников");
		энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,МоментВремени,ПолучаемыеСвойства);
		КоличествоЖильцов = ?(ПолучаемыеСвойства.КоличествоПроживающих = Неопределено,?(ПолучаемыеСвойства.КоличествоСобственников = Неопределено, 0, ПолучаемыеСвойства.КоличествоСобственников),  ПолучаемыеСвойства.КоличествоПроживающих);
	Иначе
		КоличествоЖильцов = Количество;
	КонецЕсли;
	
	Возврат КоличествоЖильцов;	
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли