#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

// Заполняет увеличение снижения стоимости услуг.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура УвеличениеСниженияСтоимостиУслуг(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаУвеличениеСниженияСтоимостиУслуг());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Услуга";
		ПараметрыВиртуальнойТаблицы = ОператорВыбора.Источники[0].Источник.Параметры[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрыВиртуальнойТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
КонецПроцедуры

// Заполняет увеличение снижения стоимости услуг коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура УвеличениеСниженияСтоимостиУслугКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаПериодов, ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаУвеличениеСниженияСтоимостиУслугКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	//ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	//Источник 						= ОператорВыбора.Источники[1].Источник;		
КонецПроцедуры

#Область ТекстыЗапросов

// Получает текст запроса увеличение снижения стоимости услуг.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаУвеличениеСниженияСтоимостиУслуг() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргУвеличениеСниженияСтоимостиУслуг.Организация КАК Организация,
	|	энргУвеличениеСниженияСтоимостиУслуг.Район КАК Район,
	|	энргУвеличениеСниженияСтоимостиУслуг.Услуга КАК Услуга,
	|	энргУвеличениеСниженияСтоимостиУслуг.КоличествоМесяцевПосле КАК КоличествоМесяцевПосле,
	|	энргУвеличениеСниженияСтоимостиУслуг.КоэффициентУвеличения КАК КоэффициентУвеличения
	|ИЗ
	|	РегистрСведений.энргУвеличениеСниженияСтоимостиУслуг.СрезПоследних КАК энргУвеличениеСниженияСтоимостиУслуг";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаУвеличениеСниженияСтоимостиУслугКоллекцияПериодов()
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаНастроек.Организация КАК Организация,
	|	ТаблицаНастроек.Район КАК Район,
	|	ТаблицаНастроек.Услуга КАК Услуга,
	|	ТаблицаНастроек.КоличествоМесяцевПосле КАК КоличествоМесяцевПосле,
	|	ТаблицаНастроек.КоэффициентУвеличения КАК КоэффициентУвеличения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаНастроек.Организация КАК Организация,
	|		ТаблицаНастроек.Район КАК Район,
	|		ТаблицаНастроек.Услуга КАК Услуга,
	|		МАКСИМУМ(ТаблицаНастроек.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргУвеличениеСниженияСтоимостиУслуг КАК ТаблицаНастроек
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ТаблицаНастроек.Организация = ТаблицаПериодов.Организация
	|				И ТаблицаНастроек.Район = ТаблицаПериодов.Район
	|				И ТаблицаНастроек.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ТаблицаНастроек.Организация,
	|		ТаблицаНастроек.Район,
	|		ТаблицаНастроек.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУвеличениеСниженияСтоимостиУслуг КАК ТаблицаНастроек
	|		ПО ВложенныйЗапрос.Период = ТаблицаНастроек.Период
	|			И ВложенныйЗапрос.Организация = ТаблицаНастроек.Организация
	|			И ВложенныйЗапрос.Район = ТаблицаНастроек.Район
	|			И ВложенныйЗапрос.Услуга = ТаблицаНастроек.Услуга";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли