
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", 		Организация);
	ПараметрыОтчета.Вставить("Район", 				Район);                
	ПараметрыОтчета.Вставить("ОбъектРасчета", 		ОбъектРасчета);
	ПараметрыОтчета.Вставить("Услуга", 				Услуга);
	ПараметрыОтчета.Вставить("ПериодНачисления", 	НачалоМесяца(РасчетныйПериод));

	СформироватьНаСервере(РезультатОтчета, ПараметрыОтчета);
	РезультатОтчета.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	РезультатОтчета.АвтоМасштаб 		= Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере(ТабДок, ПараметрыОтчета)
	Отчеты.бестПочасовоеПотребление.СформироватьОтчет(ТабДок, ПараметрыОтчета);
КонецПроцедуры

#КонецОбласти
