#Область СлужебныйПрограммныйИнтерфейс

#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(ДокументОснование, ЗависимыеРеквизиты, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ИмяМетода = "Документы.энргРегистрацияПоказанийАбонента.УстановитьЗависимыеРеквизитыОтДокументаОснования";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Смена зависимых реквизитов'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование, 
		ЗависимыеРеквизиты);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПроведениеПоказаний

Функция ЗапуститьФоновоеЗаданиеПроведениеПоказаний(ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяМетода = "Документы.энргРегистрацияПоказанийАбонента.ПровестиДокументыПоДокументуОснованию";
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проведение документов регистрации показаний'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти 

#Область ФоновоеВыполнениеЗадачиОтменаПроведенияПоказаний

Функция ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказаний(ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяМетода = "Документы.энргРегистрацияПоказанийАбонента.ОтменитьПроведениеДокументовПоДокументуОснованию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отмена проведения документов регистрации показаний'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиУстановкаПометкиУдаленияПоказаний

Функция ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказаний(ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ИмяМетода = "Документы.энргРегистрацияПоказанийАбонента.УстановитьПометкуУдаленияПоказанийПоДокументуОснованию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Установка пометки удаления документов регистрации показаний'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти


#Область РаботаСДатойДокумента

Функция ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента) Экспорт 
	
	Возврат Документы.энргРегистрацияПоказанийАбонента.ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента);
	
КонецФункции

#КонецОбласти

#Область ПроверкаСвязанныхРеквизитов

Функция НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты) Экспорт 
	
	Возврат Документы.энргРегистрацияПоказанийАбонента.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
	
КонецФункции 

#КонецОбласти  

#Область ОтображениеСвязанныхДокументовПоказаний

Процедура ЗаполнитьМакетПоказанийПоДокументуПоказаний(ТабличныйДокумент, ДокументПоказаний) Экспорт 
		
	Макет = Документы.энргПлатежноеПоручениеВходящие.ПолучитьМакет("МакетДанныеРегистрацииПоказаний");
	ОбластьШапкаДетальныхЗаписей = Макет.ПолучитьОбласть("ШапкаДетали");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ПоказанияПредоставлены КАК Предоставлены,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ПРЕДСТАВЛЕНИЕ(энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТарифнаяЗона) КАК ТарифнаяЗонаПредставление,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Переворот КАК Переворот,
		|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Разница КАК Разница
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента.ТочкиУчета КАК энргРегистрацияПоказанийАбонентаТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ШкалыПриборовУчета КАК энргРегистрацияПоказанийАбонентаШкалыПриборовУчета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ПоказанияПриборовУчета КАК энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета
		|			ПО энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка
		|				И (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = &Ссылка)
		|				И (энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка.Ссылка = &Ссылка)
		|				И энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтроки = энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.IDСтроки
		|		ПО энргРегистрацияПоказанийАбонентаТочкиУчета.Ссылка = энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка
		|			И (энргРегистрацияПоказанийАбонентаТочкиУчета.Ссылка = &Ссылка)
		|			И (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = &Ссылка)
		|			И энргРегистрацияПоказанийАбонентаТочкиУчета.IDСтроки = энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтрокиТочкиУчета";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументПоказаний);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаДетальныхЗаписей);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла; 
	
КонецПроцедуры

Функция ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(ДокументОснование) Экспорт
	
	Возврат Документы.энргРегистрацияПоказанийАбонента.ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(ДокументОснование);
	
КонецФункции

#КонецОбласти

#КонецОбласти