#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестИзменитьФормулуРасчетаСтруктурыСети(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ФормаВыбора 			= ПолучитьФорму("Справочник.энргТочкиУчета.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список,"Ссылка", ПолучитьМассивДоступныхТУ(), ВидСравненияКомпоновкиДанных.ВСписке);
	ФормаВыбора.Открыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьМассивДоступныхТУ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И СтруктураСети = &СтруктураСети) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("СтруктураСети",  Объект.РассчитываемыйЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТочкаУчета");	
	
КонецФункции

#КонецОбласти