
#Область СлужебныеПроцедурыИФункции

// Функция - Получить ФО "Учет независимый сбыт"
// 
// Возвращаемое значение:
//   Булево - Значение функциональной опции бестУчетНезависимыйСбыт 
//
Функция ПолучитьУчетНезависимыйСбыт() Экспорт
	
	Если Метаданные.ФункциональныеОпции.Найти("бестУчетНезависимыйСбыт") <> Неопределено Тогда 
		Возврат энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестУчетНезависимыйСбыт"); 
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Процедура - Установить свойства реквизитов независимый сбыт
//
// Параметры:
//  Форма		 - ФормаКлиентскогоПриложения
//  Реквизиты	 - Массив - массив имен реквизитов
//  Свойство	 - Строка - свойство элемента формы
//  Значение	 - Произвольный - новое значение свойства
//
Процедура УстановитьСвойстваРеквизитовНезависимыйСбыт(Форма, Реквизиты, Свойство, Значение) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") Тогда
		Для Каждого ИмяРеквизита Из Реквизиты Цикл
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ИмяРеквизита, Свойство, Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

// Функция - Вернуть адрес объекта расчета
//
// Параметры:
//  Ссылка - СправочникСсылка.бестОбъектыРасчета - объект расчета
//
Функция ВернутьАдресОбъектаРасчета(Ссылка) Экспорт
	
	Возврат УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Ссылка, Справочники.ВидыКонтактнойИнформации.АдресОбъектаРасчета);	
	
КонецФункции 

#Область СозданиеНаОсновании

Процедура ЗаписатьВРегистрСвязиДоговоров(Ссылка, ИсточникДоговора) Экспорт
	
	ДанныеДляЗаписи = Новый Структура("ИсточникДоговора, ДоговорСсылка", ИсточникДоговора, Ссылка);
    РегистрыСведений.бестСвязьДоговоров.ДобавитьЗапись(ДанныеДляЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияОбъектовДоговоры

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.энргДоговорыКонтрагентов.ПолноеИмя(), "");
	
КонецПроцедуры

#КонецОбласти

#Область ДатаПоследнегоИзменения

// Процедура - Дополнительные параметры записи даты изменения
//
// Параметры:
//  ТекущийОбъект	 - ДокументОбъект - документ с реквизитом энргДатаПоследнегоИзменения для заполнения
//  Форма			 - ФормаКлиентскогоПриложения
//
Процедура ДополнительныеПараметрыЗаписиДатыИзменения(ТекущийОбъект, Модифицированность, ПараметрыЗаписи = Неопределено) Экспорт
	
	Если Не ПолучитьУчетНезависимыйСбыт() Тогда
		Возврат;		
	КонецЕсли;
	
	Если ПараметрыЗаписи = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	УсловиеИзмененияДаты = Модифицированность;
	
	Если ПараметрыЗаписи.Свойство("РежимЗаписи") Тогда
		УсловиеИзмененияДаты = УсловиеИзмененияДаты Или Не ТекущийОбъект.Проведен И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		                                            Или ТекущийОбъект.Проведен И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
							 
	Если УсловиеИзмененияДаты И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийОбъект, "энргДатаПоследнегоИзменения") Тогда
		ТекущийОбъект.энргДатаПоследнегоИзменения = ТекущаяДата();
	КонецЕсли;
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДатаИзмененияАктуальна", Истина);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти