#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗаполнитьЗначениеПараметров(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);	
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗначениеПараметров(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	РасчетныйПериодПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасчетныйПериод"));
	Если РасчетныйПериодПараметр = Неопределено Тогда
		Возврат;
	КонецЕсли;  	
	
	РасчетныйПериодЭлемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(РасчетныйПериодПараметр.ИдентификаторПользовательскойНастройки);
	ПериодНачисления = НачалоМесяца(РасчетныйПериодЭлемент.Значение);
	
	ОрганизацияПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	ОрганизацияЭлемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ОрганизацияПараметр.ИдентификаторПользовательскойНастройки);
	РайонПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Район"));
	РайонЭлемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(РайонПараметр.ИдентификаторПользовательскойНастройки);
	
	ГраницыОП = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(
		ОрганизацияЭлемент.Значение,
		РайонЭлемент.Значение,
		ПериодНачисления);
		
	НачПериодаПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	НачПериодаПараметр.Значение = ГраницыОП.НачалоОП;
	КонПериодаПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	КонПериодаПараметр.Значение = Новый Граница(
			ГраницыОП.ЗавершениеОП - 1, 
			ВидГраницы.Включая);
	
	ПериодПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ПериодПараметр.Значение = Новый Граница(
			ГраницыОП.ЗавершениеОП - 1, 
			ВидГраницы.Включая);		
						
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
