#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура КоэффициентОпределенияОбъемаРеактивнойЭнергии(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;			
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКоэффициентОпределенияОбъемаРеактивнойЭнергии());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаКоэффициентОпределенияОбъемаРеактивнойЭнергии()
	Текст  =
	"ВЫБРАТЬ
	|	бестКоэффициентОпределенияОбъемаРеактивнойЭнергииСрезПоследних.Организация КАК Организация,
	|	бестКоэффициентОпределенияОбъемаРеактивнойЭнергииСрезПоследних.Услуга КАК Услуга,
	|	бестКоэффициентОпределенияОбъемаРеактивнойЭнергииСрезПоследних.КоэффициентОпределенияОбъема КАК КоэффициентОпределенияОбъема
	|ИЗ
	|	РегистрСведений.бестКоэффициентОпределенияОбъемаРеактивнойЭнергии.СрезПоследних КАК бестКоэффициентОпределенияОбъемаРеактивнойЭнергииСрезПоследних";
	
	Возврат Текст;
	
КонецФункции 

#КонецОбласти

#КонецЕсли