#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район); 		
	КонецЕсли;

	ЗаполнитьДанныеПриборовУчета();	
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район 			= ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьДанныеПриборовУчета(); 
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧасти

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	
	Если ТекДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрок(ТекДанные.IDСтроки);  	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидДифференцированностиПослеПриИзменении(Элемент)
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	ВидДифференцированности 				= ТекДанные.ВидДифференцированностиПосле;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекДанные,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности),"ПоказанияПриборовУчета",Неопределено,Ложь,Истина); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаВыводТекущиеПоказанияПриИзменении(Элемент)
	текСтрока								= Элементы.ПоказанияПриборовУчетаВывод.ТекущиеДанные;
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(текСтрока,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаВыводСостояниеПоказанийПриИзменении(Элемент)
	текСтрока								= Элементы.ПоказанияПриборовУчетаВывод.ТекущиеДанные;
	текСтрока.СтатусИзмененПользователем 	= Истина;
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(текСтрока,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаВыводПереворотПриИзменении(Элемент)
	текСтрока								= Элементы.ПоказанияПриборовУчетаВывод.ТекущиеДанные;
	текСтрока.ПереворотИзмененПользователем = Истина;
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(текСтрока,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборСтрок(IDСтроки) 	
	Элементы.ПоказанияПриборовУчетаВывод.ОтборСтрок = Новый ФиксированнаяСтруктура("IDСтроки",IDСтроки);
	Элементы.ПоказанияПриборовУчетаВвод.ОтборСтрок 	= Новый ФиксированнаяСтруктура("IDСтроки",IDСтроки); 		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПриборовУчета()
	ТаблицаТЧ 								= Объект.ПоказанияПриборовУчета.Выгрузить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ПоказанияПриборовУчетаВывод.Очистить();
	Объект.ТочкиУчета.Очистить();
	
	Результат 								= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаМКД(Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД); 
	Выборка  								= Результат.выбрать();
	Пока Выборка.следующий() цикл
		СтрокаПриборов  					= Объект.ТочкиУчета.Добавить();
		СтрокаПриборов.IDСтроки 			= Новый УникальныйИдентификатор;
		ЗаполнитьЗначенияСвойств(СтрокаПриборов,Выборка); 		 
	КонецЦикла; 
	
	энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ПоказанияПриборовУчетаВывод,ТаблицаТЧ,Объект.Дата,Объект.Организация, Объект.Район,Объект.МКД,Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
