
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Район") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"Район", Параметры.Район);
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"Организация", Параметры.Организация);
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"Договор", Параметры.Договор);
	КонецЕсли;
	Если Параметры.Свойство("НачалоПериода") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"НачалоПериода", Параметры.НачалоПериода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.бестПлатежныйДокумент.ФормаОбъекта", Новый Структура("Ключ", Элементы.Задолженность.ТекущиеДанные.ПлатежныйДокумент)); 
КонецПроцедуры

#КонецОбласти
