#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПересчитатьИндивидуальныйОбъемПотребленный(Команда)
	
	 ПересчитатьСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьСервер()

	ОчиститьНаборыЗаписей();
	
	ОбъемНачисленийМКД 		= Объект.Движения.энргОбъемНачисленийМКД.Выгрузить();
	мУслуги 				= Новый Массив;
	ГраницыПерерасчета = Новый Структура("Начало,Окончание", Неопределено, Неопределено);
	ДанныеПерерасчета(ГраницыПерерасчета, мУслуги);
	СнятьОбъемИндивидуальныйОбъемПотребленный(ГраницыПерерасчета, мУслуги);
	СнятьОбъемПотребленныйМКД(ГраницыПерерасчета, мУслуги);
	
	ПараметрыПерерасчета 	= Новый Структура;
	ПараметрыПерерасчета.Вставить("Начало", 			ГраницыПерерасчета.Начало);
	ПараметрыПерерасчета.Вставить("Окончание", 			ГраницыПерерасчета.Окончание);
	ПараметрыПерерасчета.Вставить("ОбъемНачисленийМКД", ОбъемНачисленийМКД);
	ПараметрыПерерасчета.Вставить("ОбъемНачислений", 	Объект.Движения.энргОбъемНачислений);
	ПараметрыПерерасчета.Вставить("ОбъемНачисленийНП", 	Объект.Движения.бестОбъемНачисленийНП);
	
	энргНачисления.ПересчитатьРаспредениеОбъемаПотребленногоМКД(Объект.Организация,Объект.ПериодНачисления, Объект.Район, Объект.МКД, ПараметрыПерерасчета);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаборыЗаписей()
	
	СтрокиУдалить 			= Новый Массив;
	
	Для Каждого СтрокаНабора Из Объект.Движения.энргОбъемНачисленийМКД Цикл
		Если СтрокаНабора.ОбъемУслугиПотребленный < 0 Тогда
			  СтрокиУдалить.Добавить(СтрокаНабора);
		КонецЕсли;
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		Объект.Движения.энргОбъемНачисленийМКД.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;
	
	Объект.Движения.энргОбъемНачислений.Очистить();
	Объект.Движения.бестОбъемНачисленийНП.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СнятьОбъемИндивидуальныйОбъемПотребленный(ГраницыПерерасчета, мУслуги)
	
	Текст = 
	"ВЫБРАТЬ
	|	энргОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(энргОбъемНачислений.Период,МЕСЯЦ) МЕЖДУ &ГраницыПерерасчетаНачало И &ГраницыПерерасчетаОкончание
	|	И энргОбъемНачислений.Организация = &Организация	
	|	И энргОбъемНачислений.Район = &Район
	|	И энргОбъемНачислений.Строение = &Строение
	|	И энргОбъемНачислений.Регистратор Ссылка Документ.энргРаспределениеМКД
	|	И энргОбъемНачислений.Услуга в (&мУслуги)";
	
	Запрос  								= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаНачало", 		ГраницыПерерасчета.Начало);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаОкончание", 	ГраницыПерерасчета.Окончание);
	Запрос.УстановитьПараметр("Организация", 					Объект.Организация);
	Запрос.УстановитьПараметр("Район", 							Объект.Район);
	Запрос.УстановитьПараметр("Строение",	 					Объект.МКД);
	Запрос.УстановитьПараметр("мУслуги",	 					мУслуги);
	
	Набор 									= Объект.Движения.энргОбъемНачислений;
	Выборка 								= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока  			= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ОбъемУслугиПотребленный = -НоваяСтрока.ОбъемУслугиПотребленный;
		НоваяСтрока.ОбъемУслуги 			= 0;
		НоваяСтрока.Сумма 					= 0;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СнятьОбъемПотребленныйМКД(ГраницыПерерасчета, мУслуги)
	
	Текст 									= 
	"ВЫБРАТЬ
	|*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийМКД КАК энргОбъемНачислений
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(энргОбъемНачислений.Период,МЕСЯЦ) МЕЖДУ &ГраницыПерерасчетаНачало И &ГраницыПерерасчетаОкончание
	|	И энргОбъемНачислений.Организация = &Организация
	|	И энргОбъемНачислений.Район = &Район
	|	И энргОбъемНачислений.МКД = &МКД
	|	И энргОбъемНачислений.Услуга в (&мУслуги)";
	
	Запрос  								= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаНачало", 		ГраницыПерерасчета.Начало);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаОкончание", 	ГраницыПерерасчета.Окончание);
	Запрос.УстановитьПараметр("Организация",	 				Объект.Организация);
	Запрос.УстановитьПараметр("Район", 							Объект.Район);
	Запрос.УстановитьПараметр("МКД", 							Объект.МКД);
	Запрос.УстановитьПараметр("мУслуги", 						мУслуги);

	Набор  									= Объект.Движения.энргОбъемНачисленийМКД;
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока  						= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ОбъемУслуги 			= 0;
		НоваяСтрока.ОбъемУслугиНорматив 	= 0;
		НоваяСтрока.ОбъемУслугиПотребленный = -Выборка.ОбъемУслугиПотребленный;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеПерерасчета(ГраницыПерерасчета, мУслуги)
	
	Для Каждого СтрокаПериода Из Объект.Движения.энргОбъемНачисленийМКД Цикл
		
		Если мУслуги.Найти(СтрокаПериода.Услуга) = Неопределено Тогда
			мУслуги.Добавить(СтрокаПериода.Услуга);
		КонецЕсли;		
		
		Если ГраницыПерерасчета.Начало = Неопределено Тогда
			ГраницыПерерасчета.Начало = СтрокаПериода.ПериодНачисления;
		ИначеЕсли ГраницыПерерасчета.Начало > СтрокаПериода.ПериодНачисления Тогда 
			ГраницыПерерасчета.Начало = СтрокаПериода.ПериодНачисления;
		КонецЕсли;
		
		Если ГраницыПерерасчета.Окончание = Неопределено Тогда
			ГраницыПерерасчета.Окончание = СтрокаПериода.ПериодНачисления;
		ИначеЕсли ГраницыПерерасчета.Окончание < СтрокаПериода.ПериодНачисления Тогда 
			ГраницыПерерасчета.Окончание = СтрокаПериода.ПериодНачисления;
		КонецЕсли;		
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
