#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает составляющие тарифных зон.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ПолучитьСоставляющиеТарифныхЗон() Экспорт
	
	СоставляющиеТарифныхЗон = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СоставляющиеТарифныхЗонТекстЗапроса(); 
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТарифнаяЗона = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТарифнаяЗона.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаТарифнаяЗона.Выбрать();
		
		мТЗ = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			мТЗ.Добавить(ВыборкаДетальныеЗаписи.СоставляющаяТарифнаяЗона);
		КонецЦикла;
		
		СоставляющиеТарифныхЗон.Вставить(ВыборкаТарифнаяЗона.ТарифнаяЗона, мТЗ);
		
	КонецЦикла;
		
	Возврат СоставляющиеТарифныхЗон;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоставляющиеТарифныхЗонТекстЗапроса()
	
	Возврат "ВЫБРАТЬ
	        |	энргСоставляющиеТарифныхЗон.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	энргСоставляющиеТарифныхЗон.СоставляющаяТарифнаяЗона КАК СоставляющаяТарифнаяЗона
	        |ИЗ
	        |	РегистрСведений.энргСоставляющиеТарифныхЗон КАК энргСоставляющиеТарифныхЗон
	        |ИТОГИ ПО
	        |	ТарифнаяЗона";
	
КонецФункции

#КонецОбласти

#КонецЕсли