
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Организация = ПредопределенноеЗначение("Справочник.Организации.НашаОрганизация");
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыАбоненты

&НаКлиенте
Процедура АбонентыАбонентПриИзменении(Элемент)
	ТекДанные = Элементы.Абоненты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если ЕстьАбонент(ТекДанные.Абонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ТекДанные.Абонент + " уже добавлен в список");
		ТекДанные.Абонент = ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка");
		Возврат;
	КонецЕсли;	
	
	ТекДанные.КлючПомещения = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Абонент, "КлючПомещения");
	ТекДанные.Строение 		= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.КлючПомещения, "Строение");
	
	УстановитьОтборПоАбоненту(ТекДанные.Абонент);
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Абоненты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьОтборПоАбоненту(ТекДанные.Абонент);
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.Абоненты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокиАбонентаИзДанныхСписания(ТекДанные.Абонент);
КонецПроцедуры

#КонецОбласти 

#Область СобытияТаблицыДанныхСписания

&НаКлиенте
Процедура ДанныеСписанияПослеУдаления(Элемент)
	ТекДанные 		= Элементы.Абоненты.ТекущиеДанные;	
	ИндексСтроки 	= Абоненты.Индекс(ТекДанные);
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОбновитьСтрокуСОбщейСуммой(ТекДанные.Абонент, ИндексСтроки);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ТекДанные 		= Элементы.Абоненты.ТекущиеДанные;	
	ИндексСтроки 	= Абоненты.Индекс(ТекДанные);
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекДанные.Абонент) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран абонент");
		Возврат;
	КонецЕсли;

	ПараметрыПодбора  					= Новый Структура("Организация, Район, Строение, Абонент, Дата, СписаниеНаЗабаланс, ИндексСтроки",
												Организация, Район, ТекДанные.Строение, ТекДанные.Абонент, ТекущаяДата(), Истина, ИндексСтроки);
	
	ОписаниеОповещения 					= Новый ОписаниеОповещения("ПодборЗадолженностиЗавершение", ЭтотОбъект, ПараметрыПодбора);
	ОткрытьФорму("Документ.энргБанкротство.Форма.ФормаПодбораЗадолженности", ПараметрыПодбора, Элементы.ДанныеСписания,,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗадолженностиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	ОбработатьВыбранныеСтрокиДанныеЗадолженности(РезультатЗакрытия, ДополнительныеПараметры);	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные 		= Элементы.Абоненты.ТекущиеДанные;
	ИндексСтроки 	= Абоненты.Индекс(ТекДанные);
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Абонент, ИндексСтроки", ТекДанные.Абонент, ИндексСтроки);	
	ОбработатьВыбранныеСтрокиДанныеЗадолженности(ВыбранноеЗначение, ДополнительныеПараметры);	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыбранныеСтрокиДанныеЗадолженности(РезультатЗакрытия, ДополнительныеПараметры) 
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСтроки  							= Новый ФиксированнаяСтруктура("Абонент, ПериодЗадолженности, Услуга, Поставщик");
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда 
		Для Каждого строка из РезультатЗакрытия цикл
			СтруктураПоиска 					= Новый Структура(ОписаниеСтроки);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, строка);
			СтруктураПоиска.Абонент = ДополнительныеПараметры.Абонент; 
			
			Строки  							= ДанныеСписания.НайтиСтроки(СтруктураПоиска);
			Если Строки.количество()  = 1 тогда
				СтрокаТЧ  						= Строки[0];
			иначе                                
				СтрокаТЧ  						= ДанныеСписания.Добавить(); 
			КонецЕсли; 			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, строка);
			СтрокаТЧ.Абонент = ДополнительныеПараметры.Абонент; 
		КонецЦикла;		
	иначе
		СтруктураПоиска 						= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, РезультатЗакрытия);
		СтруктураПоиска.Абонент = ДополнительныеПараметры.Абонент;
		
		Строки  								= ДанныеСписания.НайтиСтроки(СтруктураПоиска);
		Если Строки.количество()  = 1 тогда
			СтрокаТЧ  							= Строки[0];
		иначе                                
			СтрокаТЧ  							= ДанныеСписания.Добавить(); 
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, РезультатЗакрытия);
		СтрокаТЧ.Абонент = ДополнительныеПараметры.Абонент; 
	КонецЕсли; 
	
	ОбновитьСтрокуСОбщейСуммой(ДополнительныеПараметры.Абонент, ДополнительныеПараметры.ИндексСтроки);
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументов

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если НЕ СозданиеДокументовРазрешено() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	ДанныеШапки 		= Новый Структура("ДатаСозданияДокументов, Организация, Район", ДатаСозданияДокументов, Организация, Район);
	Результат 			= ПолучитьДанныеДляСозданияДокументов();
	
	ОбработкаОбъект 	= РеквизитФормыВЗначение("Объект");    
    РезультатСоздания 	= ОбработкаОбъект.СоздатьДокументыСписанияЗадолженности(ДанныеШапки, Результат);                    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	Если РезультатСоздания.Успешно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документы успешно созданы");
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании документа: " + РезультатСоздания.ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляСозданияДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокАбонентов.Абонент КАК Абонент,
		|	СписокАбонентов.КлючПомещения КАК КлючПомещения,
		|	СписокАбонентов.Строение КАК Строение
		|ПОМЕСТИТЬ ВТ_СписокАбонентов
		|ИЗ
		|	&СписокАбонентов КАК СписокАбонентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеСписания.Абонент КАК Абонент,
		|	ДанныеСписания.ПериодЗадолженности КАК ПериодЗадолженности,
		|	ДанныеСписания.Поставщик КАК Поставщик,
		|	ДанныеСписания.СуммаСписания КАК СуммаСписания,
		|	ДанныеСписания.Услуга КАК Услуга,
		|	ДанныеСписания.Причина КАК Причина
		|ПОМЕСТИТЬ ВТ_ДанныеСписания
		|ИЗ
		|	&ДанныеСписания КАК ДанныеСписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокАбонентов.Абонент КАК Абонент,
		|	ВТ_СписокАбонентов.Строение КАК Строение,
		|	ВТ_СписокАбонентов.КлючПомещения КАК КлючПомещения,
		|	ВТ_ДанныеСписания.ПериодЗадолженности КАК ПериодЗадолженности,
		|	ВТ_ДанныеСписания.Поставщик КАК Поставщик,
		|	ВТ_ДанныеСписания.СуммаСписания КАК СуммаСписания,
		|	ВТ_ДанныеСписания.Услуга КАК Услуга,
		|	ВТ_ДанныеСписания.Причина КАК Причина
		|ИЗ
		|	ВТ_СписокАбонентов КАК ВТ_СписокАбонентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСписания КАК ВТ_ДанныеСписания
		|		ПО ВТ_СписокАбонентов.Абонент = ВТ_ДанныеСписания.Абонент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Абонент,
		|	ПериодЗадолженности";
	
	Запрос.УстановитьПараметр("СписокАбонентов"	, Абоненты.Выгрузить());
	Запрос.УстановитьПараметр("ДанныеСписания"	, ДанныеСписания.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

&НаКлиенте
Функция СозданиеДокументовРазрешено()
	ТекстОшибки = "";
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстОшибки = "Не заполнена Организация" + Символы.ПС;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Район) Тогда
		ТекстОшибки = ТекстОшибки + "Не заполнен Район" + Символы.ПС;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаСозданияДокументов) Тогда
		ТекстОшибки = ТекстОшибки + "Не указана Дата создания документ" + Символы.ПС;
	КонецЕсли;
	
	Если НЕ ТекстОшибки = "" Тогда
		ПоказатьПредупреждение(, ТекстОшибки,, "Обязательные реквизиты");
	КонецЕсли;
	
	Возврат ТекстОшибки = "";
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоАбоненту(Абонент)	
	Элементы.ДанныеСписания.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Абонент", Абонент));
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокуСОбщейСуммой(Абонент, ИндексСтроки)	
	Абоненты[ИндексСтроки].ОбщаяСумма = ДанныеСписания.Выгрузить(Новый Структура("Абонент", Абонент)).Итог("СуммаСписания");	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиАбонентаИзДанныхСписания(Абонент)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ДанныеСписания, Новый Структура("Абонент", Абонент));
КонецПроцедуры

&НаСервере
Функция ЕстьАбонент(Абонент)	
	Возврат Абоненты.НайтиСтроки(Новый Структура("Абонент", Абонент)).Количество() > 1;	
КонецФункции 

#КонецОбласти

