#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеОбъекта() Экспорт 	
	Результат 		= Новый Структура;
	ЗаполнитьСвойстваОбъекта(Результат);	
	
	Возврат Результат; 	
КонецФункции

Процедура ЗаполнитьСвойстваОбъекта(Результат)
	СтандартныеРеквизитыПрибораУчета(Результат);
	
	Измерители 		= Новый ТаблицаЗначений;
	Измерители.Колонки.Добавить("Измеритель", Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));	
	Результат.Вставить("Измерители",					Измерители);
	Результат.Вставить("Ссылка", 						Справочники.энргПриборыУчетаАбонента.ПустаяСсылка());
КонецПроцедуры

Процедура СтандартныеРеквизитыПрибораУчета(СтруктураСвойств) Экспорт 
	СтруктураСвойств.Вставить("Код"							, ""); 
	СтруктураСвойств.Вставить("РегистрируетОбъем"			, Ложь);
	СтруктураСвойств.Вставить("ТипПрибораУчета"         	, Справочники.энргТипыПриборовУчета.ПустаяСсылка());
	СтруктураСвойств.Вставить("ТипУзлаУчета"				, Справочники.энргТипыУзловУчета.ПустаяСсылка());
	СтруктураСвойств.Вставить("ВидКанальности"         		, Справочники.энргВидыКанальности.ПустаяСсылка());
	СтруктураСвойств.Вставить("КодАСКУЭ"					, "");
	СтруктураСвойств.Вставить("СобственникАСКУЭ"			, Справочники.энргКонтрагенты.ПустаяСсылка());
	СтруктураСвойств.Вставить("СистемаУчетаЭлектроэнергии"	, Справочники.энргСистемыУчетаЭлектроэнергии.ПустаяСсылка());
	СтруктураСвойств.Вставить("ДатаИнтеграцииССистемой"		, Дата(1,1,1));
	СтруктураСвойств.Вставить("СобственникСИ"				, Перечисления.энргБалансоваяПринадлежность.ПустаяСсылка());
	СтруктураСвойств.Вставить("РасположениеИзмерителя"		, Справочники.энргРасположениеИзмерителей.ПустаяСсылка());
	СтруктураСвойств.Вставить("ДатаВыпуска"					, Дата(1,1,1));
	СтруктураСвойств.Вставить("Фаза"						, Перечисления.энргФазыТрансформатора.ПустаяСсылка());	
	СтруктураСвойств.Вставить("БалансоваяПринадлежность"	, Перечисления.энргБалансоваяПринадлежность.ПустаяСсылка());
	СтруктураСвойств.Вставить("ДатаУстановки"				, Дата(1,1,1));
КонецПроцедуры

#Область ЧтениеОписанияПрибораИзСтрокиJSON

Функция ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибораУчета) Экспорт 
	
	ДанныеУзлыУчета						= Новый Структура;
	УказатьЗаполняемыеСвойства(ДанныеУзлыУчета);
	
	Если ПустаяСтрока(ОписаниеПрибораУчета) Тогда
		Возврат ДанныеУзлыУчета;
	КонецЕсли;
		
	Чтение  							= Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ОписаниеПрибораУчета);		
	Описание							= ПрочитатьJSON(Чтение); 	
	
	ЗаполнитьСвойстваИзСтрокиJSON(Описание, ДанныеУзлыУчета);

	Возврат ДанныеУзлыУчета;
	
КонецФункции

Процедура УказатьЗаполняемыеСвойства(СтруктураСвойств)
	СтандартныеРеквизитыПрибораУчета(СтруктураСвойств);		
КонецПроцедуры

Процедура ЗаполнитьСвойстваИзСтрокиJSON(Описание, ДанныеУзлыУчета)
		
	Если Описание.Свойство("Код") тогда
		ДанныеУзлыУчета.Код 						= Описание.Код;
	КонецЕсли;
	
	Если Описание.Свойство("РегистрируетОбъем") И ЗначениеЗаполнено(Описание.РегистрируетОбъем) Тогда 
		ДанныеУзлыУчета.РегистрируетОбъем			= Булево(Описание.РегистрируетОбъем);			 	
	КонецЕсли;
	
	Если Описание.Свойство("ТипПрибораУчета") тогда
		ДанныеУзлыУчета.ТипПрибораУчета				= Справочники.энргТипыПриборовУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(Описание.ТипПрибораУчета));			 	
	КонецЕсли;
	
	Если Описание.Свойство("ТипУзлаУчета") тогда
		ДанныеУзлыУчета.ТипУзлаУчета				= Справочники.энргТипыУзловУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(Описание.ТипУзлаУчета));			 	
	КонецЕсли;
	
	Если Описание.Свойство("ВидКанальности") тогда
		ДанныеУзлыУчета.ВидКанальности				= Справочники.энргВидыКанальности.ПолучитьСсылку(Новый УникальныйИдентификатор(Описание.ВидКанальности));			 	
	КонецЕсли;
	
	Если Описание.Свойство("КодАСКУЭ") тогда
		ДанныеУзлыУчета.КодАСКУЭ 					= Описание.КодАСКУЭ;
	КонецЕсли; 	
	
	Если Описание.Свойство("СобственникАСКУЭ") тогда
		ДанныеУзлыУчета.СобственникАСКУЭ			= Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Описание.СобственникАСКУЭ));			 	
	КонецЕсли;
	
	Если Описание.Свойство("СистемаУчетаЭлектроэнергии") тогда
		ДанныеУзлыУчета.СистемаУчетаЭлектроэнергии	= Справочники.энргСистемыУчетаЭлектроэнергии.ПолучитьСсылку(Новый УникальныйИдентификатор(Описание.СистемаУчетаЭлектроэнергии));			 	
	КонецЕсли;
	
	Если Описание.Свойство("ДатаИнтеграцииССистемой") тогда
		ДанныеУзлыУчета.ДатаИнтеграцииССистемой		= Описание.ДатаИнтеграцииССистемой;			 	
	КонецЕсли;	
	
	Если Описание.Свойство("СобственникСИ") тогда
		ДанныеУзлыУчета.СобственникСИ				= Перечисления.энргБалансоваяПринадлежность[Описание.СобственникСИ];			 	
	КонецЕсли;
	
	Если Описание.Свойство("РасположениеИзмерителя") тогда
		ДанныеУзлыУчета.РасположениеИзмерителя		= Справочники.энргРасположениеИзмерителей.ПолучитьСсылку(Новый УникальныйИдентификатор(Описание.РасположениеИзмерителя));			 	
	КонецЕсли;
	
	Если Описание.Свойство("ДатаВыпуска") тогда
		ДанныеУзлыУчета.ДатаВыпуска					= Описание.ДатаВыпуска;			 	
	КонецЕсли;
	
	Если Описание.Свойство("Фаза") тогда
		ДанныеУзлыУчета.Фаза						= Перечисления.энргФазыТрансформатора[Описание.Фаза];			 	
	КонецЕсли;

	Если Описание.Свойство("БалансоваяПринадлежность") тогда
		ДанныеУзлыУчета.БалансоваяПринадлежность	= Перечисления.энргБалансоваяПринадлежность[Описание.БалансоваяПринадлежность];			 	
	КонецЕсли;
	
	Если Описание.Свойство("ДатаУстановки") тогда
		ДанныеУзлыУчета.ДатаУстановки				= Описание.ДатаУстановки;			 	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ЗаписьРеквизитовПрибораВСтрокуJSON

Функция ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета) Экспорт  
	Результат 								= "";
	
	ЕстьДанные  							= Ложь;
	Запись  								= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	Запись.ЗаписатьНачалоОбъекта();	
	ЗаполнитьСвойстваСтрокиJSON(Запись, ДанныеПрибораУчета, ЕстьДанные);
	Запись.ЗаписатьКонецОбъекта();
	
	Если ЕстьДанные Тогда
		Результат 	= Запись.Закрыть();
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСвойстваСтрокиJSON(Запись, ДанныеПрибораУчета, ЕстьДанные)
	Если ДанныеПрибораУчета.Свойство("Код") И ЗначениеЗаполнено(ДанныеПрибораУчета.Код) Тогда
		Запись.ЗаписатьИмяСвойства("Код");
		Запись.ЗаписатьЗначение(ДанныеПрибораУчета.Код);
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПрибораУчета,"РегистрируетОбъем") Тогда
			Запись.ЗаписатьИмяСвойства("РегистрируетОбъем");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.РегистрируетОбъем);
		КонецЕсли;
		ЕстьДанные 							= Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеПрибораУчета.ТипПрибораУчета) Тогда
		Запись.ЗаписатьИмяСвойства("ТипПрибораУчета");
		Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.ТипПрибораУчета.УникальныйИдентификатор());
		ЕстьДанные 							= Истина;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеПрибораУчета,"ТипУзлаУчета") И ЗначениеЗаполнено(ДанныеПрибораУчета.ТипУзлаУчета) Тогда
		Запись.ЗаписатьИмяСвойства("ТипУзлаУчета");
		Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.ТипУзлаУчета.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПрибораУчета.ТипПрибораУчета) И Не ЗначениеЗаполнено(ДанныеПрибораУчета.ВидКанальности)  Тогда
		Запись.ЗаписатьИмяСвойства("ВидКанальности");
		Запись.ЗаписатьЗначение("" + Справочники.энргВидыКанальности.Одноканальный.УникальныйИдентификатор());
		//ЕстьДанные 							= Истина;
	ИначеЕсли ЗначениеЗаполнено(ДанныеПрибораУчета.ТипПрибораУчета)Тогда
		Запись.ЗаписатьИмяСвойства("ВидКанальности");
		Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.ВидКанальности.УникальныйИдентификатор());
		//ЕстьДанные 							= Истина;
	ИначеЕсли ЗначениеЗаполнено(ДанныеПрибораУчета.ВидКанальности)И Не ЗначениеЗаполнено(ДанныеПрибораУчета.ТипПрибораУчета) Тогда 
		Запись.ЗаписатьИмяСвойства("ВидКанальности");
		Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.ВидКанальности.УникальныйИдентификатор());
		//ЕстьДанные 							= Истина;
	КонецЕсли;
	
	Если ЕстьДанные Тогда
		Если ДанныеПрибораУчета.свойство("КодАСКУЭ") И ЗначениеЗаполнено(ДанныеПрибораУчета.КодАСКУЭ) Тогда
			Запись.ЗаписатьИмяСвойства("КодАСКУЭ");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.КодАСКУЭ);
		КонецЕсли;			
		Если ДанныеПрибораУчета.свойство("СобственникАСКУЭ") И ЗначениеЗаполнено(ДанныеПрибораУчета.СобственникАСКУЭ) Тогда
			Запись.ЗаписатьИмяСвойства("СобственникАСКУЭ");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.СобственникАСКУЭ.УникальныйИдентификатор());
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("СистемаУчетаЭлектроэнергии") И ЗначениеЗаполнено(ДанныеПрибораУчета.СистемаУчетаЭлектроэнергии) Тогда
			Запись.ЗаписатьИмяСвойства("СистемаУчетаЭлектроэнергии");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.СистемаУчетаЭлектроэнергии.УникальныйИдентификатор());
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("ДатаИнтеграцииССистемой") И ЗначениеЗаполнено(ДанныеПрибораУчета.ДатаИнтеграцииССистемой) Тогда
			Запись.ЗаписатьИмяСвойства("ДатаИнтеграцииССистемой");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.ДатаИнтеграцииССистемой);
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("СобственникСИ") И ЗначениеЗаполнено(ДанныеПрибораУчета.СобственникСИ) Тогда
			Запись.ЗаписатьИмяСвойства("СобственникСИ");
			Запись.ЗаписатьЗначение(ОбработатьЗначениеПеречисления(ДанныеПрибораУчета.СобственникСИ));
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("РасположениеИзмерителя") И ЗначениеЗаполнено(ДанныеПрибораУчета.РасположениеИзмерителя) Тогда
			Запись.ЗаписатьИмяСвойства("РасположениеИзмерителя");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.РасположениеИзмерителя.УникальныйИдентификатор());
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("ДатаВыпуска") И ЗначениеЗаполнено(ДанныеПрибораУчета.ДатаВыпуска) Тогда
			Запись.ЗаписатьИмяСвойства("ДатаВыпуска");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.ДатаВыпуска);
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("Фаза") И ЗначениеЗаполнено(ДанныеПрибораУчета.Фаза) Тогда
			Запись.ЗаписатьИмяСвойства("Фаза");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.Фаза);
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("БалансоваяПринадлежность") И ЗначениеЗаполнено(ДанныеПрибораУчета.БалансоваяПринадлежность) Тогда
			Запись.ЗаписатьИмяСвойства("БалансоваяПринадлежность");
			Запись.ЗаписатьЗначение(ОбработатьЗначениеПеречисления(ДанныеПрибораУчета.БалансоваяПринадлежность));
		КонецЕсли;
		Если ДанныеПрибораУчета.свойство("ДатаУстановки") И ЗначениеЗаполнено(ДанныеПрибораУчета.ДатаУстановки) Тогда
			Запись.ЗаписатьИмяСвойства("ДатаУстановки");
			Запись.ЗаписатьЗначение("" + ДанныеПрибораУчета.ДатаУстановки);
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

Функция ОбработатьЗначениеПеречисления(ОбрабатываемоеПеречисление)
	Для каждого эл из ОбрабатываемоеПеречисление.Метаданные().ЗначенияПеречисления Цикл
		Если эл.Синоним = Строка(ОбрабатываемоеПеречисление) Тогда
			Возврат эл.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

#КонецОбласти

#Область ЧтениеДанныхПрибораУчета

Функция ЗначенияРеквизитовОбъектов(мПриборыУчета,ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргСтроения.ЗначенияСвойствОбъекта";
		ПараметрыМетода 			= Новый Структура("мПриборыУчета,ПолучаемыеСвойства", мПриборыУчета,ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");		
	КонецЕсли;
	
	Результат  						= Справочники.энргПриборыУчетаАбонента.ЗначенияРеквизитовОбъектов(мПриборыУчета,ПолучаемыеСвойства);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргПриборыУчетаАбонента.ЗначенияРеквизитовОбъектов";
		ПараметрыМетода 			= Новый Структура("мПриборыУчета, ПолучаемыеСвойства", мПриборыУчета, ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МежповерочныйИнтервал(ПриборУчета) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжПриборыУчетаАбонентаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжПриборыУчетаАбонентаМенеджер"].МежповерочныйИнтервал(ПриборУчета);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат = 0;
	энргРаботаСприборамиУчетаСервер.ЗаполнитьРезультатМежповерочныйИнтервалПоПриборуУчета(Результат, ПриборУчета);	
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ПриборыУчетаАбонентаМенеджер.МежповерочныйИнтервал";
		ПараметрыМетода 			= Новый Структура("ПриборУчета", ПриборУчета); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#Область ЗаписьДанныхПрибораУчета

Функция УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъекта, ЭтоНоваяСсылка) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжПриборыУчетаАбонентаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжПриборыУчетаАбонентаМенеджер"].УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъекта, ЭтоНоваяСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементСсылка 					= ОписаниеОбъекта.Ссылка;
	Результат 						= Справочники.энргПриборыУчетаАбонента.УдалосьЗаполнитьОбъектПоОписанию(ЭлементСсылка,ОписаниеОбъекта, ЭтоНоваяСсылка);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию";
		ПараметрыМетода 			= Новый Структура("ОписаниеОбъекта, ЭтоНоваяСсылка",ОписаниеОбъекта, ЭтоНоваяСсылка); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#КонецЕсли