#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем IDЭтапа, Подэтапы;
	
	Если Параметры.Свойство("Подэтапы", Подэтапы) Тогда
		Для каждого ТекСтрока Из Подэтапы Цикл
			СтрокаТЗ = ПодэтапыЗадачи.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("IDЭтапа", IDЭтапа) Тогда
		СтрокиТЧ = ПодэтапыЗадачи.НайтиСтроки(Новый Структура("IDЭтапа", IDЭтапа));
		                       
		Для каждого ТекСтрока Из СтрокиТЧ Цикл
			Элементы.ПодэтапыЗадачи.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовИКомандФормы

&НаКлиенте
Процедура ПодэтапыЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда = Неопределено)
	ТекСтрока = Элементы.ПодэтапыЗадачи.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		Закрыть(Новый Структура("IDЭтапа, Подэтап", ТекСтрока.IDЭтапа, ТекСтрока.Подэтап));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
