#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Отбор  = Параметры.отбор;
	Если Отбор.свойство("Ссылка") тогда
		ТипДокумента  				= Отбор.ссылка;
		СтандартнаяОбработка 		= Ложь;
		ДанныеВыбора 				= Новый СписокЗначений;
		МассивЗначений  			= Новый Массив;
		энргРаботаСВидамиОперацийСервер.ЗаполнитьСписокВозможныхОперацийФормаСписка(ТипДокумента,ДанныеВыбора);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
