#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить данные СНТ
//
// Параметры:
//  Период		 - Дата 
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности 
//  Абонент		 - СправочникСсылка.энргАбоненты 
// 
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса
//
Функция ПолучитьДанныеСНТ(Период, Организация, Район, Абонент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТочкиПоставкиСНТСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
		|	энргТочкиПоставкиСНТСрезПоследних.СНТДНТПривязан КАК СНТДНТПривязан,
		|	энргТочкиПоставкиСНТСрезПоследних.СНТДНТПотребление КАК СНТДНТПотребление
		|ИЗ
		|	РегистрСведений.энргТочкиПоставкиСНТ.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргТочкиПоставкиСНТСрезПоследних";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли