#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Не Параметры.свойство("Ключ") И Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("ТипСтроения")
			И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ТипСтроения)
			И Не Параметры.ЗначенияЗаполнения.ТипСтроения = Перечисления.энргТипыСтроений.МКД Тогда
			 СтандартнаяОбработка 	= Ложь;
			 ВыбраннаяФорма 		= "ФормаЭлемента";
			
		ИначеЕсли Не Параметры.свойство("Ключ") тогда
			СтандартнаяОбработка 	= Ложь;
			ВыбраннаяФорма 			= "ОбщаяФорма.энргФормаВыбораТипаСтроения";
			Параметры.вставить("ВыборОперации",Истина);			
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#Область ПрограммныйИнтерфейс

// Вызывается при переходе на версию конфигурации 2.1.3.16.
//
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииМногоквартирныеДома() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = "АдресДома";  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
	ПараметрыВида.Вид = "СтроительныйАдресДома";  	
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

// Формирует наименование.
//
// Параметры:
//  СтрокаJSON	-	Строка.
// 
// Возвращаемое значение:
//   Строка.
//
Функция СформироватьНаименование(СтрокаJSON) Экспорт 
	
	яНаименование 					= "";	
	Чтение 							= Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеАдреса  					= ПрочитатьJSON(Чтение);
	
	// город
	Если ДанныеАдреса.Свойство("city") И ЗначениеЗаполнено(ДанныеАдреса.city) Тогда 
		яНаименование	= яНаименование + ДанныеАдреса.city + " " + ДанныеАдреса.cityType + ", ";	
	КонецЕсли;
	
	// мкр
	Если ДанныеАдреса.Свойство("locality") И ЗначениеЗаполнено(ДанныеАдреса.locality) Тогда 
		яНаименование	= яНаименование + ДанныеАдреса.locality + " " + ДанныеАдреса.localityType + ", ";	
	КонецЕсли;
	
	// Тер
	Если ДанныеАдреса.Свойство("territory") И ЗначениеЗаполнено(ДанныеАдреса.territory) Тогда
		яНаименование	= яНаименование + ДанныеАдреса.territory + " " + ДанныеАдреса.territoryType + ", ";
	КонецЕсли;
	
	// улица
	Если ДанныеАдреса.Свойство("street") И ЗначениеЗаполнено(ДанныеАдреса.street) Тогда
		streettype 		= ?(ДанныеАдреса.Свойство("streettype"), ДанныеАдреса.streettype, "ул");
		яНаименование	= яНаименование + ДанныеАдреса.street + " " + streettype + ", ";
	КонецЕсли;
	
	// дом
	Если ДанныеАдреса.Свойство("houseNumber") И ЗначениеЗаполнено(ДанныеАдреса.houseNumber) Тогда
		яНаименование	= яНаименование + ДанныеАдреса.houseType + " " + "№ " +ДанныеАдреса.houseNumber + ", ";
	КонецЕсли;
	
	// корп
	Если ДанныеАдреса.Свойство("buildings") Тогда 
		Для Каждого Строка Из ДанныеАдреса.buildings Цикл
			Если ЗначениеЗаполнено(Строка.number) Тогда
				яНаименование	= яНаименование + Строка.type + " " + Строка.number + ", ";
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	// з/у
	Если ДанныеАдреса.Свойство("stead") И ЗначениеЗаполнено(ДанныеАдреса.stead) Тогда
		яНаименование	= яНаименование + "з/у " + ДанныеАдреса.stead + ", ";
	КонецЕсли;

	
	Возврат Лев(яНаименование,СтрДлина(яНаименование) - 2);
	
КонецФункции

#Область РеализацияИнтерфейса

// Формирует запрос для получение частных домов по представлению адресов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЧастныеДомаПоПредставлениюАдресов(Схема,ТаблицаДляПомещения = "") Экспорт 
		
	Текст = 
	"ВЫБРАТЬ
	|	энргСтроения.Ссылка КАК Строение,
	|	ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка) КАК Помещение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		энргСтроенияКонтактнаяИнформация.Ссылка КАК Строение
	|	ИЗ
	|		Адреса КАК Адреса
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|			ПО (энргСтроенияКонтактнаяИнформация.Представление ПОДОБНО Адреса.Представление + ""%"")) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|		ПО ВложенныйЗапрос.Строение = энргСтроения.Ссылка
	|			И (НЕ энргСтроения.ТипСтроения = ЗНАЧЕНИЕ(Перечисление.энргТипыСтроений.МКД))";
	
	Если Схема = Неопределено Тогда
		Схема = новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

// Получает значения свойств объекта.
//
// Параметры:
//  Строение			-	СправочникСсылка.
//  ПолучаемыеСвойства	-	Структура.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияСвойствОбъекта(Строение, ПолучаемыеСвойства) Экспорт 
		
	Результат 			= Новый Структура(ПолучаемыеСвойства); 	
	Схема  				= Новый СхемаЗапроса;
	Пакет 				= Схема.ПакетЗапросов[0];
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСвойстваСтроения());
	
	ПараметрыЗапроса  	= Новый Структура("Строение", Строение);
	
	РезультатЗапроса 	= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка 			= РезультатЗапроса.Выбрать();
		Выборка.следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли; 
		
	Возврат Результат; 	
	
КонецФункции

// Получает виды благоустройства и тарифные категории строения.
//
// Параметры:
//  Строение	-	СправочникСсылка.энргСтроения.
//  мВидыУслуг	-	Массив из СправочникСсылка.энргВидыУслуг.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ВидыБлагоустройстваТарифныеКатегорииСтроения(Строение,мВидыУслуг) Экспорт 
	
	Запрос  = Новый Запрос(ТекстЗапросаВидыБлагоустройстваТарифныеКатегорииСтроения());
	Запрос.УстановитьПараметр("Строение",		Строение);
	Запрос.УстановитьПараметр("мВидыУслуг",		мВидыУслуг);
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

// Получает процент ветхости строения.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Строение	-	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//   Число.
//
Функция ПолучитьПроцентВетхостиСтроения(Период, Организация, Район, Строение) Экспорт 
	ПроцентВетхости = 0;
	
	Схема 			= Неопределено;  	
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация")	, 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район")		, 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ЧастныйСектор", 	"ЧастныйСектор"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Строение", 		"Строение")		, 	Неопределено));
	
	Параметры 			= Новый Структура;	
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	Параметры.Вставить("Период"		, Новый Структура("ИмяПараметра", "Период"));

	РегистрыСведений.энргПроцентВетхостиСтроения.ПроцентВетхостиСтроения(Схема, Параметры);
	
	ПараметрыЗапроса  = Новый Структура;
	ПараметрыЗапроса.Вставить("Период",					Период);
	ПараметрыЗапроса.Вставить("Организация",			Организация);
	ПараметрыЗапроса.Вставить("Район",					Район);
	ПараметрыЗапроса.Вставить("ЧастныйСектор",			ЭтоЧастныйСектор(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строение, "ТипСтроения")));	
	ПараметрыЗапроса.Вставить("Строение",				Строение);
	
	Результат  		= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	Если Результат.Пустой() Тогда
		Возврат ПроцентВетхости;
	КонецЕсли;
	
	Выборка 		= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ПроцентВетхости = Выборка.Процент;
	КонецЕсли;
	
	Возврат ПроцентВетхости;
		
КонецФункции

Функция ЭтоЧастныйСектор(ТипСтроения) Экспорт 
	Возврат НЕ ТипСтроения = Перечисления.энргТипыСтроений.МКД;
КонецФункции
 
Функция ЗаполнитьМаршрут(МКД) Экспорт
		                             	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	энргМаршрутыКонтроллеровАдресаМаршрута.Представление КАК Представление,
	|	энргМаршрутыКонтроллеров.Ссылка КАК Маршрут,
	|	энргМаршрутыКонтроллеров.Владелец КАК Контроллер
	|ПОМЕСТИТЬ ВТ_Маршруты
	|ИЗ
	|	Справочник.энргМаршрутыКонтроллеров КАК энргМаршрутыКонтроллеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	|		ПО энргМаршрутыКонтроллеров.Ссылка = энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка
	|			И (НЕ энргМаршрутыКонтроллеров.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Маршруты.Маршрут КАК Маршрут,
	|	ВТ_Маршруты.Контроллер КАК Контроллер
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтроения.Ссылка КАК МКД,
	|		энргСтроенияКонтактнаяИнформация.Представление КАК Представление
	|	ИЗ
	|		Справочник.энргСтроения КАК энргСтроения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|			ПО энргСтроения.Ссылка = энргСтроенияКонтактнаяИнформация.Ссылка
	|				И (энргСтроения.Ссылка = &МКД)) КАК АдресМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Маршруты КАК ВТ_Маршруты
	|		ПО (АдресМКД.Представление ПОДОБНО ВТ_Маршруты.Представление + ""%"")";
	
	Запрос.УстановитьПараметр("МКД", МКД); 	
	
	Результат = Запрос.Выполнить();
	Возврат Результат;		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСвойстваСтроения()
	Текст  =
	"ВЫБРАТЬ
	|	энргСтроения.Бойлер КАК Бойлер,
	|	энргСтроения.ВидОбъектаАбонентов КАК ВидОбъектаАбонентов,
	|	энргСтроения.ГодПостройки КАК ГодПостройки,
	|	энргСтроения.ГруппаПотребителейПоУмолчанию КАК ГруппаПотребителейПоУмолчанию,
	|	энргСтроения.КоличествоЭтажей КАК КоличествоЭтажей,
	|	энргСтроения.ТипПлиты КАК ТипПлиты,
	|	ЕСТЬNULL(КонтактнаяИнформацияАдресДома.Представление, """") КАК АдресОбъекта,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформацияАдресДома.Значение, """") КАК СТРОКА(150))) = """"
	|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияАдресДома.ЗначенияПолей, """")
	|		ИНАЧЕ ЕСТЬNULL(КонтактнаяИнформацияАдресДома.Значение, """")
	|	КОНЕЦ КАК АдресОбъектаЗначение,
	|	ЕСТЬNULL(КонтактнаяИнформацияСтроительныйАдресДома.Представление, """") КАК АдресОбъектаСтроительный,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформацияСтроительныйАдресДома.Значение, """") КАК СТРОКА(150))) = """"
	|			ТОГДА ЕСТЬNULL(КонтактнаяИнформацияСтроительныйАдресДома.ЗначенияПолей, """")
	|		ИНАЧЕ ЕСТЬNULL(КонтактнаяИнформацияСтроительныйАдресДома.Значение, """")
	|	КОНЕЦ КАК АдресОбъектаСтроительныйЗначение,
	|	ЕСТЬNULL(энргИдентификаторыМКДГИСЖКХ.ОКТМО, """") КАК ОКТМО,
	|	энргСтроения.ТипСтроения КАК ТипСтроения,
	|	энргСтроения.МаршрутКонтроллера КАК МаршрутКонтроллера,
	|	энргСтроения.МаршрутКонтроллера.Владелец КАК Контролер
	|ИЗ
	|	Справочник.энргСтроения КАК энргСтроения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресДома
	|		ПО энргСтроения.Ссылка = КонтактнаяИнформацияАдресДома.Ссылка
	|			И (КонтактнаяИнформацияАдресДома.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдресДома.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))
	|			И (КонтактнаяИнформацияАдресДома.Ссылка = &Строение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК КонтактнаяИнформацияСтроительныйАдресДома
	|		ПО энргСтроения.Ссылка = КонтактнаяИнформацияСтроительныйАдресДома.Ссылка
	|			И (КонтактнаяИнформацияСтроительныйАдресДома.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияСтроительныйАдресДома.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СтроительныйАдресДома))
	|			И (КонтактнаяИнформацияСтроительныйАдресДома.Ссылка = &Строение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИдентификаторыМКДГИСЖКХ КАК энргИдентификаторыМКДГИСЖКХ
	|		ПО энргСтроения.Ссылка = энргИдентификаторыМКДГИСЖКХ.МКД
	|			И (энргИдентификаторыМКДГИСЖКХ.МКД = &Строение)
	|ГДЕ
	|	энргСтроения.Ссылка = &Строение";	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаВидыБлагоустройстваТарифныеКатегорииСтроения()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргСтроенияВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	энргСтроенияВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройстваИндивидуальный,
	|	энргСтроенияВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваОбщедомовой КАК ВидБлагоустройстваОбщедомовой,
	|	энргСтроенияВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	Справочник.энргСтроения.ВидыБлагоустройстваТарифныеКатегории КАК энргСтроенияВидыБлагоустройстваТарифныеКатегории
	|ГДЕ
	|	энргСтроенияВидыБлагоустройстваТарифныеКатегории.Ссылка = &Строение
	|	И энргСтроенияВидыБлагоустройстваТарифныеКатегории.Услуга В(&мВидыУслуг)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли