#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа и (НЕ ЗначениеЗаполнено(Наименование) или ДополнительныеСвойства.Свойство("ЗаполнитьНаименование")) Тогда
		ЗаполнитьНаименованиеСтроения();	
	КонецЕсли;	
		
	
	// проверяем данные ки если что то различается обновляем сопуствующие реквизиты
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргСтроения.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.энргСтроения КАК энргСтроения
	               |ГДЕ
	               |	энргСтроения.Наименование = &Наименование
	               |	И энргСтроения.Ссылка <> &Ссылка
	               |	И НЕ энргСтроения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Строение с таким наименованием уже существует: " + Наименование;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	ЭтоЧастныйСектор 	= Справочники.энргСтроения.ЭтоЧастныйСектор(ТипСтроения);//ТипСтроения = Перечисления.энргТипыСтроений.ЖД Или ТипСтроения = Перечисления.энргТипыСтроений.ЖД_БлокЗастройки;	
	КлючПомещенияСсылка = Неопределено;
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый Тогда 		
		КлючПомещенияСсылка = Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор);		
		Успешно 			= ЗарегистрироватьКлючПомещения(КлючПомещенияСсылка, ЭтоЧастныйСектор);
		Если НЕ Успешно Тогда 
			Возврат;
		КонецЕсли;
		
		СоздатьЭлементКлючПомещения(КлючПомещенияСсылка, ЭтоЧастныйСектор);
		
		ДополнительныеСвойства.Вставить("КлючПомещения", КлючПомещенияСсылка); 		
	КонецЕсли;
	
	Если КлючПомещенияСсылка = Неопределено Тогда 
		СтруктураОтвета 	= Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Ссылка, Справочники.энргПомещения.ПустаяСсылка());
		КлючПомещенияСсылка = СтруктураОтвета.КлючПомещения;
	КонецЕсли; 	
	
	ЗарегистрироватьКлючПомещенияВМаршрутеКонтролера(КлючПомещенияСсылка);	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	Индекс 				= ПроверяемыеРеквизиты.Найти("Наименование");
	Если НЕ Индекс = Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);
			КонецЕсли;	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЭтоГруппа Тогда
		энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьНаименованиеСтроения() Экспорт 
	яНаименование 		= "";	
	Коллекция 			= КонтактнаяИнформация;
	СтрокиКИ 			= Коллекция.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресДома));
	
	Если СтрокиКИ.Количество() > 0  Тогда
		яНаименование 	= Справочники.энргСтроения.СформироватьНаименование(СтрокиКИ[0].Значение);  
		Наименование 	= яНаименование;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) и не ЭтоНовый() Тогда
		Отказ 			= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните поле «Фактический адрес дома»"); 		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДанныеИзАдреса(ИмяСв) Экспорт   
	
	Тип		 = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес");
	Вид		 = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома");
	СтрокиКИ = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид", Тип, Вид));
		                                   
	Если СтрокиКИ.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Чтение 		 = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокиКИ[0].Значение);
	ДанныеАдреса = ПрочитатьJSON(Чтение);
	
	Если НЕ ДанныеАдреса.Свойство(ИмяСв) Тогда
		Возврат "";
	КонецЕсли;

	Возврат ДанныеАдреса[ИмяСв];
КонецФункции

Функция ЗарегистрироватьКлючПомещения(КлючПомещенияСсылка, ЧастныйСектор) Экспорт 
	Набор 							= РегистрыСведений.энргКлючиПомещений.СоздатьНаборЗаписей();
	Запись 							= Набор.Добавить();
	Запись.Строение 				= Ссылка;
	Запись.Помещение 				= Справочники.энргПомещения.ПустаяСсылка();
	Запись.КлючПомещения 			= КлючПомещенияСсылка;
	Запись.ЧастныйСектор 			= ЧастныйСектор;
	Попытка
		Набор.Записать(Ложь);
	Исключение
		ВызватьИсключение "Какой то текст";
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции                        

Процедура СоздатьЭлементКлючПомещения(КлючПомещенияСсылка, ЧастныйСектор) Экспорт
	КлючПомещенияОбъект 				= Справочники.энргКлючиПомещений.СоздатьЭлемент();
	КлючПомещенияОбъект.Строение 		= Ссылка;
	КлючПомещенияОбъект.Помещение 		= Справочники.энргПомещения.ПустаяСсылка();
	КлючПомещенияОбъект.ЧастныйСектор 	= ЧастныйСектор;
	КлючПомещенияОбъект.УстановитьСсылкуНового(КлючПомещенияСсылка);
	КлючПомещенияОбъект.Записать();
КонецПроцедуры

Процедура ЗарегистрироватьКлючПомещенияВМаршрутеКонтролера(КлючПомещенияСсылка)
	Если НЕ ЗначениеЗаполнено(МаршрутКонтроллера) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КлючПомещенияСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Обработки.энргМаршрутыКонтроллеровМенеджер.ЗарегистрироватьКлючПомещенияВМаршрутеКонтролера(МаршрутКонтроллера, КлючПомещенияСсылка);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли