#Область ОбработчикиСобытий
 
Процедура ПроверитьГраницыПериода(ДатаС, ДатаПо) экспорт
	Если не ЗначениеЗаполнено(ДатаПо) и ДатаПо<ДатаС тогда
		Врем=ДатаС;  ДатаС=ДатаПо;  ДатаПо=Врем;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьГраницыПериодаЗаМесяц(ДатаС, ДатаПо, ДатаОснование) экспорт
	ГлавнаяДата = ДобавитьМесяц(ДатаОснование, -1);
	ДатаС = НачалоМесяца(ГлавнаяДата);
	ДатаПо = КонецМесяца(ГлавнаяДата);
КонецПроцедуры

Процедура УстановитьПериод(НачалоПериода, КонецПериода) экспорт
	// ДиалогПериода = Новый НастройкаПериода();
	// ДиалогПериода.УстановитьПериод(НачалоПериода, КонецПериода);
	// Если ДиалогПериода.Редактировать() тогда
	//	НачалоПериода = ДиалогПериода.ПолучитьДатуНачала();
	//	КонецПериода = ДиалогПериода.ПолучитьДатуОкончания();
	// КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьСписокВыбораРайона(ЭлементФормы,ЗаполнятьРайон = ложь) Экспорт	
	СписокРайонов 				= энргОбщегоНазначенияСерверПовтИспол.СписокРайонов(); 
	ЭлементФормы.СписокВыбора = СписокРайонов;
	Если СписокРайонов.количество() = 1 тогда
		Если ЗаполнятьРайон тогда
			ЭлементФормы.Значение  = СписокРайонов[0].Значение;
			ЭлементФормы.толькоПросмотр= истина;
		КонецЕсли;
	КонецЕсли;	
КонецФункции

Процедура ПриИзмененииАбонента(Форма, ДопСвойства = Неопределено) Экспорт 
	
	Объект 					= Форма.Объект;
	ДанныеАбонента  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
	Если ЗначениеЗаполнено(ДопСвойства) Тогда
		Для каждого ДопСв Из ДопСвойства Цикл
			ДанныеАбонента.Вставить(ДопСв);
		КонецЦикла;
	КонецЕсли;

	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент,ДанныеАбонента);
	
	ДанныеАбонента.удалить("Абонент");
	Если Объект.свойство("ПериодНачисления") тогда
		ДанныеАбонента.вставить("ПериодНачисления",Объект.ПериодНачисления);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект,ДанныеАбонента);
	ЗаполнитьЗначенияСвойств(Форма,ДанныеАбонента);
	
КонецПроцедуры

Процедура ПриИзмененииАбонентаВТабличнойЧасти(ТекущиеДанныеСтрокиТабЧасти) Экспорт 

	ДанныеАбонента  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
	ДанныеАбонента.удалить("Абонент");
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(ТекущиеДанныеСтрокиТабЧасти.Абонент,ДанныеАбонента);
	ЗаполнитьЗначенияСвойств(ТекущиеДанныеСтрокиТабЧасти,ДанныеАбонента);
		
КонецПроцедуры

Процедура ПриИзмененииСтроенияПомещения(Форма, ПерезаполнятьРайон = Истина, ПерезаполнятьАбонента = Истина, ЗаполнитьКоличествоЖильцов = Ложь) Экспорт  
	Объект 					= Форма.Объект;
	Строение 				= Форма.Строение;
	Помещение 				= Форма.Помещение;
	ДанныеСтроения			= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(Строение,Помещение);
	Объект.КлючПомещения	= ДанныеСтроения.КлючПомещения;
	Если НЕ Объект.Район = ДанныеСтроения.Район и ПерезаполнятьРайон Тогда
		Объект.Район 		= ДанныеСтроения.Район;
	КонецЕсли;
	
	РеквизитАбонентСуществует = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Абонент");	
	Если РеквизитАбонентСуществует и ПерезаполнятьАбонента Тогда 
		Абонент = энргПользовательскийВводСервер.ПрочитатьАбонентаПомещения(Объект.КлючПомещения, ДанныеСтроения.Район, Объект.Организация, Объект.Дата);
		Объект.Абонент = Абонент;
	КонецЕсли;  	
	
	Если РеквизитАбонентСуществует и ЗаполнитьКоличествоЖильцов Тогда
		Если Не ЗначениеЗаполнено(Объект.Абонент) И ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			Объект.КоличествоЖильцов = энргПользовательскийВводСервер.ПрочитатьКоличествоЖильцовПомещения(Строение, Помещение, ДанныеСтроения.ЧастныйСектор, Объект.Организация, Объект.Район, Объект.ПериодНачисления);	
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДаполнения  		= Новый Структура("ЧастныйСектор", ДанныеСтроения.ЧастныйСектор);
	ЗаполнитьЗначенияСвойств(Форма, ДанныеДаполнения);
		
КонецПроцедуры

Процедура ПриИзмененииМКД(Объект) Экспорт 
	  ДанныеМКД  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияМКД();
	  Если Объект.свойство("ПериодНачисления") тогда
		  ДанныеМКД.вставить("ПериодНачисления",Объект.ПериодНачисления);
	  КонецЕсли;
	  энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыМКД(Объект.МКД,ДанныеМКД);
	  ЗаполнитьЗначенияСвойств(Объект,ДанныеМКД);

КонецПроцедуры

Процедура НачалоВыбораАбонента(Элемент,Организация,Район,Дом,СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт 
	СтандартнаяОбработка 	= ложь;	
	Отбор					= Новый Структура();
	ПараметрыВыбора  		= Новый Структура;
	Если ЗначениеЗаполнено(Организация) тогда
		Отбор.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Район) тогда
		Отбор.Вставить("Район",Район);
	КонецЕсли;
	Если ЗначениеЗаполнено(Дом) тогда
		Отбор.Вставить("Дом",Дом);
	КонецЕсли; 
	
	// ОТЭК, 21.05.2020, 000202897.
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		Если ДополнительныеПараметры.Свойство("Строение") Тогда
			Отбор.Вставить("Строение", ДополнительныеПараметры.Строение);	
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыВыбора.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.энргАбоненты.ФормаВыбора",ПараметрыВыбора,Элемент);
КонецПроцедуры

Процедура НачалоВыбораТочкиУчета(Элемент, ДополнительныеПараметры) Экспорт  
	ПараметрыВыбора 		= Новый Массив();
	Для Каждого КлючЗначение Из ДополнительныеПараметры Цикл
		Параметр 			= Новый ПараметрВыбора("Дополнительно." + КлючЗначение.Ключ, КлючЗначение.Значение);
		ПараметрыВыбора.Добавить(Параметр);
	КонецЦикла; 	
	мПараметры 				= Новый ФиксированныйМассив(ПараметрыВыбора);	
	Элемент.ПараметрыВыбора = мПараметры;	
КонецПроцедуры

Процедура СкрытьПоказатьПанельПоиска(Элементы, ИмяГруппыПоиска, ИмяКнопки) Экспорт
	Видимость 							= Элементы[ИмяГруппыПоиска].Видимость;
	Элементы[ИмяГруппыПоиска].Видимость = не Видимость;
	Элементы[ИмяКнопки].Заголовок = ?(не Видимость,"Скрыть панель поиска","Открыть панель поиска");	
КонецПроцедуры

Процедура УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы, ПостФиксКолонки = "", ТаблицыВторогоУровня = Неопределено, ПостФиксКолонкиВторогоУровня = "") Экспорт 
	СтруктураПоиска  				= Новый Структура("IDСтроки" + ПостФиксКолонки,IDСтроки);
	Для Каждого ТаблицаФормы из ТаблицыФормы цикл
		Коллекция  					= Объект[ТаблицаФормы];
		Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);	
		Для Каждого УдаляемаяСтрока из Строки Цикл 
			Если ТаблицыВторогоУровня <> Неопределено Тогда 
				СтруктураПоиска2  				= Новый Структура("IDСтроки" + ПостФиксКолонкиВторогоУровня, УдаляемаяСтрока.IDСтроки);
				Для Каждого ТаблицаФормы2 Из ТаблицыВторогоУровня Цикл
					Коллекция2  				= Объект[ТаблицаФормы2];
					Строки2  					= Коллекция2.НайтиСтроки(СтруктураПоиска2);	
					Для Каждого УдаляемаяСтрока2 из Строки2 Цикл 
						Коллекция2.Удалить(УдаляемаяСтрока2);
					КонецЦикла;
				КонецЦикла;			
			КонецЕсли;
			
			Коллекция.Удалить(УдаляемаяСтрока);
		КонецЦикла; 
	КонецЦикла;  
	
КонецПроцедуры

// ОТЭК, 21.05.2020, 000202897.
Процедура отэкНачалоВыбораСтроения(Элемент, Организация = Неопределено, Район = Неопределено, 
										СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	СтандартнаяОбработка 	= Ложь;	
	Отбор					= Новый Структура;
	ПараметрыВыбора  		= Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) тогда
		Отбор.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Район) тогда
		Отбор.Вставить("Район",Район);
	КонецЕсли;
	  	 
	ПараметрыВыбора.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.энргСтроения.ФормаВыбора",ПараметрыВыбора,Элемент,,,,,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Процедура отэкНачалоВыбораЖильца(Элемент, ЮрФизЛицо = Неопределено, 
									СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	СтандартнаяОбработка = Ложь;
	Отбор					= Новый Структура;
	ПараметрыВыбора  		= Новый Структура("Отбор", Отбор);

	Если ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Отбор.Вставить("ЮрФизЛицо", ЮрФизЛицо);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.энргКонтрагенты.ФормаВыбора", ПараметрыВыбора, Элемент,,,,, 
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти

#Область РаботаСФормой

Процедура АктивизироватьНачальнуюСтрокуТочекУчета(Объект, ЭлементыФормы, ПрефиксТочекУчета) Экспорт
	
	Если Объект.ТочкиУчета.Количество() > 0 Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ТочкиУчета" + ПрефиксТочекУчета);
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока = Объект.ТочкиУчета[0].ПолучитьИдентификатор();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти