#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс 

Функция РезультатПоставщикиСоставныхУслуг(Организация,Район,КлючПомещения,Период = '0001-01-01',ТочкиУчета = Неопределено) Экспорт 
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 	Организация);
	ПараметрыЗапроса.Вставить("Район", 			Район);
	ПараметрыЗапроса.Вставить("КлючПомещения", 	КлючПомещения);
	
	Схема 				= Новый СхемаЗапроса;
		
	ПараметрыВТ 		= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,КлючПомещения","Организация","Район","КлючПомещения")));
	Если Не ТочкиУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("ТочкаУчета","ТочкиУчета")));
		ПараметрыЗапроса.Вставить("ТочкиУчета", ТочкиУчета);
	КонецЕсли;	
	ПараметрыСхемы 		= Новый Структура;
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыЗапроса.Вставить("Период", Период);
		ПараметрыСхемы.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	КонецЕсли;
	РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиСоставнойУслуги(Схема,ПараметрыСхемы,"");
	
	Результат  			= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли