#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	ДанныеШапки = ДанныеШапки();
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьЗначениеПлощадиМКД(Движения, ДанныеШапки, "ЗначениеПлощадей");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

Функция ДанныеШапки()
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",				Дата);
	ДанныеШапки.Вставить("Район",				Район); 	
	ДанныеШапки.Вставить("Организация",			Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",	Дата);
	ДанныеШапки.Вставить("ПериодНачисления",	ПериодНачисления);
	ДанныеШапки.Вставить("МКД",					МКД);
	ДанныеШапки.Вставить("ЗначениеПлощадей",	ЗначениеПлощадей);
	
	Возврат ДанныеШапки;
	
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли