#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить объемы постоянного расхода
//
// Параметры:
//  СтруктураОтборов - Структура из элементов
//						- Период - Дата      
//						- Организация - СправочникСсылка.Организации
//						- Район - СправочникСсылка.энргЗоныОтвественности
//						- ОбъектРасчета - СправочникСсылка.бестОбъектыРасчета
//						- ТочкаУчета - СправочникСсылка.энргТочкиУчета
//						- Услуга - СправочникСсылка.энргВидыУслуг
//						- ТарифнаяЗона - СправочникСсылка.энргТарифныеЗоны
// 
// Возвращаемое значение:
//   - РезультатЗапроса
//
Функция ПолучитьОбъемыПостоянногоРасхода(СтруктураОтборов) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Организация КАК Организация,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Район КАК Район,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.МКД КАК МКД,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Услуга КАК Услуга,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Месяц КАК Месяц,
		|	бестОбъемыПостоянногоРасходаСрезПоследних.Объем КАК Объем
		|ИЗ
		|	РегистрСведений.бестОбъемыПостоянногоРасхода.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета
		|				И Услуга = &Услуга
		|				И ТарифнаяЗона = &ТарифнаяЗона) КАК бестОбъемыПостоянногоРасходаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", СтруктураОтборов.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", СтруктураОтборов.Организация);
	Запрос.УстановитьПараметр("Период", СтруктураОтборов.Период);
	Запрос.УстановитьПараметр("Район", СтруктураОтборов.Район);
	Запрос.УстановитьПараметр("ТарифнаяЗона", СтруктураОтборов.ТарифнаяЗона);
	Запрос.УстановитьПараметр("ТочкаУчета", СтруктураОтборов.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", СтруктураОтборов.Услуга);
	
	Возврат Запрос.Выполнить();
		
КонецФункции

#КонецОбласти

#КонецЕсли