#Область ПредопределенныеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргВводНачальныхОстатковМКД(ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;

	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереМКД(ЭтотОбъект, "Дома");	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета"); 	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	энргПользовательскийВводСервер.ЗаписатьПараметрыМКД(Объект.Дома, ТекущийОбъект);
	
	энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);
	 	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 		
		// создаем абонента
		энргРаботаСЛицевымСчетомСервер.ПроверитьИСоздатьМКДИзКоллекции(Объект,ТекущийОбъект,"Дома",отказ);
		
		// создаем или обновляем точку учета	
		СоотвествиеКолонок  	= Новый Структура;
		СоотвествиеКолонок.Вставить("Наименование",	"НаименованиеТочки");
		СоотвествиеКолонок.Вставить("Расположение",	"Расположение");
		СоотвествиеКолонок.Вставить("Головная",		"Головная");
		
		энргРаботаСТочкамиУчетаСервер.ПроверитьИСоздатьТочкиУчета(Объект,ТекущийОбъект,"ТочкиУчета",СоотвествиеКолонок);
		
		// создаем или обновляем прибор учета	 
		СоотвествиеКолонок  	= Новый Структура;
		СоотвествиеКолонок.Вставить("ЗаводскойНомер",		"ЗаводскойНомер");
		СоотвествиеКолонок.Вставить("ВидКанальности",		"ВидКанальности");
		СоотвествиеКолонок.Вставить("ТипПрибораУчета",		"ТипПрибораУчета");
		СоотвествиеКолонок.Вставить("ДатаВыпуска",			"ДатаВыпуска");
		СоотвествиеКолонок.Вставить("КоэффициентПУ",		"КоэффициентПУ");
		СоотвествиеКолонок.Вставить("ДатаПоверкиСчетчика",	"ДатаПоверкиСчетчика");
		СоотвествиеКолонок.Вставить("ПриборУчета",			"ПриборУчета"); 		
		
		энргРаботаСприборамиУчетаСервер.ПроверитьИСоздатьПриборы(Объект.ТочкиУчета, ТекущийОбъект.ТочкиУчета,СоотвествиеКолонок,Ложь,Отказ);		
	КонецЕсли;
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереМКД(ЭтотОбъект, "Дома");	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета"); 	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация); 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиДома

&НаКлиенте
Процедура ДомаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные  			= Элементы.Дома.ТекущиеДанные;
		ТекущиеДанные.IDСтроки 	= Новый УникальныйИдентификатор;
		УстановитьОтборСтрокПоМКД(ТекущиеДанные.IDСтроки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДомаПриАктивизацииСтроки(Элемент)
	ТекущиеДанные  = Элементы.Дома.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрокПоМКД(ТекущиеДанные.IDСтроки);	

КонецПроцедуры

&НаКлиенте
Процедура ДомаАдресОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные  = Элементы.Дома.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	СтандартнаяОбработка = Ложь;
	
	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
	
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",ТекущиеДанные.АдресОбъекта,ТекущиеДанные.АдресОбъектаПредставлениеПолей);
	
	ПараметрыФормыКонтактнойИнформации.Значение		 	= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	Оповещение 											= Новый ОписаниеОповещения("АдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  	ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", 	Истина);
	Оповещение.ДополнительныеПараметры.Вставить("КлючСтроки", 			Элементы.Дома.ТекущаяСтрока);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",          	Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      	ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         	Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             	ЭтаФорма);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура АдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 									= Объект.Дома.НайтиПоИдентификатору(ДополнительныеПараметры.КлючСтроки);	
	
	ТекущиеДанные.АдресОбъекта 						= РезультатЗакрытия.Представление;
	ТекущиеДанные.АдресОбъектаПредставлениеПолей 	= РезультатЗакрытия.КонтактнаяИнформация;  	
		
КонецПроцедуры

&НаКлиенте
Процедура ДомаПередУдалением(Элемент, Отказ)
	ТекущиеДанные	= Элементы.Дома.ТекущиеДанные;
	
	ТаблицыФормы	= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	СтруктураПоиска	= Новый Структура("IDСтрокиМКД",ТекущиеДанные.IDСтроки);
	Строки 			= Объект.ТочкиУчета.НайтиСтроки(СтруктураПоиска);	
	Для Каждого УдаляемаяСтрокаТочкиУчета из Строки Цикл 
		// энргРаботаСПоставщиками {
		энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,УдаляемаяСтрокаТочкиУчета);
		// энргРаботаСПоставщиками }
		
		энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(УдаляемаяСтрокаТочкиУчета.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
		
		Объект.ТочкиУчета.Удалить(УдаляемаяСтрокаТочкиУчета);
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиЗначенияПлощадей

&НаКлиенте
Процедура ЗначениеПлощадейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные  				= Элементы.ЗначениеПлощадей.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиМКД	= Элементы.ЗначениеПлощадей.ОтборСтрок.IDСтрокиМКД;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТаблицаФормыШкал 						= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 							= ТаблицаФормыТочки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОтборСтрок							= Новый ФиксированнаяСтруктура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки);	
	ТаблицаФормыШкал.ОтборСтрок 		= ОтборСтрок;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТаблицаФормыТочки 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета];		
		ТекущиеДанные 					= ТаблицаФормыТочки.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиМКД	 	= ТаблицаФормыТочки.ОтборСтрок.IDСтрокиМКД;
		ТекущиеДанные.IDСтроки 			= Новый УникальныйИдентификатор;
		
		Если ИспользоватьШкалыПриборовУчета Тогда
			ТаблицаФормыШкал 				= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета];
			ТаблицаФормыШкал.ОтборСтрок 	= Новый ФиксированнаяСтруктура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 							= ТаблицаФормыТочки.ТекущиеДанные;
	
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	ТаблицыФормы	= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);

	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыУслуг");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 							= ТаблицаФормыТочки.ТекущиеДанные;
	
	ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 							= ТаблицаФормыТочки.ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками } 
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 							= ТаблицаФормыТочки.ТекущиеДанные;
	// энргРаботаСПоставщиками {
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры


&НаКлиенте
Процедура ТочкиУчетаВидКанальностиПриИзменении(Элемент)	
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 							= ТаблицаФормыТочки.ТекущиеДанные;
	
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	ТаблицаФормыШкал 				= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета];
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки);
		
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ТаблицаФормыТочек 			= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 				= ТаблицаФормыТочек.ТекущиеДанные;
	ВидДифференцированности 	= ТекущиеДанные.ВидДифференцированности;
	Состав 						= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиШкалы,Состав,"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаРасположениеПриИзменении(Элемент)
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 							= ТаблицаФормыТочки.ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиШкалыПриборовУчета

&НаКлиенте
Процедура ШкалыПриборовУчетаПриАктивизацииСтроки(Элемент)
	ТаблицаФормыШкал 				= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета];
	ТаблицаФормыПоказаний			= Элементы["ПоказанияПриборовУчета" + ПрефиксТочекУчета];
	ТекущиеДанные  					= ТаблицаФормыШкал.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
		
	ОтборСтрок								= Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);	
	ТаблицаФормыПоказаний.ОтборСтрок 		= ОтборСтрок;

КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Или Копирование Тогда
		ТаблицаФормыШкал	 			= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета];
		ТекущиеДанные 					= ТаблицаФормыШкал.ТекущиеДанные;
		ТекущиеДанные.IDСтроки 			= ТаблицаФормыШкал.ОтборСтрок.IDСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаВидДифференцированностиПриИзменении(Элемент)
	ТаблицаФормыШкал 			= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 				= ТаблицаФормыШкал.ТекущиеДанные;
	ВидДифференцированности 	= ТекущиеДанные.ВидДифференцированности;
	Состав 						= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтроки,Состав,"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Или Копирование Тогда
		ТаблицаФормыПоказаний 			= Элементы["ПоказанияПриборовУчета" + ПрефиксТочекУчета];
		ТекущиеДанные 					= ТаблицаФормыПоказаний.ТекущиеДанные;
		ТекущиеДанные.IDСтроки 			= ТаблицаФормыПоказаний.ОтборСтрок.IDСтроки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборСтрокПоМКД(IDСтроки)
	 	
	ОтборСтрок								= Новый ФиксированнаяСтруктура("IDСтрокиМКД", IDСтроки);
	
	ТаблицаФормыТочки 						= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	
	Элементы.ЗначениеПлощадей.ОтборСтрок 	= ОтборСтрок;
	ТаблицаФормыТочки.ОтборСтрок 			= ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование(ТекДанные)
	Если ТекДанные.Головная Тогда 
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга + "_Головная";
	Иначе
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга;
	КонецЕсли;
КонецПроцедуры

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти