#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Организация, Район, Строение, Абонент, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец;  
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргБанкротство(ЭтотОбъект);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ОпределитьПериодНачисления();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПараметрыСудебныеЗаседания();
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("Организация", Организация) Тогда
			Объект.Организация = Организация;
		КонецЕсли;
		Если Параметры.Свойство("Район", Район) Тогда
			Объект.Район = Район;
		КонецЕсли;
		Если Параметры.Свойство("Строение", Строение) Тогда
			Объект.Строение = Строение;
		КонецЕсли;
		Если Параметры.Свойство("Абонент", Абонент) Тогда
			Объект.Абонент = Абонент;
			Объект.Дата = ТекущаяДатаСеанса();
			Параметры.Свойство("ПериодЗадолженностиНачало", ПериодЗадолженностиНачало);
			Параметры.Свойство("ПериодЗадолженностиКонец", ПериодЗадолженностиКонец);
			РезультатЗапроса = Документы.энргБанкротство.ПолучитьЗадолженность(Объект, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец);
			Объект.ДанныеСписания.Загрузить(РезультатЗапроса.Выгрузить());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьПараметрыСудебныеЗаседания();
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.Организация	= Неопределено;
		Объект.Район		= Неопределено;
		Объект.Строение		= Неопределено;
		Объект.ДанныеСписания.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ОпределитьПериодНачисления();
	КонецЕсли;
КонецПроцедуры

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ПодборЗадолженностиЗавершение(РезультатЗакрытия,ДополнительныеПараметры) Экспорт 
	   ОбработатьВыбранныеСтрокиДанныеЗадолженности(РезультатЗакрытия);	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	 ОбработатьВыбранныеСтрокиДанныеЗадолженности(ВыбранноеЗначение);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбранныеСтрокиДанныеЗадолженности(РезультатЗакрытия) 
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСтроки  							= Новый ФиксированнаяСтруктура("ПериодЗадолженности,Услуга,Поставщик");
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") тогда
		для Каждого строка из РезультатЗакрытия цикл
			СтруктураПоиска 					= Новый Структура(ОписаниеСтроки);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, строка);
			Строки  							= Объект.ДанныеСписания.НайтиСтроки(СтруктураПоиска);
			Если Строки.количество()  = 1 тогда
				СтрокаТЧ  						= Строки[0];
			иначе                                
				СтрокаТЧ  						= Объект.ДанныеСписания.Добавить(); 
			КонецЕсли; 			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, строка);
		КонецЦикла;		
	иначе
		СтруктураПоиска 						= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, РезультатЗакрытия);
		Строки  								= Объект.ДанныеСписания.НайтиСтроки(СтруктураПоиска);
		Если Строки.количество()  = 1 тогда
			СтрокаТЧ  							= Строки[0];
		иначе                                
			СтрокаТЧ  							= Объект.ДанныеСписания.Добавить(); 
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,РезультатЗакрытия);
	КонецЕсли;  	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСудебныеЗаседания()
	ПолеДело = Новый ПолеКомпоновкиДанных("Дело");
	Для каждого ТекЭлем Из СудебныеЗаседания.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекЭлем.ЛевоеЗначение = ПолеДело Тогда
			ТекЭлем.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОпределитьПериодНачисления()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры	

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуПодбораСписаниеЗадолженности(Команда) 	
	ПараметрыПодбора  					= Новый Структура("Организация, Район, Строение, Абонент, Дата, СписаниеНаЗабаланс");
	ЗаполнитьЗначенияСвойств(ПараметрыПодбора, Объект);
	ПараметрыПодбора.СписаниеНаЗабаланс = Истина;
	ОписаниеОповещения 					= Новый ОписаниеОповещения("ПодборЗадолженностиЗавершение",ЭтотОбъект);
	ОткрытьФорму("Документ.энргБанкротство.Форма.ФормаПодбораЗадолженности",ПараметрыПодбора,Элементы.ДанныеСписания,,,,ОписаниеОповещения);
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

