#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ТекГод = Год(Дата);
	Движения.бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемов.Записывать = Истина;
	
	Для Сч = 1 По 12 Цикл
		ДатаМесяц = Дата(ТекГод, Сч, 1);
		Месяц = Формат(ДатаМесяц, "ДФ=ММММ");
		
		Движение = Движения.бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемов.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
		Движение.Период = Дата;
		Движение.Месяц  = ДатаМесяц;
		Движение.Температура = ЭтотОбъект[Месяц];
	КонецЦикла;
	
	Движения.бестСредегодоваяРазницаТемпературДляДоговорныхОбъемов.Записывать = Истина;
	
	Движение = Движения.бестСредегодоваяРазницаТемпературДляДоговорныхОбъемов.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ЭтотОбъект);
	Движение.Период = Дата;
	Движение.Температура = СредегодоваяРазницаТемператур;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли