#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Если Сервер Тогда
	
// Процедура - Роли пользователей
//
// Параметры:
//  Схема				 - СхемаЗапроса - Схема запроса. 
//  ПараметрыОтбора		 - Структура 	- Параметры отбора.  
//  ТаблицаДляПомещения	 - Строка 		- Имя таблицы помещения. 
//
Процедура РолиПользователей(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеПомещения());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Пользователь, Роль, Организация, Район";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргРолиПользователей", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаДанныеПомещения()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргРолиПользователей.Пользователь КАК Пользователь,
	|	энргРолиПользователей.Роль КАК Роль,
	|	энргРолиПользователей.Организация КАК Организация,
	|	энргРолиПользователей.Район КАК Район
	|ИЗ
	|	РегистрСведений.энргРолиПользователей КАК энргРолиПользователей";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли