
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура ЗначенияТарифовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначенияТарифовВыборНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбор(Команда)
	ЗначенияТарифовВыборНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗначенияТарифовВыборНаСервере()
	Строки = Элементы.ЗначенияТарифов.ВыделенныеСтроки;
	Тариф = Элементы.ЗначенияТарифов.ДанныеСтроки(Строки[0]).Значение;
	ОповеститьОВыборе(Тариф);
КонецПроцедуры

#КонецОбласти
