#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойства массив помещений.
// 
// Возвращаемое значение:
//   Массив.
//
Процедура  МассивПомещений() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргСоглашениеОПотребленииВПомещении.Организация КАК Организация,
	|	энргСоглашениеОПотребленииВПомещении.Район КАК Район,
	|	энргСоглашениеОПотребленииВПомещении.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаАбонентов.КлючПомещения КАК КлючПомещения,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСоглашениеОПотребленииВПомещении.Дата КАК ПериодРегистрации
	|ИЗ
	|	Документ.энргСоглашениеОПотребленииВПомещении.Абоненты КАК ТаблицаАбонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ТаблицаАбонентов.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСоглашениеОПотребленииВПомещении КАК энргСоглашениеОПотребленииВПомещении
	|		ПО ТаблицаАбонентов.Ссылка = энргСоглашениеОПотребленииВПомещении.Ссылка
	|ГДЕ
	|	ТаблицаАбонентов.Ссылка = &Ссылка" ;
	
	ДополнительныеСвойства.Вставить("МассивПомещений",Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого стр из Абоненты Цикл 
		Если стр.СпособРаспределения = ПредопределенноеЗначение("Перечисление.энргСпособыРаспределенияОбъема.Остаток")
			И Не ЗначениеЗаполнено(стр.КоэффициентРаспределенияОстатка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Коэфициент не может быть пустым");
			Отказ		= Истина; 
		КонецЕсли; 		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",Истина);
	//ДополнительныеСвойства.Вставить("МассивПомещений",	 МассивПомещений());
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
			
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
		
	ДанныеШапки = ДанныеШапки();
	
	энргРаботаСТочкамиУчетаСервер.УстановитьСпособРаспределенияОбъемаПомещения(ДанныеШапки,Движения,"Абоненты");
	энргРаботаСТочкамиУчетаСервер.УстановитьКоэффициентыРаспределенияОстатка(ДанныеШапки,Движения,"Абоненты");
	энргРаботаСТочкамиУчетаСервер.УстановитьСпособФиксированныйОбъемРазделенныхЛС(ДанныеШапки,Движения);
	энргРаботаСТочкамиУчетаСервер.УстановитьДолиПотребленияРазделенныхЛС(ДанныеШапки,Движения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Услуга",					Услуга);
	ДанныеШапки.Вставить("Абоненты",				Абоненты);
	ДанныеШапки.Вставить("Документ",				Ссылка);
	Возврат ДанныеШапки;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли