#Область События_Формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестИзменитьТарифНаПередачуЭлектроэнергии(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСНезависимымСбытом.ДополнительныеПараметрыЗаписиДатыИзменения(ТекущийОбъект, ЭтотОбъект.Модифицированность, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область События_Шапки 

#КонецОбласти
