
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументСсылка 		= Параметры.ДокументСсылка;	
	ДанныеДокумента 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,"Организация,Коэффициент");
	Организация 		= ДанныеДокумента.Организация;
	Коэффициент 		= ДанныеДокумента.Коэффициент;
		
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьСервер();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьСервер()
	
	ДанныеРасчета.Очистить();
	
	НовыйНаборВзаиморасчетыПоПени 	= Обработки.энргКалькуляторНачисленияПени.ПересчитатьСДатыПоследнегоИзменения(Организация,Район,ПериодНачисления,Коэффициент);
	
	Для Каждого СтрокаНабора Из НовыйНаборВзаиморасчетыПоПени Цикл
		СтрокаТаблицы 				= ДанныеРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтрокаНабора );
		СтрокаТаблицы.СуммаСтало 	= СтрокаНабора.Сумма;
	КонецЦикла; 	
	
	НовыйНаборВзаиморасчетыПоБыло 	= Обработки.энргКалькуляторНачисленияПени.ПрочитатьУжеНачисленнуюПеню(Организация,Район, ПериодНачисления, НовыйНаборВзаиморасчетыПоПени);
	КлючПоиска 						= "Район,МКД,Абонент,Услуга,ПериодНачисления";
	Для Каждого СтрокаНабора Из НовыйНаборВзаиморасчетыПоБыло Цикл
		ДанныеПоиска 				= Новый Структура(КлючПоиска);
		ЗаполнитьЗначенияСвойств(ДанныеПоиска,СтрокаНабора);
		Строки 						= ДанныеРасчета.НайтиСтроки(ДанныеПоиска);
		Если Строки.Количество() = 0 Тогда
			СтрокаТаблицы 				= ДанныеРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтрокаНабора );
			СтрокаТаблицы.СуммаБыло 	= СтрокаНабора.Сумма;
		ИначеЕсли Строки.Количество() = 1 Тогда
			Строки[0].СуммаБыло 		= СтрокаНабора.Сумма;
		Иначе
			 // Что то пошло не так
		КонецЕсли;		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

