#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестНачислениеЭлектроэнергии") Тогда
		НачисленныйСреднийОбъем 			= РегистрыНакопления.бестНачисленныйСреднийОбъемЭЭ.СоздатьНаборЗаписей();
		НачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		
		Результат = РезультатЗапросаНачисленныйСреднийОбъемЭЭ(ЭтотОбъект.Выгрузить());
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаписьНачисленныйСредний 		= НачисленныйСреднийОбъем.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(ЗаписьНачисленныйСредний, Выборка);
		КонецЦикла;
		НачисленныйСреднийОбъем.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатЗапросаНачисленныйСреднийОбъемЭЭ(НачисленныйОбъемЭЭ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачисленныйОбъемЭЭ.Период КАК Период,
	               |	НачисленныйОбъемЭЭ.Регистратор КАК Регистратор,
	               |	НачисленныйОбъемЭЭ.НомерСтроки КАК НомерСтроки,
	               |	НачисленныйОбъемЭЭ.Активность КАК Активность,
	               |	НачисленныйОбъемЭЭ.Организация КАК Организация,
	               |	НачисленныйОбъемЭЭ.Район КАК Район,
	               |	НачисленныйОбъемЭЭ.МКД КАК МКД,
	               |	НачисленныйОбъемЭЭ.СпособНачисления КАК СпособНачисления,
	               |	НачисленныйОбъемЭЭ.ПериодНачисления КАК ПериодНачисления,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета КАК ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.ТочкаУчета КАК ТочкаУчета,
	               |	НачисленныйОбъемЭЭ.Услуга КАК Услуга,
	               |	НачисленныйОбъемЭЭ.Поставщик КАК Поставщик,
	               |	НачисленныйОбъемЭЭ.Договор КАК Договор,
	               |	НачисленныйОбъемЭЭ.ПриборУчета КАК ПриборУчета,
	               |	НачисленныйОбъемЭЭ.Шкала КАК Шкала,
	               |	НачисленныйОбъемЭЭ.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	НачисленныйОбъемЭЭ.ОтклонениеОтПлана КАК ОтклонениеОтПлана,
	               |	НачисленныйОбъемЭЭ.ОбъемУслуги КАК ОбъемУслуги,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешенная КАК СуммаСредневзвешенная,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавку КАК СуммаЗаСбытовуюНадбавку,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачи КАК СуммаЗаУслугиПоПередачи,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслуги КАК СуммаЗаИныеУслуги,
	               |	НачисленныйОбъемЭЭ.Сумма КАК Сумма,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешеннаяНДС КАК СуммаСредневзвешеннаяНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавкуНДС КАК СуммаЗаСбытовуюНадбавкуНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачиНДС КАК СуммаЗаУслугиПоПередачиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслугиНДС КАК СуммаЗаИныеУслугиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаНДС КАК СуммаНДС,
	               |	НачисленныйОбъемЭЭ.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	               |	НачисленныйОбъемЭЭ.ЦеноваяКатегория КАК ЦеноваяКатегория
	               |ПОМЕСТИТЬ НачисленныйОбъемЭЭ
	               |ИЗ
	               |	&НачисленныйОбъемЭЭ КАК НачисленныйОбъемЭЭ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НачисленныйОбъемЭЭ.Организация КАК Организация,
	               |	НачисленныйОбъемЭЭ.Район КАК Район,
	               |	НачисленныйОбъемЭЭ.МКД КАК МКД,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета КАК ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.ТочкаУчета КАК ТочкаУчета,
	               |	МАКСИМУМ(НачисленныйОбъемЭЭ.ПовышающийКоэффициент) КАК ПовышающийКоэффициент
	               |ПОМЕСТИТЬ МаксимальныйПовышающийКоэффициент
	               |ИЗ
	               |	НачисленныйОбъемЭЭ КАК НачисленныйОбъемЭЭ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НачисленныйОбъемЭЭ.ТочкаУчета,
	               |	НачисленныйОбъемЭЭ.МКД,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.Организация,
	               |	НачисленныйОбъемЭЭ.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НачисленныйОбъемЭЭ.Период КАК Период,
	               |	НачисленныйОбъемЭЭ.Регистратор КАК Регистратор,
	               |	НачисленныйОбъемЭЭ.НомерСтроки КАК НомерСтроки,
	               |	НачисленныйОбъемЭЭ.Активность КАК Активность,
	               |	НачисленныйОбъемЭЭ.Организация КАК Организация,
	               |	НачисленныйОбъемЭЭ.Район КАК Район,
	               |	НачисленныйОбъемЭЭ.МКД КАК МКД,
	               |	НачисленныйОбъемЭЭ.СпособНачисления КАК СпособНачисления,
	               |	НачисленныйОбъемЭЭ.ПериодНачисления КАК ПериодНачисления,
	               |	НачисленныйОбъемЭЭ.ОбъектРасчета КАК ОбъектРасчета,
	               |	НачисленныйОбъемЭЭ.ТочкаУчета КАК ТочкаУчета,
	               |	НачисленныйОбъемЭЭ.Услуга КАК Услуга,
	               |	НачисленныйОбъемЭЭ.Поставщик КАК Поставщик,
	               |	НачисленныйОбъемЭЭ.Договор КАК Договор,
	               |	НачисленныйОбъемЭЭ.ПриборУчета КАК ПриборУчета,
	               |	НачисленныйОбъемЭЭ.Шкала КАК Шкала,
	               |	НачисленныйОбъемЭЭ.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	НачисленныйОбъемЭЭ.ОтклонениеОтПлана КАК ОтклонениеОтПлана,
	               |	НачисленныйОбъемЭЭ.ОбъемУслуги КАК ОбъемУслуги,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешенная КАК СуммаСредневзвешенная,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавку КАК СуммаЗаСбытовуюНадбавку,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачи КАК СуммаЗаУслугиПоПередачи,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслуги КАК СуммаЗаИныеУслуги,
	               |	НачисленныйОбъемЭЭ.Сумма КАК Сумма,
	               |	НачисленныйОбъемЭЭ.СуммаСредневзвешеннаяНДС КАК СуммаСредневзвешеннаяНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаСбытовуюНадбавкуНДС КАК СуммаЗаСбытовуюНадбавкуНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаУслугиПоПередачиНДС КАК СуммаЗаУслугиПоПередачиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаЗаИныеУслугиНДС КАК СуммаЗаИныеУслугиНДС,
	               |	НачисленныйОбъемЭЭ.СуммаНДС КАК СуммаНДС
	               |ИЗ
	               |	НачисленныйОбъемЭЭ КАК НачисленныйОбъемЭЭ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПовышающийКоэффициент КАК МаксимальныйПовышающийКоэффициент
	               |		ПО НачисленныйОбъемЭЭ.Организация = МаксимальныйПовышающийКоэффициент.Организация
	               |			И НачисленныйОбъемЭЭ.Район = МаксимальныйПовышающийКоэффициент.Район
	               |			И НачисленныйОбъемЭЭ.МКД = МаксимальныйПовышающийКоэффициент.МКД
	               |			И НачисленныйОбъемЭЭ.ОбъектРасчета = МаксимальныйПовышающийКоэффициент.ОбъектРасчета
	               |			И НачисленныйОбъемЭЭ.ТочкаУчета = МаксимальныйПовышающийКоэффициент.ТочкаУчета
	               |ГДЕ
	               |	((НачисленныйОбъемЭЭ.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ЗамещениеИнформации)
	               |				ИЛИ НачисленныйОбъемЭЭ.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему))
	               |				И (НачисленныйОбъемЭЭ.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
	               |					ИЛИ НачисленныйОбъемЭЭ.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
	               |					ИЛИ НачисленныйОбъемЭЭ.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население))
	               |			ИЛИ НачисленныйОбъемЭЭ.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ОтАктивнойЭнергии))
	               |			И НачисленныйОбъемЭЭ.ОбъемУслуги <> 0
	               |			И МаксимальныйПовышающийКоэффициент.ПовышающийКоэффициент = 0";
	
	Запрос.УстановитьПараметр("НачисленныйОбъемЭЭ", НачисленныйОбъемЭЭ);
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти