#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 		= Пользователи.ТекущийПользователь();
		
	ДанныеОплаты 		= Новый Структура("СуммаОплаты,ЭтоОплата,ПериодОплатыНачало,Услуга",0,Ложь,ПериодНачисления,Справочники.энргВидыУслуг.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ДанныеОплаты",ДанныеОплаты);
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	// ПараметрыПроведения = Новый Структура("ПериодНачисления,Район,МКД,
	// Абонент,ДанныеОплаты",ПериодНачисления,Район,МКД,Абонент,ДанныеОплаты);
	
	// ДополнительныеСвойства.вставить("ПараметрыПроведения",ПараметрыПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	УвеличитьЗадолженностьАбонента();
	УвеличитьОбъемПотребления();
КонецПроцедуры

Процедура УвеличитьЗадолженностьАбонента()
	
	Запись  		= Движения.энргВзаиморасчеты.ДобавитьПриход();
	Запись.Период 	= Дата;
	Запись.Район 	= Район;
	Запись.МКД	 	= МКД;
	Запись.Абонент	= Абонент;
	Запись.Сумма	= Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура УвеличитьОбъемПотребления()
	
	Набор  						= Движения.энргОбъемНачислений;
	ВидНачисления 				= Перечисления.энргВидыНачислений.Начисление;
	РазовоеНачисления  			= Перечисления.энргСпособНачислений.РазовоеНачисления;
	для Каждого стр из Услуги цикл
		Запись  				= Набор.Добавить();
		Запись.Период 			= Дата;
		Запись.Район 			= Район;
		Запись.МКД 				= МКД;
		Запись.Абонент			= Абонент;
		Запись.Услуга			= стр.Услуга;
		Запись.ВидНачисления	= ВидНачисления;
		Запись.СпособНачисления	= РазовоеНачисления;
		Запись.ЗначениеТарифа	= стр.Цена;
		Запись.Поставщик		= Поставщик;
		Запись.ОбъемУслуги		= стр.Количество;
		Запись.Сумма			= стр.Сумма;
	КонецЦикла; 	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли