#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь(); 	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОчиститьДвиженияАналитическихРегистров();
	ДобавитьДополнительныеСвойства();	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	Документы.энргАктированиеНедопускаДопускаВПомещение.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	Документы.энргАктированиеНедопускаДопускаВПомещение.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);			
КонецПроцедуры

#КонецОбласти   

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОчиститьДвиженияАналитическихРегистров()
	
	Движения.энргНачисленныйСреднийОбъем.Очистить();
    Движения.энргНачисленныйСреднийОбъем.Записывать = Истина;
    Движения.энргНачисленныйСреднийОбъем.Записать();
    Движения.энргСостояниеДопускаВПомещение.Очистить();
    Движения.энргСостояниеДопускаВПомещение.Записывать = Истина;
    Движения.энргСостояниеДопускаВПомещение.Записать();
	
КонецПроцедуры

Процедура ДобавитьДополнительныеСвойства()
	
	ДополнительныеСвойства.Вставить("Дата", Дата);
	ДополнительныеСвойства.Вставить("МоментВремени", МоментВремени());
	
КонецПроцедуры


Процедура МассивПриборов() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",	Ссылка);
	Запрос.УстановитьПараметр("ВидОперации",	Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение);
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТочек.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргАктированиеНедопускаДопускаВПомещение.ТочкиУчета КАК ТаблицаТочек
	|ГДЕ
	|	ТаблицаТочек.Ссылка = &Ссылка
	|	И НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И ТаблицаТочек.Ссылка.ВидОперации = &ВидОперации";
	
	Запрос.Текст = Текст;
	
	ДополнительныеСвойства.Вставить("МассивПриборов", Запрос.Выполнить());	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли