
#Область СлужебныйПрограммныйИнтерфейс

#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(Форма, ОповещениеОЗавершении, ДокументОснование, ЗависимыеРеквизиты, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассовыйВводОплат.ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(ДокументОснование, ЗависимыеРеквизиты);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПроведение

Функция ЗапуститьФоновоеЗаданиеПроведение(Форма, ОповещениеОЗавершении, ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассовыйВводОплат.ЗапуститьФоновоеЗаданиеПроведение(ДокументОснование);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиОтменаПроведения

Функция ЗапуститьФоновоеЗаданиеОтменаПроведения(Форма, ОповещениеОЗавершении, ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассовыйВводОплат.ЗапуститьФоновоеЗаданиеОтменаПроведения(ДокументОснование);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПометкаНаУдаление

Функция ЗапуститьФоновоеЗаданиеПометкаНаУдаление(Форма, ОповещениеОЗавершении, ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассовыйВводОплат.ЗапуститьФоновоеЗаданиеПометкаНаУдаление(ДокументОснование);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиУстановкаПометкиУдаления

Функция ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаления(Форма, ОповещениеОЗавершении, ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассовыйВводОплат.ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаления(ДокументОснование);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#КонецОбласти

