#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДлинуЛС(Дата, Организация) Экспорт
	ДлинаЛС	= 14;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация); 
	Запрос.УстановитьПараметр("Дата",Дата);
	ЗАпрос.Текст = "ВЫБРАТЬ
	|	бестДлинаЛицевогоСчетаСрезПоследних.ДлинаЛС КАК ДлинаЛС
	|ИЗ
	|	РегистрСведений.бестДлинаЛицевогоСчета.СрезПоследних(&Дата, Организация = &Организация) КАК бестДлинаЛицевогоСчетаСрезПоследних";
	Результат 	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	Выборка.Следующий();
	
	ДлинаЛС = Выборка.ДлинаЛС;
	
	Возврат ДлинаЛС;
КонецФункции

Функция ПолучитьСписокАбонентовМКДСПостановлениями(ДанныеШапки) Экспорт
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 			ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("Район", 					ДанныеШапки.Район);
	Запрос.УстановитьПараметр("МКД", 					ДанныеШапки.МКД);
	Запрос.УстановитьПараметр("Дата", 					ДанныеШапки.Дата);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ЕСТЬNULL(бестРабочиеПостановленияАбонентовСрезПоследних.Постановление, ЗНАЧЕНИЕ(Перечисление.бестРабочиеПостановления.ПустаяСсылка)) КАК Постановление
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргАбоненты.Ссылка КАК Абонент
	|	ИЗ
	|		Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|				И (энргКлючиПомещений.Строение = &МКД)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРабочиеПостановленияАбонентов.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестРабочиеПостановленияАбонентовСрезПоследних
	|		ПО ВложенныйЗапрос.Абонент = бестРабочиеПостановленияАбонентовСрезПоследних.Абонент";
	Результат 		= Запрос.Выполнить();
	Выгрузка		= Результат.Выбрать();
	
	Возврат Выгрузка;
КонецФункции

Процедура ПолучитьДанныеОДокументеФизЛица(ДатаЗапроса, ФизЛицо, ВидДокумента, Свойство, ПолучаемыеСвойства) Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Дата",			ДатаЗапроса);
	Запрос.УстановитьПараметр("Контрагент",		ФизЛицо);
	Запрос.УстановитьПараметр("ВидДокумента",	ВидДокумента);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	бестДокументыФизическихЛицСрезПоследних.Период КАК Период,
	|	бестДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	бестДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	бестДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	бестДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
	|	бестДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
	|	бестДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
	|	бестДокументыФизическихЛицСрезПоследних.ЯвляетсяДокументомУдостоверяющимЛичность КАК ЯвляетсяДокументомУдостоверяющимЛичность,
	|	бестДокументыФизическихЛицСрезПоследних.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.бестДокументыФизическихЛиц.СрезПоследних(
	|			&Дата,
	|			Контрагент = &Контрагент
	|				И ВидДокумента = &ВидДокумента) КАК бестДокументыФизическихЛицСрезПоследних";
	Результат  	= Запрос.Выполнить();
	Выборка  	= Результат.Выбрать();
	
	СтруктураДанных	= Новый Структура;
	для Каждого КолонкаРезультата из Результат.Колонки цикл
		СтруктураДанных.Вставить(КолонкаРезультата.Имя, "");	
	КонецЦикла;	
		
	Если Выборка.Следующий() тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных,Выборка);
	КонецЕсли;
	
	ПолучаемыеСвойства[Свойство] = СтруктураДанных;
КонецПроцедуры

#КонецОбласти
