#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета;
	
	Если ИмяМакета = "ПФ_MXL_СчетФактураНаАванс" Тогда
		ТабличныйДокумент 		= СформироватьСчетФактураНаАванс(ИмяМакета, ПараметрыПечати);	
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета, СинонимМакета,
		ТабличныйДокумент, ,
		"Документ.бестСчетФактураНаАванс." + ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСчетФактураНаАванс(ИмяМакета, ПараметрыПечати)
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Документ.бестСчетФактураНаАванс." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластьСФНаАванс  = Макет.ПолучитьОбласть("СФНаАванс");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестСчетФактураНаАванс.Организация КАК Организация,
	|	бестСчетФактураНаАванс.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	бестСчетФактураНаАванс.Дата КАК Дата,
	|	бестСчетФактураНаАванс.Район КАК Район,
	|	бестСчетФактураНаАванс.Договор КАК Договор,
	|	бестСчетФактураНаАванс.СуммаПереплаты КАК СуммаСНДС,
	|	бестСчетФактураНаАванс.СуммаПереплатыНДС КАК СуммаНДС,
	|	ЕСТЬNULL(бестСтавкиНДССрезПоследних.СтавкаНДС, 0) КАК СтавкаНДС,
	|	бестСчетФактураНаАванс.ПериодНачисления КАК ПериодНачисления,
	|	бестСчетФактураНаАванс.Ответственный КАК Ответственный,
	|	бестСчетФактураНаАванс.IDСтрокиОплаты КАК IDСтрокиОплаты,
	|	бестСчетФактураНаАванс.ДокументОплаты КАК ДокументОплаты
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестСчетФактураНаАванс КАК бестСчетФактураНаАванс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСтавкиНДС.СрезПоследних(&Период, ) КАК бестСтавкиНДССрезПоследних
	|		ПО бестСчетФактураНаАванс.Организация = бестСтавкиНДССрезПоследних.Организация
	|ГДЕ
	|	бестСчетФактураНаАванс.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления КАК ДокументНачисления,
	|	КОЛИЧЕСТВО(бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления) КАК КолвоПД,
	|	бестПлатежныйДокумент.ТипЗадолженности КАК ТипЗадолженности,
	|	бестПлатежныйДокумент.Процент КАК Процент,
	|	ДанныеДокумента.IDСтрокиОплаты КАК IDСтрокиОплаты
	|ПОМЕСТИТЬ ПД
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.ДокументыНачисления КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|			ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления = бестПлатежныйДокумент.Ссылка
	|		ПО ДанныеДокумента.ДокументОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.Ссылка
	|			И ДанныеДокумента.IDСтрокиОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.IDСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления,
	|	бестПлатежныйДокумент.ТипЗадолженности,
	|	бестПлатежныйДокумент.Процент,
	|	ДанныеДокумента.IDСтрокиОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ДанныеДокумента.Дата КАК ДатаСФ,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	ДанныеДокумента.СуммаСНДС - ДанныеДокумента.СуммаНДС КАК СуммаБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	ЕСТЬNULL(ПД.Процент, -1) КАК Процент,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеДокумента.Район = энргЗоныОтвественности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПД КАК ПД
	|		ПО ДанныеДокумента.IDСтрокиОплаты = ПД.IDСтрокиОплаты
	|			И (ПД.КолвоПД = 1)
	|			И (ПД.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Авансовый))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	Итог.ДатаСФ КАК ДатаСФ,
	|	Итог.ИННОрг КАК ИННОрг,
	|	Итог.КППОрг КАК КППОрг,
	|	Итог.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	|	Итог.ФактическийАдресОрг КАК ФактическийАдресОрг,
	|	Итог.ЮридическийАдресОрг КАК ЮридическийАдресОрг,
	|	Итог.ФактическийАдресКонтрагента КАК ФактическийАдресКонтрагента,
	|	Итог.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.КодРайона КАК КодРайона,
	|	Итог.ИННКон КАК ИННКон,
	|	Итог.КППКон КАК КППКон,
	|	Итог.ОтветственныйТелефон КАК ОтветственныйТелефон,
	|	Итог.ОтветственныйПочта КАК ОтветственныйПочта,
	|	Итог.Ответственный КАК Ответственный,
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	Итог.СтавкаНДС КАК СтавкаНДС,
	|	Итог.Процент КАК Процент,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие
	|ИЗ
	|	Итог КАК Итог";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	Запрос.УстановитьПараметр("Период", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.ОбъектПечати, "Дата"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка 			= РезультатЗапроса[3].Выбрать();
	
	ЭлектронноеВзаимодействие = Неопределено;
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьСФНаАванс.Параметры,Выборка);
		ОбластьСФНаАванс.Параметры.ДатаСФ = Формат(Выборка.ДатаСФ, "ДЛФ=D");
		ОбластьСФНаАванс.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=D");
		ТекстЕслиПДАвансовый = "Оплата за электроэнергию по постановлению правительства РФ №442";
		Если Выборка.Процент >= 0 Тогда
			ТекстЕслиПДАвансовый = ТекстЕслиПДАвансовый + " - " + Выборка.Процент + "% стоимости электроэнергии (мощности)";
		КонецЕсли;
		ОбластьСФНаАванс.Параметры.ТекстЕслиПДАвансовый = ТекстЕслиПДАвансовый;
		ЭлектронноеВзаимодействие = Выборка.ЭлектронноеВзаимодействие;
	КонецЕсли;
	
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьСФНаАванс.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьСФНаАванс.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьСФНаАванс.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьСФНаАванс.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = Документы.бестПлатежныйДокумент.ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьСФНаАванс.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;	
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьСФНаАванс.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = Документы.бестПлатежныйДокумент.ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьСФНаАванс.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТабДок.Вывести(ОбластьСФНаАванс);
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#КонецЕсли