#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
	
	Если ЭтотОбъект.КоэффициентОпределенияОбъема = 0 И ЭтотОбъект.КоэффициентОпределенияТарифа = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();
	
	Если  Не ЭтотОбъект.КоэффициентОпределенияОбъема = 0 Тогда 
		
		Набор  										= Движения.бестКоэффициентОпределенияОбъемаРеактивнойЭнергии;
		Запись  									= Набор.добавить();
		Запись.Период  								= ДанныеШапки.Дата;
		Запись.Организация  						= ДанныеШапки.Организация;
		Запись.Услуга								= ДанныеШапки.Услуга;
		Запись.КоэффициентОпределенияОбъема			= ДанныеШапки.КоэффициентОпределенияОбъема;
		
	КонецЕсли;
	
	Если Не ЭтотОбъект.КоэффициентОпределенияТарифа = 0 Тогда
		
		Набор  										= Движения.бестКоэффициентОпределенияТарифаРеактивнойЭнергии;
		Запись  									= Набор.добавить();
		Запись.Период  								= ДанныеШапки.Дата;
		Запись.Организация  						= ДанныеШапки.Организация;
		Запись.Услуга								= ДанныеШапки.Услуга;
		Запись.КоэффициентОпределенияТарифа			= ДанныеШапки.КоэффициентОпределенияТарифа;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",									Дата);
	ДанныеШапки.Вставить("Организация",								Организация);
	ДанныеШапки.Вставить("Услуга",									Услуга);
	ДанныеШапки.Вставить("ИзменитьКоэффициентОбъема",				ИзменитьКоэффициентОбъема);
	ДанныеШапки.Вставить("КоэффициентОпределенияОбъема",			КоэффициентОпределенияОбъема);
	ДанныеШапки.Вставить("ИзменитьКоэффициентТарифа",				ИзменитьКоэффициентТарифа);
	ДанныеШапки.Вставить("КоэффициентОпределенияТарифа",			КоэффициентОпределенияТарифа);
	Возврат ДанныеШапки;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли