#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестИзменитьНомерПломбыПрибораУчета(ЭтотОбъект, Объект.Ссылка);
	
	ЗаполнитьДокумент  = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") Тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли;
	Если ЗаполнитьДокумент И ЗначениеЗаполнено(Объект.ТочкаУчета) Тогда
		ЗаполнитьПУ();
	КонецЕсли;
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестИзменитьНомерПломбыПрибораУчета(ЭтотОбъект, Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыборУслугиИТочкиУчета();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдрессОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмерители 

&НаКлиенте
Процедура ИзмерителиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Измерители.ТекущиеДанные;
 	Если ТекДанные = Неопределено Тогда
	 	Возврат;
	КонецЕсли;
 
	 энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.НомераПломб, Неопределено, ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ИзмерителиПередУдалением(Элемент, Отказ)
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("НомераПломб");
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.Измерители.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНомераПломб 

&НаКлиенте
Процедура НомераПломбПриИзменении(Элемент)
	ТекДанные = Элементы.Измерители.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПломбы = Элементы.НомераПломб.ТекущиеДанные;
	Если ТекДанныеПломбы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеПломбы.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета()
	СтруктураОтбора = Новый Структура("Период,Организация,Район,Договор,ОбъектРасчета",?(ЗначениеЗаполнено(Объект.Дата), КонецДня(Объект.Дата), КонецДня(ТекущаяДата())));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца,ВыводитьСоставные", СтруктураОтбора, "НП", Истина);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		Объект.ТочкаУчета = РезультатЗакрытия.ТочкаУчета;
		ЗаполнитьПУ();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПУ()
	Объект.Измерители.Очистить();
	Объект.НомераПломб.Очистить();
	ПриборыУчета = бестРаботаСприборамиУчетаСервер.ПолучитьМассивДействующихПриборовУчета(Объект.Дата, Объект.Организация, Объект.Район, Объект.ОбъектРасчета, Объект.ТочкаУчета, Истина);
	
	Для каждого эл из ПриборыУчета Цикл
		НовСтр = Объект.Измерители.Добавить();
		НовСтр.ПриборУчета = эл;
		НовСтр.IDСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти