#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргРегистрацияПоказанийМКД.ТочкиУчета КАК ТаблицаТочекУчета
	|ГДЕ
	|	ТаблицаТочекУчета.Ссылка = &ссылка
	|	И НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	//ТаблицаДляПроведения = ПолучитьТаблицу();
	//
	//ЗаписатьВРегистрОбъемНачислений(ТаблицаДляПроведения);  
	
	ИтоговыеДанные = ПолучитьТаблицуСИтогами();
		
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ИтоговыеДанные,		Движения.бестИтоговыеЗначенияПараметровСуточнойВедомости);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуСИтогами()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("Дата",					Дата);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",			ОбъектРасчета);
	Запрос.УстановитьПараметр("ПриборУчета",			ПриборУчета);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	|	&Ссылка КАК Регистратор,
	|	&Дата КАК Период,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&ОбъектРасчета КАК ОбъектРасчета,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	бестСуточнаяВедомостьПараметрыИзмерителя.ВидПараметра КАК ВидПараметра,
	|	бестСуточнаяВедомостьПараметрыИзмерителя.Значение КАК Значение,
	|	бестСуточнаяВедомостьПараметрыИзмерителя.BНP КАК BНP,
	|	&ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_ИтоговыеДанные
	|ИЗ
	|	Документ.бестСуточнаяВедомость.ПараметрыИзмерителя КАК бестСуточнаяВедомостьПараметрыИзмерителя
	|ГДЕ
	|	бестСуточнаяВедомостьПараметрыИзмерителя.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговыеДанные.ВидНачисления КАК ВидНачисления,
	|	ВТ_ИтоговыеДанные.Регистратор КАК Регистратор,
	|	ВТ_ИтоговыеДанные.Период КАК Период,
	|	ВТ_ИтоговыеДанные.Организация КАК Организация,
	|	ВТ_ИтоговыеДанные.Район КАК Район,
	|	ВТ_ИтоговыеДанные.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ИтоговыеДанные.ПриборУчета КАК ПриборУчета,
	|	ВТ_ИтоговыеДанные.Значение КАК ЗначениеПараметра,
	|	ВТ_ИтоговыеДанные.ВидПараметра КАК ВидПараметра,
	|	ВТ_ИтоговыеДанные.ПериодНачисления КАК ПериодНачисления,
	|	бестОбъектыРасчета.МКД КАК МКД,
	|	ВТ_ИтоговыеДанные.BНP КАК ВНР,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО ВТ_ИтоговыеДанные.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|			ПО энргПриборыУчетаАбонента.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|		ПО ВТ_ИтоговыеДанные.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ВидНачисления КАК ВидНачисления,
	|	Итог.Регистратор КАК Регистратор,
	|	Итог.Период КАК Период,
	|	Итог.Организация КАК Организация,
	|	Итог.Район КАК Район,
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ПриборУчета КАК ПриборУчета,
	|	Итог.ЗначениеПараметра КАК ЗначениеПараметра,
	|	Итог.ВидПараметра КАК ВидПараметра,
	|	Итог.ПериодНачисления КАК ПериодНачисления,
	|	Итог.МКД КАК МКД,
	|	Итог.ВНР КАК ВНР,
	|	Итог.Шкала КАК Шкала
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПараметрыИзмерителей.СрезПоследних(&Дата, Измеритель = &ПриборУчета) КАК бестПараметрыИзмерителейСрезПоследних
	|		ПО Итог.ПриборУчета = бестПараметрыИзмерителейСрезПоследних.Измеритель
	|			И Итог.Шкала = бестПараметрыИзмерителейСрезПоследних.Шкала
	|			И Итог.ВидПараметра = бестПараметрыИзмерителейСрезПоследних.ВидПараметра";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли