#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			= "" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестРеструктуризацияЗадолженности",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестРеструктуризацияЗадолженности",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестРеструктуризацияЗадолженности",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестРеструктуризацияЗадолженности");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета;
	
	Если ИмяМакета = "ПФ_MXL_ЖурналУчетаГрафиковПогашения" Тогда
		ТабличныйДокумент 		= СформироватьЖурналУчетаГрафиковПогашения(ИмяМакета, ПараметрыПечати);
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета, СинонимМакета,
		ТабличныйДокумент, ,
		"Документ.бестРеструктуризацияЗадолженности." + ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ДополнительныеФункции

Функция ПолучитьТекстЗапросаГрафикПогашения()
	Возврат "ВЫБРАТЬ
	        |	бестПланПогашенияРеструктуризированнойЗадолженностиСрезПоследних.Регистратор КАК Регистратор
	        |ПОМЕСТИТЬ ДокументыРеструктуризации
	        |ИЗ
	        |	РегистрСведений.бестПланПогашенияРеструктуризированнойЗадолженности.СрезПоследних(
	        |			&Период,
	        |			Район = &Район
	        |				И Организация = &Организация
	        |				И Договор = &Договор) КАК бестПланПогашенияРеструктуризированнойЗадолженностиСрезПоследних
	        |ГДЕ
	        |	бестПланПогашенияРеструктуризированнойЗадолженностиСрезПоследних.Состояние
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестРеструктуризацияЗадолженности.Организация КАК Организация,
	        |	бестРеструктуризацияЗадолженности.Район КАК Район,
	        |	бестРеструктуризацияЗадолженности.Ответственный КАК Ответственный,
	        |	бестРеструктуризацияЗадолженности.Примечание КАК Примечание,
	        |	бестРеструктуризацияЗадолженности.Договор КАК Договор,
	        |	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	        |	бестРеструктуризацияЗадолженности.ДатаОперации КАК ДатаРегистратора,
	        |	бестРеструктуризацияЗадолженности.Номер КАК Номер,
	        |	бестРеструктуризацияЗадолженностиПланПогашенияЗадолженности.Дата КАК ПериодПогашения,
	        |	бестРеструктуризацияЗадолженностиПланПогашенияЗадолженности.Сумма КАК Сумма,
	        |	бестРеструктуризацияЗадолженности.Ссылка КАК ДокументРеструктуризация
	        |ПОМЕСТИТЬ ДанныеГрафика
	        |ИЗ
	        |	ДокументыРеструктуризации КАК ДокументыРеструктуризации
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРеструктуризацияЗадолженности КАК бестРеструктуризацияЗадолженности
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |			ПО бестРеструктуризацияЗадолженности.Договор = энргДоговорыКонтрагентов.Ссылка
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРеструктуризацияЗадолженности.ПланПогашенияЗадолженности КАК бестРеструктуризацияЗадолженностиПланПогашенияЗадолженности
	        |			ПО бестРеструктуризацияЗадолженности.Ссылка = бестРеструктуризацияЗадолженностиПланПогашенияЗадолженности.Ссылка
	        |		ПО ДокументыРеструктуризации.Регистратор = бестРеструктуризацияЗадолженности.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестРеструктуризацияЗадолженностиДанныеЗадолженности.ПлатежныйДокумент КАК ПлатежныйДокумент,
	        |	бестРеструктуризацияЗадолженностиДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления
	        |ПОМЕСТИТЬ ПлатежныеДокументы
	        |ИЗ
	        |	ДокументыРеструктуризации КАК ДокументыРеструктуризации
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРеструктуризацияЗадолженности.ДанныеЗадолженности КАК бестРеструктуризацияЗадолженностиДанныеЗадолженности
	        |		ПО ДокументыРеструктуризации.Регистратор = бестРеструктуризацияЗадолженностиДанныеЗадолженности.Ссылка
	        |			И (бестРеструктуризацияЗадолженностиДанныеЗадолженности.ВключитьВПлан)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеГрафика.Организация КАК Организация,
	        |	ДанныеГрафика.Район КАК Район,
	        |	ДанныеГрафика.Ответственный КАК Ответственный,
	        |	ДанныеГрафика.Примечание КАК Примечание,
	        |	ДанныеГрафика.Договор КАК Договор,
	        |	ДанныеГрафика.Контрагент КАК Контрагент,
	        |	ДанныеГрафика.ДатаРегистратора КАК ДатаРегистратора,
	        |	ДанныеГрафика.Номер КАК Номер,
	        |	ДанныеГрафика.ПериодПогашения КАК ПериодПогашения,
	        |	ДанныеГрафика.Сумма КАК СуммаГрафик,
	        |	СУММА(ЕСТЬNULL(бестВзаиморасчетыПоМесяцамЭЭОбороты.СуммаРасход, 0)) КАК СуммаОплата,
	        |	ДанныеГрафика.ДокументРеструктуризация КАК ДокументРеструктуризация
	        |ИЗ
	        |	ДанныеГрафика КАК ДанныеГрафика
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Обороты(
	        |				,
	        |				,
	        |				Запись,
	        |				Район = &Район
	        |					И Организация = &Организация
	        |					И Договор = &Договор
	        |					И (ПериодНачисления, ПлатежныйДокумент) В
	        |						(ВЫБРАТЬ
	        |							ПлатежныеДокументы.ПериодНачисления КАК ПериодНачисления,
	        |							ПлатежныеДокументы.ПлатежныйДокумент КАК ПлатежныйДокумент
	        |						ИЗ
	        |							ПлатежныеДокументы КАК ПлатежныеДокументы)) КАК бестВзаиморасчетыПоМесяцамЭЭОбороты
	        |		ПО ДанныеГрафика.Организация = бестВзаиморасчетыПоМесяцамЭЭОбороты.Организация
	        |			И ДанныеГрафика.Район = бестВзаиморасчетыПоМесяцамЭЭОбороты.Район
	        |			И ДанныеГрафика.Договор = бестВзаиморасчетыПоМесяцамЭЭОбороты.Договор
	        |			И ДанныеГрафика.ДатаРегистратора <= бестВзаиморасчетыПоМесяцамЭЭОбороты.Период
	        |			И ДанныеГрафика.ПериодПогашения >= бестВзаиморасчетыПоМесяцамЭЭОбороты.Период
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеГрафика.Организация,
	        |	ДанныеГрафика.Район,
	        |	ДанныеГрафика.Ответственный,
	        |	ДанныеГрафика.Примечание,
	        |	ДанныеГрафика.Договор,
	        |	ДанныеГрафика.Контрагент,
	        |	ДанныеГрафика.ДатаРегистратора,
	        |	ДанныеГрафика.Номер,
	        |	ДанныеГрафика.ПериодПогашения,
	        |	ДанныеГрафика.Сумма,
	        |	ДанныеГрафика.ДокументРеструктуризация
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДокументРеструктуризация,
	        |	ПериодПогашения"
КонецФункции

#КонецОбласти

#Область ПечатныеФормы

Функция СформироватьЖурналУчетаГрафиковПогашения(ИмяМакета, ПараметрыПечати)
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Отчет.бестЖурналУчетаГрафиковПогашения." +ИмяМакета);
		
	ТабДок 			= Новый ТабличныйДокумент;

	ОбластьШапка    = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= ПолучитьТекстЗапросаГрафикПогашения();
	Запрос.УстановитьПараметр("Организация", 	ПараметрыПечати.Организация);
	Запрос.УстановитьПараметр("Район", 			ПараметрыПечати.Район);
	Запрос.УстановитьПараметр("Договор", 		ПараметрыПечати.Договор);
	Запрос.УстановитьПараметр("Период", 		ПараметрыПечати.Период);
	Результат 		= Запрос.Выполнить();
	
	Выборка 		= Результат.Выбрать();
	
	ОплаченнаяСумма 					= 0;
	ПериодыПросроченнойЗадолженности 	= "";
	ТекДок 								= Неопределено;
	ПорядковыйНомер						= 1;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДокументРеструктуризация <> ТекДок Тогда
			ТекДок = Выборка.ДокументРеструктуризация;
			Для каждого стр из ТекДок.ДанныеЗадолженности Цикл
				Если стр.ВключитьВПлан Тогда
					ПериодыПросроченнойЗадолженности = ПериодыПросроченнойЗадолженности + Формат(стр.ПериодНачисления, "ДФ=MM.yyyy") + "; ";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
			ОбластьДанные    = Макет.ПолучитьОбласть("Данные");
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, Выборка);
			ОбластьДанные.Параметры.ПериодыПросроченнойЗадолженности = ПериодыПросроченнойЗадолженности;
			СуммаОплата 							= Выборка.СуммаОплата - ОплаченнаяСумма;
			ОбластьДанные.Параметры.СуммаОплата 	= СуммаОплата;
			ОбластьДанные.Параметры.СуммаИсполнение = СуммаОплата - Выборка.СуммаГрафик;
			ОбластьДанные.Параметры.ДатаРегистратора= Формат(Выборка.ДатаРегистратора, "ДФ=dd.MM.yyyy");
			ОбластьДанные.Параметры.ПериодПогашения = Формат(Выборка.ПериодПогашения, "ДФ=dd.MM.yyyy");
			ОбластьДанные.Параметры.ПорядковыйНомер = ПорядковыйНомер;
			ОплаченнаяСумма 						= ОплаченнаяСумма + СуммаОплата;
			ПорядковыйНомер			                = ПорядковыйНомер + 1;
		    ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли