#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацияСПриборомУчетаМКД(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("гжшфГИСЖКХШаблоныФЛ") Тогда
		гжшфОбменСГИСМодуль = ОбщегоНазначения.ОбщийМодуль("гжшфОбменСГИС");
		гжшфОбменСГИСМодуль.ПриСозданииНаСервере(ЭтотОбъект, Объект.Ссылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
		
	ЗаполнитьДокумент  = Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			ЗаполнитьДокумент = истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.МКД) и ЗаполнитьДокумент тогда
		Если не ЗначениеЗаполнено(Объект.Дата) тогда
			Объект.Дата 				= ТекущаяДата();
		КонецЕсли;	
		ПерезаполнитьПоказанияПУСервер();
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьТекстовыеПоля();
	УстановитьВидимостьУзловУчета();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
				
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект,"Вывод");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, Объект.ТочкиУчета, ТекущийОбъект, Истина);
	//
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	//
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	//энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
	//	Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
	//	
	//	НовыеПриборыУчета 					= Новый Массив;
	//	
	//	Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
	//		Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
	//			СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
	//			НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
	//		КонецЕсли;			
	//	КонецЦикла;
	//	
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	//КонецЕсли;
	
	СоответствиеСтрок = Новый Соответствие; 	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета", Отказ);
		
		ОтборВывода					= Новый Структура("Вывод", Истина);
		мСтрокВыведенныхИзмерителей = ТекущийОбъект.Измерители.Выгрузить(ОтборВывода);
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТекущийОбъект.Измерители, ОтборВывода);
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители", Отказ);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(мСтрокВыведенныхИзмерителей, ТекущийОбъект.Измерители);
		
		НовыеПриборыУчета 	= Новый Массив;
		НовыеИзмерители 	= Новый Массив;
		СоответствиеПрибора = Новый Соответствие;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;			
		КонецЦикла;
		
		мСтрокВведенныхИзмерителей = ТекущийОбъект.Измерители.НайтиСтроки(Новый Структура("Ввод", Истина)); 
		Для Каждого СтрокаИзмерителя Из мСтрокВведенныхИзмерителей Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
		
		энргШкалыТарифныеЗоныСервер.ПроверитьПоказанияНаКорректностьВвода(ТекущийОбъект, "Вывод");		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НЗаписиТЧ=Объект.ТочкиУчета.Количество();
		
		Если НЗаписиТЧ=0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Табличная часть должна содержать как минимум одну запись");
			Отказ=Истина;
		КонецЕсли;
		
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) И СтрокаТочки.ПриборУчета <> СтрокаТочки.ПриборУчетаВывод Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		мСтрокВведенныхИзмерителей = ТекущийОбъект.Измерители.НайтиСтроки(Новый Структура("Ввод", Истина)); 
		Для Каждого СтрокаИзмерителя Из мСтрокВведенныхИзмерителей Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("гжшфГИСЖКХШаблоныФЛ") Тогда
		гжшфОбменСГИСМодуль = ОбщегоНазначения.ОбщийМодуль("гжшфОбменСГИС");
		гжшфОбменСГИСМодуль.ПослеЗаписиНаСервере(ЭтотОбъект, Объект.Ссылка);
	КонецЕсли;
		
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
		
	ЗаполнитьТекстовыеПоля();
	УстановитьВидимостьУзловУчета(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда   		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
	
	ПерезаполнитьПоказанияПУСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	энргРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("энргОперацияСПриборомУчетаМКД",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;

	ПерезаполнитьПоказанияПУСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмеренияВывод" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект, "МКД", "IDСтрокиВывод");
		СтруктураЗаполнения.ПараметрыПередачи.ВходныеПараметры.Вставить("ДатаДокумента", Объект.Дата);
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения, "Вывод");
	ИначеЕсли Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект, "МКД");
		СтруктураЗаполнения.ПараметрыПередачи.ВходныеПараметры.Вставить("Замена", Истина);
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицыФормы	= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиВывод,	Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
	
	ТаблицыФормы	= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыУслуг");
	ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТипПрибораУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыФормул		= Элементы["ФормулыРасчетаУслуг"	+ ПрефиксТочекУчета];
	ТаблицаФормыШкалУслуг	= Элементы["ШкалыУслуг"				+ ПрефиксТочекУчета];
	ТаблицаФормыШкалВывод	= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета + "Вывод"];
	ТаблицаФормыШкалВвод 	= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета + "Ввод"];
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалВывод,	"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтрокиВывод);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалВвод,	"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтроки);	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыФормул,		"IDСтроки",				ТекущиеДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг,	"IDСтроки",				ТекущиеДанные.IDСтроки);

	
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.IDСтрокиВывод				= Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныВидКанальностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ВидКанальности);
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВывод

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВыводТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВыводСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВыводПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВыводПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВвод

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВводПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыТочек	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВвод";
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {	
	ИмяТаблицы								= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВвод";
	ТаблицаФормы		 					= Элементы[ИмяТаблицы];	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормы,"IDСтроки",ТекущиеДанные.IDСтроки);
	// энргРаботаСВидомДифференцированности } 
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВыводПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыТочек	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВывод";
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {	
	ИмяТаблицы								= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВывод";
	ТаблицаФормы		 					= Элементы[ИмяТаблицы];	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормы,"IDСтроки",ТекущиеДанные.IDСтроки);
	// энргРаботаСВидомДифференцированности } 
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВводВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВвод";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтроки,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности),"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонТипПрибораУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыФормул		= Элементы["ФормулыРасчетаУслуг"	+ ПрефиксТочекУчета];
	ТаблицаФормыШкалУслуг	= Элементы["ШкалыУслуг"				+ ПрефиксТочекУчета];
	ТаблицаФормыШкалВывод	= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета + "Вывод"];
	ТаблицаФормыШкалВвод 	= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета + "Ввод"];
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалВывод,	"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтрокиВывод);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалВвод,	"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтроки);	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыФормул,		"IDСтроки",				ТекущиеДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг,	"IDСтроки",				ТекущиеДанные.IDСтроки);

	
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонВидКанальностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ВидКанальности);
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонВывод

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонВыводТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонВыводСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонВыводПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыТочкиУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныТипПрибораУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыПоказанийВывод	= Элементы["ПоказанияПриборовУчета"		+ ПрефиксТочекУчета + "Вывод"];
	ТаблицаФормыПоказанийВвод 	= Элементы["ПоказанияПриборовУчета"		+ ПрефиксТочекУчета + "Ввод"];
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказанийВывод,	"IDСтроки",	ТекущиеДанные.IDСтрокиШкалыВывод);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказанийВвод,	"IDСтроки",	ТекущиеДанные.IDСтрокиШкалы);	
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиШкалы,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности),"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
	для Каждого СтрокаПоказаний из Объект.ПоказанияПриборовУчета цикл
		Если НЕ СтрокаПоказаний.IDСтроки = ТекущиеДанные.IDСтрокиШкалы Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаПоказаний.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныВывод

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныВыводТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныВыводСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныВыводПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныВыводПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТипПрибораУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура  ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура  ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФормулыРасчетаУслуг

&НаКлиенте
Процедура ШкалыУслугШкалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	Элемент.СписокВыбора.ЗагрузитьЗначения(СоставКанальности);
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаУслугПриИзменении(Элемент)
	
	ИмяТаблицыТочек 					= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыФормул 						= "ФормулыРасчетаУслуг" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыФормул].ТекущиеДанные;
	Если ИмяТаблицыФормул = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаУслугУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек		= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные		= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	СоставУслуги		= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(ТекущиеДанные.Услуга);
	Элемент.СписокВыбора.ЗагрузитьЗначения(СоставУслуги);
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаУслугФормулаРасчетаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанныеТочкиУчета 	= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	ТекущиеДанные 				= Элементы["ФормулыРасчетаУслуг" + ПрефиксТочекУчета].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ  ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоставУслуги 				= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(ТекущиеДанныеТочкиУчета.Услуга);
	
	Шкалы		 				= Новый Массив;
	
	Для Каждого СтрокаШкалы Из Объект.ШкалыПриборовУчета Цикл
		Если НЕ ТекущиеДанныеТочкиУчета.IDСтроки  = СтрокаШкалы.IDСтрокиТочкиУчета Тогда
			Продолжить;
		КонецЕсли;
		Шкалы.Добавить(СтрокаШкалы.Шкала);
	КонецЦикла;
	
	Оповещение 					= Новый ОписаниеОповещения("НастройкаФормулыРасчетаЗавершение",ЭтаФорма,Новый Структура("КлючСтроки", Элементы.ФормулыРасчетаУслугЕстьШкалыЕстьТарифныеЗоны.ТекущаяСтрока));
	ПараметрыФормы 				= Новый Структура;
	ПараметрыФормы.Вставить("Услуга", 					ТекущиеДанные.Услуга);
	ПараметрыФормы.Вставить("СоставУслуги", 			СоставУслуги);
	ПараметрыФормы.Вставить("Шкалы", 					Шкалы);
	ПараметрыФормы.Вставить("ПредставлениеФормулы", 	ТекущиеДанные.ФормулаРасчетаПредставление);
	
	ОткрытьФорму("ОбщаяФорма.энргНастройкаФормулРасчета",ПараметрыФормы,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормулыРасчетаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатЗакрытия.Свойство("ПредставлениеФормулы") ИЛИ Не РезультатЗакрытия.Свойство("ФормулаРасчета") Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтроки  								= ДополнительныеПараметры.КлючСтроки;
	ТекущиеДанные  								= Объект.ФормулыРасчетаУслуг.НайтиПоИдентификатору(КлючСтроки);
	ТекущиеДанные.ФормулаРасчетаПредставление 	= РезультатЗакрытия.ПредставлениеФормулы;
	ТекущиеДанные.ФормулаРасчета 				= РезультатЗакрытия.ФормулаРасчета;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ПерезаполнитьПоказанияПУСервер();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные)
	ДопПараметры = Новый Структура("ЭтоЗаменаПУ",Истина);
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъемВывод,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма,ДопПараметры);
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТочкиУчетаЗаводскойНомерПриИзменении(Элемент)	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура  ТочкиУчетаДатаПоверкиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВывод.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонВывод.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныВывод.ТекущиеДанные;
	Иначе	
		текСтрока 								= Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущиеДанные;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока,ДанныеСтроки);
	КонецЕсли;
	
	//энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(текСтрока,Объект.Дата,Ложь);	
	
	Если Не ИспользоватьТарифныеЗоны И Не ИспользоватьШкалыПриборовУчета Тогда
		// меняем местами ТекущиеПоказания и ТекущиеПоказанияВывод
		ТекущиеПоказания = текСтрока.ТекущиеПоказания;
		текСтрока.ТекущиеПоказания = текСтрока.ТекущиеПоказанияВывод;
		энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(текСтрока,Объект.Дата,Ложь);	
		текСтрока.ТекущиеПоказания = ТекущиеПоказания;
	Иначе
		энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(текСтрока,Объект.Дата,Ложь);	
	КонецЕсли;
	
	Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКанальности) тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.ВидКанальности = ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьПоказанияПУСервер(ТекСтрокаТочки  = Неопределено)
	
	ТаблицаТЧ 									= Объект.ПоказанияПриборовУчета.Выгрузить();
	Объект.ТочкиУчета.Очистить();
	Объект.Измерители.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
		
	Результат 									= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаМКД(Объект.Дата, Объект.Организация, Объект.Район, Объект.МКД); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		//Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
		//	СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
		//	IDСтрокиТочки 						= Новый УникальныйИдентификатор;
		//	IDСтрокиТочкиВывод					= Новый УникальныйИдентификатор;
		//	СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
		//	СтрокаТочкиУчета.IDСтрокиВывод 		= IDСтрокиТочкиВывод;
		//	СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
		//	СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
		//	СтрокаТочкиУчета.ПриборУчетаВывод	= Выборка.ПриборУчета;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(Выборка.Шкала) И (НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или НЕ ТекШкала = Выборка.Шкала) Тогда
		//	СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
		//	IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
		//	СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочкиВывод;
		//	СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
		//	СтрокаШкалы.Шкала 					= Выборка.Шкала;
		//	СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		//КонецЕсли;

		//СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		//СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		//СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;   						
		//
		//ТекТочкаУчета 							= Выборка.ТочкаУчета;
		//ТекШкала 								= Выборка.Шкала;
		//ТекПрибор 								= Выборка.ПриборУчета;
		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета или НЕ ТекПрибор = Выборка.ПриборУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  						= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 							= Новый УникальныйИдентификатор;
			IDСтрокиТочкиВывод						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка,, "ПриборУчета");
			СтрокаТочкиУчета.ПриборУчетаВывод		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.IDСтроки 				= IDСтрокиТочки;
			СтрокаТочкиУчета.IDСтрокиВывод 			= IDСтрокиТочкиВывод;
			СтрокаТочкиУчета.РегистрируетОбъемВывод = Выборка.РегистрируетОбъем;
			
			СтрокаИзмерителя 								= Объект.Измерители.Добавить();
			СтрокаИзмерителя.IDСтроки 						= Новый УникальныйИдентификатор;
			СтрокаИзмерителя.IDСтрокиТочкиУчета 			= IDСтрокиТочкиВывод;
			СтрокаИзмерителя.ПриборУчета 					= СтрокаТочкиУчета.ПриборУчетаВывод;
			СтрокаИзмерителя.ВспомогательноеОборудование 	= Ложь;
			СтрокаИзмерителя.ТипПрибораУчета       			= Выборка.ТипПрибораУчета;
			СтрокаИзмерителя.РасположениеИзмерителя			= Выборка.РасположениеИзмерителя; 			
			СтрокаИзмерителя.ТипИзмерителя					= Выборка.ТипИзмерителя;
			СтрокаИзмерителя.Вывод							= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Шкала) И (НоваяТочка Или НЕ ТекШкала = Выборка.Шкала) Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочкиВывод;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			СтрокаШкалы.Вывод 					= Истина;
		КонецЕсли;

		Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.IDСтрокиТочкиУчета 		= IDСтрокиТочкиВывод;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.Вывод 					= Истина;
		КонецЕсли;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекПрибор 								= Выборка.ПриборУчета;
	КонецЦикла; 
	
	СоотвествиеКолонок  						= Новый Структура;
	СоотвествиеКолонок.Вставить("IDСтроки"		, "IDСтрокиВывод");
	СоотвествиеКолонок.Вставить("ПриборУчета"	, "ПриборУчетаВывод");

	//энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,Ложь,Неопределено,СоотвествиеКолонок);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,Ложь,,СоотвествиеКолонок);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);		
	
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры

#Область ВЫБОР_ТИПА_ПУ

&НаКлиенте
Процедура ОткрытьВыборТипаПУ(СтандартнаяОбработка)
	
	ИмяТаблицыТочек 	= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 		= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Соответсвие = новый Соответствие;
	Соответсвие.Вставить("ТипУзлаУчета",ПредопределенноеЗначение("Справочник.энргТипыУзловУчета.ПустаяСсылка"));
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(,ТекущиеДанные.УзелУчета,Соответсвие);
	
	ТипУзлаУчета = Соответсвие["ТипУзлаУчета"];
	Если ЗначениеЗаполнено(ТипУзлаУчета) Тогда 
		КолвоСостава = ПолучитьКолвоСоставаУзла(ТипУзлаУчета);
		
		Если КолвоСостава > 0 Тогда 	
			
			СоответсвиеТипа = новый Соответствие;
			СоответсвиеТипа.Вставить("ТипПрибораУчета","");
			энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(,ТекущиеДанные.ПриборУчетаВывод,СоответсвиеТипа);
			
			СоответсвиеРод = новый Соответствие;
			СоответсвиеРод.Вставить("Родитель","");
			энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(,СоответсвиеТипа["ТипПрибораУчета"],СоответсвиеРод);			
			
			СтандартнаяОбработка = Ложь;
			СтруктураОтбора = Новый Структура("Родитель",СоответсвиеРод["Родитель"]);			
			ПараметрыВыбораФормы	= Новый Структура("Отбор", СтруктураОтбора);
			ОписаниеОповещения 		= Новый ОписаниеОповещения("ТипПрибораУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекущиеДанные));
			
			Форма 					= ОткрытьФорму("Справочник.энргТипыПриборовУчета.ФормаВыбора",ПараметрыВыбораФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список;   			
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПрибораУчетаОкончаниеВыбора(Результат,ДополнительныеПараметры) Экспорт  
	
	Если Результат <> Неопределено Тогда 
		ТекДанные					= ДополнительныеПараметры.ТекДанные;
		ТекДанные.ТипПрибораУчета	= Результат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКолвоСоставаУзла(ТипУзлаУчета)
	Возврат ТипУзлаУчета.СоставУзла.Количество();
КонецФункции

#КонецОбласти

#Область РаботаСУзламиУчета

&НаСервере
Процедура УстановитьВидимостьУзловУчета()
	
	ИспользоватьУзлы = энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД();
	Если НЕ ИспользоватьУзлы Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаСредстваИзмеренияВывод"	, "Видимость", ИспользоватьУзлы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаСредстваИзмерения"		, "Видимость", ИспользоватьУзлы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыШкалыТарифныеЗоны"			, "Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПараметрыОбновления) Экспорт 
	ДанныеОчистки = Новый Структура;
	ДанныеОчистки.Вставить("Измерители"				, Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Ложь));
	ДанныеОчистки.Вставить("ШкалыПриборовУчета"		, Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Ложь));
	ДанныеОчистки.Вставить("ПоказанияПриборовУчета"	, Новый Структура("IDСтрокиТочкиУчета,Вывод",ПараметрыОбновления.IDСтроки, Ложь));
	
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ,ДанныеОчистки);
	ТекСтрока 					= Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", ПараметрыОбновления.IDСтроки));
	ТекСтрока[0].КоэффициентПУ 	= ПараметрыОбновления.Результат.КоэффициентПУ;
	Если ПараметрыОбновления.Результат.ШкалыПриборовУчета.Количество() > 0 Тогда 
		ТекСтрока[0].ВидДифференцированности 	= ПараметрыОбновления.Результат.ШкалыПриборовУчета[0].ВидДифференцированности;
	КонецЕсли;
	ЗаполнитьТекстовыеПоля(ПараметрыОбновления.IDСтроки);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоУслугамСерверВывод(ПараметрыОбновления) Экспорт 
	ДанныеОчистки = Новый Структура;
	ДанныеОчистки.Вставить("Измерители"				, Новый Структура("IDСтрокиТочкиУчета,Ввод"	, ПараметрыОбновления.IDСтроки, Ложь));
	ДанныеОчистки.Вставить("ШкалыПриборовУчета"		, Новый Структура("IDСтрокиТочкиУчета,Вывод", ПараметрыОбновления.IDСтроки, Истина));
	ДанныеОчистки.Вставить("ПоказанияПриборовУчета"	, Новый Структура("IDСтрокиТочкиУчета,Вывод", ПараметрыОбновления.IDСтроки, Истина));
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ,ДанныеОчистки);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтрокиВывод", ПараметрыОбновления.IDСтроки);
	мСтрокаТУ 		= Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	СтрокаТУ 		= мСтрокаТУ[0]; 
	Если СтрокаТУ.ПриборУчета = СтрокаТУ.ПриборУчетаВывод Тогда
		Для каждого стр из ПараметрыОбновления.Результат.Измерители Цикл
			Если стр.Вывод И НЕ стр.ВспомогательноеОборудование Тогда
				СтрокаТУ.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьТекстовыеПоля(ПараметрыОбновления.IDСтроки, "IDСтрокиВывод");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля(IDСтрокиТочкиУчета = Неопределено, ИмяIDСтроки = "IDСтроки")	
	Если IDСтрокиТочкиУчета = Неопределено Тогда
		СтрокиТЧ = Объект.ТочкиУчета;
	Иначе
		СтрокиТЧ = Объект.ТочкиУчета.НайтиСтроки(Новый Структура(ИмяIDСтроки, IDСтрокиТочкиУчета));
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ СтрокиТЧ Цикл
		ДанныеИзмерителейВывод = Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета, Вывод", ТекСтрока.IDСтрокиВывод, Истина));
		Если ДанныеИзмерителейВывод.Количество() = 0 Тогда
			ТекСтрока.СредстваИзмеренияВывод = "Не заполнено";
		Иначе
			ТекСтрока.СредстваИзмеренияВывод = "Заполнено";
		КонецЕсли;
		
		ДанныеИзмерителейВвод = Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки));
		Если ДанныеИзмерителейВвод.Количество() = 0 Тогда
			ТекСтрока.СредстваИзмерения = "Не заполнено";
		Иначе
			ТекСтрока.СредстваИзмерения = "Заполнено";
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры


#Область ЗаполнениеСвойствПриборовУчета

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета, СвойстваПриборовУчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета, Истина);
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция, СвойстваПриборовУчета, ПроверятьПолеВывод = Ложь) 
	
	СоотвествиеРеквизитовСвойств 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		Если ПроверятьПолеВывод И СтрокаКоллекции.Вывод Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
		
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета() 
	Возврат энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
КонецФункции

#КонецОбласти


&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		СвойстваПрибора 									= энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти