#Область ОписаниеПеременных

&НаКлиенте
Перем ПодтвежденоЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргПлатежноеПоручениеВходящие(ЭтотОбъект);	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли; 
	
	ОбновитьКолВоСтрокВТЧ();
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//// Фискализация ОФД
	//Если ПодсистемаИнтеграцияОФДСуществует() Тогда
	//	МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
	//	МодульфискОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект);
	//КонецЕсли;
	//// Фискализация ОФД
	
	УстановитьОтборСвязанныхДокументов();
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПодтвежденоЗакрытие И НЕ ЗавершениеРаботы Тогда			
		СуммаОплат = энргМассовыйВводОплат.СуммаОплатПоСвязаннымДокументам(Объект.Ссылка);
		
		Если НЕ СуммаОплат = Объект.СуммаРеестра Тогда 
			
			Отказ = Истина;
			ТекстВопроса = НСтр("ru = 'Опознанная оплата и сумма реестра не совпадают. Продолжить работу с документом?'");
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект); 			
			ПоказатьВопрос(
				ОповещениеОЗакрытии, 
				ТекстВопроса, 
				РежимДиалогаВопрос.ДаНетОтмена);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		ПодтвежденоЗакрытие = Истина;		
		Закрыть();
				
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета, ТекущийОбъект);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект, яИспользоватьТарифныеЗоны, яИспользоватьШкалыПриборовУчета, ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ТочкиУчета");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "Оплата");
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета, ТекущийОбъект);
	
	ПоказанияПредоставляютсяВСрок();
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();	
	
	//// Фискализация ОФД
	//Если ПодсистемаИнтеграцияОФДСуществует() Тогда
	//	МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
	//	ДокументФискализирован = МодульфискОбщегоНазначения.ПлатежныйДокументОтправленВСистемуОФД(Объект.Ссылка);
	//КонецЕсли;
	//// Фискализация ОФД
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(ТекущийОбъект.Ссылка);
	СуммаОплатПоСозданнымДокументам = СуммаОплатПоСвязаннымДокументам(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаПоДокументу = Объект.Оплата.Итог("СуммаОплаты");
	Если Не ЗначениеЗаполнено(Объект.Примечание) Тогда
		Объект.Примечание = Объект.ФайлДляЧтения;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоЗаписьПослеЗагрузкиДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыЗаписи,
		"ЭтоЗаписьПослеЗагрузкиДанных",
		Ложь);
		
	Если ЭтоЗаписьПослеЗагрузкиДанных Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОтменитьПроверкуСуммыСвязанныхДокументов", Истина);
	КонецЕсли;		
		
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета,ТекущийОбъект); 
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Оплата"); 	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
	//// Фискализация ОФД
	//Если ПодсистемаИнтеграцияОФДСуществует() Тогда
	//	МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
	//	МодульфискОбщегоНазначения.ПослеЗаписи(ЭтотОбъект);
	//КонецЕсли;
	//// Фискализация ОФД
	
	УстановитьОтборСвязанныхДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗависимыеРеквизиты = ПолучитьЗависимыеРеквизиты();
	Если ЗначениеЗаполнено(Объект.Ссылка) И НеобходимоСкорректироватьСвязанныеДокументы(Объект.Ссылка, ЗависимыеРеквизиты) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеВопросаОНеобходимостиКорректировкиСвязанныхДокументов",
			ЭтотОбъект);		
			
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Дата документа была изменена. Даты документов созданных на основании будут скорректированы. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
			
	КонецЕсли;
	
	ЗаполнитьПериодНачисленияСервер();		
	
КонецПроцедуры


&НаКлиенте
Процедура ФайлДляЧтенияПриИзменении(Элемент)
	ОчиститьСвязанныеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	ЕстьПроведенныеСвязанныеДокументы = ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(Объект.Ссылка) ИЛИ 
		ЕстьСозданныеОплатыОтДокументаОснования(Объект.Ссылка);
		
	Если ЗначениеЗаполнено(Объект.Ссылка) и ЕстьПроведенныеСвязанныеДокументы Тогда
		
		Контекст = Новый Структура("ВыполнятьВыборФайла", Истина);
		ОписаниеОповещения = Новый ОписаниеОповещения(	
			"ПослеВопросаОПометкеСвязанныхДокументов",
			ЭтотОбъект,
			Контекст);
			
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'На основании выбранного файла загрузки созданы документы, удалить их?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
		
		Возврат;
		
	КонецЕсли;
	
	ФайлДляЧтенияНачалоВыбораКлиент();
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент) 	
	ОчиститьСвязанныеДанные();	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЕстьПроведенныеСвязанныеДокументы = ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(Объект.Ссылка) ИЛИ 
		ЕстьСозданныеОплатыОтДокументаОснования(Объект.Ссылка);
		
	Если ЗначениеЗаполнено(Объект.Ссылка) и ЕстьПроведенныеСвязанныеДокументы Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(	
			"ПослеВопросаОПометкеСвязанныхДокументов",
			ЭтотОбъект);
			
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'На основании выбранного источника поступления созданы документы, удалить их?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
			
		СтандартнаяОбработка = Ложь;	
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьДанныеРеестра()
	
	Объект.ДатаРеестра = Дата(1, 1, 1);
	Объект.СуммаРеестра = 0;
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ФайлДляЧтения) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите файл для чтения",,"ФайлДляЧтения","ФайлДляЧтения");
		Возврат;
	КонецЕсли;   	
	
	ДвоичныеДанные  	= Новый ДвоичныеДанные(Объект.ФайлДляЧтения); 	
	АдресХранилища  	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
	
	ОписаниеОшибки  	= ЗагрузитьФайлСервер(АдресХранилища,Объект.ИсточникПоступления);
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ПослеСообщенияОбОшибкеПередЗагрузкой",ЭтотОбъект);
	Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
		ПоказатьВопрос(ОписаниеОповещения,ОписаниеОшибки,РежимДиалогаВопрос.ДаНет);
	иначе
		
		ЗарегистрироватьЗаписиКСозданиюДокументов();
		ОбновитьНадписьВыполненияДлительныхОперацийКлиент();		
		Если ОсталосьСоздатьДокументовДлительныхОпераций > 0 Тогда				
			ОткрытьФормуЗапускаСозданияДокументовВФоне();
		КонецЕсли;
		
		Модифицированность = Истина;
		ПараметрыЗаписи = Новый Структура("ЭтоЗаписьПослеЗагрузкиДанных", Истина);
		Записать(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьДанные(Команда)
	
	ТарифныеЗоны=ИспользоватьТарифныеЗоны;
	Шкалы=ИспользоватьШкалыПриборовУчета;
	ИсправитьДанныеНаСервере(ТарифныеЗоны, Шкалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказания(Команда)
	ОбновитьПоказанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗадолженности(Команда)
	
	ТекущиеДанные 							= Элементы.Оплата.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураОтбора = Новый Структура("Период,ПериодНачисления,Организация,Район,Строение,Абонент,Услуга",КонецДня(Объект.Дата));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекущиеДанные);
	
	МассивЗагруженныхПериодов = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	НайденныеСтроки = Объект.Задолженность.НайтиСтроки(Новый Структура("IDСтроки", ТекущиеДанные.IDСтроки));
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		ЗагруженныеДанные = Новый Структура("ПериодНачисления, ВидЗадолженности", Строка.ПериодНачисления, Строка.ВидЗадолженности);
		МассивЗагруженныхПериодов.Добавить(Новый Структура("ПериодНачисления, ВидЗадолженности", Строка.ПериодНачисления, Строка.ВидЗадолженности));
		
	КонецЦикла;
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора, ЗагруженныеПериоды", СтруктураОтбора, МассивЗагруженныхПериодов);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ФормаЗадолженностьОкончаниеВыбора",ЭтаФорма,Новый Структура("IDСтроки", ТекущиеДанные.IDСтроки));
	
	ОткрытьФорму("Документ.энргПлатежноеПоручениеВходящие.Форма.ФормаВыбораЗадолженности",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ПровестиРегистрацииПоказаний(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеПроведениеПоказанийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеРегистрацииПоказаний(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказанийКлиент();
	
КонецПроцедуры


&НаКлиенте
Процедура ПровестиОплаты(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеПроведениеОплатКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеОплат(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеОтменаПроведенияОплатКлиент(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеОплаты(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеПометкаНаУдалениеОплатКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуОплат(Команда)
	
	ОбновитьСуммуОплатКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуОплатКлиент()
	
	ДокументОснование = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	СуммаОплатПоСозданнымДокументам = СуммаОплатПоСвязаннымДокументам(ДокументОснование);
	
КонецПроцедуры

#КонецОбласти

#Область ВыборДиалогаФайла

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбораКлиент()
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПослеВыбораПутиКФайлу" , ЭтотОбъект);
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОбработчикЗавершения, Диалог);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПутиКФайлу(Результат, ДополнительныеПараметры) Экспорт 
	
	ПутьСохранения = "";	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	ОчиститьСвязанныеДанные();
	Объект.ФайлДляЧтения = Результат[0];
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСВкладкойОплат

&НаКлиенте
Процедура ДокументыОплатПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДокументыОплат.ТекущиеДанные;
	ОтображениеЗадолженности.Очистить();
	ОтображениеПереносаСуммыОплаты.Очистить();
	
	Если ТекДанные = Неопределено Тогда	
		Возврат; 		
	КонецЕсли;
	
	СвязанныеДанные = ПолучитьСвязанныеДанныеОплаты(ТекДанные.Ссылка, ТекДанные.IDСтроки);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СвязанныеДанные.ОтображениеЗадолженности, ОтображениеЗадолженности);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СвязанныеДанные.ОтображениеПереносаСуммыОплаты, ОтображениеПереносаСуммыОплаты);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСвязанныеДанныеОплаты(ДокументОснование, IDСтроки)
	
	Возврат Документы.энргЗагрузкаДанныхИзВнешнихИсточников.ПолучитьСвязанныеДанныеОплаты(ДокументОснование, IDСтроки);
	
КонецФункции
	
#КонецОбласти

#Область ФормированиемакетаПоЗагрузкеДанных

&НаКлиенте
Процедура НеЗагруженныеДанные(Команда)
	
	спЗначений = СписокОпераций();
	ВыбратьОперациюИзСписка(спЗначений,Элементы.ЗагрузитьУ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОперациюИзСписка(СписокОпераций, элемент)
	
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВыбратьОперациюИзСпискаЗавершение",ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещения,СписокОпераций, элемент);
	
КонецПроцедуры

&НаКлиенте
Функция СписокОпераций()
	
	Список  = Новый СписокЗначений;
	Список.Добавить(0,"Загруженные данные");
	Список.Добавить(1,"Не загруженные данные");
	
	Возврат Список;	
КонецФункции

&НаКлиенте
Процедура ВыбратьОперациюИзСпискаЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено тогда
		Возврат;
	КонецЕсли;
	Если ВыбранныйЭлемент = Неопределено
		Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ничего не выбрано");
		
	ИначеЕсли ВыбранныйЭлемент.Значение = 0  тогда
		ТабДок = СформироватьПротоколЗагруженныхДанныхНАсервере();
		ТабДок.показать();
	ИначеЕсли ВыбранныйЭлемент.Значение = 1 Тогда
		ТАбДок = СформироватьПротоколНеЗагруженныхДанныхНаСервере();
		ТабДок.показать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРеестр(Команда)
	ТАбДок = СформироватьРеестрНаСервере();
	ИмяФайла	= "ПП №" + СокрЛП(Объект.Номер) + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	СохранитьВЭксель(ТАбДок, ИмяФайла + ".xlsx");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВЭксель(ТабДок, ИмяФайла, ВыбранныйКаталогСохранения = Неопределено)
	
	Попытка
		
		КаталогСохранения = КаталогВременныхФайлов();
		Если НЕ ВыбранныйКаталогСохранения = Неопределено Тогда
			КаталогСохранения = ВыбранныйКаталогСохранения;
		КонецЕсли;		
		ТабДок.Записать(КаталогСохранения + "\" + ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		ЗапуститьПриложение(КаталогСохранения + "\" + ИмяФайла);
		
	Исключение
		
		инфОшибки = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сохранить файл(ы) по причине: " + Символы.ПС + КраткоеПредставлениеОшибки(инфОшибки));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СформироватьПротоколЗагруженныхДанныхНАсервере()
	ТабДок = Документы.энргПлатежноеПоручениеВходящие.СформироватьПротоколЗагруженныхДанных(Объект);
	Возврат табДок;
КонецФункции	

&НаСервере
Функция СформироватьПротоколНеЗагруженныхДанныхНаСервере()
	ТабДок =Документы.энргПлатежноеПоручениеВходящие.СформироватьПротоколНеЗагруженныхДанных(Объект);
	Возврат табДок;
КонецФункции	

&НаСервере
Функция СформироватьРеестрНаСервере()
	ТабДок = Документы.энргПлатежноеПоручениеВходящие.СформироватьРеестрОплат(Объект);
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеСообщенияОбОшибкеПередЗагрузкой(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные  	= Новый ДвоичныеДанные(Объект.ФайлДляЧтения); 	
	АдресХранилища  	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
	
	ЗагрузитьПослеПроверкиПослеЗагрузки(Неопределено, АдресХранилища, Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолВоСтрокВТЧ()
	СтрокВОплате 									= Объект.Оплата.Количество();
	СтрокВПоказаниях 								= Объект.ТочкиУчета.Количество();
	СтрокВНеЗагрежнных								= Объект.НеЗагруженныеДанные.Количество();
	
	Элементы.СтраницаОплата.Заголовок 				= "Оплата" + " (" + СтрокВОплате + ")";
	//Элементы.СтраницаПоказания.Заголовок 			= "Показания приборов учета" + " (" + СтрокВПоказаниях + ")";
	Элементы.СтраницыШкалыТарифныеЗоны.Заголовок	= "Показания приборов учета" + " (" + СтрокВПоказаниях + ")";
	Элементы.СтраницаНеЗагруженныеДанные.Заголовок 	= "Незагруженные данные" + " (" + СтрокВНеЗагрежнных + ")";
КонецПроцедуры

&НаСервере
Функция ЗагрузитьФайлСервер(АдресХранилища,ИсточникПоступления)
	
	ОбъектОбработки 		= ОбъектОбработкиЗагрузки(ИсточникПоступления);
	ДанныеДокумента  		= ОбъектОбработки.ДанныеДокумента();
	ЗаполнитьЗначенияСвойств(ДанныеДокумента,Объект);	
	ОшибкиПеред 			= "";
	Попытка
		ОшибкиПеред 		= ОбъектОбработки.ПередЗагрузкой(АдресХранилища,ДанныеДокумента);
	Исключение
		// Обработка не требуется
	КонецПопытки;
	
	Если ДанныеДокумента.Свойство("РеквизитыФормы") и НЕ ПустаяСтрока(ДанныеДокумента.РеквизитыФормы) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДокумента,ЭтаФорма,ДанныеДокумента.РеквизитыФормы);
	КонецЕсли; 	
	
	Если Не ПустаяСтрока(ОшибкиПеред) Тогда
		Возврат ОшибкиПеред; 
	КонецЕсли;	
	
	ЗагрузитьПослеПроверкиПослеЗагрузки(ОбъектОбработки, АдресХранилища, ДанныеДокумента);	
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПослеПроверкиПослеЗагрузки(Знач ОбъектОбработки, АдресХранилища, ДанныеДокумента) 
	
	Если ОбъектОбработки = Неопределено Тогда
		ОбъектОбработки 	= ОбъектОбработкиЗагрузки(Объект.ИсточникПоступления);
	КонецЕсли; 	
	
	Если ДанныеДокумента = Неопределено Тогда
		ДанныеДокумента 	= ОбъектОбработки.ДанныеДокумента();
		ЗаполнитьЗначенияСвойств(ДанныеДокумента,Объект);		
	КонецЕсли; 
	
	Ошибка  				= ОбъектОбработки.Загрузить(АдресХранилища,ДанныеДокумента);
	
	Если ЗначениеЗаполнено(Ошибка) тогда
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ЗагрузитьПослеПроверкиПослеЗагрузкиПереопределяемый(ОбъектОбработки, АдресХранилища, ДанныеДокумента);
	
	ДействияПослеЗагрузкиФайлаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПослеПроверкиПослеЗагрузкиПереопределяемый(Знач ОбъектОбработки, АдресХранилища, ДанныеДокумента)
	
КонецПроцедуры

&НаСервере
Процедура ДействияПослеЗагрузкиФайлаСервер()
	
	ОбновитьКолВоСтрокВТЧ();
		
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Оплата");
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета,Объект);
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,Объект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, Объект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	ПоказанияПредоставляютсяВСрок();
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПриЗаполненииТабличнойЧастиПоказания();
	ВспомогательныеПараметры.Период = Объект.Дата;
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Неопределено); 
	тзПриборыДляОтклоненияПоказаний 			= ПолучитьТЗПриборыДляОтклоненияПоказаний(); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Объект.Организация,Неопределено,ТаблицаПоказанийДляЗаполнения,Объект.Дата, тзПриборыДляОтклоненияПоказаний);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета,ВспомогательныеПараметры);
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);	
	ПоказанияПредоставляютсяВСрок();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказанияНаСервере()	
	
	Запрос = Новый Запрос;
	Запрос. Текст ="ВЫБРАТЬ
	|	ТекущиеДанные.номерСтроки,
	|	ВЫРАЗИТЬ(ТекущиеДанные.Абонент КАК Справочник.энргАбоненты) КАК Абонент,
	|	ТекущиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанные.КоэффициентПУ КАК Коэффициент,
	|	ТекущиеДанные.МаксимальноВозможныеПоказания КАК МаксимальноВозможные,
	|	ТекущиеДанные.МаксимальноВозможныйОбъемПотребления КАК МаксимальныйОбъемПотребления,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.Переворот КАК ТекущийПереворот,
	|	ТекущиеДанные.СостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем,
	|	ТекущиеДанные.СтатусИзмененПользователем
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанные.номерСтроки,
	|	ТекущиеДанные.Абонент,
	|	ТекущиеДанные.ТочкаУчета,
	|	ТекущиеДанные.ЗначениеТарифа,
	|	ТекущиеДанные.Услуга,
	|	ТекущиеДанные.ПриборУчета,
	|	ТекущиеДанные.Коэффициент,
	|	ТекущиеДанные.МаксимальноВозможные,
	|	ТекущиеДанные.МаксимальныйОбъемПотребления,
	|	ТекущиеДанные.ТекущиеПоказания,
	|	ТекущиеДанные.ТекущийПереворот,
	|	ТекущиеДанные.ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем,
	|	ТекущиеДанные.СтатусИзмененПользователем,
	|	ТекущиеДанные.Абонент.Район КАК Район
	|ПОМЕСТИТЬ ВТ_Срайоном
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Срайоном.номерСтроки,
	|	ВТ_Срайоном.Абонент,
	|	ВТ_Срайоном.ТочкаУчета,
	|	ВТ_Срайоном.ЗначениеТарифа,
	|	ВТ_Срайоном.Услуга,
	|	ВТ_Срайоном.ПриборУчета,
	|	ВТ_Срайоном.Коэффициент,
	|	ВТ_Срайоном.МаксимальноВозможные,
	|	ВТ_Срайоном.МаксимальныйОбъемПотребления,
	|	ВТ_Срайоном.ТекущиеПоказания,
	|	ВТ_Срайоном.ТекущийПереворот,
	|	ВТ_Срайоном.ТекущиеСостояниеПоказаний,
	|	ВТ_Срайоном.ПереворотИзмененПользователем,
	|	ВТ_Срайоном.СтатусИзмененПользователем,
	|	ВТ_Срайоном.Район КАК Район
	|ИЗ
	|	ВТ_Срайоном КАК ВТ_Срайоном
	|ИТОГИ ПО
	|	Район";
	
	
	ТекущиеДанные  			= Объект.Показания.Выгрузить();
	ПоказанияПоРайону		= ТекущиеДанные.Скопировать();
	ПоказанияПоРайону.Очистить();
	
	Запрос.УстановитьПараметр("ТекущиеДанные",ТекущиеДанные);
	РезультатЗапроса 		= Запрос.Выполнить();
	
	ВыборкаРайон 			= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРайон.Следующий() Цикл
		// Вставить обработку выборки ВыборкаРайон 		
		Выборка 			= ВыборкаРайон.Выбрать(); 		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ПоказанияПоРайону.Добавить(),Выборка);
		КонецЦикла;      		
		ПоказанияПоРайону.Очистить();		
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере 
Процедура ИсправитьДанныенаСервере(ТарифнаяЗона, Шкала)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПериодОплаты КАК ПериодОплаты,
	|	ТекущиеДанные.СуммаОплаты КАК СуммаОплаты,
	|	ТекущиеДанные.ФИОПлательщика КАК ФИОПлательщика,
	|	ТекущиеДанные.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ТекущиеДанные.ЛицевойСчет КАК ЛицевойСчет,
	|	ТекущиеДанные.НомерПрибораУчета КАК НомерПрибораУчета,
	|	ТекущиеДанные.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	|	ТекущиеДанные.НомерПлатежногоДокумента КАК НомерПлатежа,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	энргАбоненты.Ссылка КАК Абонент,
	|	ТекущиеДанные.СуммаОплаты КАК СуммаОплаты,
	|	ТекущиеДанные.ПериодОплаты КАК ПериодОплаты,
	|	ТекущиеДанные.ДатаПлатежа КАК ДатаПлатежа,
	|	ТекущиеДанные.НомерПлатежа КАК НомерПлатежа,
	|	ТекущиеДанные.ФИОПлательщика КАК ФИОПлательщика,
	|	ТекущиеДанные.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргФилиалыАбонентовСрезПоследних.Филиал КАК Филиал
	|ПОМЕСТИТЬ ВТ_Абонент
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних(&ДатаДок, ) КАК энргФилиалыАбонентовСрезПоследних
	|			ПО энргАбоненты.Ссылка = энргФилиалыАбонентовСрезПоследних.Абонент
	|		ПО ТекущиеДанные.ЛицевойСчет = энргАбоненты.ЛицевойСчет
	|ГДЕ
	|	энргАбоненты.ЛицевойСчет = ТекущиеДанные.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга,
	|	ВТ_Абонент.Абонент КАК Абонент,
	|	энргУслугиТочекУчетаСрезПоследних.Период КАК Период,
	|	энргУслугиТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргУслугиТочекУчетаСрезПоследних.Организация КАК Организация,
	|	энргУслугиТочекУчетаСрезПоследних.Район КАК Район
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	ВТ_Абонент КАК ВТ_Абонент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|				&ДатаДок,
	|				КлючПомещения В
	|					(ВЫБРАТЬ
	|						ВТ_Абонент.КлючПомещения КАК КлючПомещения
	|					ИЗ
	|						ВТ_Абонент КАК ВТ_Абонент)) КАК энргУслугиТочекУчетаСрезПоследних
	|		ПО ВТ_Абонент.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
	|ГДЕ
	|	энргУслугиТочекУчетаСрезПоследних.Услуга = ВТ_Абонент.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	ВТ_Услуги.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ТочкиУчета
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|				&ДатаДок,
	|				(Организация, Район, КлючПомещения) В
	|					(ВЫБРАТЬ
	|						ВТ_Услуги.Организация КАК Организация,
	|						ВТ_Услуги.Район КАК Район,
	|						ВТ_Услуги.КлючПомещения КАК КлючПомещения
	|					ИЗ
	|						ВТ_Услуги КАК ВТ_Услуги)) КАК энргАктивностьТочекУчетаСрезПоследних
	|		ПО ВТ_Услуги.ТочкаУчета = энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВТ_Услуги.КлючПомещения = энргАктивностьТочекУчетаСрезПоследних.КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Организация КАК Организация,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Район КАК Район,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(энргВидыКанальностиШкалы.Шкала) КАК Шкала
	|ПОМЕСТИТЬ ВТ_ПриборыУчета
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУчетаАбонента.СрезПоследних(
	|			&ДатаДок,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ВТ_Услуги.Организация КАК Организация,
	|					ВТ_Услуги.Район КАК Район,
	|					ВТ_Услуги.КлючПомещения КАК КлючПомещения,
	|					ВТ_Услуги.ТочкаУчета КАК ТочкаУчета
	|				ИЗ
	|					ВТ_Услуги КАК ВТ_Услуги)) КАК энргСостояниеПриборовУчетаАбонентаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|ГДЕ
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Состояние = ЗНАЧЕНИЕ(перечисление.энргСостояниеПриборовУчета.Ввод)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Организация,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Район,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПриборовУчетаСрезПоследних.Организация КАК Организация,
	|	энргПоказанияПриборовУчетаСрезПоследних.Район КАК Район,
	|	энргПоказанияПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчетаСрезПоследних.Шкала КАК Шкала,
	|	МАКСИМУМ(энргПоказанияПриборовУчетаСрезПоследних.Показание) КАК Показание,
	|	МАКСИМУМ(энргПоказанияПриборовУчетаСрезПоследних.Период) КАК ДатаПоследнихПоказаний
	|ПОМЕСТИТЬ ВТ_ПоказаниеПрибора
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета.СрезПоследних(
	|			&ДатаДок,
	|			(Организация, Район, КлючПомещения, ПриборУчета, Шкала) В
	|					(ВЫБРАТЬ
	|						ВТ_ПриборыУчета.Организация КАК Организация,
	|						ВТ_ПриборыУчета.Район КАК Район,
	|						ВТ_ПриборыУчета.КлючПомещения КАК КлючПомещения,
	|						ВТ_ПриборыУчета.ПриборУчета КАК ПриборУчета,
	|						ВТ_ПриборыУчета.Шкала КАК Шкала
	|					ИЗ
	|						ВТ_ПриборыУчета КАК ВТ_ПриборыУчета)
	|				И СостояниеПоказаний = ЗНАЧЕНИЕ(перечисление.энргСостояниеПоказаний.Приняты)) КАК энргПоказанияПриборовУчетаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПриборовУчетаСрезПоследних.Организация,
	|	энргПоказанияПриборовУчетаСрезПоследних.Район,
	|	энргПоказанияПриборовУчетаСрезПоследних.КлючПомещения,
	|	энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	|	энргПоказанияПриборовУчетаСрезПоследних.Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.Организация КАК Организация,
	|	ВТ_Услуги.Район КАК Район,
	|	ВТ_Услуги.КлючПомещения КАК КлючПомещения,
	|	ВТ_Услуги.Услуга КАК Услуга,
	|	МАКСИМУМ(ВТ_ПриборыУчета.ПриборУчета) КАК ПриборУчета,
	|	ВТ_Услуги.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_УслугиИПриборыУчета
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПриборыУчета КАК ВТ_ПриборыУчета
	|		ПО ВТ_Услуги.Организация = ВТ_ПриборыУчета.Организация
	|			И ВТ_Услуги.Район = ВТ_ПриборыУчета.Район
	|			И ВТ_Услуги.КлючПомещения = ВТ_ПриборыУчета.КлючПомещения
	|			И ВТ_Услуги.ТочкаУчета = ВТ_ПриборыУчета.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Услуги.Организация,
	|	ВТ_Услуги.Район,
	|	ВТ_Услуги.КлючПомещения,
	|	ВТ_Услуги.Услуга,
	|	ВТ_Услуги.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УслугиИПриборыУчета.Организация КАК Организация,
	|	ВТ_УслугиИПриборыУчета.Район КАК Район,
	|	ВТ_УслугиИПриборыУчета.КлючПомещения КАК КлючПомещения,
	|	ВТ_УслугиИПриборыУчета.Услуга КАК Услуга,
	|	ВТ_УслугиИПриборыУчета.ПриборУчета КАК ПриборУчета,
	|	ВТ_ПриборыУчета.Шкала КАК Шкала,
	|	ВТ_ПриборыУчета.ТочкаУчета КАК ТочкаУчета,
	|	ЗНАЧЕНИЕ(перечисление.энргСостояниеПоказаний.Приняты) КАК ПредыдущиеПоказания,
	|	ЕСТЬNULL(ВТ_ПоказаниеПрибора.Показание, 0) КАК СостояниеПоказаний,
	|	ВТ_ПоказаниеПрибора.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний
	|ПОМЕСТИТЬ ВТ_ПриборыПомещения
	|ИЗ
	|	ВТ_УслугиИПриборыУчета КАК ВТ_УслугиИПриборыУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриборыУчета КАК ВТ_ПриборыУчета
	|		ПО ВТ_УслугиИПриборыУчета.Организация = ВТ_ПриборыУчета.Организация
	|			И ВТ_УслугиИПриборыУчета.Район = ВТ_ПриборыУчета.Район
	|			И ВТ_УслугиИПриборыУчета.КлючПомещения = ВТ_ПриборыУчета.КлючПомещения
	|			И ВТ_УслугиИПриборыУчета.ПриборУчета = ВТ_ПриборыУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказаниеПрибора КАК ВТ_ПоказаниеПрибора
	|		ПО ВТ_УслугиИПриборыУчета.Организация = ВТ_ПоказаниеПрибора.Организация
	|			И ВТ_УслугиИПриборыУчета.Район = ВТ_ПоказаниеПрибора.Район
	|			И ВТ_УслугиИПриборыУчета.КлючПомещения = ВТ_ПоказаниеПрибора.КлючПомещения
	|			И ВТ_УслугиИПриборыУчета.ПриборУчета = ВТ_ПоказаниеПрибора.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_САбонентом.Абонент КАК Абонент,
	|	ВТ_ПриборыПомещения.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ПриборыПомещения.Услуга КАК Услуга,
	|	ВТ_САбонентом.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_САбонентом.ПериодОплаты КАК ПериодОплаты,
	|	ВТ_САбонентом.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_САбонентом.ФИОПлательщика КАК ФИОПлательщика,
	|	ВТ_САбонентом.НомерПлатежа КАК НомерПлатежа,
	|	ВТ_САбонентом.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТ_САбонентом.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_САбонентом.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВТ_САбонентом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ПриборыПомещения.ПриборУчета КАК ПриборУчета,
	|	ВТ_ПриборыПомещения.Шкала КАК Шкала,
	|	ВТ_САбонентом.Филиал КАК Филиал,
	|	ВТ_ПриборыПомещения.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	ВТ_ПриборыПомещения.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВТ_ПриборыПомещения.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение
	|ПОМЕСТИТЬ ВТ_СКлючом
	|ИЗ
	|	ВТ_Абонент КАК ВТ_САбонентом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриборыПомещения КАК ВТ_ПриборыПомещения
	|		ПО ВТ_САбонентом.КлючПомещения = ВТ_ПриборыПомещения.КлючПомещения
	|			И ВТ_САбонентом.Услуга = ВТ_ПриборыПомещения.Услуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВТ_САбонентом.КлючПомещения = энргКлючиПомещений.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПриборыПомещения.ТочкаУчета,
	|	ВТ_САбонентом.Абонент,
	|	ВТ_САбонентом.СуммаОплаты,
	|	ВТ_САбонентом.ПериодОплаты,
	|	ВТ_САбонентом.НазначениеПлатежа,
	|	ВТ_САбонентом.ФИОПлательщика,
	|	ВТ_САбонентом.НомерПлатежа,
	|	ВТ_САбонентом.ДатаПлатежа,
	|	ВТ_САбонентом.ТекущиеПоказания,
	|	ВТ_САбонентом.НомерСтроки,
	|	ВТ_САбонентом.ТарифнаяЗона,
	|	ВТ_ПриборыПомещения.Услуга,
	|	ВТ_ПриборыПомещения.ПриборУчета,
	|	ВТ_ПриборыПомещения.Шкала,
	|	ВТ_САбонентом.Филиал,
	|	ВТ_ПриборыПомещения.ПредыдущиеПоказания,
	|	ВТ_ПриборыПомещения.СостояниеПоказаний,
	|	ВТ_ПриборыПомещения.ДатаПоследнихПоказаний,
	|	энргКлючиПомещений.Строение,
	|	энргКлючиПомещений.Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Услуги.Услуга КАК Услуга,
	|	ВТ_Услуги.Абонент КАК Абонент,
	|	ВТ_Услуги.Период КАК Период,
	|	ВТ_Услуги.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТочкиУчета.КлючПомещения КАК КлючПомещения,
	|	ВТ_ТочкиУчета.Абонент КАК Абонент
	|ИЗ
	|	ВТ_ТочкиУчета КАК ВТ_ТочкиУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СКлючом.Абонент КАК Абонент,
	|	ВТ_СКлючом.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_СКлючом.Услуга КАК Услуга,
	|	ВТ_СКлючом.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_СКлючом.ПериодОплаты КАК ПериодОплаты,
	|	ВТ_СКлючом.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_СКлючом.ФИОПлательщика КАК ФИОПлательщика,
	|	ВТ_СКлючом.НомерПлатежа КАК НомерПлатежа,
	|	ВТ_СКлючом.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТ_СКлючом.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_СКлючом.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВТ_СКлючом.НомерСтроки КАК НомерСтроки,
	|	ВТ_СКлючом.Абонент.КлючПомещения КАК КлючПомещения,
	|	ВТ_СКлючом.ПриборУчета КАК ПриборУчета,
	|	ВТ_СКлючом.Шкала КАК Шкала,
	|	ВТ_СКлючом.Филиал КАК Район,
	|	ВТ_СКлючом.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	ВТ_СКлючом.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВТ_СКлючом.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	ВТ_СКлючом.Строение КАК Строение,
	|	ВТ_СКлючом.Помещение КАК Помещение
	|ИЗ
	|	ВТ_СКлючом КАК ВТ_СКлючом";
	
	
	
	
	ТекущиеДанные  			= Объект.НеЗагруженныеДанные.Выгрузить();
	Запрос.УстановитьПараметр("ТекущиеДанные", ТекущиеДанные);
	Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
	
	нТочкиУчета = Объект.ТочкиУчета.Выгрузить();
	
	нНеНазгрДанные = Объект.ПоказанияПриборовУчета.Выгрузить();
	
	Результат = Запрос.ВыполнитьПакет();
	Если Результат[9].Пустой() тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не найдена услуга'"));
		Возврат;
	КонецЕсли;
	Если Результат[10].Пустой() тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не найдена точка учета'"));
		Возврат;
	Иначе 
		ДанныеЗапроса = Результат[11];
		Выборка = ДанныеЗапроса.выбрать();
	КонецЕсли;
	
	ТекТочкаУчета 								= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	
	Если ТарифнаяЗона = Истина и Шкала = Истина Тогда
		Пока Выборка.Следующий() цикл
			НоваяТочка=Ложь;
			
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				СтрокаТочкиУчета.Абонент			= Выборка.Абонент; 
			КонецЕсли;
			
			Если НоваяТочка  Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТекущиеПоказания        = Выборка.текущиепоказания;
			СтрокаПоказаний.ТарифнаяЗона        	= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.Сумма					= Выборка.СуммаОплаты;
			СтрокаПоказаний.КоэффициентПУ			= 1;
			СтрокаПоказаний.СостояниеПоказаний		= Перечисления.энргСостояниеПоказаний.Приняты;
			СтрокаПоказаний.ПредыдущиеПоказания		= Выборка.ПредыдущиеПоказания;
			СтрокаПоказаний.ДатаПоследнихПоказаний	= Выборка.ДатаПоследнихПоказаний;
			
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.периодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ТарифнаяЗона и Шкала Тогда 
		
		Пока Выборка.Следующий() цикл
			НоваяТочка = Ложь;
			
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				СтрокаТочкиУчета.Абонент			= Выборка.Абонент; 
				СтрокаТочкиУчета.КлючПомещения		= Выборка.КлючПомещения;
			КонецЕсли;
			
			Если НоваяТочка  Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ТекущиеПоказания        = Выборка.текущиепоказания;
				СтрокаШкалы.Сумма					= Выборка.СуммаОплаты;
				СтрокаШкалы.КоэффициентПУ			= 1;
				СтрокаШкалы.СостояниеПоказаний		= Перечисления.энргСостояниеПоказаний.Приняты;
			КонецЕсли;
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.ПериодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
	КонецЕсли;
	
	Если не Шкала и ТарифнаяЗона Тогда
		
		Пока Выборка.Следующий() цикл
			НоваяТочка = Ложь;
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				
			КонецЕсли;
			
			Если НоваяТочка  Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона        	= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.ТекущиеПоказания        = Выборка.ТекущиеПоказания;
			СтрокаПоказаний.Сумма					= Выборка.СуммаОплаты;
			СтрокаПоказаний.ПредыдущиеПоказания		= Выборка.ПредыдущиеПоказания;
			СтрокаПоказаний.ДатаПоследнихПоказаний	= Выборка.ДатаПоследнихПоказаний;
			СтрокаПоказаний.КоэффициентПУ			= 1;
			СтрокаПоказаний.СостояниеПоказаний		= Перечисления.энргСостояниеПоказаний.Приняты;
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.ПериодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если не Шкала и не ТарифнаяЗона Тогда
		Пока Выборка.Следующий() цикл
			НоваяТочка = Ложь;
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				СтрокаТочкиУчета.Абонент			= Выборка.Абонент; 
				СтрокаТочкиУчета.ТекущиеПоказания        = Выборка.ТекущиеПоказания;
				СтрокаТочкиУчета.Сумма					 = Выборка.СуммаОплаты;
				СтрокаТочкиУчета.КоэффициентПУ			 = 1;
				СтрокаТочкиУчета.СостояниеПоказаний		 = Перечисления.энргСостояниеПоказаний.Приняты;
			КонецЕсли;
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.ПериодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
		
	КонецЕсли;
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета,Объект);
	
	объект.НеЗагруженныеДанные.Удалить(Выборка.НомерСтроки-1);	
	
	ОбновитьКолВоСтрокВТЧ();
	
КонецПроцедуры

&НаСервере 
Функция УслугиАбонента(Период,ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Абонент
	|ИЗ
	|	Справочник.энргАбоненты КАК энргАбоненты
	|ГДЕ
	|	энргАбоненты.ЛицевойСчет = &ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	ВТ_Абонент КАК ВТ_Абонент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(&Период, ) КАК энргУслугиТочекУчетаСрезПоследних
	|		ПО ВТ_Абонент.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
	|			И ВТ_Абонент.Район = энргУслугиТочекУчетаСрезПоследних.Район
	|			И ВТ_Абонент.Организация = энргУслугиТочекУчетаСрезПоследних.Организация";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	МассивПриборов 		= новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПриборов.Добавить(Выборка.Услуга);
	КонецЦикла;
	
	Возврат МассивПриборов; 
	
КонецФункции

&НаКлиенте
Процедура НеЗагруженныеДанныеУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные=Элементы.НеЗагруженныеДанные.ТекущиеДанные;
	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура("Отбор", Новый Структура("Ссылка", УслугиАбонента(Объект.Дата,ТекущиеДанные.лицевойсчет)));
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", ПараметрыФормы, Элемент);	
	
КонецПроцедуры

&НаСервере
Функция ОбъектОбработкиЗагрузки(ИсточникПоступления) 
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Источник",ИсточникПоступления);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргНастройкиЗагрузкиОплаты.ОбработкаЗагрузки
	|ИЗ
	|	РегистрСведений.энргНастройкиЗагрузкиОплаты КАК энргНастройкиЗагрузкиОплаты
	|ГДЕ
	|	энргНастройкиЗагрузкиОплаты.Источник = &Источник";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить обработку для загрузки файла");
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка  = Результат.Выбрать();
	Выборка.Следующий();
	
	ВнешняяОбработкаОбъект  = Выборка.ОбработкаЗагрузки.ПолучитьОбъект();
	ИмяФайла  				= ПолучитьИмяВременногоФайла("epf");
	ДвоичныеДанные 			= ВнешняяОбработкаОбъект.ХранилищеОбработки.получить();
	ДвоичныеДанные.записать(ИмяФайла);
	
	Возврат ВнешниеОбработки.Создать(ИмяФайла,Ложь);
КонецФункции

&НаКлиенте
Процедура ФормаЗадолженностьОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		
		Модифицированность	= Истина;
		
		Для каждого СтрокаДолг Из РезультатЗакрытия Цикл
			
			СтрокаТЗ = Объект.Задолженность.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаДолг);
			СтрокаТЗ.IDСтроки = ДополнительныеПараметры.IDСтроки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СервисПроверкиПоказанийПриборовУчета

&НаСервере
Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний()
	
	ТаблицаПриборов = энргРаботаСПоказаниямиПриборовУчетаСервер.НоваяТаблицаПриборовДляПроверки();
	Для Каждого ТекСтрока из Объект.ТочкиУчета Цикл
		НСтрока = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		НСтрока.Район 			= ТекСтрока.Район;
		НСтрока.КлючПомещения 	= ТекСтрока.КлючПомещения;
	КонецЦикла;
	
	ПериодЗапроса 		= Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПроверкиОтклоненияПоказаний();
	ВспомогательныеПараметры.ПоказанияВСрок = ПоказанияВСрок;
	ВспомогательныеПараметры.ПериодНачисления = Объект.ПериодНачисления;
	
	РезультатЗапроса = энргРаботаСПоказаниямиПриборовУчетаСервер.ПриборыДляОтклоненияПоказаний(ПериодЗапроса, Объект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ЭтотОбъект, РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ПоказанияПредоставляютсяВСрок()
	ПоказанияВСрок = энргРаботаСПоказаниямиПриборовУчетаСервер.ПоказанияПредоставляютсяВСрок(Объект.ПериодНачисления, Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗПриборыДляОтклоненияПоказаний()
	
	тзПриборыДляОтклоненияПоказаний 							= Новый ТаблицаЗначений;		
	
	тзПриборыДляОтклоненияПоказаний.Колонки.добавить("ПриборУчета",						Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	тзПриборыДляОтклоненияПоказаний.Колонки.добавить("СостояниеПоказаний",				Новый ОписаниеТипов("ПеречислениеСсылка.энргСостояниеПоказаний"));
	тзПриборыДляОтклоненияПоказаний.Колонки.добавить("ПричинаОтклонения",				Новый ОписаниеТипов("ПеречислениеСсылка.энргПричиныОтклоненияПоказаний"));
	
	
	
	Для Каждого ТекСтрока из ЭтотОбъект.ПриборыДляОтклоненияПоказаний Цикл
		НСтрока = тзПриборыДляОтклоненияПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		
	КонецЦикла;
	
	Возврат тзПриборыДляОтклоненияПоказаний;
	
КонецФункции

#КонецОбласти


#Область РаботаССвязаннымиДокументами

&НаСервере
Процедура ЗарегистрироватьЗаписиКСозданиюДокументов()
	
	НаборыЗаписей = Новый Структура;
	
	// Показания
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаПоказанийТочкиУчета);
	НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);	
	НаборыЗаписей.Вставить("ТочкиУчета", НаборЗаписей);
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаПоказанийШкалыПриборовУчета);
	НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
	НаборыЗаписей.Вставить("ШкалыПриборовУчета", НаборЗаписей);
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаПоказанийПоказанияПриборовУчета);
	НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
	НаборыЗаписей.Вставить("ПоказанияПриборовУчета", НаборЗаписей);	
	
	Результат = Новый Структура("Статус", Истина);
	ПодготовитьНаборыЗаписейПоказаний(НаборыЗаписей);
	
	// Оплата
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаОплат);
	НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
	НаборыЗаписей.Вставить("Оплата", НаборЗаписей);
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаОплатЗадолженность);
	НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
	НаборыЗаписей.Вставить("Задолженность", НаборЗаписей);
	
	ПодготовитьНаборЗаписейОплат(НаборыЗаписей);
	
	НачатьТранзакцию();	
	Попытка
		
		Для Каждого СтрокаНабора из НаборыЗаписей Цикл
			
			ТаблицаЗаписи = СтрокаНабора.Значение;
			ТаблицаЗаписи.Записать();
						
		КонецЦикла;
		
		Объект.ТочкиУчета.Очистить();
		Объект.ШкалыПриборовУчета.Очистить();
		Объект.ПоказанияПриборовУчета.Очистить(); 
		Объект.Оплата.Очистить();
		Объект.Задолженность.Очистить();
		
		ЗафиксироватьТранзакцию();
	Исключение
	
		ОтменитьТранзакцию(); 	
		
		Результат.Статус = Ложь;
		ИнфаОбОшибке 									= ИнформацияОбОшибке();
		ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
		ПараметрыЖурнала.ТекстПользователю 				= "Не удалось данные из внешних источников по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка данных из внешних источников", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала);
		
	КонецПопытки;
	
	УстановитьОтборСвязанныхДокументов();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСвязанныхДокументов()
	
	УстановитьОтборДокументовОплат();
	УстановитьОтборДокументовРегистрацииПоказаний();  	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДинамическиеСпискиСвязанныхДокументов()
	
	Элементы.ДокументыОплат.Обновить();
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры

#Область ИзмененияСвязанныхРеквизитов

&НаСервереБезКонтекста
Функция НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты)
	
	НеобходимоКорректироватьОплаты = энргМассовыйВводОплат.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
	НеобходимоКорректироватьПоказания = энргМассоваяРегистрацияПоказаний.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
	
	Возврат НеобходимоКорректироватьОплаты ИЛИ НеобходимоКорректироватьПоказания;
	
КонецФункции 

&НаКлиенте
Процедура ПослеВопросаОНеобходимостиКорректировкиСвязанныхДокументов(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		УстановитьДатуОтСвязанныхДокументовПоказаний();
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовКлиент();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗависимыеРеквизиты()
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", Объект.Дата);
	Результат.Вставить("Организация", Объект.Организация);
	Результат.Вставить("Район", Объект.Район);
	Результат.Вставить("АбонентскийОтдел", Объект.АбонентскийОтдел);
	Результат.Вставить("ИсточникПоступления", Объект.ИсточникПоступления);
	Результат.Вставить("ФайлДляЧтения", Объект.ФайлДляЧтения); 	
	Результат.Вставить("ПериодНачисления", Объект.ПериодНачисления);
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#Область ПометкаНаУдалениеСвязанныхДокументов

&НаКлиенте
Процедура ПослеВопросаОПометкеСвязанныхДокументов(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСвязанныеДанные();	
	ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказанийКлиент(ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСвязанныеДанные()
	
	Объект.НеЗагруженныеДанные.Очистить();
	ОчиститьДанныеРеестра(); 	
	ОчиститьСвязанныеДанныеПереопределяемый();
	
	ОбновитьКолВоСтрокВТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСвязанныеДанныеПереопределяемый()
	
	// Переопределено
	
КонецПроцедуры

#КонецОбласти




#Область СервисСозданияДокументовРегистрацииПоказаний

&НаСервере
Функция ПодготовитьНаборыЗаписейПоказаний(НаборыЗаписей)
	
	СвойстваАбонента = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Абонент КАК Абонент
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргАбоненты.Ссылка КАК Абонент,
		|	МАКСИМУМ(энргАбоненты.Организация) КАК Организация,
		|	МАКСИМУМ(энргАбоненты.Район) КАК Район
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО ТаблицаДанных.Абонент = энргАбоненты.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	энргАбоненты.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", Объект.ТочкиУчета.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЗначениеКлюча = Новый Структура("Организация,Район");
		ЗаполнитьЗначенияСвойств(ЗначениеКлюча, Выборка);
		СвойстваАбонента.Вставить(Выборка.Абонент, ЗначениеКлюча);
	КонецЦикла; 	
	
	ОтборШкал = Новый Структура("IDСтрокиТочкиУчета", Неопределено);
	ОтборПоказаний = Новый Структура("IDСтроки", Неопределено);
	Для Каждого СтрокаТочкиУчета из Объект.ТочкиУчета Цикл 
		
		НоваяСтрокаТУ = НаборыЗаписей.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТУ, СтрокаТочкиУчета);
		ДанныеАбонента = СвойстваАбонента[СтрокаТочкиУчета.Абонент];
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТУ, ДанныеАбонента); 		
		НоваяСтрокаТУ.ДокументОснование = Объект.Ссылка;
		НоваяСтрокаТУ.ДатаДокумента = Объект.Дата;
		НоваяСтрокаТУ.ПериодНачисления = Объект.ПериодНачисления;
		//НоваяСтрокаТУ.Организация = Объект.Организация;
		//НоваяСтрокаТУ.Район = Объект.Район;	
		
		ОтборШкал.IDСтрокиТочкиУчета = СтрокаТочкиУчета.IDСтроки;
		СтрокиШкал = Объект.ШкалыПриборовУчета.НайтиСтроки(ОтборШкал);		
		Для Каждого СтрокаШкалы из СтрокиШкал Цикл 
			
			НоваяСтрокаШкал = НаборыЗаписей.ШкалыПриборовУчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШкал, СтрокаШкалы);
			НоваяСтрокаШкал.ДокументОснование = Объект.Ссылка;
			НоваяСтрокаШкал.IDСтрокиТочкиУчета = СтрокаТочкиУчета.IDСтроки;
			
			ОтборПоказаний.IDСтроки = СтрокаШкалы.IDСтроки;
			СтрокиПоказаний = Объект.ПоказанияПриборовУчета.НайтиСтроки(ОтборПоказаний);
			Для Каждого СтрокаПоказаний из СтрокиПоказаний Цикл 
				
				НоваяСтрокаПоказаний = НаборыЗаписей.ПоказанияПриборовУчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказаний, СтрокаПоказаний);
				НоваяСтрокаПоказаний.ДокументОснование = Объект.Ссылка;
				НоваяСтрокаПоказаний.IDСтрокиТочкиУчета = СтрокаТочкиУчета.IDСтроки;		
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецФункции

&НаСервере
Процедура УстановитьОтборДокументовРегистрацииПоказаний()

	//ДокументОснованиеСсылка = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	ДокументОснованиеСсылка = ?(
		ЗначениеЗаполнено(Объект.Ссылка), 
		Объект.Ссылка, 
		Документы.энргЗагрузкаДанныхИзВнешнихИсточников.ПолучитьСсылку(Новый УникальныйИдентификатор)); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ДокументыПоказанийПриборовУчета,
		"ДокументОснование",
		ДокументОснованиеСсылка);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ДокументыПоказанийПриборовУчета,
		"ПоказыватьОтклоненные",
		Ложь);	
		
КонецПроцедуры


#Область ОтчетПоказаний

&НаКлиенте
Процедура ДокументыПоказанийПриборовУчетаПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДокументыПоказанийПриборовУчета.ТекущиеДанные;
	ДанныеРегистрацииПоказаний = Новый ТабличныйДокумент;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПоказанийПриборовУчетаПриАктивизацииСтрокиНаСервере(ДанныеРегистрацииПоказаний, ТекДанные.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументыПоказанийПриборовУчетаПриАктивизацииСтрокиНаСервере(ТабДок, ДокументПоказаний)	
	
	энргМассоваяРегистрацияПоказаний.ЗаполнитьМакетПоказанийПоДокументуПоказаний(ТабДок, ДокументПоказаний);
	
КонецФункции   
	
#КонецОбласти

#Область РаботаССостояниемДокументовПоказаний


#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовКлиент()
	
	// 1. Запуск фонового задания на сервере.
	ЗависимыеРеквизиты = ПолучитьЗависимыеРеквизиты();
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитов", ЭтотОбъект);
	
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка, 
		ЗависимыеРеквизиты);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитов(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ОбновитьДинамическиеСпискиСвязанныхДокументов();	
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовОплатКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПроведениеПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеПроведениеПоказанийКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияПроведениеПоказаний", ЭтотОбъект);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеПроведениеПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
		
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияПроведениеПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиОтменаПроведенияПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказанийКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияОтменаПроведенияПоказаний", ЭтотОбъект);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияОтменаПроведенияПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиУстановкаПометкиУдаленияПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказанийКлиент(ДополнительныеПараметры) 
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияУстановкаПометкиУдаленияПоказаний", ЭтотОбъект, ДополнительныеПараметры);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияУстановкаПометкиУдаленияПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияОплатКлиент(ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДатойДокумента

&НаКлиенте
Процедура УстановитьДатуОтСвязанныхДокументовПоказаний()
	
	Объект.Дата = ПолучитьДатуОтСвязанныхДокументовПоказаний(Объект.Ссылка, Объект.Дата);	
	ЗаполнитьПериодНачисленияСервер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента)
	
	Возврат энргМассоваяРегистрацияПоказаний.ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента);
	
КонецФункции

#КонецОбласти

#КонецОбласти 

#Область ПриИзмененииФайлаЗагрузки

&НаСервереБезКонтекста
Функция ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(ДокументОснование)
	
	Возврат энргМассоваяРегистрацияПоказаний.ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(ДокументОснование);
	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область СервисСозданияДокументовОплат

&НаСервере
Функция ПодготовитьНаборЗаписейОплат(НаборыЗаписей)
	
	ОтборЗадолженности = Новый Структура("IDСтроки", Неопределено);
	Для Каждого СтрокаТочкиУчета из Объект.Оплата Цикл 
		
		НоваяСтрокаТУ = НаборыЗаписей.Оплата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТУ, СтрокаТочкиУчета);
		
		НоваяСтрокаТУ.ИдентификаторСтроки = "" + Новый УникальныйИдентификатор;
		НоваяСтрокаТУ.ДокументОснование = Объект.Ссылка;
		НоваяСтрокаТУ.ДатаДокумента = Объект.Дата;
		НоваяСтрокаТУ.ПериодНачисления = Объект.ПериодНачисления;
		НоваяСтрокаТУ.Организация = Объект.Организация;
		НоваяСтрокаТУ.Район = Объект.Район;
		
		ОтборЗадолженности.IDСтроки = СтрокаТочкиУчета.IDСтроки;
		СтрокиЗадолженности = Объект.Задолженность.НайтиСтроки(ОтборЗадолженности);
		Разделитель = 0;
		Для Каждого СтрокаЗадолженности из СтрокиЗадолженности Цикл 
			
			НоваяСтрокаЗадолженности = НаборыЗаписей.Задолженность.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗадолженности, СтрокаЗадолженности); 
			НоваяСтрокаЗадолженности.ДокументОснование = Объект.Ссылка;
			НоваяСтрокаЗадолженности.ИдентификаторСтроки = НоваяСтрокаТУ.ИдентификаторСтроки; 			
			НоваяСтрокаЗадолженности.Разделитель = Разделитель;
			
			Разделитель = Разделитель + 1;
		КонецЦикла;
				
	КонецЦикла;	
	
КонецФункции

&НаСервере
Процедура УстановитьОтборДокументовОплат()
	
	ДокументОснованиеСсылка = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ДокументыОплат,
		"ДокументОснование",
		ДокументОснованиеСсылка);	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СуммаОплатПоСвязаннымДокументам(ДокументСсылка)
	
	Возврат энргМассовыйВводОплат.СуммаОплатПоСвязаннымДокументам(ДокументСсылка);
	
КонецФункции


#Область РаботаССостояниемДокументовОплат

#Область ФоновоеВыполнениеЗадачиПроведениеОплат

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеПроведениеОплатКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияПроведениеОплат", ЭтотОбъект);
	энргМассовыйВводОплатКлиент.ЗапуститьФоновоеЗаданиеПроведение(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
		
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияПроведениеОплат(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	ОбновитьСуммуОплатКлиент();
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
		
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиОтменаПроведенияОплат

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеОтменаПроведенияОплатКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияОтменаПроведенияОплат", ЭтотОбъект);
	энргМассовыйВводОплатКлиент.ЗапуститьФоновоеЗаданиеОтменаПроведения(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияОтменаПроведенияОплат(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	ОбновитьСуммуОплатКлиент();
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПометкаНаУдалениеОплат

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеПометкаНаУдалениеОплатКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияПометкаНаУдалениеОплат", ЭтотОбъект);
	энргМассовыйВводОплатКлиент.ЗапуститьФоновоеЗаданиеПометкаНаУдаление(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияПометкаНаУдалениеОплат(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	ОбновитьСуммуОплатКлиент();
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПриИзмененииРеквизитовШапки

&НаСервереБезКонтекста
Функция ЕстьСозданныеОплатыОтДокументаОснования(ДокументОснование)
	
	Возврат энргМассовыйВводОплат.ЕстьСозданныеОплатыОтДокументаОснования(ДокументОснование);
	
КонецФункции

#Область ФоновоеВыполнениеЗадачиУстановкаПометкиУдаленияПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияОплатКлиент(ДополнительныеПараметры)
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияУстановкаПометкиУдаленияОплат", ЭтотОбъект, ДополнительныеПараметры);
	энргМассовыйВводОплатКлиент.ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаления(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияУстановкаПометкиУдаленияОплат(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	СуммаОплатПоСозданнымДокументам = СуммаОплатПоСвязаннымДокументам(Объект.Ссылка);
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	
	ЭтоКнопкаЗагрузки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЭтоКнопкаЗагрузки", Ложь);
	ВыполнятьВыборФайла = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ВыполнятьВыборФайла", Ложь);
	Если ЭтоКнопкаЗагрузки Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыполнятьВыборФайла Тогда 
		ФайлДляЧтенияНачалоВыбораКлиент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовОплатКлиент()
	
	// 1. Запуск фонового задания на сервере.
	ЗависимыеРеквизиты = ПолучитьЗависимыеРеквизиты();
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитовОплат", ЭтотОбъект);
	
	энргМассовыйВводОплатКлиент.ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка, 
		ЗависимыеРеквизиты);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитовОплат(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область РаботаСФоновымСозданиемДокументов

&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументовВФоне()
	
	Контекст = Новый Структура("ДатаРеестра", Объект.ДатаРеестра);
	ПараметрыПередачи = Новый Структура("ДокументСсылка, Контекст", Объект.Ссылка, Контекст);
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормыРаботыВФоне", ЭтотОбъект);
	ОткрытьФорму(
		"Документ.энргЗагрузкаДанныхИзВнешнихИсточников.Форма.ФормаСозданияДокументовВФоне",
		ПараметрыПередачи,,,,,ОповещениеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗакрытияФормыРаботыВФоне(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	СуммаОплатПоСозданнымДокументам = СуммаОплатПоСвязаннымДокументам(Объект.Ссылка);
	УстановитьОтборСвязанныхДокументов();
	ОбновитьДинамическиеСпискиСвязанныхДокументов();
	
КонецПроцедуры	


&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументов(Команда)
	ОткрытьФормуЗапускаСозданияДокументовВФоне();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОпераций(Команда)
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОперацийКлиент()
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(Объект.Ссылка);
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНадписьСозданияДокументов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГрупппаВыполненияДлительныхОпераций",
		"Видимость",
		Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьВыполненияДлительныхОпераций",
		"ЦветТекста",
		Новый Цвет(255,0,0));
						
	ЭтоСтараяВерсия = Ложь;
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 ИЛИ ЭтоСтараяВерсия Тогда 
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГрупппаВыполненияДлительныхОпераций",
			"Видимость",
			Ложь);
				
		Возврат;
		
	КонецЕсли;
		
	Если КоличествоАктивныхДлительныхОпераций > 0 Тогда
		
		ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов %2";
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НадписьВыполненияДлительныхОпераций",
			"Заголовок",
			СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций, КоличествоАктивныхДлительныхОпераций));
			
		Возврат;
		
	КонецЕсли;	
	
	ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов нет, необходимо повторно запустить процесс создания документов.";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьВыполненияДлительныхОпераций",
		"Заголовок",
		СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций));	
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка)	
	
	КоличествоПоказаний = РегистрыСведений.энргЗагрузкаПоказанийТочкиУчета.КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка);
	КоличествоОплат		= РегистрыСведений.энргЗагрузкаОплат.КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка);
	Результат = КоличествоПоказаний + КоличествоОплат;
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьКоличествоАктивныхДлительныхОпераций()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КоличествоАктивныхДлительныхОпераций = 0;
	Активные = ДлительныеОперацииКлиент.АктивныеДлительныеОперации();
	
	Для Каждого КлючЗначение Из Активные.Список Цикл
		Попытка
			
			Если КлючЗначение.Значение.ОповещениеОЗавершении.ДополнительныеПараметры.ДокументСсылка = Объект.Ссылка Тогда
				КоличествоАктивныхДлительныхОпераций = КоличествоАктивныхДлительныхОпераций + 1;					
			КонецЕсли; 			
			
		Исключение
			
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНовогоДокументаОплаты

&НаКлиенте
Процедура ДобавитьОплату(Команда)
	
	Если НЕ МожноДобавлятьНовыйОплату() Тогда 
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНовойОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОплатуСписком(Команда)
	
	Если НЕ МожноДобавлятьНовыйОплату() Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ФормаЗаполенияСпискаОплатОкончаниеВыбора",ЭтаФорма);
	
	ОткрытьФорму("Документ.энргЗагрузкаДанныхИзВнешнихИсточников.Форма.ФормаЗаполенияСпискаОплат",, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ФормаЗаполенияСпискаОплатОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		
		Модифицированность	= Истина;
		
		Для каждого СтрокаДолг Из РезультатЗакрытия Цикл
			
			СтрокаТЗ = Объект.Оплата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаДолг);
			СтрокаТЗ.ДатаПлатежногоДокумента	 = Объект.Дата;
			
		КонецЦикла;
		
		ЗарегистрироватьЗаписиКСозданиюДокументов();
		ОбновитьНадписьВыполненияДлительныхОперацийКлиент();		
		Если ОсталосьСоздатьДокументовДлительныхОпераций > 0 Тогда				
			ОткрытьФормуЗапускаСозданияДокументовВФоне();
		КонецЕсли;
		
		ПараметрыЗаписи = Новый Структура("ЭтоЗаписьПослеЗагрузкиДанных", Истина);
		Записать(ПараметрыЗаписи);
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция МожноДобавлятьНовыйОплату()
	
	Ошибки = Новый Массив;	
	
	Если Параметры.Ключ.Пустая() Тогда		
		Ошибки.Добавить(НСтр("ru = 'Перед добавлением оплаты необходимо записать документ'"));		
	КонецЕсли;
	
	ПроверитьЗаполнениеОбязательныхПолейПереопределяемый(Ошибки);
	
	Если НЕ Ошибки.Количество() = 0 Тогда
		
		ЗаголовокПредупреждения = НСтр("ru = 'Ошибки перед добавлением оплаты'");
		ТекстПредупреждения = СтрСоединить(Ошибки, Символы.ПС);
		ПоказатьПредупреждение(, ТекстПредупреждения,, ЗаголовокПредупреждения);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеОбязательныхПолейПереопределяемый(Ошибки)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда		
		Ошибки.Добавить(НСтр("ru = 'Заполните поле Период начисления'"));		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда		
		Ошибки.Добавить(НСтр("ru = 'Заполните поле Организация'"));		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Район) Тогда		
		Ошибки.Добавить(НСтр("ru = 'Заполните поле Район'"));		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.АбонентскийОтдел) Тогда		
		Ошибки.Добавить(НСтр("ru = 'Заполните поле Абонентский отдел'"));		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ИсточникПоступления) Тогда		
		Ошибки.Добавить(НСтр("ru = 'Заполните поле Источник поступления'"));		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНовойОплаты()
	
	ДобавлениеЕдиничнойОплаты = Новый Структура("ДобавлениеЕдиничнойОплаты");
	ПоляЗаполнения = Новый Структура(
		"ДокументОснование,Дата,ПериодНачисления,Организация,Район,АбонентскийОтдел,ИсточникПоступления,РазрешеноДобавлятьОплату");
	ЗаполнитьЗначенияСвойств(ПоляЗаполнения, Объект);
	ПоляЗаполнения.ДокументОснование = Объект.Ссылка;
	ПоляЗаполнения.РазрешеноДобавлятьОплату = Истина;
	ДобавлениеЕдиничнойОплаты = Новый Структура("ДобавлениеЕдиничнойОплаты", ПоляЗаполнения);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДобавлениеЕдиничнойОплаты);
	
	ОткрытьФорму("Документ.энргПлатежноеПоручениеВходящие.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

ПодтвежденоЗакрытие = Ложь;