#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Протокол

Функция СформироватьПротоколЗагруженныхДанных(Объект) Экспорт 
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ЗагруженныеДанные");	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные		= Макет.ПолучитьОбласть("Данные");
	ОбластьШапкаОплаты	= Макет.ПолучитьОбласть("ШапкаОплаты");
	ОбластьДанныеОплаты	= Макет.ПолучитьОбласть("ДанныеПоОплате");
	
	ОбластьШапка.Параметры.Номер = Объект.Номер;
	ОбластьШапка.Параметры.Дата  = Объект.Дата;
	
	ТабДок.Вывести(ОбластьШапка);
		
	Запрос = Новый  Запрос; 
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	энргРегистрацияПоказанийАбонентаТочкиУчета.Услуга КАК Услуга,
	|	энргРегистрацияПоказанийАбонентаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	энргРегистрацияПоказанийАбонента.Абонент КАК Абонент,
	|	энргРегистрацияПоказанийАбонента.Абонент КАК ФИО,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ПоказанияПриборовУчета КАК энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ШкалыПриборовУчета КАК энргРегистрацияПоказанийАбонентаШкалыПриборовУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ТочкиУчета КАК энргРегистрацияПоказанийАбонентаТочкиУчета
	|				ПО (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = энргРегистрацияПоказанийАбонентаТочкиУчета.Ссылка)
	|					И (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтрокиТочкиУчета = энргРегистрацияПоказанийАбонентаТочкиУчета.IDСтроки)
	|			ПО (энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка = энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка)
	|				И (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтроки = энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.IDСтроки)
	|		ПО (энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка = энргРегистрацияПоказанийАбонента.Ссылка)
	|			И (энргРегистрацияПоказанийАбонента.Проведен)
	|			И (энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО (энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка)
	|		ПО (энргРегистрацияПоказанийАбонента.Абонент = энргАбоненты.Ссылка)";
	
	Выборка		= Запрос.Выполнить().Выбрать();
	
	Счетчик	= 0;
	Пока Выборка.Следующий() Цикл 
		Счетчик = Счетчик + 1;
		ОбластьДанные.Параметры.Заполнить(Выборка);
		ОбластьДанные.Параметры.Счетчик = Счетчик;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргПлатежноеПоручениеВходящиеОплата.ПериодОплаты КАК ПериодОплаты,
	|	энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты КАК Сумма,
	|	энргПлатежноеПоручениеВходящиеОплата.Абонент КАК ФИО,
	|	энргПлатежноеПоручениеВходящиеОплата.НомерПлатежногоДокумента КАК НомерПлатежа,
	|	энргПлатежноеПоручениеВходящиеОплата.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	|	энргПлатежноеПоручениеВходящиеОплата.Услуга КАК Услуга,
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО (энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка)                    
	|		ПО (энргПлатежноеПоручениеВходящиеОплата.Абонент = энргАбоненты.Ссылка)
	|			И (энргПлатежноеПоручениеВходящиеОплата.Ссылка.Проведен)
	|			И (энргПлатежноеПоручениеВходящиеОплата.Ссылка.ДокументОснование = &ДокументОснование)";
	
	Выборка		= Запрос.Выполнить().Выбрать();

	ОбластьШапкаОплаты.Параметры.Номер = Объект.Номер;
	ОбластьШапкаОплаты.Параметры.Дата  = Объект.Дата;
	ТабДок.Вывести(ОбластьШапкаОплаты);
	
	СчетчикОплата = 0;
	Пока Выборка.Следующий() Цикл 
		СчетчикОплата = СчетчикОплата + 1;
		ОбластьДанныеОплаты.Параметры.Заполнить(Выборка);
		ОбластьДанныеОплаты.Параметры.Счетчик = СчетчикОплата;
		
		ТабДок.Вывести(ОбластьДанныеОплаты);
	КонецЦикла;
	
	Возврат  ТабДок;
	
КонецФункции

Функция СформироватьПротоколНеЗагруженныхДанных(Объект,НеЗагруженныеДанныеНеЗагруженаОплата=Неопределено, НеЗагруженныеДанныеНеЗагруженныеПоказания=Неопределено,ОтклоненныеПоказания=Неопределено) Экспорт 
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("НеЗагруженныеДанные");	
	ОбластьШапка			= Макет.ПолучитьОбласть("ШапкаДанные");
	ОбластьДанные			= Макет.ПолучитьОбласть("Данные");
	
	ОбластьШапка.Параметры.Номер = Объект.Номер;
	ОбластьШапка.Параметры.Дата  = Объект.Дата;
	
	ТабДок.Вывести(ОбластьШапка);
	
	
	ТЗ_незагруженныеДанные = Новый ТаблицаЗначений();
	ТЗ_незагруженныеДанные.Колонки.Добавить("ПериодОплаты", Новый ОписаниеТипов("Дата"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("СуммаОплаты", Новый ОписаниеТипов("Число"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ДатаПлатежногоДокумента", Новый ОписаниеТипов("Дата"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("НомерПлатежногоДокумента", Новый ОписаниеТипов("Строка"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("Строка"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ФИОПлательщика", Новый ОписаниеТипов("Строка"));

	ТЗ_незагруженныеДанные.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка"));
	
	Для Каждого  строка из Объект.Оплата цикл 
			ЗаполнитьЗначенияСвойств(ТЗ_незагруженныеДанные.Добавить(),строка);
	КонецЦикла;
	
	
	
	Запрос = Новый  Запрос; 
	Запрос.УстановитьПараметр("ТЗ_незагруженныеДанные", ТЗ_незагруженныеДанные);
	
	Запрос.Текст="ВЫБРАТЬ
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ФИОПлательщика КАК ФИО,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ЛицевойСчет КАК ЛицевойСчет,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.НомерПлатежногоДокумента КАК НомерПлатежа,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.Услуга КАК Услуга,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ПериодОплаты КАК Период,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.СуммаОплаты КАК Сумма
	             |ПОМЕСТИТЬ ВТ_НезагруженныеДанные
	             |ИЗ
	             |	&ТЗ_незагруженныеДанные КАК энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_НезагруженныеДанные.ФИО КАК ФИО,
	             |	ВТ_НезагруженныеДанные.ЛицевойСчет КАК ЛицевойСчет,
	             |	ВТ_НезагруженныеДанные.НомерПлатежа КАК НомерПлатежа,
	             |	ВТ_НезагруженныеДанные.ДатаПлатежа КАК ДатаПлатежа,
	             |	ВТ_НезагруженныеДанные.Услуга КАК Услуга,
	             |	ВТ_НезагруженныеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	             |	ВТ_НезагруженныеДанные.Период КАК Период,
	             |	ВТ_НезагруженныеДанные.Сумма КАК Сумма
	             |ИЗ
	             |	ВТ_НезагруженныеДанные КАК ВТ_НезагруженныеДанные";
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	
	Счетчик = 0;
	Сумма = 0;
	Пока Выборка.Следующий() Цикл 
		Счетчик = Счетчик + 1;
		ОбластьДанные.Параметры.Заполнить(Выборка);
		ОбластьДанные.Параметры.Счетчик = Счетчик;
		ТабДок.Вывести(ОбластьДанные);

	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции

Функция СформироватьРеестрОплат(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящиеОплата.Абонент КАК Абонент,
	|	энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты КАК СуммаОплаты,
	|	энргПлатежноеПоручениеВходящиеОплата.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|	энргАбоненты.Наименование КАК Наименование,
	|	энргПлатежноеПоручениеВходящиеОплата.НомерСтроки КАК НомерПлатежа,
	|	энргАбоненты.КлючПомещения.Строение КАК Строение
	|ПОМЕСТИТЬ ВТ_Абоненты
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргПлатежноеПоручениеВходящиеОплата.Абонент = энргАбоненты.Ссылка
	|ГДЕ
	|	энргПлатежноеПоручениеВходящиеОплата.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Абоненты.Абонент КАК Абонент,
	|	ВТ_Абоненты.НомерПлатежа КАК НомерПлатежа,
	|	ВТ_Абоненты.ДатаПлатежа КАК ДатаПлатежа,
	|	СУММА(ВТ_Абоненты.СуммаОплаты) КАК Сумма,
	|	ВТ_Абоненты.ЛицевойСчет КАК ЛС,
	|	МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.Адрес, """")) КАК Адрес,
	|	ВТ_Абоненты.Наименование КАК ФИО
	|ИЗ
	|	ВТ_Абоненты КАК ВТ_Абоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			МАКСИМУМ(энргАбонентыКонтактнаяИнформация.Представление) КАК Адрес
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_Абоненты.Абонент КАК Абонент
	|			ИЗ
	|				ВТ_Абоненты КАК ВТ_Абоненты
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТ_Абоненты.Абонент) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|				ПО (энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|					И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))
	|					И ВложенныйЗапрос.Абонент = энргАбонентыКонтактнаяИнформация.Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Абонент) КАК ВложенныйЗапрос
	|		ПО ВТ_Абоненты.Абонент = ВложенныйЗапрос.Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Абоненты.Абонент,
	|	ВТ_Абоненты.НомерПлатежа,
	|	ВТ_Абоненты.ДатаПлатежа,
	|	ВТ_Абоненты.ЛицевойСчет,
	|	ВТ_Абоненты.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПлатежа";
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Макет = ПолучитьМакет("ПФ_MXL_Реестр");
	ТабДок 						= Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб 			= Истина;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;

	Шапка 		= Макет.ПолучитьОбласть("Шапка");
	Данные 		= Макет.ПолучитьОбласть("Данные");
	Подвал 		= Макет.ПолучитьОбласть("Подвал");
	
	Шапка.Параметры.Период		= ТекущаяДата();
	Шапка.Параметры.Дата		= Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	Шапка.Параметры.Источник	= СокрЛП(Объект.ИсточникПоступления);
	ТабДок.Вывести(Шапка);
	
	Пока Выборка.Следующий() Цикл
		Данные.Параметры.Заполнить(Выборка);
		Данные.Параметры.ЛС 	= СокрЛП(Выборка.ЛС);
		Данные.Параметры.ФИО 	= СокрЛП(Выборка.ФИО);
		Данные.Параметры.Адрес 	= СокрЛП(Выборка.Адрес);
		УстановитьЦветФона(Объект, Выборка, Данные);
		ТабДок.Вывести(Данные);
	КонецЦикла;
	
	Подвал.Параметры.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ТабДок.Вывести(Подвал);
	
	Возврат ТабДок;
	
КонецФункции

Процедура УстановитьЦветФона(Объект, Выборка, Данные)
	// Переопределена в расширении
КонецПроцедуры

#КонецОбласти

#Область РаботаСВкладкойОплат

Функция ПолучитьСвязанныеДанныеОплаты(ДокументОснование, IDСтроки) Экспорт 	
	
	Результат = Новый Структура;
	Результат.Вставить("ОтображениеЗадолженности", Новый Массив);
	Результат.Вставить("ОтображениеПереносаСуммыОплаты", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПлатежноеПоручениеВходящиеЗадолженность.Услуга КАК Услуга,
		|	энргПлатежноеПоручениеВходящиеЗадолженность.ВидЗадолженности КАК ВидЗадолженности,
		|	энргПлатежноеПоручениеВходящиеЗадолженность.ПериодНачисления КАК ПериодНачисления,
		|	энргПлатежноеПоручениеВходящиеЗадолженность.ПредставлениеПериодаОплаты КАК ПредставлениеПериодаОплаты,
		|	энргПлатежноеПоручениеВходящиеЗадолженность.Задолженность КАК Задолженность,
		|	энргПлатежноеПоручениеВходящиеЗадолженность.СуммаОплаты КАК СуммаОплаты,
		|	энргПлатежноеПоручениеВходящиеЗадолженность.Поставщик КАК Поставщик
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие.Задолженность КАК энргПлатежноеПоручениеВходящиеЗадолженность
		|ГДЕ
		|	энргПлатежноеПоручениеВходящиеЗадолженность.Ссылка = &Ссылка
		|	И энргПлатежноеПоручениеВходящиеЗадолженность.IDСтроки = &IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса КАК АбонентПереноса,
		|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.СуммаПереноса КАК СуммаПереноса
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие.ПереносСуммыОплаты КАК энргПлатежноеПоручениеВходящиеПереносСуммыОплаты
		|ГДЕ
		|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.Ссылка = &Ссылка
		|	И энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.IDСтроки = &IDСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("IDСтроки", IDСтроки);       
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОписаниеСтроки = "Услуга,ВидЗадолженности,ПериодНачисления,ПредставлениеПериодаОплаты,Задолженность,СуммаОплаты,Поставщик";
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Новый Структура(ОписаниеСтроки);	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Результат.ОтображениеЗадолженности.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	ОписаниеСтроки = "АбонентПереноса,СуммаПереноса";
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Новый Структура(ОписаниеСтроки);	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Результат.ОтображениеПереносаСуммыОплаты.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

Функция СвязанныеДокументыОплат(ДокументОснование) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.Проведен
		|	И энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;             
	
КонецФункции

#КонецОбласти  

#КонецЕсли