#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	ПроверитьСостояниеСвязанныхДокументов(Отказ, РежимЗаписи, РежимПроведения);	
	ПроверитьСуммыСвязанныхДокументов(Отказ, РежимЗаписи, РежимПроведения);
	
	ПередЗаписьюПереопределяемый(Отказ, РежимЗаписи, РежимПроведения);
	Ответственный = Пользователи.ТекущийПользователь();			

КонецПроцедуры

Процедура ПередЗаписьюПереопределяемый(Отказ, РежимЗаписи, РежимПроведения)
	// переопределен
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);
	ФайлДляЧтения = "";
	Примечание = "";
	ДатаРеестра = Дата(1,1,1);
	СуммаРеестра = 0;
	
	НеЗагруженныеДанные.Очистить();
	Оплата.Очистить();
	ПоказанияПриборовУчета.Очистить();
	ТочкиУчета.Очистить();
	ШкалыПриборовУчета.Очистить();
	ОплатаСудебнойЗадолженности.Очистить();
	Задолженность.Очистить();
	ПереносСуммыОплаты.Очистить();
	ИнформацияОПлатежномПоручении.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаССостояниемДокументов

Процедура ПроверитьСостояниеСвязанныхДокументов(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ОтменитьПроверкуСвязанныхДокументов") Тогда
		Возврат;
	КонецЕсли; 	
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПроведение = РежимЗаписи = РежимЗаписиДокумента.Проведение;
	ЭтоОтменаПроведения = РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ ПометкаУдаления;
	
	Если Не ЭтоПроведение и НЕ ЭтоОтменаПроведения Тогда
		Возврат;
	КонецЕсли; 	
	
	ЕстьОплатыДляИзменения = ЕстьДокументыОплатДляИзмененияСостояния(ЭтоПроведение);
	ЕстьПоказанияДляИзменения = ЕстьДокументыПоказанийДляИзмененияСостояния(ЭтоПроведение);
	
	Если ЭтоПроведение И (ЕстьОплатыДляИзменения ИЛИ ЕстьПоказанияДляИзменения) Тогда
		
		Отказ = Истина;	
		Комментарий = НСтр("ru = 'Перед проведением текущего документа, необходимо провести связанные документы'");
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий; 
		
	КонецЕсли;
	
	Если ЭтоОтменаПроведения И (ЕстьОплатыДляИзменения ИЛИ ЕстьПоказанияДляИзменения) Тогда
		
		Отказ = Истина;
		Комментарий = НСтр("ru = 'Перед отменой проведения текущего документа, необходимо отменить проведение связанных документов'");
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий; 
		
	КонецЕсли;	
	
КонецПроцедуры


Функция ЕстьДокументыОплатДляИзмененияСостояния(ЭтоПроведение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
		|	И энргПлатежноеПоручениеВходящие.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	Если ЭтоПроведение Тогда 
		
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И энргПлатежноеПоручениеВходящие.Проведен",
			"И НЕ энргПлатежноеПоручениеВходящие.Проведен
			|	И НЕ энргПлатежноеПоручениеВходящие.ПометкаУдаления");
		
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();	
	ПустойЗапрос = РезультатЗапроса.Пустой();
	
	Возврат не ПустойЗапрос;
	
КонецФункции

Функция ЕстьДокументыПоказанийДляИзмененияСостояния(ЭтоПроведение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И энргРегистрацияПоказанийАбонента.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	Если ЭтоПроведение Тогда 
		
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И энргРегистрацияПоказанийАбонента.Проведен",
			"И НЕ энргРегистрацияПоказанийАбонента.Проведен
			|	И НЕ энргРегистрацияПоказанийАбонента.ПометкаУдаления");
		
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();	
	ПустойЗапрос = РезультатЗапроса.Пустой();
	
	Возврат не ПустойЗапрос;
	
КонецФункции
	
#КонецОбласти

#Область ПроверкаСуммОплатСвязанныхДокументов

Процедура ПроверитьСуммыСвязанныхДокументов(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ОтменитьПроверкуСуммыСвязанныхДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда 
		Возврат;
	КонецЕсли;  
	
	СуммаОплат = энргМассовыйВводОплат.СуммаОплатПоСвязаннымДокументам(Ссылка);
	Если НЕ СуммаРеестра = СуммаОплат Тогда 
		
		Отказ = Истина;		
		Комментарий = НСтр("ru = 'Опознанная оплата и сумма реестра не совпадают'");
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
		
	КонецЕсли; 	
	
КонецПроцедуры                                                                       
	
#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли