#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	энргЛокализацияСервер.ПриСозданииНаСервере_энргРегистрацияПоказанийМКД(ЭтотОбъект);
	ЗаполнитьДокумент  = Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			ЗаполнитьДокумент = истина;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПериодНачисления();

	Если ЗначениеЗаполнено(Объект.МКД) и ЗаполнитьДокумент тогда
		ЗаполнитьДанныеПриборовУчета(); 		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
		Если ЗначениеЗаполнено(Объект.МКД)  тогда
			ЗаполнитьДанныеПриборовУчета(); 		
		КонецЕсли;
	
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		ЗаполнитьДанныеПриборовУчета();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район 			= ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьДанныеПриборовУчета(); 
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	ИмяТаблицыПоказания						= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
	
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
	ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
	ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
	
КонецПроцедуры

#Область СобытияТаблицыФормыПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьЗначения(Команда)
	ЗаполнитьДанныеПриборовУчета();	
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеПриборовУчета()
	
	ТаблицаТЧ 									= Объект.ПоказанияПриборовУчета.Выгрузить();
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	
	Результат 									= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаМКД(Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета или НЕ ТекПрибор = Выборка.ПриборУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;			
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
	
	КонецЦикла; 
	
	энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);

	Если Объект.ТочкиУчета.Количество() > 0 Тогда
		ТекСтрока = Объект.ТочкиУчета[0];
		
		Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
			Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
			Элементы.ТочкиУчетаЕстьШкалыНетТарифныхЗон.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
			Элементы.ТочкиУчетаНетШкалЕстьТарифныеЗоны.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		Иначе	
			Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчетаМКД(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодНачисления()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ПериодРегистрации = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
		ЗаполнитьПериодНачисленияСервер(ПериодРегистрации);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер(ПериодРегистрации)
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПериодРегистрации, Объект.Организация, Объект.Район);	
КонецПроцедуры

#КонецОбласти