#Область ОписаниеПеременных

&НаКлиенте
Перем ПодтвежденоЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОбходнойЛист(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ОбновитьПериодНачисления();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
		
		ПоказанияПредоставляютсяВСрок();
		ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьОтборДокументовРегистрацииПоказаний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Объект.ТочкиУчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПодтвежденоЗакрытие И НЕ ЗавершениеРаботы Тогда			
		
		ИмяВкладки = Элементы.ГруппаВводПоказанийПриборовУчета.Заголовок;
		Отказ = Истина;
		ТекстВопроса = "На вкладке " + ИмяВкладки + " есть показания по которым не созданы документы ""Регистрация показаний"", показания не будут приняты к расчётам. 
		|Продолжить работу с документом?";
		 			
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект); 			
		ПоказатьВопрос(
			ОповещениеОЗакрытии, 
			ТекстВопроса, 
			РежимДиалогаВопрос.ДаНетОтмена);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		ПодтвежденоЗакрытие = Истина;		
		Закрыть();
				
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
	ПоказанияПредоставляютсяВСрок();
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
			
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ТочкиУчета");
	
	УстановитьОтборДокументовРегистрацииПоказаний();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ОбновитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)	
	
	ЗависимыеРеквизиты = ПолучитьЗависимыеРеквизиты();
	Если НеобходимоСкорректироватьСвязанныеДокументы(Объект.Ссылка, ЗависимыеРеквизиты) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеВопросаОНеобходимостиКорректировкиСвязанныхДокументов",
			ЭтотОбъект);		
			
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Дата документа была изменена. Даты документов созданных на основании будут скорректированы. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ОбновитьПериодНачисления();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтроениеПриИзмененииНаСервере()
	Объект.Маршрут 		= Объект.Строение.МаршрутКонтроллера;
	Объект.Контроллер 	= Объект.Маршрут.Владелец; 
КонецПроцедуры

&НаКлиенте
Процедура СтроениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.СпособПоискаСтроки = СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть; 
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	ИмяТаблицыПоказания						= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте

Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
	
	//Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");		
	//ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
	//ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
	//Иначе	
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
	//КонецЕсли;
	
	//Если Объект.ТочкиУчета.Количество() > 0 Тогда
	//	ТаблицаФормыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - 1].ПолучитьИдентификатор();
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказанияПриборовУчета

&НаКлиенте
Процедура ПриборыУчетаТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	//энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
	
	КоличествоДобавленныхСтрок = ПолучитьКоличествоСтрок(ТекущиеДанные.IDСтроки);
	
	Если КоличествоДобавленныхСтрок = 1 Тогда
		ПереходНаНовуюСтрокуТочкиУчета = Истина;
	ИначеЕсли КоличествоДобавленныхСтрок = 2 и ТекущиеДанные.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.Ночь") Тогда
		ПереходНаНовуюСтрокуТочкиУчета = Истина;
	ИначеЕсли КоличествоДобавленныхСтрок = 3 и ТекущиеДанные.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.Пик") Тогда
		ПереходНаНовуюСтрокуТочкиУчета = Истина;
	Иначе   ПереходНаНовуюСтрокуТочкиУчета = Ложь;
	КонецЕсли;
	
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказания;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказания;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказания;
	Иначе	
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалНетТарифныхЗонТекущиеПоказания;
	КонецЕсли;
	
	Если Объект.ПоказанияПриборовУчета.Количество() > ТекущиеДанные.НомерСтроки Тогда
		ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[ТекущиеДанные.НомерСтроки].ПолучитьИдентификатор();
	КонецЕсли;
	
	
	Если ПереходНаНовуюСтрокуТочкиУчета И Объект.ТочкиУчета.Количество() > ТекущиеДанныеТочкиУчета.НомерСтроки Тогда
		ИмяТаблицыТочкиУчета.ТекущаяСтрока = Объект.ТочкиУчета[ТекущиеДанныеТочкиУчета.НомерСтроки].ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));	
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Перед созданием документов необходимо записать документ'"));
		Возврат;
	КонецЕсли;	
	
	ЕстьПредварительныеДанные = Ложь;
	Для Каждого текСтрока из Объект.ТочкиУчета Цикл 
		ЕстьПредварительныеДанные = Истина;
		Прервать;
	КонецЦикла;
	
	Если НЕ ЕстьПредварительныеДанные Тогда
		ЗаголовокЧерновыхДанных = Элементы.ГруппаВводПоказанийПриборовУчета.Заголовок;
		Шаблон = "ru = 'Нет данных для создания регистрации показаний. Вкладка %1 пустая'";
		ПоказатьПредупреждение(, НСтр(СтрШаблон(Шаблон, ЗаголовокЧерновыхДанных)));
		Возврат;
	КонецЕсли;	
	
	Если Модифицированность Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Документ изменен. Перед созданием документов необходимо записать документ'"));
		Возврат;
	КонецЕсли;	
	
	Если ОсталосьСоздатьДокументовДлительныхОпераций > 0 И ЕстьПредварительныеДанные Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед проведением необходимо создать документы зарегистрированные в очередь'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаПередСозданиемДокументов", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ru = 'Перед записью документа проверьте корректность заполнения даты документа и реквизитов в шапке документа. Продолжить проведение?'"),
		РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПровестиРегистрацииПоказаний(Команда)
	ЗапуститьФоновоеЗаданиеПроведениеПоказанийКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеРегистрацииПоказаний(Команда)
	ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказанийКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	СтроениеПриИзмененииНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Строение) Тогда
		ПоказатьПредупреждение(,"Заполните Строение");
		Возврат;
	КонецЕсли;
	
	Если ДанныеПоОтборуЕсть("Строение", Объект.Строение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По строению данные заполнены.");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеДляЗаполненияПоСтроению(); 
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляЗаполненияПоСтроению()
	// выводим данные по подключенным услугам и задолженности
	ОтборСтроение 	= Объект.Строение;//?(ЗначениеЗаполнено(Объект.Строение), Объект.Строение, Неопределено);
	Результат 		= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПоМаршруту(Объект.Дата, Объект.Организация, Объект.Район, Объект.Маршрут, Объект.Строение); 
	ЗаполнитьПоказанияНаСервере(Результат);	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоАбоненту(Команда)
	Если НЕ ЗначениеЗаполнено(Абонент) Тогда
		ПоказатьПредупреждение(,"Заполните Абонента");
		Возврат;
	КонецЕсли;
	
	Если ДанныеПоОтборуЕсть("Абонент", Абонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту: " + СокрЛП(Абонент) + " данные заполнены.");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеДляЗаполненияПоАбоненту();	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляЗаполненияПоАбоненту()
	Результат = энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Объект.Дата,Объект.Организация,Объект.Район,Абонент.КлючПомещения); 	
	ЗаполнитьПоказанияНаСервере(Результат);
КонецФункции

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоказанияНаСервере(Результат)

	Выборка  									= Результат.выбрать();
	ТекКлючПомещения							= Неопределено;
	ТекТочкаУчета 								= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() Цикл 
		НоваяТочка = Ложь;
		Если Не ТекКлючПомещения = Выборка.КлючПомещения Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.КлючПомещения 		= Выборка.КлючПомещения;
			СтрокаТочкиУчета.Абонент 			= Выборка.Абонент;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона; 
		
		ТекКлючПомещения 						= Выборка.КлючПомещения;
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
	    ТекШкала 								= Выборка.Шкала
	КонецЦикла; 
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	ЗаполнениеПоказанийСУчетомОтклонений(Истина);
	
	Объект.ТочкиУчета.Сортировать("Строение,Помещение");
		
КонецПроцедуры

&НаСервере
Функция ДанныеПоОтборуЕсть(ИмяРеквизита, ЗначениеРеквизита)
	Возврат Объект.ТочкиУчета.НайтиСтроки(Новый Структура(ИмяРеквизита, ЗначениеРеквизита)).Количество() > 0;
КонецФункции

&НаСервере
Процедура ОбновитьПериодНачисления()
	
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	ПоказанияПредоставляютсяВСрок();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоСтрок(IDСтроки)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтроки);
	НайденныеСтроки = Объект.ПоказанияПриборовУчета.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеСтроки.Количество();
		
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СервисПроверкиПоказанийПриборовУчета

&НаСервере
Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний()
	
	ТаблицаПриборов = энргРаботаСПоказаниямиПриборовУчетаСервер.НоваяТаблицаПриборовДляПроверки();
	Для Каждого ТекСтрока из Объект.ТочкиУчета Цикл
		НСтрока = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		НСтрока.Район = Объект.Район;
	КонецЦикла;
	
	ПериодЗапроса = Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПроверкиОтклоненияПоказаний();
	ВспомогательныеПараметры.ПоказанияВСрок = ПоказанияВСрок;
	ВспомогательныеПараметры.ПериодНачисления = Объект.ПериодНачисления;
	
	РезультатЗапроса = энргРаботаСПоказаниямиПриборовУчетаСервер.ПриборыДляОтклоненияПоказаний(ПериодЗапроса, Объект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ЭтотОбъект, РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ПоказанияПредоставляютсяВСрок()
	ПоказанияВСрок = энргРаботаСПоказаниямиПриборовУчетаСервер.ПоказанияПредоставляютсяВСрок(Объект.ПериодНачисления, Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные)
	РезультатПроверки = энргРаботаСПоказаниямиПриборовУчетаКлиент.ОпределитьСостояниеПоказанийПоСтроке(ТекущиеДанныеТочкиУчета.ПриборУчета, ЭтотОбъект, ТекущиеДанные);
	Если РезультатПроверки.СостояниеИзменено Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, РезультатПроверки);
		Возврат;
	КонецЕсли;
	
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеАбонента(Команда)
	
	Модифицированность = Истина;
	ОткрытьФормуПодбораАбонетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораАбонетов(ФИО = "", ИдТекСтроки = Неопределено)
	
	Перем ОписаниеОповещения, Период, ТекПараметры;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьДанныеАбонентаЗавершение",ЭтаФорма);

	ТекПараметры = Новый Структура("Организация, Район, Строение, Контроллер, Маршрут, Период", 
					Объект.Организация,Объект.Район,Объект.Строение, Объект.Контроллер, Объект.Маршрут, Объект.Дата);
 	Если ИдТекСтроки <> Неопределено Тогда 
		ТекПараметры.Вставить("ФИО", ФИО);
		ТекПараметры.Вставить("ИдТекСтроки", ИдТекСтроки);
	КонецЕсли;
	ОткрытьФорму("Документ.энргМассовыйВводПоказаний.Форма.ФормаПоискаЛС",ТекПараметры, ЭтаФорма,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСтроению(Команда)
	
	Модифицированность = Истина;
	
	КоличествоСтрокПоказанияПУДо = Объект.ПоказанияПриборовУчета.Количество();	
	КоличествоСтрокТочкиУчетаДо = Объект.ТочкиУчета.Количество();	
	ЗаполнитьАбонентовПоСтроениюНаСервере();
	
	КоличествоСтрокПоказанияПУПосле = Объект.ПоказанияПриборовУчета.Количество(); 	
	КоличествоСтрокТочкиУчетаПосле = Объект.ТочкиУчета.Количество();
	
	КоличествоДобавленныхСтрокПУ = КоличествоСтрокПоказанияПУПосле - КоличествоСтрокПоказанияПУДо; 	
	КОличествоДобавленныхСтрокТУ = КоличествоСтрокТочкиУчетаПосле - КоличествоСтрокТочкиУчетаДо;
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказания;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказания;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказания;
	Иначе	
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалНетТарифныхЗонТекущиеПоказания;
	КонецЕсли;
	
	Если Объект.ТочкиУчета.Количество() > 0 И КОличествоДобавленныхСтрокТУ > 0 Тогда
		ИмяТаблицыТочкиУчета.ТекущаяСтрока = Объект.ТочкиУчета[Объект.ТочкиУчета.Количество() - КОличествоДобавленныхСтрокТУ].ПолучитьИдентификатор();
	КонецЕсли;
	
	Если Объект.ПоказанияПриборовУчета.Количество() > 0 И КоличествоДобавленныхСтрокПУ > 0 Тогда
		ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - КоличествоДобавленныхСтрокПУ].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАбонентовПоСтроениюНаСервере()

	РезультатЗапроса = Обработки.энргСостояниеПриборовУчетаМенеджер.ДействующиеПриборыУчетаПоМаршруту(Объект.Дата, Объект.Организация, Объект.Район, Неопределено, Объект.Строение, Истина); 
	ЗаполнитьПоказанияНаСервере(РезультатЗапроса);

КонецПроцедуры

#КонецОбласти

#Область СервисРаботыСМассовымВводом

&НаКлиенте
Процедура ДобавитьДанныеАбонентаЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("Абонент") Или НЕ Результат.Свойство("КлючПомещения") Тогда
		Возврат;
	КонецЕсли;
	
	
	// ищем строки по ключу помещения
	мСтроки  = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("КлючПомещения",Результат.КлючПомещения));
	Если НЕ мСтроки.Количество()  = 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("АнализОтветаНаДублированиеПоказаний", ЭтотОбъект, Новый Структура("мСтроки, Результат", мСтроки, Результат)), "По данному абоненту уже введены показания. Ввести ещё?", РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
		
	Иначе
		КлючРодителя = ПолучитьКлючПомещенияРодителя(Результат.КлючПомещения);
		Если ЗначениеЗаполнено(КлючРодителя) Тогда
			мСтроки  = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("КлючПомещения",КлючРодителя));
			Если НЕ мСтроки.Количество()  = 0 Тогда
				Ответ = Неопределено;
				
				ПоказатьВопрос(Новый ОписаниеОповещения("АнализОтветаНаДублированиеПоказаний", ЭтотОбъект, Новый Структура("мСтроки, Результат", мСтроки, Результат)), "По данному абоненту уже введены показания. Ввести ещё?", РежимДиалогаВопрос.ДаНет);
				
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	ДобавитьПУ_Абонента(Результат);
КонецПроцедуры

&НаКлиенте
Процедура АнализОтветаНаДублированиеПоказаний(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	
	мСтроки = ДополнительныеПараметры1.мСтроки;
	Результат = ДополнительныеПараметры1.Результат;
	
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");		
		ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		Иначе	
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		КонецЕсли;
		
		Если Объект.ТочкиУчета.Количество() > 0 Тогда
			ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - 1].ПолучитьИдентификатор();
		КонецЕсли;
		
	Иначе
		
			ДобавитьПУ_Абонента(Результат);

		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПУ_Абонента(Знач Результат)
	
	КоличествоСтрокПоказанияПУДо = Объект.ПоказанияПриборовУчета.Количество();
	
	ЗаполнитьДанныеПриборовУчета(Результат.Абонент, Результат.КлючПомещения);
	
	КоличествоСтрокПоказанияПУПосле = Объект.ПоказанияПриборовУчета.Количество();
	
	КОличествоДобавленныхСтрок = КоличествоСтрокПоказанияПУПосле - КоличествоСтрокПоказанияПУДо;
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказания;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказания;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказания;
	Иначе	
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалНетТарифныхЗонТекущиеПоказания;
	КонецЕсли;
	
	
	Если Объект.ТочкиУчета.Количество() > 0 И КОличествоДобавленныхСтрок > 0 Тогда
		ИмяТаблицыТочкиУчета.ТекущаяСтрока = Объект.ТочкиУчета[Объект.ТочкиУчета.Количество() - 1].ПолучитьИдентификатор();

		ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - КОличествоДобавленныхСтрок].ПолучитьИдентификатор();
	КонецЕсли;
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПриборовУчета(Абонент,КлючПомещения) 
	
	Результат 		= Обработки.энргСостояниеПриборовУчетаМенеджер.ДействующиеПриборыУчетаПомещения(Объект.Дата, Объект.Организация, Объект.Район, КлючПомещения, Неопределено, Истина, Новый Структура("ТолькоОткрытыеЛС", Истина)); 
	Выборка  		= Результат.выбрать();
	ТекТочкаУчета 	= Неопределено;
	ТекШкала 		= Неопределено;
	IDСтрокиТочки 	= Неопределено;
	IDСтрокиШкалы 	= Неопределено;
	Пока Выборка.Следующий() цикл

		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.КлючПомещения 		= КлючПомещения;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
			
			энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Выборка.Абонент,СтрокаТочкиУчета);
			
			СтрокаТочкиУчета.Абонент 			= Абонент;

		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
	КонецЦикла; 
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, Объект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета); 
	
	ЗаполнениеПоказанийСУчетомОтклонений(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПоказанийСУчетомОтклонений(КонтрольныйСъем)
	
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПриЗаполненииТабличнойЧастиПоказания();
	ВспомогательныеПараметры.Период = Объект.Дата;

	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Объект.Организация,Объект.Район,ТаблицаПоказанийДляЗаполнения,Объект.Дата, ПриборыДляОтклоненияПоказаний.Выгрузить(), КонтрольныйСъем);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета, ВспомогательныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючПомещенияРодителя(КлючПомещения)
	Если НЕ ЗначениеЗаполнено(КлючПомещения.Помещение.Родитель) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргКлючиПомещений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|ГДЕ
	|	энргКлючиПомещений.Строение = &Строение
	|	И энргКлючиПомещений.Помещение = &Помещение
	|	И НЕ энргКлючиПомещений.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Помещение", КлючПомещения.Помещение.Родитель);
	Запрос.УстановитьПараметр("Строение", КлючПомещения.Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	
	Если Объект.ТочкиУчета.Количество() > 0 Тогда
		
		Модифицированность = Истина;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекущийОбъект", 	Объект);
		ДопПараметры.Вставить("ТЧ_Объекта",		Новый Структура("ТочкиУчета, ПоказанияПриборовУчета, ШкалыПриборовУчета"));
		ПроверкаОчисткиТЧ(ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОчисткиТЧ(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ПроверкаОчисткиТЧЗавершение",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Очистить табличную часть?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОчисткиТЧЗавершение(Результат,ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
			
		Если ДополнительныеПараметры.Свойство("ТЧ_Объекта") Тогда
			Для каждого ТекТЧ Из ДополнительныеПараметры.ТЧ_Объекта Цикл
				Объект[ТекТЧ.Ключ].Очистить();
			КонецЦикла;
		КонецЕсли;
		
		энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(ДополнительныеПараметры.ТекущийОбъект, ДополнительныеПараметры.ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СервисСозданияДокументовРегистрацииПоказаний

&НаКлиенте
Процедура ПослеВопросаПередСозданиемДокументов(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	РезультатПереноса = Новый Структура("Статус", Истина);
	ЗарегистрироватьПоказанияКСозданиюДокументов(РезультатПереноса);
	Если РезультатПереноса.Статус Тогда 
		
		Записать();
		
		ОбновитьНадписьВыполненияДлительныхОперацийКлиент();	
		Если ОсталосьСоздатьДокументовДлительныхОпераций Тогда 
			ОткрытьФормуЗапускаСозданияДокументовВФоне();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗарегистрироватьПоказанияКСозданиюДокументов(РезультатПереноса)
	
	НаборыЗаписей = Новый Структура;
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаПоказанийТочкиУчета);
	//НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);	
	НаборыЗаписей.Вставить("ТочкиУчета", НаборЗаписей);
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаПоказанийШкалыПриборовУчета);
	//НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
	НаборыЗаписей.Вставить("ШкалыПриборовУчета", НаборЗаписей);
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений.энргЗагрузкаПоказанийПоказанияПриборовУчета);
	//НаборЗаписей.Отбор.ДокументОснование.Установить(Объект.Ссылка);
	НаборыЗаписей.Вставить("ПоказанияПриборовУчета", НаборЗаписей);		
	
	СтрокиКОчистке = Новый Структура(
		"ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета",
		Новый Массив, Новый Массив, Новый Массив);
	ПодготовитьНаборыЗаписейПоказаний(НаборыЗаписей, СтрокиКОчистке);
	
	НачатьТранзакцию();	
	Попытка
		
		Для Каждого СтрокаНабора из НаборыЗаписей Цикл
			
			ТаблицаЗаписи = СтрокаНабора.Значение;
			ТаблицаЗаписи.Записать(Ложь);
						
		КонецЦикла;
		
		ОчиститьЗаписиТЧЗарегистрированныеВОчередь(СтрокиКОчистке);
		
		//Объект.ТочкиУчета.Очистить();
		//Объект.ШкалыПриборовУчета.Очистить();
		//Объект.ПоказанияПриборовУчета.Очистить();
		
		ЗафиксироватьТранзакцию();
	Исключение
	
		ОтменитьТранзакцию(); 	
		
		РезультатПереноса.Статус = Ложь;
		ИнфаОбОшибке 									= ИнформацияОбОшибке();
		ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
		ПараметрыЖурнала.ТекстПользователю 				= "Не удалось зарегистрировать показания в массовом вводе показаний по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
		энргОбщегоНазначения.ЗарегистрироватьОшибку(
			"Регистрирация показаний в массовом вводе показаний", 
			УровеньЖурналаРегистрации.Ошибка, 
			ПодробноеПредставлениеОшибки(ИнфаОбОшибке), 
			ПараметрыЖурнала);
		
	КонецПопытки;
	
	УстановитьОтборДокументовРегистрацииПоказаний();
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьНаборыЗаписейПоказаний(НаборыЗаписей, СтрокиКОчистке)
	
	СвойстваАбонента = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Абонент КАК Абонент
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргАбоненты.Ссылка КАК Абонент,
		|	МАКСИМУМ(энргАбоненты.Организация) КАК Организация,
		|	МАКСИМУМ(энргАбоненты.Район) КАК Район
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО ТаблицаДанных.Абонент = энргАбоненты.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	энргАбоненты.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", Объект.ТочкиУчета.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЗначениеКлюча = Новый Структура("Организация,Район");
		ЗаполнитьЗначенияСвойств(ЗначениеКлюча, Выборка);
		СвойстваАбонента.Вставить(Выборка.Абонент, ЗначениеКлюча);
	КонецЦикла; 	
	
	СтрокиШкалКэш = Новый Массив;
	СтрокиПоказанийКэш = Новый Массив;
	
	СтрокиТЧШкалКэш = Новый Массив;
	СтрокиТЧПоказанийКэш = Новый Массив;
	
	ОтборШкал = Новый Структура("IDСтрокиТочкиУчета", Неопределено);
	ОтборПоказаний = Новый Структура("IDСтроки", Неопределено);
	Для Каждого СтрокаТочкиУчета из Объект.ТочкиУчета Цикл 
		
		ЕстьНеПредоставленные = Ложь;
		СтрокиШкалКэш.Очистить();
		СтрокиПоказанийКэш.Очистить();
		
		СтрокиТЧШкалКэш.Очистить();
		СтрокиТЧПоказанийКэш.Очистить();
		
		СтрокиКОчистке.ТочкиУчета.Добавить(СтрокаТочкиУчета);		
		
		НоваяСтрокаТУ = НаборыЗаписей.ТочкиУчета.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТУ, СтрокаТочкиУчета);
		ДанныеАбонента = СвойстваАбонента[СтрокаТочкиУчета.Абонент];
		Если ЗначениеЗаполнено(ДанныеАбонента) Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТУ, ДанныеАбонента); 		
		Иначе 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТУ, Объект);
		КонецЕсли;
		НоваяСтрокаТУ.ДокументОснование = Объект.Ссылка;
		НоваяСтрокаТУ.ДатаДокумента = Объект.Дата;
		НоваяСтрокаТУ.ПериодНачисления = Объект.ПериодНачисления;
		
		ОтборШкал.IDСтрокиТочкиУчета = СтрокаТочкиУчета.IDСтроки;
		СтрокиШкал = Объект.ШкалыПриборовУчета.НайтиСтроки(ОтборШкал);		
		Для Каждого СтрокаШкалы из СтрокиШкал Цикл 
			
			СтрокиКОчистке.ШкалыПриборовУчета.Добавить(СтрокаШкалы);
			СтрокиТЧШкалКэш.Добавить(СтрокаШкалы);
			
			НоваяСтрокаШкал = НаборыЗаписей.ШкалыПриборовУчета.Добавить();
			СтрокиШкалКэш.Добавить(НоваяСтрокаШкал);
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШкал, СтрокаШкалы);
			НоваяСтрокаШкал.ДокументОснование = Объект.Ссылка;
			НоваяСтрокаШкал.IDСтрокиТочкиУчета = СтрокаТочкиУчета.IDСтроки;
			
			ОтборПоказаний.IDСтроки = СтрокаШкалы.IDСтроки;
			СтрокиПоказаний = Объект.ПоказанияПриборовУчета.НайтиСтроки(ОтборПоказаний);
			Для Каждого СтрокаПоказаний из СтрокиПоказаний Цикл 
				
				Если НЕ СтрокаПоказаний.ПоказанияПредоставлены Тогда 
					ЕстьНеПредоставленные = Истина;
					Прервать;
				КонецЕсли;
				
				СтрокиКОчистке.ПоказанияПриборовУчета.Добавить(СтрокаПоказаний);
				СтрокиТЧПоказанийКэш.Добавить(СтрокаПоказаний);
				
				НоваяСтрокаПоказаний = НаборыЗаписей.ПоказанияПриборовУчета.Добавить();
				СтрокиПоказанийКэш.Добавить(НоваяСтрокаПоказаний);
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказаний, СтрокаПоказаний);
				НоваяСтрокаПоказаний.ДокументОснование = Объект.Ссылка;
				НоваяСтрокаПоказаний.IDСтрокиТочкиУчета = СтрокаТочкиУчета.IDСтроки;		
				
			КонецЦикла;	
			
		КонецЦикла;
		
		Если ЕстьНеПредоставленные Тогда 
			ОчиститьНеПредоставленныеПоказанияНабораЗаписей(НаборыЗаписей, НоваяСтрокаТУ, СтрокиШкалКэш, СтрокиПоказанийКэш);
			ОчиститьНеПредоставленныеПоказанияТЧ(СтрокиКОчистке, СтрокаТочкиУчета, СтрокиТЧШкалКэш, СтрокиТЧПоказанийКэш);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецФункции

&НаСервере
Процедура ОчиститьНеПредоставленныеПоказанияНабораЗаписей(НаборыЗаписей, СтрокаТУКэш, СтрокиШкалКэш, СтрокиПоказанийКэш)
	
	НаборыЗаписей.ТочкиУчета.Удалить(СтрокаТУКэш);
	
	Для Каждого СтрокаДанных из СтрокиШкалКэш Цикл
		НаборыЗаписей.ШкалыПриборовУчета.Удалить(СтрокаДанных);
	КонецЦикла;
	
	Для Каждого СтрокаДанных из СтрокиПоказанийКэш Цикл
		НаборыЗаписей.ПоказанияПриборовУчета.Удалить(СтрокаДанных);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНеПредоставленныеПоказанияТЧ(СтрокиКОчистке, СтрокаТУКэш, СтрокиШкалКэш, СтрокиПоказанийКэш)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СтрокиКОчистке.ТочкиУчета, СтрокаТУКэш);
	
	Для Каждого СтрокаДанных из СтрокиШкалКэш Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СтрокиКОчистке.ШкалыПриборовУчета, СтрокаДанных);
	КонецЦикла;
	
	Для Каждого СтрокаДанных из СтрокиПоказанийКэш Цикл 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СтрокиКОчистке.ПоказанияПриборовУчета, СтрокаДанных);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаписиТЧЗарегистрированныеВОчередь(СтрокиКОчистке)
	
	Для Каждого СтрокаДанных из СтрокиКОчистке.ТочкиУчета Цикл
		Объект.ТочкиУчета.Удалить(СтрокаДанных);
	КонецЦикла;
	
	Для Каждого СтрокаДанных из СтрокиКОчистке.ШкалыПриборовУчета Цикл
		Объект.ШкалыПриборовУчета.Удалить(СтрокаДанных);
	КонецЦикла;
	
	Для Каждого СтрокаДанных из СтрокиКОчистке.ПоказанияПриборовУчета Цикл
		Объект.ПоказанияПриборовУчета.Удалить(СтрокаДанных);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДокументовРегистрацииПоказаний()
	
	//ДокументОснованиеСсылка = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	ДокументОснованиеСсылка = ?(
		ЗначениеЗаполнено(Объект.Ссылка), 
		Объект.Ссылка, 
		Документы.энргЗагрузкаДанныхИзВнешнихИсточников.ПолучитьСсылку(Новый УникальныйИдентификатор));
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ДокументыПоказанийПриборовУчета,
		"ДокументОснование",
		ДокументОснованиеСсылка);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ДокументыПоказанийПриборовУчета,
		"ПоказыватьОтклоненные",
		Ложь);	
		
КонецПроцедуры

#Область ОтчетПоказаний

&НаКлиенте
Процедура ДокументыПоказанийПриборовУчетаПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДокументыПоказанийПриборовУчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПоказанийПриборовУчетаПриАктивизацииСтрокиНаСервере(ДанныеРегистрацииПоказаний, ТекДанные.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументыПоказанийПриборовУчетаПриАктивизацииСтрокиНаСервере(ТабДок, ДокументПоказаний)
	
	ТабДок.Очистить();
	энргМассоваяРегистрацияПоказаний.ЗаполнитьМакетПоказанийПоДокументуПоказаний(ТабДок, ДокументПоказаний);
	
КонецФункции   
	
#КонецОбласти

#Область РаботаСФоновымСозданиемДокументов

&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументовВФоне()
	
	ПараметрыПередачи = Новый Структура("ДокументСсылка", Объект.Ссылка);
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормыРаботыВФоне", ЭтотОбъект);
	ОткрытьФорму(
		"Документ.энргЗагрузкаПоказанийИзВнешнихИсточников.Форма.ФормаСозданияДокументовВФоне",
		ПараметрыПередачи,,,,,ОповещениеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗакрытияФормыРаботыВФоне(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();	
	УстановитьОтборДокументовРегистрацииПоказаний();
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры	


&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументов(Команда)
	ОткрытьФормуЗапускаСозданияДокументовВФоне();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОпераций(Команда)
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОперацийКлиент()
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(Объект.Ссылка);
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНадписьСозданияДокументов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГрупппаВыполненияДлительныхОпераций",
		"Видимость",
		Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьВыполненияДлительныхОпераций",
		"ЦветТекста",
		Новый Цвет(255,0,0));
						
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 Тогда 
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГрупппаВыполненияДлительныхОпераций",
			"Видимость",
			Ложь);
				
		Возврат;
		
	КонецЕсли;
		
	Если КоличествоАктивныхДлительныхОпераций > 0 Тогда
		
		ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов %2";
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НадписьВыполненияДлительныхОпераций",
			"Заголовок",
			СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций, КоличествоАктивныхДлительныхОпераций));
			
		Возврат;
		
	КонецЕсли;	
	
	ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов нет, необходимо повторно запустить процесс создания документов.";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьВыполненияДлительныхОпераций",
		"Заголовок",
		СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций));	
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка)	
	
	Возврат	РегистрыСведений.энргЗагрузкаПоказанийТочкиУчета.КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка);
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьКоличествоАктивныхДлительныхОпераций()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КоличествоАктивныхДлительныхОпераций = 0;
	Активные = ДлительныеОперацииКлиент.АктивныеДлительныеОперации();
	
	Для Каждого КлючЗначение Из Активные.Список Цикл
		Попытка
			
			Если КлючЗначение.Значение.ОповещениеОЗавершении.ДополнительныеПараметры.ДокументСсылка = Объект.Ссылка Тогда
				КоличествоАктивныхДлительныхОпераций = КоличествоАктивныхДлительныхОпераций + 1;					
			КонецЕсли; 			
			
		Исключение
			
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти


#Область РаботаССостояниемДокументовПоказаний


#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовКлиент()
	
	// 1. Запуск фонового задания на сервере.
	ЗависимыеРеквизиты = ПолучитьЗависимыеРеквизиты();
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитов", ЭтотОбъект);
	
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка, 
		ЗависимыеРеквизиты);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитов(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПроведениеПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеПроведениеПоказанийКлиент()
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияПроведениеПоказаний", ЭтотОбъект);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеПроведениеПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
			
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияПроведениеПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиОтменаПроведенияПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказанийКлиент()
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияОтменаПроведенияПоказаний", ЭтотОбъект);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияОтменаПроведенияПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДатойДокумента

&НаКлиенте
Процедура УстановитьДатуОтСвязанныхДокументовПоказаний()
	
	Объект.Дата = ПолучитьДатуОтСвязанныхДокументовПоказаний(Объект.Ссылка, Объект.Дата);	
	ОбновитьПериодНачисления();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента)
	//Возврат Документы.энргРегистрацияПоказанийАбонента.ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента);
	Возврат энргМассоваяРегистрацияПоказаний.ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента);
КонецФункции

#КонецОбласти

#КонецОбласти 

#Область РазграничениеФункционала

&НаСервереБезКонтекста
Функция НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты)
	//Возврат Документы.энргРегистрацияПоказанийАбонента.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
	Возврат энргМассоваяРегистрацияПоказаний.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
КонецФункции 

&НаКлиенте
Процедура ПослеВопросаОНеобходимостиКорректировкиСвязанныхДокументов(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		УстановитьДатуОтСвязанныхДокументовПоказаний();
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовКлиент();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗависимыеРеквизиты()
	
	Результат = Новый Структура("Дата", Объект.Дата);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

ПодтвежденоЗакрытие = Ложь;