#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

Процедура КлючиПомещенийПоПредставлениюАдресов(Схема, ТаблицаДляПомещения) Экспорт 
	
	яСхема 		= Неопределено;	
	Справочники.энргПомещения.ПомещенияПоПредставлениюАдресов(яСхема);
	Справочники.энргСтроения.ЧастныеДомаПоПредставлениюАдресов(яСхема);
	
	ТекстПомещения  			= яСхема.ПакетЗапросов[0].ПолучитьТекстЗапроса();
	ТекстСтроения  				= яСхема.ПакетЗапросов[1].ПолучитьТекстЗапроса();
	ТекстОбъединения 			= ТекстПомещения + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС + ТекстСтроения;	
	
	Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстОбъединения);
	Пакет.ТаблицаДляПомещения 	= "СтроенияПомещения";
	
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ИмяПараметра,ТаблицаИсточник,ТипПараметра,СоотвествиеПолей","СтроенияПомещения","СтроенияПомещения","ТипПараметраВременнаяТаблица",Новый Структура("Строение,Помещение","Строение","Помещение")));
		
	ПараметрыКлючПомещений 		= Новый Структура("Отбор", ПараметрыВТ);
	РегистрыСведений.энргКлючиПомещений.ДанныеПомещения(Схема,ПараметрыКлючПомещений,ТаблицаДляПомещения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли