#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отборы = Новый Структура;
	Отборы.Вставить("Контрагент", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Отбор", Отборы);
	ОткрытьФорму("РегистрСведений.энргДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти