#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет схему срез последних.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуСрезПоследних(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуСрезПоследних());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];
	
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация";
		ПараметрыВТ 						= ПараметрыСхемы.ПараметрыВТ;
		Источник 							= ОператорВыбора.Источники[0].Источник;
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Источник.Параметры[1],ПараметрыВТ,ДоступныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуСрезПоследних()
	Текст  = 
	"ВЫБРАТЬ
	|	энргПериодыПриемаПоказанийСрезПоследних.Период КАК Период,
	|	энргПериодыПриемаПоказанийСрезПоследних.Организация КАК Организация,
	|	энргПериодыПриемаПоказанийСрезПоследних.ДатаС КАК ДатаС,
	|	энргПериодыПриемаПоказанийСрезПоследних.ДатаПо КАК ДатаПо
	|ИЗ
	|	РегистрСведений.энргПериодыПриемаПоказаний.СрезПоследних КАК энргПериодыПриемаПоказанийСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли