
Процедура ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,Период,ПолучаемыеСвойства,ТекстыЗапросов) Экспорт 
	
КонецПроцедуры

Процедура ПараметрыРасчетаАбонента(Организация,Район,Абонент,Период,ПолучаемыеСвойства,ДанныеАбонента, ТекстыЗапросов) Экспорт 
	
	//Если ПолучаемыеСвойства.ДанныеАбонента.свойство("ОснованиеСобственности") тогда
	//	бестРаботаСЛицевымСчетомСервер.ПолучитьДанныеОДокументеФизЛица(ТекДата, Абонент, Справочники.ВидыДокументовФизическихЛиц.ОснованиеСобственности, "ОснованиеСобственности", ПолучаемыеСвойства.ДанныеАбонента);
	//КонецЕсли;
	//
	//Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("ПаспортныеДанные") тогда
	//	бестРаботаСЛицевымСчетомСервер.ПолучитьДанныеОДокументеФизЛица(ТекДата, ФизЛицо, Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, "ПаспортныеДанные", ПолучаемыеСвойства.ДанныеФизЛица);
	//КонецЕсли;
	
КонецПроцедуры
