#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	Если ПравоДоступа("Изменение", Метаданные.Документы.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД) Тогда
		//Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииУстановитьЗначениеПлощади(КомандыСоздатьНаОсновании);
	КонецЕсли;
	// -- Акимов Д.В.
	
	
КонецФункции

#КонецОбласти

#КонецЕсли