#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив объектов расчета.
//
Функция МассивОбъектовРасчета() Экспорт
	
	Запрос			= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст	=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестИзменениеИндивидуальныхНастроекСезонности.Организация КАК Организация,
	|	бестИзменениеИндивидуальныхНастроекСезонности.Район КАК Район,
	|	бестИзменениеИндивидуальныхНастроекСезонности.ПериодНачисления КАК ПериодНачисления,
	|	бестИзменениеИндивидуальныхНастроекСезонности.Дата КАК Период,
	|	бестИзменениеИндивидуальныхНастроекСезонности.Дата КАК ПериодРегистрации,
	|	бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.ОбъектРасчета.МКД КАК МКД
	|ИЗ
	|	Документ.бестИзменениеИндивидуальныхНастроекСезонности.ТочкиУчета КАК бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеИндивидуальныхНастроекСезонности КАК бестИзменениеИндивидуальныхНастроекСезонности
	|		ПО бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.Ссылка = бестИзменениеИндивидуальныхНастроекСезонности.Ссылка
	|ГДЕ
	|	бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.Ссылка = &Ссылка" ;
	
	ДополнительныеСвойства.Вставить("МассивОбъектов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	энргДатаПоследнегоИзменения = ТекущаяДата();
	
	ДополнительныеСвойства.Вставить("МассивОбъектовРасчета",Истина);
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект); 
	
	
	ПроведениеПоРегистрам();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПоРегистрам()
	Пакет = ПолучитьДанныеТЧ();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(Пакет,	Движения.бестИндивидуальныеНастройкиСезонностиУслуг);	
КонецПроцедуры

Функция ПолучитьДанныеТЧ()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА бестИзменениеИндивидуальныхНастроекСезонности.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА бестИзменениеИндивидуальныхНастроекСезонности.Дата
	               |		ИНАЧЕ бестИзменениеИндивидуальныхНастроекСезонности.ДатаФактическогоСобытия
	               |	КОНЕЦ КАК Период,
	               |	бестИзменениеИндивидуальныхНастроекСезонности.Район КАК Район,
	               |	бестИзменениеИндивидуальныхНастроекСезонности.Организация КАК Организация,
	               |	бестИзменениеИндивидуальныхНастроекСезонности.ПериодНачисления КАК ПериодНачисления,
	               |	бестИзменениеИндивидуальныхНастроекСезонности.Дата КАК ПериодРасчета,
	               |	бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	               |	бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.Услуга КАК Услуга,
	               |	ВЫБОР
	               |		КОГДА бестИзменениеИндивидуальныхНастроекСезонности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.бестИзменениеИндивидуальныхНастроекСезонности_ОграничениеУслуги)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Отключена)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеУслуг.Подключена)
	               |	КОНЕЦ КАК Состояние,
	               |	бестИзменениеИндивидуальныхНастроекСезонности.Ссылка КАК Регистратор
	               |ИЗ
	               |	Документ.бестИзменениеИндивидуальныхНастроекСезонности.ТочкиУчета КАК бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеИндивидуальныхНастроекСезонности КАК бестИзменениеИндивидуальныхНастроекСезонности
	               |		ПО бестИзменениеИндивидуальныхНастроекСезонностиТочкиУчета.Ссылка = бестИзменениеИндивидуальныхНастроекСезонности.Ссылка
	               |ГДЕ
	               |	бестИзменениеИндивидуальныхНастроекСезонности.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли