#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Для каждого стр из ТочкиУчета Цикл
		Если стр.КоличествоЧасовШтатнойРаботыПУ > стр.КоличествоЧасовРаботыТУ Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Количество часов штатной работы ПУ не может превышать количество часов работы ТУ.";
			Сообщение.Сообщить();
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	ТаблицаЗарегистрированныеОбъемы = ПолучитьТаблицуЗарегистрированныеОбъемы();
	Выборка	= ТаблицаЗарегистрированныеОбъемы.выбрать();	
	Пока Выборка.Следующий() цикл	
		Запись	= Движения.энргЗарегистрированныеОбъемыПотребленияМКД.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуЗарегистрированныеОбъемы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", Ссылка); 	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Ссылка КАК Регистратор,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Дата КАК Период,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Организация КАК Организация,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Район КАК Район,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.МКД КАК МКД,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.Услуга КАК Услуга,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.Объем) КАК ОбъемПоПрибору,
	|	СУММА(энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.КоличествоЧасовШтатнойРаботыПУ) КАК КоличествоЧасовШтатнойРаботыПУ,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Дата КАК ПериодРегистрации,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ
	|ИЗ
	|	Документ.энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.ТочкиУчета КАК энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияОбъемовПотребленияПриборовУчетаМКД КАК энргРегистрацияОбъемовПотребленияПриборовУчетаМКД
	|		ПО энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.Ссылка = энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Ссылка
	|ГДЕ
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Ссылка = &Док
	|
	|СГРУППИРОВАТЬ ПО
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Ссылка,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.ТочкаУчета,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.Услуга,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.ПриборУчета,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Дата,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Организация,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Район,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.ПериодНачисления,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.КоличествоЧасовРаботыТУ,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКДТочкиУчета.МКД,
	|	энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.Дата";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли