#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
	энргЛокализацияСервер.ПриСозданииНаСервере_энргНастройкиВыполненияГодовойКорректировки(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ.Период) Тогда
		Запись.НачалоПериода 		= НачалоГода(ТекущаяДата());
		Запись.КонецПериода 		= НачалоМесяца(КонецГода(ТекущаяДата()));
	КонецЕсли;
	
	ПредставлениеНачалоПериода 		= Формат(Запись.НачалоПериода,"ДФ=ММММ");
	ПредставлениеОкончаниеПериода 	= Формат(Запись.КонецПериода,"ДФ=ММММ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 		= Ложь;
	Запись.НачалоПериода 			= ДобавитьМесяц(Запись.НачалоПериода, Направление);
	ПредставлениеНачалоПериода 		= Формат(Запись.НачалоПериода,"ДФ=ММММ");
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка 			= Ложь;
	Запись.КонецПериода 			= ДобавитьМесяц(Запись.КонецПериода, Направление);
	ПредставлениеОкончаниеПериода 	= Формат(Запись.КонецПериода,"ДФ=ММММ");
	
КонецПроцедуры

#КонецОбласти