#Область ОбработчикиСобытий

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СпособыРасчетаПоНаправлениям,"Услуга",ТекущийОбъект.Ссылка,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных .Недоступный);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КодыУслуг,"Услуга",ТекущийОбъект.Ссылка,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных .Недоступный);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью() 
	Элементы.ГруппаСтраницыФормы.ПодчиненныеЭлементы.СтраницаСоставляющиеУслуги.Видимость 			= Объект.СоставнаяУслуга;
	Элементы.Товары.Видимость 																		= Не Объект.СоставнаяУслуга;
	//Элементы.ГруппаЖКХ.Видимость																	= Не Объект.СоставнаяУслуга;
	Элементы.ГруппаСтраницыФормы.ПодчиненныеЭлементы.СтраницаСпособыРасчетаПоНаправлениям.Видимость = Не Объект.СоставнаяУслуга И ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ГруппаСтраницыФормы.ПодчиненныеЭлементы.СтраницаФормулыРасчета.Видимость 				= Объект.ТипУслуги = ПредопределенноеЗначение("Перечисление.энргТипыУслуг.ПрочиеУслуга");	
	Элементы.ГруппаСтраницыФормы.ПодчиненныеЭлементы.СтраницаФормулыРасчетаУслуг.Видимость			= НЕ Объект.ТипУслуги = ПредопределенноеЗначение("Перечисление.энргТипыУслуг.ПрочиеУслуга") И Объект.СоставнаяУслуга;
	Элементы.НеПрименятьЗависимостьЕслиБольшеОднойТочки.Видимость									= Не Объект.СоставнаяУслуга;
КонецПроцедуры

&НаКлиенте
Процедура СоставнаяУслугаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ТипУслугиПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаФормулаРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока  					= Элементы.ФормулыРасчета.ТекущиеДанные;
	ДанныеФормулы			 	= ТекСтрока.ФормулаРасчета;
	ОписаниеОповещения 			= Новый ОписаниеОповещения("ЗачершениеРедактированияФормулыРасчета",ЭтотОбъект);
	ОткрытьФорму("Справочник.энргВидыУслуг.Форма.ФормаНастройкиФормулыРасчета",Новый Структура("ДанныеФормулы",ДанныеФормулы),,,,,ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте
Процедура ЗачершениеРедактированияФормулыРасчета(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока  					= Элементы.ФормулыРасчета.ТекущиеДанные;
	ТекСтрока.ФормулаРасчета 	= РезультатЗакрытия;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачершениеРедактированияУсловия(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока  					= Элементы.ФормулыРасчета.ТекущиеДанные;
	ТекСтрока.Условие 			= РезультатЗакрытия;
	
КонецПроцедуры  

&НаКлиенте
Процедура ФормулыРасчетаУсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекСтрока  					= Элементы.ФормулыРасчета.ТекущиеДанные;
	ДанныеФормулы			 	= ТекСтрока.ФормулаРасчета;
	ОписаниеОповещения 			= Новый ОписаниеОповещения("ЗачершениеРедактированияУсловия",ЭтотОбъект);
	ОткрытьФорму("Справочник.энргВидыУслуг.Форма.ФормаНастройкиФормулыРасчета",Новый Структура("ДанныеФормулы",ДанныеФормулы),,,,,ОписаниеОповещения);	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиЗависимыеУслуги

&НаКлиенте
Процедура ЗависимыеУслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СоставУслуги 				= Новый Массив;
	
	Для Каждого СтрокаСостава Из Объект.СоставляющиеУслуг Цикл
		СоставУслуги.Добавить(СтрокаСостава.Услуга);
	КонецЦикла;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(СоставУслуги);
КонецПроцедуры

&НаКлиенте
Процедура ЗависимыеУслугиУслугаЗависитОтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СоставУслуги 				= Новый Массив;
	
	Для Каждого СтрокаСостава Из Объект.СоставляющиеУслуг Цикл
		СоставУслуги.Добавить(СтрокаСостава.Услуга);
	КонецЦикла;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(СоставУслуги);
КонецПроцедуры

#КонецОбласти