#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ = ОбменДанными.Загрузка;
	
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Дата,Номер");
	
	ПредыдущийЭтап 									= ДанныеЗаполнения.ЭтапОбращения; 
	ЭтапОбращения									= СледующийЭтапОбращения(ПредыдущийЭтап);
	Основание 										= ДанныеЗаполнения;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ПервоначальныйДокумент) Тогда
		ПервоначальныйДокумент = ДанныеЗаполнения.ПервоначальныйДокумент;
	Иначе
		ПервоначальныйДокумент = ДанныеЗаполнения;
	КонецЕсли; 	
	
	Если ЭтапОбращения = Справочники.бестЭтапыОбращений.ЭтапОбращений_ЗакрытиеОбращения тогда
		//// Заполняем табличную часть
		//Долги.Очистить();
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаГоспошлина) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Гос пошлина";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаГоспошлина;
		//КонецЕсли;	
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаПеня) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Пеня";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаПеня;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаЗадолженности) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Сумма основного долга";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаЗадолженности;
		//КонецЕсли; 
	КонецЕсли;
	
	ЗаполнитьПлановуюДатуОкончанияЭтапа();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.бестЭтапыОбращений.Записывать 		= Истина;
	Движения.бестЭтапыОбращенийЮрЛиц.Записывать = Истина;
	
	Если ВидОперации = Перечисления.бестВидыОпераций.бестОбращения_ОбращениеФизическогоЛица Тогда
		ПроведениеОбращенияФизЛица();
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.бестОбращения_ОбращениеЮридическогоЛица Тогда
		ПроведениеОбращенияЮрЛица();
	КонецЕсли;		
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// ОТЭК, 20.05.2020, 000353559.
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.бестОбращения_ОбращениеФизическогоЛица") Тогда
		ПроверяемыеРеквизиты.Добавить("Абонент");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.бестОбращения_ОбращениеЮридическогоЛица") Тогда
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПлановуюДатуОкончанияЭтапа() Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Этап", 			ЭтапОбращения);
	ЗАпрос.Текст = "ВЫБРАТЬ
	|	бестСрокиЭтаповОбращенийСрезПоследних.Срок КАК Срок
	|ИЗ
	|	РегистрСведений.бестСрокиЭтаповОбращений.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Этап = &Этап) КАК бестСрокиЭтаповОбращенийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСрокиЭтаповОбращенийСрезПоследних.Срок";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Срок = 0;
	Если Выборка.Следующий() Тогда
		Срок = Выборка.Срок;
	КонецЕсли;
	
	ПлановаяДатаОкончанияЭтапа	= КонецДня(Дата + 86400*Срок);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СледующийЭтапОбращения(ПредыдущийЭтап)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПредыдущийЭтап",ПредыдущийЭтап);
	Запрос.Текст 	="ВЫБРАТЬ
	|	бестЭтапыОбращений.Ссылка КАК Этап
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(бестЭтапыОбращений.Порядок) КАК Порядок
	|	ИЗ
	|		Справочник.бестЭтапыОбращений КАК бестЭтапыОбращений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				бестЭтапыОбращений.Порядок КАК Порядок
	|			ИЗ
	|				Справочник.бестЭтапыОбращений КАК бестЭтапыОбращений
	|			ГДЕ
	|				бестЭтапыОбращений.Ссылка = &ПредыдущийЭтап) КАК ВложенныйЗапрос
	|			ПО (ВложенныйЗапрос.Порядок < бестЭтапыОбращений.Порядок)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестЭтапыОбращений КАК бестЭтапыОбращений
	|		ПО ВложенныйЗапрос.Порядок = бестЭтапыОбращений.Порядок";
	результат  = Запрос.Выполнить();
	Если результат.Пустой() тогда
		Возврат Справочники.бестЭтапыОбращений.ПустаяСсылка();
	иначе
		Выборка = результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Этап;
	КонецЕсли; 
КонецФункции 

Процедура ПроведениеОбращенияФизЛица()
	Таблица	= ПолучитьТаблицуПроведенияФизЛиц(Ссылка);
	Пока Таблица.Следующий() Цикл
		Движение 						= Движения.бестЭтапыОбращений.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Таблица);
	КонецЦикла;	
КонецПроцедуры

Процедура ПроведениеОбращенияЮрЛица()
	Таблица	= ПолучитьТаблицуПроведенияЮрЛиц(Ссылка);
	Пока Таблица.Следующий() Цикл
		Движение 						= Движения.бестЭтапыОбращенийЮрЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Таблица);
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьТаблицуПроведенияФизЛиц(ТекДок)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ТекДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестОбращения.Ссылка КАК Ссылка,
	               |	бестОбращения.Дата КАК Период,
	               |	бестОбращения.Абонент КАК Абонент,
	               |	бестОбращения.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА бестОбращения.Основание = ЗНАЧЕНИЕ(Документ.бестОбращения.ПустаяСсылка)
	               |			ТОГДА бестОбращения.Ссылка
	               |		ИНАЧЕ бестОбращения.Основание
	               |	КОНЕЦ КАК Обращение,
	               |	бестОбращения.ЭтапОбращения КАК Этап,
	               |	бестОбращения.ПлановаяДатаОкончанияЭтапа КАК СрокОкончанияЭтапа
	               |ИЗ
	               |	Документ.бестОбращения КАК бестОбращения
	               |ГДЕ
	               |	бестОбращения.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестОбращения.Ссылка,
	               |	бестОбращения.Дата,
	               |	бестОбращения.Абонент,
	               |	бестОбращения.Организация,
	               |	бестОбращения.ЭтапОбращения,
	               |	бестОбращения.ПлановаяДатаОкончанияЭтапа,
	               |	ВЫБОР
	               |		КОГДА бестОбращения.Основание = ЗНАЧЕНИЕ(Документ.бестОбращения.ПустаяСсылка)
	               |			ТОГДА бестОбращения.Ссылка
	               |		ИНАЧЕ бестОбращения.Основание
	               |	КОНЕЦ";
	Результат = Запрос.Выполнить();
	Выборка	= Результат.Выбрать();
	
	Возврат Выборка;
КонецФункции

Функция ПолучитьТаблицуПроведенияЮрЛиц(ТекДок)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ТекДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестОбращения.Ссылка КАК Ссылка,
	               |	бестОбращения.Дата КАК Период,
	               |	бестОбращения.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА бестОбращения.Основание = ЗНАЧЕНИЕ(Документ.бестОбращения.ПустаяСсылка)
	               |			ТОГДА бестОбращения.Ссылка
	               |		ИНАЧЕ бестОбращения.Основание
	               |	КОНЕЦ КАК Обращение,
	               |	бестОбращения.ЭтапОбращения КАК Этап,
	               |	бестОбращения.ПлановаяДатаОкончанияЭтапа КАК СрокОкончанияЭтапа,
	               |	бестОбращения.Контрагент КАК Контрагент,
	               |	бестОбращения.Договор КАК Договор
	               |ИЗ
	               |	Документ.бестОбращения КАК бестОбращения
				   // ОТЭК, 20.05.2020, 000353559, Комментарий т.к. данные не выбираются во временную таблицу и не используются в запросе.
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачальныйЭтап КАК ВТ_НачальныйЭтап
				   //|		ПО бестОбращения.ЭтапОбращения = ВТ_НачальныйЭтап.НачальныйЭтап
	               |ГДЕ
	               |	бестОбращения.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестОбращения.Ссылка,
	               |	бестОбращения.Дата,
	               |	бестОбращения.Организация,
	               |	бестОбращения.ЭтапОбращения,
	               |	бестОбращения.ПлановаяДатаОкончанияЭтапа,
	               |	бестОбращения.Контрагент,
	               |	бестОбращения.Договор,
	               |	ВЫБОР
	               |		КОГДА бестОбращения.Основание = ЗНАЧЕНИЕ(Документ.бестОбращения.ПустаяСсылка)
	               |			ТОГДА бестОбращения.Ссылка
	               |		ИНАЧЕ бестОбращения.Основание
	               |	КОНЕЦ";
	Результат = Запрос.Выполнить();
	Выборка	= Результат.Выбрать();
	
	Возврат Выборка;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли