#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Процедура МассивПриборов() Экспорт 
			
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ВыводПрибораУчета",	?(ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги,Истина,ложь));
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() ИЛИ ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги Тогда
		Запрос.Текст  	= 
		"ВЫБРАТЬ
		|	ТаблицаПриборов.ПриборУчета,
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.энргОперацияСУслугамиМКД.ТочкиУчета КАК ТаблицаПриборов
		|		ГДЕ ТаблицаПриборов.Ссылка  =&Ссылка
		|			И (НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
		
	Иначе 
		Запрос.Текст  	= 
		"ВЫБРАТЬ
		|	ТаблицаПриборов.ПриборУчета КАК ПриборУчета,
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.энргОперацияСУслугамиМКД.ТочкиУчета КАК ТаблицаТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.ПриборыУзловУчета КАК ТаблицаПриборов
		|		ПО ТаблицаТочкиУчета.Ссылка = ТаблицаПриборов.Ссылка
		|			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
		|			И (ТаблицаПриборов.Ссылка = &Ссылка)
		|			И ТаблицаТочкиУчета.IDСтроки = ТаблицаПриборов.IDСтроки
		|			И (НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	КонецЕсли;

	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("Строение", МКД);
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Документы.энргОперацияСУслугамиМКД.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	Документы.энргОперацияСУслугамиМКД.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
			
КонецПроцедуры 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли