#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Абоненты

// Получает текущие номера пломб
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ПриборыУчета	-	Массив из СправочникСсылка.энргПриборыУчетаАбонента.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ТекущиеНомераПломб(Период, Организация, Район, КлючПомещения = Неопределено, ПриборыУчета= Неопределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСостояниеНомеровПломбПриборовУчета") = Неопределено Тогда
				Возврат Обработки["слжСостояниеНомеровПломбПриборовУчета"].ТекущиеНомераПломб(Период, Организация, Район, КлючПомещения, ПриборыУчета);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	  	
	ПараметрыВТ 						= Новый Массив;
	СоотвествиеПолей 					= Новый Структура("Организация,Район","Организация","Район");
	ПараметрыЗапроса 					= Новый Структура("Организация,Район",Организация, Район);
	Если НЕ КлючПомещения = Неопределено Тогда
		СоотвествиеПолей.Вставить("КлючПомещения","КлючПомещения");
		ПараметрыЗапроса.Вставить("КлючПомещения", КлючПомещения);
	КонецЕсли;
	
	ЕстьОтборПоПриборам = Ложь;
	Если НЕ ПриборыУчета = Неопределено и ТипЗнч(ПриборыУчета) = Тип("Массив") и ПриборыУчета.Количество() > 0 Тогда		
		ЕстьОтборПоПриборам = Истина;
		ПараметрыЗапроса.Вставить("ПриборУчета", ПриборыУчета);
	ИначеЕсли НЕ ПриборыУчета = Неопределено и ТипЗнч(ПриборыУчета) = Тип("СправочникСсылка.энргПриборыУчетаАбонента") Тогда		
		ЕстьОтборПоПриборам = Истина;
		ПараметрыЗапроса.Вставить("ПриборУчета", ПриборыУчета);
	КонецЕсли;	
	
	Для Каждого ТекКлючЗначение из СоотвествиеПолей Цикл
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура(ТекКлючЗначение.Ключ, ТекКлючЗначение.Значение), Неопределено));
	КонецЦикла;
	Если ЕстьОтборПоПриборам Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВСписке", Новый Структура("ПриборУчета", "ПриборУчета"), Неопределено));
	КонецЕсли;
	
	     	
	ПараметрыСхемы						= Новый Структура;	
	ПараметрыСхемы.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	Если НЕ Период = Неопределено Тогда 
		ПараметрыЗапроса.Вставить("Период", Период);
		ПараметрыСхемы.Вставить("Период", Новый Структура("ИмяПараметра,ТипПараметра", "Период", "ГраницаИсключая"));
	КонецЕсли;

	
	Схема 								= Неопределено;
	РегистрыСведений.энргНомерПломбПриборовУчета.НомераПломбВведенныхПриборовДействующихТочек(Схема, ПараметрыСхемы, "");
			
	Результат 							= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);

	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 						= "энргСостояниеНомеровПломбПриборовУчета.ТекущиеНомераПломб";		
		слжОбщегоНазначенияМодуль 		= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультатЗапросаКодом(ИмяМетода, Результат); 		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
	
#КонецОбласти

#Область МКД

// Получает текущие номера пломб МКД
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  МКД				-	СправочникСсылка.энргСтроения.
//  ПриборыУчета	-	Массив из СправочникСсылка.энргПриборыУчетаАбонента.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ТекущиеНомераПломбМКД(Период, Организация, Район, МКД = Неопределено, ПриборыУчета = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСостояниеНомеровПломбПриборовУчета") = Неопределено Тогда
				Возврат Обработки["слжСостояниеНомеровПломбПриборовУчета"].ТекущиеНомераПломбМКД(Период, Организация, Район, МКД, ПриборыУчета);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	  	
	ПараметрыВТ 						= Новый Массив;
	СоотвествиеПолей 					= Новый Структура("Организация,Район", "Организация","Район");
	ПараметрыЗапроса 					= Новый Структура("Организация,Район", Организация, Район);
	Если НЕ МКД = Неопределено Тогда
		СоотвествиеПолей.Вставить("МКД", "МКД");
		ПараметрыЗапроса.Вставить("МКД", МКД);
	КонецЕсли;
	
	ЕстьОтборПоПриборам = Ложь;
	Если НЕ ПриборыУчета = Неопределено и ТипЗнч(ПриборыУчета) = Тип("Массив") и ПриборыУчета.Количество() > 0 Тогда		
		ЕстьОтборПоПриборам = Истина;
		ПараметрыЗапроса.Вставить("ПриборУчета", ПриборыУчета);
	ИначеЕсли НЕ ПриборыУчета = Неопределено и ТипЗнч(ПриборыУчета) = Тип("СправочникСсылка.энргПриборыУчетаАбонента") Тогда		
		ЕстьОтборПоПриборам = Истина;
		ПараметрыЗапроса.Вставить("ПриборУчета", ПриборыУчета);
	КонецЕсли;	
	
	Для Каждого ТекКлючЗначение из СоотвествиеПолей Цикл
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура(ТекКлючЗначение.Ключ, ТекКлючЗначение.Значение), Неопределено));
	КонецЦикла;
	Если ЕстьОтборПоПриборам Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВСписке", Новый Структура("ПриборУчета", "ПриборУчета"), Неопределено));
	КонецЕсли;
	
	     	
	ПараметрыСхемы						= Новый Структура;	
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	Если НЕ Период = Неопределено Тогда 
		ПараметрыЗапроса.Вставить("Период", Период);
		ПараметрыСхемы.Вставить("Период", Новый Структура("ИмяПараметра,ТипПараметра", "Период", "ГраницаИсключая"));
	КонецЕсли;

	
	Схема 								= Неопределено;
	РегистрыСведений.энргНомерПломбПриборовУчетаМКД.НомераПломбВведенныхПриборовДействующихТочек(Схема, ПараметрыСхемы, "");
			
	Результат 							= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);

	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 						= "энргСостояниеНомеровПломбПриборовУчета.ТекущиеНомераПломбМКД";		
		слжОбщегоНазначенияМодуль 		= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультатЗапросаКодом(ИмяМетода, Результат); 		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
	
#КонецОбласти

#КонецОбласти

#КонецЕсли