#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		//Объект.ДатаФактическогоСобытия = Объект.Дата;
	КонецЕсли; 
		
	ЗаполнитьДокумент  = Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			ЗаполнитьДокумент = истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли; 
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета, ТекущийОбъект);

	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) <> Объект.ДатаФактическогоСобытия и ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда 
		ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроведения",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Дата документа отличается от фактической даты! Провести документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект, Истина);		
	
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
	//	
	//	// проверяем и создаем приборы учета 
	//	СоотвествиеКолонок  = Новый Структура;
	//	СоотвествиеКолонок.Вставить("ЗаводскойНомер",		"ЗаводскойНомер");
	//	СоотвествиеКолонок.Вставить("ТипПрибораУчета",		"ТипПрибораУчета");
	//	СоотвествиеКолонок.Вставить("ДатаВыпуска",			"ДатаВыпуска");
	//	СоотвествиеКолонок.Вставить("ДатаПоверкиСчетчика",	"ДатаПоверкиСчетчика");
	//	СоотвествиеКолонок.Вставить("ПриборУчета",			"ПриборУчета"); 
	//	СоотвествиеКолонок.Вставить("ВидКанальности",		"ВидКанальности");
	//	СоотвествиеКолонок.Вставить("КоэффициентПУ",		"КоэффициентПУ");
	//	
	//	Для Каждого стр из Объект.ТочкиУчета цикл
	//		стр.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
	//	КонецЦикла;
	//	
	//	энргРаботаСприборамиУчетаСервер.ПроверитьИСоздатьПриборы(Объект.ТочкиУчета, ТекущийОбъект.ТочкиУчета,СоотвествиеКолонок,Ложь,Отказ);		
	//	
	//КонецЕсли;
	//
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект, Истина);
	ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, Объект.ТочкиУчета, ТекущийОбъект, Истина);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПроверитьЗаполнениеДанных(Отказ);
		
		энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаУзловПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		//НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);		
		
		НовыеПриборыУчета 					= Новый Массив;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	КонецЕсли; 


КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//	энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.ПериодНачисления,Объект.Район,Объект.МКД,Объект.Абонент);
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.ОбъектРасчета);
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
	Если ДопСвойства.свойство("ДанныеДляФормулы") тогда
		ДанныеДляФормулы = ДопСвойства.ДанныеДляФормулы;		 
	иначе
		ДанныеДляФормулы = Неопределено;
	КонецЕсли;
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ЕстьРасчетныеТочки = ПроверитьТочкиУчетаВРСРасчетныеФормулы();
		Если ЕстьРасчетныеТочки Тогда
			ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияУстановкиФормулы",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения,"В списке присутствуют принимающие участие в расчетах точки учета! Открыть документ установки формулы расчета?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестОперацияСПриборомУчетаНП",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчета1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчета2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчета3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьВыборТипаПУ(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)		

	ТекущиеДанные			= Элементы["ТочкиУчета"				+ ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыШкалВывод			= Элементы["ШкалыПриборовУчетаВывод"		+ ПрефиксТочекУчета];
	ТаблицаФормыШкалВвод			= Элементы["ШкалыПриборовУчетаВвод"			+ ПрефиксТочекУчета];
	ТаблицаФормыФормул				= Элементы["ФормулыРасчетаУслуг"			+ ПрефиксТочекУчета];
	ТаблицаФормыШкалУслуг			= Элементы["ШкалыУслуг"						+ ПрефиксТочекУчета];
	//ТаблицаФормыПоказанийВывод		= Элементы["ПоказанияПриборовУчетаВывод"	+ ПрефиксТочекУчета];
	//ТаблицаФормыПоказанийВвод		= Элементы["ПоказанияПриборовУчетаВвод"		+ ПрефиксТочекУчета];

	
	// энргРаботаСВидомКанальности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалВывод,		"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтрокиВывод); 
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалВвод,		"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтроки); 
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыФормул,			"IDСтроки",				ТекущиеДанные.IDСтроки); 
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг, 		"IDСтроки",				ТекущиеДанные.IDСтроки); 
	
КонецПроцедуры	

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыПоказанийВывод		= Элементы["ПоказанияПриборовУчетаВывод"	+ ПрефиксТочекУчета];
	ТаблицаФормыПоказанийВвод		= Элементы["ПоказанияПриборовУчетаВвод"		+ ПрефиксТочекУчета];
		
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказанийВывод,	"IDСтроки",			ТекущиеДанные.IDСтрокиШкалыВывод);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказанийВвод,	"IDСтроки",			ТекущиеДанные.IDСтрокиШкалы);
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки,		Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиВывод,	Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки,		Объект, ТаблицыФормы, "ТочкиУчета");
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиВывод,	Объект, ТаблицыФормы, "ТочкиУчета");
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалы,		Объект, ТаблицыФормы);
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалыВывод,	Объект, ТаблицыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиШкалы,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности,ТекущиеДанные.услуга),"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидКанальностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомКанальности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомКанальности }
	
	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ВидКанальности);
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЗаводскойНомерПриИзменении(Элемент)	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура  ТочкиУчетаДатаПоверкиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииСравнение(ТекущиеДанные, "ДатаПоверки", "Дата поверки");
	ЗаполнитьКоэфициент(ТекущиеДанные);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаВывод
&НаКлиенте
Процедура ШкалыПриборовУчетаВыводЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаВывод" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаВывод" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказания,"IDСтроки",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаВводЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаВвод" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаВвод" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказания,"IDСтроки",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаВводВидДифференцированностиЕстьШкалыЕстьТарифныеЗоныПриИзменении(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаВвод" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	Состав 									= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтроки,Состав,"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФормулыРасчетаУслуг
&НаКлиенте
Процедура ШкалыУслугШкалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	Элемент.СписокВыбора.ЗагрузитьЗначения(СоставКанальности);
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаУслугПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанныеФормул						= Элементы["ФормулыРасчетаУслуг" + ПрефиксТочекУчета].ТекущиеДанные;

		ТекущиеДанныеФормул.IDСтроки			= ТекущиеДанные.IDСтроки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаВыводЕстьШкалыНетТарифныхЗон
&НаКлиенте
Процедура ШкалыПриборовУчетаВыводЕстьШкалыНетТарифныхЗонПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаВыводЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьЗаполнениеДанных(Отказ)
	Если Объект.ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ Тогда
		СтруктураОбязательныхТЧ = Новый Структура;
	    ПолучитьМассивТЧ(СтруктураОбязательныхТЧ);
				
		Для каждого стр из СтруктураОбязательныхТЧ Цикл
			Если стр.Значение.Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена ТЧ '" + стр.Ключ +"'");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьМассивТЧ(Структура)
	Структура.Вставить("ШкалыПриборовУчета",	Объект.ШкалыПриборовУчета);
	Структура.Вставить("Показания", 			Объект.ПоказанияПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер()
	
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	
	//Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоДоговору(Объект.Дата,Объект.Организация,Объект.Район,Объект.Договор); 
	//Выборка  									= Результат.выбрать();
	//ТекТочкаУчета 								= Неопределено;
	//ТекШкала 									= Неопределено;
	//IDСтрокиТочки 								= Неопределено;
	//IDСтрокиШкалы 								= Неопределено;
	//Пока Выборка.следующий() цикл
	//	НоваяТочка = Ложь;
	//	Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
	//		НоваяТочка = Истина;
	//		СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
	//		IDСтрокиТочки 						= Новый УникальныйИдентификатор;
	//		IDСтрокиТочкиВывод					= Новый УникальныйИдентификатор;
	//		ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка,,"ПриборУчета");
	//		СтрокаТочкиУчета.ПриборУчетаВывод	= Выборка.ПриборУчета;
	//		СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
	//		СтрокаТочкиУчета.IDСтрокиВывод 		= IDСтрокиТочкиВывод;
	//	КонецЕсли;
	//	
	//	Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
	//		СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
	//		IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
	//		СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочкиВывод;
	//		СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
	//		СтрокаШкалы.Шкала 					= Выборка.Шкала;
	//		СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
	//	КонецЕсли;

	//	СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
	//	СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
	//	СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
	//	
	//	ТекТочкаУчета 							= Выборка.ТочкаУчета;
	//	ТекПрибор 								= Выборка.ПриборУчета
	//КонецЦикла;
	
	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район,Объект.ОбъектРасчета); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл 		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета или НЕ ТекПрибор = Выборка.ПриборУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			IDСтрокиТочкиВывод					= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка,,"ПриборУчета");
			СтрокаТочкиУчета.ПриборУчетаВывод	= Выборка.ПриборУчета;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.IDСтрокиВывод 		= IDСтрокиТочкиВывод;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Шкала) И (НоваяТочка Или НЕ ТекШкала = Выборка.Шкала) Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочкиВывод;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;			
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			
			Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда
				СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
				СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
				СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
				СтрокаПоказаний.ВыводПрибораУчета		= Истина;
				СтрокаПоказаний.IDСтрокиТочкиУчета      = IDСтрокиТочкиВывод;
			КонецЕсли;
			
			
			// Автозаполнение для ввода
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;			
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			СтрокаШкалы.ВидПараметра			= Выборка.ВидПараметра;
			
		КонецЕсли;

		Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекПрибор 								= Выборка.ПриборУчета;
	КонецЦикла;
	

	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаВыводЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ШкалыПриборовУчетаВыводЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаВыводНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	Иначе	
		текСтрока 								= Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущиеДанные;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока,ДанныеСтроки);
	КонецЕсли;
	
	Если Не ИспользоватьТарифныеЗоны И Не ИспользоватьШкалыПриборовУчета Тогда
		// меняем местами ТекущиеПоказания и ТекущиеПоказанияВывод
		ТекущиеПоказания = текСтрока.ТекущиеПоказания;
		текСтрока.ТекущиеПоказания = текСтрока.ТекущиеПоказанияВывод;
		бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.Дата,Ложь);	
		текСтрока.ТекущиеПоказания = ТекущиеПоказания;
	Иначе
		бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.Дата,Ложь);	
	КонецЕсли;
	
	
	Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		ТекДанные		= ДополнительныеПараметры.ТекДанные;
		СтруктураОтбора	= ДополнительныеПараметры.СтруктураОтбора;
		СтруктураОтбора.ТочкаУчета		= РезультатЗакрытия.ТочкаУчета;
		СтруктураОтбора.Услуга			= РезультатЗакрытия.Услуга;
		
		ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора);
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора)  
	
	Результат 								= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаТочкиУчетаЮрЛиц(СтруктураОтбора.Период,СтруктураОтбора.Организация,СтруктураОтбора.Район,СтруктураОтбора.Договор, СтруктураОтбора.ОбъектРасчета, СтруктураОтбора.ТочкаУчета); 
	Выборка  								= Результат.выбрать();
	Если Выборка.следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Выборка); 		 
	КонецЕсли;
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьПоказанияПрибораУчета(Объект.ПоказанияПриборовУчета, СтруктураОтбора, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		МКД = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "МКД");
		Если ЗначениеЗаполнено(МКД) Тогда
			АдресОбъекта = МКД;
		Иначе
			АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПроведения(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Нет тогда
			Отказ = Истина;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКанальности) тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.ВидКанальности = ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияУстановкиФормулы(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаУстановкаФормулыРасчета(ДанныеДляФормулы);
		иначе
			ДанныеДляФормулы = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьТочкиУчетаВРСРасчетныеФормулы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	энргТочкиУчета.Ссылка КАК ТочкаУчета
	|ПОМЕСТИТЬ ВрТ
	|ИЗ
	|	Справочник.энргТочкиУчета КАК энргТочкиУчета
	|ГДЕ
	|	энргТочкиУчета.Ссылка В(&ТочкиУчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргТочкиУчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка, ЛОЖЬ) КАК Рассчитываемая
	|ИЗ
	|	ВрТ КАК ВрТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(&Дата, ) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	|		ПО ВрТ.ТочкаУчета = энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВрТ.ТочкаУчета,
	|	ЕСТЬNULL(энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник, ЛОЖЬ)
	|ИЗ
	|	ВрТ КАК ВрТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(&Дата, ) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	|		ПО ВрТ.ТочкаУчета = энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия,Объект.Дата));
	Запрос.УстановитьПараметр("ТочкиУчета", Объект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат ложь;
	КонецЕсли;
КонецФункции

#Область ВыборТипаПУ

&НаКлиенте
Процедура ОткрытьВыборТипаПУ(СтандартнаяОбработка)
	
	ИмяТаблицыТочек 	= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 		= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Соответсвие = новый Соответствие;
	Соответсвие.Вставить("ТипУзлаУчета","ТипУзлаУчета");
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(,ТекущиеДанные.УзелУчета,Соответсвие);
	
	ТипУзлаУчета = Соответсвие["ТипУзлаУчета"];
	Если ЗначениеЗаполнено(ТипУзлаУчета) Тогда 
		КолвоСостава = ПолучитьКолвоСоставаУзла(ТипУзлаУчета);
		
		Если КолвоСостава > 0 Тогда 	
			
			СоответсвиеТипа = новый Соответствие;
			СоответсвиеТипа.Вставить("ТипПрибораУчета","");
			энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(,ТекущиеДанные.ПриборУчетаВывод,СоответсвиеТипа);
			
			СоответсвиеРод = новый Соответствие;
			СоответсвиеРод.Вставить("Родитель","");
			энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(,СоответсвиеТипа["ТипПрибораУчета"],СоответсвиеРод);			
			
			СтандартнаяОбработка = Ложь;
			СтруктураОтбора = Новый Структура("Родитель",СоответсвиеРод["Родитель"]);			
			ПараметрыВыбораФормы	= Новый Структура("Отбор", СтруктураОтбора);
			ОписаниеОповещения 		= Новый ОписаниеОповещения("ТипПрибораУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекущиеДанные));
			
			Форма 					= ОткрытьФорму("Справочник.энргТипыПриборовУчета.ФормаВыбора",ПараметрыВыбораФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список;   			
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПрибораУчетаОкончаниеВыбора(Результат,ДополнительныеПараметры) Экспорт  
	
	Если Результат <> Неопределено Тогда 
		ТекДанные					= ДополнительныеПараметры.ТекДанные;
		ТекДанные.ТипПрибораУчета	= Результат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКолвоСоставаУзла(ТипУзлаУчета)
	Возврат ТипУзлаУчета.СоставУзла.Количество();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПЕРЕОПРЕДЕЛЕННЫЕ_ПРОЦЕДУРЫ

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(КоллекцияТУ, КоллекцияПУ, ТекущийОбъект, ТолькоПрибор = Ложь)
	Сч 					= 0;
	СоответствиеУзлов 	= Новый Соответствие;	
	
	Для Каждого СтрокаТочки Из КоллекцияПУ Цикл		
		ЕстьДанные  							= Ложь; 
		
		Запись  								= Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьНачалоОбъекта(); 	
		
		Если ЗначениеЗаполнено(СтрокаТочки.ЗаводскойНомер) Тогда
			Запись.ЗаписатьИмяСвойства("ЗаводскойНомер");
			Запись.ЗаписатьЗначение(СтрокаТочки.ЗаводскойНомер); 		
			
			Запись.ЗаписатьИмяСвойства("РегистрируетОбъем");
			Запись.ЗаписатьЗначение("" + СтрокаТочки.РегистрируетОбъем);
			
			ЕстьДанные 							= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТочки.ТипПрибораУчета) Тогда
			Запись.ЗаписатьИмяСвойства("ТипПрибораУчета");
			Запись.ЗаписатьЗначение("" + СтрокаТочки.ТипПрибораУчета.УникальныйИдентификатор());
			ЕстьДанные 							= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТочки.ТипПрибораУчета) И Не ЗначениеЗаполнено(СтрокаТочки.ВидКанальности)  Тогда
			Запись.ЗаписатьИмяСвойства("ВидКанальности");
			Запись.ЗаписатьЗначение("" + Справочники.энргВидыКанальности.Одноканальный.УникальныйИдентификатор());
			ЕстьДанные 							= Истина;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТочки.ТипПрибораУчета)Тогда
			Запись.ЗаписатьИмяСвойства("ВидКанальности");
			Запись.ЗаписатьЗначение("" + СтрокаТочки.ВидКанальности.УникальныйИдентификатор());
			ЕстьДанные 							= Истина;
		КонецЕсли;
		
		Запись.ЗаписатьКонецОбъекта(); 
		
		ЗаписываемаяСтрока  					= ТекущийОбъект.ТочкиУчета[Сч];//ТекущийОбъект.ПриборыУзловУчета[Сч];
		ЗаписываемаяСтрока.ОписаниеПрибора 		= "";
		Если ЕстьДанные Тогда
			ЗаписываемаяСтрока.ОписаниеПрибора 	= Запись.Закрыть();
			
			Если СоответствиеУзлов.Получить(СтрокаТочки.IDСтроки) = Неопределено Тогда
				СоответствиеУзлов.Вставить(СтрокаТочки.IDСтроки,СтрокаТочки.ЗаводскойНомер);
			КонецЕсли;
			
		КонецЕсли;
		Сч 										= Сч + 1;		
		
	КонецЦикла;
	
	Если ТолькоПрибор Тогда
		Возврат
	КонецЕсли;
		
	
	Сч 											= 0;
	Для Каждого СтрокаТочки Из КоллекцияТУ Цикл		  		
		
		ЗаписьДляУзла  							= Новый ЗаписьJSON;
		ЗаписьДляУзла.УстановитьСтроку();
		ЗаписьДляУзла.ЗаписатьНачалоОбъекта();
		
		ЕстьДанныеУзла 							= Ложь;
		
		ЗаводскойНомерДляУзла = СоответствиеУзлов.Получить(СтрокаТочки.IDСтроки);
		Если не ЗаводскойНомерДляУзла = Неопределено Тогда
			ЗаписьДляУзла.ЗаписатьИмяСвойства("ЗаводскойНомер");
			ЗаписьДляУзла.ЗаписатьЗначение(ЗаводскойНомерДляУзла);
			
			ЗаписьДляУзла.ЗаписатьИмяСвойства("ТипУзлаУчета");
			ЗаписьДляУзла.ЗаписатьЗначение("" + СтрокаТочки.ТипУзлаУчета.УникальныйИдентификатор());
			
			ЕстьДанныеУзла = Истина;
		КонецЕсли;
		ЗаписьДляУзла.ЗаписатьКонецОбъекта();

		
		//Запись  								= Новый ЗаписьJSON;
		//Запись.УстановитьСтроку();
		//Запись.ЗаписатьНачалоОбъекта();		
		//
		//ЕстьДанные  							= Ложь;
		//
		//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТочки,"НаименованиеТочки") И ЗначениеЗаполнено(СтрокаТочки.НаименованиеТочки) Тогда
		//	Запись.ЗаписатьИмяСвойства("НаименованиеТочки");
		//	Запись.ЗаписатьЗначение(СтрокаТочки.НаименованиеТочки);
		//	ЕстьДанные 							= Истина;
		//КонецЕсли;
		//
		//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТочки,"Расположение") И ЗначениеЗаполнено(СтрокаТочки.Расположение) Тогда
		//	Запись.ЗаписатьИмяСвойства("Расположение");
		//	Запись.ЗаписатьЗначение("" + СтрокаТочки.Расположение.УникальныйИдентификатор());
		//	ЕстьДанные 							= Истина;
		//КонецЕсли;
		//
		//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТочки,"Головная") Тогда
		//	Запись.ЗаписатьИмяСвойства("Головная");
		//	Запись.ЗаписатьЗначение(СтрокаТочки.Головная);
		//	ЕстьДанные 							= Истина;
		//КонецЕсли;
		//
		//Запись.ЗаписатьКонецОбъекта();
		ЗаписываемаяСтрока  					= ТекущийОбъект.ТочкиУчета[Сч];
		//ЗаписываемаяСтрока.ОписаниеТочки 		= "";
		ЗаписываемаяСтрока.ОписаниеПрибора 		= "";
		//
		//Если ЕстьДанные Тогда
		//	ЗаписываемаяСтрока.ОписаниеТочки 	= Запись.Закрыть();
		//КонецЕсли;
		
		Если ЕстьДанныеУзла Тогда
			ЗаписываемаяСтрока.ОписаниеПрибора 	= ЗаписьДляУзла.Закрыть();
		КонецЕсли;
		
		Сч 										= Сч + 1;		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДатаВыпускаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииСравнение(ТекущиеДанные, "ДатаВыпуска", "Дата выпуска");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДатаВыпуска1ПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииСравнение(ТекущиеДанные, "ДатаВыпуска", "Дата выпуска");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДатаВыпуска2ПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииСравнение(ТекущиеДанные, "ДатаВыпуска", "Дата выпуска");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДатаВыпуска3ПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииСравнение(ТекущиеДанные, "ДатаВыпуска", "Дата выпуска");
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = ПолучитьЗначениеРеквизита(Объект.Район, "Организация");
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизита(ТекОбъект, ИмяРеквизита)
	Возврат ТекОбъект[ИмяРеквизита];	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдрессОбъекта();
	ЗаполнитьДанныеДоговораСервер();
	МКД = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "МКД");
КонецПроцедуры

#КонецОбласти