
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ДВИЖЕНИЙ

&НаКлиенте
Процедура ЗаписиРегистраПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда 		
		Элемент.ТекущиеДанные.Период 		= Объект.Дата;		
		Элемент.ТекущиеДанные.Регистратор 	= Объект.Ссылка;
		Элемент.ТекущиеДанные.Организация 	= Объект.Организация;		
		Элемент.ТекущиеДанные.Район 		= Объект.Район;		
		Элемент.ТекущиеДанные.Оспаривается 	= Ложь;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиРегистраПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметры.Ключ.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед добавлением необходимо записать объект");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиРегистраПериодНачисленияПриИзменении(Элемент)
	ТекДанные 					= Элементы.ЗаписиРегистра.ТекущиеДанные;
	ТекДанные.ПериодНачисления 	= НачалоМесяца(ТекДанные.ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиРегистраАбонентПриИзменении(Элемент)
	ТекДанные 		= Элементы.ЗаписиРегистра.ТекущиеДанные;
	ДанныеАбонента  =  Новый Структура("ЧастныйСектор,Строение");
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(ТекДанные.Абонент,ДанныеАбонента);
	МКД	 			= ?(НЕ ДанныеАбонента.ЧастныйСектор,ДанныеАбонента.Строение, ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"));
	
	ТекДанные.МКД 	= МКД;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацииСПериодамиОспариванияЗадолженности(ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти