
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_энргЗадачаПИД(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"НачалоПериода",	НачалоМесяца(Объект.ПериодЗадолженностиНачало));
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"КонецПериода",	КонецМесяца(КонецДня(Объект.ПериодЗадолженностиКонец)));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"Организация",		Объект.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"Район",			Объект.Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Задолженность,"Договор",			Объект.Договор);
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"НачалоПериода",	НачалоМесяца(Объект.ПериодЗадолженностиНачало));
	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"КонецПериода",		КонецМесяца(КонецДня(Объект.ПериодЗадолженностиКонец)));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"Организация",		Объект.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"Район",			Объект.Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"Договор",			Объект.Договор);

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СобытияПоЭтапу,"Ссылка",	Объект.Ссылка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеструктуризацияЗадолженности,"Организация",		Объект.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеструктуризацияЗадолженности,"Район",			Объект.Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РеструктуризацияЗадолженности,"Договор",			Объект.Договор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Банкротство,"Организация",		Объект.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Банкротство,"Район",				Объект.Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Банкротство,"Договор",			Объект.Договор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписаниеЗадолженности,"Организация",		Объект.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписаниеЗадолженности,"Район",			Объект.Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписаниеЗадолженности,"Договор",			Объект.Договор);
	
	КатегорияДебитора 		= РегистрыСведений.бестНастройкиКатегорийДебитора.ПолучитьКатегориюДебитора(Объект.Дата, Объект.Организация, (Объект.ПериодЗадолженностиКонец - Объект.ПериодЗадолженностиНачало) / 86400);
	
	РезультатЗадолженность = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Объект.Организация, Объект.Район, Объект.ПериодЗадолженностиКонец, Объект.Договор);
	Выборка = РезультатЗадолженность.Выбрать(); 
	Если Выборка.Следующий() Тогда
		СуммаЗадолженностиШапка = Выборка.Сумма;
	КонецЕсли;
	РезультатПеня				= бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Объект.Организация, Объект.Район, Объект.ПериодЗадолженностиКонец, Объект.Договор);
	Выборка = РезультатПеня.Выбрать(); 
	Если Выборка.Следующий() Тогда
		ПеняШапка = Выборка.Сумма;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность();
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап, "Тип") <> Перечисления.энргТипыЭтапов.Банкротство Тогда
		ЗаполнитьСудебныеИнстанции();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ, СледующийЭтап = Неопределено)
	Если Объект.ПометкаУдаления Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя выполнить помеченную на удаление задачу.");
		Возврат;                                                                       
	КонецЕсли;

	Если ПроверитьПодэтапы() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Задача не может быть выполнена. Заполните события по всем подэтапам.");
		Возврат;
	КонецЕсли;
	
	ПерейтиНаСледующийЭтапКлиент(Отказ, СледующийЭтап = Неопределено);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СоздатьКоманды();
	ЗаполнитьСуммуИска();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура СуммаЗадолженности1ПриИзменении(Элемент)
	ЗаполнитьСуммуИска();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПени1ПриИзменении(Элемент)
	ЗаполнитьСуммуИска();
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеПриИзменении(Элемент)
	ЗаполнитьСуммуИска();
КонецПроцедуры

&НаКлиенте
Процедура ВидСудопроизводстваПриИзменении(Элемент)
	ЗаполнитьСуммуИска();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасчетаПениПриИзменении(Элемент)
	ПерерассчитатьПеню();
	ЗаполнитьСуммуИска();
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.бестПлатежныйДокумент.ФормаОбъекта", Новый Структура("Ключ", Элементы.Задолженность.ТекущиеДанные.ПлатежныйДокумент));
КонецПроцедуры

&НаКлиенте
Процедура СудебныеИнстанцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СудебныеИнстанцииВзысканиеГП" Тогда
		
		ТекущиеДанные			= Элементы.СудебныеИнстанции.ТекущиеДанные;
		Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
			ТекущиеДанные.IDСтроки  = Новый УникальныйИдентификатор();
		КонецЕсли;
		
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ВзысканиеГПЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные));
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ВзысканиеГП", ПолучитьВходныеДанныеВзысканиеГП(ТекущиеДанные.IDСтроки),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимостьИДоступность()
	Тип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап, "Тип");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИнформацияОСудебномДеле", "Видимость", Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.ИсполнительнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.Банкротство  ИЛИ Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСудебныеИнстанции", "Видимость", Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКонкурснаяМасса", "Видимость", Тип = Перечисления.энргТипыЭтапов.Банкротство ИЛИ Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИнформацияОБанкротстве", "Видимость", Тип = Перечисления.энргТипыЭтапов.Банкротство ИЛИ Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБанкротство", "Видимость", Тип = Перечисления.энргТипыЭтапов.Банкротство ИЛИ Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИнформацияОДолжнике", "Видимость", Тип = Перечисления.энргТипыЭтапов.ДосудебнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.ОграничениеРежимаПотребления);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПодэтапы", "Видимость", Тип = Перечисления.энргТипыЭтапов.ДосудебнаяРабота);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗадолженность", "Видимость", Тип = Перечисления.энргТипыЭтапов.ДосудебнаяРабота);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСобытияПоЭтапу", "Видимость", Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.ДосудебнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.ОграничениеРежимаПотребления);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаИнформацияОбИсполнительномПроизводстве", "Видимость", Тип = Перечисления.энргТипыЭтапов.ИсполнительнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.Банкротство ИЛИ Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИсполнительныеДокументы", "Видимость", Тип = Перечисления.энргТипыЭтапов.ИсполнительнаяРабота);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаФиксированнаяЗадолженность", "Видимость", Тип = Перечисления.энргТипыЭтапов.ДосудебнаяРабота ИЛИ Тип = Перечисления.энргТипыЭтапов.ОграничениеРежимаПотребления);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСписаниеЗадолженности", "Видимость", Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности);
	
	ТекПользователь 	= Пользователи.ТекущийПользователь();
	МассивРолей 		= Новый Массив;
	МассивРолей.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап, "Роль"));
	РезультатЗапроса	= энргОбщегоНазначения.ПолучитьПользователейСОтборомПоРолям(Объект.Организация, Объект.Район, МассивРолей);
	мПользователей		= РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Если (НЕ Объект.Выполнена И Объект.ПринятоВРаботу И Объект.Исполнитель <> ТекПользователь) ИЛИ (Объект.Выполнена ИЛИ мПользователей.Найти(ТекПользователь)= Неопределено)  Тогда
		ТолькоПросмотр	= Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПринятьКИсполнению", "Доступность",  Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьСобытие", "Доступность",  Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтандартныеКнопки", "Доступность",  Объект.Исполнитель = ТекПользователь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьСобытие", "Доступность",  НЕ Объект.Выполнена И ЗначениеЗаполнено(Объект.Исполнитель));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БанкротствоСоздатьСписаниеВосстановлениеЗадолженности", "Доступность",  НЕ Объект.Выполнена И ЗначениеЗаполнено(Объект.Исполнитель));
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПередатьЗадачу", "Видимость",  НЕ Объект.Выполнена И ЗначениеЗаполнено(Объект.Исполнитель));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПринятьКИсполнению", "Видимость",  НЕ ЗначениеЗаполнено(Объект.Исполнитель));
КонецПроцедуры

&НаСервере
Процедура ПринятьКИсполнениюНаСервере()
	ТекОбъект	= РеквизитФормыВЗначение("Объект");
	ТекОбъект.ПринятьКИсполнению();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	НастроитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Функция ПроверитьПодэтапы()
	Отбор = Новый Структура();
	Отбор.Вставить("Результат","");
	СтрокиБезСобытия = Объект.Подэтапы.НайтиСтроки(Отбор);
	Возврат СтрокиБезСобытия.Количество() <> 0;
КонецФункции

&НаСервере
Процедура ЗаполнитьСуммуИска()
	 СуммаИска 					= Объект.СуммаЗадолженности + Объект.СуммаПени + Объект.Прочие;
	 Объект.СуммаГоспошлина 	= РегистрыСведений.энргНастройкаРасчетаГоспошлины.РассчитатьГоспошлину(СуммаИска, Объект.Дата, Объект.ВидСудопроизводства);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСхемыБанкротства(Схема, ДополнительныеПараметры) Экспорт
	
	Если Схема <> Неопределено Тогда
		Задача = СоздатьЗадачуБанкротства(Схема);
		
		Если ЗначениеЗаполнено(Задача) Тогда
			ПоказатьЗначение(, Задача);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьЗадачуБанкротства(Схема)

	НовЗадача = Задачи.энргЗадачаПИД.СоздатьЗадачу();
	НовЗадача.Схема = Схема;
	НовЗадача.Дата = ТекущаяДата();
	
	ЗаполнитьЗначенияСвойств(НовЗадача, Объект, "Договор, Организация, Район, ЗадачаЮЛ, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец,
	|ВидСудопроизводства,НомерСудебногоДела,ДатаРасчетаПени,ИскСдан,ДатаСдачиИска,СуммаЗадолженности,
	|СуммаПени,Прочие,СуммаГоспошлина,НомерИсполнительногоПроизводства,СтадияИсполнения,
	|ДатаЗаказаИД,ВыданИсполнительныйЛист,ДатаИсполительногоЛиста,ВидИсполнения,
	|ДатаОтправкиЗаявления,СлужбаСудебныхПристовов,ДатаПодачиЗаявленияВСудОБанкротсве,
	|ДатаПубликацииОБанкротстве,ПризнанБанкротом");
	Для Каждого стр Из Объект.Задолженность Цикл
		ЗаполнитьЗначенияСвойств(НовЗадача.Задолженность.Добавить(), стр);
	КонецЦикла;
	Для Каждого стр Из Объект.СудебныеИнстанции Цикл
		ЗаполнитьЗначенияСвойств(НовЗадача.СудебныеИнстанции.Добавить(), стр);
	КонецЦикла;
	Для Каждого стр Из Объект.Суд Цикл
		ЗаполнитьЗначенияСвойств(НовЗадача.Суд.Добавить(), стр);
	КонецЦикла;
	Задачи.энргЗадачаПИД.ЗаполнитьНаименованиеИЭтап(НовЗадача);
	Попытка
		НовЗадача.Записать();
		
		Возврат НовЗадача.Ссылка;
	Исключение
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать задачу ОРП по причине: " + ОписаниеОшибки());
	КонецПопытки;
КонецФункции

&НаСервере
Функция ПолучитьМассивСудей(Суд)
	Возврат Суд.Судьи.ВыгрузитьКолонку("Судья");
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбораВидаОперации(ЗначениеВыбора, ДопПараметры) Экспорт
	Если ЗначениеВыбора <> Неопределено Тогда
		ЭлементыОтбора = Новый Структура("ВидОперации, Договор, Организация, Район, ДатаОперации, ДатаПубликации", ЗначениеВыбора.Значение, Объект.Договор, Объект.Организация, Объект.Район, Объект.ДатаПодачиЗаявленияВСудОБанкротсве, Объект.ДатаПубликацииОБанкротстве);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
		ОткрытьФорму("Документ.бестРегистрацияБанкротства.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПерерассчитатьПеню()
	РезультатПеня				= бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Объект.Организация, Объект.Район, КонецДня(Объект.ДатаРасчетаПени), Объект.Договор);
	Выборка = РезультатПеня.Выбрать(); 
	Если Выборка.Следующий() Тогда
		Объект.СуммаПени = Выборка.Сумма;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСледующийЭтапКлиент(Отказ, СледующийЭтап = Неопределено, ПереходНаСудебнуюДеятельность = Ложь)
	 ВыбранСледующийЭтап = ЗначениеЗаполнено(СледующийЭтап);
		
	РекомендуемыйЭтап	= Неопределено;
	СписокЗначений		= ПолучитьИменаКомандЭтапов();
	СледЭтап 			= ?(ВыбранСледующийЭтап, СледующийЭтап, ПолучитьСледующийЭтап(Объект.Схема, Объект.Этап));
	
	
	Досудебный 		= Ложь;
	СудебнаяРабота	= Ложь;
	ИсполнительныйИлиСудебныйЭтап(Объект.Этап, , СудебнаяРабота, Досудебный);
	
	СледЭтапИсполнитльный = Ложь;
	СледЭтапСудебный	  = Ложь;
	ИсполнительныйИлиСудебныйЭтап(СледЭтап, СледЭтапИсполнитльный, СледЭтапСудебный);

	
	Если СписокЗначений.Количество() <> 0 И Не ВыбранСледующийЭтап Тогда 
		//Отказ = Истина;

		СписокЗначений.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОбработкаВыбораЭтапа", ЭтотОбъект, Новый Структура("ВыполнитьЗадачу",Истина)), "Выберите следующий этап.", РекомендуемыйЭтап);
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ЗначениеЗаполнено(СледЭтап) Тогда
	
		ПроверкаНаСоответствиеТребованиямСледующегоЭтапа(Отказ, СледЭтап);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если Досудебный И СледЭтапСудебный Тогда
			ПереходНаСудебнуюДеятельность = Истина;
			ОткрытьФормуПереходаНаСудебнуюРаботу(СледЭтап);
		КонецЕсли;
	КонецЕсли;
	
	Если СудебнаяРабота И Не Отказ И энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап,"Тип") <> ПредопределенноеЗначение("Перечисление.энргТипыЭтапов.Банкротство") Тогда
		Для каждого СтрокаТЧ Из Объект.СудебныеИнстанции Цикл
		
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Перед переходом на следующий этап должна быть заполнена дата в судебной инстанции.";
				Сообщение.Поле = "Объект.СудебныеИнстанции[" + (СтрокаТЧ.НомерСтроки-1) + "].Дата";
				Сообщение.УстановитьДанные(ЭтаФорма);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Номер) Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Перед переходом на следующий этап должен быть заполнен номер в судебной инстанции.";
				Сообщение.Поле = "Объект.СудебныеИнстанции[" + (СтрокаТЧ.НомерСтроки-1) + "].Номер";
				Сообщение.УстановитьДанные(ЭтаФорма);
				Сообщение.Сообщить();
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьВходныеДанныеВзысканиеГП(IDСтроки)
	ИдентификаторФормы 				= ЭтаФорма.УникальныйИдентификатор;	
	Возврат Новый Структура("ВзысканиеГП",ПоместитьВоВременноеХранилище(Объект.ВзысканиеГП.Выгрузить(Новый Структура("IDСтроки", IDСтроки)), ИдентификаторФормы))
КонецФункции

&НаКлиенте
Процедура ВзысканиеГПЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	ТекущиеДанные 				= ДополнительныеПараметры.ТекущиеДанные;
	
	ВзысканиеГП = "Не заполнено";
	ЗаполнитьПотериИзРезультата(ТекущиеДанные.IDСтроки, Результат, ВзысканиеГП);
	ТекущиеДанные.ВзысканиеГП 		= ВзысканиеГП;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПотериИзРезультата(IDСтроки, Результат, ВзысканиеГП)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ВзысканиеГП, Новый Структура("IDСтроки", IDСтроки));
	
	ПотериРезультат = ПолучитьИзВременногоХранилища(Результат.ВзысканиеГП);
	ПотериРезультат.Колонки.Добавить("IDСтроки");
	ПотериРезультат.ЗаполнитьЗначения(IDСтроки, "IDСтроки");
	Объект.ВзысканиеГП.Загрузить(ПотериРезультат); 	
	
	Если ПотериРезультат.Количество() > 0 Тогда
		ВзысканиеГП = "Заполнено";	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()
	Для Каждого ТекСтрока ИЗ Объект.СудебныеИнстанции Цикл
		СтрокиВзыскания = Объект.ВзысканиеГП.НайтиСтроки(Новый Структура("IDСтроки",ТекСтрока.IDСтроки));
		ТекСтрока.ВзысканиеГП = ?(СтрокиВзыскания.Количество() > 0, "Заполнено", "Не заполнено");
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	ПринятьКИсполнениюНаСервере();
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСобытие(Команда)
	СохранитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура РегстрацияБанкротства(Команда)
	ОписОпов = Новый ОписаниеОповещения("ОбработкаВыбораСхемыБанкротства", ЭтаФорма);
	ПарамФормы = Новый Структура("Банкротство", Истина);
	
	ОткрытьФорму("Справочник.энргСхемыПИД.ФормаВыбора", ПарамФормы, ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписаниеВосстановлениеЗадолженности(Команда)
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.бестВидыОпераций.РегистрацияБанкротства_ОтменаБанкротства"));
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораВидаОперации", ЭтотОбъект);
	ПоказатьВыборИзСписка(Оп, Список);
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияСписанияЗадолженности(Команда)
	ОписОпов = Новый ОписаниеОповещения("ОбработкаВыбораСхемыБанкротства", ЭтаФорма);
	ПарамФормы = Новый Структура("СписаниеЗадолженности", Истина);
	
	ОткрытьФорму("Справочник.энргСхемыПИД.ФормаВыбора", ПарамФормы, ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_СудебныеИнстанции

&НаКлиенте
Процедура СудебныеИнстанции1СудьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ФормаВыбора 			= ПолучитьФорму("Справочник.энргКонтрагенты.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список,"Ссылка", ПолучитьМассивСудей(Элементы["СудебныеИнстанции1"].ТекущиеДанные.Суд), ВидСравненияКомпоновкиДанных.ВСписке);
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СудебныеИнстанцииСудьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ФормаВыбора 			= ПолучитьФорму("Справочник.энргКонтрагенты.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список,"Ссылка", ПолучитьМассивСудей(Элементы["СудебныеИнстанции"].ТекущиеДанные.Суд), ВидСравненияКомпоновкиДанных.ВСписке);
	ФормаВыбора.Открыть();
КонецПроцедуры

#КонецОбласти

#Область ПереносФункционалаФизиков

&НаКлиенте
Процедура ОбработкаВыбораЭтапа(ВыбранныйЭлемент, ДополнительныеПараметры = Неопределено) Экспорт
	ВыбранныйЭтап = ВыбранныйЭлемент;
	
	Если ВыбранныйЭтап <> Неопределено Тогда
		СледЭтап = ЭтапКоманды(ВыбранныйЭтап.Значение);
		Отказ = Ложь;
		ПереходНаСудебнуюДеятельность = Ложь;
		ПерейтиНаСледующийЭтапКлиент(Отказ, СледЭтап, ПереходНаСудебнуюДеятельность);
		//ПередВыполнением(Отказ, СледЭтап);
		//
		//Если Отказ Тогда
		//	Возврат;
		//КонецЕсли;
		Если НЕ ПереходНаСудебнуюДеятельность Тогда
			ПерешлаНаЭтап = ПерейтиНаЭтапНаСервере(ВыбранныйЭтап.Значение);
		КонецЕсли;
		//Если ЭтаФорма.Открыта() И ПерешлаНаЭтап и ДополнительныеПараметры.ВыполнитьЗадачу Тогда
		//	Закрыть();
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаКомандЭтапов()

	СписокЗначений = Новый СписокЗначений;
	
	Для каждого КомандаЭтап Из Элементы.ФормаГруппаПерейтиНаЭтап.ПодчиненныеЭлементы Цикл
		Если КомандаЭтап.Доступность Тогда
			СписокЗначений.Добавить(КомандаЭтап.ИмяКоманды, Команды.Найти(КомандаЭтап.ИмяКоманды).Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокЗначений;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСледующийЭтап(Схема, Этап)

	Возврат Справочники.энргСхемыПИД.ПолучитьСледующийЭтап(Схема, Этап);
КонецФункции

&НаСервереБезКонтекста
Процедура ИсполнительныйИлиСудебныйЭтап(Этап, Исполнитльный = Ложь, Судебный = Ложь, Исполнительный = Ложь)
	
	Задачи.энргЗадачаПИД.ИсполнительныйИлиСудебныйЭтап(Этап, Исполнитльный, Судебный, Исполнительный);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНаСоответствиеТребованиямСледующегоЭтапа(Отказ, Знач СледЭтап)
	
	Перем Ответ, ПоСледЭтап, СписокОшибок, ТестОшибки;
	
	СписокОшибок = ЭтапПИР_СоответствуетТребованиям(СледЭтап);
	
	Если ЗначениеЗаполнено(СписокОшибок) Тогда
		Отказ = Истина;
		
		Для каждого ТестОшибки Из СписокОшибок Цикл
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТестОшибки);
			
		КонецЦикла;
		Если Не ЭтапОбязателен(СледЭтап) Тогда 
			ПоСледЭтап = ПолучитьСледующийЭтап(СледЭтап, Объект.Этап);
			Если ЗначениеЗаполнено(ПоСледЭтап) Тогда
				Ответ = Неопределено;
				
				ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаОПропускеЭтапа", ЭтотОбъект, Новый Структура("ПоСледЭтап", ПоСледЭтап)), "Нельзя перейти на этап """ + СледЭтап + """. Пропустить?", РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуПереходаНаСудебнуюРаботу(СледЭтап)
	ПарамФормы = Новый Структура("Задача, СледующийЭтап, Абонент, ПериодЗадолженностиКонец, Организация, Район", Объект.Ссылка, СледЭтап);
	ПарамФормы.Вставить("ДатаЗадачи", Объект.Дата);
	ЗаполнитьЗначенияСвойств(ПарамФормы, Объект);
	ОписОпов = Новый ОписаниеОповещения("ПерейтиНаСудебнуюРаботу", ЭтаФорма);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаПереходаНаСудебнуюРаботу", ПарамФормы, ЭтаФорма,,,, ОписОпов);

	Возврат Истина;
КонецФункции 

&НаСервере
Функция ЭтапКоманды(ИмяКоманды)
	//Команда = Команды.Найти(ИмяКоманды);
	
	НомерЭтапа = Число(СтрЗаменить(ИмяКоманды, "КомандаЭтап", ""));
	
	Возврат Справочники.энргСхемыПИД.ПолучитьЭтапПоНомеру(Объект.Схема, НомерЭтапа);
КонецФункции

&НаСервере
Функция ПерейтиНаЭтапНаСервере(ИмяКоманды)
	Попытка
		Команда = Команды.Найти(ИмяКоманды);
		НачатьТранзакцию();
		ОбъектЗадача = РеквизитФормыВЗначение("Объект");
		Если Модифицированность Тогда
			ОбъектЗадача.Записать();
		КонецЕсли;
		
		СледЭтап = Справочники.энргВидыОперацийПИД.НайтиПоНаименованию(Команда.Заголовок, Истина);
		Если Не ЗначениеЗаполнено(СледЭтап) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден этап """ + Команда.Заголовок + """.");
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		Отказ = Ложь;
		Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, СледЭтап, ОбъектЗадача,,,, Истина);
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		//ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
		
		ЗафиксироватьТранзакцию();
		ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
		Модифицированность = Ложь;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
КонецФункции

&НаСервере
Функция ЭтапПИР_СоответствуетТребованиям(Этап)

	Возврат Задачи.энргЗадачаПИД.ЭтапПИР_СоответствуетТребованиям(Объект, Этап);

КонецФункции

&НаСервере
Функция ЭтапОбязателен(Этап)

	Возврат Справочники.энргСхемыПИД.ЭтапОбязателен(Этап, Объект.Схема);

КонецФункции

&НаСервере
Процедура СоздатьКоманды()
	// Удаление старых команд
	КомандыЭтапов = Новый Массив;
	ЗадачаПоПереговорам = Ложь;
	//ЗадачаПоПереговорам	= Объект.Этап = ПредопределенноеЗначение("Справочник.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Переговоры");
	Для каждого КомандаЭтапа Из Элементы.ФормаГруппаПерейтиНаЭтап.ПодчиненныеЭлементы Цикл
		КомандыЭтапов.Добавить(КомандаЭтапа); 
	КонецЦикла;
	
	Для каждого КомандаЭтапа Из КомандыЭтапов Цикл
		ЭтаФорма.Команды.Удалить(ЭтаФорма.Команды.Найти(КомандаЭтапа.ИмяКоманды));
		Элементы.Удалить(КомандаЭтапа);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.Этап) Или Не ЗначениеЗаполнено(Объект.Схема)  Или Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Ссылка КАК Ссылка,
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	энргСхемыПИДЭтапы.НомерСтроки КАК НомерСтроки,
		|	энргСхемыПИДЭтапы.Необязательный КАК Необязательный
		|ПОМЕСТИТЬ ВТ_НомерЭтапа
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|ГДЕ
		|	энргСхемыПИДЭтапы.Ссылка = &Схема
		|	И энргСхемыПИДЭтапы.Этап = &Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	энргСхемыПИДЭтапы.НомерСтроки КАК НомерСтроки,
		|	энргСхемыПИДЭтапы.Этап.Наименование КАК Наименование,
		|	энргСхемыПИДЭтапы.Необязательный КАК Необязательный
		|ИЗ
		|	ВТ_НомерЭтапа КАК ВТ_НомерЭтапа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|		ПО ВТ_НомерЭтапа.Ссылка = энргСхемыПИДЭтапы.Ссылка
		|			И ВТ_НомерЭтапа.НомерСтроки < энргСхемыПИДЭтапы.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	Этап";
	
	Если ЗадачаПоПереговорам Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_НомерЭтапа.НомерСтроки <", "ВТ_НомерЭтапа.НомерСтроки <=");
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Схема", Объект.Схема);
	Запрос.УстановитьПараметр("Этап", Объект.Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЭтап = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭтоПервый	 = Истина;
	ЭтоПоследний = Ложь;
	Сч = 1;
	Пока ВыборкаЭтап.Следующий() Цикл
		Выборка = ВыборкаЭтап.Выбрать();
	
		Если Выборка.Следующий() Тогда
			Если Не Выборка.Необязательный Тогда
				Если ЭтоПервый И ЗадачаПоПереговорам Тогда
				ИначеЕсли ЭтоПервый И Не ЗадачаПоПереговорам Тогда
					Прервать;
				Иначе
				    ЭтоПоследний = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// Добавление команды
			ИмяКмд = "КомандаЭтап" + Формат(Выборка.НомерСтроки, "ЧГ=0");
			
			Кмд = ЭтаФорма.Команды.Добавить(ИмяКмд);
			Кмд.Действие = "ПерейтиНаЭтап";
			Кмд.Заголовок = Выборка.Наименование;
			
			// Добавление новой кнопки
			ЭлементКМД = Элементы.Добавить(ИмяКмд, Тип("КнопкаФормы"), Элементы.ФормаГруппаПерейтиНаЭтап);
			ЭлементКМД.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			ЭлементКМД.ИмяКоманды = ИмяКмд;
			
			Сч = Сч + 1;
			ЭтоПервый = Ложь;
			Если ЭтоПоследний Тогда
				Прервать;			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого КомандаЭтап Из Элементы.ФормаГруппаПерейтиНаЭтап.ПодчиненныеЭлементы Цикл
		КомандаЭтап.Доступность = Не Объект.Выполнена;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовоеСобытие(IdЭтапа = Неопределено, ТипСобытия)
	ДопПараметры = Новый Структура("IdЭтапа", IdЭтапа);
	
	Если НЕ ЗначениеЗаполнено( ТипСобытия) Тогда		
		ОписОпов 		= Новый ОписаниеОповещения("СоздатьСобытеДляЭтапаОбщийМодуль", ЭтотОбъект, ДопПараметры);
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Ссылка", ПолучитьМассивДоступныхТиповСобытий());
		
		ПараметрыВыбораФормы = Новый Структура;
		ПараметрыВыбораФормы.Вставить("РежимВыбора"			, Истина);
		ПараметрыВыбораФормы.Вставить("МножественныйВыбор"	, Ложь);
		ПараметрыВыбораФормы.Вставить("ЗакрыватьПриВыборе"	, Истина);
		ПараметрыВыбораФормы.Вставить("Отбор"				, ПараметрыОтбора);
		ОткрытьФорму("Справочник.энргСпособСвязи.ФормаВыбора", ПараметрыВыбораФормы,,,,,ОписОпов, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
	Иначе 
		СоздатьСобытеДляЭтапаОбщийМодуль(ТипСобытия, ДопПараметры);
		//ОписОпов = Новый ОписаниеОповещения("ОбновитьСобытия", ЭтотОбъект);
		//бестРаботаСЗадачамиПИРКлиент.СоздатьСобытеДляЭтапа(Объект, IdЭтапа, Объект.Подэтапы, ЭтаФорма, ОписОпов, ТипСобытия);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДоступныхТиповСобытий()
	Возврат Справочники.энргСпособСвязи.ПолучитьМассивДоступныхТиповСобытий(Объект.Этап);
КонецФункции

&НаКлиенте
Процедура СоздатьСобытеДляЭтапаОбщийМодуль(Результат, ДопПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		ПоказатьПредупреждение(,"Необходимо выбрать тип события");
		Возврат;
	КонецЕсли;	
	
	ОписОпов = Новый ОписаниеОповещения("ОбновитьСобытия", ЭтотОбъект);
	бестРаботаСЗадачамиПИРКлиент.СоздатьСобытеДляЭтапа(Объект, ДопПараметры.IdЭтапа, Объект.Подэтапы, ЭтаФорма, ОписОпов, Результат);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСобытия(Результат, ДополнительныеПараметры) Экспорт
	Элементы.СобытияПоЭтапуДинамическийСписок.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПередатьЗадачу(Команда)
	ОписОпов = Новый ОписаниеОповещения("СменаИсполнителя", ЭтаФорма);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя",, ЭтаФорма,,,, ОписОпов);
КонецПроцедуры

&НаКлиенте
Процедура СменаИсполнителя(ПарамВыбора, ДополнительныеПараметры) Экспорт
	
	Если ПарамВыбора <> Неопределено Тогда
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ПодтверждениеПередачи") Тогда
		 	ПодтверждениеПередачи = Истина;
		Иначе
		    ПодтверждениеПередачи = Ложь;
		КонецЕсли;
		
		Модифицированность = Истина;
		
		Если ПодтверждениеПередачи И ЗначениеЗаполнено(Объект.ИсторияПеренаправленийЗадачи) Тогда
			СтрокаТЧ = Объект.ИсторияПеренаправленийЗадачи[Объект.ИсторияПеренаправленийЗадачи.Количество()-1];
		Иначе
			СтрокаТЧ = Объект.ИсторияПеренаправленийЗадачи.Добавить();
			
			СтрокаТЧ.ДатаПеренаправления = ТекущаяДата();
			СтрокаТЧ.Роль				 = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап, "Роль");
			СтрокаТЧ.Перенаправил		 = ПолучитьТекущегоПользователя();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПарамВыбора);
		
		РольРуководителя = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Роль, "РольРуководителя");
		
		Если ПодтверждениеПередачи Тогда
			Объект.Роль					= СтрокаТЧ.Роль;
			Объект.ТребуетПодтверждения = Ложь;
			Объект.Исполнитель 			= ПарамВыбора.НовыйИсполнитель;
		ИначеЕсли ЗначениеЗаполнено(РольРуководителя) Тогда
			Объект.Исполнитель 			= Неопределено;
			Объект.Роль					= РольРуководителя;
			Объект.ТребуетПодтверждения = Истина;
		Иначе
			Объект.Исполнитель = ПарамВыбора.НовыйИсполнитель;
		КонецЕсли;
		
		Объект.Комментарий		= ПарамВыбора.Комментарий;
		Объект.ПринятоВРаботу   = Ложь;
		Объект.ДатаПринятияВРаботу = Неопределено;
		
		Если ЗначениеЗаполнено(ПарамВыбора.ДатаСледЭтапа) Тогда
			Объект.ДатаСледЭтапа			   = ПарамВыбора.ДатаСледЭтапа;
			СтрокаТЧ.ПланируемаяДатаВыполнения = ПарамВыбора.ДатаСледЭтапа;
		КонецЕсли;
		
		
			Записать();
			Закрыть();
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()

	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРедактированияШага()
	
	Перем ОписОпов, ПарамФормы, РекФормы;
	
	ТекСтрока = Элементы.Подэтапы.ТекущиеДанные;
	
	РекФормы	= Новый Структура("Задача, Этап, СтартоваяЗадача, IDЭтапа, Подэтап, ДатаНачала, ДатаОкончания, Выполнен, Текущий, Результат, Отменен",
			Объект.Ссылка, Объект.Этап, Объект.СтартоваяЗадача);
	ЗаполнитьЗначенияСвойств(РекФормы, ТекСтрока);		
	
	ПарамФормы  = Новый Структура("РеквизитыФормы", РекФормы);
	ОписОпов	= Новый  ОписаниеОповещения("ЗавершениеЭтапа", ЭтотОбъект);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаВыполнениеШага", ПарамФормы, ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЭтапа(Результат, ДополнительныеПараметры) Экспорт
	Перем IDЭтапа;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("IDЭтапа", IDЭтапа) Тогда 
		Отбор = Новый Структура("IDЭтапа", IDЭтапа);
		
		СтрокиТЗ = Объект.Подэтапы.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(СтрокиТЗ) Тогда
			ТекСтрока = СтрокиТЗ[0];
		Иначе
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьЗначенияСвойств(ТекСтрока, Результат);
		//ТекСтрока.Результат		  = Результат.Результат;
		//ТекСтрока.ДатаОкончания   = Результат.ДатаОкончания;
		
		СписокФайловШага = Неопределено;
		Если Результат.Свойство("СписокФайловШага", СписокФайловШага) Тогда
			ФайлыЭтапа = Объект.ФайлыПодэтапов.НайтиСтроки(Отбор);
			
			Для каждого ТекСтрока Из ФайлыЭтапа Цикл
				Объект.ФайлыПодэтапов.Удалить(ТекСтрока);
			КонецЦикла;
			
			Для каждого ТекФайл Из СписокФайловШага Цикл
			
				СтрокаТЧ = Объект.ФайлыПодэтапов.Добавить();
				СтрокаТЧ.IDЭтапа = IDЭтапа;
				СтрокаТЧ.Файл	 = ТекФайл;
			
			КонецЦикла;
			
		КонецЕсли;
		
		//ТекСтрока.Текущий		  = Ложь;
		//ТекСтрока.Отменен		  = Ложь;
		Если ТекСтрока.Выполнен И Не ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) Тогда
			ТекСтрока.ДатаОкончания = ТекущаяДата();
		КонецЕсли;
		Если (ТекСтрока.Выполнен Или ТекСтрока.Текущий) И Не ЗначениеЗаполнено(ТекСтрока.ДатаНачала) Тогда
			ТекСтрока.ДатаНачала = ТекущаяДата();
		КонецЕсли;
		
		СтрокиТЗ = Объект.Подэтапы.НайтиСтроки(Новый Структура("Текущий", Истина));
		//НайденаСледующая = Ложь;
		//Если Не ЗначениеЗаполнено(СтрокиТЗ) Тогда
		//    Объект.Подэтапы.Сортировать("Порядок Возр");
		//	
		//	Для каждого ТекСтрока Из Объект.Подэтапы Цикл
		//	
		//		Если НайденаСледующая И Не ТекСтрока.Параллельно Тогда
		//			Прервать;
		//		КонецЕсли;
		//		
		//		Если Не (ТекСтрока.Выполнен Или ТекСтрока.Отменен) Тогда
		//			ТекСтрока.Текущий		= Истина;
		//			ТекСтрока.ДатаНачала	= ТекущаяДата();
		//			ТекСтрока.ДатаОкончания	= ?(ЗначениеЗаполнено(ТекСтрока.Продолжительность), ТекущаяДата()+24*3600*ТекСтрока.Продолжительность, Неопределено);
		//			
		//			НайденаСледующая		= Истина;
		//		КонецЕсли;
		//	КонецЦикла;
		//Иначе
		//	НайденаСледующая = Истина;
		//КонецЕсли;
		
		//УстановитьСостояниеПодэтапов();
		//ПодэтапыПриАктивизацииСтроки(Неопределено);
		Записать();
		
		//Если Не НайденаСледующая Тогда
		//    Ответ = Неопределено;

		//    ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаНаВыполнениеЗадачи", ЭтотОбъект), "Все шаги завершены. Перейти к следующему этапу?", РежимДиалогаВопрос.ДаНет);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодэтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если НЕ ТолькоПросмотр Тогда
		ОткрытьФормуРедактированияШага();
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСудебныеИнстанции()
	
	Если Объект.СудебныеИнстанции.Количество() <> 0 Тогда
		
		ПромежуточнаяТаблица = Новый ТаблицаЗначений;
		ПромежуточнаяТаблица = Объект.СудебныеИнстанции.Выгрузить(,"СудебнаяИинстанция");
		ПромежуточнаяТаблица.Свернуть("СудебнаяИинстанция");
		СписокСудебныеИнстанции.Загрузить(ПромежуточнаяТаблица);
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокСудебныеИнстанцииПриАктивизацииСтроки(Элемент)
	Если Объект.СудебныеИнстанции.Количество() <> 0 Тогда
		
		СудебнаяИнстанция = Элементы.СписокСудебныеИнстанции.ТекущиеДанные.СудебнаяИинстанция;
		
		Если ЗначениеЗаполнено(СудебнаяИнстанция) Тогда
			
			Поиск = Новый Структура;
			Поиск.Вставить("СудебнаяИинстанция",СудебнаяИнстанция);
			Элементы.СудебныеИнстанции.ОтборСтрок = Новый ФиксированнаяСтруктура(Поиск);
			
		Иначе
			
			Элементы.СписокСудебныеИнстанции.ОтборСтрок = Неопределено;
			
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьЭтап(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед созданием подчиненной задачи, необходимо записать изменения.");
		Возврат;
	КонецЕсли;
	
	Если ПовторитьЭтапНаСервере() Тогда 
		//УстановитьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПовторитьЭтапНаСервере()
	Отказ = Ложь;
	
	Попытка
		Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, Объект.Этап, Объект,,,, Истина);
		Если Не Отказ Тогда
			ОбъектЗадача = РеквизитФормыВЗначение("Объект");
			ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
			ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Не Отказ;
КонецФункции

&НаКлиенте
Процедура СохранитьИзмененияПередВыполнениемКоманды(Команда)
	
	Перем ОписаниеОповещения;
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаСохранение", ЭтотОбъект, Новый Структура("Команда", Команда));
		ПоказатьВопрос(ОписаниеОповещения, "Сохранить изменения?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ОсновноеДействиеКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаСохранение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();
		Команда = ДополнительныеПараметры.Команда;
		ОсновноеДействиеКоманды(Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеДействиеКоманды(Знач Команда)
	Префикс = "КомандаЭтап_";
	

	Если Команда = Команды.Найти("ОтправитьПисьмо") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту"));
	ИначеЕсли Команда = Команды.Найти("ОтправитьСМС") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаСМС"));
	ИначеЕсли Команда = Команды.Найти("ВзаимодейтсвиеСРаботодателем") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.Работодатель"));
	ИначеЕсли Команда = Команды.Найти("ВзаимодействиеСОМС") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОМС"));
	ИначеЕсли Команда = Команды.Найти("АвтоЗвонок") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.АвтоЗвонок"));
	ИначеЕсли Команда = Команды.Найти("ЛичныйЗвонок") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ЛичныйЗвонок"));
	ИначеЕсли Команда = Команды.Найти("ОповещениеСМИ") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОповещениеСМИ"));
	ИначеЕсли Команда = Команды.Найти("РазмещениеНаСайте") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.РазмещениеНаСайте"));
		
	ИначеЕсли Команда = Команды.Найти("СоздатьСобытие") Тогда 
		ОткрытьНовоеСобытие(, Неопределено);
	//ИначеЕсли Лев(Команда.Имя, СтрДлина(Префикс)) = Префикс Тогда 
	//	Если ОтправитьНаПочтуНаСервере(СтрЗаменить(Команда.Имя, Префикс, "ПФ_MXL_")) Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение доставлено.");
	//	КонецЕсли;
	//	ОбработкаОповещения("УстановитьДатуЭП", Неопределено, Неопределено);
	ИначеЕсли Команда = Команды.Найти("ВернутьНаДоработку") Тогда
		ОписОпов = Новый ОписаниеОповещения("ВозвращниеНаДоработку", ЭтаФорма);
		ПарамФормы = Новый Структура("ВозращениеНаПредыдущийЭтап, Задача", Истина, Объект.Ссылка);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	ИначеЕсли Команда = Команды.Найти("ПечатьЗаявлениеОВынесенииСудебногоПриказа") Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыводЗаявленияОВынесенииСудебногоПриказа", ЭтотОбъект); 
		ПарамФормы = Новый Структура("Объект", Объект);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСписокПрилагаемыхДокументов", ПарамФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Команда = Команды.Найти("ПечатьЗаявленияОВыдачеСудебногоПриказаОВзыскании") Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыводЗаявленияОВыдачеСудебногоПриказаОВзыскании", ЭтотОбъект); 
		ПарамФормы = Новый Структура("Взыскание, Объект", Истина, Объект);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСписокПрилагаемыхДокументов", ПарамФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	//ИначеЕсли Команда = Команды.Найти("ПечатьЗаявленияОВозбужденииИсполнительногоПроизводства") Тогда
	//	ПечатФорма = ПечатьЗаявленияОВозбужденииИсполнительногоПроизводстваНаСервере();
	//	
	//	ВременныйФайл = ПолучитьИмяВременногоФайла("doc");
	//	Попытка
	//		МакетДоговора = ПолучитьИзВременногоХранилища(ПечатФорма.АдресХранилища);
	//		МакетДоговора.Записать(ВременныйФайл);
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	//		Возврат;
	//	КонецПопытки;
	//	
	//	Попытка
	//		Word = Новый COMОбъект("Word.Application");
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при попытке создать объект ""MS Word""!" + Символы.ПС + 
	//		"Возможно приложение ""MS Word"" не установлено или установлено неправильно.");
	//		Возврат;
	//	КонецПопытки;
	//	
	//	Word.Documents.Open(ВременныйФайл); 
	//	
	//	//открываем и активируем документ
	//	СсылкаМакет = Word.Application.Documents(1);
	//	СсылкаМакет.Activate();
	//	
	//	Для каждого СтрокаТек Из ПечатФорма.ПараметрыШапки Цикл
	//		// в метод Bookmarks передаем название "закладки"
	//		Замена = СсылкаМакет.Content.Find;
	//		Замена.Execute("[" + СтрокаТек.Ключ + "]", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(СтрокаТек.Значение));
	//	КонецЦикла;
	//	
	//	//включаем видимость приложения
	//	СсылкаМакет.Application.Visible = Истина;
	//ИначеЕсли Команда = Команды.Найти("ПечатьВыпискаСЛицевогоСчета") Тогда 
	//	ПечатьВыпискиСЛицевогоСчетаНаСервере().Показать("Выписка с лицевого счета");
	ИначеЕсли Команда = Команды.Найти("ПередатьСотрудникуУКЗ") Тогда 
		ОписОпов = Новый ОписаниеОповещения("СменаИсполнителяНаСотрудникаУКЗ", ЭтаФорма);
		ПарамФормы = Новый Структура("ПередачаУКЗ", Истина);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	ИначеЕсли Команда = Команды.Найти("НачатьБанкротство") Тогда 
		ОписОпов = Новый ОписаниеОповещения("ОбновитьСписокБанкротства", ЭтаФорма);
		ПарамФормы = Новый Структура("ПериодЗадолженностиНачало, ПериодЗадолженностиКонец, Абонент, Организация, Район");
		ЗаполнитьЗначенияСвойств(ПарамФормы, Объект);
		ПарамФормы.Вставить("Строение", Объект.МКД);
		ОткрытьФорму("Документ.энргБанкротство.Форма.ФормаДокументаСписаниеНаЗабаланс", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	ИначеЕсли Команда = Команды.Найти("ПодтвердитьПеренаправление") Тогда 
		ПарамФормы = Новый Структура("ПодтвердитьПеренаправление", Истина);
		Если ЗначениеЗаполнено(Объект.ИсторияПеренаправленийЗадачи) Тогда
			СтрокаТЧ = Объект.ИсторияПеренаправленийЗадачи[Объект.ИсторияПеренаправленийЗадачи.Количество()-1];
			
			ПарамЗапол = Новый Структура;
			ПарамЗапол.Вставить("ДатаСледующегоЭтапа",	СтрокаТЧ.ПланируемаяДатаВыполнения);
			ПарамЗапол.Вставить("Комментарий",			СтрокаТЧ.Комментарий);
			ПарамЗапол.Вставить("Пользователь", 		СтрокаТЧ.НовыйИсполнитель);
			
			ПарамФормы.Вставить("ЗначенияЗаполнения",	ПарамЗапол);
		КонецЕсли;
		ОписОпов = Новый ОписаниеОповещения("СменаИсполнителя", ЭтаФорма, Новый Структура("ПодтверждениеПередачи"));
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	ИначеЕсли Команда = Команды.Найти("ИзменитьШаг") Тогда
		ОткрытьФормуРедактированияШага();
		ИначеЕсли Команда = Команды.Найти("ПрикреплениеКвитанций") Тогда
		СоотПериодов = Новый Соответствие;
		Для каждого СтрокаТЧ Из Объект.Задолженность Цикл
			СоотПериодов.Вставить(СтрокаТЧ.ПериодНачисления);
		КонецЦикла;
		
		ПарамЗапол = Новый Структура("Ссылка, Организация, Район, МКД, Абонент, СтартоваяЗадача");
		ЗаполнитьЗначенияСвойств(ПарамЗапол, Объект);
		ПарамЗапол.Вставить("Макет", "бестКвитанцияОТЭКНовая"); 
		
		ПарамФормы = Новый Структура("ПериодыНачисления, ЗначенияЗаполнения", СоотПериодов, ПарамЗапол);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаПрикрепленияКвитанций", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьПИД(Команда)
	Если ПрекратитьПИДНаСервере(Истина) Тогда
		//УстановитьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПрекратитьПИДНаСервере(ПрекращенаДеятельность=Истина)
	Попытка
		ОбъектЗадача = РеквизитФормыВЗначение("Объект");
		ОбъектЗадача.ПрекращенаДеятельность = ПрекращенаДеятельность;
		Если ПрекращенаДеятельность Тогда
			ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
		Иначе
			ОбъектЗадача.Выполнена = Ложь;
			ОбъектЗадача.Записать();
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Модифицированность = Ложь;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	Если Объект.Выполнена Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьИзмененияПередВыполнениемКоманды(Команда);

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСудебнуюРаботу(ПарамСудебнойРаботы, ДополнительныеПараметры) Экспорт
	
	Если ПарамСудебнойРаботы <> Неопределено Тогда
		Если ПерейтиНаСудебнуюРаботуНаСервере(ПарамСудебнойРаботы) Тогда
			НастроитьВидимостьИДоступность();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПерейтиНаСудебнуюРаботуНаСервере(ПарамСудебнойРаботы)
	Попытка
		НачатьТранзакцию();
		ОбъектЗадача = РеквизитФормыВЗначение("Объект");
		Если Модифицированность Тогда
			ОбъектЗадача.Записать();
		КонецЕсли;
		
		СледЭтап = ПарамСудебнойРаботы.СледующийЭтап;
		Если Не ЗначениеЗаполнено(СледЭтап) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определён следующий этап.");
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		Отказ = Ложь;
		Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, СледЭтап, ОбъектЗадача, ПарамСудебнойРаботы, ПарамСудебнойРаботы.Задолженность,, Истина);
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		//ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
		
		ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
		Модифицированность = Ложь;
		
		СтартоваяЗадача = ?(ЗначениеЗаполнено(Объект.СтартоваяЗадача), Объект.СтартоваяЗадача, Объект.Ссылка);
		
	//	// Прикрепление файлов из документа
	//	Для каждого Справочник Из ПарамСудебнойРаботы.ПрикрепляемыеФайлы Цикл		
	//		ПараметрыДобавляемогоФайла	= Новый Структура;
	//		ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов", СтартоваяЗадача);
	//		ПараметрыДобавляемогоФайла.Вставить("Автор", Справочник.Автор);
	//		ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения", Справочник.Наименование);
	//		ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки", Справочник.Расширение);
	//		ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения", МестноеВремя(Справочник.ДатаМодификацииУниверсальная, ЧасовойПоясСеанса()));
	//		ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное", Справочник.ДатаМодификацииУниверсальная);
	//		    
	//		ЗаписьИсточник = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьМенеджерЗаписи();
	//		ЗаписьИсточник.Файл = Справочник;
	//		ЗаписьИсточник.Прочитать();
	//		ДвоичныйФайл = ЗаписьИсточник.ДвоичныеДанныеФайла.Получить();
	//		АдресХранилищаОтчета = ПоместитьВоВременноеХранилище(ДвоичныйФайл);
	//		
	//		РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, АдресХранилищаОтчета);
	//	КонецЦикла;
	//	
	//	ИмяКаталогаОтчета	= СтрЗаменить(ПолучитьИмяВременногоФайла(".tmp"), ".tmp", "");

	//	// Создание временного каталога
	//	Отказ = Ложь;
	//	Попытка
	//		СоздатьКаталог(ИмяКаталогаОтчета);
	//	Исключение
	//		Отказ = Истина;
	//	КонецПопытки;

	//	// Добавление в файлы "Уведомления"
	//	ТабДок = СформироватьТабДокУведомление(Объект.Ссылка, Ложь);
	//	Если ТабДок <> Неопределено Тогда
	//		
	//		ИмяФайла = ИмяКаталогаОтчета + "\Уведомление.pdf";
	//		
	//		// Создание временного каталога
	//		Попытка
	//			ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	//			
	//			ФайлОтчета 				= Новый ДвоичныеДанные(ИмяФайла); 
	//			АдресХранилищаОтчета 	= ПоместитьВоВременноеХранилище(ФайлОтчета);
	//			
	//			ДатаМодификацииФайла		= ТекущаяДатаСеанса();
	//			ПараметрыДобавляемогоФайла	= Новый Структура;
	//			ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов"				, СтартоваяЗадача);
	//			ПараметрыДобавляемогоФайла.Вставить("Автор"							, Строка(ПараметрыСеанса.ТекущийПользователь));
	//			ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения"				, "Уведомление");
	//			ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки"			, "pdf");
	//			ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения"				, МестноеВремя(ДатаМодификацииФайла, ЧасовойПоясСеанса()));
	//			ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное"	, ДатаМодификацииФайла);
	//			РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, АдресХранилищаОтчета); 
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ИмяКаталогаОтчета) Тогда
	//		Попытка
	//			УдалитьФайлы(ИмяКаталогаОтчета);
	//		Исключение
	//		КонецПопытки;
	//	КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ВозвращниеНаДоработку(ПарамВыбора, ДополнительныеПараметры) Экспорт
	
	Если ПарамВыбора <> Неопределено Тогда
		Объект.ПометкаУдаления = Истина;
		Записать();
		Если Не ВернутьВРаботуОснование(Объект.Основание, ПарамВыбора) Тогда 
			Объект.ПометкаУдаления = Ложь;
			Записать();
		КонецЕсли;
		НастроитьВидимостьИДоступность();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьВРаботуОснование(Основание, ПарамВозвращения)
	Попытка
		ОбъкетЗадача = Основание.ПолучитьОбъект();
		ОбъкетЗадача.Выполнена = Ложь;
		ЗаполнитьЗначенияСвойств(ОбъкетЗадача, ПарамВозвращения);
		ОбъкетЗадача.Исполнитель = ПарамВозвращения.НовыйИсполнитель;
		
		СтрокаТЧ = ОбъкетЗадача.ИсторияПеренаправленийЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПарамВозвращения);
		СтрокаТЧ.Перенаправил				= ПолучитьТекущегоПользователя();
		СтрокаТЧ.ДатаПеренаправления		= ТекущаяДатаСеанса();
		СтрокаТЧ.ПланируемаяДатаВыполнения	= ПарамВозвращения.ДатаСледЭтапа;
		
		ОбъкетЗадача.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось вернуть в работу предыдущую задачу по причине: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;	
КонецФункции

&НаКлиенте
Процедура Текущая(Команда)
	ТекСтрока = Элементы.СудебныеИнстанции.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	УстановитьПроверитьТекущуюСудебнуюИнстанцию(ТекСтрока.НомерСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроверитьТекущуюСудебнуюИнстанцию(НомерСтроки = Неопределено)
	Если НомерСтроки = Неопределено Тогда
		НомерСтроки = 1;
		Для каждого СтрокаТЧ Из Объект.СудебныеИнстанции Цикл
			Если СтрокаТЧ.Текущая Тогда
				НомерСтроки = СтрокаТЧ.НомерСтроки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.СудебныеИнстанции Цикл
		СтрокаТЧ.Текущая = СтрокаТЧ.НомерСтроки = НомерСтроки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СудебныеИнстанцииПриИзменении(Элемент)
	ТекДанные = Элементы.СписокСудебныеИнстанции.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "СудебныеИнстанции";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.СудебнаяИинстанция = ТекДанные.СудебнаяИинстанция;
КонецПроцедуры

&НаКлиенте
Процедура НачатьОРП(Команда)
	ОписОпов = Новый ОписаниеОповещения("ОбработкаВыбораСхемыОРП", ЭтаФорма);
	ПарамФормы = Новый Структура("СхемаОРП", Истина);
	
	ОткрытьФорму("Справочник.энргСхемыПИД.ФормаВыбора", ПарамФормы, ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСхемыОРП(Схема, ДополнительныеПараметры) Экспорт
	
	Если Схема <> Неопределено Тогда
		Задача = СоздатьЗадачуОРП(Схема);
		
		Если ЗначениеЗаполнено(Задача) Тогда
			ПоказатьЗначение(, Задача);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьЗадачуОРП(Схема)

	НовЗадача = Задачи.энргЗадачаПИД.СоздатьЗадачу();
	НовЗадача.Схема = Схема;
	НовЗадача.Дата = ТекущаяДата();
	
	ЗаполнитьЗначенияСвойств(НовЗадача, Объект, "Договор, Организация, Район, ЗадачаЮЛ, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец");
	Для Каждого стр Из Объект.Задолженность Цикл
		ЗаполнитьЗначенияСвойств(НовЗадача.Задолженность.Добавить(), стр);
	КонецЦикла;
	
	Задачи.энргЗадачаПИД.ЗаполнитьНаименованиеИЭтап(НовЗадача);
	Попытка
		НовЗадача.Записать();
		
		Возврат НовЗадача.Ссылка;
	Исключение
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать задачу ОРП по причине: " + ОписаниеОшибки());
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСледующийЭтап(Команда)
	ПерейтиНаСледующийЭтапКлиент(Ложь);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Переход выполнен");
КонецПроцедуры

#КонецОбласти
