#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Инициализировать данные документа
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка.бестИзменениеЗначенийПостоянногоРасхода 
//  ДополнительныеСвойства	 - Структура 
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	ИнициализироватьИсходныеДанныеДокумента(Схема);
		
	ДобавитьТекстЗапросабестОбъемыПостоянногоРасхода(Схема, "бестОбъемыПостоянногоРасхода");
	ДобавитьТекстЗапросабестТУРассчитываемыеПоПостоянномуРасходу(Схема, "бестТУРассчитываемыеПоПостоянномуРасходу");
		
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема)
	ПолучитьШапкуДокумента(Схема);
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъектыРасчета.МКД КАК МКД
	|ПОМЕСТИТЬ РеквизитыДокумента
	|ИЗ
	|	Документ.бестИзменениеЗначенийПостоянногоРасхода КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО Шапка.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)");	
КонецПроцедуры 

#КонецОбласти

#Область ТекстыЗапросов

Процедура ДобавитьТекстЗапросабестОбъемыПостоянногоРасхода(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Период КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	РеквизитыДокумента.МКД КАК МКД,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.Месяц КАК Месяц,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.Объем КАК Объем,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТочкаУчета КАК ТочкаУчета,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Услуга КАК Услуга,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТарифнаяЗона КАК ТарифнаяЗона
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеЗначенийПостоянногоРасхода.ПостоянныйРасходТУ КАК бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеЗначенийПостоянногоРасхода.ПостоянныйРасходОбъемы КАК бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы
	|			ПО бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Ссылка = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.Ссылка
	|				И бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.IDСтроки = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходОбъемы.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Ссылка
	|ГДЕ
	|	НЕ бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Отключить";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТУРассчитываемыеПоПостоянномуРасходу(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Период КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	РеквизитыДокумента.МКД КАК МКД,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТочкаУчета КАК ТочкаУчета,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Услуга КАК Услуга,
	|	бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НЕ бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Отключить КАК ПрименятьПостоянныйРасход
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеЗначенийПостоянногоРасхода.ПостоянныйРасходТУ КАК бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ
	|		ПО РеквизитыДокумента.Ссылка = бестИзменениеЗначенийПостоянногоРасходаПостоянныйРасходТУ.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли