#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент, Объект.Организация, Объект.Район,,
															СтандартнаяОбработка, Новый Структура("Строение", Объект.МКД));
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки


#КонецОбласти


