#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Район,Организация,КлючПомещения,ТочкаУчета;
	
	Если Параметры.Свойство("Район") Тогда
		Район 				= Параметры.Район;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация 		= Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("КлючПомещения") Тогда
		КлючПомещения 		= Параметры.КлючПомещения;
	КонецЕсли;
	
	Если Параметры.Свойство("ТочкаУчета") Тогда
		ТочкаУчета 			= Параметры.ТочкаУчета;
	КонецЕсли;
	
	Если НЕ Район = Неопределено 
		И НЕ Организация = Неопределено
		И НЕ КлючПомещения = Неопределено
		И НЕ КлючПомещения = Неопределено
		И НЕ ТочкаУчета = Неопределено Тогда
		мУслуги  			= энргРаботаСТочкамиУчетаСервер.ВсеУслугиТочкиУчета(Организация, Район,КлючПомещения, ТочкаУчета);
		
		УслугиСписок		= Новый СписокЗначений;
		УслугиСписок.ЗагрузитьЗначения(мУслуги);
		
		// накладываем отбор на точки динамический список
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",УслугиСписок,ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("СписокУслуг") Тогда
		УслугиСписок = Параметры.СписокУслуг;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",УслугиСписок,ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
