#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),				Движения.бестНедопущенныеТУ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестАктированиеНедопускаДопускаЮЛ.Дата КАК Период,
	      		  |	бестАктированиеНедопускаДопускаЮЛ.Организация КАК Организация,
	      		  |	бестАктированиеНедопускаДопускаЮЛ.Район КАК Район,
	      		  |	бестАктированиеНедопускаДопускаЮЛ.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестАктированиеНедопускаДопускаЮЛТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД,
	      		  |	бестАктированиеНедопускаДопускаЮЛ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.АктированиеНедопускаЮЛ_АктированиеДопуска) КАК ЭтоДопуск
	      		  |ИЗ
	      		  |	Документ.бестАктированиеНедопускаДопускаЮЛ.ТочкиУчета КАК бестАктированиеНедопускаДопускаЮЛТочкиУчета
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестАктированиеНедопускаДопускаЮЛ КАК бестАктированиеНедопускаДопускаЮЛ
	      		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |			ПО бестАктированиеНедопускаДопускаЮЛ.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |		ПО бестАктированиеНедопускаДопускаЮЛТочкиУчета.Ссылка = бестАктированиеНедопускаДопускаЮЛ.Ссылка
	      		  |ГДЕ
	      		  |	бестАктированиеНедопускаДопускаЮЛ.Ссылка = &Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли