#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжСобытияФормМодуль = ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");
		слжСобытияФормМодуль.ПриСозданииНаСервере(ЭтотОбъект, Объект);
		Если Параметры.Свойство("слжКлюч") Тогда			
			слжПреобразовательДанныхМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжПреобразовательДанных");
			слжТекущийОбъект 				= слжПреобразовательДанныхМодуль.ТекущийОбъектПриЧтенииНаСервере(Параметры["слжКлюч"]);			
			слжПреобразовательДанныхМодуль.ЗаполнитьДанныеФормы(Параметры["слжКлюч"],Объект);
			ПриЧтенииНаСервере(слжТекущийОбъект);			
		КонецЕсли;		
	КонецЕсли;	
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОткрытиеМКД(ЭтотОбъект);	
	//энргОбщегоНазначения.УстановитьСписокРайонов(Объект.Район,Элементы.Район); 		
	энргОбщегоНазначения.УстановитьСписокМаршрутовКонтролера(Контролер,МаршрутКонтроллера,Элементы.МаршрутКонтроллера,Объект.МКД);
			
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ФормаУправления		= ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.НУ");		
	КонецЕсли; 
	
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
		
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ПризнакРаспределенияНаАбонентов = ПолучитьПризнакРаспределения();	
	ПоказатьУзлы();
	
	РезультатЗапроса = РегистрыСведений.энргТехническаяВозможностьОРП.ПолучитьВозможностьОРП(Объект.МКД);
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		ТехническаяВозможностьПроведенияОРП = Выборка.ЕстьВозможность;
	Иначе
		ТехническаяВозможностьПроведенияОРП = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
			
	// энргРаботаСПоставщиками {
	энргРаботаСФормуламиРасчетаСервер.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// энргРаботаСПоставщиками }
	
	ЗаполнитьСвойстваСтроения(ТекущийОбъект);
	  	
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	
	ЗаполнитьТаблицуТочкиПоставки(ТекущийОбъект.Ссылка);

	
	//энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны"), Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета"),ТекущийОбъект);
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны"), Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета"));

    нОтбор = РегистрыСведений.энргИсполнителиОРП.ПолучитьПоследнее(КонецДня(?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия, Объект.Дата)), Новый Структура("Строение", Объект.МКД));;
	ИсполнительОРП = нОтбор.ИсполнительОРП;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ЗаполнитьТабЧастьНаборТочекПоставок(ТекущийОбъект);
		ПередЗаписьюНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
		
	ТекущийОбъект.ОписаниеМКД 		= СохраняемыеДанныеМКД();
			
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект); 	
	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если Не ЗначениеЗаполнено(ТекущийОбъект.МКД) Тогда
			ТекущийОбъект.МКД 			= Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовыйМКД", Истина);
		КонецЕсли;
		
		//энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаУзловПоПараметрам(ТекущийОбъект,"ПриборыУзловУчета",Отказ);		
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеУзлыУчета 						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			
			// Теперь это для узлов --
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеУзлыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			// --Теперь это для узлов					
			
		КонецЦикла;
		
		Для Каждого СтрокаПриборовУчета Из ТекущийОбъект.ПриборыУзловУчета Цикл
			
			Если Не ПустаяСтрока(СтрокаПриборовУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаПриборовУчета.ПриборУчета) Тогда
				СтрокаПриборовУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаПриборовУчета.НомерСтроки);
			КонецЕсли;			
			
		КонецЦикла;
		
		 		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеУзлыУчета", 	НовыеУзлыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		
		
		////БЫЛО-->
		//НовыеТочкиУчета						= Новый Массив;
		//НовыеПриборыУчета 					= Новый Массив;
		//
		//Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
		//	Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
		//		СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;
		//	
		//	Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
		//		СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;			
		//КонецЦикла;
		//
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ПриЗаписиНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		энргРаботаСЛицевымСчетомСервер.ПроверитьИСоздатьМКД(ТекущийОбъект,Отказ);
		
		энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
		энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
		энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
		
		// Определяем контроллера по адресу.
		Объект.УдалитьАдресОбъекта						= ЭтотОбъект.АдресОбъекта;
		Объект.УдалитьАдресОбъектаПредставлениеПолей	= ЭтотОбъект.АдресОбъектаЗначение;
		
		Если ЗначениеЗаполнено(МаршрутКонтроллера) Тогда
			энргРаботаСЛицевымСчетомСервер.ДобавитьАдресКМашруту(Объект.УдалитьАдресОбъекта,Объект.УдалитьАдресОбъектаПредставлениеПолей,ЭтотОбъект.Контролер,МаршрутКонтроллера);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.МКД) Тогда
		РС = РегистрыСведений.энргТехническаяВозможностьОРП;		
		РезультатЗапроса = РС.ПолучитьВозможностьОРП(ТекущийОбъект.МКД);		
		Выборка = РезультатЗапроса.Выбрать();		
		Если Выборка.Следующий() Тогда 
			ТекТехническаяВозможностьПроведенияОРП = Выборка.ЕстьВозможность;
		Иначе
			ТекТехническаяВозможностьПроведенияОРП = Ложь;
		КонецЕсли;
		
		Если ТекТехническаяВозможностьПроведенияОРП <> ТехническаяВозможностьПроведенияОРП Тогда
			РС.УстановитьВозможностьОРП(ТекущийОбъект.МКД, Неопределено, ТехническаяВозможностьПроведенияОРП);
		КонецЕсли;
		
		рИсполнитель = РегистрыСведений.энргИсполнителиОРП;
		рИсполнитель.УстановитьИсполнителяОРП(ТекущийОбъект.МКД, ИсполнительОРП, ?(ЗначениеЗаполнено(ТекущийОбъект.ДатаФактическогоСобытия), ТекущийОбъект.ДатаФактическогоСобытия, ТекущийОбъект.Дата));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСвойстваСтроения(ТекущийОбъект);	  	
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны"), Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета"));

	ПоказатьУзлы(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	УдалитьНезначащиеСтрокиВТочкахПоставок(); 	
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) <> Объект.ДатаФактическогоСобытия и ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда 
		ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроведения",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Дата документа отличается от фактической даты! Провести документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.ФормаУправления) Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле «Форма управления» не заполнено");
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.ВидыБлагоустройстваТарифныеКатегории) Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список «Виды благоустройства, тарифные категории»");
	КонецЕсли;
	
	Если СостояниеМКД() И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такое МКД уже активно");
	КонецЕсли;

КонецПроцедуры

Функция СостояниеМКД()
	
	Состояние = Ложь;
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Приод",				?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата));
	Запрос.УстановитьПараметр("МКД",				Объект.МКД);
	Запрос.УстановитьПараметр("Организация",		Объект.Организация);
	Запрос.УстановитьПараметр("Район",				Объект.Район);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|энргСостояниеМКДСрезПоследних.Состояние КАК Состояние
	|ИЗ
	|РегистрСведений.энргСостояниеМКД.СрезПоследних(
	|		&Приод,
	|		МКД = &МКД
	|			И Организация = &Организация
	|			И Район = &Район) КАК энргСостояниеМКДСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Состояние = Выборка.Состояние;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаПроведения(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Нет тогда
			Отказ = Истина;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

//УЗЛЫ 

&НаСервере
Процедура ПередЗаписьюНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеМКД 		= СохраняемыеДанныеМКД();
	СоответствиеСтрок 				= Новый Соответствие; 
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если Не ЗначениеЗаполнено(ТекущийОбъект.МКД) Тогда
			ТекущийОбъект.МКД 			= Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовыйМКД", Истина);
		КонецЕсли;
		
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		НовыеИзмерители 					= Новый Массив;
		
		СоответвиеПрибора 					= Новый Соответствие;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;			
			
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответвиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;
		
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				ПриборУчетаЗначение = СоответвиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;				
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		энргРаботаСЛицевымСчетомСервер.ПроверитьИСоздатьМКД(ТекущийОбъект,Отказ);
		
		НовыеТочкиУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеТочкиУчета") Тогда
			НовыеТочкиУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеТочкиУчета;
		КонецЕсли;
		
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			ЗаполнитьДанныеТочкиВСтроке(Отказ, НовыеТочкиУчета, СтрокаТочки.ТочкаУчета, СтрокаТочки.ОписаниеТочки, СтрокаТочки.НомерСтроки);
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла;
		
		// Определяем контроллера по адресу.
		Объект.УдалитьАдресОбъекта=ЭтотОбъект.АдресОбъекта;
		Объект.УдалитьАдресОбъектаПредставлениеПолей=ЭтотОбъект.АдресОбъектаЗначение;
		
		Если ЗначениеЗаполнено(МаршрутКонтроллера) Тогда
			энргРаботаСЛицевымСчетомСервер.ДобавитьАдресКМашруту(Объект.УдалитьАдресОбъекта,Объект.УдалитьАдресОбъектаПредставлениеПолей,ЭтотОбъект.Контролер,МаршрутКонтроллера);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


//УЗЛЫ

#КонецОбласти


#Область РаботаСТочкамиУчета

Процедура УдалитьНезначащиеСтрокиВТочкахПоставок()
	энргРаботаСТочкамиУчетаСервер.УдалитьНезначащиеСтрокиВТочкахПоставок(Объект);
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСвойстваТочекУчета(Знач ТекущийОбъект)
		
	ПолучаемыеСвойстваТочекУчета 	= ПолучаемыеСвойстваТочекУчета();
	//"
	//|Наименование,Расположение";
	мТочкиУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"));	
	СвойстваТочекУчета 				= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектов(мТочкиУчета, ПолучаемыеСвойстваТочекУчета);
	
	СоотвествиеРеквизитовСвойств 	= СоотвествиеРеквизитовСвойствамТочкиУчета();
	//Новый Структура("НаименованиеТочки, Расположение", "Наименование", "Расположение");
	
	ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Объект.ТочкиУчета,"Объект.ТочкиУчета", СвойстваТочекУчета, ПолучаемыеСвойстваТочекУчета,СоотвествиеРеквизитовСвойств);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Коллекция, ПутьКРеквизитуКоллекции, СвойстваТочекУчета, ЗаполняемыеСвойства, СоотвествиеРеквизитовСвойств)
					
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ТочкаУчета) Тогда
			СвойстваТочкиУчета 									= СвойстваТочекУчета[СтрокаКоллекции.ТочкаУчета];		
		Иначе
			СвойстваТочкиУчета 									= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеТочки);
		КонецЕсли; 
		
		Если СвойстваТочкиУчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваТочкиУчета.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваТочкиУчета[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПолучаемыеСвойстваТочекУчета() 
	ПолучаемыеСвойстваТочекУчета 	= "
	|Наименование,Расположение,Головная";	
	Возврат ПолучаемыеСвойстваТочекУчета;
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамТочкиУчета()
	Возврат Новый Структура("НаименованиеТочки,Расположение,Головная","Наименование","Расположение","Головная");
КонецФункции


&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);		
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
	Сч 														= 0;
	Для Каждого СтрокаИзмерителя Из Объект.Измерители Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.Измерители[Сч];
					
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаИзмерителя.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаИзмерителя[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);		
		
		Сч 													= Сч + 1;		
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТочкиВСтроке(Отказ,Знач НовыеТочкиУчета, Знач ТочкаУчета, Знач ОписаниеТочки, Знач НомерСтроки)
		
	ЭтоНоваяТочка 										= НЕ НовыеТочкиУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаТочкиУчета 							= Обработки.энргТочкиУчетаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовТочкиУчета						= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеТочки);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовТочкиУчета Цикл
		Если ОписаниеОбъектаТочкиУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаТочкиУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаТочкиУчета.Ссылка 					= ТочкаУчета;
	Если НЕ Обработки.энргТочкиУчетаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаТочкиУчета,ЭтоНоваяТочка) Тогда
		Отказ											= Истина;
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти

#Область РаботаСПриборамиУчета 

&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета()
	Возврат энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамПрибораУчета()
	Возврат энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
КонецФункции


&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();
	//"
	//|Код,ТипПрибораУчета,ВидКанальности,ТипУзлаУчета,РегистрируетОбъем,
	//|КодАСКУЭ,СобственникАСКУЭ,СобственникСИ,РасположениеИзмерителя,СистемаУчетаЭлектроэнергии";
	СоотвествиеРеквизитовСвойств 	=  СоотвествиеРеквизитовСвойствамПрибораУчета();
	//Новый Структура("ЗаводскойНомер, ТипПрибораУчета, ВидКанальности, РасположениеИзмерителя", "Код", "ТипПрибораУчета", "ВидКанальности", "РасположениеИзмерителя");
		
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,"Объект.ТочкиУчета",СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);
	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ПриборыУзловУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ПриборыУзловУчета,"Объект.ПриборыУзловУчета",СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);

	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, "Объект.Измерители", СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,ПутьКРеквизитуКоллекции ,СвойстваПриборовУчета, ЗаполняемыеСвойства, СоотвествиеРеквизитовСвойств) 
		
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти


#Область СобытияЭлементовШапки

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
		
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",АдресОбъекта,АдресОбъектаЗначение);
	
	ПараметрыФормыКонтактнойИнформации.Значение 		= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	Оповещение 											= Новый ОписаниеОповещения("АдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Ложь);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	Оповещение.ДополнительныеПараметры.Вставить("Строительный",      Ложь);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура АдресСтроительныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СтроительныйАдресДома"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
		
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",АдресОбъектаСтроительный,АдресОбъектаСтроительныйЗначение);
	
	ПараметрыФормыКонтактнойИнформации.Значение		 	= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	Оповещение 											= Новый ОписаниеОповещения("АдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Ложь);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	Оповещение.ДополнительныеПараметры.Вставить("Строительный",      Истина);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура АдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	АдресОбъектаНачалоВыбораЗавершениеНаСервере(РезультатЗакрытия.Представление, РезультатЗакрытия.Значение, ДополнительныеПараметры.Строительный);
	
КонецПроцедуры

&НаСервере
Процедура АдресОбъектаНачалоВыбораЗавершениеНаСервере(Представление, Значение, Строительный) 
	
	Если Строительный Тогда
		АдресОбъектаСтроительный 					= Представление;
		АдресОбъектаСтроительныйЗначение		 	= Значение;
	Иначе
		АдресОбъекта 								= Представление;
		АдресОбъектаЗначение 						= Значение;
		
		ЧтениеJSON 									= Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Значение);
		КонтактнаяИнформация 						= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если КонтактнаяИнформация.Свойство("oktmo") Тогда 
			ОКТМО									= КонтактнаяИнформация.oktmo;
		КонецЕсли;
	КонецЕсли;
	Объект.МКД = Справочники.энргСтроения.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	АдресОбъектаЗначение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(АдресОбъекта, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома"));
КонецПроцедуры

&НаКлиенте
Процедура АдресОбъектаСтроительныйПриИзменении(Элемент)
	АдресОбъектаСтроительныйЗначение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(АдресОбъектаСтроительный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СтроительныйАдресДома"));
КонецПроцедуры

&НаСервере
Процедура КонтролерПриИзмененииНаСервере()
	энргОбщегоНазначения.УстановитьСписокМаршрутовКонтролера(Контролер,МаршрутКонтроллера,Элементы.МаршрутКонтроллера);
КонецПроцедуры

&НаКлиенте
Процедура КонтролерПриИзменении(Элемент)
	КонтролерПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) И Объект.Поставщики.найтиСтроки(новый структура("Поставщик", Объект.Организация)).Количество() = 0 Тогда
		НовСтрока = Объект.Поставщики.Добавить();
		НовСтрока.Поставщик = Объект.Организация;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета";// + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	//
	//
	//энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ТекущиеДанные.IDСтроки,Объект);
	
	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	//
	//ТаблицыФормыВторогоУровня	= Новый Массив;
	//ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);

	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыУслуг");
	//ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
	
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	ДопПараметры.Вставить("IDСтроки", ТекущиеДанные.IDСтроки);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ДополнительныеПараметры.ТекущиеДанные);
			энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ДополнительныеПараметры.IDСтроки,Объект);
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);
			ТочкиУчетаПриИзмененииСервер();
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";// + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }
	
	Если ИспользоватьШкалыПриборовУчета Тогда
		СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
		бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
	КонецЕсли;
	
	ТекущиеДанные.РаспределятьНаАбонентов = ПризнакРаспределенияНаАбонентов;
		
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныРаспределятьНаАбонентовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныРаспределятьНаАбонентовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик","Поставщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		//ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
		ТекущиеДанные.РаспределятьНаАбонентов 	= Истина;
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиВидыБлагоустройстваТарифныеКатегории

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьНаименование(ТекДанные)
	
	ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	ЗаполнитьСвойстваСтроения(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	энргРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("энргОткрытиеМКД",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// 
&НаКлиенте
Процедура ФормаУправленияПриИзменении(Элемент)
	Если Объект.ФормаУправления = ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.НУ") Тогда
		Объект.УК = Неопределено;
		Объект.РасчетОбъемовВыполняетУК = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью();
	
	ПризнакРаспределенияНаАбонентов = ПолучитьПризнакРаспределения();
	Для Каждого ТекСтр из Объект.ТочкиУчета Цикл
		ТекСтр.РаспределятьНаАбонентов = ПризнакРаспределенияНаАбонентов;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.УК.Видимость = Объект.ФормаУправления <> ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.НУ");
	Элементы.РасчетОбъемовВыполняетУК.Видимость = Элементы.УК.Видимость;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПоСвойствамСтроения(СвойстваСтроения, ПолучаемыеСвойства)
	
	Если СвойстваСтроения = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	РеквизитыФормы 									= ПолучитьРеквизиты();
	мКлючиСтруктуры 								= СтрРазделить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ПолучаемыеСвойства,Символы.ПС,""),Символы.НПП,"")," ",""),",",Ложь);
	Для Индекс  = 0 По мКлючиСтруктуры.ВГраница() Цикл
		Если СвойстваСтроения.Свойство(мКлючиСтруктуры[Индекс]) Тогда
			Для ИндексРеквизита = 0 По РеквизитыФормы.ВГраница() Цикл
				Если РеквизитыФормы[ИндексРеквизита].Имя = мКлючиСтруктуры[Индекс] Тогда
					ЭтаФорма[мКлючиСтруктуры[Индекс]] 	= СвойстваСтроения[мКлючиСтруктуры[Индекс]];
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла; 		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваСтроения(Знач ТекущийОбъект)
	
	Перем ПолучаемыеСвойстваСтроения, СвойстваСтроения;
	
	ПолучаемыеСвойстваСтроения		= 
	"Бойлер,ВидОбъектаАбонентов,ГодПостройки,ГруппаПотребителейПоУмолчанию,
	|КоличествоЭтажей,МаршрутКонтроллера,Контролер,ТипПлиты,ОКТМО,
	|АдресОбъекта,АдресОбъектаЗначение,АдресОбъектаСтроительный,АдресОбъектаСтроительныйЗначение";
	
	Если ЗначениеЗаполнено(ТекущийОбъект.МКД) Тогда	
		СвойстваСтроения  			= Обработки.энргСтроенияМенеджер.ЗначенияСвойствОбъекта(ТекущийОбъект.МКД, ПолучаемыеСвойстваСтроения);	
	ИначеЕсли Не ПустаяСтрока(ТекущийОбъект.ОписаниеМКД) Тогда
		СвойстваСтроения			= Обработки.энргОткрытиеМКДМенеджер.СвойстваСтроенияИзСтрокиJSON(ТекущийОбъект.ОписаниеМКД, ПолучаемыеСвойстваСтроения);
	КонецЕсли;
	ЗаполнитьФормуПоСвойствамСтроения(СвойстваСтроения,ПолучаемыеСвойстваСтроения);

КонецПроцедуры

&НаСервере
Функция СохраняемыеДанныеМКД()
	ДанныеМКД  				= Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ДанныеМКД.Вставить("Организация", 						"" + Объект.Организация.УникальныйИдентификатор());
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Район) Тогда
		ДанныеМКД.Вставить("Район", 							"" + Объект.Район.УникальныйИдентификатор());
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Бойлер) Тогда
		ДанныеМКД.Вставить("Бойлер", 							Формат(Бойлер,"БЛ=Нет; БИ=Да"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГодПостройки) Тогда
		ДанныеМКД.Вставить("ГодПостройки", 						СтрЗаменить(СтрЗаменить("" + ГодПостройки, " ",""), Символы.НПП,""));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОбъектаАбонентов) Тогда
		ДанныеМКД.Вставить("ВидОбъектаАбонентов", 				"" + ВидОбъектаАбонентов.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаПотребителейПоУмолчанию) Тогда
		ДанныеМКД.Вставить("ГруппаПотребителейПоУмолчанию", 	"" + ГруппаПотребителейПоУмолчанию.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоЭтажей) Тогда
		ДанныеМКД.Вставить("КоличествоЭтажей",  				СтрЗаменить(СтрЗаменить("" + КоличествоЭтажей, " ",""), Символы.НПП,""));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОКТМО) Тогда
		ДанныеМКД.Вставить("ОКТМО",  							ОКТМО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДанныеМКД.Вставить("Дата", Объект.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипПлиты) Тогда
		Индекс 					= Перечисления.энргТипыПлит.Индекс(ТипПлиты);
		ЗначениеПеречисления	= Метаданные.Перечисления.энргТипыПлит.ЗначенияПеречисления.Получить(Индекс);
		ДанныеМКД.Вставить("ТипПлиты",  						"" + ЗначениеПеречисления.Имя);
	КонецЕсли;
			
	Если ЗначениеЗаполнено(АдресОбъекта) Тогда
		ДанныеМКД.Вставить("АдресОбъекта", 						АдресОбъекта);
		ДанныеМКД.Вставить("АдресОбъектаЗначение", 				АдресОбъектаЗначение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресОбъектаСтроительный) Тогда
		ДанныеМКД.Вставить("АдресОбъектаСтроительный", 			АдресОбъектаСтроительный);
		ДанныеМКД.Вставить("АдресОбъектаСтроительныйЗначение",	АдресОбъектаСтроительныйЗначение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МаршрутКонтроллера) Тогда
		ДанныеМКД.Вставить("МаршрутКонтроллера",  				"" + МаршрутКонтроллера.УникальныйИдентификатор());
	КонецЕсли;

	Если ЗначениеЗаполнено(Контролер) Тогда
		ДанныеМКД.Вставить("Контролер",  						"" + Контролер.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СетеваяОрганизация) Тогда
		ДанныеМКД.Вставить("СетеваяОрганизация", 				"" + Объект.СетеваяОрганизация.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СетеваяОрганизацияПередачаЭЭ) Тогда
		ДанныеМКД.Вставить("СетеваяОрганизацияПередачаЭЭ", 		"" + Объект.СетеваяОрганизацияПередачаЭЭ.УникальныйИдентификатор());
	КонецЕсли;

	Если Объект.ВидыБлагоустройстваТарифныеКатегории.Количество() > 0 Тогда
		МассивВидов = Новый Массив;
		Для Каждого СтрокаВидов Из Объект.ВидыБлагоустройстваТарифныеКатегории Цикл
			Структура = Новый Структура;
			Если ЗначениеЗаполнено(СтрокаВидов.Услуга) Тогда
				Структура.Вставить("Услуга", "" + СтрокаВидов.Услуга.УникальныйИдентификатор());	
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтрокаВидов.ВидБлагоустройстваИндивидуальный) Тогда
				Структура.Вставить("ВидБлагоустройстваИндивидуальный", "" + СтрокаВидов.ВидБлагоустройстваИндивидуальный.УникальныйИдентификатор());	
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаВидов.ВидБлагоустройстваОбщедомовой) Тогда
				Структура.Вставить("ВидБлагоустройстваОбщедомовой", "" + СтрокаВидов.ВидБлагоустройстваОбщедомовой.УникальныйИдентификатор());	
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаВидов.ТарифнаяКатегория) Тогда
				Структура.Вставить("ТарифнаяКатегория", "" + СтрокаВидов.ТарифнаяКатегория.УникальныйИдентификатор());	
			КонецЕсли;			
			МассивВидов.Добавить(Структура);
		КонецЦикла;
		ДанныеМКД.Вставить("ВидыБлагоустройстваТарифныеКатегории",МассивВидов);
	КонецЕсли;
	
	
	Запись 					= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись,ДанныеМКД);
	Возврат Запись.Закрыть();
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент) Экспорт
	 ТочкиУчетаПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаПриИзмененииСервер()  	
	энргРаботаСЛицевымСчетомСервер.ОбновитьВидыБлагоустройстваТарифныеКатегории(ЭтотОбъект);
	энргРаботаСЛицевымСчетомСервер.ОбновитьЗначениеПлощадей(ЭтотОбъект);
КонецПроцедуры



// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РАБОТА_С_УЗЛАМИ

#Область ДОБАВЛЕНИЕ_ПУ_К_УЗЛАМ

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,Неопределено,Неопределено);
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

&НаСервере
Процедура УлицаНедобавленнаяВФИАСПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.УлицаНедобавленнаяВФИАС) Тогда
		СтрокиКИ 							= Объект.УлицаНедобавленнаяВФИАС.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта));
		Если СтрокиКИ.количество() > 0 тогда
			АдресОбъекта  	= СтрокиКИ[0].Представление; 
			АдресОбъектаЗначение = СтрокиКИ[0].Значение;
			//УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(АдресОбъекта, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома"));
			АдресОбъектаСтроительный = АдресОбъекта;
			АдресОбъектаСтроительныйЗначение = АдресОбъектаЗначение;
			//УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(АдресОбъекта, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СтроительныйАдресДома"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УлицаНедобавленнаяВФИАСПриИзменении(Элемент)
	УлицаНедобавленнаяВФИАСПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьПризнакРаспределения()
	Возврат	РегистрыСведений.энргФормыУправленияМКД.ПолучитьПризнакРаспределения(Объект.Дата, Новый Структура, Объект.ФормаУправления);
КонецФункции

#КонецОбласти

#Область РаботаСУзлами

&НаКлиенте
Процедура РедактироватьТочкиУчета(Команда)
	энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуРедактированияУслугМКД(энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияУслугМКД(ЭтотОбъект));
КонецПроцедуры

// В дальнейшем удалится 
&НаСервере
Процедура ПоказатьУзлы()
	
	Если НЕ энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		Возврат
	КонецЕсли;
	
	ПрефиксТочекУчета = "";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДанныеУзла", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаТочкиПоставки", "Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаРедактироватьТочкиУчета", "Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДобавитьПриборыУчета", "Видимость", Ложь); 	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныГруппа2", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаГруппа2", "Видимость", Ложь); 	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаГруппа1", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныГруппа1", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаТипУзлаУчета", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДобавить", "Видимость", Ложь);	
	
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстовыеПоляКоллекцииМКД(ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСТочкамиПоставок

&НаКлиенте
Процедура ТочкиПоставокТочкаПоставкиПриИзменении(Элемент)
	ИмяТаблицыТочек = "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанныеТУ = Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	Если ТекущиеДанныеТУ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеТП	= Элементы.ТочкиПоставок.ТекущиеДанные;
	
	Если ТекущиеДанныеТП <> Неопределено Тогда
		ТекущиеДанныеТУ.СтруктураСети = ПолучитьСтруктуруСетиПоТочкеПоставки(ТекущиеДанныеТП.ТочкаПоставки);
	КонецЕсли;

	
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДанныеРасположения = энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстДанныеРасположения(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТаблицаТочкиПоставок	= Элементы.ТочкиПоставок;	
	ТекущиеДанные 			= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаТочкиПоставок,"IDСтроки",ТекущиеДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТочкиПоставкиПриИзменении(Элемент)
	ПересчитатьНомерСтрокиТаблицаТП();
КонецПроцедуры 

&НаКлиенте
Процедура ТочкиПоставкиТочкаПоставкиПриИзменении(Элемент)
	ТекущиеДанныеСтрокиТабЧасти = Элементы.ТаблицаТочкиПоставки.ТекущиеДанные;
	ПараметрыТочкиПоставки  		=  Новый Структура("МаксимальнаяМощность,ПрисоединеннаяМощность,СетеваяОрганизация,СтруктураСети,УровеньНапряжения,УровеньНапряженияРасчетный, ДоговорТП, АктТП");
	УстановитьПараметрыТП(ТекущиеДанныеСтрокиТабЧасти.ТочкаПоставки,ПараметрыТочкиПоставки);
	ЗаполнитьЗначенияСвойств(ТекущиеДанныеСтрокиТабЧасти,ПараметрыТочкиПоставки);
КонецПроцедуры
	
&НаКлиенте
Процедура ТочкиПоставкиТочкаПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= ложь;	
	ЗначениеОтбора = Новый Структура("ЭтоТочкаПоставки", Истина);
	ПараметрыФормыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Справочник.энргТочкиУчета.Форма.ФормаВыбора",ПараметрыФормыВыбора,Элемент);
КонецПроцедуры 

&НаКлиенте
Процедура ТочкиПоставокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда		
		ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элемент.ТекущиеДанные.IDСтроки			= ТекущиеДанные.IDСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Выберите точку учета");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокТочкаПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеТочкиПоставки 	 = ПолучитьСписокПодключенныхТП();
	Элемент.СписокВыбора.ЗагрузитьЗначения(ДоступныеТочкиПоставки);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыТочкиПоставки

&НаСервере
Функция ПолучитьСтруктуруСетиПоТочкеПоставки(ТочкаПоставки) 	
	Результат	= РегистрыСведений.энргПараметрыТочекПоставки.АктуальныеПараметрыТочкиПоставкиПоСсылке(ТочкаПоставки);
	Выборка   	= Результат.Выбрать();

	Если Выборка.Следующий() Тогда 
		Возврат Выборка.СтруктураСети;
	Иначе
		Возврат Справочники.бестСтруктураСети.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьСписокПодключенныхТП()
	МассивТочкиПоставки =  ТочкиПоставки.Выгрузить(,"ТочкаПоставки").ВыгрузитьКолонку("ТочкаПоставки");
	Возврат МассивТочкиПоставки;
КонецФункции

&НаСервере
Процедура ПересчитатьНомерСтрокиТаблицаТП()
    НомерСтроки = 1;
    Для каждого Стр Из ТочкиПоставки Цикл

        Стр.НомерСтроки = НомерСтроки;  
		НомерСтроки=НомерСтроки+1;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыТП(ТочкаПоставки,Приемник) 	
	Результат	= РегистрыСведений.энргПараметрыТочекПоставки.АктуальныеПараметрыТочкиПоставкиПоСсылке(ТочкаПоставки);
	Выборка   	= Результат.Выбрать();

	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Приемник,Выборка); 	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧастьНаборТочекПоставок(ТекущийОбъект)
	ТекущийОбъект.НаборТочекПоставок.Очистить();
	Для Каждого Стр Из ТочкиПоставки Цикл
		НовСтр = ТекущийОбъект.НаборТочекПоставок.Добавить();
		НовСтр.ТочкаПоставки = Стр.ТочкаПоставки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТочкиПоставки(Ссылка)
	
	Результат = Документы.энргОткрытиеМКД.АктуальныеПараметрыТочкиПоставки(Ссылка);
	Выборка 				= Результат.Выбрать();
	
	ТочкиПоставки.Очистить();
	
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		СтрокаДляЗаполнения = ТочкиПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка);
		СтрокаДляЗаполнения.НомерСтроки 				= НомерСтроки;
		НомерСтроки 									= НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти  

#Область Подсистема_слжСлужебная

&НаКлиенте
Процедура Подключаемый_слж_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ОбработкаВыбораПоляВвода(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПриИзменении(Элемент)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ПолеВводаПриИзменении(Элемент, ЭтаФорма);	
	ДействиеПоУмолчанию 		= слжСобытияФормКлиентМодуль.ДействиеПриИзмененииПоУмолчанию(Элемент, ЭтаФорма);
	Если Не ПустаяСтрока(ДействиеПоУмолчанию) Тогда
		Выполнить(ДействиеПоУмолчанию+"(Элемент)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПередЗаписью(Отказ, ПараметрыЗаписи)
	 	
	слжМодульКлиент					= ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	СтруктураДействияПоУмолчанию 	= слжМодульКлиент.СтруктураДействияПоУмолчанию(ЭтаФорма);
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписью) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписью+"(Отказ, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
			
	Отказ 							= слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписи) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписи+"(ПараметрыЗаписи)");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	Отказ 							= Истина;
	Модифицированность 				= Ложь;
	
КонецПроцедуры

&НаСервере
Функция слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи)
	
	слжМодуль 					= ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");		
	слжТекущийОбъект 			= РеквизитФормыВЗначение("Объект");
	Отказ 						= Ложь;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере) Тогда		
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЕсли;		
	
	Если НЕ слжТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ 					= Истина;
		Возврат Истина;
	КонецЕсли;

	НачатьТранзакцию();		
	слжТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере+"(слжТекущийОбъект, ПараметрыЗаписи)");
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(слжТекущийОбъект,"Объект");
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции

#КонецОбласти