#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацияСЛицевымСчетом(ЭтотОбъект);	
	Если ЗначениеЗаполнено(Параметры.ВидОперации) тогда
		 ЭлементОтбора 					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ВидОперации");
		 ЭлементОтбора.ПравоеЗначение 	= Параметры.ВидОперации;
		 ЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
