#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	АдресныйОбъект = Параметры.ИдентификаторУлицы;
	Если Не ЗначениеЗаполнено(АдресныйОбъект) Тогда
		Возврат;
	КонецЕсли;
			
	// позиционирование
	Отбор = Новый Структура("ГУИД", Параметры.ИдентификаторДома);
		
	Строки = СписокДомов.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Элементы.СписокДомов.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если Элементы.СписокДомов.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Элементы.СписокДомов.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
