#Область ОбработчикиСобытий

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  	    	
		Запись.Пользователь 	= ПользователиИнформационнойБазы.ТекущийПользователь();  	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Параметры.Ключ) тогда
		Запись.ДатаПодписания = ТекущаяДата();
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.Абонент) Тогда
		Запись.НомерДоговора = Запись.Абонент.ЛицевойСчет;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
