#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоПотоков = 10;
	ДокументСсылка = Параметры.ДокументСсылка; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьАктивныеФоновыеЗадания();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПотоковПриИзменении(Элемент)
	
	Если КоличествоПотоков > 10 Тогда 
		КоличествоПотоков = 10;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запрещено использовать больше 10 потоков");		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрогрессФоновых

&НаКлиенте
Процедура ПрогрессФоновыхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессФоновыхПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запустить(Команда)
	
	ЗаполнитьАктивныеФоновыеЗадания();
	Если ПрогрессФоновых.Количество() > 0 Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Процесс создания документов запущен");
		Возврат;
		
	КонецЕсли;

	
	ДанныеПотоков = ЗапуститьФоновыеЗаданияПоСозданиюДокументов();
	НомерПотока = 1;	
	Для Каждого ДлительнаяОперация из ДанныеПотоков Цикл	
		
		НовыйПоток = ПрогрессФоновых.Добавить();
		НовыйПоток.НомерПотока = НомерПотока;
		НовыйПоток.ИдентификаторЗадачи = ДлительнаяОперация.ИдентификаторЗадания;
		
		ОжидатьЗавершение(ДлительнаяОперация);		
		НомерПотока = НомерПотока + 1;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Активные(Команда)
	
	ЗаполнитьАктивныеФоновыеЗадания();	
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ЗаполнитьАктивныеФоновыеЗадания(); // Заполняем все активные фоновые задания
	ОтменитьАктивныеФоновыеЗадания();
	// ЗаполнитьАктивныеФоновыеЗадания(); // Заполняем все активные фоновые задания после отмены
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапуститьФоновыеЗаданияПоСозданиюДокументов()
	
	ДопПараметры = Новый Структура("ДанныеПотоков", Новый Массив);	
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗапуститьФормированиеРегистрацииПоказаний(ДокументСсылка, КоличествоПотоков, ДопПараметры);
	Возврат ДопПараметры.ДанныеПотоков;
	
КонецФункции


#Область ПрогрессВыполененияФоновыхЗаданий

&НаКлиенте
Процедура ОповещениеОПрогрессеВыполнения(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс.Прогресс = Неопределено Тогда 
		Возврат;
	КонецЕсли;  	
	
	Для Каждого ТекСтрока из ПрогрессФоновых Цикл
		ИдентификаторЗадачи = Новый УникальныйИдентификатор(ТекСтрока.ИдентификаторЗадачи);
		Если ИдентификаторЗадачи = Прогресс.ИдентификаторЗадания Тогда
			//ТекСтрока.Прогресс = Прогресс.Прогресс.Текст;
			ТекСтрока.Прогресс = "Обработано " + Прогресс.Прогресс.Процент + "%"; 
			Прервать;
		КонецЕсли; 		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗадания(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;   	
	
	Для Каждого ТекСтрока из ПрогрессФоновых Цикл
		ИдентификаторЗадачи = Новый УникальныйИдентификатор(ТекСтрока.ИдентификаторЗадачи);
		Если ИдентификаторЗадачи = ДополнительныеПараметры.ИдентификаторЗадания Тогда
			ТекСтрока.Прогресс = РезультатВыполнения.Статус;
			Прервать;
		КонецЕсли; 		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьАктивныеФоновыеЗадания()
	
	ПрогрессФоновых.Очистить();
	Активные = ДлительныеОперацииКлиент.АктивныеДлительныеОперации();
	НомерПотока = 1;
	
	Для Каждого КлючЗначение Из Активные.Список Цикл
		Попытка
			
			Если КлючЗначение.Значение.ОповещениеОЗавершении.ДополнительныеПараметры.ДокументСсылка = ДокументСсылка Тогда
				
				НовыйПоток = ПрогрессФоновых.Добавить();
				НовыйПоток.НомерПотока = НомерПотока;
				НовыйПоток.ИдентификаторЗадачи = КлючЗначение.Ключ;
				
				ДлительнаяОперация = КлючЗначение.Значение.ОповещениеОЗавершении.ДополнительныеПараметры.ДлительнаяОперация;
				ОжидатьЗавершение(ДлительнаяОперация);
				НомерПотока = НомерПотока + 1;
				
			КонецЕсли; 			
			
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьАктивныеФоновыеЗадания()
	
	Для Каждого СтрокаНабора Из ПрогрессФоновых Цикл
		
		ИдентификаторЗадания = Новый УникальныйИдентификатор(СтрокаНабора.ИдентификаторЗадачи);
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		
	КонецЦикла;
	
	ПрогрессФоновых.Очистить();
	//ОбменДаннымиСервер.Пауза(5);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершение(ДлительнаяОперация)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);		
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОповещениеОПрогрессеВыполнения", ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения; 
	
	ДопПараметры = Новый Структура("ИдентификаторЗадания, ДокументСсылка, ДлительнаяОперация", ДлительнаяОперация.ИдентификаторЗадания, ДокументСсылка, ДлительнаяОперация);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗадания", ЭтотОбъект, ДопПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти