#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерефейс

Функция ПолучитьСрокИсполнения(ТочкаМаршрутаБизнесПроцесса,СпособПолученияЗаявки,НаличиеЭкспертногоЗаключения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСрокиИсполненияЗадач.Дни КАК Дни
		|ИЗ
		|	РегистрСведений.бестСрокиИсполненияЗадач КАК бестСрокиИсполненияЗадач
		|ГДЕ
		|	бестСрокиИсполненияЗадач.ТочкаМаршрута = &ТочкаМаршрута
		|	И бестСрокиИсполненияЗадач.СпособПолученияЗаявки = &СпособПолученияЗаявки
		|	И бестСрокиИсполненияЗадач.НаличиеЭкспертногоЗаключения = &НаличиеЭкспертногоЗаключения";
	
	Запрос.УстановитьПараметр("НаличиеЭкспертногоЗаключения", 	НаличиеЭкспертногоЗаключения);
	Запрос.УстановитьПараметр("СпособПолученияЗаявки", 			СпособПолученияЗаявки);
	Запрос.УстановитьПараметр("ТочкаМаршрута", 					ТочкаМаршрутаБизнесПроцесса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Дни;		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли