#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	слжСлужебныеОперацииПриСозданииНаСервере();
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргСоглашениеОПотребленииВПомещении(ЭтотОбъект);
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;		
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);

	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Абоненты");

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Абоненты");

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Строение = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Строение""",Объект.Ссылка,"Строение","ЭтотОбъект.Элементы",Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер(); 	
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
// {{MRG[ <-> ]
		СтроениеПомещениеПриИзмененииСервер();		
// }}MRG[ <-> ]
// {{MRG[ <-> ]
//		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
// }}MRG[ <-> ]
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	СтроениеПомещениеПриИзмененииСервер(); 	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Услуга) тогда
		Объект.Абоненты.Очистить();	
		Объект.ФиксированныеОбъемы.Очистить(); 	
		Объект.ДолиРаспределенияОбъемаПомещения.Очистить();
		ЗаполнитьСписокАбонентов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентыСпособРаспределенияПриИзменении(Элемент)
	
	ТекущиеДанные 							= Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	СпособРаспределения 					= ТекущиеДанные.СпособРаспределения;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) тогда
		ТекущиеДанные.IDСтроки 							= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	КоллекцияФиксВеличина					= ЭтаФорма.Объект.ФиксированныеОбъемы;
	КоллекцияДолиРаспределения				= ЭтаФорма.Объект.ДолиРаспределенияОбъемаПомещения;
	
	СтруктураПоиска  						= Новый Структура("IDСтроки",ТекущиеДанные.IDСтроки);
	
	Если СпособРаспределения = ПредопределенноеЗначение("Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем") Тогда
		
		СтрокиФиксУдалить						= КоллекцияФиксВеличина.НайтиСтроки(СтруктураПоиска);	
		для Каждого СтрокаФиксУдалить из СтрокиФиксУдалить цикл		  		
			КоллекцияФиксВеличина.Удалить(СтрокаФиксУдалить);		
		КонецЦикла;  	 
		СтрокаФикс 						= КоллекцияФиксВеличина.добавить();
		СтрокаФикс["IDСтроки"]				= ТекущиеДанные.IDСтроки;
		
		СтрокиДолиУдалить						= КоллекцияДолиРаспределения.НайтиСтроки(СтруктураПоиска);	
		для Каждого СтрокаДолиУдалить из СтрокиДолиУдалить цикл		  		
			КоллекцияДолиРаспределения.Удалить(СтрокаДолиУдалить);		
		КонецЦикла;  	 

		
	ИначеЕсли СпособРаспределения = ПредопределенноеЗначение("Перечисление.энргСпособыРаспределенияОбъема.ДолевоеРаспределение") Тогда 
		
		СтрокиДолиУдалить						= КоллекцияДолиРаспределения.НайтиСтроки(СтруктураПоиска);	
		для Каждого СтрокаДолиУдалить из СтрокиДолиУдалить цикл		  		
			КоллекцияДолиРаспределения.Удалить(СтрокаДолиУдалить);		
		КонецЦикла;  	 
		СтрокаДоли 						= КоллекцияДолиРаспределения.добавить();
		СтрокаДоли["IDСтроки"]				= ТекущиеДанные.IDСтроки;

		СтрокиФиксУдалить						= КоллекцияФиксВеличина.НайтиСтроки(СтруктураПоиска);	
		для Каждого СтрокаФиксУдалить из СтрокиФиксУдалить цикл		  		
			КоллекцияФиксВеличина.Удалить(СтрокаФиксУдалить);		
		КонецЦикла; 
	ИначеЕсли СпособРаспределения = ПредопределенноеЗначение("Перечисление.энргСпособыРаспределенияОбъема.Остаток") Тогда 

		Элементы.АбонентыКоэффициентРаспределенияОстатка.АвтоОтметкаНезаполненного=Истина;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПомещениеПриИзменении(Элемент)
	ТекущиеДанные  = Элементы.Абоненты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПомещения  				= СтроениеКлючПомещенияПоПомещению(ТекущиеДанные.Помещение);
	ТекущиеДанные.Строение 			= ДанныеПомещения.Строение;
	ТекущиеДанные.КлючПомещения 	= ДанныеПомещения.КлючПомещения;
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные 							= Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) тогда
		ТекущиеДанные.IDСтроки				= Новый УникальныйИдентификатор;
	КонецЕсли;    
	
	Элементы.ФиксированныеОбъемы.ОтборСтрок		= Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);
	
	Элементы.ДолиРаспределенияОбъемаПомещения.ОтборСтрок		= Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);


КонецПроцедуры

&НаКлиенте
Процедура АбонентыТочкаУчетаПриИзменении(Элемент)
	
	ТекущиеДанные 				= Элементы["Абоненты"].ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ТочкаУчета) Тогда
		ТекущиеДанные.Услуга  	= энргРаботаСТочкамиУчетаСервер.УслугаТочкиУчета(Объект.Организация,Объект.Район,ТекущиеДанные.КлючПомещения,ТекущиеДанные.ТочкаУчета,Объект.Дата);	
	Иначе
		ТекущиеДанные.Услуга 	= ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка");
	КонецЕсли;  	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец МенюОтчеты

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура СтроениеПомещениеПриИзмененииСервер() 
	
	ДанныеКлючаПомещения  = Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Строение,Помещение);
	ЗаполнитьЗначенияСвойств(Объект,ДанныеКлючаПомещения,"КлючПомещения,Район");
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеКлючаПомещения,"ЧастныйСектор");
	
	Объект.Абоненты.Очистить();	
	Объект.ФиксированныеОбъемы.Очистить(); 	
	Объект.ДолиРаспределенияОбъемаПомещения.Очистить();
	
	ЗаполнитьСписокАбонентов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтроениеКлючПомещенияПоПомещению(Знач яПомещение) 
	яСтроение  				= яПомещение.Строение;
	ДанныеКлючаПомещения  	= Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(яСтроение,яПомещение);
	Возврат Новый Структура("Строение,КлючПомещения",яСтроение,ДанныеКлючаПомещения.КлючПомещения);	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокАбонентов()
		
	Результат 								= энргРаботаСЛицевымСчетомСервер.ТочкиУчетаРазделенныхЛС(Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения, Объект.Услуга); 
	Выборка  								= Результат.выбрать();
	Пока Выборка.следующий() цикл
		НовСтр  					= Объект.Абоненты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АбонентыТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ТекДанные=Элементы.Абоненты.ТекущиеДанные;
		КлючПомещения = ВернутьКлючПомещения(ТекДанные.Абонент);
		ТекДанные.КлючПомещения=КлючПомещения;

КонецПроцедуры

&НаСервере
Функция   ВернутьКлючПомещения (Абонент)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	энргАбоненты.КлючПомещения КАК КлючПомещения
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |ГДЕ
	               |	энргАбоненты.Ссылка = &Абонент";
	Результат  		= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат истина;
	КонецЕсли;
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КлючПомещения;

КонецФункции

&НаКлиенте
Процедура АбонентыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "Абоненты");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область Подсистема_слжСлужебная

&НаКлиенте
Процедура Подключаемый_слж_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ОбработкаВыбораПоляВвода(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПриИзменении(Элемент)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ПолеВводаПриИзменении(Элемент, ЭтаФорма);	
	ДействиеПоУмолчанию 		= слжСобытияФормКлиентМодуль.ДействиеПриИзмененииПоУмолчанию(Элемент, ЭтаФорма);
	Если Не ПустаяСтрока(ДействиеПоУмолчанию) Тогда
		Выполнить(ДействиеПоУмолчанию+"(Элемент)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПередЗаписью(Отказ, ПараметрыЗаписи)
	 	
	слжМодульКлиент					= ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	СтруктураДействияПоУмолчанию 	= слжМодульКлиент.СтруктураДействияПоУмолчанию(ЭтаФорма);
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписью) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписью+"(Отказ, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
			
	Отказ 							= слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписи) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписи+"(ПараметрыЗаписи)");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	Отказ 							= Истина;
	Модифицированность 				= Ложь;
	
КонецПроцедуры

&НаСервере
Функция слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи)
	
	слжМодуль 					= ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");		
	слжТекущийОбъект 			= РеквизитФормыВЗначение("Объект");
	Отказ 						= Ложь;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере) Тогда		
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЕсли;		
	
	Если НЕ слжТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ 					= Истина;
		Возврат Истина;
	КонецЕсли;

	НачатьТранзакцию();		
	слжТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере+"(слжТекущийОбъект, ПараметрыЗаписи)");
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(слжТекущийОбъект,"Объект");
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура слжСлужебныеОперацииПриСозданииНаСервере()	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжСобытияФормМодуль = ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");
		слжСобытияФормМодуль.ПриСозданииНаСервере(ЭтотОбъект, Объект);
		Если Параметры.Свойство("слжКлюч") Тогда			
			слжПреобразовательДанныхМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжПреобразовательДанных");
			слжТекущийОбъект 				= слжПреобразовательДанныхМодуль.ТекущийОбъектПриЧтенииНаСервере(Параметры["слжКлюч"]);			
			слжПреобразовательДанныхМодуль.ЗаполнитьДанныеФормы(Параметры["слжКлюч"],Объект);
			ПриЧтенииНаСервере(слжТекущийОбъект);			
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
