#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

Процедура НастройкиСниженияСтоимостиУслуг(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиСниженияСтоимостиУслуг());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация, Район, Услуга";
		ПараметрыВиртуальнойТаблицы = ОператорВыбора.Источники[0].Источник.Параметры[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрыВиртуальнойТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
		
КонецПроцедуры

Процедура НастройкиСниженияСтоимостиУслугКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаПериодов, ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиСниженияСтоимостиУслугКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	//ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	//Источник 						= ОператорВыбора.Источники[1].Источник;		
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаНастройкиСниженияСтоимостиУслуг() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргНастройкиСниженияСтоимостиУслуг.Организация КАК Организация,
	|	энргНастройкиСниженияСтоимостиУслуг.Район КАК Район,
	|	энргНастройкиСниженияСтоимостиУслуг.Услуга КАК Услуга,
	|	энргНастройкиСниженияСтоимостиУслуг.ПроцентСнижения КАК ПроцентСнижения
	|ИЗ
	|	РегистрСведений.энргНастройкиСниженияСтоимостиУслуг.СрезПоследних КАК энргНастройкиСниженияСтоимостиУслуг";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНастройкиСниженияСтоимостиУслугКоллекцияПериодов()
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаНастроек.Организация КАК Организация,
	|	ТаблицаНастроек.Район КАК Район,
	|	ТаблицаНастроек.Услуга КАК Услуга,
	|	ТаблицаНастроек.ПроцентСнижения КАК ПроцентСнижения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаНастроек.Организация КАК Организация,
	|		ТаблицаНастроек.Район КАК Район,
	|		ТаблицаНастроек.Услуга КАК Услуга,
	|		МАКСИМУМ(ТаблицаНастроек.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргНастройкиСниженияСтоимостиУслуг КАК ТаблицаНастроек
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО (ТаблицаПериодов.Организация = ТаблицаПериодов.Организация)
	|				И (ТаблицаПериодов.Район = ТаблицаПериодов.Район)
	|				И ТаблицаНастроек.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ТаблицаНастроек.Организация,
	|		ТаблицаНастроек.Район,
	|		ТаблицаНастроек.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиСниженияСтоимостиУслуг КАК ТаблицаНастроек
	|		ПО ВложенныйЗапрос.Период = ТаблицаНастроек.Период
	|			И ВложенныйЗапрос.Организация = ТаблицаНастроек.Организация
	|			И ВложенныйЗапрос.Район = ТаблицаНастроек.Район
	|			И ВложенныйЗапрос.Услуга = ТаблицаНастроек.Услуга";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли