#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет МКД с фиксированными объемами.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура МКДСФиксированнымиОбъемами(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМКДСФиксированнымиОбъемами());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения; 
	Пакет.ВыбиратьРазрешенные 	= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 	= Пакет.Операторы[0];	
	Источник 		= ОператорВыбора.Источники[0].Источник;
	Параметры 		= Источник.Параметры;
	
	ПараметрПериод 	= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Организация,Район,МКД,Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаМКДСФиксированнымиОбъемами()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Организация КАК Организация,
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Район КАК Район,
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.МКД КАК МКД,
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.энргСостояниеФиксированныхОбъемовМКД.СрезПоследних КАК энргСостояниеФиксированныхОбъемовМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеФиксированныхОбъемовМКДСрезПоследних.Состояние";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли