#Область ОбработчикиСобытий

&НаКлиенте
Процедура КонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока  														= Элементы.АдресаМаршрута.ТекущиеДанные;
	
	СтандартнаяОбработка											= Ложь;
	МодульУправлениеКонтактнойИнформациейКлиент 					= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 								= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъекта"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
	
	ДанныеСтроки 													= Новый Структура("Представление,ЗначенияПолей",ТекСтрока.ЗначенияПолей,ТекСтрока.Представление);
	
	//ПараметрыФормыКонтактнойИнформации.ЗначенияПолей 				= ТекСтрока.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 				= ТекСтрока.Представление;
	
	Оповещение 														= Новый ОписаниеОповещения("АдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока",ТекСтрока));
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Ложь);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура АдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	текСтрока  									= ДополнительныеПараметры.текСтрока;
	текСтрока.Представление 					= РезультатЗакрытия.Представление;
	текСтрока.ЗначенияПолей 					= РезультатЗакрытия.КонтактнаяИнформация;		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргМаршрутыКонтроллеров(ЭтотОбъект);
	
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	СсылкаМаршрутКонтролера = ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КлючиПомещений,						"МаршрутКонтролера", 						СсылкаМаршрутКонтролера);
КонецПроцедуры

#КонецОбласти
