#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСТочкамиПоставки",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСТочкамиПоставки",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСТочкамиПоставки",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОперацияСТочкамиПоставки");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;

	ДобавитьТекстЗапросаАктивностьТочекПоставки(Схема, Регистры);
	ДобавитьТекстЗапросаПараметрыТочекПоставки(Схема, Регистры);
	ДобавитьТекстЗапросаКатегорииНадежностиТочекПоставок(Схема, Регистры);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаАктивностьТочекПоставки(Схема, Регистры)
	
	ИмяРегистра = "энргАктивностьТочекПоставки";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргОперацияСТочкамиПоставки.Дата КАК Период,
	|	энргОперацияСТочкамиПоставки.ВидОперации = ЗНАЧЕНИЕ(перечисление.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки) КАК Состояние
	|ИЗ
	|	Документ.энргОперацияСТочкамиПоставки.ТочкиПоставки КАК энргОперацияСТочкамиПоставкиТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки КАК энргОперацияСТочкамиПоставки
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставки.Ссылка
	|ГДЕ
	|	энргОперацияСТочкамиПоставки.Ссылка В (&мДокументы)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыТочекПоставки(Схема, Регистры)
	
	ИмяРегистра = "энргПараметрыТочекПоставки";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргОперацияСТочкамиПоставки.Дата КАК Период,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.СтруктураСети КАК СтруктураСети,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.УровеньНапряжения КАК УровеньНапряжения,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ДоговорТП КАК ДоговорТП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.АктТП КАК АктТП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПрисоединения КАК ТочкаПрисоединения,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ГТП КАК ГТП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ВидРынка КАК ВидРынка,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.СмежныйСубъектОРЭМ КАК СмежныйСубъектОРЭМ,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.РеквизитыПСИ КАК РеквизитыПСИ,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ДоговорПокупки КАК ДоговорПокупки,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ОтделениеЭК КАК ОтделениеЭК,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.НапряжениеГБП КАК НапряжениеГБП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.АктРазграниченияБалансовойПринадлежности КАК АктРазграниченияБалансовойПринадлежности
	|ИЗ
	|	Документ.энргОперацияСТочкамиПоставки.ТочкиПоставки КАК энргОперацияСТочкамиПоставкиТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки КАК энргОперацияСТочкамиПоставки
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставки.Ссылка
	|ГДЕ
	|	энргОперацияСТочкамиПоставки.Ссылка В(&мДокументы)
	|	И энргОперацияСТочкамиПоставки.ВидОперации = ЗНАЧЕНИЕ(перечисление.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКатегорииНадежностиТочекПоставок(Схема, Регистры)
	
	ИмяРегистра = "энргКатегорииНадежностиТочекПоставок";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргОперацияСТочкамиПоставки.Дата КАК Период,
	|	энргОперацияСТочкамиПоставкиКатегорииНадежности.КатегорияНадежности КАК КатегорияНадежности,
	|	энргОперацияСТочкамиПоставкиКатегорииНадежности.ВТомЧисле КАК ВТомЧисле
	|ИЗ
	|	Документ.энргОперацияСТочкамиПоставки.ТочкиПоставки КАК энргОперацияСТочкамиПоставкиТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки КАК энргОперацияСТочкамиПоставки
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки.КатегорииНадежности КАК энргОперацияСТочкамиПоставкиКатегорииНадежности
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставкиКатегорииНадежности.Ссылка
	|			И энргОперацияСТочкамиПоставкиТочкиПоставки.IDСтроки = энргОперацияСТочкамиПоставкиКатегорииНадежности.IDСтроки
	|ГДЕ
	|	энргОперацияСТочкамиПоставки.Ссылка В(&мДокументы)
	|	И энргОперацияСТочкамиПоставки.ВидОперации = ЗНАЧЕНИЕ(перечисление.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли