#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Документы.энргОперацияСТочкамиПоставки.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки тогда
		ПроверяемыеРеквизиты.добавить("ТочкиПоставки.МаксимальнаяМощность");
		ПроверяемыеРеквизиты.добавить("ТочкиПоставки.СетеваяОрганизация");
		ПроверяемыеРеквизиты.добавить("ТочкиПоставки.СтруктураСети");

	ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки Тогда 
		ПроверяемыеРеквизиты.добавить("ТочкиПоставки.ТочкаПоставки");
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для каждого стр из ТочкиПоставки Цикл
		стр.ТочкаПоставки = Справочники.энргТочкиУчета.ПустаяСсылка();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли