#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);	
	
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДополнительныеСвойства.Вставить("ДанныеСтроения", Новый Структура("Организация, Район, Строение",Организация, Район, МКД));
	
	Документы.энргИзменитьФормуУправленияМКД.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	Документы.энргИзменитьФормуУправленияМКД.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	
	//энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	//
	//ДанныеШапки  					= ДанныеШапки();
	//
	//МКДОткрыт 						= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Новый Граница(МоментВремени(),ВидГраницы.Исключая),Район,МКД,Организация);
	//Если Не МКДОткрыт тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный многоквартирный дом закрыт!");
	//	
	//	Отказ = истина;
	//КонецЕсли;	
	//
	//
	//Если Не Отказ Тогда
	//	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьФормуУправленияМКД(Движения, ДанныеШапки);
	//КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли