#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	// Параметры абонента.
	энргРаботаСТочкамиУчетаСервер.УстановитьСостояниеЛицевогоСчетаРезультатЗапроса(РезультатСостояниеЛС(),Движения);//открываем лицевой счет
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоКомнатРезультатЗапроса(РезультатКоличествоКомнат(),Движения);
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоПрописанныхРезультатЗапроса(РезультатКоличествоПрописанных(),Движения);
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьГруппуПотребителейРезультатЗапроса(РезультатГруппыПотребителей(), Движения);
	энргРаботаСПараметрамиРасчетаАбонентаСервер.ЗаполнитьВидБлагоустростваРезультатЗапроса(РезультатВидыБлагоустройств(), Движения);
	
	// Данные точек учета.
	РезультатТочкиУчета 			= РезультатТочкиУчета();	 
	энргРаботаСТочкамиУчетаСервер.УстановитьВладельцаТочкиУчетаРезультатЗапроса(РезультатТочкиУчета,Движения);
	энргРаботаСТочкамиУчетаСервер.УстановитьАктивностьТочекАбонентаРезультатЗапроса(РезультатТочкиУчета,Движения);
	
	// Приборы точек учета.	
	РезультатПриборыУчета  			= РезультатПриборыУчета();
	энргРаботаСприборамиУчетаСервер.ЗаписатьСостояниеПрибораУчетаРезультатЗапроса(РезультатПриборыУчета,Движения);
	энргРаботаСприборамиУчетаСервер.ЗаписатьКоэффициентПУРезультатЗапроса(РезультатПриборыУчета,Движения);
	энргРаботаСприборамиУчетаСервер.УстановитьНомерПломбыПрибораУчетаРезультатЗапроса(РезультатПриборыУчета,Движения);
	энргРаботаСприборамиУчетаСервер.УстановитьВидДифференцированностиПриборовУчетаРезультатЗапроса(РезультатПриборыУчета,Движения);
	энргРаботаСприборамиУчетаСервер.ЗаписатьДатуПоверкиРезультатЗапроса(РезультатПриборыУчета,Движения);
		
	// Показания приборов учета.	
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(РезультатПоказанияПриборовУчета(),Движения);
	
	// Объем начислений.
	ЗаписатьОбъемНачислений();	
	
	// Оплата.
	ЗаписатьДанныеОплаты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатСостояниеЛС()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ФактическийПериод КАК Период,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Состояние КАК Состояние,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемСостояниеЛС.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемСостояниеЛС.ФактическийПериод КАК ФактическийПериод,
	|		энргЗагрузкаДанныхИзВнешнихСистемСостояниеЛС.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистемСостояниеЛС.Состояние КАК Состояние
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.СостояниеЛС КАК энргЗагрузкаДанныхИзВнешнихСистемСостояниеЛС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемСостояниеЛС.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемСостояниеЛС.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";	
	Возврат Запрос.Выполнить();
КонецФункции 

Функция РезультатКоличествоКомнат() 
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ФактическийПериод КАК Период,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоКомнат.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоКомнат.ФактическийПериод КАК ФактическийПериод,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоКомнат.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоКомнат.Количество КАК Количество
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.КоличествоКомнат КАК энргЗагрузкаДанныхИзВнешнихСистемКоличествоКомнат
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемКоличествоКомнат.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемКоличествоКомнат.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";	
	Возврат Запрос.Выполнить();   	
КонецФункции

Функция РезультатКоличествоПрописанных() 
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ФактическийПериод КАК Период,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоПрописанных.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоПрописанных.ФактическийПериод КАК ФактическийПериод,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоПрописанных.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистемКоличествоПрописанных.Количество КАК Количество
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.КоличествоПрописанных КАК энргЗагрузкаДанныхИзВнешнихСистемКоличествоПрописанных
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемКоличествоПрописанных.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемКоличествоПрописанных.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";	
	Возврат Запрос.Выполнить();   	
КонецФункции

Функция РезультатВидыБлагоустройств()
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ФактическийПериод КАК Период,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемВидыБлагоустройств.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемВидыБлагоустройств.ФактическийПериод КАК ФактическийПериод,
	|		энргЗагрузкаДанныхИзВнешнихСистемВидыБлагоустройств.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистемВидыБлагоустройств.ВидБлагоустройства КАК ВидБлагоустройства
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.ВидыБлагоустройств КАК энргЗагрузкаДанныхИзВнешнихСистемВидыБлагоустройств
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемВидыБлагоустройств.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемВидыБлагоустройств.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";	
	Возврат Запрос.Выполнить();	 	
КонецФункции

Функция РезультатГруппыПотребителей()
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ФактическийПериод КАК Период,
	|	энргАбоненты.Район,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.ГруппаПотребителей
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемГруппыПотребителей.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемГруппыПотребителей.ФактическийПериод КАК ФактическийПериод,
	|		энргЗагрузкаДанныхИзВнешнихСистемГруппыПотребителей.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистемГруппыПотребителей.ГруппаПотребителей КАК ВидБлагоустройства
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.ГруппыПотребителей КАК энргЗагрузкаДанныхИзВнешнихСистемГруппыПотребителей
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемГруппыПотребителей.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемГруппыПотребителей.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";	
	Возврат Запрос.Выполнить();	 	
КонецФункции

Функция РезультатТочкиУчета() 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ФактическийПериод КАК Период,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Состояние КАК Состояние,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.ФактическийПериод КАК ФактическийПериод,
	|		энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.Услуга КАК Услуга,
	|		энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.Состояние КАК Состояние
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.ТочкиУчета КАК энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемТочкиУчета.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";	
	Возврат Запрос.Выполнить();

	
КонецФункции

Функция РезультатПоказанияПриборовУчета()
	
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Текст 		= 
	"ВЫБРАТЬ
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.Показание КАК Показание,
	|	ВложенныйЗапрос.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВложенныйЗапрос.КС КАК КС,
	|	ВложенныйЗапрос.Переворот КАК Переворот,
	|	ВложенныйЗапрос.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.Период КАК Период,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.Показания КАК Показание,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.КС КАК КС,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.Переворот КАК Переворот,
	|		энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.ПоказанияПриборовУчета КАК энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &Ссылка)
	|				И (НЕ энргЗагрузкаДанныхИзВнешнихСистемПоказанияПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";  
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция РезультатПриборыУчета()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ФактическийПериод КАК ФактическийПериод,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Состояние КАК Состояние,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.НомерПломбы КАК НомерПломбы,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗагрузкаДанныхИзВнешнихСистем.ПериодНачисления КАК ПериодНачисления,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.ПериодРегистрации КАК ПериодРегистрации,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.ФактическийПериод КАК ФактическийПериод,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.Абонент КАК Абонент,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.ПриборУчета КАК ПриборУчета,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.Состояние КАК Состояние,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.ДатаПоверки КАК ДатаПоверки,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.КоэффициентПУ КАК КоэффициентПУ,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.НомерПломбы КАК НомерПломбы,
	|		энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.ВидДифференцированности КАК ВидДифференцированности
	|	ИЗ
	|		Документ.энргЗагрузкаДанныхИзВнешнихСистем.ПриборыТочекУчета КАК энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргЗагрузкаДанныхИзВнешнихСистем КАК энргЗагрузкаДанныхИзВнешнихСистем
	|			ПО энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.Ссылка = энргЗагрузкаДанныхИзВнешнихСистем.Ссылка
	|				И (энргЗагрузкаДанныхИзВнешнихСистемПриборыТочекУчета.Ссылка = &ссылка)
	|				И (энргЗагрузкаДанныхИзВнешнихСистем.Ссылка = &ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка";	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ЗаписатьОбъемНачислений()
	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.МКД КАК МКД,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.Ссылка КАК Ссылка,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.НомерСтроки КАК НомерСтроки,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.Абонент КАК Абонент,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.Услуга КАК Услуга,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ВидНачисления КАК ВидНачисления,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.СпособНачисления КАК СпособНачисления,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ПриборУчета КАК ПриборУчета,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.Поставщик КАК Поставщик,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.Сумма КАК Сумма,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.НачалоПериода КАК НачалоПериода,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.КонецПериода КАК КонецПериода,
	|	энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.ПериодРегистрации КАК ПериодРегистрации,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	Документ.энргЗагрузкаДанныхИзВнешнихСистем.ОбъемыНачислений КАК энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.Абонент = энргАбоненты.Ссылка
	|			И (энргЗагрузкаДанныхИзВнешнихСистемОбъемыНачислений.Ссылка = &ссылка)";
	
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	НаборОбъемы 						= Движения.энргОбъемНачислений;
	НаборВзаиморасчеты 					= Движения.энргВзаиморасчеты;
	НаборВзаиморасчетыПоМесяцам 		= Движения.энргВзаиморасчетыПоМесяцам;
	
	ПоСреднему 							= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	СреднееПоНормативу  				= Перечисления.энргСпособНачислений.СреднееПоНормативу;
	
	Пока Выборка.Следующий() цикл
		
		ЗаписьОбъемы 					= НаборОбъемы.Добавить(); 
		ЗаполнитьЗначенияСвойств(ЗаписьОбъемы,Выборка);
		
		ЗаписьВзаиморасчеты 			= НаборВзаиморасчеты.ДобавитьПриход(); 
		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчеты,Выборка);

		ЗаписьВзаиморасчетыПоМесяцам 	= НаборВзаиморасчетыПоМесяцам.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчеты,Выборка); 
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаписатьДанныеОплаты() 
	
	Запрос 								= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 						=
	"ВЫБРАТЬ
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.МКД КАК МКД,
	|	энргЗагрузкаДанныхИзВнешнихСистемОплата.Ссылка КАК Ссылка,
	|	энргЗагрузкаДанныхИзВнешнихСистемОплата.НомерСтроки КАК НомерСтроки,
	|	энргЗагрузкаДанныхИзВнешнихСистемОплата.Абонент КАК Абонент,
	|	энргЗагрузкаДанныхИзВнешнихСистемОплата.Период КАК Период,
	|	энргЗагрузкаДанныхИзВнешнихСистемОплата.ПериодНачисления КАК ПериодНачисления,
	|	энргЗагрузкаДанныхИзВнешнихСистемОплата.СуммаОплаты КАК СуммаОплаты,
	|	энргЗагрузкаДанныхИзВнешнихСистемОплата.Услуга КАК Услуга,
	|	энргАбоненты.Организация КАК Организация
	|ИЗ
	|	Документ.энргЗагрузкаДанныхИзВнешнихСистем.Оплата КАК энргЗагрузкаДанныхИзВнешнихСистемОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргЗагрузкаДанныхИзВнешнихСистемОплата.Абонент = энргАбоненты.Ссылка
	|			И (энргЗагрузкаДанныхИзВнешнихСистемОплата.Ссылка = &ссылка)";

	НаборВзаиморасчеты 					= Движения.энргВзаиморасчеты;
	НаборВзаиморасчетыПоМесяцам 		= Движения.энргВзаиморасчетыПоМесяцам;
	
	Результат 							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		ЗаписьВзаиморасчеты 			= НаборВзаиморасчеты.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчеты,Выборка);
		
		ЗаписьВзаиморасчетыПоМесяцам	= НаборВзаиморасчетыПоМесяцам.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(ЗаписьВзаиморасчетыПоМесяцам,Выборка); 		
	КонецЦикла;    
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли