#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	перем КлючПомещения;
	Если Параметры.Свойство("Строение") И ЗначениеЗаполнено(Параметры.Строение) и КлючПомещения = Неопределено Тогда
		Строение = Параметры.Строение; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Строение",Строение,ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли
КонецПроцедуры

#КонецОбласти