////////////////////////////////////////////////////////////////////////////////
// СотрудникиВнутреннийКлиент: методы, обслуживающие работу формы сотрудника.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ДокументыФизическихЛицВидДокументаПриИзменении(Форма) Экспорт
	
	СотрудникиКлиентРасширенный.ДокументыФизическихЛицВидДокументаПриИзменении(Форма);
	
КонецПроцедуры

Процедура ДокументыФизическихЛицСерияПриИзменении(Форма, Элемент) Экспорт
	
	СотрудникиКлиентРасширенный.ДокументыФизическихЛицСерияПриИзменении(Форма, Элемент);
	
КонецПроцедуры

Процедура ДокументыФизическихЛицНомерПриИзменении(Форма, Элемент) Экспорт
	
	СотрудникиКлиентРасширенный.ДокументыФизическихЛицНомерПриИзменении(Форма, Элемент);
	
КонецПроцедуры

#КонецОбласти
