#Область ОбработчикиСобытий

//{{MRG[ <-> ]
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ..
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ.
//}}MRG[ <-> ]

//{{MRG[ <-> ]
// Функиця получает список документов и справочников объектов метаданных..
// ..
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// Функиця получает список документов и справочников объектов метаданных.
//// .
//}}MRG[ <-> ]
&НаСервере
Функция ПолучитьСписокДокИСпр()
	
	СписокДокументов = Новый СписокЗначений;
	СписокСправочников = Новый СписокЗначений;
		
	Для каждого Объект Из Метаданные.Документы Цикл
		Попытка
			Значение = Документы[Объект.Имя].ПустаяСсылка();
			Представление = ?(Объект.Синоним = "", Объект.Имя, Объект.Синоним);
			СписокДокументов.Добавить(Значение, Представление);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	Для каждого Объект Из Метаданные.Справочники Цикл
		Попытка
			Значение = Справочники[Объект.Имя].ПустаяСсылка();
			Представление = ?(Объект.Синоним = "", Объект.Имя, Объект.Синоним);
			СписокСправочников.Добавить(Значение, Представление);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	СписокДокументов.СортироватьПоПредставлению();
	СписокСправочников.СортироватьПоПредставлению();
	
	РезультатСтруктура = Новый Структура("СписокДокументов,СписокСправочников", СписокДокументов, СписокСправочников);
	
	Возврат РезультатСтруктура;  
	
КонецФункции

//{{MRG[ <-> ]
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ..
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.
//}}MRG[ <-> ]

//{{MRG[ <-> ]
// Процедура - обработчик события "ПриОткрытии" формы...
// ..
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// Процедура - обработчик события "ПриОткрытии" формы..
//// .
//}}MRG[ <-> ]
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтруктураСписки = ПолучитьСписокДокИСпр();
	СписокДокументов = СтруктураСписки.СписокДокументов;
	СписокСправочников = СтруктураСписки.СписокСправочников;
	
КонецПроцедуры

//{{MRG[ <-> ]
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ..
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.
//}}MRG[ <-> ]

//{{MRG[ <-> ]
// Процедура - обработчик события "Выбор" элемента формы...
// ..
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// Процедура - обработчик события "Выбор" элемента формы..
//// .
//}}MRG[ <-> ]
&НаКлиенте
Процедура СписокСправочниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Результат = Новый Структура("СсылкаНаОбъект,Представление,Класс", Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.Представление, "Справочник");
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

//{{MRG[ <-> ]
// Процедура - обработчик события "Выбор" элемента формы...
// ..
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//// Процедура - обработчик события "Выбор" элемента формы..
//// .
//}}MRG[ <-> ]
&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Результат = Новый Структура("СсылкаНаОбъект,Представление,Класс", Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.Представление, "Документ");
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры
#КонецОбласти
