#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если не ЭтапПИД = Документы.энргЭтапПретензионноИсковойДеятельности.ПервыйЭтап_ПИД() тогда
		ПроверяемыеРеквизиты.добавить("Основание");
	КонецЕсли;  	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
			
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();	
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ЭтапУжеПройден() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту """ + Абонент + """ этап """ + ЭтапПИД + """ уже пройден");
		Отказ 				= истина;
		Возврат;
	КонецЕсли; 
	
	Запись 						  = Движения.энргЭтапыПретензионноИсковойДеятельности.Добавить();
	Запись.Абонент 				  = Абонент;
	Запись.Период				  = Дата;
	Запись.Этап					  = ЭтапПИД;
	Запись.Поставщик			  = Поставщик;
	Запись.НачалоПериода		  = ПериодЗадолженностиНачало;
	Запись.КонецПериода			  = ПериодЗадолженностиКонец;
	Запись.ДатаСледЭтапа		  = ДатаСледЭтапа;
	Запись.Ответственный		  = Ответственный;
	Запись.ПрекращенаДеятельность = ПрекращенаДеятельность;
	Запись.Организация		 	  = Организация;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Дата,Номер,ПериодНачисления");
	
	ПредыдущийЭтап 									= ДанныеЗаполнения.ЭтапПИД; 
	ЭтапПИД  										= СледующийЭтапПИД(ПредыдущийЭтап);
	Основание 										= ДанныеЗаполнения;
	
	Если ЭтапПИД = Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_РешениеСуда тогда
		// Заполняем табличную часть
		Долги.Очистить();
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаГоспошлина) тогда
			СтрокаТЧ  								= Долги.Добавить();
			СтрокаТЧ.ВидДолга 						= "Гос пошлина";
			СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаГоспошлина;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаПеня) тогда
			СтрокаТЧ  								= Долги.Добавить();
			СтрокаТЧ.ВидДолга 						= "Пеня";
			СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаПеня;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаЗадолженности) тогда
			СтрокаТЧ  								= Долги.Добавить();
			СтрокаТЧ.ВидДолга 						= "Сумма основного долга";
			СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаЗадолженности;
		КонецЕсли; 
	КонецЕсли; 	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДатуСледЭтапа() Экспорт 

	Если Не ЗначениеЗаполнено(ЭтапПИД) Или Не ЗначениеЗаполнено(Организация) Или ЗначениеЗаполнено(ДатаСледЭтапа) Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;

	ТекДата = Дата;
	Если Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата = ТекущаяДатаСеанса();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСрокиЭтаповПИДСрезПоследних.Срок КАК Срок
		|ИЗ
		|	РегистрСведений.энргСрокиЭтаповПИД.СрезПоследних(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Этап = &Этап) КАК бестСрокиЭтаповПИДСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Этап", ЭтапПИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат НачалоДня(ТекДата) + Выборка.Срок * 24 * 60 * 60;
	Иначе
		Возврат НачалоДня(ТекДата) + 30 * 24 * 60 * 60;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СледующийЭтапПИД(ПредыдущийЭтап)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПредыдущийЭтап",ПредыдущийЭтап);
	Запрос.Текст 	="ВЫБРАТЬ
	             	 |	энргВидыОперацийПИД.Ссылка КАК Этап
	             	 |ИЗ
	             	 |	(ВЫБРАТЬ
	             	 |		МИНИМУМ(энргВидыОперацийПИД.Порядок) КАК Порядок
	             	 |	ИЗ
	             	 |		Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	             	 |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             	 |				энргВидыОперацийПИД.Порядок КАК Порядок
	             	 |			ИЗ
	             	 |				Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	             	 |			ГДЕ
	             	 |				энргВидыОперацийПИД.Ссылка = &ПредыдущийЭтап) КАК ВложенныйЗапрос
	             	 |			ПО (ВложенныйЗапрос.Порядок < энргВидыОперацийПИД.Порядок)) КАК ВложенныйЗапрос
	             	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
	             	 |		ПО ВложенныйЗапрос.Порядок = энргВидыОперацийПИД.Порядок";
	результат  = Запрос.Выполнить();
	Если результат.Пустой() тогда
		Возврат Справочники.энргВидыОперацийПИД.ПустаяСсылка();
	иначе
		Выборка = результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Этап;
	КонецЕсли; 
КонецФункции 

Функция ЭтапУжеПройден()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Абонент",		Абонент);
	Запрос.УстановитьПараметр("Этап",			ЭтапПИД);
	Запрос.УстановитьПараметр("НачалоПериода",	ПериодЗадолженностиНачало);
	Запрос.УстановитьПараметр("КонецПериода",	ПериодЗадолженностиКонец);
	Запрос.УстановитьПараметр("ТекДок",			Ссылка);
	Запрос.УстановитьПараметр("Поставщик",		Поставщик);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргЭтапыПретензионноИсковойДеятельности.Период
	|ИЗ
	|	РегистрСведений.энргЭтапыПретензионноИсковойДеятельности КАК энргЭтапыПретензионноИсковойДеятельности
	|ГДЕ
	|	энргЭтапыПретензионноИсковойДеятельности.Абонент = &Абонент
	|	И НЕ энргЭтапыПретензионноИсковойДеятельности.Регистратор = &ТекДок
	|	И энргЭтапыПретензионноИсковойДеятельности.Этап = &Этап
	|	И энргЭтапыПретензионноИсковойДеятельности.Поставщик = &Поставщик
	|	И (НЕ энргЭтапыПретензионноИсковойДеятельности.НачалоПериода > &КонецПериода
	|			ИЛИ НЕ энргЭтапыПретензионноИсковойДеятельности.КонецПериода > &НачалоПериода
	|			ИЛИ энргЭтапыПретензионноИсковойДеятельности.НачалоПериода > &НачалоПериода
	|				И энргЭтапыПретензионноИсковойДеятельности.КонецПериода < &КонецПериода)";	
	
	Результат  = Запрос.Выполнить();
	Возврат не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли