#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если НЕ ВидОперации = Перечисления.энргВидыОпераций.энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия Тогда 
		
		НепроверяемыеРеквизиты.Добавить("ДокументОснование");		
		
	КонецЕсли;
	
	энргПроведениеСервер.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЕстьПринятыеПоказанияДатойПозже() Тогда  
		Отказ = Истина;
		Комментарий = НСтр("ru = 'В системе зарегистрированы показания со статусом ""Приняты"" датой позже текущего документа'");
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	Движения.энргКоличествоДнейИспользованияУслугПриОтсутствии.Записать();
	Движения.энргКоличествоДнейИспользованияУслугПриОтсутствии.Записывать = Истина;	
	
	ЭтоДокКорректировка = ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия");
	
	ПроверитьПересечениеПериодов(Отказ, ЭтоДокКорректировка);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	Ошибки = Новый Массив;
	ШаблонОшибки = "За период начисления %1 у ЛС уже заведено временное отсутствие, откорректируйте период или создайте документ с видом операции ""Корректировка временного отсутствия""";
	РезультатЗапроса = ПолучитьТаблицуВременногоОтсутствия();
	Выборка = РезультатЗапроса.Выбрать(); 	
	Пока Выборка.Следующий() Цикл
		
		//Если НЕ ЭтоДокКорректировка и НЕ Выборка.ЭтоКорректировка и Выборка.Количество < 0 Тогда			
		//	ТекстОшибки = СтрШаблон(ШаблонОшибки, Формат(Выборка.ПериодНачисления, "ДФ=dd.MM.yyyy"));
		//	Ошибки.Добавить(ТекстОшибки);
		//	Отказ = Истина;
		//	Продолжить;
		//КонецЕсли;
		//
		//Если Отказ Тогда
		//	Продолжить;
		//КонецЕсли;
		
		НоваяСтрока = Движения.энргКоличествоДнейИспользованияУслугПриОтсутствии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Если Отказ и Ошибки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрСоединить(Ошибки, Символы.ПС));
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуВременногоОтсутствия() Экспорт
	МенеджерДокумента 		= Документы.энргРегистрацияВременногоОтсутствия;
	ОписаниеДопПараметров	= "Организация, Район, НачалоПериодаНачислений, КонецПериодаНачислений, ПериодС, ПериодПо, ДокументОснование";
	
	НачалоПериодаНачислений = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПериодС, Организация, Район);
	КонецПериодаНачислений 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПериодПо, Организация, Район);	
	
	ТаблицаДней = Новый ТаблицаЗначений;
	ТаблицаДней.Колонки.Добавить("ПериодНачисления"		, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДней.Колонки.Добавить("КоличествоДнейРаботы"	, ОбщегоНазначения.ОписаниеТипаЧисло(2));	
	ТаблицаДней.Колонки.Добавить("ДнейВПериоде"			, ОбщегоНазначения.ОписаниеТипаЧисло(2));	
	
	Если НачалоПериодаНачислений = КонецПериодаНачислений Тогда
		ДопПараметры = Новый Структура(ОписаниеДопПараметров, Организация, Район, НачалоПериодаНачислений, КонецПериодаНачислений, ПериодС, ПериодПо, ДокументОснование);
		МенеджерДокумента.ДобавитьЗаписиПриОтсутствииВГраницеТекущегоПериода(ТаблицаДней, ДопПараметры);
	Иначе
		ПерваяСтрока = Истина;
		Пока НачалоПериодаНачислений <= КонецПериодаНачислений Цикл
			ДопПараметры 			= Новый Структура(ОписаниеДопПараметров, Организация, Район, НачалоПериодаНачислений, КонецПериодаНачислений, ПериодС, ПериодПо);
			МенеджерДокумента.ДобавитьЗаписиПриОтсутствииБольшеОдногоПериодаНачислений(ТаблицаДней, ДопПараметры, ПерваяСтрока);
			НачалоПериодаНачислений = ДобавитьМесяц(НачалоПериодаНачислений, 1);
		КонецЦикла;		
	КонецЕсли; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСДнями.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаСДнями.КоличествоДнейРаботы КАК КоличествоДнейРаботы,
	|	ТаблицаСДнями.ДнейВПериоде КАК ДнейВПериоде
	|ПОМЕСТИТЬ ДанныеПоДням
	|ИЗ
	|	&ТаблицаСДнями КАК ТаблицаСДнями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргРегистрацияВременногоОтсутствия.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(энргРегистрацияВременногоОтсутствия.ДатаФактическогоСобытия, ДЕНЬ)
	|		ИНАЧЕ энргРегистрацияВременногоОтсутствия.Дата
	|	КОНЕЦ КАК Период,
	|	энргРегистрацияВременногоОтсутствия.Организация КАК Организация,
	|	энргРегистрацияВременногоОтсутствия.Район КАК Район,
	|	&Строение КАК Строение,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	энргРегистрацияВременногоОтсутствия.КлючПомещения КАК КлючПомещения,
	|	&Помещение КАК Помещение,
	|	энргРегистрацияВременногоОтсутствия.ВидОперации КАК ВидОперации,
	|	энргРегистрацияВременногоОтсутствия.ДокументОснование.ПериодС КАК ДокументОснованиеПериодС,
	|	энргРегистрацияВременногоОтсутствия.ДокументОснование.ПериодПо КАК ДокументОснованиеПериодПо,
	|	энргРегистрацияВременногоОтсутствия.ДокументОснование.ПериодНачисления КАК ДокументОснованиеПериодНачисления,
	|	энргРегистрацияВременногоОтсутствия.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	Документ.энргРегистрацияВременногоОтсутствия КАК энргРегистрацияВременногоОтсутствия
	|ГДЕ
	|	энргРегистрацияВременногоОтсутствия.Ссылка В(&мДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.Период КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Строение КАК Строение,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ДанныеПоДням.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.ЧастныйСектор КАК ЧастныйСектор,
	|	Шапка.Помещение КАК Помещение,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	ДанныеПоДням.КоличествоДнейРаботы КАК Количество,
	|	Шапка.ДокументОснованиеСсылка КАК ДокументОснованиеСсылка,
	|	ДанныеПоДням.ДнейВПериоде КАК ДнейВПериоде
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Шапка КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоДням КАК ДанныеПоДням
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления КАК ПериодНачисления,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация КАК Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район КАК Район,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение КАК Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение КАК Помещение,
	|	СУММА(энргКоличествоДнейИспользованияУслугПриОтсутствии.Количество) КАК Количество
	|ПОМЕСТИТЬ КоличествоДнейСтронирования
	|ИЗ
	|	РегистрНакопления.энргКоличествоДнейИспользованияУслугПриОтсутствии КАК энргКоличествоДнейИспользованияУслугПриОтсутствии
	|ГДЕ
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Регистратор = &ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления КАК ПериодНачисления,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация КАК Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район КАК Район,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение КАК Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение КАК Помещение,
	|	СУММА(энргКоличествоДнейИспользованияУслугПриОтсутствии.Количество) КАК Количество
	|ПОМЕСТИТЬ КоличествоДнейСтронированияДокументовОдногоПериодаНачисления
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргКоличествоДнейИспользованияУслугПриОтсутствии КАК энргКоличествоДнейИспользованияУслугПриОтсутствии
	|		ПО (энргКоличествоДнейИспользованияУслугПриОтсутствии.Период <= &Период)
	|			И (энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение = &Строение)
	|			И (энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение = &Помещение)
	|			И ДанныеДокумента.ПериодНачисления = энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления
	|			И ДанныеДокумента.Организация = энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация
	|			И ДанныеДокумента.Район = энргКоличествоДнейИспользованияУслугПриОтсутствии.Район
	|			И ДанныеДокумента.ЧастныйСектор = энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор
	|			И ДанныеДокумента.Строение = энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение
	|			И ДанныеДокумента.Помещение = энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокументаКДобавлению.Период КАК Период,
	|	ТаблицаДанныхДокументаКДобавлению.Организация КАК Организация,
	|	ТаблицаДанныхДокументаКДобавлению.Район КАК Район,
	|	ТаблицаДанныхДокументаКДобавлению.Строение КАК Строение,
	|	ТаблицаДанныхДокументаКДобавлению.КлючПомещения КАК КлючПомещения,
	|	ТаблицаДанныхДокументаКДобавлению.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаДанныхДокументаКДобавлению.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаДанныхДокументаКДобавлению.Помещение КАК Помещение,
	|	ТаблицаДанныхДокументаКДобавлению.Количество КАК Количество
	|ИЗ
	|	ДанныеДокумента КАК ТаблицаДанныхДокументаКДобавлению
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	Стронирование.Организация,
	|	Стронирование.Район,
	|	Стронирование.Строение,
	|	&КлючПомещения,
	|	Стронирование.ПериодНачисления,
	|	Стронирование.ЧастныйСектор,
	|	Стронирование.Помещение,
	|	СУММА(Стронирование.Количество)
	|ИЗ
	|	(ВЫБРАТЬ
	|		КоличествоДнейСтронирования.ПериодНачисления КАК ПериодНачисления,
	|		КоличествоДнейСтронирования.Организация КАК Организация,
	|		КоличествоДнейСтронирования.Район КАК Район,
	|		КоличествоДнейСтронирования.ЧастныйСектор КАК ЧастныйСектор,
	|		КоличествоДнейСтронирования.Строение КАК Строение,
	|		КоличествоДнейСтронирования.Помещение КАК Помещение,
	|		-КоличествоДнейСтронирования.Количество КАК Количество
	|	ИЗ
	|		КоличествоДнейСтронирования КАК КоличествоДнейСтронирования
	|	ГДЕ
	|		КоличествоДнейСтронирования.Количество > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КоличествоДнейСтронирования.ПериодНачисления,
	|		КоличествоДнейСтронирования.Организация,
	|		КоличествоДнейСтронирования.Район,
	|		КоличествоДнейСтронирования.ЧастныйСектор,
	|		КоличествоДнейСтронирования.Строение,
	|		КоличествоДнейСтронирования.Помещение,
	|		-1
	|	ИЗ
	|		КоличествоДнейСтронирования КАК КоличествоДнейСтронирования
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
	|			ПО КоличествоДнейСтронирования.ПериодНачисления = ДанныеДокумента.ПериодНачисления
	|				И КоличествоДнейСтронирования.Организация = ДанныеДокумента.Организация
	|				И КоличествоДнейСтронирования.Район = ДанныеДокумента.Район
	|				И КоличествоДнейСтронирования.ЧастныйСектор = ДанныеДокумента.ЧастныйСектор
	|				И КоличествоДнейСтронирования.Строение = ДанныеДокумента.Строение
	|				И КоличествоДнейСтронирования.Помещение = ДанныеДокумента.Помещение
	|	ГДЕ
	|		ДанныеДокумента.Период ЕСТЬ NULL) КАК Стронирование
	|
	|СГРУППИРОВАТЬ ПО
	|	Стронирование.Район,
	|	Стронирование.ЧастныйСектор,
	|	Стронирование.ПериодНачисления,
	|	Стронирование.Строение,
	|	Стронирование.Организация,
	|	Стронирование.Помещение";
	
	
	ДанныеСтроения = ДополнительныеСвойства.ДанныеСтроения;
	Запрос.УстановитьПараметр("Период"				, Дата);
	Запрос.УстановитьПараметр("КлючПомещения"		, КлючПомещения);
	Запрос.УстановитьПараметр("мДокументы"			, Ссылка);
	Запрос.УстановитьПараметр("ТаблицаСДнями"		, ТаблицаДней); 	
	Запрос.УстановитьПараметр("ЧастныйСектор"		, ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение"			, ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("Помещение"			, ДанныеСтроения.Помещение);
	Запрос.УстановитьПараметр("ДокументОснование"	, ДокументОснование.Ссылка);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;	
	
КонецФункции 

Процедура ПроверитьПересечениеПериодов(Отказ, ЭтоКорректировка)
	
	СсылкиИсключения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка);	
	Если ЭтоКорректировка Тогда 
		СсылкиИсключения.Добавить(ДокументОснование);
	КонецЕсли;  	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРегистрацияВременногоОтсутствия.Ссылка КАК Ссылка,
		|	энргРегистрацияВременногоОтсутствия.ПериодС КАК ПериодС,
		|	энргРегистрацияВременногоОтсутствия.ПериодПо КАК ПериодПо,
		|	энргРегистрацияВременногоОтсутствия.Дата КАК Дата
		|ПОМЕСТИТЬ ДокументыРВОАбонента
		|ИЗ
		|	Документ.энргРегистрацияВременногоОтсутствия КАК энргРегистрацияВременногоОтсутствия
		|ГДЕ
		|	энргРегистрацияВременногоОтсутствия.Дата <= &Период
		|	И энргРегистрацияВременногоОтсутствия.Абонент = &Абонент
		|	И НЕ энргРегистрацияВременногоОтсутствия.Ссылка В (&СсылкиИсключения)
		|	И энргРегистрацияВременногоОтсутствия.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Ссылка) КАК СсылкаСтрокой
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Дата КАК Дата,
		|		МАКСИМУМ(ДокументыРВОАбонента.Ссылка) КАК Ссылка
		|	ИЗ
		|		(ВЫБРАТЬ
		|			МАКСИМУМ(ДокументыРВОАбонента.Дата) КАК Дата
		|		ИЗ
		|			ДокументыРВОАбонента КАК ДокументыРВОАбонента) КАК ВложенныйЗапрос
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыРВОАбонента КАК ДокументыРВОАбонента
		|			ПО ВложенныйЗапрос.Дата = ДокументыРВОАбонента.Дата
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Дата) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыРВОАбонента КАК ДокументыРВОАбонента
		|		ПО ВложенныйЗапрос.Дата = ДокументыРВОАбонента.Дата
		|			И ВложенныйЗапрос.Ссылка = ДокументыРВОАбонента.Ссылка
		|			И (ДокументыРВОАбонента.ПериодС <= &ПериодПО)
		|			И (ДокументыРВОАбонента.ПериодПо >= &ПериодС)";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("СсылкиИсключения", СсылкиИсключения);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ПериодПО", ПериодПо);
	Запрос.УстановитьПараметр("ПериодС", ПериодС);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	Отказ = Истина;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю("Период отсутствия абонента пересекается с границей документа: " + Выборка.СсылкаСтрокой);
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
		
	Возврат МассивПлательщиков;
КонецФункции

Функция ЕстьПринятыеПоказанияДатойПозже()
	
	ПараметрыПроверки = Новый Структура("Дата, Организация, Район, КлючПомещения, Ссылка");
	ЗаполнитьЗначенияСвойств(ПараметрыПроверки, ЭтотОбъект); 
	
	ГраницыРасчетногоПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления); 
	ПараметрыПроверки.Дата = Макс(ПериодС, ГраницыРасчетногоПериода.НачалоОП);	
	
	Схема = Неопределено;
	ПараметрыОтбора		= Новый Структура;
	ПараметрыВТ 		= Новый Массив; 	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения"	, "КлючПомещения")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("АбонентВладелец"	, "КлючПомещения")));
	
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	ПараметрыОтбора.Вставить("Период"		, Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, ПараметрыОтбора); 
	
	ПараметрыЗапроса 	= Новый Структура;	
	ПараметрыЗапроса.Вставить("Период"			, Дата);
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	ТЗ = РезультатЗапроса.Выгрузить();	
	Возврат энргРаботаСПоказаниямиПриборовУчетаСервер.ЕстьПринятыеПоказанияДатойПозже(ТЗ.ВыгрузитьКолонку("ПриборУчета"), ПараметрыПроверки);    
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли