
#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ФормулаРасчетаНормативаПотребленияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СоставУслуги 				= Новый Массив;
	Для Каждого СтрокаСостава Из Объект.Услуги Цикл
		СоставУслуги.Добавить(СтрокаСостава.Услуга);
	КонецЦикла; 	
		
	Оповещение 					= Новый ОписаниеОповещения("НастройкаФормулыРасчетаЗавершение",ЭтаФорма,Новый Структура);
	ПараметрыФормы 				= Новый Структура;
	ПараметрыФормы.Вставить("Услуга", 					Объект.Ссылка);
	ПараметрыФормы.Вставить("СоставУслуги", 			СоставУслуги);
	ПараметрыФормы.Вставить("ОДН", 						Истина);
	ПараметрыФормы.Вставить("ПредставлениеФормулы", 	Объект.ФормулаРасчетаНормативаПотребленияПредставление);
	
	ОткрытьФорму("ОбщаяФорма.энргНастройкаФормулРасчета",ПараметрыФормы,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормулыРасчетаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатЗакрытия.Свойство("ПредставлениеФормулы") ИЛИ Не РезультатЗакрытия.Свойство("ФормулаРасчета") Тогда
		Возврат;
	КонецЕсли;
		
	Объект.ФормулаРасчетаНормативаПотребленияПредставление 	= РезультатЗакрытия.ПредставлениеФормулы;
	Объект.ФормулаРасчетаНормативаПотребления 				= РезультатЗакрытия.ФормулаРасчета;
		
КонецПроцедуры

#КонецОбласти
