#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Перем МассивФайлов;
	
	Если ЗначениеЗаполнено(Дело) И ДополнительныеСвойства.Свойство("АдресаФайлов", МассивФайлов) Тогда
		Для каждого ТекФайл Из МассивФайлов Цикл
			РасширениеФайла  = Справочники.энргКомментарииКСудебномуДелу.ПолучитьРасширениеФайла(ТекФайл.Представление);
			ИмяБезРасширения = СтрЗаменить(ТекФайл.Представление, "." + РасширениеФайла, "");
			
			ДатаМодификацииФайла		= ТекущаяДатаСеанса();
			ПараметрыДобавляемогоФайла	= Новый Структура;
			ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов",	 			?(СудебноеЗаседание, Дело, Дело.СтартоваяЗадача));
			ПараметрыДобавляемогоФайла.Вставить("Автор",						Строка(ПараметрыСеанса.ТекущийПользователь));
			ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения",				ИмяБезРасширения);
			ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки",			РасширениеФайла);
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения",				МестноеВремя(ДатаМодификацииФайла, ЧасовойПоясСеанса()));
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное",	ДатаМодификацииФайла);
			НовФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, 	ТекФайл.Значение);
			
			Если ЗначениеЗаполнено(НовФайл) Тогда
				СтрокаТЧ = Файлы.Добавить();
				СтрокаТЧ.Файл = НовФайл;              
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли