#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задает расширенные настройки отчетов конфигурации.
//
// Параметры:
//	 Настройки - ТаблицаЗначений - коллекция предопределенных вариантов отчетов
//	 НастройкиОтчета - Структура
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Печать приложений к договору'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьПриложение2_1(ТабДок, ПараметрыОтчета, ОтчетПоМощности) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГарантированныеОбъемыСрезПоследних.Месяц КАК Месяц,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестРежимыПотребленияСрезПоследних.РежимЭлСнабжения КАК РежимЭлСнабжения,
	|	бестРежимыПотребленияСрезПоследних.ПотреблениеВРабДни КАК ПотреблениеВРабДни,
	|	бестРежимыПотребленияСрезПоследних.ПотреблениеВРВыхДни КАК ПотреблениеВРВыхДни,
	|	СУММА(энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность) КАК МаксимальнаяМощность,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ТаблицаДляСвязывания
	|ИЗ
	|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета В (&мОбъектыРасчета)) КАК бестДоговорыТочекУчетаСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестГарантированныеОбъемыСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО бестГарантированныеОбъемыСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|				И (энргВидыУслуг.бестИспользоватьРасчетПоМощности = &ОтчетПоМощности)
	|		ПО бестДоговорыТочекУчетаСрезПоследних.Организация = бестГарантированныеОбъемыСрезПоследних.Организация
	|			И бестДоговорыТочекУчетаСрезПоследних.Район = бестГарантированныеОбъемыСрезПоследних.Район
	|			И бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета
	|			И (бестГарантированныеОбъемыСрезПоследних.Услуга = бестДоговорыТочекУчетаСрезПоследних.Услуга)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРежимыПотребления.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестРежимыПотребленияСрезПоследних
	|		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестРежимыПотребленияСрезПоследних.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТочкиПоставкиОбъектовРасчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТочкиПоставкиОбъектовРасчетаСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(&Период, ) КАК энргПараметрыТочекПоставкиСрезПоследних
	|			ПО бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ТочкаПоставки = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки
	|		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ОбъектРасчета
	|ГДЕ
	|	бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестГарантированныеОбъемыСрезПоследних.Месяц,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета,
	|	бестРежимыПотребленияСрезПоследних.РежимЭлСнабжения,
	|	бестРежимыПотребленияСрезПоследних.ПотреблениеВРабДни,
	|	бестРежимыПотребленияСрезПоследних.ПотреблениеВРВыхДни,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДляСвязывания.Месяц КАК Месяц,
	|	ВТ_ТаблицаДляСвязывания.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_ТаблицаДляСвязывания.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ТаблицаДляСвязывания.РежимЭлСнабжения КАК РежимЭлСнабжения,
	|	ВТ_ТаблицаДляСвязывания.ПотреблениеВРабДни КАК ПотреблениеВРабДни,
	|	ВТ_ТаблицаДляСвязывания.ПотреблениеВРВыхДни КАК ПотреблениеВРВыхДни,
	|	ВТ_ТаблицаДляСвязывания.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ТаблицаДляСвязывания КАК ВТ_ТаблицаДляСвязывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ТаблицаДляСвязывания.ОбъектРасчета = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.Месяц КАК Месяц,
	|	ВТ_КодОбъекта.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_КодОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_КодОбъекта.РежимЭлСнабжения КАК РежимЭлСнабжения,
	|	ВТ_КодОбъекта.ПотреблениеВРабДни КАК ПотреблениеВРабДни,
	|	ВТ_КодОбъекта.ПотреблениеВРВыхДни КАК ПотреблениеВРВыхДни,
	|	СУММА(ВТ_КодОбъекта.МаксимальнаяМощность) КАК МаксимальнаяМощность,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КодОбъекта.Месяц,
	|	ВТ_КодОбъекта.ОбъемУслуги,
	|	ВТ_КодОбъекта.ОбъектРасчета,
	|	ВТ_КодОбъекта.РежимЭлСнабжения,
	|	ВТ_КодОбъекта.ПотреблениеВРабДни,
	|	ВТ_КодОбъекта.ПотреблениеВРВыхДни,
	|	ВТ_КодОбъекта.КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета
	|ИТОГИ
	|	СУММА(ОбъемУслуги),
	|	МАКСИМУМ(РежимЭлСнабжения),
	|	МАКСИМУМ(ПотреблениеВРабДни),
	|	МАКСИМУМ(ПотреблениеВРВыхДни),
	|	МАКСИМУМ(МаксимальнаяМощность),
	|	МАКСИМУМ(КодОбъектаРасчета),
	|	МАКСИМУМ(НомерДоговора)
	|ПО
	|	ОбъектРасчета";
			
	Запрос.УстановитьПараметр("Договор", 			ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Организация", 		ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Период", 			ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("Район", 				ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("мОбъектыРасчета",	ПараметрыОтчета.ОбъектыРасчета);
	Запрос.УстановитьПараметр("ОтчетПоМощности",	ОтчетПоМощности);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если РезультатЗапроса[4].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_ДоговорныеВеличины");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапкаПодвал 					= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 						= РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДанные2       				= РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);                                                                                
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;
	
	Если ОтчетПоМощности Тогда
		ОбластьШапка.Параметры.Заголовок 		= "ДОГОВОРНЫЕ ЗНАЧЕНИЯ ЗАЯВЛЕННОЙ МОЩНОСТИ, В КВТ";
		ОбластьШапка.Параметры.НомерПриложения 	= "2";
	Иначе
		ОбластьШапка.Параметры.Заголовок 		= "1. ДОГОВОРНЫЕ ВЕЛИЧИНЫ ОТПУСКА ЭЛЕКТРОЭНЕРГИИ, КВТ.Ч., ВКЛЮЧАЯ СУБАБОНЕНТОВ ПО РЕЖИМУ 1:";
		ОбластьШапка.Параметры.НомерПриложения 	= "1";
	КонецЕсли;
	
	ТекКодОбъекта = Неопределено;
	
	ОбластьШапка.Параметры.КодОбъекта = "";
	Пока ВыборкаДанные2.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДанные2.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные2.НомерДоговора) + "_" + Строка(ВыборкаДанные2.КодОбъектаРасчета);
			Если КодОбъекта <> ТекКодОбъекта Тогда
				ОбластьШапка.Параметры.КодОбъекта = Строка(ОбластьШапка.Параметры.КодОбъекта) + ?(ЗначениеЗаполнено(ОбластьШапка.Параметры.КодОбъекта), ", ", "") + КодОбъекта;		
			КонецЕсли;
			ТекКодОбъекта = КодОбъекта;	
		КонецЕсли;	
	КонецЦикла;
		
	ТабДок.Вывести(ОбластьШапка);
	
	Если ОтчетПоМощности Тогда 
		ОбластьШапкаДоп  = Макет.ПолучитьОбласть("ШапкаМощность");
	Иначе
		ОбластьШапкаДоп  = Макет.ПолучитьОбласть("ШапкаЭЭ");
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапкаДоп);
	
	Пока ВыборкаДанные.Следующий() Цикл
	
		Если ОтчетПоМощности Тогда
			ОбластьДанные = Макет.ПолучитьОбласть("ДанныеМощность");
		Иначе
			ОбластьДанные = Макет.ПолучитьОбласть("ДанныеЭЭ");
			ОбластьДанные.Параметры.ВсегоЗаГод 			= ВыборкаДанные.ОбъемУслуги;
			ОбластьДанные.Параметры.ЭлектроПотребление 	= "" + ?(ЗначениеЗаполнено(ВыборкаДанные.ПотреблениеВРабДни), "Раб.дни " + ВыборкаДанные.ПотреблениеВРабДни + "%; ","") + ?(ЗначениеЗаполнено(ВыборкаДанные.ПотреблениеВРВыхДни), "Вых.дни " + ВыборкаДанные.ПотреблениеВРВыхДни + "%;","");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);
			ОбластьДанные.Параметры.КодОбъекта 			= КодОбъекта;	
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, ВыборкаДанные);		
		
		Выборка = ВыборкаДанные.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбластьДанные.Параметры["Объем" + Выборка.Месяц] = Выборка.ОбъемУслуги;
		КонецЦикла;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры

Процедура СформироватьПриложение1(ТабДок, ПараметрыОтчета) Экспорт
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение1ТочкиПрисоединения");

	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
	|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
	|		КОНЕЦ) КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
	|		КОНЕЦ) КАК ЮрАдресКонтрагента
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	энргДоговорыКонтрагентов.Ссылка,
	|	энргДоговорыКонтрагентов.Номер,
	|	энргДоговорыКонтрагентов.Дата,
	|	энргДоговорыКонтрагентов.Контрагент,
	|	энргДоговорыКонтрагентов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация,
	|	ВТ_ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.АктТП КАК АктТП,
	|	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	энргПараметрыТочекПоставкиСрезПоследних.АктРазграниченияБалансовойПринадлежности КАК АктРазграниченияБалансовойПринадлежности,
	|	энргПараметрыТочекПоставкиСрезПоследних.НапряжениеГБП КАК НапряжениеНаГБП,
	|	энргАктыТехнологическогоПрисоединения.ЗащитаНаВводе КАК ЗащитаНаВводе,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НеОтключаемый КАК НеОтключаемый,
	|	ЕСТЬNULL(энргАктыТехнологическогоПрисоединения.РаспредМощностьI, 0) КАК РаспредМощностьI,
	|	ЕСТЬNULL(энргАктыТехнологическогоПрисоединения.РаспредМощностьII, 0) КАК РаспредМощностьII,
	|	ЕСТЬNULL(энргАктыТехнологическогоПрисоединения.РаспредМощностьIII, 0) КАК РаспредМощностьIII,
	|	энргАктыТехнологическогоПрисоединения.СуммНоминальнаяМощность КАК СуммНоминальнаяМощность,
	|	энргАктыТехнологическогоПрисоединения.РаспредМощностьI + энргАктыТехнологическогоПрисоединения.РаспредМощностьII + энргАктыТехнологическогоПрисоединения.РаспредМощностьIII КАК СуммаМаксМощности,
	|	бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ВТ_ДляСвязывания
	|ИЗ
	|	РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета В (&мОбъектыРасчета)
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(&Период, Организация = &Организация
	|							И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
	|					ГДЕ
	|						бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор)) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(&Период, ) КАК энргПараметрыТочекПоставкиСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАктыТехнологическогоПрисоединения КАК энргАктыТехнологическогоПрисоединения
	|			ПО энргПараметрыТочекПоставкиСрезПоследних.АктТП = энргАктыТехнологическогоПрисоединения.Ссылка
	|		ПО бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
	|		ПО бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ОбъектРасчета = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДляСвязывания.ТочкаПоставки КАК ТочкаПоставки,
	|	ВТ_ДляСвязывания.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	ВТ_ДляСвязывания.АктТП КАК АктТП,
	|	ВТ_ДляСвязывания.СтруктураСети КАК СтруктураСети,
	|	ВТ_ДляСвязывания.АктРазграниченияБалансовойПринадлежности КАК АктРазграниченияБалансовойПринадлежности,
	|	ВТ_ДляСвязывания.НапряжениеНаГБП КАК НапряжениеНаГБП,
	|	ВТ_ДляСвязывания.ЗащитаНаВводе КАК ЗащитаНаВводе,
	|	ВТ_ДляСвязывания.НеОтключаемый КАК НеОтключаемый,
	|	ВТ_ДляСвязывания.РаспредМощностьI КАК РаспредМощностьI,
	|	ВТ_ДляСвязывания.РаспредМощностьII КАК РаспредМощностьII,
	|	ВТ_ДляСвязывания.РаспредМощностьIII КАК РаспредМощностьIII,
	|	ВТ_ДляСвязывания.СуммНоминальнаяМощность КАК СуммНоминальнаяМощность,
	|	ВТ_ДляСвязывания.СуммаМаксМощности КАК СуммаМаксМощности,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор,
	|	ВТ_ДляСвязывания.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ДляСвязывания КАК ВТ_ДляСвязывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ДляСвязывания.ОбъектРасчета = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.ТочкаПоставки КАК ТочкаПоставки,
	|	ВТ_КодОбъекта.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	ВТ_КодОбъекта.АктТП.Представление КАК АктТП,
	|	ВТ_КодОбъекта.СтруктураСети КАК СтруктураСети,
	|	ВТ_КодОбъекта.АктРазграниченияБалансовойПринадлежности.Представление КАК АктРазграниченияБалансовойПринадлежности,
	|	ВТ_КодОбъекта.НапряжениеНаГБП КАК НапряжениеНаГБП,
	|	ВТ_КодОбъекта.ЗащитаНаВводе КАК ЗащитаНаВводе,
	|	ВТ_КодОбъекта.НеОтключаемый КАК НеОтключаемый,
	|	ВТ_КодОбъекта.РаспредМощностьI КАК РаспредМощностьI,
	|	ВТ_КодОбъекта.РаспредМощностьII КАК РаспредМощностьII,
	|	ВТ_КодОбъекта.РаспредМощностьIII КАК РаспредМощностьIII,
	|	ВТ_КодОбъекта.СуммНоминальнаяМощность КАК СуммНоминальнаяМощность,
	|	ВТ_КодОбъекта.СуммаМаксМощности КАК СуммаМаксМощности,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_КодОбъекта.ОбъектРасчета КАК ОбъектРасчета
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета";
	
	Запрос.УстановитьПараметр("Договор", 			ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Организация", 		ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Период", 			ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("Район", 				ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("мОбъектыРасчета",	ПараметрыОтчета.ОбъектыРасчета);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 				= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 					= РезультатЗапроса[4].Выбрать();
	ВыборкаДанные2					= РезультатЗапроса[4].Выбрать();                                                                                

	мТочек = РезультатЗапроса[4].Выгрузить().ВыгрузитьКолонку("ТочкаПоставки");
	
	СоответствиеКатегорийНапряжения = РегистрыСведений.энргКатегорииНадежностиТочекПоставок.ПолучитьКатегорииНапряжения(ПараметрыОтчета.Период, мТочек);

	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;
	
	ОбластьШапка.Параметры.КодОбъекта = "";
	
	ТекКодОбъекта = Неопределено;
	Пока ВыборкаДанные2.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДанные2.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные2.НомерДоговора) + "_" + Строка(ВыборкаДанные2.КодОбъектаРасчета);
			Если КодОбъекта <> ТекКодОбъекта Тогда
				ОбластьШапка.Параметры.КодОбъекта = Строка(ОбластьШапка.Параметры.КодОбъекта) + ?(ЗначениеЗаполнено(ОбластьШапка.Параметры.КодОбъекта), ", ", "") + КодОбъекта;		
			КонецЕсли;
			ТекКодОбъекта = КодОбъекта;	
		КонецЕсли;	
	КонецЦикла;

	ТабДок.Вывести(ОбластьШапка);
	
	Пока ВыборкаДанные.Следующий() Цикл
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры,ВыборкаДанные);
		Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);
			ОбластьДанные.Параметры.КодОбъекта 		= КодОбъекта;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДанные.АктРазграниченияБалансовойПринадлежности) Тогда
			Если ЗначениеЗаполнено(ОбластьДанные.Параметры.АктТП) Тогда
				ШаблонАкта = НСтр("ru = '%1 / %2'");
				ОбластьДанные.Параметры.АктТП = СтрШаблон(ШаблонАкта, ОбластьДанные.Параметры.АктТП, ВыборкаДанные.АктРазграниченияБалансовойПринадлежности);
			Иначе
				ОбластьДанные.Параметры.АктТП = ВыборкаДанные.АктРазграниченияБалансовойПринадлежности;
			КонецЕсли;
		КонецЕсли;
		ОбластьДанные.Параметры.СхемаПрисоединения 	= Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ВыборкаДанные.СтруктураСети);
		//ОбластьДанные.Параметры.НеОтключаемый 		= ?(ВыборкаДанные.НеОтключаемый, "+", "-");
		ОбластьДанные.Параметры.РаспредМощность 	= "III к.н. - " + ВыборкаДанные.РаспредМощностьIII + " кВт; " + "II к.н. - " + ВыборкаДанные.РаспредМощностьII + " кВт; " + "I к.н. - " + ВыборкаДанные.РаспредМощностьI + " кВт; "; 
		Если СоответствиеКатегорийНапряжения[ВыборкаДанные.ТочкаПоставки] <> Неопределено Тогда
			ОбластьДанные.Параметры.КатегорияНадежности = СоответствиеКатегорийНапряжения[ВыборкаДанные.ТочкаПоставки];
		КонецЕсли;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура СформироватьПриложение10(ТабДок, ПараметрыОтчета) Экспорт
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_СписокКонтактныхЛиц");

	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестКонтактныеЛицаКонтрагентов.Ссылка КАК КонтактноеЛицо,
	|	бестКонтактныеЛицаКонтрагентов.Должность КАК Должность,
	|	бестКонтактныеЛицаКонтрагентов.КонтактноеЛицо КАК КонтактноеЛицоДляСвязывания
	|ПОМЕСТИТЬ ВТ_КонтактныеЛица
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестКонтактныеЛицаКонтрагентов КАК бестКонтактныеЛицаКонтрагентов
	|		ПО энргДоговорыКонтрагентов.Контрагент = бестКонтактныеЛицаКонтрагентов.Владелец
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ВТ_КонтактныеЛица.Должность КАК Должность,
	|	ВЫБОР
	|		КОГДА ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица)
	|			ТОГДА ФизическиеЛицаКонтактнаяИнформация.Представление
	|	КОНЕЦ КАК Телефон
	|ИЗ
	|	ВТ_КонтактныеЛица КАК ВТ_КонтактныеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ПО ВТ_КонтактныеЛица.КонтактноеЛицоДляСвязывания = ФизическиеЛицаКонтактнаяИнформация.Ссылка";
	
	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 	= РезультатЗапроса[0].Выбрать();
	ВыборкаДанные 		= РезультатЗапроса[2].Выбрать();
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;
		
	ТабДок.Вывести(ОбластьШапка);
			
	НомерСтроки = 1;
	Пока ВыборкаДанные.Следующий() Цикл
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры,ВыборкаДанные);
		ОбластьДанные.Параметры.НомерСтроки = НомерСтроки;
		ТабДок.Вывести(ОбластьДанные);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
		
	Для Счетчик = 1 по 4 Цикл
		ОбластьДанные = Макет.ПолучитьОбласть("ДопДанные");
		ОбластьДанные.Параметры.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		ТабДок.Вывести(ОбластьДанные);            		
	КонецЦикла;

	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Процедура СформироватьПриложение3_1(ТабДок, ПараметрыОтчета) Экспорт
	
	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;
	
	Если мОбъектыРасчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(ПараметрыОтчета.Период, ПараметрыОтчета.Организация, ПараметрыОтчета.Район, мОбъектыРасчета,Истина,,МВТ,Истина,,Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ПриборУчета КАК ПриборУчета,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета) КАК ГоловнаяТочкаУчета,
	|	ВЫБОР
	|		КОГДА НЕ бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|	КОНЕЦ КАК ПроверкаНаНаличиеЗаписи
	|ПОМЕСТИТЬ ДолевыеТочки
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	|		ПО Итог.ОбъектРасчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	|			И Итог.ТочкаУчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета
	|			И Итог.Услуга = бестФормулыРасчетаТочекУчетаНПСрезПоследних.Услуга
	|ГДЕ
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	Итог.ПриборУчета,
	|	Итог.Шкала,
	|	Итог.ОбъектРасчета,
	|	Итог.Услуга,
	|	Итог.ТочкаУчета,
	|	ВЫБОР
	|		КОГДА НЕ бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|	КОНЕЦ,
	|	Итог.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДолевыеТочки.ПроверкаНаНаличиеЗаписи) КАК ПроверкаНаНаличиеЗаписи
	|ПОМЕСТИТЬ ВТ_ПроверкаНаНаличиеЗаписи
	|ИЗ
	|	ДолевыеТочки КАК ДолевыеТочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ПриборУчета КАК ПриборУчета,
	|	энргПриборыУчетаАбонента.БалансоваяПринадлежность КАК СобственникСИ,
	|	энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестПотериТочекУчетаСрезПоследних.ПроцентПотерь КАК ПроцентПотерь,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВЫБОР
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК)
	|			ТОГДА ""Двуставочный""
	|		ИНАЧЕ ""Одноставочный""
	|	КОНЕЦ КАК Тариф
	|ПОМЕСТИТЬ ВТ_ДляСвязи
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО Итог.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПотериТочекУчета.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|				Организация = &Организация
	|					И Район = &Район
	|					И ВидПотерь = ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери)) КАК бестПотериТочекУчетаСрезПоследних
	|		ПО Итог.ТочкаУчета = бестПотериТочекУчетаСрезПоследних.ТочкаУчета
	|			И Итог.ТарифнаяЗона = бестПотериТочекУчетаСрезПоследних.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(&Период, ) КАК энргПараметрыТочекПоставкиСрезПоследних
	|			ПО бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки
	|		ПО Итог.ОбъектРасчета = бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ОбъектРасчета
	|			И Итог.ТочкаУчета = бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО Итог.ОбъектРасчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И Итог.ТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДляСвязи.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ДляСвязи.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ДляСвязи.Шкала КАК Шкала,
	|	ВТ_ДляСвязи.Услуга КАК Услуга,
	|	ВТ_ДляСвязи.ПриборУчета КАК ПриборУчета,
	|	ВТ_ДляСвязи.СобственникСИ КАК СобственникСИ,
	|	ВТ_ДляСвязи.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_ДляСвязи.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_ДляСвязи.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_ДляСвязи.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_ДляСвязи.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ДляСвязи.Тариф КАК Тариф,
	|	ДолевыеТочки.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТаблицаДляСвязывания
	|ИЗ
	|	ВТ_ДляСвязи КАК ВТ_ДляСвязи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДолевыеТочки КАК ДолевыеТочки
	|		ПО ВТ_ДляСвязи.ОбъектРасчета = ДолевыеТочки.ОбъектРасчета
	|			И ВТ_ДляСвязи.ТочкаУчета = ДолевыеТочки.ТочкаУчета
	|			И ВТ_ДляСвязи.ПриборУчета = ДолевыеТочки.ПриборУчета
	|			И ВТ_ДляСвязи.Шкала = ДолевыеТочки.Шкала
	|			И ВТ_ДляСвязи.Услуга = ДолевыеТочки.Услуга,
	|	ВТ_ПроверкаНаНаличиеЗаписи КАК ВТ_ПроверкаНаНаличиеЗаписи
	|ГДЕ
	|	ВТ_ПроверкаНаНаличиеЗаписи.ПроверкаНаНаличиеЗаписи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДляСвязи.ОбъектРасчета,
	|	ВТ_ДляСвязи.ТочкаУчета,
	|	ВТ_ДляСвязи.Шкала,
	|	ВТ_ДляСвязи.Услуга,
	|	ВТ_ДляСвязи.ПриборУчета,
	|	ВТ_ДляСвязи.СобственникСИ,
	|	ВТ_ДляСвязи.ТипПрибораУчета,
	|	ВТ_ДляСвязи.ТарифнаяЗона,
	|	ВТ_ДляСвязи.ПроцентПотерь,
	|	ВТ_ДляСвязи.УровеньНапряжения,
	|	ВТ_ДляСвязи.ЦеноваяКатегория,
	|	ВТ_ДляСвязи.Тариф,
	|	ДолевыеТочки.ГоловнаяТочкаУчета
	|ИЗ
	|	ВТ_ДляСвязи КАК ВТ_ДляСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолевыеТочки КАК ДолевыеТочки
	|		ПО ВТ_ДляСвязи.ОбъектРасчета = ДолевыеТочки.ОбъектРасчета
	|			И ВТ_ДляСвязи.ТочкаУчета = ДолевыеТочки.ТочкаУчета
	|			И ВТ_ДляСвязи.ПриборУчета = ДолевыеТочки.ПриборУчета
	|			И ВТ_ДляСвязи.Шкала = ДолевыеТочки.Шкала
	|			И ВТ_ДляСвязи.Услуга = ДолевыеТочки.Услуга,
	|	ВТ_ПроверкаНаНаличиеЗаписи КАК ВТ_ПроверкаНаНаличиеЗаписи
	|ГДЕ
	|	ВТ_ПроверкаНаНаличиеЗаписи.ПроверкаНаНаличиеЗаписи ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДляСвязывания.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ТаблицаДляСвязывания.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТаблицаДляСвязывания.Шкала КАК Шкала,
	|	ВТ_ТаблицаДляСвязывания.Услуга КАК Услуга,
	|	ВТ_ТаблицаДляСвязывания.ПриборУчета КАК ПриборУчета,
	|	ВТ_ТаблицаДляСвязывания.СобственникСИ КАК СобственникСИ,
	|	ВТ_ТаблицаДляСвязывания.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_ТаблицаДляСвязывания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_ТаблицаДляСвязывания.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_ТаблицаДляСвязывания.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_ТаблицаДляСвязывания.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ТаблицаДляСвязывания.Тариф КАК Тариф,
	|	ВТ_ТаблицаДляСвязывания.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ТаблицаДляСвязывания КАК ВТ_ТаблицаДляСвязывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ТаблицаДляСвязывания.ОбъектРасчета = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_КодОбъекта.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_КодОбъекта.Шкала КАК Шкала,
	|	ВТ_КодОбъекта.Услуга КАК Услуга,
	|	ВТ_КодОбъекта.ПриборУчета КАК ПриборУчета,
	|	ВТ_КодОбъекта.СобственникСИ КАК СобственникСИ,
	|	ВТ_КодОбъекта.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_КодОбъекта.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_КодОбъекта.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_КодОбъекта.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_КодОбъекта.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_КодОбъекта.Тариф КАК Тариф,
	|	ВТ_КодОбъекта.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Итог.Шкала КАК Шкала,
	|	ВТ_Итог.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.I1, 0)) КАК I1,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.I2, 0)) КАК I2,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.U1, 0)) КАК U1,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.U2, 0)) КАК U2,
	|	ВТ_Итог.СобственникСИ КАК СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_Итог.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_Итог.Тариф КАК Тариф,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент КАК Коэффициент,
	|	ВТ_Итог.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПриборыУзловУчетаНПСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонентаИзмерители
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксТипыПриборовУчетаДополнительныеРеквизиты КАК рксТипыПриборовУчетаДополнительныеРеквизиты
	|				ПО энргПриборыУчетаАбонентаИзмерители.ТипПрибораУчета = рксТипыПриборовУчетаДополнительныеРеквизиты.МодельПрибораУчета
	|			ПО бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета = энргПриборыУчетаАбонентаИзмерители.Ссылка
	|		ПО ВТ_Итог.ОбъектРасчета = бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета
	|			И ВТ_Итог.ТочкаУчета = бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_Итог.ПриборУчета = бестПриборыУзловУчетаНПСрезПоследних.УзелУчета
	|			И (бестПриборыУзловУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестКоэффциентыПриборовУчетаНПСрезПоследних
	|		ПО ВТ_Итог.ТочкаУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_Итог.ПриборУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ПриборУчета
	|ГДЕ
	|	НЕ ВТ_Итог.ПриборУчета ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итог.ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета,
	|	ВТ_Итог.Шкала,
	|	ВТ_Итог.ПриборУчета,
	|	ВТ_Итог.СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета,
	|	ВТ_Итог.ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета,
	|	ВТ_Итог.Тариф,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент,
	|	ВТ_Итог.ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора,
	|	ВТ_Итог.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыУслуг.ЕдиницаИзмерения КАК ЕдИзм,
	|	ВТ_Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Итог.Шкала КАК Шкала,
	|	ВТ_Итог.Услуга КАК Услуга,
	|	ВТ_Итог.ПриборУчета КАК ПриборУчета,
	|	ВТ_Итог.СобственникСИ КАК СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_Итог.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Месяц КАК Месяц,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_Итог.Тариф КАК Тариф,
	|	ВТ_Итог.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВТ_Итог.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И Год = ГОД(&Период)) КАК бестГарантированныеОбъемыСрезПоследних
	|		ПО ВТ_Итог.ОбъектРасчета = бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета
	|			И ВТ_Итог.Услуга = бестГарантированныеОбъемыСрезПоследних.Услуга
	|ГДЕ
	|	НЕ энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|	И ВТ_Итог.ПриборУчета ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета,
	|	ТочкаУчета";
	
	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Период", 		ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("Район", 			ПараметрыОтчета.Район);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПоследнегоПакета = РезультатЗапроса.ВГраница();
	
	Если РезультатЗапроса[ИндексПоследнегоПакета - 1].Пустой() И РезультатЗапроса[ИндексПоследнегоПакета].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение3_1МестаУстановкиПУ");
	
	ВыборкаШапкаПодвал 				= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 					= РезультатЗапроса[ИндексПоследнегоПакета - 1].Выбрать();
	ВыборкаДанные2 					= РезультатЗапроса[ИндексПоследнегоПакета - 1].Выбрать();
	ВыборкаДанныеБезПУ 				= РезультатЗапроса[ИндексПоследнегоПакета].Выбрать();
	
	ОбластьШапкаНачало  	 = Макет.ПолучитьОбласть("ШапкаНачало");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапкаНачало.Параметры.Нумерация = "3.1"; 
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапкаНачало.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапкаНачало.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;	
	
	ОбластьШапкаНачало.Параметры.КодОбъекта = "";
	
	ТекКодОбъекта = Неопределено;
	
	Пока ВыборкаДанные2.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДанные2.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные2.НомерДоговора) + "_" + Строка(ВыборкаДанные2.КодОбъектаРасчета);
			Если КодОбъекта <> ТекКодОбъекта Тогда
				ОбластьШапкаНачало.Параметры.КодОбъекта = Строка(ОбластьШапкаНачало.Параметры.КодОбъекта) + ?(ЗначениеЗаполнено(ОбластьШапкаНачало.Параметры.КодОбъекта), ", ", "") + КодОбъекта;		
			КонецЕсли;
			ТекКодОбъекта = КодОбъекта;	
		КонецЕсли;	
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьШапкаНачало);
		
	Если Не РезультатЗапроса[ИндексПоследнегоПакета - 1].Пустой() Тогда
		ОбластьЗаголовокПеречень = Макет.ПолучитьОбласть("ЗаголовокПеречень");
		ТабДок.Вывести(ОбластьЗаголовокПеречень);
		ОбластьШапкаЗаголовок31 = Макет.ПолучитьОбласть("Заголовок31");
		ТабДок.Вывести(ОбластьШапкаЗаголовок31);
		ОбластьШапкаОкончание = Макет.ПолучитьОбласть("ШапкаОкончание");	
		ТабДок.Вывести(ОбластьШапкаОкончание);
		Пока ВыборкаДанные.Следующий() Цикл
			ОбластьДанные = Макет.ПолучитьОбласть("Данные");
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, ВыборкаДанные); 
			Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
				КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);	
				ОбластьДанные.Параметры.КодОбъекта 	= КодОбъекта;
			КонецЕсли;
			ОбластьДанные.Параметры.Ток 			= Строка(ВыборкаДанные.I1) + "/" + ВыборкаДанные.I2;
			ОбластьДанные.Параметры.Напряжение 		= Строка(ВыборкаДанные.U1) + "/" + ВыборкаДанные.U2;
			ОбластьДанные.Параметры.ТарифнаяЗона	= ВРег(ОбластьДанные.Параметры.ТарифнаяЗона); 
			
			ТабДок.Вывести(ОбластьДанные);
		КонецЦикла;
	КонецЕсли;
	
	Если Не РезультатЗапроса[ИндексПоследнегоПакета].Пустой() Тогда
		ОбластьЗаголовокПеречень = Макет.ПолучитьОбласть("ЗаголовокПеречень");
		ТабДок.Вывести(ОбластьЗаголовокПеречень);
		ОбластьШапкаЗаголовок31 = Макет.ПолучитьОбласть("Заголовок31БезПУ");
		ТабДок.Вывести(ОбластьШапкаЗаголовок31);
		ОбластьШапкаБезПУ = Макет.ПолучитьОбласть("ШапкаБезПУ");
		ТабДок.Вывести(ОбластьШапкаБезПУ);
		ТекТУ = Неопределено;
		ОбластьДанныеБезПУ = Неопределено;
		Пока ВыборкаДанныеБезПУ.Следующий() Цикл
			Если ТекТУ <> ВыборкаДанныеБезПУ.ТочкаУчета Тогда
				Если ОбластьДанныеБезПУ <> Неопределено Тогда
					ТабДок.Вывести(ОбластьДанныеБезПУ);
				КонецЕсли;			
				ОбластьДанныеБезПУ = Макет.ПолучитьОбласть("ДанныеБезПУ");
				ЗаполнитьЗначенияСвойств(ОбластьДанныеБезПУ.Параметры, ВыборкаДанныеБезПУ); 
				Если ЗначениеЗаполнено(ВыборкаДанныеБезПУ.КодОбъектаРасчета) Тогда
					КодОбъекта = Строка(ВыборкаДанныеБезПУ.НомерДоговора) + "_" + Строка(ВыборкаДанныеБезПУ.КодОбъектаРасчета);
					ОбластьДанныеБезПУ.Параметры.КодОбъекта  = КодОбъекта;
				КонецЕсли;				
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаДанныеБезПУ.Месяц) и ЗначениеЗаполнено(ВыборкаДанныеБезПУ.ОбъемУслуги) Тогда
				ОбластьДанныеБезПУ.Параметры["Объем" + ВыборкаДанныеБезПУ.Месяц] = ВыборкаДанныеБезПУ.ОбъемУслуги;
			КонецЕсли;
			ТекТУ = ВыборкаДанныеБезПУ.ТочкаУчета;			
		КонецЦикла;
		Если ОбластьДанныеБезПУ <> Неопределено  Тогда
			ТабДок.Вывести(ОбластьДанныеБезПУ);
		КонецЕсли;
		
	КонецЕсли;
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура СформироватьПриложение3_2(ТабДок, ПараметрыОтчета) Экспорт
	
	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;
	
	Если мОбъектыРасчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МВТ = Новый МенеджерВременныхТаблиц;
	бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(ПараметрыОтчета.Период, ПараметрыОтчета.Организация, ПараметрыОтчета.Район, мОбъектыРасчета,,,МВТ,Истина,,Истина);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета) КАК ГоловнаяТочкаУчета,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента КАК УслугаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ДолевыеТочки
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	|		ПО Итог.ОбъектРасчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	|ГДЕ
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолевыеТочки.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДолевыеТочки.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ДолевыеТочки.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ДолевыеТочки.УслугаСубабонента КАК УслугаСубабонента,
	|	ДолевыеТочки.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ИЗ
	|	ДолевыеТочки КАК ДолевыеТочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	ДолевыеТочки.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДолевыеТочки.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ДолевыеТочки.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ДолевыеТочки.УслугаСубабонента КАК УслугаСубабонента,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета.ВидКанальности КАК ВидКанальности,
	|	ДолевыеТочки.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ВТ_Прибор
	|ИЗ
	|	ДолевыеТочки КАК ДолевыеТочки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПриборыТочекУчетаНПСрезПоследних
	|		ПО ДолевыеТочки.ОбъектРасчетаСубабонента = бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета
	|			И ДолевыеТочки.ТочкаУчетаСубабонента = бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВТ_Прибор.ПриборУчета КАК ПриборУчета,
	|	ВТ_Прибор.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Прибор.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_Прибор.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_Прибор.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_Прибор.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ВТ_ШкалаПрибора
	|ИЗ
	|	ВТ_Прибор КАК ВТ_Прибор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВТ_Прибор.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ШкалаПрибора.Шкала КАК Шкала,
	|	ВТ_ШкалаПрибора.ПриборУчета КАК ПриборУчета,
	|	ВТ_ШкалаПрибора.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_ШкалаПрибора.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_ШкалаПрибора.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_ШкалаПрибора.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_ШкалаПрибора.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТ_ТарифныеЗоны
	|ИЗ
	|	ВТ_ШкалаПрибора КАК ВТ_ШкалаПрибора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|			ПО бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|		ПО ВТ_ШкалаПрибора.ОбъектРасчетаСубабонента = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ОбъектРасчета
	|			И ВТ_ШкалаПрибора.ТочкаУчетаСубабонента = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_ШкалаПрибора.ПриборУчета = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И ВТ_ШкалаПрибора.Шкала = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ТарифныеЗоны.Шкала КАК Шкала,
	|	ВТ_ТарифныеЗоны.ПриборУчета КАК ПриборУчета,
	|	ВТ_ТарифныеЗоны.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_ТарифныеЗоны.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_ТарифныеЗоны.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_ТарифныеЗоны.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_ТарифныеЗоны.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный,
	|	ВТ_ТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТ_ЦенКатегорииСубабонентов
	|ИЗ
	|	ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ВТ_ТарифныеЗоны.ОбъектРасчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ВТ_ТарифныеЗоны.ТочкаУчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ШкалаПрибора.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ВТ_ЦенКатегорииОбъектов
	|ИЗ
	|	ВТ_ШкалаПрибора КАК ВТ_ШкалаПрибора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ВТ_ШкалаПрибора.ОбъектРасчетаГлавный = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ВТ_ШкалаПрибора.ГоловнаяТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЦенКатегорииСубабонентов.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ЦенКатегорииСубабонентов.Шкала КАК Шкала,
	|	ВТ_ЦенКатегорииСубабонентов.ПриборУчета КАК ПриборУчета,
	|	ВТ_ЦенКатегорииСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный,
	|	ВТ_ЦенКатегорииСубабонентов.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТ_СубабонентыСТакойЖеЦК
	|ИЗ
	|	ВТ_ЦенКатегорииСубабонентов КАК ВТ_ЦенКатегорииСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦенКатегорииОбъектов КАК ВТ_ЦенКатегорииОбъектов
	|		ПО ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаГлавный = ВТ_ЦенКатегорииОбъектов.ОбъектРасчетаГлавный
	|			И ВТ_ЦенКатегорииСубабонентов.ЦеноваяКатегория = ВТ_ЦенКатегорииОбъектов.ЦеноваяКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СубабонентыСТакойЖеЦК.ОбъектРасчетаСубабонента КАК ОбъектРасчета,
	|	ВТ_СубабонентыСТакойЖеЦК.ТочкаУчетаСубабонента КАК ТочкаУчета,
	|	ВТ_СубабонентыСТакойЖеЦК.Шкала КАК Шкала,
	|	ВТ_СубабонентыСТакойЖеЦК.УслугаСубабонента КАК Услуга,
	|	ВТ_СубабонентыСТакойЖеЦК.ПриборУчета КАК ПриборУчета,
	|	энргПриборыУчетаАбонента.СобственникСИ КАК СобственникСИ,
	|	энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_СубабонентыСТакойЖеЦК.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестПотериТочекУчетаСрезПоследних.ПроцентПотерь КАК ПроцентПотерь,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВЫБОР
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК)
	|			ТОГДА ""Двуставочный""
	|		ИНАЧЕ ""Одноставочный""
	|	КОНЕЦ КАК Тариф,
	|	ВТ_СубабонентыСТакойЖеЦК.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТаблицаДляСвязывания
	|ИЗ
	|	ВТ_СубабонентыСТакойЖеЦК КАК ВТ_СубабонентыСТакойЖеЦК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВТ_СубабонентыСТакойЖеЦК.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПотериТочекУчета.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|				Организация = &Организация
	|					И Район = &Район
	|					И ВидПотерь = ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери)) КАК бестПотериТочекУчетаСрезПоследних
	|		ПО ВТ_СубабонентыСТакойЖеЦК.ТочкаУчетаСубабонента = бестПотериТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВТ_СубабонентыСТакойЖеЦК.ТарифнаяЗона = бестПотериТочекУчетаСрезПоследних.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(&Период, ) КАК энргПараметрыТочекПоставкиСрезПоследних
	|			ПО бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки
	|		ПО ВТ_СубабонентыСТакойЖеЦК.ОбъектРасчетаСубабонента = бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ОбъектРасчета
	|			И ВТ_СубабонентыСТакойЖеЦК.ТочкаУчетаСубабонента = бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ВТ_СубабонентыСТакойЖеЦК.ТочкаУчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВТ_СубабонентыСТакойЖеЦК.ОбъектРасчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДляСвязывания.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ТаблицаДляСвязывания.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТаблицаДляСвязывания.Шкала КАК Шкала,
	|	ВТ_ТаблицаДляСвязывания.Услуга КАК Услуга,
	|	ВТ_ТаблицаДляСвязывания.ПриборУчета КАК ПриборУчета,
	|	ВТ_ТаблицаДляСвязывания.СобственникСИ КАК СобственникСИ,
	|	ВТ_ТаблицаДляСвязывания.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_ТаблицаДляСвязывания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_ТаблицаДляСвязывания.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_ТаблицаДляСвязывания.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_ТаблицаДляСвязывания.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ТаблицаДляСвязывания.Тариф КАК Тариф,
	|	ВТ_ТаблицаДляСвязывания.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор.Номер КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ТаблицаДляСвязывания КАК ВТ_ТаблицаДляСвязывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ТаблицаДляСвязывания.ОбъектРасчета = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_КодОбъекта.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_КодОбъекта.Шкала КАК Шкала,
	|	ВТ_КодОбъекта.Услуга КАК Услуга,
	|	ВТ_КодОбъекта.ПриборУчета КАК ПриборУчета,
	|	ВТ_КодОбъекта.СобственникСИ КАК СобственникСИ,
	|	ВТ_КодОбъекта.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_КодОбъекта.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_КодОбъекта.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_КодОбъекта.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_КодОбъекта.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_КодОбъекта.Тариф КАК Тариф,
	|	ВТ_КодОбъекта.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_КодОбъекта.НомерДоговора КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Итог.Шкала КАК Шкала,
	|	ВТ_Итог.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.I1, 0)) КАК I1,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.I2, 0)) КАК I2,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.U1, 0)) КАК U1,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.U2, 0)) КАК U2,
	|	ВТ_Итог.СобственникСИ КАК СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_Итог.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_Итог.Тариф КАК Тариф,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент КАК Коэффициент,
	|	ВТ_Итог.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПриборыУзловУчетаНПСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонентаИзмерители
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксТипыПриборовУчетаДополнительныеРеквизиты КАК рксТипыПриборовУчетаДополнительныеРеквизиты
	|				ПО энргПриборыУчетаАбонентаИзмерители.ТипПрибораУчета = рксТипыПриборовУчетаДополнительныеРеквизиты.МодельПрибораУчета
	|			ПО бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета = энргПриборыУчетаАбонентаИзмерители.Ссылка
	|		ПО ВТ_Итог.ОбъектРасчета = бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета
	|			И ВТ_Итог.ТочкаУчета = бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_Итог.ПриборУчета = бестПриборыУзловУчетаНПСрезПоследних.УзелУчета
	|			И (бестПриборыУзловУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестКоэффциентыПриборовУчетаНПСрезПоследних
	|		ПО ВТ_Итог.ТочкаУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_Итог.ПриборУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итог.ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета,
	|	ВТ_Итог.Шкала,
	|	ВТ_Итог.ПриборУчета,
	|	ВТ_Итог.СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета,
	|	ВТ_Итог.ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета,
	|	ВТ_Итог.Тариф,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент,
	|	ВТ_Итог.ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора,
	|	ВТ_Итог.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыУслуг.ЕдиницаИзмерения КАК ЕдИзм,
	|	ВТ_Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Итог.Шкала КАК Шкала,
	|	ВТ_Итог.Услуга КАК Услуга,
	|	ВТ_Итог.ПриборУчета КАК ПриборУчета,
	|	ВТ_Итог.СобственникСИ КАК СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_Итог.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Месяц КАК Месяц,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_Итог.Тариф КАК Тариф,
	|	ВТ_Итог.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВТ_Итог.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И Год = ГОД(&Период)) КАК бестГарантированныеОбъемыСрезПоследних
	|		ПО ВТ_Итог.ОбъектРасчета = бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета
	|			И ВТ_Итог.Услуга = бестГарантированныеОбъемыСрезПоследних.Услуга
	|ГДЕ
	|	НЕ ЕСТЬNULL(энргВидыУслуг.бестИспользоватьРасчетПоМощности, ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета,
	|	ТочкаУчета";
	
	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Период", 		ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("Район", 			ПараметрыОтчета.Район);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПоследнегоПакета = РезультатЗапроса.ВГраница();
	
	Если РезультатЗапроса[3].Пустой() ИЛИ РезультатЗапроса[ИндексПоследнегоПакета - 1].Пустой() И РезультатЗапроса[ИндексПоследнегоПакета].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение3_1МестаУстановкиПУ");

	ВыборкаШапкаПодвал 				= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 					= РезультатЗапроса[ИндексПоследнегоПакета - 1].Выбрать();
	ВыборкаДанные2 					= РезультатЗапроса[ИндексПоследнегоПакета - 1].Выбрать();
	ВыборкаДанныеБезПУ 				= РезультатЗапроса[ИндексПоследнегоПакета].Выбрать();
	
	ОбластьШапкаНачало  	 = Макет.ПолучитьОбласть("ШапкаНачало");
	ОбластьШапкаЗаголовок32  = Макет.ПолучитьОбласть("Заголовок32");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	ОбластьШапкаНачало.Параметры.Нумерация = "3.2"; 
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапкаНачало.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапкаНачало.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;	
	
	ОбластьШапкаНачало.Параметры.КодОбъекта = "";
	
	ТекКодОбъекта = Неопределено;
	
	Пока ВыборкаДанные2.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДанные2.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные2.НомерДоговора) + "_" + Строка(ВыборкаДанные2.КодОбъектаРасчета);
			Если КодОбъекта <> ТекКодОбъекта Тогда
				ОбластьШапкаНачало.Параметры.КодОбъекта = Строка(ОбластьШапкаНачало.Параметры.КодОбъекта) + ?(ЗначениеЗаполнено(ОбластьШапкаНачало.Параметры.КодОбъекта), ", ", "") + КодОбъекта;		
			КонецЕсли;
			ТекКодОбъекта = КодОбъекта;	
		КонецЕсли;	
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьШапкаНачало);
	ТабДок.Вывести(ОбластьШапкаЗаголовок32);
	
	Если Не РезультатЗапроса[ИндексПоследнегоПакета - 1].Пустой() Тогда
		
		ОбластьШапкаОкончание  	 = Макет.ПолучитьОбласть("ШапкаОкончание");
	    ТабДок.Вывести(ОбластьШапкаОкончание);
		
		Пока ВыборкаДанные.Следующий() Цикл                        
			ОбластьДанные = Макет.ПолучитьОбласть("Данные");
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, ВыборкаДанные); 
			Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
				КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);	
				ОбластьДанные.Параметры.КодОбъекта 	= КодОбъекта;
			КонецЕсли;
			ОбластьДанные.Параметры.Ток 			= Строка(ВыборкаДанные.I1) + "/" + ВыборкаДанные.I2;
			ОбластьДанные.Параметры.Напряжение 		= Строка(ВыборкаДанные.U1) + "/" + ВыборкаДанные.U2;
			ОбластьДанные.Параметры.ТарифнаяЗона	= ВРег(ОбластьДанные.Параметры.ТарифнаяЗона); 
			
			ТабДок.Вывести(ОбластьДанные);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не РезультатЗапроса[ИндексПоследнегоПакета].Пустой() Тогда
		ОбластьШапкаБезПУ = Макет.ПолучитьОбласть("ШапкаБезПУ");
		ТабДок.Вывести(ОбластьШапкаБезПУ);
		ТекТУ = Неопределено;
		ОбластьДанныеБезПУ = Неопределено;
		Пока ВыборкаДанныеБезПУ.Следующий() Цикл
			Если ТекТУ <> ВыборкаДанныеБезПУ.ТочкаУчета Тогда
				Если ОбластьДанныеБезПУ <> Неопределено Тогда
					ТабДок.Вывести(ОбластьДанныеБезПУ);
				КонецЕсли;			
				ОбластьДанныеБезПУ = Макет.ПолучитьОбласть("ДанныеБезПУ");
				ЗаполнитьЗначенияСвойств(ОбластьДанныеБезПУ.Параметры, ВыборкаДанныеБезПУ); 
				Если ЗначениеЗаполнено(ВыборкаДанныеБезПУ.КодОбъектаРасчета) Тогда
					КодОбъекта = Строка(ВыборкаДанныеБезПУ.НомерДоговора) + "_" + Строка(ВыборкаДанныеБезПУ.КодОбъектаРасчета);
					ОбластьДанныеБезПУ.Параметры.КодОбъекта  = КодОбъекта;
				КонецЕсли;				
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаДанныеБезПУ.Месяц) и ЗначениеЗаполнено(ВыборкаДанныеБезПУ.ОбъемУслуги) Тогда
				ОбластьДанныеБезПУ.Параметры["Объем" + ВыборкаДанныеБезПУ.Месяц] = ВыборкаДанныеБезПУ.ОбъемУслуги;
			КонецЕсли;
			ТекТУ = ВыборкаДанныеБезПУ.ТочкаУчета;			
		КонецЦикла;
		Если ОбластьДанныеБезПУ <> Неопределено  Тогда
			ТабДок.Вывести(ОбластьДанныеБезПУ);
		КонецЕсли;
		
	КонецЕсли;
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура СформироватьПриложение3_3(ТабДок, ПараметрыОтчета) Экспорт
	
	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;
	
	Если мОбъектыРасчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
 
	МВТ = Новый МенеджерВременныхТаблиц;
	бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(ПараметрыОтчета.Период, ПараметрыОтчета.Организация, ПараметрыОтчета.Район, мОбъектыРасчета,Истина,,МВТ,Истина,,Истина);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(бестФормулыРасчетаТочекУчетаНПСрезПоследних.ГоловнаяТочкаУчета) КАК ГоловнаяТочкаУчета,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента КАК УслугаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ДолевыеТочки
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	|		ПО Итог.ОбъектРасчета = бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	|ГДЕ
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента,
	|	Итог.ОбъектРасчета,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолевыеТочки.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДолевыеТочки.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ДолевыеТочки.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ДолевыеТочки.УслугаСубабонента КАК УслугаСубабонента,
	|	ДолевыеТочки.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ИЗ
	|	ДолевыеТочки КАК ДолевыеТочки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	ДолевыеТочки.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ДолевыеТочки.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ДолевыеТочки.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ДолевыеТочки.УслугаСубабонента КАК УслугаСубабонента,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета.ВидКанальности КАК ВидКанальности,
	|	ДолевыеТочки.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ВТ_Прибор
	|ИЗ
	|	ДолевыеТочки КАК ДолевыеТочки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПриборыТочекУчетаНПСрезПоследних
	|		ПО ДолевыеТочки.ОбъектРасчетаСубабонента = бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета
	|			И ДолевыеТочки.ТочкаУчетаСубабонента = бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВТ_Прибор.ПриборУчета КАК ПриборУчета,
	|	ВТ_Прибор.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Прибор.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_Прибор.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_Прибор.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_Прибор.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ВТ_ШкалаПрибора
	|ИЗ
	|	ВТ_Прибор КАК ВТ_Прибор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВТ_Прибор.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ШкалаПрибора.Шкала КАК Шкала,
	|	ВТ_ШкалаПрибора.ПриборУчета КАК ПриборУчета,
	|	ВТ_ШкалаПрибора.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_ШкалаПрибора.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_ШкалаПрибора.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_ШкалаПрибора.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_ШкалаПрибора.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТ_ТарифныеЗоны
	|ИЗ
	|	ВТ_ШкалаПрибора КАК ВТ_ШкалаПрибора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|			ПО бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|		ПО ВТ_ШкалаПрибора.ОбъектРасчетаСубабонента = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ОбъектРасчета
	|			И ВТ_ШкалаПрибора.ТочкаУчетаСубабонента = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_ШкалаПрибора.ПриборУчета = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И ВТ_ШкалаПрибора.Шкала = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ТарифныеЗоны.Шкала КАК Шкала,
	|	ВТ_ТарифныеЗоны.ПриборУчета КАК ПриборУчета,
	|	ВТ_ТарифныеЗоны.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_ТарифныеЗоны.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_ТарифныеЗоны.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_ТарифныеЗоны.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_ТарифныеЗоны.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный,
	|	ВТ_ТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТ_ЦенКатегорииСубабонентов
	|ИЗ
	|	ВТ_ТарифныеЗоны КАК ВТ_ТарифныеЗоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ВТ_ТарифныеЗоны.ОбъектРасчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ВТ_ТарифныеЗоны.ТочкаУчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ШкалаПрибора.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный
	|ПОМЕСТИТЬ ВТ_ЦенКатегорииОбъектов
	|ИЗ
	|	ВТ_ШкалаПрибора КАК ВТ_ШкалаПрибора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ВТ_ШкалаПрибора.ОбъектРасчетаГлавный = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ВТ_ШкалаПрибора.ГоловнаяТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЦенКатегорииСубабонентов.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ЦенКатегорииСубабонентов.Шкала КАК Шкала,
	|	ВТ_ЦенКатегорииСубабонентов.ПриборУчета КАК ПриборУчета,
	|	ВТ_ЦенКатегорииСубабонентов.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаСубабонента КАК ОбъектРасчетаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.ТочкаУчетаСубабонента КАК ТочкаУчетаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.УслугаСубабонента КАК УслугаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаГлавный КАК ОбъектРасчетаГлавный,
	|	ВТ_ЦенКатегорииСубабонентов.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТ_Субабоненты
	|ИЗ
	|	ВТ_ЦенКатегорииСубабонентов КАК ВТ_ЦенКатегорииСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦенКатегорииОбъектов КАК ВТ_ЦенКатегорииОбъектов
	|		ПО ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаГлавный = ВТ_ЦенКатегорииОбъектов.ОбъектРасчетаГлавный
	|			И ВТ_ЦенКатегорииСубабонентов.ЦеноваяКатегория <> ВТ_ЦенКатегорииОбъектов.ЦеноваяКатегория
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЦенКатегорииСубабонентов.ЦеноваяКатегория,
	|	ВТ_ЦенКатегорииСубабонентов.Шкала,
	|	ВТ_ЦенКатегорииСубабонентов.ПриборУчета,
	|	ВТ_ЦенКатегорииСубабонентов.ГоловнаяТочкаУчета,
	|	ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.ТочкаУчетаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.УслугаСубабонента,
	|	ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаГлавный,
	|	ВТ_ЦенКатегорииСубабонентов.ТарифнаяЗона
	|ИЗ
	|	ВТ_ЦенКатегорииСубабонентов КАК ВТ_ЦенКатегорииСубабонентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦенКатегорииОбъектов КАК ВТ_ЦенКатегорииОбъектов
	|		ПО ВТ_ЦенКатегорииСубабонентов.ОбъектРасчетаГлавный = ВТ_ЦенКатегорииОбъектов.ОбъектРасчетаГлавный
	|			И ВТ_ЦенКатегорииСубабонентов.ЦеноваяКатегория = ВТ_ЦенКатегорииОбъектов.ЦеноваяКатегория
	|			И (ВТ_ЦенКатегорииСубабонентов.ПриборУчета ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Субабоненты.ОбъектРасчетаСубабонента КАК ОбъектРасчета,
	|	ВТ_Субабоненты.ТочкаУчетаСубабонента КАК ТочкаУчета,
	|	ВТ_Субабоненты.Шкала КАК Шкала,
	|	ВТ_Субабоненты.УслугаСубабонента КАК Услуга,
	|	ВТ_Субабоненты.ПриборУчета КАК ПриборУчета,
	|	энргПриборыУчетаАбонента.СобственникСИ КАК СобственникСИ,
	|	энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_Субабоненты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестПотериТочекУчетаСрезПоследних.ПроцентПотерь КАК ПроцентПотерь,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВЫБОР
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК)
	|			ТОГДА ""Двуставочный""
	|		ИНАЧЕ ""Одноставочный""
	|	КОНЕЦ КАК Тариф,
	|	ВТ_Субабоненты.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТаблицаДляСвязывания
	|ИЗ
	|	ВТ_Субабоненты КАК ВТ_Субабоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВТ_Субабоненты.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПотериТочекУчета.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|				Организация = &Организация
	|					И Район = &Район
	|					И ВидПотерь = ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери)) КАК бестПотериТочекУчетаСрезПоследних
	|		ПО ВТ_Субабоненты.ТочкаУчетаСубабонента = бестПотериТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВТ_Субабоненты.ТарифнаяЗона = бестПотериТочекУчетаСрезПоследних.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТочкиПоставкиТочекУчетаЮЛ.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестТочкиПоставкиТочекУчетаЮЛСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(&Период, ) КАК энргПараметрыТочекПоставкиСрезПоследних
	|			ПО бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаПоставки = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки
	|		ПО ВТ_Субабоненты.ОбъектРасчетаСубабонента = бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ОбъектРасчета
	|			И ВТ_Субабоненты.ТочкаУчетаСубабонента = бестТочкиПоставкиТочекУчетаЮЛСрезПоследних.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ВТ_Субабоненты.ТочкаУчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВТ_Субабоненты.ОбъектРасчетаСубабонента = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДляСвязывания.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ТаблицаДляСвязывания.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТаблицаДляСвязывания.Шкала КАК Шкала,
	|	ВТ_ТаблицаДляСвязывания.Услуга КАК Услуга,
	|	ВТ_ТаблицаДляСвязывания.ПриборУчета КАК ПриборУчета,
	|	ВТ_ТаблицаДляСвязывания.СобственникСИ КАК СобственникСИ,
	|	ВТ_ТаблицаДляСвязывания.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_ТаблицаДляСвязывания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_ТаблицаДляСвязывания.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_ТаблицаДляСвязывания.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_ТаблицаДляСвязывания.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ТаблицаДляСвязывания.Тариф КАК Тариф,
	|	ВТ_ТаблицаДляСвязывания.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор.Номер КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ТаблицаДляСвязывания КАК ВТ_ТаблицаДляСвязывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ТаблицаДляСвязывания.ОбъектРасчета = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_КодОбъекта.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_КодОбъекта.Шкала КАК Шкала,
	|	ВТ_КодОбъекта.Услуга КАК Услуга,
	|	ВТ_КодОбъекта.ПриборУчета КАК ПриборУчета,
	|	ВТ_КодОбъекта.СобственникСИ КАК СобственникСИ,
	|	ВТ_КодОбъекта.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_КодОбъекта.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_КодОбъекта.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_КодОбъекта.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_КодОбъекта.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_КодОбъекта.Тариф КАК Тариф,
	|	ВТ_КодОбъекта.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_КодОбъекта.НомерДоговора КАК НомерДоговора
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Итог.Шкала КАК Шкала,
	|	ВТ_Итог.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.I1, 0)) КАК I1,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.I2, 0)) КАК I2,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.U1, 0)) КАК U1,
	|	МАКСИМУМ(ЕСТЬNULL(рксТипыПриборовУчетаДополнительныеРеквизиты.U2, 0)) КАК U2,
	|	ВТ_Итог.СобственникСИ КАК СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_Итог.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_Итог.Тариф КАК Тариф,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент КАК Коэффициент,
	|	ВТ_Итог.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПриборыУзловУчетаНПСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонентаИзмерители
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксТипыПриборовУчетаДополнительныеРеквизиты КАК рксТипыПриборовУчетаДополнительныеРеквизиты
	|				ПО энргПриборыУчетаАбонентаИзмерители.ТипПрибораУчета = рксТипыПриборовУчетаДополнительныеРеквизиты.МодельПрибораУчета
	|			ПО бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета = энргПриборыУчетаАбонентаИзмерители.Ссылка
	|		ПО ВТ_Итог.ОбъектРасчета = бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета
	|			И ВТ_Итог.ТочкаУчета = бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_Итог.ПриборУчета = бестПриборыУзловУчетаНПСрезПоследних.УзелУчета
	|			И (бестПриборыУзловУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестКоэффциентыПриборовУчетаНПСрезПоследних
	|		ПО ВТ_Итог.ТочкаУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И ВТ_Итог.ПриборУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ПриборУчета
	|ГДЕ
	|	ВТ_Итог.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.пустаяссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итог.ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета,
	|	ВТ_Итог.Шкала,
	|	ВТ_Итог.ПриборУчета,
	|	ВТ_Итог.СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета,
	|	ВТ_Итог.ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета,
	|	ВТ_Итог.Тариф,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент,
	|	ВТ_Итог.ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора,
	|	ВТ_Итог.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыУслуг.ЕдиницаИзмерения КАК ЕдИзм,
	|	ВТ_Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Итог.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Итог.Шкала КАК Шкала,
	|	ВТ_Итог.Услуга КАК Услуга,
	|	ВТ_Итог.ПриборУчета КАК ПриборУчета,
	|	ВТ_Итог.СобственникСИ КАК СобственникСИ,
	|	ВТ_Итог.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВТ_Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_Итог.ПроцентПотерь КАК ПроцентПотерь,
	|	ВТ_Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	ВТ_Итог.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_Итог.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	бестГарантированныеОбъемыСрезПоследних.Месяц КАК Месяц,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_Итог.Тариф КАК Тариф,
	|	ВТ_Итог.ГоловнаяТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ВТ_Итог.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВТ_Итог.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И Год = ГОД(&Период)) КАК бестГарантированныеОбъемыСрезПоследних
	|		ПО ВТ_Итог.ОбъектРасчета = бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета
	|			И ВТ_Итог.Услуга = бестГарантированныеОбъемыСрезПоследних.Услуга
	|ГДЕ
	|	НЕ энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета,
	|	ТочкаУчета";

	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Период", 		ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("Район", 			ПараметрыОтчета.Район);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПоследнегоПакета = РезультатЗапроса.ВГраница();
	
	Если РезультатЗапроса[3].Пустой() ИЛИ РезультатЗапроса[ИндексПоследнегоПакета - 1].Пустой() И РезультатЗапроса[ИндексПоследнегоПакета].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение3_1МестаУстановкиПУ");
	
	ВыборкаШапкаПодвал 				= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 					= РезультатЗапроса[ИндексПоследнегоПакета - 1].Выбрать();
	ВыборкаДанные2 					= РезультатЗапроса[ИндексПоследнегоПакета - 1].Выбрать();
	ВыборкаДанныеБезПУ 				= РезультатЗапроса[ИндексПоследнегоПакета].Выбрать();
	
	ОбластьШапкаНачало  	 = Макет.ПолучитьОбласть("ШапкаНачало");
	ОбластьШапкаЗаголовок33  = Макет.ПолучитьОбласть("Заголовок33");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	ОбластьШапкаНачало.Параметры.Нумерация = "3.3"; 
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапкаНачало.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапкаНачало.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;	
	
	ОбластьШапкаНачало.Параметры.КодОбъекта = "";
	
	ТекКодОбъекта = Неопределено;
	
	Пока ВыборкаДанные2.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДанные2.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные2.НомерДоговора) + "_" + Строка(ВыборкаДанные2.КодОбъектаРасчета);
			Если КодОбъекта <> ТекКодОбъекта Тогда
				ОбластьШапкаНачало.Параметры.КодОбъекта = Строка(ОбластьШапкаНачало.Параметры.КодОбъекта) + ?(ЗначениеЗаполнено(ОбластьШапкаНачало.Параметры.КодОбъекта), ", ", "") + КодОбъекта;		
			КонецЕсли;
			ТекКодОбъекта = КодОбъекта;	
		КонецЕсли;	
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьШапкаНачало);
	ТабДок.Вывести(ОбластьШапкаЗаголовок33);
	
	Если Не РезультатЗапроса[ИндексПоследнегоПакета - 1].Пустой() Тогда
		
		ОбластьШапкаОкончание  	 = Макет.ПолучитьОбласть("ШапкаОкончание");
	    ТабДок.Вывести(ОбластьШапкаОкончание);
		
		Пока ВыборкаДанные.Следующий() Цикл                        
			ОбластьДанные = Макет.ПолучитьОбласть("Данные");
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, ВыборкаДанные); 
			Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
				КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);	
				ОбластьДанные.Параметры.КодОбъекта 	= КодОбъекта;
			КонецЕсли;
			ОбластьДанные.Параметры.Ток 			= Строка(ВыборкаДанные.I1) + "/" + ВыборкаДанные.I2;
			ОбластьДанные.Параметры.Напряжение 		= Строка(ВыборкаДанные.U1) + "/" + ВыборкаДанные.U2;
			ОбластьДанные.Параметры.ТарифнаяЗона	= ВРег(ОбластьДанные.Параметры.ТарифнаяЗона); 
			
			ТабДок.Вывести(ОбластьДанные);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не РезультатЗапроса[ИндексПоследнегоПакета].Пустой() Тогда
		ОбластьШапкаБезПУ = Макет.ПолучитьОбласть("ШапкаБезПУ");
		ТабДок.Вывести(ОбластьШапкаБезПУ);
		ТекТУ = Неопределено;
		ОбластьДанныеБезПУ = Неопределено;
		Пока ВыборкаДанныеБезПУ.Следующий() Цикл
			Если ТекТУ <> ВыборкаДанныеБезПУ.ТочкаУчета Тогда
				Если ОбластьДанныеБезПУ <> Неопределено Тогда
					ТабДок.Вывести(ОбластьДанныеБезПУ);
				КонецЕсли;			
				ОбластьДанныеБезПУ = Макет.ПолучитьОбласть("ДанныеБезПУ");
				ЗаполнитьЗначенияСвойств(ОбластьДанныеБезПУ.Параметры, ВыборкаДанныеБезПУ); 
				Если ЗначениеЗаполнено(ВыборкаДанныеБезПУ.КодОбъектаРасчета) Тогда
					КодОбъекта = Строка(ВыборкаДанныеБезПУ.НомерДоговора) + "_" + Строка(ВыборкаДанныеБезПУ.КодОбъектаРасчета);
					ОбластьДанныеБезПУ.Параметры.КодОбъекта  = КодОбъекта;
				КонецЕсли;				
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаДанныеБезПУ.Месяц) и ЗначениеЗаполнено(ВыборкаДанныеБезПУ.ОбъемУслуги) Тогда
				ОбластьДанныеБезПУ.Параметры["Объем" + ВыборкаДанныеБезПУ.Месяц] = ВыборкаДанныеБезПУ.ОбъемУслуги;
			КонецЕсли;
			ТекТУ = ВыборкаДанныеБезПУ.ТочкаУчета;			
		КонецЦикла;
		Если ОбластьДанныеБезПУ <> Неопределено  Тогда
			ТабДок.Вывести(ОбластьДанныеБезПУ);
		КонецЕсли;
		
	КонецЕсли;
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура СформироватьПриложение4(ТабДок, ПараметрыОтчета) Экспорт
	
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение4РасходЭлектрическойЭнергии");
		
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");                                    

	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;		
	
	Если мОбъектыРасчета.Количество() = 0 Тогда
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьПодвал);
		Возврат;
	КонецЕсли;                                       

	МВТ = Новый МенеджерВременныхТаблиц;
	бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(ПараметрыОтчета.Период, ПараметрыОтчета.Организация, ПараметрыОтчета.Район, мОбъектыРасчета, Истина,, МВТ, Истина,, Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК EmailКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация2.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация3.Представление КАК ФаксКонтрагента,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация2
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация2.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация2.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация3
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация3.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация3.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация,
	|	ВТ_ДоговорыКонтрагентов.EmailКонтрагента КАК EmailКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.ФаксКонтрагента КАК ФаксКонтрагента
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ОтборПоУслуге
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	Итог.Услуга = &Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтборПоУслуге.ОбъектРасчета КАК НаименованиеОбъекта,
	|	ОтборПоУслуге.Шкала КАК Шкала,
	|	ОтборПоУслуге.Услуга КАК Услуга,
	|	ОтборПоУслуге.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОтборПоУслуге.ПриборУчета КАК ПУ,
	|	ЕСТЬNULL(бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент, 0) КАК КоэфТрансформации,
	|	бестОбъектыРасчета.Код КАК КодОбъекта,
	|	энргШкалыПриборовУчета.Код КАК ШкалаКод,
	|	энргТарифныеЗоны.Код КАК ТарифнаяЗонаКод,
	|	энргТочкиУчета.Код КАК КодТУ
	|ПОМЕСТИТЬ ВТ_ОбъектыРасчета
	|ИЗ
	|	ОтборПоУслуге КАК ОтборПоУслуге
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестКоэффциентыПриборовУчетаНПСрезПоследних
	|		ПО ОтборПоУслуге.ТочкаУчета = бестКоэффциентыПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И (бестКоэффциентыПриборовУчетаНПСрезПоследних.ПриборУчета = ОтборПоУслуге.ПриборУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО ОтборПоУслуге.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргШкалыПриборовУчета КАК энргШкалыПриборовУчета
	|		ПО ОтборПоУслуге.Шкала = энргШкалыПриборовУчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТарифныеЗоны КАК энргТарифныеЗоны
	|		ПО ОтборПоУслуге.ТарифнаяЗона = энргТарифныеЗоны.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|		ПО ОтборПоУслуге.ТочкаУчета = энргТочкиУчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыРасчета.НаименованиеОбъекта КАК НаименованиеОбъекта,
	|	ВТ_ОбъектыРасчета.Шкала КАК Шкала,
	|	ВТ_ОбъектыРасчета.Услуга КАК Услуга,
	|	ВТ_ОбъектыРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_ОбъектыРасчета.ПУ КАК ПУ,
	|	ВТ_ОбъектыРасчета.КоэфТрансформации КАК КоэфТрансформации,
	|	ВТ_ОбъектыРасчета.КодОбъекта КАК КодОбъекта,
	|	ВТ_ОбъектыРасчета.ШкалаКод КАК ШкалаКод,
	|	ВТ_ОбъектыРасчета.ТарифнаяЗонаКод КАК ТарифнаяЗонаКод,
	|	ВТ_ОбъектыРасчета.КодТУ КАК КодТУ,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ОбъектыРасчета КАК ВТ_ОбъектыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ОбъектыРасчета.НаименованиеОбъекта = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.НаименованиеОбъекта КАК НаименованиеОбъекта,
	|	ВТ_КодОбъекта.Шкала КАК Шкала,
	|	ВТ_КодОбъекта.Услуга КАК Услуга,
	|	ВТ_КодОбъекта.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_КодОбъекта.ПУ КАК ПУ,
	|	ВТ_КодОбъекта.КоэфТрансформации КАК КоэфТрансформации,
	|	ВТ_КодОбъекта.ШкалаКод КАК ШкалаКод,
	|	ВТ_КодОбъекта.ТарифнаяЗонаКод КАК ТарифнаяЗонаКод,
	|	ВТ_КодОбъекта.КодТУ КАК КодТУ,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета";
	
	Запрос.УстановитьПараметр("Организация",ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Период", 	ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("Район", 		ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("Договор",	ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Услуга",		Справочники.энргВидыУслуг.НайтиПоНаименованию("Электроэнергия"));
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 	= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 		= РезультатЗапроса[5].Выбрать();
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");			
		ОбластьПодвал.Параметры.ДатаДоговора = Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Пока ВыборкаДанные.Следующий() Цикл
		ОбластьСтрокаПоказаний = Макет.ПолучитьОбласть("СтрокаПоказаний");
		Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);
			ОбластьСтрокаПоказаний.Параметры.КодОбъекта 			= КодОбъекта;	
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаПоказаний.Параметры,ВыборкаДанные);
		ТабДок.Вывести(ОбластьСтрокаПоказаний);
	КонецЦикла;
		                                                          
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры	

Процедура СформироватьПриложение4_1(ТабДок, ПараметрыОтчета) Экспорт
	
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение4_1ПочасовоеПотребление");
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");

	РезультатОбъектыРасчета = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(ПараметрыОтчета.Организация, ПараметрыОтчета.Район, ПараметрыОтчета.Период, ПараметрыОтчета.Договор, ПараметрыОтчета.ОбъектыРасчета, , , , Ложь);
	
	ОбъектыРасчета = РезультатОбъектыРасчета.Выгрузить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	ОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ВТОбъектыРасчета
	|ИЗ
	|	&ОбъектыРасчета КАК ОбъектыРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыТочекУчетаНП.ПриборУчета КАК ПриборУчета,
	|	энргТочкиУчета.Код КАК Код
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			(Организация, Район, ОбъектРасчета) В
	|				(ВЫБРАТЬ
	|					ВТОбъектыРасчета.Организация,
	|					ВТОбъектыРасчета.Район,
	|					ВТОбъектыРасчета.ОбъектРасчета
	|				ИЗ
	|					ВТОбъектыРасчета КАК ВТОбъектыРасчета)) КАК бестПриборыТочекУчетаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|		ПО бестПриборыТочекУчетаНП.ТочкаУчета = энргТочкиУчета.Ссылка";
	
	Запрос.УстановитьПараметр("Период", ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("Район", ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ОбъектыРасчета", ОбъектыРасчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                                                                   
		
		ОбластьШапка.Параметры.ПУ 						= ВыборкаДетальныеЗаписи.ПриборУчета;				
		ОбластьШапка.Параметры.ТочкаУчета 				= ВыборкаДетальныеЗаписи.ТочкаУчета;
		ОбластьШапка.Параметры.КодТУ 					= ВыборкаДетальныеЗаписи.Код;
		ОбластьШапка.Параметры.Период 					= Формат(ПараметрыОтчета.Период, "ДЛФ=D");
		ОбластьШапка.Параметры.Контрагент 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Договор, "Контрагент");
		ОбластьШапка.Параметры.НомерДоговора 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Договор, "Номер");
		ОбластьШапка.Параметры.ДатаДоговора 			= Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Договор, "Дата"), "ДЛФ=D");
		
		ОбластьПодвал.Параметры.Контрагент 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Договор, "Контрагент");
		ОбластьПодвал.Параметры.Организация 			= ПараметрыОтчета.Организация;
		
		ТабДок.Вывести(ОбластьШапка);
		
		пДень = НачалоМесяца(ПараметрыОтчета.Период);                     
		
		Пока Месяц(ПараметрыОтчета.Период) = Месяц(пДень) Цикл
			ОбластьДанные.Параметры.День 			= Формат(пДень,"ДЛФ=D");                                                                
			ТабДок.Вывести(ОбластьДанные);
			пДень = пДень + 86400;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПодвал);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла
	
КонецПроцедуры

Процедура СформироватьПриложение6(ТабДок, ПараметрыОтчета) Экспорт
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение6ГрафикиОграничения");
	
	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГрафикиРежимаОграничения.Услуга КАК Услуга,
	|	бестГрафикиРежимаОграничения.Месяц КАК Месяц,
	|	бестГрафикиРежимаОграничения.КодРежима КАК КодРежима,
	|	бестГрафикиРежимаОграничения.Значение КАК Значение,
	|	энргВидыУслуг.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	бестГрафикиРежимаОграничения.ОбъектРасчета КАК ОбъектРасчета,
	|	энргВидыУслуг.бестИспользоватьРасчетПоМощности КАК ИспользоватьРасчетПоМощности,
	|	бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК АдресОбъекта
	|ИЗ
	|	РегистрСведений.бестГрафикиРежимаОграничения КАК бестГрафикиРежимаОграничения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестГрафикиРежимаОграничения.Услуга = энргВидыУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	|		ПО бестГрафикиРежимаОграничения.ОбъектРасчета = бестОбъектыРасчетаКонтактнаяИнформация.Ссылка
	|			И (бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета))
	|			И (НЕ бестГрафикиРежимаОграничения.КодРежима = 0)
	|ГДЕ
	|	бестГрафикиРежимаОграничения.Организация = &Организация
	|	И бестГрафикиРежимаОграничения.Район = &Район
	|	И бестГрафикиРежимаОграничения.ОбъектРасчета В(&мОбъектыРасчета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектРасчета,
	|	ИспользоватьРасчетПоМощности УБЫВ,
	|	Услуга,
	|	Месяц";
	
	Запрос.УстановитьПараметр("мОбъектыРасчета",мОбъектыРасчета);
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Район", 			ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 	= РезультатЗапроса[0].Выбрать();
	ВыборкаДанные 		= РезультатЗапроса[1].Выбрать();
	
	ДатаДоговораГод = "";
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ДатаДоговораГод 						= Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДФ=yyyy");
		ОбластьШапка.Параметры.ДатаДоговора 	= Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьШапка);
	
	ТекОбъектРасчета = Неопределено;
	ТекМесяц 		 = Неопределено;
	ТекУслуга 		 = Неопределено;
	ОбластьДанные	 = Неопределено;
	Пока ВыборкаДанные.Следующий() Цикл
		Если ВыборкаДанные.ОбъектРасчета <> ТекОбъектРасчета ИЛИ ВыборкаДанные.Месяц <> ТекМесяц ИЛИ ВыборкаДанные.Услуга <> ТекУслуга Тогда
			Если ОбластьДанные <> Неопределено Тогда
				ТабДок.Вывести(ОбластьДанные);
			КонецЕсли;
			ОбластьДанные = ?(ВыборкаДанные.ИспользоватьРасчетПоМощности, Макет.ПолучитьОбласть("ДанныеМощность"),Макет.ПолучитьОбласть("ДанныеЭЭ"));
		КонецЕсли;
		
		Если ВыборкаДанные.ОбъектРасчета <> ТекОбъектРасчета Тогда
			ОбластьШапкаМощность = Макет.ПолучитьОбласть("ШапкаМощность");
			ЗаполнитьЗначенияСвойств(ОбластьШапкаМощность.Параметры, ВыборкаДанные);
			ОбластьШапкаМощность.Параметры.ДатаДоговораГод 		= ДатаДоговораГод;
			ТабДок.Вывести(ОбластьШапкаМощность);
		КонецЕсли;
		
		Если НЕ ВыборкаДанные.ИспользоватьРасчетПоМощности И (ВыборкаДанные.ОбъектРасчета <> ТекОбъектРасчета ИЛИ ВыборкаДанные.Услуга <> ТекУслуга) Тогда
			ОбластьШапкаЭЭ = Макет.ПолучитьОбласть("ШапкаЭЭ");
			ЗаполнитьЗначенияСвойств(ОбластьШапкаЭЭ.Параметры, ВыборкаДанные);
			ТабДок.Вывести(ОбластьШапкаЭЭ);
		КонецЕсли;
		
		
		ОбластьДанные.Параметры.ЕдИзм 									= ВыборкаДанные.ЕдиницаИзмерения;
		ОбластьДанные.Параметры.Месяц 									= Формат(ДобавитьМесяц(Дата("00020101"), ВыборкаДанные.Месяц - 1), "ДФ='MMMM'");
		ОбластьДанные.Параметры["Параметр" + ВыборкаДанные.КодРежима] 	= ВыборкаДанные.Значение;

		ТекОбъектРасчета = ВыборкаДанные.ОбъектРасчета;
		ТекМесяц 		 = ВыборкаДанные.Месяц;
		ТекУслуга 		 = ВыборкаДанные.Услуга;
	КонецЦикла;
	
	Если ОбластьДанные <> Неопределено Тогда
		ТабДок.Вывести(ОбластьДанные);
	КонецЕсли;
	
	
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура СформироватьПриложениеА(ТабДок, ПараметрыОтчета) Экспорт
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_СписокОбъектовПриложениеА");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК Адрес,
	|	бестОбъектыРасчета.Ссылка КАК ОбъектРасчета,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВЫБОР
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
	|				ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК)
	|			ТОГДА ""Двуставочный""
	|		ИНАЧЕ ""Одноставочный""
	|	КОНЕЦ КАК Тариф
	|ПОМЕСТИТЬ ВТ_ОбъектыРасчета
	|ИЗ
	|	Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО бестОбъектыРасчета.Ссылка = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	|		ПО (бестОбъектыРасчетаКонтактнаяИнформация.Ссылка = бестОбъектыРасчета.Ссылка)
	|			И (бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета))
	|ГДЕ
	|	бестОбъектыРасчета.Ссылка В(&мОбъектыРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыРасчета.Адрес КАК Адрес,
	|	ВТ_ОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ОбъектыРасчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_ОбъектыРасчета.Тариф КАК Тариф,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ОбъектыРасчета КАК ВТ_ОбъектыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ОбъектыРасчета.ОбъектРасчета = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.Адрес КАК Адрес,
	|	ВТ_КодОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_КодОбъекта.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ВТ_КодОбъекта.Тариф КАК Тариф,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета";
	
	Запрос.УстановитьПараметр("мОбъектыРасчета",мОбъектыРасчета);
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Район", 			ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Период", 		ПараметрыОтчета.Период);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 	= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 		= РезультатЗапроса[4].Выбрать();
	ВыборкаДанные2 		= РезультатЗапроса[4].Выбрать();
	
	ДатаДоговораГод = "";
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора 	= Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;	
	
	ТабДок.Вывести(ОбластьШапка);
	
	ТекОбъектРасчета = Неопределено;
	ОбластьДанные	 = Неопределено;
	СчетчикСтрок = 1;
	Пока ВыборкаДанные.Следующий() Цикл
		Если ВыборкаДанные.ОбъектРасчета <> ТекОбъектРасчета Тогда
			Если ОбластьДанные <> Неопределено Тогда
				ТабДок.Вывести(ОбластьДанные);
			КонецЕсли;
			ОбластьДанные =  Макет.ПолучитьОбласть("Данные");
			
			Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
				КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);
				ОбластьДанные.Параметры.КодОбъекта 			= КодОбъекта;	
			КонецЕсли;           
			
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, ВыборкаДанные);
			ОбластьДанные.Параметры.Номер 		= СчетчикСтрок;
			СчетчикСтрок = СчетчикСтрок + 1;
		КонецЕсли;
		
		ТекОбъектРасчета = ВыборкаДанные.ОбъектРасчета;
	КонецЦикла;
	
	Если ОбластьДанные <> Неопределено Тогда
		ТабДок.Вывести(ОбластьДанные);
	КонецЕсли;
	
	
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура СформироватьПриложение9(ТабДок, ПараметрыОтчета) Экспорт
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_ВеличинаБрониПриложение9");
	
	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;

	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
	Если мОбъектыРасчета.Количество() = 0 Тогда
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьПодвал);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация,
	|	ВТ_ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестОбъектыРасчета.Ссылка КАК ОбъектРасчета,
	|	бестРежимыПотребленияСрезПоследних.НагрузкаЭлектроприемника КАК НагрузкаЭлектроприемника,
	|	ВЫБОР
	|		КОГДА бестРежимыПотребленияСрезПоследних.НаличиеГенерирующихУстановок
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК НаличиеГенерирующихУстановок,
	|	бестВеличиныБрониСрезПоследних.Услуга КАК Услуга,
	|	бестВеличиныБрониСрезПоследних.Сезонность КАК Сезонность,
	|	бестВеличиныБрониСрезПоследних.ТипБрони КАК ТипБрони,
	|	бестВеличиныБрониСрезПоследних.ЗначениеБрони КАК ЗначениеБрони,
	|	бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ТочкаПоставки КАК ТочкаПоставки
	|ПОМЕСТИТЬ ВТ_ТаблицаДляСвязывания
	|ИЗ
	|	РегистрСведений.бестРежимыПотребления.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестРежимыПотребленияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестВеличиныБрони.СрезПоследних(
	|					&Период,
	|					Организация = &Организация
	|						И Район = &Район) КАК бестВеличиныБрониСрезПоследних
	|			ПО бестОбъектыРасчета.Ссылка = бестВеличиныБрониСрезПоследних.ОбъектРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТочкиПоставкиОбъектовРасчета.СрезПоследних(
	|					&Период,
	|					Организация = &Организация
	|						И Район = &Район) КАК бестТочкиПоставкиОбъектовРасчетаСрезПоследних
	|			ПО бестОбъектыРасчета.Ссылка = бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ОбъектРасчета
	|		ПО бестРежимыПотребленияСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	бестОбъектыРасчета.Ссылка В(&мОбъектыРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДляСвязывания.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ТаблицаДляСвязывания.НагрузкаЭлектроприемника КАК НагрузкаЭлектроприемника,
	|	ВТ_ТаблицаДляСвязывания.НаличиеГенерирующихУстановок КАК НаличиеГенерирующихУстановок,
	|	ВТ_ТаблицаДляСвязывания.Услуга КАК Услуга,
	|	ВТ_ТаблицаДляСвязывания.Сезонность КАК Сезонность,
	|	ВТ_ТаблицаДляСвязывания.ТипБрони КАК ТипБрони,
	|	ВТ_ТаблицаДляСвязывания.ЗначениеБрони КАК ЗначениеБрони,
	|	ВТ_ТаблицаДляСвязывания.ТочкаПоставки КАК ТочкаПоставки,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_КодОбъекта
	|ИЗ
	|	ВТ_ТаблицаДляСвязывания КАК ВТ_ТаблицаДляСвязывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО ВТ_ТаблицаДляСвязывания.ОбъектРасчета = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КодОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_КодОбъекта.НагрузкаЭлектроприемника КАК НагрузкаЭлектроприемника,
	|	ВТ_КодОбъекта.НаличиеГенерирующихУстановок КАК НаличиеГенерирующихУстановок,
	|	ВТ_КодОбъекта.Услуга КАК Услуга,
	|	ВТ_КодОбъекта.Сезонность КАК Сезонность,
	|	ВТ_КодОбъекта.ТипБрони КАК ТипБрони,
	|	ВТ_КодОбъекта.ЗначениеБрони КАК ЗначениеБрони,
	|	МАКСИМУМ(ВТ_КодОбъекта.ТочкаПоставки) КАК ТочкаПоставки,
	|	ВТ_КодОбъекта.КодОбъектаРасчета КАК КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	ВТ_КодОбъекта КАК ВТ_КодОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|		ПО ВТ_КодОбъекта.Договор = ВТ_ДоговорыКонтрагентов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КодОбъекта.ОбъектРасчета,
	|	ВТ_КодОбъекта.НагрузкаЭлектроприемника,
	|	ВТ_КодОбъекта.НаличиеГенерирующихУстановок,
	|	ВТ_КодОбъекта.Услуга,
	|	ВТ_КодОбъекта.Сезонность,
	|	ВТ_КодОбъекта.ТипБрони,
	|	ВТ_КодОбъекта.ЗначениеБрони,
	|	ВТ_КодОбъекта.КодОбъектаРасчета,
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДоговора,
	|	КодОбъектаРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.Договор.Представление КАК ДоговорПредставление,
	|	ВЫРАЗИТЬ(бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК СТРОКА(300)) КАК АдресПредставление,
	|	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента.Представление КАК ОбъектРасчетаСубабонентаПредставление
	|ИЗ
	|	Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ОбъектРасчета В (&мОбъектыРасчета)) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|			ПО бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|		ПО (бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента = бестОбъектыРасчетаКонтактнаяИнформация.Ссылка)
	|			И (бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета))";
	
	Запрос.УстановитьПараметр("мОбъектыРасчета",мОбъектыРасчета);
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Район", 			ПараметрыОтчета.Район);
	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
	Запрос.УстановитьПараметр("Период", 		ПараметрыОтчета.Период);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 				= РезультатЗапроса[1].Выбрать();
	ВыборкаДанные 					= РезультатЗапроса[4].Выбрать();
	ВыборкаДанные2 					= РезультатЗапроса[4].Выбрать();
	ВыборкаТранзит					= РезультатЗапроса[5].Выбрать();

	мТочек = РезультатЗапроса[4].Выгрузить().ВыгрузитьКолонку("ТочкаПоставки");
	
	СоответствиеКатегорийНапряжения = РегистрыСведений.энргКатегорииНадежностиТочекПоставок.ПолучитьКатегорииНапряжения(ПараметрыОтчета.Период, мТочек);
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора 	= Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
	КонецЕсли;	
	
	ТекОбъектРасчета = Неопределено;
	ОбластьДанные	 = Неопределено;
	ТБ = "";
	АБ = "";
	
	ОбластьШапка.Параметры.КодОбъекта = "";
	
	ТекКодОбъекта = Неопределено;
	
	Пока ВыборкаДанные2.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДанные2.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(ВыборкаДанные2.НомерДоговора) + "_" + Строка(ВыборкаДанные2.КодОбъектаРасчета);
			Если КодОбъекта <> ТекКодОбъекта Тогда
				ОбластьШапка.Параметры.КодОбъекта = Строка(ОбластьШапка.Параметры.КодОбъекта) + ?(ЗначениеЗаполнено(ОбластьШапка.Параметры.КодОбъекта), ", ", "") + КодОбъекта;		
			КонецЕсли;
			ТекКодОбъекта = КодОбъекта;	
		КонецЕсли;	
	КонецЦикла;

	ТабДок.Вывести(ОбластьШапка);
	ТранзитШаблон = НСтр("ru = '%1%2<%3>, %4, %5'");
	Пока ВыборкаДанные.Следующий() Цикл
		Если ВыборкаДанные.ОбъектРасчета <> ТекОбъектРасчета Тогда
			Если ОбластьДанные <> Неопределено Тогда
				ОбластьДанные.Параметры.ТБ  	   	= ТБ;
				ОбластьДанные.Параметры.АБ 			= АБ;
				ТабДок.Вывести(ОбластьДанные);
			КонецЕсли;
			ТБ = "";
			АБ = "";
			ОбластьДанные = Макет.ПолучитьОбласть("Данные");                                                                  
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, ВыборкаДанные);
			
			Транзит = "";
			СимволПереноса = "";
			Пока ВыборкаТранзит.НайтиСледующий(ВыборкаДанные.ОбъектРасчета, "ОбъектРасчета") Цикл
				Если Не Транзит = "" Тогда
					СимволПереноса = Символы.ПС;
				КонецЕсли;
				Транзит = СтрШаблон(ТранзитШаблон,
									Транзит,
									СимволПереноса,
									ВыборкаТранзит.ДоговорПредставление, 
									ВыборкаТранзит.АдресПредставление, 
									ВыборкаТранзит.ОбъектРасчетаСубабонентаПредставление);
			КонецЦикла;
			ВыборкаТранзит.Сбросить();					
			Если Транзит = "" Тогда
				Транзит = НСтр("ru = 'Нет'");
			КонецЕсли;
			ОбластьДанные.Параметры.Транзит = Транзит;
				
			Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
				КодОбъекта = Строка(ВыборкаДанные.НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);
				ОбластьДанные.Параметры.КодОбъекта 	= КодОбъекта;
			КонецЕсли;

			Если СоответствиеКатегорийНапряжения[ВыборкаДанные.ТочкаПоставки] <> Неопределено Тогда
				ОбластьДанные.Параметры.КатегорияНадежности = СоответствиеКатегорийНапряжения[ВыборкаДанные.ТочкаПоставки];
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаДанные.ТипБрони = Перечисления.бестТипБрониЭлектроснабжения.Технологическая Тогда
			ТБ 	= ТБ + ВыборкаДанные.Сезонность + " " + ВыборкаДанные.Услуга + ": " + ВыборкаДанные.ЗначениеБрони + "; ";
		ИначеЕсли ВыборкаДанные.ТипБрони = Перечисления.бестТипБрониЭлектроснабжения.Аварийная Тогда
			АБ 	= АБ + ВыборкаДанные.Сезонность + " " + ВыборкаДанные.Услуга + ": " + ВыборкаДанные.ЗначениеБрони + "; ";
		КонецЕсли;
		ТекОбъектРасчета = ВыборкаДанные.ОбъектРасчета;
	КонецЦикла;
	
	Если ОбластьДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(КодОбъекта) Тогда	
			ОбластьДанные.Параметры.КодОбъекта 	= КодОбъекта;
		КонецЕсли;
		ОбластьДанные.Параметры.ТБ = ТБ;
		ОбластьДанные.Параметры.АБ = АБ;
		ТабДок.Вывести(ОбластьДанные);
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура СформироватьПриложение5(ТабДок, ПараметрыОтчета) Экспорт
	
	Макет = Отчеты.бестПечатьПриложенийКДоговору.ПолучитьМакет("ПФ_MXL_Приложение5");
	
	мОбъектыРасчета = ПараметрыОтчета.ОбъектыРасчета;

	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСведения  = Макет.ПолучитьОбласть("Сведения");
	ОбластьДанные  = Макет.ПолучитьОбласть("ДанныеОбъектаРасчета");
	ОбластьСведенияПродолжение  = Макет.ПолучитьОбласть("СведенияПродолжение");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
	Если мОбъектыРасчета.Количество() = 0 Тогда
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьПодвал);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактАдресКонтрагента,
	|	энргДоговорыКонтрагентов.Организация КАК Организация,
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|ГДЕ
	|	энргДоговорыКонтрагентов.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыКонтрагентов.НомерДоговора КАК НомерДоговора,
	|	ВТ_ДоговорыКонтрагентов.ДатаДоговора КАК ДатаДоговора,
	|	ВТ_ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыКонтрагентов.ФактАдресКонтрагента КАК ФактАдресКонтрагента,
	|	ВТ_ДоговорыКонтрагентов.Организация КАК Организация,
	|	ВТ_ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ДоговорыКонтрагентов КАК ВТ_ДоговорыКонтрагентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъектыРасчета.Ссылка КАК ОбъектРасчета,
	|	бестОбъектыРасчета.Представление КАК Представление,
	|	бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК АдресОбъектаРасчета,
	|	рксОбъектыРасчетаДополнительныеРеквизиты.КодОбъектаРасчета КАК КодОбъектаРасчета
	|ИЗ
	|	Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	|		ПО (бестОбъектыРасчетаКонтактнаяИнформация.Ссылка = бестОбъектыРасчета.Ссылка)
	|			И (бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОбъектыРасчетаДополнительныеРеквизиты КАК рксОбъектыРасчетаДополнительныеРеквизиты
	|		ПО бестОбъектыРасчета.Ссылка = рксОбъектыРасчетаДополнительныеРеквизиты.ОбъектРасчета
	|ГДЕ
	|	бестОбъектыРасчета.Ссылка В(&мОбъектыРасчета)";
	
	Запрос.УстановитьПараметр("мОбъектыРасчета",мОбъектыРасчета);
	Запрос.УстановитьПараметр("Договор", 		ПараметрыОтчета.Договор);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапкаПодвал 				= РезультатЗапроса.Получить(1).Выбрать();
	ВыборкаДанные 					= РезультатЗапроса.Получить(2).Выбрать();
	НомерДоговор = "";
	
	ОбластьПодвал.Параметры.ДатаПриложения = Формат(ПараметрыОтчета.Период, "ДЛФ=D");
	
	Если ВыборкаШапкаПодвал.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаШапкаПодвал);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаШапкаПодвал);
		ОбластьШапка.Параметры.ДатаДоговора 	= Формат(ВыборкаШапкаПодвал.ДатаДоговора, "ДЛФ=D");
		НомерДоговора = ВыборкаШапкаПодвал.НомерДоговора;
	КонецЕсли;	
	
	ТекОбъектРасчета = Неопределено;
	
	ОбластьШапка.Параметры.КодОбъекта = "";
	
	ТекКодОбъекта = Неопределено;
	
	Пока ВыборкаДанные.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДанные.КодОбъектаРасчета) Тогда
			КодОбъекта = Строка(НомерДоговора) + "_" + Строка(ВыборкаДанные.КодОбъектаРасчета);
			Если КодОбъекта <> ТекКодОбъекта Тогда
				ОбластьШапка.Параметры.КодОбъекта = Строка(ОбластьШапка.Параметры.КодОбъекта) + ?(ЗначениеЗаполнено(ОбластьШапка.Параметры.КодОбъекта), ", ", "") + КодОбъекта;		
			КонецЕсли;
			ТекКодОбъекта = КодОбъекта;	
		КонецЕсли;	
	КонецЦикла;

	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьСведения);
	ВыборкаДанные.Сбросить();
	ШаблонПредставлениеОбъекта = НСтр("ru = '%1_%2 %3'");
	Пока ВыборкаДанные.Следующий() Цикл
		ОбластьДанные.Параметры.Заполнить(ВыборкаДанные);
		ОбластьДанные.Параметры.ПредставлениеОбъектаРасчета = СтрШаблон(ШаблонПредставлениеОбъекта, 
																		НомерДоговора, 
																		ВыборкаДанные.КодОбъектаРасчета, 
																		ВыборкаДанные.Представление);
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьСведенияПродолжение);
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли