#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ОсновныеРеквизиты = Новый Структура;
	ОсновныеРеквизиты.Вставить("Ссылка", Ссылка);
	ОсновныеРеквизиты.Вставить("Дата", Дата);
	ОсновныеРеквизиты.Вставить("Организация", Организация);
	ОсновныеРеквизиты.Вставить("Район", Район);
	ОсновныеРеквизиты.Вставить("Услуга", Услуга);
	
	Документы.энргУстановитьДиапазоныДифференцированногоТарифа.
		ЕстьДубликатДокумента(ОсновныеРеквизиты); 
		
	Ответственный = Пользователи.ТекущийПользователь();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
  	
	Документы.энргУстановитьДиапазоныДифференцированногоТарифа.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	ПроверитьДиапазоны();
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДиапазоны()
	
	Ошибки = Новый Массив; 
	ТекИдентификатор = Неопределено;
	КонецДиапазона = 0;
	ТаблицаДанных = ДополнительныеСвойства.ТаблицыДвижений[0].Выгрузить();
	ТаблицаДанных.Сортировать("Услуга Возр, ВидБлагоустройства Возр, ИдентификаторСтроки Возр, От Возр");
	Для Каждого Выборка Из ТаблицаДанных Цикл 
		
		Если НЕ ТекИдентификатор = Выборка.ИдентификаторСтроки Тогда 
			КонецДиапазона = Выборка.До + 1;
			ТекИдентификатор = Выборка.ИдентификаторСтроки;
			Продолжить;
		КонецЕсли;     
		
		Если НЕ КонецДиапазона = Выборка.От Тогда
			Ошибки.Добавить(Выборка.ВидБлагоустройства);			
		КонецЕсли;
		
		Если Выборка.От >= Выборка.До Тогда
			Ошибки.Добавить(Выборка.ВидБлагоустройства);			
		КонецЕсли;
		
		КонецДиапазона = Выборка.До + 1;
		ТекИдентификатор = Выборка.ИдентификаторСтроки;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда 
		
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(Ошибки);
		Комментарий = "Не корректно заполнены диапазоны для видов благоустройств: " + 
		Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
		
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
				
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли