#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),		Движения.бестТочкиПоставкиОбъектовРасчета);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестУстановитьТочкиПоставкиНаОбъектРасчета.Организация КАК Организация,
		|	бестУстановитьТочкиПоставкиНаОбъектРасчета.Район КАК Район,
		|	бестУстановитьТочкиПоставкиНаОбъектРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестУстановитьТочкиПоставкиНаОбъектРасчета.Дата КАК Период,
		|	бестУстановитьТочкиПоставкиНаОбъектРасчетаТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
		|	бестОбъектыРасчета.МКД КАК МКД
		|ИЗ
		|	Документ.бестУстановитьТочкиПоставкиНаОбъектРасчета.ТочкиПоставки КАК бестУстановитьТочкиПоставкиНаОбъектРасчетаТочкиПоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьТочкиПоставкиНаОбъектРасчета КАК бестУстановитьТочкиПоставкиНаОбъектРасчета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|			ПО бестУстановитьТочкиПоставкиНаОбъектРасчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|		ПО бестУстановитьТочкиПоставкиНаОбъектРасчетаТочкиПоставки.Ссылка = бестУстановитьТочкиПоставкиНаОбъектРасчета.Ссылка
		|ГДЕ
		|	бестУстановитьТочкиПоставкиНаОбъектРасчета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли