#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("МассивПриборов",МассивПриборов());
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(ТочкиУчета) Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ТЧ документа не заполнена");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 	
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
					
	бестРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеПоказанийПриборовУчета(),Движения);
	
	ДанныеШапки 		= ДанныеШапки();
	
	СоотвествиеКолонок 	= Новый Структура;
	СоотвествиеКолонок.Вставить("ПриборУчета",				"ПриборУчета");
	СоотвествиеКолонок.Вставить("ТекущиеПоказания",			"ТекущиеПоказания");
	СоотвествиеКолонок.Вставить("ТочкаУчета",				"ТочкаУчета");

	
	бестРаботаСПоставщикамиПомещенийСервер.ЗаписатьПоставщикаУслуг(ДанныеШапки,Движения,"ПоставщикПосле");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Функция ДанныеШапки() 	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					Дата);
	ДанныеШапки.Вставить("Район",					Район); 
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	ДанныеШапки.Вставить("ТочкиУчета",				ТочкиУчета);
	ДанныеШапки.Вставить("Документ",				Ссылка);  	
	ДанныеШапки.Вставить("ИмяДокумента",			"бестСменаПоставщикаНП");
	Возврат ДанныеШапки;	
КонецФункции

Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	&ОбъектРасчета КАК ОбъектРасчета,
	|	&МКД КАК МКД,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.бестСменаПоставщикаНП.ТочкиУчета КАК ТаблицаТочекУчета
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И ТаблицаТочекУчета.Ссылка = &Ссылка";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());

	
КонецФункции

Функция ДанныеПоказанийПриборовУчета()  	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.Текст	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТаблицаПоказанийПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ВложенныйЗапрос.КС КАК КС,
	|	ТаблицаПоказанийПриборовУчета.Переворот КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Период КАК ПериодРегистрации,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаПоказанийПриборовУчета.Разница КАК Разница
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	|		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаШкал.Шкала КАК Шкала,
	|		ТаблицаШкал.IDСтроки КАК IDСтроки,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ТаблицаДокумента.Район КАК Район,
	|		ТаблицаДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|		ТаблицаДокумента.ОбъектРасчета.МКД КАК МКД,
	|		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаДокумента.Дата КАК Период,
	|		ЛОЖЬ КАК КС
	|	ИЗ
	|		Документ.бестСменаПоставщикаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестСменаПоставщикаНП.ШкалыПриборовУчета КАК ТаблицаШкал
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	|				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	|				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестСменаПоставщикаНП КАК ТаблицаДокумента
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестСменаПоставщикаНП.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ПриборУчета";
	
	Возврат Запрос.Выполнить();  	
КонецФункции 

#КонецОбласти

#КонецЕсли