#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Район") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"Район", Параметры.Район);
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"Организация", Параметры.Организация);
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"Договор", Параметры.Договор);
	КонецЕсли;
	Если Параметры.Свойство("КонецПериода") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Пеня,"КонецПериода", Параметры.КонецПериода);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
