#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Удалось ли очистить набор записей.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  РазделЗаписи		-	ПеречислениеСсылка.энргРазделыЗаписи.
//  МКД					-	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//   Булево.
//
Функция УдалосьОчиститьНаборЗаписей(Организация, ПериодНачисления, Район, РазделЗаписи, МКД = Неопределено) Экспорт 
	
	Набор 								= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	Набор.Отбор.Район.Установить(Район);
	Набор.Отбор.РазделЗаписи.Установить(РазделЗаписи);
	Если Не МКД = Неопределено Тогда
		ЧастныйСектор 					= НЕ ЗначениеЗаполнено(МКД);
		Набор.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
		Если Не ЧастныйСектор Тогда
			Набор.Отбор.Строение.Установить(МКД);
		КонецЕсли; 			
	КонецЕсли;
	
	Попытка
		Набор.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли