#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет значение индивидуальных площадей коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеИндивидуальныхПлощадейКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаЗначениеИндивидуальныхПлощадейКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, МКД";
		ИмяТаблицы 					= "СтабильныеПериодыНП";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
КонецПроцедуры

// Заполняет значение индивидуальных площадей МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеИндивидуальныхПлощадейМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначениеИндивидуальныхПлощадейМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ПериодНачисления, МКД";
		ИмяТаблицы 					= "СтабильныеПериодыНП";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначениеИндивидуальныхПлощадейМКД() 
	Текст  = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыГруппировка.Организация КАК Организация,
	|	СтабильныеПериодыГруппировка.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыГруппировка.Район КАК Район,
	|	СтабильныеПериодыГруппировка.МКД КАК МКД,
	|	СтабильныеПериодыГруппировка.ОбъектРасчетаПомещение КАК ОбъектРасчетаПомещение,
	|	СтабильныеПериодыГруппировка.Услуга КАК Услуга,
	|	СтабильныеПериодыГруппировка.ЗначениеПлощади + СтабильныеПериодыГруппировка.ПлощадьСобственнаяПоставка КАК ЗначениеПлощади,
	|	СтабильныеПериодыГруппировка.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыНП.Организация КАК Организация,
	|		СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыНП.Район КАК Район,
	|		СтабильныеПериодыНП.МКД КАК МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК ОбъектРасчетаПомещение,
	|		СтабильныеПериодыНП.Услуга КАК Услуга,
	|		МАКСИМУМ(СтабильныеПериодыНП.ЗначениеПлощади) КАК ЗначениеПлощади,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА СтабильныеПериодыНП.Поставщик = СтабильныеПериодыНП.Договор.Контрагент
	|					ТОГДА СтабильныеПериодыНП.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СтабильныеПериодыНП.Организация КАК Организация,
	|			СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|			СтабильныеПериодыНП.Район КАК Район,
	|			СтабильныеПериодыНП.МКД КАК МКД,
	|			СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|			СтабильныеПериодыНП.Услуга КАК Услуга,
	|			СтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(СтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|			СтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|			СтабильныеПериодыНП.Договор КАК Договор
	|		ИЗ
	|			РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|		ГДЕ
	|			СтабильныеПериодыНП.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтабильныеПериодыНП.Организация,
	|			СтабильныеПериодыНП.ПериодНачисления,
	|			СтабильныеПериодыНП.Район,
	|			СтабильныеПериодыНП.Услуга,
	|			СтабильныеПериодыНП.ТочкаУчета,
	|			СтабильныеПериодыНП.ОбъектРасчета,
	|			СтабильныеПериодыНП.Договор,
	|			СтабильныеПериодыНП.МКД,
	|			СтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|			ПО ВложенныйЗапрос.Организация = СтабильныеПериодыНП.Организация
	|				И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериодыНП.ПериодНачисления
	|				И ВложенныйЗапрос.Район = СтабильныеПериодыНП.Район
	|				И ВложенныйЗапрос.Услуга = СтабильныеПериодыНП.Услуга
	|				И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериодыНП.ТочкаУчета
	|				И ВложенныйЗапрос.НомерПозиции = СтабильныеПериодыНП.НомерПозиции
	|				И ВложенныйЗапрос.ОбъектРасчета = СтабильныеПериодыНП.ОбъектРасчета
	|				И ВложенныйЗапрос.Договор = СтабильныеПериодыНП.Договор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериодыНП.Организация,
	|		СтабильныеПериодыНП.ПериодНачисления,
	|		СтабильныеПериодыНП.Район,
	|		СтабильныеПериодыНП.Услуга,
	|		СтабильныеПериодыНП.МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК СтабильныеПериодыГруппировка";
	
	Возврат Текст;
	
КонецФункции

Функция ТексЗапросаЗначениеИндивидуальныхПлощадейКоллекцияПериодов()
	
	Текст = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыНП.Организация КАК Организация,
	|	СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНП.Район КАК Район,
	|	СтабильныеПериодыНП.МКД КАК МКД,
	|	СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|	СтабильныеПериодыНП.Услуга КАК Услуга,
	|	МАКСИМУМ(СтабильныеПериодыНП.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	СУММА(ВЫБОР
	|			КОГДА СтабильныеПериодыНП.Поставщик = СтабильныеПериодыНП.Договор.Контрагент
	|				ТОГДА СтабильныеПериодыНП.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыНП.Организация КАК Организация,
	|		СтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыНП.Район КАК Район,
	|		СтабильныеПериодыНП.МКД КАК МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение КАК Помещение,
	|		СтабильныеПериодыНП.Услуга КАК Услуга,
	|		СтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(СтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|		СтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета,
	|		СтабильныеПериодыНП.Договор КАК Договор
	|	ИЗ
	|		РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО СтабильныеПериодыНП.Организация = ТаблицаПериодов.Организация
	|				И СтабильныеПериодыНП.Район = ТаблицаПериодов.Район
	|				И СтабильныеПериодыНП.ПериодНачисления = ТаблицаПериодов.ПериодНачисления
	|	ГДЕ
	|		СтабильныеПериодыНП.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериодыНП.Организация,
	|		СтабильныеПериодыНП.ПериодНачисления,
	|		СтабильныеПериодыНП.Район,
	|		СтабильныеПериодыНП.Услуга,
	|		СтабильныеПериодыНП.ТочкаУчета,
	|		СтабильныеПериодыНП.ОбъектРасчета,
	|		СтабильныеПериодыНП.Договор,
	|		СтабильныеПериодыНП.МКД,
	|		СтабильныеПериодыНП.ОбъектРасчета.Помещение) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериодыНП
	|		ПО ВложенныйЗапрос.Организация = СтабильныеПериодыНП.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериодыНП.ПериодНачисления
	|			И ВложенныйЗапрос.Район = СтабильныеПериодыНП.Район
	|			И ВложенныйЗапрос.МКД = СтабильныеПериодыНП.МКД
	|			И ВложенныйЗапрос.Услуга = СтабильныеПериодыНП.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериодыНП.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = СтабильныеПериодыНП.НомерПозиции
	|			И ВложенныйЗапрос.ОбъектРасчета = СтабильныеПериодыНП.ОбъектРасчета
	|			И ВложенныйЗапрос.Договор = СтабильныеПериодыНП.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНП.Организация,
	|	СтабильныеПериодыНП.ПериодНачисления,
	|	СтабильныеПериодыНП.Район,
	|	СтабильныеПериодыНП.Услуга,
	|	СтабильныеПериодыНП.МКД,
	|	СтабильныеПериодыНП.ОбъектРасчета.Помещение";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли