#Область ОбработчикиСобытийФормы

&НаКлиенте
Перем МожноЗакрыть;

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если МожноЗакрыть <> Истина Тогда
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаОтменуПеренаправления", ЭтотОбъект);
		Если ВозращениеНаПредыдущийЭтап Тогда
			ТекстВопроса = "Отменить возвращение на доработку?";
		ИначеЕсли ЗаполнятьДатуВыполнения Тогда
			ТекстВопроса = "Отменить передачи сотруднику УКЗ?";
		ИначеЕсли ПодтвердитьПеренаправление Тогда
			ТекстВопроса = "Подтвердить перенаправление?";
		ИначеЕсли НазначениеИсполнителя Тогда
			ТекстВопроса = "Назначить исполнителя?";
		Иначе	
			ТекстВопроса = "Отменить перенаправление задачи?";
		КонецЕсли;

		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ЗначенияЗаполнения); 	
	КонецЕсли;
	
	Если Параметры.ВозращениеНаПредыдущийЭтап Тогда
		ВозращениеНаПредыдущийЭтап = Истина;
		Заголовок = "Возвращение на доработку";
		АвтоЗаголовок = Ложь;
		Элементы.ФормаПеренаправитьЗадачу.Заголовок = "Вернуть на доработку";
		
		ПредЗадача			= Параметры.Задача.Основание;
		Пользователь		= ПредЗадача.Исполнитель;
		ДатаСледующегоЭтапа = ПредЗадача.ДатаСледЭтапа;
	ИначеЕсли Параметры.ПередачаУКЗ Тогда
		Заголовок = "Передача сотруднику УКЗ";
		АвтоЗаголовок = Ложь;
		Элементы.ФормаПеренаправитьЗадачу.Заголовок = "Передать сотруднику УКЗ";
		Элементы.ДатаСледующегоЭтапа.АвтоОтметкаНезаполненного = Истина;
		ЗаполнятьДатуВыполнения = Истина;
	ИначеЕсли Параметры.ПодтвердитьПеренаправление Тогда
		Заголовок = "Подтверждение перенаправления задачи";
		АвтоЗаголовок = Ложь;
		Элементы.ФормаПеренаправитьЗадачу.Заголовок = "Подтвердить перенаправление";
		//ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ДатаСледующегоЭтапа, Комментарий, Пользователь");
		ПодтвердитьПеренаправление = Истина;
	ИначеЕсли НазначениеИсполнителя Тогда
		Заголовок = "Назначение исполнителя";
		АвтоЗаголовок = Ложь;
		Элементы.ФормаПеренаправитьЗадачу.Заголовок = "Назначить";
				
		Элементы.Комментарий.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренаправитьЗадачу(Команда)
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Пользователь"".");
		Отказ = Истина;;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Комментарий) И Элементы.Комментарий.АвтоОтметкаНезаполненного Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Комментарий"".");
		Отказ = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСледующегоЭтапа) И ЗаполнятьДатуВыполнения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Дата выполнения"".");
		Отказ = Истина;
	КонецЕсли;

	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПарамПеренаправления = Новый Структура("НовыйИсполнитель, Комментарий, ДатаСледЭтапа", Пользователь, Комментарий, ДатаСледующегоЭтапа);
	МожноЗакрыть = Истина;
	Закрыть(ПарамПеренаправления);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	МожноЗакрыть = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОтветаНаОтменуПеренаправления(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		МожноЗакрыть = Истина;
		//Закрыть();
		ПеренаправитьЗадачу(Неопределено);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Отмена(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


