Процедура ОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДополнитьДанныеПоАбоненту(ДанныеЗаполнения);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения);	
		метТабличныеЧасти 			= ДокументОбъект.Метаданные().ТабличныеЧасти;
		Для Каждого метТабЧасть Из метТабличныеЧасти Цикл
			Если ДанныеЗаполнения.Свойство(метТабЧасть.Имя) Тогда
				Для Каждого Строка Из ДанныеЗаполнения[метТабЧасть.Имя] Цикл
					НоваяСтрока 	= ДокументОбъект[метТабЧасть.Имя].Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				КонецЦикла;			
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ДанныеЗаполнения.Свойство("Организация") И Не ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
			ДокументОбъект.Организация  = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
		
	ИначеЕсли ДанныеЗаполнения = Неопределено Тогда
		ДокументОбъект.Организация  = Справочники.Организации.НашаОрганизация;
	КонецЕсли; 	
		
КонецПроцедуры

Функция ОрганизацияПоУмолчанию() Экспорт  
	
	Если Не УчетПоНесколькимОрганизация() Тогда
		Возврат Справочники.Организации.НашаОрганизация;
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();
КонецФункции

Функция УчетПоНесколькимОрганизация() Экспорт 
	Возврат энргОрганизацииПовтИсп.УчетПоНесколькимОрганизация();
КонецФункции

Процедура ОтборФормаСпискаДоступныеОрганизации(ТекПользователь, Форма) Экспорт
	
	//ВыборкаОрганизаций 		= СписокДоступныхОрганизацийИРайоновПользователя(ТекПользователь);
	//СписокОтборОрганизации	= Новый СписокЗначений;
	//СписокОтборРайоны		= Новый СписокЗначений;
	//Пока ВыборкаОрганизаций.Следующий() Цикл
	//	СписокОтборОрганизации.Добавить(ВыборкаОрганизаций.Организация);
	//	СписокОтборРайоны.Добавить(ВыборкаОрганизаций.Район);
	//КонецЦикла;
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма,"Организация", 	СписокОтборОрганизации,ВидСравненияКомпоновкиДанных.ВСписке);	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма,"Район", 		СписокОтборРайоны,ВидСравненияКомпоновкиДанных.ВСписке);	
	
КонецПроцедуры

Процедура ДополнитьДанныеПоАбоненту(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.свойство("Абонент") и не ДанныеЗаполнения.свойство("КлючПомещения") Тогда
		ДанныеАбонента = Новый Структура("Абонент,Район,КлючПомещения,Строение,Помещение,ЧастныйСектор,ЛицевойСчет,АдресОбъекта,ПериодНачисления,Организация,ГруппаАбонента,МКД");
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеЗаполнения, ДанныеАбонента, Ложь);
		энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(ДанныеЗаполнения.Абонент,ДанныеЗаполнения);			
	КонецЕсли;
	
КонецПроцедуры
