#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 	
	
	СтруктураАдреса = Новый Структура("НаселенныйПункт,Улица,Дом","","","");
	ЗаполнитьДанныеИзАдреса(СтруктураАдреса);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,СтруктураАдреса);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ПриЗаписиПереопределяемый(Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеИзАдреса(СтруктураАдреса) Экспорт   
	
	Тип		 = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес");
	Вид		 = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета");
	СтрокиКИ = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид", Тип, Вид));
		                                   
	Если СтрокиКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Чтение 		 = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокиКИ[0].Значение);
	ДанныеАдреса = ПрочитатьJSON(Чтение);
	
	Если ДанныеАдреса.Свойство("city") Тогда
		СтруктураАдреса.НаселенныйПункт = ДанныеАдреса.city;
	КонецЕсли;

	Если ДанныеАдреса.Свойство("street") Тогда
		СтруктураАдреса.Улица = ДанныеАдреса.street;
	КонецЕсли;

	Если ДанныеАдреса.Свойство("houseNumber") Тогда
		СтруктураАдреса.Дом = ДанныеАдреса.houseNumber;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписиПереопределяемый(Отказ)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли