#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуТарифныеЗоныВидовДифференцированности(Схема,ПараметрыОтбора,ТаблицаДляПомещения) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуТарифныеЗоныВидовДифференцированности());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойбазы

Процедура ОбновитьПредопределенныеЭлементы() Экспорт
	
	ЭлементОбъект 				= Справочники.энргВидыДифференцированности.Однотарифный.ПолучитьОбъект();
	ТабТарифныеЗоны 			= ЭлементОбъект.ТарифныеЗоны;
	Если ТабТарифныеЗоны.Количество() = 0 Тогда
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.БезРазбивки;
	КонецЕсли;
	ЭлементОбъект.Записать();
	
	ЭлементОбъект 				= Справочники.энргВидыДифференцированности.Двухтарифный.ПолучитьОбъект();
	ТабТарифныеЗоны 			= ЭлементОбъект.ТарифныеЗоны;
	Если ТабТарифныеЗоны.Количество() = 0 Тогда
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.День;
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.Ночь;
	КонецЕсли;
	ЭлементОбъект.Записать();
	
	ЭлементОбъект 				= Справочники.энргВидыДифференцированности.Трехтарифный.ПолучитьОбъект();
	ТабТарифныеЗоны 			= ЭлементОбъект.ТарифныеЗоны;
	Если ТабТарифныеЗоны.Количество() = 0 Тогда
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.НочьТрехЗонная;
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.Полупик;
		Строка  				= ТабТарифныеЗоны.Добавить();
		Строка.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.Пик;
	КонецЕсли;
	ЭлементОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуТарифныеЗоныВидовДифференцированности()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргВидыДифференцированностиТарифныеЗоны.Ссылка КАК ВидДифференцированности,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ИЗ
	|	Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли