#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	

	Пакет = ПолучитьДанныеШапки();	
	ДанныеРассрочкиАбонента = Пакет[0]; 
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеРассрочкиАбонента,	Движения.энргПризнакНаличияРассрочкиАбонента);
КонецПроцедуры  

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеШапки()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДокументы", Ссылка);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Шапка.Дата КАК Период,
		|	Шапка.Ссылка КАК Регистратор,
		|	Шапка.Организация КАК Организация,
		|	Шапка.Район КАК Район,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ КАК МКД,
		|	Шапка.Абонент КАК Абонент,
		|	Шапка.ПризнакРассрочкиЗадолженности КАК ПризнакРассрочкиЗадолженности
		|ИЗ
		|	Документ.энргУстановитьПризнакНаличияРассрочки КАК Шапка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО Шапка.КлючПомещения = энргКлючиПомещений.Ссылка
		|ГДЕ
		|	Шапка.Ссылка В(&мДокументы)";
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();   
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли