#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 	
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки 					= ДанныеШапки();
	
	бестРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьРабочееПостановлениеМКД(Движения, ДанныеШапки);
	
	Если ИзменитьПостановлениеАбонентам Тогда
		ТаблицаАбонентов = ПолучитьСписокАбонентовМКДСПостановлениями(ДанныеШапки);
	    бестРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьРабочееПостановлениеАбонентов(Движения, ТаблицаАбонентов, ДанныеШапки);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("МКД",						МКД);
	ДанныеШапки.Вставить("Постановление",			Постановление);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("Документ",				Ссылка);
	
	Возврат ДанныеШапки;	
КонецФункции

Функция ПолучитьСписокАбонентовМКДСПостановлениями(ДанныеШапки)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 			ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("ЗонаОтветственнности", 	ДанныеШапки.Район);
	Запрос.УстановитьПараметр("МКД", 					ДанныеШапки.МКД);
	Запрос.УстановитьПараметр("Дата", 					ДанныеШапки.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Абонент,
	               |	ЕСТЬNULL(бестРабочиеПостановленияАбонентовСрезПоследних.Постановление, """") КАК Постановление
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРабочиеПостановленияАбонентов.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &ЗонаОтветственнности) КАК бестРабочиеПостановленияАбонентовСрезПоследних
	               |		ПО (бестРабочиеПостановленияАбонентовСрезПоследних.Абонент = энргАбоненты.Ссылка)
	               |ГДЕ
	               |	энргАбоненты.КлючПомещения.Строение = &МКД
	               |	И НЕ энргАбоненты.ЭтоГруппа
	               |	И НЕ энргАбоненты.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргАбоненты.Ссылка,
	               |	ЕСТЬNULL(бестРабочиеПостановленияАбонентовСрезПоследних.Постановление, """")";
	Результат = Запрос.Выполнить();
	Выгрузка	= Результат.Выбрать();
	
	Возврат Выгрузка;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли