#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет скорректированные показания.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СкорректированныеПоказания(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСкорректированныеПоказания());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	

	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, КлючПомещения, ЧастныйСектор, Строение, Помещение, ПриборУчета, Шкала, ТарифнаяЗона, Разделитель, ДокРегистратор";
		ИмяТаблицы 					= "КорректировкаПоказаний";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСкорректированныеПоказания()
	
	Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПоказаний.Период КАК Период,
	|	КорректировкаПоказаний.Регистратор КАК Регистратор,
	|	КорректировкаПоказаний.Организация КАК Организация,
	|	КорректировкаПоказаний.Район КАК Район,
	|	КорректировкаПоказаний.КлючПомещения КАК КлючПомещения,
	|	КорректировкаПоказаний.ПриборУчета КАК ПриборУчета,
	|	КорректировкаПоказаний.Шкала КАК Шкала,
	|	КорректировкаПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	КорректировкаПоказаний.Разделитель КАК Разделитель,
	|	КорректировкаПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	КорректировкаПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	КорректировкаПоказаний.ПоказанияДо КАК ПоказанияДо,
	|	КорректировкаПоказаний.ПоказанияПосле КАК ПоказанияПосле,
	|	КорректировкаПоказаний.Строение КАК Строение,
	|	КорректировкаПоказаний.Помещение КАК Помещение,
	|	КорректировкаПоказаний.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	(ВЫБРАТЬ
	|		КорректировкаПоказаний.Период КАК Период,
	|		КорректировкаПоказаний.Регистратор КАК Регистратор,
	|		КорректировкаПоказаний.Организация КАК Организация,
	|		КорректировкаПоказаний.Район КАК Район,
	|		КорректировкаПоказаний.КлючПомещения КАК КлючПомещения,
	|		КорректировкаПоказаний.ПриборУчета КАК ПриборУчета,
	|		КорректировкаПоказаний.Шкала КАК Шкала,
	|		КорректировкаПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|		КорректировкаПоказаний.Разделитель КАК Разделитель,
	|		КорректировкаПоказаний.ДокРегистратор КАК ДокРегистратор,
	|		КорректировкаПоказаний.ПериодНачисления КАК ПериодНачисления,
	|		КорректировкаПоказаний.ПоказанияДо КАК ПоказанияДо,
	|		КорректировкаПоказаний.ПоказанияПосле КАК ПоказанияПосле,
	|		энргКлючиПомещений.Строение КАК Строение,
	|		энргКлючиПомещений.Помещение КАК Помещение,
	|		энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|	ИЗ
	|		РегистрСведений.энргКорректировкаПоказаний КАК КорректировкаПоказаний
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО КорректировкаПоказаний.КлючПомещения = энргКлючиПомещений.Ссылка) КАК КорректировкаПоказаний";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли