
#Область ПрограммныйИнтерфейс

// Процедура - Оповещение пользователей
//
Процедура ОповещениеПользователей() Экспорт
	
	СообщениеПользователю = ПолучитьФорму("РегистрСведений.бестОповещенияПользователей.Форма.ФормаОповещенияПользователей").ПолучитьСообщенияОбработкиОповещения();
	
	Если Не СообщениеПользователю = Неопределено Тогда
		
		Для н = 0 по СообщениеПользователю.ВГраница() ЦИкл
			Форма = ПолучитьФорму("РегистрСведений.бестОповещенияПользователей.Форма.ФормаОповещенияПользователей");
			Если Не Форма.Открыта() Тогда
				ЗаполнитьЗначенияСвойств(Форма,СообщениеПользователю[н]);
				Форма.Открыть();
			Иначе
				Форма.Активизировать(); 
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;           
	
КонецПроцедуры
#КонецОбласти
