Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		УровеньИсточник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекЗапись.Источник, "УровеньСтруктурыСети");
		УровеньПриемник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекЗапись.Приемник, "УровеньСтруктурыСети");
		
		Если ТекЗапись.Источник = ТекЗапись.Приемник Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Приемник и источник не может быть одним и тем же элементом структуры сети");
			Возврат;
		КонецЕсли;
		
		Если УровеньИсточник = УровеньПриемник 
			И НЕ (УровеньИсточник = Справочники.бестУровниСтруктурыСети.Фидер И УровеньПриемник = Справочники.бестУровниСтруктурыСети.Фидер) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Приемник и источник не может быть элементом структуры сети с одинаковым уровнем, кроме уровня ""Фидер""");
			Возврат;
		КонецЕсли;
		
		Если ТекЗапись.ВерхнийУровень Тогда
			
			Если УровеньПриемник <> Справочники.бестУровниСтруктурыСети.ПС И УровеньПриемник <> Справочники.бестУровниСтруктурыСети.Генерация Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Элемент структуры сети, с установленным признаком ""Верхний уровень"", может быть только объект с уровнем структуры сети ""ПС"" или ""Генерация""");
				Возврат;
			КонецЕсли;
			
			//НаборЗаписей = РегистрыСведений.бестСтруктураСети.СоздатьНаборЗаписей();
			//НаборЗаписей.Отбор.Источник.Установить(Справочники.бестСтруктураСети.ПустаяСсылка());
			//НаборЗаписей.Отбор.Приемник.Установить(ТекЗапись.Источник);
			//НаборЗаписей.Прочитать();
			//Если НаборЗаписей.Количество() = 0 Тогда
			//	нЗапись = НаборЗаписей.Добавить();
			//Иначе
			//	нЗапись = НаборЗаписей[0];
			//КонецЕсли;
			//нЗапись.Период = ТекущаяДата();
			//нЗапись.Источник = Справочники.бестСтруктураСети.ПустаяСсылка();
			//нЗапись.Приемник = ТекЗапись.Источник;
			//нЗапись.Организация = ТекЗапись.Организация;
			//нЗапись.Актуальность = Истина;
			//
			//Попытка
			//	НаборЗаписей.Записать();
			//Исключение
			//	Сообщить(ИнформацияОбОшибке().Описание);
			//КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 