#Область ОписаниеПеременных

&НаКлиенте
Перем УслугиТочекУчета, ПоставщикиУслугТочекУчета;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда
		ДанныеАбонента  		= Новый Структура("Район,Организация,Строение,Помещение,КлючПомещения");			
		ДанныеАбонента.удалить("Абонент");
		энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент,ДанныеАбонента);
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ДанныеАбонента,"Район,Организация,КлючПомещения");
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеАбонента,"Строение,Помещение");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИспользоватьТарифныеЗоны = энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для каждого стр из ТекущийОбъект.Движения.энргОбъемНачислений Цикл
		стр.Абонент = Объект.Абонент;
		Если Не ЗначениеЗаполнено(стр.Услуга) Тогда  
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена услуга в строке " + Строка(стр.НомерСтроки+1));
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПраваДокументаПерерасчет(Отказ);
	
	УстановитьВидимостьТаблицыОбъемовНачислений();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт") Тогда
		Объект.Дата = НачалоМесяца(Объект.ПериодНачисления);
	КонецЕсли;

	УслугиТочекУчета 				= Новый Соответствие;
	ПоставщикиУслугТочекУчета 		= Новый Соответствие;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);		

КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	Объект.Движения.энргОбъемНачислений.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодНачисления  = НачалоМесяца(ТекущиеДанные.ПериодНачисления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДвиженияэнргОбъемНачислений

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийПериодНачисленияПриИзменении(Элемент)
	ТекущиеДанные  = Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;
	ПериодНачисленияПриИзменении(ТекущиеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийПоставщикПриИзменении(Элемент)
	
	ТекущиеДанные						= Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;
	ПриИзмененииУслугиПоставщикаТарЗоны(ТекущиеДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийТарифнаяЗонаПриИзменении(Элемент)
	
	ТекущиеДанные						= Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;
	ПриИзмененииУслугиПоставщикаТарЗоны(ТекущиеДанные);
	//Если ЗначениеЗаполнено(ТекущиеДанные.Услуга) И ЗначениеЗаполнено(ТекущиеДанные.Поставщик) и (ЗначениеЗаполнено(ТекущиеДанные.ТарифнаяЗона) ИЛИ НЕ ИспользоватьТарифныеЗоны) Тогда
	//	ТарифнаяЗона 					= ?(НЕ ИспользоватьТарифныеЗоны, ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки"), ТекущиеДанные.ТарифнаяЗона);
	//	ЗначениеТарифа 					= энргРаботаСПоставщикамиСервер.ЗначениеТарифаПомещения(Объект.Организация, Объект.Район, Объект.КлючПомещения, ТекущиеДанные.Услуга, ТекущиеДанные.Поставщик, ТарифнаяЗона);
	//	ТекущиеДанные.ЗначениеТарифа 	= ЗначениеТарифа;
	//	ПересчитатьСумму(ТекущиеДанные);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийОбъемУслугиПриИзменении(Элемент)

	ТекущиеДанные									= Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;

	Если ТекущиеДанные.ОбъемУслуги <> 0 Тогда
		ТекущиеДанные.ЭтоОбъемПотребленный				= Ложь;
		ТекущиеДанные.ОбъемУслугиПотребленный			= 0; 
		ТекущиеДанные.ОбъемУслугиПотребленныйПотери		= 0;
		ТекущиеДанные.ОбъемУслугиПотребленныйСоцНорма	= 0;
	КонецЕсли;
	
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийОбъемУслугиПотребленныйПриИзменении(Элемент)
	ТекущиеДанные									= Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;

	Если ТекущиеДанные.ОбъемУслугиПотребленный <> 0 Тогда
		ТекущиеДанные.ЭтоОбъемПотребленный				= Истина;
		ТекущиеДанные.ОбъемУслуги						= 0; 
		ТекущиеДанные.ОбъемУслугиПотери					= 0;
		ТекущиеДанные.ОбъемУслугиСоцНорма				= 0;
		ТекущиеДанные.ОбъемУслугиСоцНорма				= 0; 
		ТекущиеДанные.Сумма								= 0;
		ТекущиеДанные.СуммаПоПовышенномуКоэффициенту	= 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийПовыщающийКоэффициентПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийЗначениеТарифаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийТочкаУчетаПриИзменении(Элемент)
	
	ТекущаяСтрока 	= элементы.ДвиженияэнргОбъемНачислений.ТекущаяСтрока;
	ТочкаУчетаПриИзменении(ТекущаяСтрока, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийУслугаПриИзменении(Элемент)
	
	ТекущиеДанные 				= элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные; 
	Если НЕ ПоставщикиУслугТочекУчета[ТекущиеДанные.ПериодНачисления] = Неопределено
		И НЕ ПоставщикиУслугТочекУчета[ТекущиеДанные.ПериодНачисления][ТекущиеДанные.ТочкаУчета] = Неопределено
		И НЕ ПоставщикиУслугТочекУчета[ТекущиеДанные.ПериодНачисления][ТекущиеДанные.ТочкаУчета][ТекущиеДанные.Услуга] = Неопределено Тогда		
		Поставщик 				= ПоставщикиУслугТочекУчета[ТекущиеДанные.ПериодНачисления][ТекущиеДанные.ТочкаУчета][ТекущиеДанные.Услуга];
		ТекущиеДанные.Поставщик = Поставщик;		
		ПриИзмененииУслугиПоставщикаТарЗоны(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 		= Ложь;
	ТекущиеДанные 				= элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные; 
	Если НЕ УслугиТочекУчета[ТекущиеДанные.ПериодНачисления] = Неопределено
		И НЕ УслугиТочекУчета[ТекущиеДанные.ПериодНачисления][ТекущиеДанные.ТочкаУчета] = Неопределено Тогда		
		мУслуги 				= УслугиТочекУчета[ТекущиеДанные.ПериодНачисления][ТекущиеДанные.ТочкаУчета];
		ДанныеВыбора 			= Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(мУслуги); 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка 		= Ложь;
	ТекущиеДанные 				= элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные; 
	Если НЕ УслугиТочекУчета[ТекущиеДанные.ПериодНачисления] = Неопределено
		И НЕ УслугиТочекУчета[ТекущиеДанные.ПериодНачисления][ТекущиеДанные.ТочкаУчета] = Неопределено Тогда		
		мУслуги 				= УслугиТочекУчета[ТекущиеДанные.ПериодНачисления][ТекущиеДанные.ТочкаУчета];
		ДанныеВыбора 			= Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(мУслуги);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийПередУдалением(Элемент, Отказ)
	
	ТекДанные 	= Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;
	НомерСтроки	= ТекДанные.НомерСтроки;
	
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НомерСтроки"	, НомерСтроки-1);
	ДопПараметры.Вставить("ИмяПроцедуры", "ВопросУдаленияСтроки");
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и НЕ Копирование Тогда
		Элемент.ТекущиеДанные.ПериодНачисления = НачалоМесяца(ДобавитьМесяц(Объект.Дата, -1));
	КонецЕсли;
	
КонецПроцедуры

//-----БЛОК АКТ

&НаКлиенте
Процедура ДанныеБлокировочногоАктаПередУдалением(Элемент, Отказ)
	ТекДанные 	= Элементы.ДанныеБлокировочногоАкта.ТекущиеДанные;
	НомерСтроки	= ТекДанные.НомерСтроки;
	
	Отказ 			= Истина;
	ДопПараметры 	= Новый Структура;
	ДопПараметры.Вставить("НомерСтроки"	, НомерСтроки-1);
	ДопПараметры.Вставить("ИмяПроцедуры", "ВопросУдаленияСтрокиБлокАкта");
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБлокировочногоАктаПериодНачисленияПриИзменении(Элемент)
	ТекущиеДанные  = Элементы.ДанныеБлокировочногоАкта.ТекущиеДанные;
	ПериодНачисленияПриИзменении(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБлокировочногоАктаТочкаУчетаПриИзменении(Элемент)
	ТекущаяСтрока 	= элементы.ДанныеБлокировочногоАкта.ТекущаяСтрока;
	ТочкаУчетаПриИзменении(ТекущаяСтрока, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБлокировочногоАктаПоставщикПриИзменении(ТекущиеДанные)
	ТекущиеДанные						= Элементы.ДанныеБлокировочногоАкта.ТекущиеДанные;
	ПриИзмененииУслугиПоставщикаТарЗоны(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБлокировочногоАктаУслугаПриИзменении(Элемент)
	ТекущиеДанные						= Элементы.ДанныеБлокировочногоАкта.ТекущиеДанные;
	ПриИзмененииУслугиПоставщикаТарЗоны(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБлокировочногоАктаТарифнаяЗонаПриИзменении(Элемент)
	ТекущиеДанные						= Элементы.ДанныеБлокировочногоАкта.ТекущиеДанные;
	ПриИзмененииУслугиПоставщикаТарЗоны(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБлокировочногоАктаОбъемУслугиПриИзменении(Элемент)
	ТекущиеДанные  = Элементы.ДанныеБлокировочногоАкта.ТекущиеДанные;
	ПересчитатьСумму(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеБлокировочногоАктаЗначениеТарифаПриИзменении(Элемент)
	ТекущиеДанные  = Элементы.ДанныеБлокировочногоАкта.ТекущиеДанные;
	ПересчитатьСумму(ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура ВопросУдаленияСтрокиБлокАкта(РезультатВопроса,ДополнительныеПараметры) Экспорт	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Объект.ДанныеБлокировочногоАкта.Удалить(ДополнительныеПараметры.НомерСтроки);
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	//ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСумму(ТекущиеДанные = Неопределено)
	ДопЧисло 											= 1;
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные									= Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;
	КонецЕсли;
	ТекущиеДанные.СуммаПоПовышенномуКоэффициенту		= 0;
	ПовыщающийКоэффициент 								= Макс(1,ТекущиеДанные.ПовыщающийКоэффициент);	
	ТекущиеДанные.Сумма 								= Окр(ТекущиеДанные.ОбъемУслуги * ТекущиеДанные.ЗначениеТарифа,2)  * ДопЧисло * ПовыщающийКоэффициент + Окр(ТекущиеДанные.ОбъемУслугиПотери * ТекущиеДанные.ЗначениеТарифа,2);
	Если ПовыщающийКоэффициент > 1 Тогда
		ТекущиеДанные.СуммаПоПовышенномуКоэффициенту 	= Окр(ТекущиеДанные.ОбъемУслуги * ТекущиеДанные.ЗначениеТарифа,2) * (ПовыщающийКоэффициент - 1);
	КонецЕсли;  		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ТекущиеДанные, УслугиТочекУчета, ПоставщикиУслугТочекУчета, АктивныеТУНаДату = Ложь)
		
	Если АктивныеТУНаДату Тогда
		ПараметрыОтбора					= Новый Структура("ВыбратьТУСрезНаДату", Истина); 
		ПараметрыОтбора					= Новый Структура("ВключаяОРП", Истина); 
	Иначе
		ПараметрыОтбора 				= Неопределено;
	КонецЕсли;
		
	Результат 							= Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы(КонецДня(ТекущиеДанные.ПериодНачисления), Объект.Организация, Объект.Район, Объект.КлючПомещения, ТекущиеДанные.ТочкаУчета, ПараметрыОтбора); 
	СоставнаяУслуга 					= Неопределено;
	ЭтоСоставнаяУслуга					= Ложь;
	мТарифныеЗоны 						= Новый Массив;
	
	Если Не Результат.Пустой() Тогда
		Выборка 						= Результат.Выбрать();
		ЕстьСледующий 					= Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ТекущиеДанные,Выборка,"ПриборУчета, НаправлениеИспользованияТУ");		
		Если ЗначениеЗаполнено(Выборка.Услуга) Тогда			
			Если Выборка.СоставнаяУслуга Тогда
				СоставнаяУслуга 		= Выборка.Услуга;
				ЭтоСоставнаяУслуга		= Истина;
			Иначе
				СоотвествиеТочкаУчета 	= Новый Соответствие;
				мУслуги 				= Новый Массив;
				мУслуги.Добавить(Выборка.Услуга);
				СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, мУслуги); 		
				УслугиТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);
				ТекущиеДанные.Услуга 	= Выборка.Услуга;
			КонецЕсли;			
		КонецЕсли;
				
		Если ЗначениеЗаполнено(Выборка.Поставщик) и Не ЭтоСоставнаяУслуга Тогда
			КлючЗначение  				= Новый Соответствие;
			КлючЗначение.Вставить(Выборка.Услуга, Выборка.Поставщик);
			СоотвествиеТочкаУчета 		= Новый Соответствие;
			СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, КлючЗначение); 
			ПоставщикиУслугТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);
			ТекущиеДанные.Поставщик 	= Выборка.Поставщик;
		КонецЕсли;
		
		Пока ЕстьСледующий Цикл
			мТарифныеЗоны.Добавить(Выборка.ТарифнаяЗона);
			ЕстьСледующий 				= Выборка.Следующий();
		КонецЦикла;	
		
		Если мТарифныеЗоны.Количество() = 1 Тогда
			ТекущиеДанные.тарифнаяЗона 	= мТарифныеЗоны[0];
		КонецЕсли; 	
		
	КонецЕсли; 	
	
	Если НЕ СоставнаяУслуга = Неопределено Тогда
		
		ТекущиеДанные.СоставнаяУслуга	= СоставнаяУслуга;
		
		ПараметрыСоставнойУслуги		= Новый Структура;
		Схема 							= Неопределено;
		ПараметрыВТ 					= Новый Массив;
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Организация", 	"Организация"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Район", 			"Район"), 			Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ТочкаУчета", 		"ТочкаУчета"), 		Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВСписке", 	Новый Структура("Услуга",	 		"Услуги"), 			Неопределено));		
		
		ПараметрыСоставнойУслуги.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
	    ПараметрыСоставнойУслуги.Вставить("ПараметрыВТ", 		ПараметрыВТ);
		
		мЧастиУслуг 					= Новый Массив;
		СоставляющиеУслуги 				= СоставнаяУслуга.СоставляющиеУслуг;
		Для Каждого СтрокаТабЧасти Из  СоставляющиеУслуги Цикл
			мЧастиУслуг.Добавить(СтрокаТабЧасти.Услуга);
		КонецЦикла;
		
		РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиСоставнойУслуги(Схема,ПараметрыСоставнойУслуги,"");
		ПараметрыЗапроса 				= Новый Структура;
		ПараметрыЗапроса.Вставить("Организация", 	Объект.Организация);
		ПараметрыЗапроса.Вставить("Район", 			Объект.Район);
		ПараметрыЗапроса.Вставить("КлючПомещения", 	Объект.КлючПомещения);
		ПараметрыЗапроса.Вставить("ТочкаУчета", 	ТекущиеДанные.ТочкаУчета);
		ПараметрыЗапроса.Вставить("Услуги", 		мЧастиУслуг);
		ПараметрыЗапроса.Вставить("Период", 		КонецДня(ТекущиеДанные.ПериодНачисления));
						
		Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
		Выборка 						= Результат.Выбрать();
		мУслуги 						= Новый Массив;
		КлючЗначение  					= Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			мУслуги.Добавить(Выборка.Услуга);			
			КлючЗначение.Вставить(Выборка.Услуга, Выборка.Поставщик);			
		КонецЦикла; 
		СоотвествиеТочкаУчета 		= Новый Соответствие;
		СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, КлючЗначение);
		ПоставщикиУслугТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);
		
		СоотвествиеТочкаУчета 	= Новый Соответствие; 
		СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, мУслуги);
		УслугиТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТарифнаяЗона) Тогда
		ТекущиеДанные.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Услуга) И ЗначениеЗаполнено(ТекущиеДанные.Поставщик) и ЗначениеЗаполнено(ТекущиеДанные.ТарифнаяЗона) Тогда
		ТарифнаяЗона 					= ?(НЕ ИспользоватьТарифныеЗоны, ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки"), ТекущиеДанные.ТарифнаяЗона);
		ЗначенияТарифа 						= энргРаботаСПоставщикамиСервер.ЗначенияТарифаПомещения(Объект.Организация, Объект.Район, Объект.КлючПомещения, ТекущиеДанные.Услуга, ТекущиеДанные.Поставщик, ТарифнаяЗона, ТекущиеДанные.ПериодНачисления);
		ТекущиеДанные.ЗначениеТарифа 		= ЗначенияТарифа.Значение;
		ТекущиеДанные.ВидБлагоустройства	= ЗначенияТарифа.ВидБлагоустройства;
		ТекущиеДанные.ЗначениеТарифаРЭК		= ЗначенияТарифа.ЗначениеРЭК;
		ТекущиеДанные.ТарифнаяГруппа		= ЗначенияТарифа.ГруппаПотребителей;
		ТекущиеДанные.Сумма					= ТекущиеДанные.ЗначениеТарифа * ТекущиеДанные.ОбъемУслуги;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьТаблицыОбъемовНачислений()
	Элементы.ОбъемНачисленийРучнойПерерасчет.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет");
	Элементы.ОбъемНачисленийБлокировочныйАкт.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт");
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУслугиПоставщикаТарЗоны(ТекущиеДанные)
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТарифнаяЗона) Тогда
		ТекущиеДанные.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Услуга) И ЗначениеЗаполнено(ТекущиеДанные.Поставщик) и (ЗначениеЗаполнено(ТекущиеДанные.ТарифнаяЗона) ИЛИ НЕ ИспользоватьТарифныеЗоны) Тогда
		СтруктураСтроки = Новый Структура("Организация, Район, Абонент, ПериодНачисления, КлючПомещения, ТочкаУчета, Услуга, СоставнаяУслуга, Поставщик, ТарифнаяЗона");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Объект, "Организация,Район,Абонент,ПериодНачисления,КлючПомещения");
		// При ручном перерасчете для получения значения тарифа должен использоваться период начисления строки
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные, "ПериодНачисления");	
		КонецЕсли;
		
		ЗначенияТарифаНорматива = ПриИзмененииУслугиПоставщикаТарЗоныНаСервере(СтруктураСтроки, ИспользоватьТарифныеЗоны);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные,ЗначенияТарифаНорматива);
		
		ПересчитатьСумму(ТекущиеДанные);
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриИзмененииУслугиПоставщикаТарЗоныНаСервере(СтруктураСтроки, ИспользоватьТарифныеЗоны)
	ТарифнаяЗона	= ?(НЕ ИспользоватьТарифныеЗоны,Справочники.энргТарифныеЗоны.БезРазбивки, СтруктураСтроки.ТарифнаяЗона);
	СтруктураТарифа	= энргРаботаСПоставщикамиСервер.ЗначенияТарифаПомещения(СтруктураСтроки.Организация, СтруктураСтроки.Район, СтруктураСтроки.КлючПомещения, СтруктураСтроки.Услуга, СтруктураСтроки.Поставщик, СтруктураСтроки.ТарифнаяЗона, КонецМесяца(СтруктураСтроки.ПериодНачисления));
	
	СтруктураНорматива = Документы.энргПерерасчет.ЗначенияНормативаТУ(СтруктураСтроки, СтруктураТарифа);
	
	СтруктураТарифа.Вставить("НормаПотребления", 	СтруктураНорматива.ЗначениеНорматива);
	СтруктураТарифа.Вставить("КлючНорматива",		СтруктураНорматива.КлючНорматива);
	СтруктураТарифа.Вставить("ЗначениеТарифа", 		СтруктураТарифа.Значение);
	СтруктураТарифа.Вставить("ЗначениеТарифаРЭК",	СтруктураТарифа.ЗначениеРЭК);
	СтруктураТарифа.Вставить("ТарифнаяГруппа",		СтруктураТарифа.ГруппаПотребителей);

	СтруктураТарифа.Удалить("Значение");
	СтруктураТарифа.Удалить("ЗначениеРЭК");
	СтруктураТарифа.Удалить("ГруппаПотребителей");
	
	Возврат СтруктураТарифа;
	
КонецФункции

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(ТекущаяСтрока, ЭтоБокАкт)
	ТочкаУчетаПриИзмененииНаСервере(ТекущаяСтрока, УслугиТочекУчета, ПоставщикиУслугТочекУчета, ЭтоБокАкт);	
КонецПроцедуры

&НаСервере
Процедура ТочкаУчетаПриИзмененииНаСервере(ТекущаяСтрока, УслугиТочекУчета, ПоставщикиУслугТочекУчета, ЭтоБокАкт)
	
	Если ЭтоБокАкт Тогда		
		АктивныеТУНаДату 	= Ложь;
		ТекущиеДанные		= Объект.ДанныеБлокировочногоАкта.НайтиПоИдентификатору(ТекущаяСтрока);		
	Иначе 		
		АктивныеТУНаДату 	= Истина;
		ТекущиеДанные		= Объект.Движения.энргОбъемНачислений.НайтиПоИдентификатору(ТекущаяСтрока);		
	КонецЕсли;	
	
	ЗаполнитьПриборыУчетаСервер(ТекущиеДанные, УслугиТочекУчета, ПоставщикиУслугТочекУчета, АктивныеТУНаДату);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаСервере 
Процедура ПроверитьПраваДокументаПерерасчет(Отказ) 
	
	ЕстьПравоЧтение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Чтение"); 
	ЕстьПравоИзменение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Изменение");
	Если Не ЕстьПравоИзменение И (Не ЕстьПравоЧтение Или ЕстьПравоЧтение И Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		Отказ = Истина;
		ВызватьИсключение "Нарушение прав доступа";
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр = ЕстьПравоЧтение И Не ЕстьПравоИзменение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОсновании", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения(ДопПараметры.ИмяПроцедуры,ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	энргОбъемНачислений = Объект.Движения.энргОбъемНачислений;	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			энргОбъемНачислений.Удалить(ДополнительныеПараметры.НомерСтроки);
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти