#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.ТипРесурса.СписокВыбора.Добавить(Перечисления.бестВидыРесурса.Электроэнергия);
	УстановитьВидимостьЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСИПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьЭлементовФормы()
	ПУ 		= (Объект.ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.ПУ"));
	ТТ 		= (Объект.ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.ТТ"));
	ТН 		= (Объект.ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.ТН"));
	УСПД	= (Объект.ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.УСПД"));
	
	//Элементы.Фазность.Видимость 		= (ПУ ИЛИ ТН);
	Элементы.Фазность.Видимость 		= (ПУ ИЛИ ТН);

	//Элементы.Производитель.Видимость 	= НЕ УСПД; 
	//Элементы.ГруппаПУ.Видимость 		= ПУ;
	//Элементы.СрокСлужбы.Видимость 	= НЕ ПУ;
	//Элементы.Примечание.Видимость 	= НЕ ПУ;
	Элементы.НапряжениеКласс.Видимость 	= ТН;
	Элементы.НапряжениеНорм.Видимость 	= ТТ;	
	Элементы.ПринципИзмерения.Видимость = ПУ;
	
	Если НЕ ПУ Тогда 
		Объект.ТипРесурса = Перечисления.бестВидыРесурса.Электроэнергия;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти