#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция МассивПриборов() Экспорт
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Текст  			= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета,
	|	ТаблицаПоказаний.ТарифнаяЗона,
	|	ТаблицаПоказаний.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	ТаблицаПоказаний.НомерСтроки
	|ПОМЕСТИТЬ ДанныеПоказанийПУ
	|ИЗ
	|	Документ.энргУстановитьВидДифференцированностиПриборУчетаМКД.ПоказанияПриборовУчета КАК ТаблицаПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчетаМКД.ТочкиУчета КАК ТаблицаТочекУчета
	|		ПО ТаблицаПоказаний.IDСтроки = ТаблицаТочекУчета.IDСтроки
	|			И ТаблицаПоказаний.Ссылка = ТаблицаТочекУчета.Ссылка
	|			И (ТаблицаПоказаний.Ссылка = &ссылка)
	|			И (ТаблицаТочекУчета.Ссылка = &ссылка)
	|			И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоказанийПУ.ПриборУчета,
	|	ДанныеПоказанийПУ.ТарифнаяЗона,
	|	ДанныеПоказанийПУ.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеПоказанийПУ.ИмяТабЧасти КАК ИмяТабЧасти,
	|	СУММА(ВЫБОР
	|			КОГДА ПоискРазделителя.НомерСтроки ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Разделитель
	|ИЗ
	|	ДанныеПоказанийПУ КАК ДанныеПоказанийПУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоказанийПУ КАК ПоискРазделителя
	|		ПО ДанныеПоказанийПУ.ПриборУчета = ПоискРазделителя.ПриборУчета
	|			И ДанныеПоказанийПУ.ТарифнаяЗона = ПоискРазделителя.ТарифнаяЗона
	|			И ДанныеПоказанийПУ.НомерСтроки > ПоискРазделителя.НомерСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоказанийПУ.ПриборУчета,
	|	ДанныеПоказанийПУ.ТарифнаяЗона,
	|	ДанныеПоказанийПУ.ВыводПрибораУчета,
	|	ДанныеПоказанийПУ.ИмяТабЧасти";
	
	Запрос.Текст 	= Текст; 	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	ДанныеШапки 					= ДанныеШапки();
	ДанныеПоказанийПриборовУчета 	= ДанныеПоказанийПриборовУчета();
	СоотвествиеКолонок 				= Новый Структура;
	
	СоотвествиеКолонок.Вставить("ТочкаУчета",				"ТочкаУчета");
	СоотвествиеКолонок.Вставить("ВидДифференцированности",	"ВидДифференцированностиПосле");
	СоотвествиеКолонок.Вставить("ПриборУчета",				"ПриборУчета");
	
	энргРаботаСприборамиУчетаСервер.УстановитьВидДифференцированностиПриборовУчетаМКД(ДанныеШапки,Движения,"ТочкиУчета",СоотвествиеКолонок);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияМКДРезультатЗапроса(ДанныеПоказанийПриборовУчета(),Движения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПоказанийПриборовУчета()
	
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				МКД);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);  	
	Текст 		= 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаПоказанийПриборовУчета.ВыводПрибораУчета
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		ИНАЧЕ ТаблицаПоказанийПриборовУчета.СостояниеПоказаний
	|	КОНЕЦ КАК СостояниеПоказаний,
	|	ЛОЖЬ КАК КС,
	|	ЛОЖЬ КАК Переворот,
	|	&ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ДанныеПоказанийПУ
	|ИЗ
	|	Документ.энргУстановитьВидДифференцированностиПриборУчетаМКД.ТочкиУчета КАК ТаблицаПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчетаМКД.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ТаблицаПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ТаблицаПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПриборовУчета.Ссылка = &ссылка)
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
	|			И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&ПериодРегистрации,
	|	&Район,
	|	&МКД,
	|	ТаблицаПриборовУчета.ПриборУчета,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаПоказанийПриборовУчета.ВыводПрибораУчета
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		ИНАЧЕ ТаблицаПоказанийПриборовУчета.СостояниеПоказаний
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ТаблицаПоказанийПриборовУчета.Переворот,
	|	&ПериодНачисления
	|ИЗ
	|	Документ.энргУстановитьВидДифференцированностиПриборУчетаМКД.ТочкиУчета КАК ТаблицаПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьВидДифференцированностиПриборУчетаМКД.ПоказанияПриборовУчетаВывод КАК ТаблицаПоказанийПриборовУчета
	|		ПО ТаблицаПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ТаблицаПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПриборовУчета.Ссылка = &ссылка)
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
	|			И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоказанийПУ.Период КАК Период,
	|	ДанныеПоказанийПУ.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеПоказанийПУ.Район КАК Район,
	|	ДанныеПоказанийПУ.МКД КАК МКД,
	|	ДанныеПоказанийПУ.ПриборУчета КАК ПриборУчета,
	|	ДанныеПоказанийПУ.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ДанныеПоказанийПУ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеПоказанийПУ.Показание КАК Показание,
	|	ДанныеПоказанийПУ.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ДанныеПоказанийПУ.КС КАК КС,
	|	ДанныеПоказанийПУ.Переворот КАК Переворот,
	|	ДанныеПоказанийПУ.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(ВЫБОР
	|			КОГДА ПоискРазделителя.НомерСтрокиТЧ ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Разделитель
	|ИЗ
	|	ДанныеПоказанийПУ КАК ДанныеПоказанийПУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоказанийПУ КАК ПоискРазделителя
	|		ПО ДанныеПоказанийПУ.ПриборУчета = ПоискРазделителя.ПриборУчета
	|			И ДанныеПоказанийПУ.ТарифнаяЗона = ПоискРазделителя.ТарифнаяЗона
	|			И ДанныеПоказанийПУ.НомерСтрокиТЧ > ПоискРазделителя.НомерСтрокиТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоказанийПУ.Период,
	|	ДанныеПоказанийПУ.ПериодРегистрации,
	|	ДанныеПоказанийПУ.Район,
	|	ДанныеПоказанийПУ.МКД,
	|	ДанныеПоказанийПУ.ПриборУчета,
	|	ДанныеПоказанийПУ.НомерСтрокиТЧ,
	|	ДанныеПоказанийПУ.ТарифнаяЗона,
	|	ДанныеПоказанийПУ.Показание,
	|	ДанныеПоказанийПУ.СостояниеПоказаний,
	|	ДанныеПоказанийПУ.КС,
	|	ДанныеПоказанийПУ.Переворот,
	|	ДанныеПоказанийПУ.ПериодНачисления";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 	
КонецФункции 

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);  
	ДанныеШапки.Вставить("Организация",				Организация); 
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	ДанныеШапки.Вставить("МКД",						МКД);
	ДанныеШапки.Вставить("ТочкиУчета",				ТочкиУчета);
	ДанныеШапки.Вставить("Документ",				Ссылка);  	
	Возврат ДанныеШапки;	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли