#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерефейс

Функция ПолучитьРольИсполнителя(Исполнитель) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестРолиИИсполнители.Роль КАК Роль
		|ИЗ
		|	РегистрСведений.бестРолиИИсполнители КАК бестРолиИИсполнители
		|ГДЕ
		|	бестРолиИИсполнители.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Роль;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли