#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестОперацияСПриборомУчетаНП(ЭтотОбъект, Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		ИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	
	ЗаполнитьТекстовыеПоля();
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорФилиал", "Видимость", Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт());
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	//энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	ЗаполнитьТекстовыеПоля();
	
	ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Узлы Учета-- Переопределил
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект, Истина);
	//энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект, Истина); 	
	// --Узлы Учета 
	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	СоответствиеСтрок 						= Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);

	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//// Узлы Учета-- Переопределил
		//// энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);//Переопределил на процедуру "НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ПриборыУзловУчета",Отказ)"		
		//// --Узлы Учета
		//энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаУзловПоПараметрам(ТекущийОбъект,"ПриборыУзловУчета",Отказ);		
		//
		//НовыеУзлыУчета 						= Новый Массив;
		//НовыеПриборыУчета 					= Новый Массив;				
		//
		//Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
		//	
		//	//Теперь это для узлов --
		//	Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
		//		СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеУзлыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;
		//	//--Теперь это для узлов					
		//	
		//КонецЦикла;
		//
		//Для Каждого СтрокаПриборовУчета Из ТекущийОбъект.ПриборыУзловУчета Цикл
		//	
		//	Если Не ПустаяСтрока(СтрокаПриборовУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаПриборовУчета.ПриборУчета) Тогда
		//		СтрокаПриборовУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеПриборыУчета.Добавить(СтрокаПриборовУчета.НомерСтроки);
		//	КонецЕсли;			
		//	
		//КонецЦикла;
		//
		//Если Объект.ПриборыУзловУчета.Количество()=0  Тогда
		//	Отказ= Истина;
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены приборы учета для услуги");
		//КонецЕсли;
		//
		//	
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеУзлыУчета", 	НовыеУзлыУчета);
		
		Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеУзлыУчета 						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		НовыеИзмерители 					= Новый Массив;
		СоответствиеПрибора 				= Новый Соответствие;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;
			
		КонецЦикла;
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
			КонецЕсли;			
		КонецЦикла;
		
		
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект);
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеУстановкиФормулы(ТекущийОбъект);
		
		// Узлы Учета-- Переопределил
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ); 
		// Узлы Учета-- Переопределил
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
		//энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
		
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.ОбъектРасчета);
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");

	//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
		
	ЗаполнитьТекстовыеПоля();
	
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестОперацияСПриборомУчетаНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) <> Объект.ДатаФактическогоСобытия и ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроведения",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Дата документа отличается от фактической даты! Провести документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдресОбъекта();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестОперацияСПриборомУчетаНП",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

#КонецОбласти

#Область  СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	
	энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ТекущиеДанные.IDСтроки,Объект);
	//ТаблицыФормы				= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	//
	//ТаблицыФормыВторогоУровня	= Новый Массив;
	//ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);

	//ТаблицыФормы				= Новый Массив;
	//ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	//ТаблицыФормы.Добавить("ШкалыУслуг");
	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ВыборУслугиИТочкиУчета(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока  и Не Копирование Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.СредстваИзмерения 		= "Не заполнены";
	ИначеЕсли НоваяСтрока и Копирование Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.ТочкаУчета = Неопределено;
		ТекущиеДанные.Услуга = Неопределено;
		ТекущиеДанные.ТипУзлаУчета = Неопределено;
		ТекущиеДанные.ВладелецУзлаУчета = Неопределено;
		ТекущиеДанные.НачалоДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.КонецДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.СредстваИзмерения 		= "Не заполнены";		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета",Объект.ДатаФактическогоСобытия);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
		
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца,ТочкиСПриборами,ВыводитьСоставные", СтруктураОтбора, "НП", Ложь,Истина);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	ТекущиеДанные 				= Элементы.ТочкиУчета.ТекущиеДанные;
	
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		ТекДанные					= ДополнительныеПараметры.ТекДанные;
		ТекДанные.ТочкаУчета		= РезультатЗакрытия.ТочкаУчета;
		ТекДанные.НаименованиеТочки	= Строка(РезультатЗакрытия.ТочкаУчета);
		ТекДанные.Услуга			= РезультатЗакрытия.Услуга;
		
		Если ЗначениеЗаполнено(ТекДанные.ТочкаУчета) Тогда
			СписокСтрок = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("Услуга, ТочкаУчета", ТекДанные.Услуга, ТекДанные.ТочкаУчета));
			Если СписокСтрок.Количество() > 1 Тогда
				ТекДанные.ТочкаУчета = Неопределено;
				ТекДанные.Услуга 	 = Неопределено;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Точка учета уже добавлена в документ");
			КонецЕсли;
		КонецЕсли;

		ДанныеУзлаУчета 			= ВернутьУзелУчета(Объект.ОбъектРасчета,ТекДанные.ТочкаУчета);
		ЗаполнитьЗначенияСвойств(ТекДанные,ДанныеУзлаУчета);
		//ТекДанные.ПриборУчета		= ВернутьУзелУчета(ТекДанные.ОбъектРасчета,ТекДанные.ТочкаУчета);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПроведения(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Нет тогда
			Отказ = Истина;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		МКД = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "МКД");
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РАБОТА_С_УЗЛАМИ

#Область ДОБАВЛЕНИЕ_ПУ_К_УЗЛАМ

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить тип узла учета!");
	ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.НачалоДействияКоммерскогоУчета) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить начало действия ком. учета!");
	ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.КонецДействияКоммерскогоУчета) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить конец действия ком. учета!");
	Иначе	
		СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
		ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);
		энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	КонецЕсли;
	
				
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ВернутьУзелУчета(ОбъектРасчета,ТочкаУчета)  	
	
	Ответ = Новый Структура("ПриборУчета,ТипУзлаУчета",Справочники.энргПриборыУчетаАбонента.ПустаяСсылка(),Справочники.энргТипыПриборовУчета.ПустаяСсылка());
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Организация",		Объект.Организация);
	Запрос.УстановитьПараметр("Район",				Объект.Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета",			ТочкаУчета);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета.ТипУзлаУчета КАК ТипУзлаУчета
		|ИЗ
		|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестПриборыТочекУчетаНПСрезПоследних";
	
	РезультатЗапроса 	= Запрос.Выполнить(); 	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ,Выборка); 		
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

#Область ПЕРЕОПРЕДЕЛЕННЫЕ_ПРОЦЕДУРЫ

&НаКлиенте
Процедура ТочкиУчетаНачалоДействияКоммерскогоУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ПроверитьДаты(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаКонецДействияКоммерскогоУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ПроверитьДаты(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДаты(ТекущиеДанные) 	
		
	Если ЗначениеЗаполнено(ТекущиеДанные.КонецДействияКоммерскогоУчета) и ЗначениеЗаполнено(ТекущиеДанные.НачалоДействияКоммерскогоУчета)  Тогда
		Если ТекущиеДанные.КонецДействияКоммерскогоУчета < ТекущиеДанные.НачалоДействияКоммерскогоУчета Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало действия коммерческого учета не может превышать конец");
			ТекущиеДанные.КонецДействияКоммерскогоУчета = Дата(1,1,1);
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдресОбъекта();
	МКД = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "МКД");
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область НОВАЯ_РАБОТА_С_УЗЛАМИ

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПараметрыОбновления) Экспорт 
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ);
	СтруктураДанныеПУ = ПараметрыОбновления.ДанныеПУ;
	СтруктураДанныеПУ.Удалить("НачалоДействияКоммерскогоУчета");
	СтруктураДанныеПУ.Удалить("КонецДействияКоммерскогоУчета");
	ТекСтрока = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", ПараметрыОбновления.IDСтроки));
	ТекСтрока[0].КоэффициентПУ = ПараметрыОбновления.Результат.КоэффициентПУ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()	
	Для Каждого ТекСтрока ИЗ Объект.ТочкиУчета Цикл
		ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект,"ЮЛ");
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		//ДанныеТочкиУчета 									= Новый Структура(бестРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваТочекУчета());
		//СоотвествиеРеквизитов 								= бестРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		//Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
		//	ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		//КонецЦикла; 		
		//ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#Область РаботаСТехническимиСвойствамиТУ


/////////////////////////////////////////////
// Получение входных данных

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, IDСтроки)
	ИдентификаторФормы 				= ЭтаФорма.УникальныйИдентификатор;
	Если ИспользоватьТарифныеЗоны Тогда
		Потери = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки), "ТарифнаяЗона, ФиксированныйОбъемПотерь, ПроцентПотерь");
		Шкалы = Объект.ШкалыПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки), "ВидДифференцированности");
		ТаблицаПотерь = Обработки.энргОперацияУзламиУчета.ПолучитьТаблицуПотерь(Шкалы, Потери);
	Иначе
		ТаблицаПотерь = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки));
	КонецЕсли;
	ТехническиеСвойстваТУ.Потери = ПоместитьВоВременноеХранилище(ТаблицаПотерь, ИдентификаторФормы);
КонецПроцедуры


/////////////////////////////////////////////
// Обработка возврата результата

&НаСервере
Процедура ЗаполнитьПотериИзРезультата(IDСтроки, Результат, ТехническиеСвойстваТУ)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери, Новый Структура("IDСтроки", IDСтроки));
	
	ПотериРезультат = ПолучитьИзВременногоХранилища(Результат.Потери);
	ПотериРезультат.Колонки.Добавить("IDСтроки");
	ПотериРезультат.ЗаполнитьЗначения(IDСтроки, "IDСтроки");
	Объект.Потери.Загрузить(ПотериРезультат); 	
	
	ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(Результат, ПотериРезультат,"ЮЛ");	
КонецПроцедуры

#КонецОбласти

#КонецОбласти