#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет средний объем потребления МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СреднийОбъемПотребленияМКД(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСреднийОбъемПотребленияМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ИменаТаблиц 				= Новый Структура("СреднийОбъемПотребления","Организация, ПериодНачисления, Район, МКД, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона");
		ДоступныеПараметры 			= Новый Структура;
		ДоступныеПараметры.Вставить("СреднийОбъемПотребления","Организация, ПериодНачисления, Район, МКД, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона");
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "СреднийОбъемПотребления", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Заполняет средний объем потребления МКД коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СреднийОбъемПотребленияМКДКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаПериодов, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаСреднийОбъемПотребленияМКДКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона";
		ИмяТаблицы 					= "СреднийОбъемПотребленияМКД";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ИмяТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

// Актуализирует данные среднего объема.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  МКД					-	СправочникСсылка.энргСтроения.
//
Процедура АктуализироватьДанныеСреднегоОбъема(Организация, ПериодНачисления, Район, МКД=Неопределено) Экспорт
	
	Набор  		= СоздатьНаборЗаписей();
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Если НЕ МКД = Неопределено Тогда
		Набор.Отбор.МКД.установить(МКД);
	КонецЕсли;  
	
	Набор.Записать();
	
	Результат   = РегистрыСведений.энргРасчетСреднегоОбъемаМКД.РезультатаЗапросаСреднегоПотребленияМКД(Организация, ПериодНачисления, Район);
	Выборка 	= Результат.Выбрать();
	Набор  		= СоздатьНаборЗаписей();				 
	Пока Выборка.следующий() цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);		
	КонецЦикла;
	
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса на получение среднего объема потребления МКД.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСреднийОбъемПотребленияМКД() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	СреднийОбъемПотребления.Организация КАК Организация,
	|	СреднийОбъемПотребления.ПериодНачисления КАК ПериодНачисления,
	|	СреднийОбъемПотребления.Район КАК Район,
	|	СреднийОбъемПотребления.МКД КАК МКД,
	|	СреднийОбъемПотребления.Услуга КАК Услуга,
	|	СреднийОбъемПотребления.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребления.Шкала КАК Шкала,
	|	СреднийОбъемПотребления.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребления.Объем КАК Объем,
	|	СреднийОбъемПотребления.ОбъемПотребленный КАК ОбъемПотребленный
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК СреднийОбъемПотребления";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса на получение среднего объема потребления МКД коллекция периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТексЗапросаСреднийОбъемПотребленияМКДКоллекцияПериодов() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	СреднийОбъемПотребленияМКД.Организация КАК Организация,
	|	СреднийОбъемПотребленияМКД.ПериодНачисления КАК ПериодНачисления,
	|	СреднийОбъемПотребленияМКД.Район КАК Район,
	|	СреднийОбъемПотребленияМКД.МКД КАК МКД,
	|	СреднийОбъемПотребленияМКД.Услуга КАК Услуга,
	|	СреднийОбъемПотребленияМКД.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребленияМКД.Шкала КАК Шкала,
	|	СреднийОбъемПотребленияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребленияМКД.Объем КАК Объем,
	|	СреднийОбъемПотребленияМКД.ОбъемПотребленный КАК ОбъемПотребленный
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК СреднийОбъемПотребленияМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|		ПО СреднийОбъемПотребленияМКД.Организация = ТаблицаПериодов.Организация
	|			И СреднийОбъемПотребленияМКД.Район = ТаблицаПериодов.Район
	|			И СреднийОбъемПотребленияМКД.ПериодНачисления = ТаблицаПериодов.ПериодНачисления";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли