#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДокумент  = Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			ЗаполнитьДокумент = истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Абонент) и ЗаполнитьДокумент тогда
		ЗаполнитьДанныеАбонентаСервер(); 
		ЗаполнитьПриборыУчетаСервер();
	КонецЕсли;
		
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"ПоставщикПосле");
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками } 
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
		энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,"Поставщик","ПараметрыПоставщиков");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)	
	Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
	ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьДанныеАбонентаСервер();
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
		
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);
	
	ЗаполнитьПриборыУчетаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчета,Неопределено,ТекДанные); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент,Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения,СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекСтрока,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекСтрока.Услуга)); 
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикПослеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекСтрока,Новый Структура("ИмяСвойстваПоставщик","ПоставщикПосле"));
	// энргРаботаСПоставщиками }  
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекДанные);
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикПослеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		// энргРаботаСПоставщиками {
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;
	Если не ТекСтрока.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекСтрока,Новый Структура("ИмяСвойстваПоставщик","ПоставщикПосле"));
	// энргРаботаСПоставщиками }

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ЗаполнитьУслугаАбонента(Команда)
	//ЗаполнитьДанныеАбонентаСервер();
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаКлиенте
Процедура РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные)
	ДопПараметры = Новый Структура("РегистрируетОбъем,ЭтоВводПУ,НеРегистрацияОбъема",ТекущиеДанные.РегистрируетОбъем,Истина,Истина);
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма,ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПередУдалениемСтрокиТочкиУчета()
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
		
	ТабЧасть  								= объект.ШкалыПриборовУчета ;
	СтрокиТЧ 								= ТабЧасть.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки));
	для Каждого СтрокаТЧ из СтрокиТЧ цикл
		СтрокиПоказаний 					= объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаТЧ.IDСтроки));
		Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
			 объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
		КонецЦикла;				
		ТабЧасть.удалить(СтрокаТЧ);
	КонецЦикла;
	
	//ТабЧасть  								= объект.ШкалыПриборовУчета ;
	//СтрокиТЧ 								= ТабЧасть.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета",ТекущиеДанные.IDСтрокиВывод));
	//для Каждого СтрокаТЧ из СтрокиТЧ цикл
	//	СтрокиПоказаний 					= объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаТЧ.IDСтроки));
	//	Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
	//		 объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
	//	КонецЦикла;				
	//	ТабЧасть.удалить(СтрокаТЧ);
	//КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ИдентификаторСтроки = Неопределено)
	ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");	
	ТочкаУчета  									= Неопределено;
	Если ИдентификаторСтроки = Неопределено Тогда
		ТаблицаТЧ 									= Объект.ПоказанияПриборовУчета.Выгрузить();
		Объект.ШкалыПриборовУчета.Очистить();
		Объект.ПоказанияПриборовУчета.Очистить();
		Объект.ТочкиУчета.Очистить();
	Иначе
		СтрокаТочкиУчета  							= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТочкаУчета 									= СтрокаТочкиУчета.ТочкаУчета;
		ПоискШкал	 								= Новый Структура("IDСтрокиТочкиУчета",СтрокаТочкиУчета.IDСтроки);
		СтрокиШкал  								= Объект.ШкалыПриборовУчета.НайтиСтроки(ПоискШкал);
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			ПоискПоказаний 							= Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки);
			СтрокиПоказаний 						= Объект.ПоказанияПриборовУчета.НайтиСтроки(ПоискПоказаний);
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
			КонецЦикла;
			Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
		КонецЦикла;		
	КонецЕсли;                                                                               
	
	ДатаЗаполненияПоказаний = ?(Объект.ДатаФактическогоСобытия = Дата(1,1,1), Объект.Дата, Объект.ДатаФактическогоСобытия);
	
	Результат 										= Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы(ДатаЗаполненияПоказаний,Объект.Организация,Объект.Район,Объект.КлючПомещения,ТочкаУчета, Новый Структура("ТолькоОткрытыеЛС", Истина)); 
	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	//ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	
	СоотвествиеСоставныхУслуг 						= Новый Соответствие;
	мТочкиСоставныхУслуг 							= Новый Массив;
	
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			Если ИдентификаторСтроки = Неопределено Тогда
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			иначе 				
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
				IDСтрокиТочки 						= СтрокаТочкиУчета.IDСтроки;
			КонецЕсли;
			СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;

			СтрокаТочкиУчета.ЭтоСоставнаяУслуга 	= Выборка.СоставнаяУслуга;
			СтрокаТочкиУчета.ПриборУчета 			= Выборка.ПриборУчета;
			Если Не СтрокаТочкиУчета.ЭтоСоставнаяУслуга Тогда
				СтрокаТочкиУчета.Поставщик			= Выборка.Поставщик;
			Иначе
				СоотвествиеСоставныхУслуг.Вставить(Выборка.ТочкаУчета,СтрокаТочкиУчета.IDСтроки);
				мТочкиСоставныхУслуг.Добавить(Выборка.ТочкаУчета);
			КонецЕсли;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			//Если НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			//КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;
		//ТекШкала 									= Выборка.Шкала;
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 					= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район,Объект.КлючПомещения,ИдентификаторСтроки); 
	РезультатДанныеЗаполненияПоказаний 				= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,Объект.Район,ТаблицаПоказанийДляЗаполнения,ДатаЗаполненияПоказаний);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
		
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ЗаполнитьПоставщиковСоставныхУслуг(мТочкиСоставныхУслуг, СоотвествиеСоставныхУслуг, ДатаЗаполненияПоказаний);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоставщиковСоставныхУслуг(мТочкиСоставныхУслуг, СоотвествиеСоставныхУслуг, ДатаЗаполненияПоказаний)
	Если мТочкиСоставныхУслуг.Количество() > 0 Тогда
		РезультатПоставщикиСоставныхУслуг 			= Обработки.энргПоставщикиУслугМенеджер.РезультатПоставщикиСоставныхУслуг(Объект.Организация,Объект.Район,Объект.КлючПомещения,ДатаЗаполненияПоказаний,мТочкиСоставныхУслуг);
		Выборка 									= РезультатПоставщикиСоставныхУслуг.Выбрать();
		Пока Выборка.Следующий() Цикл
			IDСтрокиТочки 							= СоотвествиеСоставныхУслуг[Выборка.ТочкаУчета];
			СтрокаПоставщика 						= Объект.ПоставщикиСоставныхУслуг.Добавить();
			СтрокаПоставщика.IDСтроки 				= IDСтрокиТочки;
			СтрокаПоставщика.ЧастьСоставнойУслуги 	= Выборка.Услуга;
			СтрокаПоставщика.Поставщик 				= Выборка.Поставщик;
		КонецЦикла;		
	КонецЕсли;

	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"ПоставщикПосле");
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьДанныеАбонентаСервер()
	
	//ТаблицаТЧ 											= Объект.ПоказанияПриборовУчета.Выгрузить();
	//
	//Объект.ПоказанияПриборовУчета.Очистить();
	//Объект.ТочкиУчета.Очистить();
	//Объект.ПоставщикиСоставныхУслуг.Очистить();
	//
	//Результат 											= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПомещения(Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения);
	//Выборка  											= Результат.выбрать();
	//ЕстьСледующий 										= Выборка.следующий();
	//Пока ЕстьСледующий цикл
	//	СтрокаПриборов  								= Объект.ТочкиУчета.Добавить();
	//	СтрокаПриборов.IDСтроки 						= Новый УникальныйИдентификатор;
	//	ЗаполнитьЗначенияСвойств(СтрокаПриборов,Выборка);
	//	ТекТочка 										= Выборка.точкаУчета;
	//	Если Выборка.ЭтоСоставнаяУслуга тогда
	//		Пока ТекТочка = Выборка.точкаУчета и ЕстьСледующий  цикл
	//			СтрокаПоставщик 						= Объект.ПоставщикиСоставныхУслуг.Добавить();
	//			СтрокаПоставщик.ЧастьСоставнойУслуги 	= Выборка.ЧастьСоставной;
	//			СтрокаПоставщик.Поставщик 				= Выборка.Поставщик;
	//			СтрокаПоставщик.IDСтроки 				= СтрокаПриборов.IDСтроки;
	//			ЕстьСледующий 							= Выборка.следующий();
	//		КонецЦикла;		
	//	иначе
	//		ЕстьСледующий 								= Выборка.следующий();
	//	КонецЕсли;		 		 
	//КонецЦикла; 
	//
	//энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчета(Объект.ТочкиУчета,Объект.ПоказанияПриборовУчета,ТаблицаТЧ,Объект.Дата,Объект.Организация,Объект.Район,Объект.Абонент,Ложь);
	//
	//// энргРаботаСПоставщиками {
	//энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	//энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"ПоставщикПосле");
	//// энргРаботаСПоставщиками } 
КонецПроцедуры  

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,"ПоставщикПосле",ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТочкиНаОснованииДереваУслуг(Строки, Родитель)
	
Для Каждого Строка Из Строки Цикл 		
		СтрокаТочки  						= Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочки, Строка);
		Если Не Родитель = Неопределено Тогда
			СтрокаТочки.IDСтрокиРодитель	= Родитель;			
		КонецЕсли;
		ЗаполнитьТочкиНаОснованииДереваУслуг(Строка.ПолучитьЭлементы(), Строка.IDСтроки);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {	
	ИмяТаблицы								= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормы		 					= Элементы[ИмяТаблицы];	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормы,"IDСтроки",ТекущиеДанные.IDСтроки);

КонецПроцедуры


&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки);	
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ПередУдалениемСтрокиТочкиУчета();
КонецПроцедуры

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны 

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаНетШкалЕстьТарифныеЗоны";
		
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыПоказаний					= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны;	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказаний,"IDСтроки",ТекущиеДанные.IDСтрокиШкалы);
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ПередУдалениемСтрокиТочкиУчета();
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон 

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалНетТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	
	ИмяТаблицы								= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормы	 						= Элементы[ИмяТаблицы];
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормы,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки);
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
	//энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалНетТарифныеЗоныПередУдалением(Элемент, Отказ)
	ПередУдалениемСтрокиТочкиУчета();
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон 

&НаКлиенте
Процедура ТочкиУчетаНетШкалыНетТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры


#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПоставщикПослеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщикПосле,ИмяСвойстваПоставщик","ПоставщикПосле", "Поставщик"));
	//энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти