#Область СлужебныеПроцедурыИФункции

#Область ЗАГРУЗИТЬ_ОПЛАТУ
//===========================ПОЛУЧЕНИЕ ДАННЫХ===================================================

Функция ЗагрузитьОплату(Адрес,ПутьФайла,Таблица) Экспорт 
	ФайлПриемник 	= ПолучитьИмяВременногоФайла("txt");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(Адрес);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	
	Разделитель 	= "=";	
	Файл 			= Новый ЧтениеТекста(ФайлПриемник); 	
	СтрокаНачала 	= "СекцияДокумент";
	СтрокаКонца 	= "КонецДокумента";
	
	ТаблицаДанных = ВернутьТаблицуЗначенийПоСтруктуре(ПолучитьСтруктуруФайла("Оплата"));
	
	Колонки = ТаблицаДанных.Колонки;
	Строка 	= Файл.ПрочитатьСтроку();
	
	ЗаписыватьДанные 	= Ложь;
	СтрокаИндекс 		= -1;
	ТаблицаСЛицевыми	= Новый ТаблицаЗначений;
	КЧ = Новый КвалификаторыЧисла(15);
	КС = Новый КвалификаторыСтроки(20);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	

	ТаблицаСЛицевыми.Колонки.Добавить("ИндексСтроки",ОписаниеТиповЧ);
	ТаблицаСЛицевыми.Колонки.Добавить("ЛС"			,ОписаниеТиповС);
	
	Пока Строка <> Неопределено Цикл
		Строка 		 = Файл.ПрочитатьСтроку();			
		
		Если Строка <> Неопределено Тогда			
			ДанныеСтроки = ПолучитьДанныеСтроки(Разделитель,Строка);
			Если СтрНайти(ДанныеСтроки.Реквизит, СтрокаНачала) > 0 Тогда
				Если ДанныеСтроки.Значение = "Платежное поручение" Тогда				
					НоваяСтрока 	 = ТаблицаДанных.Добавить();
					ЗаписыватьДанные = Истина;
					СтрокаИндекс 	 = СтрокаИндекс + 1;
				иначе
					ЗаписыватьДанные = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаписыватьДанные Тогда
				ОбработатьСтроку(НоваяСтрока,ДанныеСтроки,СтрокаНачала,Колонки,СтрокаИндекс,ТаблицаСЛицевыми);				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	Файл.Закрыть();	
	УдалитьФайлы(ФайлПриемник);
	
	ОбработатьЛС(ТаблицаДанных,ТаблицаСЛицевыми);		
	ВернутьТЗСДанными(ТаблицаДанных,ПутьФайла,Таблица);
	
КонецФункции

Процедура ВернутьТЗСДанными(ТаблицаДанных,ПутьФайла,Таблица)
	
	Запрос 	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Данные.Номер КАК Номер,
	|	ВТ_Данные.Дата КАК Дата,
	|	ВТ_Данные.Абонент КАК Абонент,
	|	ВТ_Данные.Сумма КАК Сумма,
	|	ВТ_Данные.ПлательщикСчет КАК ПлательщикСчет,
	|	ВТ_Данные.ПлательщикИНН КАК ПлательщикИНН,
	|	ВТ_Данные.Плательщик КАК Плательщик,
	|	ВТ_Данные.Плательщик1 КАК Плательщик1,
	|	ВТ_Данные.ПлательщикБИК КАК ПлательщикБИК,
	|	ВТ_Данные.ПлательщикКорсчет КАК ПлательщикКорсчет,
	|	ВТ_Данные.ПлательщикБанк1 КАК ПлательщикБанк1,
	|	ВТ_Данные.ПлательщикРасчСчет КАК ПлательщикРасчСчет,
	|	ВТ_Данные.ПлательщикКПП КАК ПлательщикКПП,
	|	ВТ_Данные.ПолучательСчет КАК ПолучательСчет,
	|	ВТ_Данные.Получатель КАК Получатель,
	|	ВТ_Данные.ПолучательИНН КАК ПолучательИНН,
	|	ВТ_Данные.ПолучательРасчСчет КАК ПолучательРасчСчет,
	|	ВТ_Данные.ПолучательБанк1 КАК ПолучательБанк1,
	|	ВТ_Данные.ПолучательБИК КАК ПолучательБИК,
	|	ВТ_Данные.ПолучательКорсчет КАК ПолучательКорсчет,
	|	ВТ_Данные.ПолучательКПП КАК ПолучательКПП,
	|	ВТ_Данные.СчетНаОплату КАК СчетНаОплату,
	|	ВТ_Данные.ПериодОплаты КАК ПериодОплаты,
	|	ВТ_Данные.НазначениеПлатежа КАК НазначениеПлатежа
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Номер КАК Номер,
	|	ВТ_Данные.Дата КАК Дата,
	|	ВТ_Данные.Сумма КАК Сумма,
	|	ВТ_Данные.ПлательщикСчет КАК ПлательщикСчет,
	|	ВТ_Данные.ПлательщикИНН КАК ПлательщикИНН,
	|	ВЫРАЗИТЬ(ВТ_Данные.Плательщик КАК СТРОКА(700)) КАК Плательщик,
	|	ВТ_Данные.ПлательщикБИК КАК ПлательщикБИК,
	|	ВТ_Данные.ПлательщикКорсчет КАК ПлательщикКорсчет,
	|	ВТ_Данные.ПлательщикБанк1 КАК ПлательщикБанк1,
	|	ВТ_Данные.ПлательщикРасчСчет КАК ПлательщикРасчСчет,
	|	ВТ_Данные.ПлательщикКПП КАК ПлательщикКПП,
	|	ВТ_Данные.ПолучательСчет КАК ПолучательСчет,
	|	ВТ_Данные.Получатель КАК Получатель,
	|	ВТ_Данные.ПолучательИНН КАК ПолучательИНН,
	|	ВТ_Данные.ПолучательРасчСчет КАК ПолучательРасчСчет,
	|	ВТ_Данные.ПолучательБанк1 КАК ПолучательБанк1,
	|	ВТ_Данные.ПолучательБИК КАК ПолучательБИК,
	|	ВТ_Данные.ПолучательКорсчет КАК ПолучательКорсчет,
	|	ВТ_Данные.ПолучательКПП КАК ПолучательКПП,
	|	ВТ_Данные.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_Данные.СчетНаОплату КАК СчетНаОплату,
	|	ВТ_Данные.ПериодОплаты КАК ПериодОплаты,
	|	ВЫРАЗИТЬ(ВТ_Данные.Плательщик1 КАК СТРОКА(700)) КАК Плательщик1,
	|	Банки.Ссылка КАК Банк,
	|	ВТ_Данные.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ДанныеСКонтрагентом
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО ВТ_Данные.ПолучательБИК = Банки.Код
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСКонтрагентом.Номер КАК НомерПлатежногоПоручения,
	|	ВТ_ДанныеСКонтрагентом.Дата КАК ДатаПлатежногоПоручения,
	|	ВТ_ДанныеСКонтрагентом.Сумма КАК СуммаДокумента,
	|	ВТ_ДанныеСКонтрагентом.ПлательщикСчет КАК ПлательщикСчет,
	|	ВТ_ДанныеСКонтрагентом.ПлательщикИНН КАК ИНН,
	|	ВТ_ДанныеСКонтрагентом.Плательщик КАК Плательщик,
	|	ВТ_ДанныеСКонтрагентом.ПлательщикБИК КАК ПлательщикБИК,
	|	ВТ_ДанныеСКонтрагентом.ПлательщикКорсчет КАК ПлательщикКорсчет,
	|	ВТ_ДанныеСКонтрагентом.ПлательщикБанк1 КАК ПлательщикБанк1,
	|	ВТ_ДанныеСКонтрагентом.ПлательщикРасчСчет КАК РасчетныйСчетПлательщика,
	|	ВТ_ДанныеСКонтрагентом.ПлательщикКПП КАК КПП,
	|	ВТ_ДанныеСКонтрагентом.ПолучательСчет КАК ПолучательСчет,
	|	ВТ_ДанныеСКонтрагентом.Получатель КАК Получатель,
	|	ВТ_ДанныеСКонтрагентом.ПолучательИНН КАК ПолучательИНН,
	|	ВТ_ДанныеСКонтрагентом.ПолучательРасчСчет КАК РасчетныйСчетПолучателя,
	|	ВТ_ДанныеСКонтрагентом.ПолучательБанк1 КАК ПолучательБанк1,
	|	ВТ_ДанныеСКонтрагентом.ПолучательБИК КАК ПолучательБИК,
	|	ВТ_ДанныеСКонтрагентом.ПолучательКорсчет КАК ПолучательКорсчет,
	|	ВТ_ДанныеСКонтрагентом.ПолучательКПП КАК ПолучательКПП,
	|	ВТ_ДанныеСКонтрагентом.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_ДанныеСКонтрагентом.Абонент КАК Абонент,
	|	ВТ_ДанныеСКонтрагентом.Абонент.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ДанныеСКонтрагентом.Абонент.Наименование КАК ФИО,
	|	ВТ_ДанныеСКонтрагентом.СчетНаОплату КАК Счет,
	|	ВТ_ДанныеСКонтрагентом.ПериодОплаты КАК ПериодОплаты,
	|	ВТ_ДанныеСКонтрагентом.Плательщик1 КАК Плательщик1,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ДанныеСКонтрагентом.Плательщик1 = """"
	|			ТОГДА ВТ_ДанныеСКонтрагентом.Плательщик1
	|		ИНАЧЕ ВТ_ДанныеСКонтрагентом.Плательщик
	|	КОНЕЦ КАК ФИОПлательщика,
	|	ВТ_ДанныеСКонтрагентом.Банк КАК Банк,
	|	ЕСТЬNULL(энргПлатежноеПоручениеВходящие.Ссылка, &ПустаяСсылка) КАК пДокумент
	|ИЗ
	|	ВТ_ДанныеСКонтрагентом КАК ВТ_ДанныеСКонтрагентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящие
	|		ПО ВТ_ДанныеСКонтрагентом.Номер = энргПлатежноеПоручениеВходящие.НомерПлатежногоДокумента
	|			И ВТ_ДанныеСКонтрагентом.Дата = энргПлатежноеПоручениеВходящие.ДатаПлатежногоДокумента";
	
	ПустаяСсылка = Документы.энргПлатежноеПоручениеВходящие.ПустаяСсылка();
	
	Запрос.УстановитьПараметр("ПустаяСсылка",ПустаяСсылка);
	Запрос.УстановитьПараметр("Данные",ТаблицаДанных);
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	ПроверяемыеРеквизиты= ПроверяемыеРеквизитыДокументов(Документы.энргПлатежноеПоручениеВходящие.ПустаяСсылка(),Истина);
	
	ТекДата = ТекущаяДата();
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл 	
		
		ПроверкаСтроки = ПроверитьСтроку(Выборка,ПроверяемыеРеквизиты);
		Если ПроверкаСтроки.ПрошлаПроверку Тогда
			//НоваяСтрока = ТЧОплата.Добавить();
			ОписаниеОшибки = "";
		иначе
			//НоваяСтрока = ТЧНеЗагруженных.Добавить();
			//НоваяСтрока.ОписаниеОшибки = ПроверкаСтроки.ОписаниеОшибки;
			ОписаниеОшибки = ПроверкаСтроки.ОписаниеОшибки;
		КонецЕсли;
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);	
		НоваяСтрока.ОписаниеОшибок 	= ОписаниеОшибки;
		НоваяСтрока.ЕстьОшибка 		= не ОписаниеОшибки = "";
		НоваяСтрока.НомерСтроки     = НомерСтроки;
		НоваяСтрока.Загружать    	= ОписаниеОшибки = "";
		
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;  	
	
КонецПроцедуры

//============================СОЗДАНИЕ ДОКУМЕНТОВ==================================================

Процедура СоздатьДокументыОплат(ПутьФайла,Данные) Экспорт 
	
	ПроверяемыеРеквизиты 	= ПроверяемыеРеквизитыДокументов(Документы.энргПлатежноеПоручениеВходящие.ПустаяСсылка(),Истина);
	ПустаяСсылка 			= Документы.энргПлатежноеПоручениеВходящие.ПустаяСсылка();
	ТекДата 				= ТекущаяДата();
	
	Количество = 0;
	Для Каждого Выборка из Данные Цикл 	
		
		ПроверкаСтроки = ПроверитьСтроку(Выборка,ПроверяемыеРеквизиты);
		Если ПроверкаСтроки.ПрошлаПроверку Тогда
			ОписаниеОшибки = "";
		иначе
			ОписаниеОшибки = ПроверкаСтроки.ОписаниеОшибки;
		КонецЕсли;
		
		Если Выборка.пДокумент = ПустаяСсылка Тогда
			ПлатежноеПоручение 					= Документы.энргПлатежноеПоручениеВходящие.СоздатьДокумент();
		иначе
			ПлатежноеПоручение 					= Выборка.пДокумент.ПолучитьОбъект();
			ПлатежноеПоручение.ПометкаУдаления  = Ложь;
		КонецЕсли;
		
		ПлатежноеПоручение.Дата 			= ТекДата;
		ПлатежноеПоручение.ФайлДляЧтения 	= ПутьФайла;
		ЗаполнитьЗначенияСвойств(ПлатежноеПоручение,Выборка);
		ПлатежноеПоручение.Примечание = ОписаниеОшибки;
		
		Попытка
			ПлатежноеПоручение.Записать(РежимЗаписиДокумента.Проведение);
			Количество = Количество + 1;
		Исключение
			ЗаписьЖурналаРегистрации("Создание документов оплаты",УровеньЖурналаРегистрации.Ошибка,
			,,"Описание ошибки: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Созданы документы поступление на расчетный счет в количестве: " + Количество + "");
	
КонецПроцедуры

//============================ПОМОЩЬ==================================================

Функция ПолучитьДанныеСтроки(Разделитель,Строка)
	Строки 	 = СтрЗаменить(Строка, Разделитель, Символы.ПС);
	Реквизит = "";
	Значение = "";
	
	Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
		Если Индекс = 1 Тогда
			Реквизит = СтрПолучитьСтроку(Строки, Индекс);
		иначе
			Значение = СтрПолучитьСтроку(Строки, Индекс); 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Реквизит,Значение",Реквизит,Значение);
КонецФункции

Процедура ОбработатьСтроку(НоваяСтрока,ДанныеСтроки,СтрокаНачала,Колонки,СтрокаИндекс,ТаблицаСЛицевыми)
	Для Каждого Колонка из Колонки Цикл
		Если ДанныеСтроки.Реквизит = Колонка.Имя Тогда 			
			Значение 					= ДанныеСтроки.Значение;
			НоваяСтрока[Колонка.Имя] 	= ?(Колонка.Имя = "Дата",энргОбщегоНазначения.ПолучитьДатуИзСтроки(Значение),Значение);
			
			Если ДанныеСтроки.Реквизит = "Плательщик" Тогда
				НайтиВозможныйЛС(Значение,СтрокаИндекс,ТаблицаСЛицевыми);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура НайтиВозможныйЛС(СтрокаЗначениеРеквизита,СтрокаИндекс,ТаблицаСЛицевыми)
	
	Позиция = СтрНайти(СтрокаЗначениеРеквизита,"//",,,2);
	ДлинаЛС = 9;
	Если Позиция <> 0 Тогда 
		СтрокаПоиска = Сред(СтрокаЗначениеРеквизита, Позиция+2,ДлинаЛС); // ЛС состоит из 12 цифр и находится после второго символа "//"
		
		КоличествоСимволовСтроки 	= СтрДлина(СтрокаПоиска);
		ПредЗначениеЧисло 			= Истина;
		ЛС 							= "";
		Для  Счетчик=1 По КоличествоСимволовСтроки Цикл
			
			Если СтрДлина(ЛС) = ДлинаЛС Тогда
				НоваяСтрока 				= ТаблицаСЛицевыми.Добавить();
				НоваяСтрока.ИндексСтроки 	= СтрокаИндекс;
				НоваяСтрока.ЛС				= ЛС;
				ЛС = "";
			КонецЕсли;
			
			ВыбираемыйСимвол 	= СокрЛП(Сред(СтрокаПоиска,Счетчик,1));
			Попытка
				КодСимвола 			= Число(ВыбираемыйСимвол);
				ПредЗначениеЧисло 	= Истина;
				Если ПредЗначениеЧисло Тогда
					ЛС = ЛС + КодСимвола;
				КонецЕсли;			
			Исключение
				ЛС 					= "";
				ПредЗначениеЧисло 	= Ложь;
			КонецПопытки;	
			
		КонецЦикла;
		
		Если СтрДлина(ЛС) = ДлинаЛС Тогда
			НоваяСтрока 				= ТаблицаСЛицевыми.Добавить();
			НоваяСтрока.ИндексСтроки 	= СтрокаИндекс;
			НоваяСтрока.ЛС				= ЛС;
			ЛС = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОбработатьЛС(ТаблицаДанных,ТаблицаСЛицевыми)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСЛицевыми.ЛС КАК ЛС,
		|	ТаблицаСЛицевыми.ИндексСтроки КАК ИндексСтроки
		|ПОМЕСТИТЬ ВТ_ЛС
		|ИЗ
		|	&ТаблицаСЛицевыми КАК ТаблицаСЛицевыми
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЛС.ИндексСтроки КАК ИндексСтроки,
		|	энргАбоненты.Ссылка КАК Абонент
		|ИЗ
		|	ВТ_ЛС КАК ВТ_ЛС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО ВТ_ЛС.ЛС = энргАбоненты.ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ТаблицаСЛицевыми",ТаблицаСЛицевыми);
	РезультатЗапроса 	= Запрос.Выполнить();	
	ВыборкаИндексСтроки = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаИндексСтроки.Следующий() Цикл
		ТаблицаДанных[ВыборкаИндексСтроки.ИндексСтроки].Абонент = ВыборкаИндексСтроки.Абонент;
	КонецЦикла; 	
	
КонецПроцедуры


Функция ПроверитьСтроку(Выборка,ПроверяемыеРеквизиты) Экспорт 
	
	ПрошлаПроверку = Истина;
	ОписаниеОшибки = "Не заполнены поля: ";
	для Каждого Стр из ПроверяемыеРеквизиты Цикл
		Если не ЗначениеЗаполнено(Выборка[Стр]) Тогда
			ПрошлаПроверку = Ложь;
			ОписаниеОшибки = ОписаниеОшибки + Стр + ", ";
		КонецЕсли;		
	КонецЦикла;		
	
	Возврат	новый Структура("ОписаниеОшибки,ПрошлаПроверку",Лев(ОписаниеОшибки,СтрДлина(ОписаниеОшибки)-2),ПрошлаПроверку);
КонецФункции

Функция ВернутьТаблицуЗначенийПоСтруктуре(СтруктураФайла) Экспорт 
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Для Каждого Колонка из СтруктураФайла Цикл
		ТаблицаЗначений.Колонки.Добавить(Колонка.Ключ,Колонка.Значение);
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
КонецФункции

Функция ПолучитьСтруктуруФайла(ИмяОбмена) Экспорт
	СтруктураФайла = Новый Структура;
	ТипДата		= ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	Строка12 	= ОбщегоНазначения.ОписаниеТипаСтрока(12);
	
	Если ИмяОбмена  = "Начисления" Тогда 
		Число153 = ОбщегоНазначения.ОписаниеТипаЧисло(15,3);	
		
		СтруктураФайла.Вставить("Период"		,ТипДата);
		СтруктураФайла.Вставить("ЛицевойСчет"	,Строка12);
		СтруктураФайла.Вставить("КодУслуги"		,Строка12);
		СтруктураФайла.Вставить("Количество"	,ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		СтруктураФайла.Вставить("СтавкаНДС"		,Строка12);
		//СтруктураФайла.Вставить("Цена"			,Число153);
		СтруктураФайла.Вставить("Сумма "		,Число153);
		СтруктураФайла.Вставить("СуммаНДС"		,Число153);		
		СтруктураФайла.Вставить("Всего"			,Число153);		
		
	ИначеЕсли ИмяОбмена = "Оплата" Тогда		
		ТипСтрока 		= ОбщегоНазначения.ОписаниеТипаСтрока(0);
		ТипСтрокаОгр 	= ОбщегоНазначения.ОписаниеТипаСтрока(100);
		
		СтруктураФайла.Вставить("Номер"					,ТипСтрокаОгр);
		СтруктураФайла.Вставить("Дата"					,ТипДата);
		СтруктураФайла.Вставить("Абонент"				,Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
		СтруктураФайла.Вставить("Сумма"					,ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		СтруктураФайла.Вставить("ПлательщикСчет"		,ТипСтрока);
		СтруктураФайла.Вставить("ПлательщикИНН"			,ОбщегоНазначения.ОписаниеТипаСтрока(12));
		СтруктураФайла.Вставить("Плательщик"			,ТипСтрока);
		СтруктураФайла.Вставить("Плательщик1"			,ТипСтрока);
		СтруктураФайла.Вставить("ПлательщикБИК"			,ТипСтрокаОгр);
		СтруктураФайла.Вставить("ПлательщикКорсчет"		,ТипСтрока);
		СтруктураФайла.Вставить("ПлательщикБанк1"		,ТипСтрока);
		СтруктураФайла.Вставить("ПлательщикРасчСчет"	,ТипСтрока);
		СтруктураФайла.Вставить("ПлательщикКПП"			,ОбщегоНазначения.ОписаниеТипаСтрока(9));
		СтруктураФайла.Вставить("ПолучательСчет"		,ТипСтрока);
		СтруктураФайла.Вставить("Получатель"			,ТипСтрока);
		СтруктураФайла.Вставить("ПолучательИНН"			,ОбщегоНазначения.ОписаниеТипаСтрока(12));
		СтруктураФайла.Вставить("ПолучательРасчСчет"	,ТипСтрока);
		СтруктураФайла.Вставить("ПолучательБанк1"		,ТипСтрока);
		СтруктураФайла.Вставить("ПолучательБИК"			,ТипСтрокаОгр);
		СтруктураФайла.Вставить("ПолучательКорсчет"		,ТипСтрока);
		СтруктураФайла.Вставить("ПолучательКПП"			,ОбщегоНазначения.ОписаниеТипаСтрока(9));
		СтруктураФайла.Вставить("НазначениеПлатежа"		,ТипСтрока);
		СтруктураФайла.Вставить("СчетНаОплату"			,ТипСтрока);
		СтруктураФайла.Вставить("ПериодОплаты"			,ТипДата);
		
	ИначеЕсли ИмяОбмена = "СостоянияУслуг" Тогда
		
		Строка12 = ОбщегоНазначения.ОписаниеТипаСтрока(12);
		
		СтруктураФайла.Вставить("Дата"			,ТипДата);
		СтруктураФайла.Вставить("ЛицевойСчет"	,Строка12);
		СтруктураФайла.Вставить("Состояние"		,ОбщегоНазначения.ОписаниеТипаСтрока(100));
		
	КонецЕсли;
	
	Возврат СтруктураФайла;
	
КонецФункции

Функция ПроверяемыеРеквизитыДокументов(ОбъектПроверки,ТабЧасть = Ложь) Экспорт 
	МассивРеквизитов = Новый Массив;
	Если ТипЗнч(ОбъектПроверки) = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие") Тогда
		Если ТабЧасть Тогда
			МассивРеквизитов.Добавить("НомерПлатежногоПоручения");
			МассивРеквизитов.Добавить("ДатаПлатежногоПоручения");
			МассивРеквизитов.Добавить("СуммаДокумента");
			МассивРеквизитов.Добавить("НазначениеПлатежа");
			МассивРеквизитов.Добавить("РасчетныйСчетПлательщика");
			МассивРеквизитов.Добавить("РасчетныйСчетПолучателя");
			//МассивРеквизитов.Добавить("Абонент");
			//МассивРеквизитов.Добавить("Контрагент");
		Иначе 
		КонецЕсли;
	КонецЕсли; 
	
	Возврат МассивРеквизитов;
КонецФункции

#КонецОбласти        

#КонецОбласти
