#Область ПрограммныйИнтерфейс

// Процедура - Подготовить наборы записей к проведению
// Процедура выполняет подготовку наборов записей документа к проведению документа.
// 1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте).
// 2. Взводит флаг записи у наборов, по которым документ имел движения при прошлом проведении.
// 3. Устанавливает активность наборам записей документов с установленным флагом ручной корректировки.
// 4. Записывает пустые наборы, если дата ранее проведенного документа была сдвинута вперед.
// Вызывается из модуля объекта документа при проведении.
//
// Параметры:
//  Объект	 - ДокументОбъект 
//
Процедура ПодготовитьНаборыЗаписейКПроведению(Объект) Экспорт
	
	Для каждого НаборЗаписей Из Объект.Движения Цикл
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;		
		НаборЗаписей.записывать = истина;
	КонецЦикла;

	Если Объект.ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
			
	Если Объект.ДополнительныеСвойства.ДатаДокументаСдвинутаВперед Тогда
		Объект.Движения.Записать();
	КонецЕсли;

КонецПроцедуры

// Процедура - Перед записью объекта
// Процедура служит для регистрации документов в последовательности. Вызывается из процедуры ПередЗаписью в модуле объекта
//
// Параметры:
//  Источник - ДокументОбъект 
//
Процедура ПередЗаписьюОбъекта(Источник) Экспорт 
	
	ЭтоНовый 				= Не ЗначениеЗаполнено(Источник.Ссылка);
	ТипИсточника 			= ТипЗнч(Источник);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый);
	ДопСвойства 			= Источник.ДополнительныеСвойства;
	Если не ЭтоНовый тогда
				
		Если ДопСвойства.Свойство("ДатаПриОткрытии") тогда
			ДатаПриОткрытии = ДопСвойства.ДатаПриОткрытии;
		иначе
			ДатаПриОткрытии = Источник.Дата;
		КонецЕсли;		
		
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",ДатаПриОткрытии<Источник.Дата);		
				
	иначе
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",Ложь);
	КонецЕсли; 
	
	Если ДопСвойства.свойство("ГруппаОбъектовРасчета") тогда
		Если ДопСвойства.ГруппаОбъектовРасчета тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Инструменты  				= бестЗащитаСерверПовтИсп.РаботаСПериодомДействияНП();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	ДанныеПоследовательности  	= Инструменты.ДанныеПоследовательности(ТипИсточника);
	
	Если ДанныеПоследовательности.Регистрируется тогда
		ДобавитьПараметрыПоследовательности(Источник,ТипИсточника,ДанныеПоследовательности.Взаиморасчеты);
	КонецЕсли;  		 
		
КонецПроцедуры 

// Процедура - Выполнить движение
// Добавляет запись в движение и заполняет её
//
// Параметры:
//  ДанныеШапки		 - Структура или выборка 
//  ДвиженияНабор	 - КоллекцияДвижений
//
Процедура ВыполнитьДвижение(ДанныеШапки,ДвиженияНабор)  Экспорт 	
	Запись = ДвиженияНабор.добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);		
КонецПроцедуры

// Процедура - Выполнить движения
// Добавляет записи в движение и заполняет их
//
// Параметры:
//  ДанныеШапки		 - Структура или выборка 
//  ДвиженияНабор	 - КоллекцияДвижений 
//  ИмяКоллекции	 - Строка 
//
Процедура ВыполнитьДвижения(ДанныеШапки,ДвиженияНабор,ИмяКоллекции)  Экспорт
	Для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Если ДанныеШапки.Свойство("Приход") Тогда
			Если ДанныеШапки.Приход Тогда
				Запись = ДвиженияНабор.ДобавитьПриход();
			Иначе
				Запись = ДвиженияНабор.ДобавитьРасход();
			КонецЕсли;
		Иначе
			Запись = ДвиженияНабор.добавить(); 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись, стр);
		ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);		
	КонецЦикла;
КонецПроцедуры

// Процедура - Выполнить движения по результату запроса
//
// Параметры:
//  РезультатЗапроса	 - РезультатЗапроса 
//  ДвиженияНабор		 - КоллекцияДвижений 
//  СоответствиеКолонок	 - Соответствие 
//
Процедура ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса, ДвиженияНабор, СоответствиеКолонок = Неопределено)  Экспорт
	Выборка	= РезультатЗапроса.выбрать();	
	Пока Выборка.Следующий() цикл		
		Запись	= ДвиженияНабор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Если СоответствиеКолонок <> Неопределено Тогда 
			Для Каждого ТекСоответствие Из СоответствиеКолонок Цикл
				Запись[ТекСоответствие.Ключ] = Выборка[ТекСоответствие.Значение];
			КонецЦикла;	
		КонецЕсли;			                                       
	КонецЦикла;	
КонецПроцедуры

// Процедура - Записать наборы записей
//
// Параметры:
//  Объект	 - ДокументОбъект 
//
Процедура ЗаписатьНаборыЗаписей(Объект) Экспорт 
	
	ДополнительныеСвойства 	= Объект.ДополнительныеСвойства;
	Движения 				= Объект.Движения;
	ТаблицыДвижений 		= ДополнительныеСвойства.ТаблицыДвижений;
	КлючиТаблицДвижений 	= ДополнительныеСвойства.КлючиТаблицДвижений;
	Для Каждого КлючЗначение Из КлючиТаблицДвижений Цикл
		Если Движения.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
			Движения[КлючЗначение.Ключ].Загрузить(ТаблицыДвижений[КлючЗначение.Значение].Выгрузить());
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

#Область ВспомогательныеПроцедурыФункции

Процедура ДобавитьПараметрыПоследовательности(Источник,ТипИсточника,ИзменяетВзаиморасчеты)
		
	ПараметрыПроведения 											= Новый Структура;	
	
	ДокументыРегистрируемыеЗаднимЧислом 							= ДокументыРегистрируемыеЗаднимЧислом();
			
	Если ДокументыРегистрируемыеЗаднимЧислом.найти(ТипИсточника) <>Неопределено тогда
		ПараметрыПроведения.вставить("ПериодРегистрации",?(ЗначениеЗаполнено(Источник.ДатаФактическогоСобытия),Источник.ДатаФактическогоСобытия,Источник.Дата)); 
	КонецЕсли; 
	
	ПараметрыПроведения.Вставить("ПериодНачисления",				Источник.ПериодНачисления);		
	ПараметрыПроведения.Вставить("Район",							Источник.Район);
	ПараметрыПроведения.Вставить("Организация",						Источник.Организация);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("МКД",				Источник.метаданные()) тогда
		ПараметрыПроведения.Вставить("МКД",							Источник.МКД);
	КонецЕсли;
			
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОбъектРасчета",				Источник.метаданные()) тогда
		ПараметрыПроведения.Вставить("ОбъектРасчета",						Источник.ОбъектРасчета);
		ПараметрыПроведения.Вставить("МКД",									Источник.ОбъектРасчета.МКД);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ИсточникПоказаний",	Источник.метаданные()) тогда
		ПараметрыПроведения.Вставить("ИсточникПоказаний",			Источник.ИсточникПоказаний);
	КонецЕсли;

	Если ИзменяетВзаиморасчеты тогда
		Если Источник.ДополнительныеСвойства.Свойство("ИсточникПоступления") Тогда
			ПараметрыПроведения.Вставить("ИсточникПоступления",				Источник.ДополнительныеСвойства.ИсточникПоступления);
		КонецЕсли;
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоОплата") Тогда
			ПараметрыПроведения.Вставить("ЭтоОплата",				Источник.ДополнительныеСвойства.ЭтоОплата);
		КонецЕсли;

	КонецЕсли;
	
	Источник.ДополнительныеСвойства.вставить("ПараметрыПроведения",	ПараметрыПроведения);	
		
КонецПроцедуры

Функция ДокументыРегистрируемыеЗаднимЧислом()	
	Массив  = Новый Массив;
	Массив.Добавить(Тип("ДокументОбъект.бестОперацияСУслугамиНП"));
	Массив.Добавить(Тип("ДокументОбъект.бестРегистрацияПоказанийНП"));
	Возврат Массив;
КонецФункции

#КонецОбласти

#КонецОбласти

