#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов	-	ТаблицаЗначений	-	состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		-	Структура.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСПриборомУчетаМКД",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСПриборомУчетаМКД",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОперацияСПриборомУчетаМКД");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка, ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции МКД закрыт'"); 
	
	ПараметрыЗапроса 							= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 								ДокументСсылка);
	ПараметрыЗапроса.Вставить("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса = Новый Структура;
	Схема 			 = Неопределено;
	ИнициализироватьИсходныеДанныеДокумента(Схема);
	
	ДобавитьТекстЗапросаПриборыТочекМКД(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеПриборовМКД(Схема, Регистры);
	ДобавитьТекстЗапросаэнргВыводПриборовУчетаМКД(Схема, Регистры);
	
	ДобавитьТекстЗапросаэнргВидыДифференцированностиПриборовУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаэнргПоказанияПриборовУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаэнргКоэффциентыПриборовУчета(Схема, Регистры);
	
	ДобавитьТекстЗапросаэнргНомерПломбПриборовУчетаМКД(Схема, Регистры);	
	ДобавитьТекстЗапросаэнргДатыПоверкиПрибораУчета(Схема, Регистры); 	
	ДобавитьТекстЗапросаПриборыМОП(Схема, Регистры);
	
	ДобавитьТекстЗапросаВспомогательноеОборудованиеУзловУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеВспомогательногоОборудованияУзловУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаДопускПриборовУчетаККоммерческомуУчетуМКД(Схема, Регистры);
	ДобавитьТекстЗапросаПараметрыИзмерителей(Схема, Регистры); 	
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ИспользоватьУзлыМКД 			= энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД();
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка); 	
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	ПараметрыЗапроса.Вставить("ИспользоватьУзлыМКД", 			ИспользоватьУзлыМКД);
			
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема)
	ПолучитьШапкуДокумента(Схема);
	ПолучитьТаблицуТочекУчета(Схема);
	ПолучитьТаблицуИзмерителей(Схема);
	ПолучитьТаблицуШкалыПриборовУчета(Схема);
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Дата,
	|	Шапка.ДатаФактическогоСобытия КАК ДатаФактическогоСобытия,
	|	Шапка.Организация КАК Организация,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	Шапка.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ШапкаДокумента
	|ИЗ
	|	Документ.энргОперацияСПриборомУчетаМКД КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)");
	
КонецПроцедуры  

Процедура ПолучитьТаблицуТочекУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.Ссылка КАК Ссылка,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.IDСтроки КАК IDСтроки,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.IDСтрокиВывод КАК IDСтрокиВывод,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ДатаПриемки КАК ДатаПриемки,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ДатаУстановкиСчетчика КАК ДатаУстановкиСчетчика,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.НомерПломбы КАК НомерПломбы,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ПриборУчетаВывод КАК ПриборУчетаВывод,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.Услуга КАК Услуга,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.УзелУчета КАК УзелУчета,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ТипУзлаУчета КАК ТипУзлаУчета,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.ВидПараметра КАК ВидПараметра,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.НазначениеПУ КАК НазначениеПУ
	|ПОМЕСТИТЬ ТаблицаТочекУчета
	|ИЗ
	|	Документ.энргОперацияСПриборомУчетаМКД.ТочкиУчета КАК энргОперацияСПриборомУчетаМКДТочкиУчета
	|ГДЕ
	|	энргОперацияСПриборомУчетаМКДТочкиУчета.Ссылка В(&мДокументы)");	
КонецПроцедуры

Процедура ПолучитьТаблицуИзмерителей(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.Ссылка КАК Ссылка,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.IDСтроки КАК IDСтроки,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.IDСтрокиШкалы КАК IDСтрокиШкалы,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.ДатаВыпуска КАК ДатаВыпуска,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.НомерПломбы КАК НомерПломбы,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ИСТИНА КАК ВспомогательноеОборудование,
	|	NULL КАК КодАСКУЭ,
	|	NULL КАК СобственникАСКУЭ,
	|	NULL КАК ДатаИнтеграцииССистемой,
	|	NULL КАК СистемаУчетаЭлектроэнергии,
	|	NULL КАК ТипИзмерителя,
	|	NULL КАК ЗаводскойНомер,
	|	NULL КАК ДоступКПУ,
	|	NULL КАК ДатаУстановки,
	|	NULL КАК ДатаОчереднойПоверки,
	|	NULL КАК СобственникСИ,
	|	NULL КАК Фаза,
	|	NULL КАК Вывод,
	|	NULL КАК Ввод,
	|	NULL КАК БалансоваяПринадлежность
	|ПОМЕСТИТЬ ТаблицаИзмерителей
	|ИЗ
	|	Документ.энргОперацияСПриборомУчетаМКД.ПриборыУзловУчета КАК энргОперацияСПриборомУчетаМКДПриборыУзловУчета
	|ГДЕ
	|	энргОперацияСПриборомУчетаМКДПриборыУзловУчета.Ссылка В(&мДокументы)
	|	И НЕ &ИспользоватьУзлыМКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОперацияСПриборомУчетаМКДИзмерители.Ссылка,
	|	энргОперацияСПриборомУчетаМКДИзмерители.IDСтрокиТочкиУчета,
	|	энргОперацияСПриборомУчетаМКДИзмерители.IDСтроки,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ДатаВыпуска,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ДатаПоверкиСчетчика,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ДатаУстановкиПломбы,
	|	энргОперацияСПриборомУчетаМКДИзмерители.КонецДействияКоммерскогоУчета,
	|	энргОперацияСПриборомУчетаМКДИзмерители.КоэффициентПУ,
	|	энргОперацияСПриборомУчетаМКДИзмерители.НачалоДействияКоммерскогоУчета,
	|	энргОперацияСПриборомУчетаМКДИзмерители.НомерПломбы,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ПриборУчета,
	|	энргОперацияСПриборомУчетаМКДИзмерители.РасположениеИзмерителя,
	|	энргОперацияСПриборомУчетаМКДИзмерители.РегистрируетОбъем,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ТипПрибораУчета,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ВспомогательноеОборудование,
	|	энргОперацияСПриборомУчетаМКДИзмерители.КодАСКУЭ,
	|	энргОперацияСПриборомУчетаМКДИзмерители.СобственникАСКУЭ,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ДатаИнтеграцииССистемой,
	|	энргОперацияСПриборомУчетаМКДИзмерители.СистемаУчетаЭлектроэнергии,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ТипИзмерителя,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ЗаводскойНомер,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ДоступКПУ,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ДатаУстановки,
	|	энргОперацияСПриборомУчетаМКДИзмерители.ДатаОчереднойПоверки,
	|	энргОперацияСПриборомУчетаМКДИзмерители.СобственникСИ,
	|	энргОперацияСПриборомУчетаМКДИзмерители.Фаза,
	|	энргОперацияСПриборомУчетаМКДИзмерители.Вывод,
	|	энргОперацияСПриборомУчетаМКДИзмерители.Ввод,
	|	энргОперацияСПриборомУчетаМКДИзмерители.БалансоваяПринадлежность
	|ИЗ
	|	Документ.энргОперацияСПриборомУчетаМКД.Измерители КАК энргОперацияСПриборомУчетаМКДИзмерители
	|ГДЕ
	|	энргОперацияСПриборомУчетаМКДИзмерители.Ссылка В(&мДокументы)
	|	И &ИспользоватьУзлыМКД");	
	
КонецПроцедуры

Процедура ПолучитьТаблицуШкалыПриборовУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.Ссылка КАК Ссылка,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.IDСтрокиТарифнаяЗона КАК IDСтрокиТарифнаяЗона,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.Шкала КАК Шкала,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.ВидПараметра КАК ВидПараметра,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.ТипТемпературы КАК ТипТемпературы,
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.Вывод КАК Вывод
	|ПОМЕСТИТЬ ТаблицаШкалыПриборовУчета
	|ИЗ
	|	Документ.энргОперацияСПриборомУчетаМКД.ШкалыПриборовУчета КАК энргОперацияСПриборомУчетаМКДШкалыПриборовУчета
	|ГДЕ
	|	энргОперацияСПриборомУчетаМКДШкалыПриборовУчета.Ссылка В(&мДокументы)");	
КонецПроцедуры

#КонецОбласти

#Область ОсновныеПриборыУчета

Процедура ДобавитьТекстЗапросаПриборыТочекМКД(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыТочекМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеПриборовМКД(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеПриборовМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.МКД,
	|	табТочкиУчета.ТочкаУчета,
	|	табТочкиУчета.ПриборУчетаВывод,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод),
	|	Шапка.Дата,
	|	Шапка.ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (НЕ табТочкиУчета.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргВыводПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргВыводПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеУзлов.ПриборУчетаВывод КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|		ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (НЕ СостояниеУзлов.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргВидыДифференцированностиПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргВидыДифференцированностиПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК АбонентВладелец,
	|	Шапка.МКД КАК МКД,
	|	Шапка.МКД КАК КлючПомещения,
	|	СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|	КоллекцияШкалПриборовУчета.Шкала КАК Шкала,
	|	СостояниеУзлов.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА КоллекцияШкалПриборовУчета.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|		ИНАЧЕ КоллекцияШкалПриборовУчета.ВидДифференцированности
	|	КОНЕЦ КАК ВидДифференцированности
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК КоллекцияШкалПриборовУчета
	|			ПО СостояниеУзлов.Ссылка = КоллекцияШкалПриборовУчета.Ссылка
	|				И (КоллекцияШкалПриборовУчета.Ссылка В (&мДокументы))
	|				И СостояниеУзлов.IDСтроки = КоллекцияШкалПриборовУчета.IDСтрокиТочкиУчета
	|				И (СостояниеУзлов.Ссылка В (&мДокументы))
	|		ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргПоказанияПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргПоказанияПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВложенныйЗапрос.КС КАК КС,
	|	ВложенныйЗапрос.Переворот КАК Переворот,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.АбонентВладелец КАК АбонентВладелец,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.IDСтрокиТарифнаяЗона КАК IDСтрокиТарифнаяЗона,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.МКД КАК АбонентВладелец,
	|		Шапка.МКД КАК МКД,
	|		Шапка.МКД КАК КлючПомещения,
	|		СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|		СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|		ЛОЖЬ КАК КС,
	|		ЛОЖЬ КАК Переворот,
	|		КоллекцияШкалПриборовУчета.Шкала КАК Шкала,
	|		КоллекцияШкалПриборовУчета.IDСтроки КАК IDСтрокиТарифнаяЗона,
	|		СостояниеУзлов.Ссылка КАК Ссылка
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК КоллекцияШкалПриборовУчета
	|				ПО СостояниеУзлов.Ссылка = КоллекцияШкалПриборовУчета.Ссылка
	|					И (КоллекцияШкалПриборовУчета.Ссылка В (&мДокументы))
	|					И СостояниеУзлов.IDСтроки = КоллекцияШкалПриборовУчета.IDСтрокиТочкиУчета
	|					И (СостояниеУзлов.Ссылка В (&мДокументы))
	|			ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ))
	|				И (НЕ СостояниеУзлов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчетаМКД.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТарифнаяЗона = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка В (&мДокументы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний,
	|	ВложенныйЗапрос.КС,
	|	ВложенныйЗапрос.Переворот,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.АбонентВладелец,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.IDСтрокиТарифнаяЗона,
	|	ВложенныйЗапрос.Ссылка,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.МКД КАК АбонентВладелец,
	|		Шапка.МКД КАК МКД,
	|		Шапка.МКД КАК КлючПомещения,
	|		СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|		СостояниеУзлов.ПриборУчетаВывод КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|		ЛОЖЬ КАК КС,
	|		ЛОЖЬ КАК Переворот,
	|		КоллекцияШкалПриборовУчета.Шкала КАК Шкала,
	|		КоллекцияШкалПриборовУчета.IDСтроки КАК IDСтрокиТарифнаяЗона,
	|		СостояниеУзлов.Ссылка КАК Ссылка
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК КоллекцияШкалПриборовУчета
	|				ПО СостояниеУзлов.Ссылка = КоллекцияШкалПриборовУчета.Ссылка
	|					И (КоллекцияШкалПриборовУчета.Ссылка В (&мДокументы))
	|					И СостояниеУзлов.IDСтроки = КоллекцияШкалПриборовУчета.IDСтрокиТочкиУчета
	|					И (СостояниеУзлов.Ссылка В (&мДокументы))
	|			ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ))
	|				И (НЕ СостояниеУзлов.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчетаМКД.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТарифнаяЗона = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка В (&мДокументы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.СостояниеПоказаний,
	|	ВложенныйЗапрос.КС,
	|	ВложенныйЗапрос.Переворот,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.АбонентВладелец,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.IDСтрокиТарифнаяЗона,
	|	ВложенныйЗапрос.Ссылка,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.МКД КАК АбонентВладелец,
	|		Шапка.МКД КАК МКД,
	|		Шапка.МКД КАК КлючПомещения,
	|		СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|		СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|		ЛОЖЬ КАК КС,
	|		ЛОЖЬ КАК Переворот,
	|		КоллекцияШкалПриборовУчета.Шкала КАК Шкала,
	|		КоллекцияШкалПриборовУчета.IDСтроки КАК IDСтрокиТарифнаяЗона,
	|		СостояниеУзлов.Ссылка КАК Ссылка
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК КоллекцияШкалПриборовУчета
	|				ПО СостояниеУзлов.Ссылка = КоллекцияШкалПриборовУчета.Ссылка
	|					И (КоллекцияШкалПриборовУчета.Ссылка В (&мДокументы))
	|					И СостояниеУзлов.IDСтроки = КоллекцияШкалПриборовУчета.IDСтрокиТочкиУчета
	|					И (СостояниеУзлов.Ссылка В (&мДокументы))
	|			ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ))
	|				И (НЕ СостояниеУзлов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчетаМКД.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТарифнаяЗона = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка В (&мДокументы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний,
	|	ВложенныйЗапрос.КС,
	|	ВложенныйЗапрос.Переворот,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.АбонентВладелец,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.IDСтрокиТарифнаяЗона,
	|	ВложенныйЗапрос.Ссылка,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.МКД КАК АбонентВладелец,
	|		Шапка.МКД КАК МКД,
	|		Шапка.МКД КАК КлючПомещения,
	|		СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|		СостояниеУзлов.ПриборУчетаВывод КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|		ЛОЖЬ КАК КС,
	|		ЛОЖЬ КАК Переворот,
	|		КоллекцияШкалПриборовУчета.Шкала КАК Шкала,
	|		КоллекцияШкалПриборовУчета.IDСтроки КАК IDСтрокиТарифнаяЗона,
	|		СостояниеУзлов.Ссылка КАК Ссылка
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК КоллекцияШкалПриборовУчета
	|				ПО СостояниеУзлов.Ссылка = КоллекцияШкалПриборовУчета.Ссылка
	|					И (КоллекцияШкалПриборовУчета.Ссылка В (&мДокументы))
	|					И СостояниеУзлов.IDСтрокиВывод = КоллекцияШкалПриборовУчета.IDСтрокиТочкиУчета
	|					И (СостояниеУзлов.Ссылка В (&мДокументы))
	|			ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ))
	|				И (НЕ СостояниеУзлов.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчетаМКД.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТарифнаяЗона = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка В (&мДокументы))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргКоэффциентыПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргКоэффциентыПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	Шапка.МКД КАК КлючПомещения,
	|	СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|	СостояниеУзлов.Ссылка КАК Регистратор,
	|	СостояниеУзлов.КоэффициентПУ КАК Коэффициент
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|		ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (СостояниеУзлов.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|			И (НЕ СостояниеУзлов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргНомерПломбПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргНомерПломбПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Если НЕ энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда 
		Текст  	= 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Шапка.ДатаФактическогоСобытия
		|		ИНАЧЕ Шапка.Дата
		|	КОНЕЦ КАК Период,
		|	Шапка.Организация КАК Организация,
		|	Шапка.Район КАК Район,
		|	Шапка.Дата КАК ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
		|	Шапка.МКД КАК МКД,
		|	СостояниеУзлов.ПриборУчета КАК ПриборУчета,
		|	ИСТИНА КАК Состояние,
		|	СостояниеУзлов.НомерПломбы КАК НомерПломбы
		|ИЗ
		|	ШапкаДокумента КАК Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
		|		ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
		|			И (Шапка.Ссылка В (&мДокументы))
		|			И (СостояниеУзлов.Ссылка В (&мДокументы))
		|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
		|			И (НЕ СостояниеУзлов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
		
	Иначе		
		Текст  	= 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Период КАК Период,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Район КАК Район,
		|	ВложенныйЗапрос.МКД КАК МКД,
		|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
		|	таблицаНомераПломб.КлючСтроки КАК МестоУстановки,
		|	таблицаНомераПломб.НомерПломбы КАК НомерПломбы,
		|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
		|	ИСТИНА КАК Состояние,
		|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
		|	таблицаНомераПломб.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
		|	таблицаНомераПломб.ЛицоУстановившееПломбу КАК ЛицоУстановившееПломбу,
		|	таблицаНомераПломб.ВидПломбы КАК ВидПломбы
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА табШапка.ДатаФактическогоСобытия
		|			ИНАЧЕ табШапка.Дата
		|		КОНЕЦ КАК Период,
		|		табШапка.Организация КАК Организация,
		|		табШапка.Район КАК Район,
		|		табШапка.МКД КАК МКД,
		|		ИзмерителиУзла.ПриборУчета КАК ПриборУчета,
		|		табШапка.Дата КАК ПериодРегистрации,
		|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
		|		табШапка.Ссылка КАК Ссылка,
		|		ИзмерителиУзла.IDСтроки КАК IDСтроки
		|	ИЗ
		|		ШапкаДокумента КАК табШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчетаМКД.Измерители КАК ИзмерителиУзла
		|				ПО табТочкиУчета.Ссылка = ИзмерителиУзла.Ссылка
		|					И табТочкиУчета.IDСтроки = ИзмерителиУзла.IDСтрокиТочкиУчета
		|					И (ИзмерителиУзла.Ссылка В (&мДокументы))
		|					И (НЕ ИзмерителиУзла.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
		|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
		|				И (табШапка.Ссылка В (&мДокументы))
		|				И (табТочкиУчета.Ссылка В (&мДокументы))
		|				И (табШапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
		|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчетаМКД.НомераПломб КАК таблицаНомераПломб
		|		ПО ВложенныйЗапрос.Ссылка = таблицаНомераПломб.Ссылка
		|			И ВложенныйЗапрос.IDСтроки = таблицаНомераПломб.IDСтрокиИзмерителя
		|			И (таблицаНомераПломб.Ссылка В (&мДокументы))";
		
	КонецЕсли;
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргДатыПоверкиПрибораУчета(Схема, Регистры)
	
	ИмяРегистра = "энргДатыПоверкиПрибораУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	Шапка.МКД КАК КлючПомещения,
	|	КоллекцияТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	КоллекцияТочекУчета.ПриборУчета КАК ПриборУчета,
	|	КоллекцияТочекУчета.Ссылка КАК Регистратор,
	|	КоллекцияТочекУчета.ДатаПоверкиСчетчика КАК ДатаПоверки
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК КоллекцияТочекУчета
	|		ПО Шапка.Ссылка = КоллекцияТочекУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (КоллекцияТочекУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|			И (НЕ КоллекцияТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборыМОП(Схема, Регистры) 
	
	ИмяРегистра = "энргПриборыМОП"; 
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (табТочкиУчета.НазначениеПУ = ЗНАЧЕНИЕ(Перечисление.энргНазначениеПУ.МОП))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДопускПриборовУчетаККоммерческомуУчетуМКД(Схема, Регистры)
		
	ИмяРегистра = "энргДопускПриборовУчетаККоммерческомуУчетуМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПриборыУзловУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	ТаблицаПриборыУзловУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтроки
	|			И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыИзмерителей(Схема, Регистры)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("бестБиллингПроект") Тогда
		Возврат;
	КонецЕсли;
		
	ИмяРегистра = "бестПараметрыИзмерителей";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПриборУчета КАК Измеритель,
	|	ТаблицаШкал.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ВидПараметра КАК ВидПараметра,
	|	ВложенныйЗапрос.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	ЗНАЧЕНИЕ(Перечисление.бестТипыТемператур.ПустаяСсылка) КАК ТипТемпературы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|		ТаблицаПриборыУзловУчета.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	|		ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ТаблицаПриборыУзловУчета.IDСтроки КАК IDСтрокиШкалы,
	|		ЗНАЧЕНИЕ(Справочник.бестВидыПараметровИзмерителей.ПустаяСсылка) КАК ВидПараметра,
	|		ТаблицаПриборыУзловУчета.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|		ВложенныйЗапрос.Ссылка КАК Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА Шапка.ДатаФактическогоСобытия
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.МКД КАК МКД,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчета КАК УзелУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			Шапка.ПериодНачисления КАК ПериодНачисления,
	|			Шапка.Ссылка КАК Ссылка,
	|			табТочкиУчета.IDСтроки КАК IDСтроки
	|		ИЗ
	|			ШапкаДокумента КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|			ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтроки
	|				И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|				И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК ТаблицаШкал
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаШкал.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиШкалы = ТаблицаШкал.IDСтроки
	|			И (ТаблицаШкал.Ссылка В (&мДокументы))
	|			И (ТаблицаШкал.ВидПараметра <> ЗНАЧЕНИЕ(Справочник.бестВидыПараметровИзмерителей.ПустаяСсылка))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательноеОборудование

Процедура ДобавитьТекстЗапросаВспомогательноеОборудованиеУзловУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыУзловУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|	ТаблицаПриборыУзловУчета.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК УзелУчета,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтроки
	|			И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ ВложенныйЗапрос.УзелУчета = ТаблицаПриборыУзловУчета.ПриборУчета)
	|			И (ТаблицаПриборыУзловУчета.ВспомогательноеОборудование)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВспомогательногоОборудованияУзловУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеПриборовУзловУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|	ТаблицаПриборыУзловУчета.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК УзелУчета,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтроки
	|			И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ ВложенныйЗапрос.УзелУчета = ТаблицаПриборыУзловУчета.ПриборУчета)
	|			И (ТаблицаПриборыУзловУчета.ВспомогательноеОборудование)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
	
КонецПроцедуры

#КонецОбласти  

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема, ПараметрыСостоянияМКД, "СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргОперацияСПриборомУчетаМКД.Ссылка КАК Ссылка,
	|	энргОперацияСПриборомУчетаМКД.Организация КАК Организация,
	|	энргОперацияСПриборомУчетаМКД.Район КАК Район,
	|	энргОперацияСПриборомУчетаМКД.МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСПриборомУчетаМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСПриборомУчетаМКД.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСПриборомУчетаМКД.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргОперацияСПриборомУчетаМКД КАК энргОперацияСПриборомУчетаМКД
	|ГДЕ
	|	энргОперацияСПриборомУчетаМКД.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли