#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
		  	                    
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда
		ДанныеАбонента  		= Новый Структура("Район,Организация,Строение,Помещение,КлючПомещения,ЛицевойСчет,АдресОбъекта");			
		ДанныеАбонента.удалить("Абонент");
		энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент,ДанныеАбонента);
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ДанныеАбонента,"Район,Организация,КлючПомещения,ЛицевойСчет,АдресОбъекта,Строение,Помещение");
	КонецЕсли;

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(Объект);
		
		ЗаполнитьДанныеАбонентаСервер();

	иначе
		Объект.МКД 			= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.ЛицевойСчет 	="";
		Объект.АдресОбъекта ="";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент,Объект.Организация,Объект.Район,Объект.МКД,СтандартнаяОбработка);
КонецПроцедуры


#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ВыполнитьПерерасчет(Команда)
	
	Если Объект.КорректировкаПоказаний.Количество() = 0 Тогда
		Предупреждение("Заполните табличную часть ""Документ-основание""");
	Иначе
		ВыполнитьПерерасчетСервер();		
	КонецЕсли;  
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПерерасчетСервер()
	
	//НачПерНачисления 				= энргНачисления.ОпределитьНачальныйПериодПерерасчета(Объект.КорректировкаПоказаний.Выгрузить().ВыгрузитьКолонку("РегистраторПоказаний"),Истина);
	//
	//Объект.НачПериода 				= НачПерНачисления;
	//Объект.КонПериода 				= НачалоМесяца(Объект.ПериодНачисления-1);
	//
	//УстановитьПредсталениеПериода();	
	//энргНачисления.ДанныеПерерасчета(Объект.Район,Объект.МКД,Объект.Абонент,НачПерНачисления,Объект.ПериодНачисления,Объект);
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргВводНачальныхОстатков"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргОбходнойЛист"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПриходныйКассовыйОрдер"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПерерасчет"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.КорректировкаРегистров"));
	
	
	Текст  							="ВЫБРАТЬ МАКСИМУМ(ВложенныйЗапрос.ДатаФакт)КАК ДатаФакт  ИЗ (Выбрать Минимум(ВложенныйЗапрос.ДатаФактическогоСобытия) КАК ДатаФакт ИЗ (%%ТекстВложенногоЗапроса%%) КАК ВложенныйЗапрос ОБЪЕДИНИТЬ ВСЕ " +Символы.ПС + " ВЫБРАТЬ энргДатаНачалаВеденияУчета.Значение  ИЗ Константа.энргДатаНачалаВеденияУчета КАК энргДатаНачалаВеденияУчета ГДЕ энргДатаНачалаВеденияУчета.Значение > ДАТАВРЕМЯ(1, 1, 1)) КАК ВложенныйЗапрос";
	ТекстВложенногоЗапроса 			="";
	Шаблон 							="ВЫБРАТЬ Док.ДатаФактическогоСобытия ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	ШаблонИсключения 							="ВЫБРАТЬ Док.Дата ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	
	ВозможныеТипы 					= Метаданные.Документы.энргПерерасчет.ТабличныеЧасти.КорректировкаПоказаний.Реквизиты.РегистраторПоказаний.Тип.типы();
	ГлавСчетчик 					= 0; 
	для Каждого Тип из ВозможныеТипы цикл
		//Если Не ИсключаемыеТипы.Найти(Тип) = Неопределено ТОгда
		//	Продолжить;
		//КонецЕсли;
		МетадДок 					= Метаданные.НайтиПоТипу(Тип);
		ИмяДок  					= МетадДок.имя;
		Если ГлавСчетчик> 0 тогда	
				ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
			КонецЕсли;
			
			Если Не ИсключаемыеТипы.Найти(Тип) = Неопределено ТОгда

				ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + СтрЗаменить(ШаблонИсключения,"%%ИмяДокумента%%",ИмяДок);
				
			Иначе   // есть дата факт
				
				ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + СтрЗаменить(Шаблон,"%%ИмяДокумента%%",ИмяДок);
				
		КонецЕсли;

		ГлавСчетчик 			= ГлавСчетчик + 1;
	КонецЦикла;
	
	// ТекстВложенногоЗапроса 			= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ " +Символы.ПС + " ВЫБРАТЬ энргДатаНачалаВеденияУчета.Значение  ИЗ Константа.энргДатаНачалаВеденияУчета КАК энргДатаНачалаВеденияУчета ГДЕ энргДатаНачалаВеденияУчета.Значение > ДАТАВРЕМЯ(1, 1, 1)";
	
	Текст 							= СтрЗаменить(Текст,"%%ТекстВложенногоЗапроса%%",ТекстВложенногоЗапроса);
	Запрос 							= Новый Запрос;
	Запрос.Текст 					=Текст;
	Запрос.УстановитьПараметр("МассивСсылок",Объект.КорректировкаПоказаний.Выгрузить().ВыгрузитьКолонку("РегистраторПоказаний"));
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Выборка.Следующий();
	
	НачПерНачисления 				= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Выборка.ДатаФакт, Объект.Организация,Объект.Район);
	Объект.НачПериода 				= НачПерНачисления;
	Объект.КонПериода 				= НачалоМесяца(Объект.ПериодНачисления-1);
	УстановитьПредсталениеПериода();	
	энргНачисления.ДанныеПерерасчета(Объект.Организация, Объект.Район,Объект.МКД,Объект.Абонент,НачПерНачисления,Объект.ПериодНачисления,Объект,Объект.КорректировкаПоказаний.Выгрузить());

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборОснования(РезультатЗакрытия,ДополнительныеПараметры) 
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли; 	
	
	Если ТипЗнч(РезультатЗакрытия)<> Тип("Структура") тогда
		Возврат;
	КонецЕсли; 	
	
	// ищем строки в табличной части
	Регистратор  									= РезультатЗакрытия.Регистратор;
	
	// заполняем табличную часть с показаниями
	ДанныеВыбраннойСтроки  							= РезультатЗакрытия.ДанныеСтроки;
	ДанныеСтроки  									= Новый Структура("РегистраторПоказаний,ДатаПоказаний,ПриборУчета,ТарифнаяЗона,ПоказанияДо,ПереворотДо,СостояниеПоказанийДо");
	ДанныеСтроки.РегистраторПоказаний 				= Регистратор;
	ДанныеСтроки.ДатаПоказаний 						= ДанныеВыбраннойСтроки.Период;
	ДанныеСтроки.ПриборУчета 						= ДанныеВыбраннойСтроки.ПриборУчета;
	ДанныеСтроки.ТарифнаяЗона 						= ДанныеВыбраннойСтроки.ТарифнаяЗона;
	ДанныеСтроки.ПоказанияДо 						= ДанныеВыбраннойСтроки.Показание;
	ДанныеСтроки.ПереворотДо 						= ДанныеВыбраннойСтроки.Переворот;
	ДанныеСтроки.СостояниеПоказанийДо 				= ДанныеВыбраннойСтроки.СостояниеПоказаний;	
	
	Строки  										= Объект.КорректировкаПоказаний.НайтиСтроки(ДанныеСтроки);
	Если  Строки.количество() = 0 тогда 	
		СтрокаТЧ  									= Объект.КорректировкаПоказаний.Добавить();
	иначе
	    СтрокаТЧ									= Строки[0];		
	КонецЕсли; 	
	
	СтрокаТЧ.ПриборУчета 							= ДанныеСтроки.ПриборУчета;
	СтрокаТЧ.ПоказанияПосле 						= ДанныеСтроки.ПоказанияДо;
	СтрокаТЧ.ПереворотПосле 						= ДанныеСтроки.ПереворотДо;
	СтрокаТЧ.СостояниеПоказанийПосле 				= ДанныеСтроки.СостояниеПоказанийДо;
	ЗаполнитьЗначенияСвойств(СтрокаТЧ,ДанныеСтроки);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	//энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.МКД,Объект.Абонент);
КонецПроцедуры

&НаСервере
Процедура УстановитьПредсталениеПериода()
	ПредставлениеПериодаРасчета = Формат(Объект.НачПериода,"ДФ='ММММ гггг'") + " - " + Формат(Объект.КонПериода,"ДФ='ММММ гггг'");
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийРегистраторПоказанийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы  	= Новый Структура;
	Отбор  				= новый Структура("Абонент",Объект.Абонент);
	ПараметрыФормы.Вставить("Отбор",Отбор);
	ПараметрыФормы.Вставить("РежимВыбораФормы",Истина);
	ПараметрыФормы.Вставить("МножественныйВыборФормы",Истина);
	СтандартнаяОбработка = Ложь; 	
	ОткрытьФорму("РегистрСведений.энргПоказанияПриборовУчета.ФормаСписка",ПараметрыФормы,Элементы.КорректировкаПоказаний);
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	  КорректировкаПоказанийРегистраторПоказанийНачалоВыбора(Элемент, Неопределено, Ложь);
	  Отказ=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработатьВыборОснования(ВыбранноеЗначение,Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПоказанияПослеПриИзменении(Элемент)
	
	 УстановитьПереворот();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПереворот()
	
	ТекСтр=Элементы.КорректировкаПоказаний.ТекущиеДанные;
	ТекСтр.ПереворотПосле=?(ТекСтр.ПоказанияДо>ТекСтр.ПоказанияПосле и ТекСтр.СостояниеПоказанийПосле=ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты"),Истина,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийСостояниеПоказанийПослеПриИзменении(Элемент)
	УстановитьПереворот();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАбонентаСервер()
	
	ТаблицаТЧ 								= Объект.КорректировкаПоказаний.Выгрузить();
	Объект.КорректировкаПоказаний.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПоказанияПриборовУчетаСрезПоследних.Регистратор КАК РегистраторПоказаний,
		|	энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	энргПоказанияПриборовУчетаСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
		|	энргПоказанияПриборовУчетаСрезПоследних.Период КАК ДатаПоказаний,
		|	энргПоказанияПриборовУчетаСрезПоследних.Показание КАК ПоказанияДо,
		|	энргПоказанияПриборовУчетаСрезПоследних.СостояниеПоказаний КАК СостояниеПоказанийДо,
		|	энргПоказанияПриборовУчетаСрезПоследних.Переворот КАК ПереворотДо
		|ИЗ
		|	РегистрСведений.энргПоказанияПриборовУчета.СрезПоследних(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргПоказанияПриборовУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Запрос.УстановитьПараметр("МоментВремени", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка  								= РезультатЗапроса.выбрать();
	Пока Выборка.следующий() цикл
		СтрокаПриборов  					= Объект.КорректировкаПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриборов,Выборка); 		 
	КонецЦикла; 
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти