#Область События_Формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = ТекущаяДата();
	ЗаполнитьЗаголовкиКолонок();
	бестЛокализацияСервер.ПриСозданииНаСервере_бестРаботаСДолжникамиЮЛ(ЭтотОбъект);
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтапыПИР,"Договор", Справочники.энргДоговорыАбонентов.ПустаяСсылка());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗадачиМне,"ТекДата", ТекущаяДата());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЗадачиМне,"ТекПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ОбновитьДокументыКСогласованиюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Команды 

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачатьПИР(Команда)
	Если НЕ ЗначениеЗаполнено(СхемаДляНовыхЗадач) ИЛИ НЕ ЗначениеЗаполнено(НачальныйЭтап) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните схемы для новых задач.");
	Иначе
		Для каждого эл из Элементы.Должники.ВыделенныеСтроки Цикл
			ТекСтрока = Элементы.Должники.ДанныеСтроки(эл);
			ДанныеЗадачи = Новый Структура("Организация, Район, Схема, Договор, КатегорияДебитора, ОбщаяСуммаЗадолженности, ПериодЗадолженностиНачало, ПериодЗадолженностиКонец, ЗадачаЮЛ, Этап"
			,ТекСтрока.Организация, ТекСтрока.Район, СхемаДляНовыхЗадач, ТекСтрока.Договор 
			,ТекСтрока.КатегорияДебитора, ТекСтрока.ОбщаяСуммаЗадолженности, ТекСтрока.ДатаВозникновенияЗадолженности
			,Период, Истина, НачальныйЭтап);
			НачатьПИРНаСервере(ДанныеЗадачи);
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыКСогласованию(Команда)
	ОбновитьДокументыКСогласованиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьСобытие(Команда)
	ТекСтрока = Элементы.ДокументыКСогласованию.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		ПоказатьПредупреждение(, "Выберите событие, которое необходимо согласовать");
		Возврат;
	КонецЕсли;
	Если СобытиеСогласовано(ТекСтрока) Тогда 
		ПоказатьПредупреждение(, "Событие уже согласовано");
		Возврат;
	КонецЕсли;
	
	
	ДанныеДляЗаписи = Новый Структура("Организация,Район,ДокРегистратор");
	ЗаполнитьЗначенияСвойств(ДанныеДляЗаписи, ТекСтрока);	
	
	Результат 		= СогласоватьСобытиеНаСервере(ДанныеДляЗаписи);
	ПоказатьПредупреждение(, Результат);

КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработкуСобытие(Команда)
	ТекСтрока = Элементы.ДокументыКСогласованию.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		ПоказатьПредупреждение(, "Выберите событие, которое необходимо согласовать");
		Возврат;
	КонецЕсли; 	
	Если СобытиеСогласовано(ТекСтрока) Тогда 
		ПоказатьПредупреждение(, "Событие уже согласовано");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатЗапросаНаДоработку", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.энргСтатусСогласованияСобытий.Форма.ФормаВернутьНаДоработку",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура АктСверки(Команда)
	ТекДанные = Элементы.Должники.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Отчет.бестАктСверки.Форма.ФормаОтчета",Новый Структура("Организация, Район, Договор", Организация, ТекДанные.Район, ТекДанные.Договор),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ТекДанные = Элементы.Должники.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Договоры = Новый Массив;
	Для каждого эл из Элементы.Должники.ВыделенныеСтроки Цикл
		Договоры.Добавить(Новый Структура("Абонент", Элементы.Должники.ДанныеСтроки(эл).Договор));
	КонецЦикла;                                                         
	
	ОткрытьФорму("Документ.энргСобытие.ФормаОбъекта",Новый Структура("Организация, Район, Договоры, ТипСобытия", Организация, ТекДанные.Район, Договоры, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту")),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьОтборы(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("Группа3", Ложь);
	СтруктураНастроек.Вставить("РазвернутьОтборы", Истина);
	СтруктураНастроек.Вставить("СернутьОтборы", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьОтборы(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("Группа3", Истина);
	СтруктураНастроек.Вставить("РазвернутьОтборы", Ложь);
	СтруктураНастроек.Вставить("СернутьОтборы", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВидыЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа8", Ложь);
	СтруктураНастроек.Вставить("ДолжникиГруппа9", Ложь);
	СтруктураНастроек.Вставить("ДолжникиСвернутьВидыЗадолженности", Ложь);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьВидыЗадолженности", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВидыЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа8", Истина);
	СтруктураНастроек.Вставить("ДолжникиГруппа9", Истина);
	СтруктураНастроек.Вставить("ДолжникиСвернутьВидыЗадолженности", Истина);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьВидыЗадолженности", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьАвансовуюЗадолженность(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа10", Истина);
	СтруктураНастроек.Вставить("ДолжникиГруппа12", Истина);
	СтруктураНастроек.Вставить("ДолжникиСвернутьАвансовуюЗадолженность", Истина);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьАвансовуюЗадолженность", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСрокиЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа4", Истина);
	СтруктураНастроек.Вставить("ДолжникиГруппа5", Истина);
	СтруктураНастроек.Вставить("ДолжникиСвернутьСрокиЗадолженности", Истина);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьСрокиЗадолженности", Ложь);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьАвансовуюЗадолженность(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа10", Ложь);
	СтруктураНастроек.Вставить("ДолжникиГруппа12", Ложь);
	СтруктураНастроек.Вставить("ДолжникиСвернутьАвансовуюЗадолженность", Ложь);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьАвансовуюЗадолженность", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСрокиЗадолженности(Команда)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДолжникиГруппа4", Ложь);
	СтруктураНастроек.Вставить("ДолжникиГруппа5", Ложь);
	СтруктураНастроек.Вставить("ДолжникиСвернутьСрокиЗадолженности", Ложь);
	СтруктураНастроек.Вставить("ДолжникиРазвернутьСрокиЗадолженности", Истина);
	НастроитьВидимостьЭлементов(СтруктураНастроек);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьНаСервере()
	Должники.Очистить();
	МВТ = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.бестНастройкаПериодовЗадолженности.ПолучитьКатегорииЗадолженности(МВТ);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = Обработки.бестРаботаСДолжникамиЮЛ.ПолучитьТекстЗапросаДляЗаполнения();
		
	Если ЗначениеЗаполнено(Договор) Тогда
		Запрос.УстановитьПараметр("Договор", Договор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Ссылка = &Договор", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Район) Тогда
		Запрос.УстановитьПараметр("Район", Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "Истина");
	КонецЕсли;

	Если ЗначениеЗаполнено(Ответственный) Тогда
		Запрос.УстановитьПараметр("ОтветственныйЗаДоговор", Ответственный);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.ОтветственныйЗаДоговор = &ОтветственныйЗаДоговор", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		Запрос.УстановитьПараметр("Статус", Статус);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Статус = &Статус", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КатегорияДебитора) Тогда
		Запрос.УстановитьПараметр("КатегорияДебитора", КатегорияДебитора);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НастройкиКатегорийДебитора.КатегорияДебитора = &КатегорияДебитора", "Истина");
	КонецЕсли;

	Если ЗначениеЗаполнено(МинимальнаяСуммаЗадолженностиПени) Тогда
		Запрос.УстановитьПараметр("МинимальнаяСуммаЗадолженностиПени", МинимальнаяСуммаЗадолженностиПени);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Пеня.СуммаОстаток >= &МинимальнаяСуммаЗадолженностиПени", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МинимальнаяСуммаЗадолженности) Тогда
		Запрос.УстановитьПараметр("МинимальнаяСуммаЗадолженности", МинимальнаяСуммаЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МинимальнаяДатаИОбщаяСуммаЗадолженности.СуммаВсего >= &МинимальнаяСуммаЗадолженности", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоДнейЗадолженности) Тогда
		Запрос.УстановитьПараметр("КоличествоДнейЗадолженности", КоличествоДнейЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МинимальнаяДатаИОбщаяСуммаЗадолженности.КолвоДнейЗадолженностиМакс >= &КоличествоДнейЗадолженности", "Истина");
	КонецЕсли;
	
	Если НЕ ИмеетсяТекущаяЗадолженность Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ВТ_ТекущаяЗадолженность.Сумма, 0) > 0", "Истина");
	КонецЕсли;
	
	Если КолвоДнейДоОплатыА = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(СледующаяДатаОплаты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = &КолвоДнейДоОплатыА", "Истина");
	Иначе
		Запрос.УстановитьПараметр("КолвоДнейДоОплатыА", 				КолвоДнейДоОплатыА);
	КонецЕсли;
	
	Если КолвоДнейДоОплатыФ = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(СледующаяДатаОплаты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = &КолвоДнейДоОплатыФ", "Истина");
	Иначе
		Запрос.УстановитьПараметр("КолвоДнейДоОплатыФ", 				КолвоДнейДоОплатыФ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", 				Период);
	Запрос.УстановитьПараметр("НачалоПериода", 			НачалоМесяца(Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Должники.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		НовСтр.IDСтроки 		= Новый УникальныйИдентификатор;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовкиКолонок()
		
	РезультатЗапроса = РегистрыСведений.бестНастройкаПериодовЗадолженности.ПолучитьКатегорииЗадолженности();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.От = 0 Тогда
			ТекстЗаголовок = "Задолженность до " + Выборка.До + " дней";
		ИначеЕсли Выборка.До = 0 Тогда
			ТекстЗаголовок = "Задолженность более " + Выборка.От + " дней";
		Иначе
			ТекстЗаголовок = "Задолженность от " + Выборка.От + " до " + Выборка.До + " дней";
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Должники" + Выборка.КатегорияЗадолженности + "ЗадолженностьСумма", "Заголовок", ТекстЗаголовок);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НачатьПИРНаСервере(ДанныеЗадачи)
	Задачи.энргЗадачаПИД.СоздатьЗадачуПоДанным(ДанныеЗадачи);
КонецПроцедуры

&НаКлиенте
Процедура ДолжникиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Должники.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтапыПИР,"Договор", ПредопределенноеЗначение("Справочник.энргДоговорыАбонентов.ПустаяСсылка"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтапыПИР,"Договор", ТекДанные.Договор);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНачальныйЭтап(СхемаДляНовыхЗадач)
	Если СхемаДляНовыхЗадач.Этапы.Количество() > 0 Тогда
		Возврат СхемаДляНовыхЗадач.Этапы[0].Этап;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивДоступныхОпераций(СхемаДляНовыхЗадач)
	мОпераций = Новый Массив;
	Для каждого эл из СхемаДляНовыхЗадач.Этапы Цикл
		мОпераций.Добавить(эл.Этап);
	КонецЦикла;
	Возврат мОпераций;
КонецФункции

&НаКлиенте
Процедура НастроитьВидимостьЭлементов(СтруктураНастроек)
	Для каждого эл из СтруктураНастроек Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, эл.Ключ, "Видимость", эл.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы 

&НаКлиенте
Процедура СхемаДляНовыхЗадачПриИзменении(Элемент)
	НачальныйЭтап = ПолучитьНачальныйЭтап(СхемаДляНовыхЗадач);
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиМнеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		ПарамФормы = Новый Структура("Ключ", ВыбраннаяСтрока);
		ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачальныйЭтапНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ФормаВыбора 			= ПолучитьФорму("Справочник.энргВидыОперацийПИД.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список,"Ссылка", ПолучитьМассивДоступныхОпераций(СхемаДляНовыхЗадач), ВидСравненияКомпоновкиДанных.ВСписке);
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДолжникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ДолжникиОбщаяСуммаЗадолженности" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаЗадолженности",Новый Структура("Организация, Район, Договор, НачалоПериода", Организация, ТекДанные.Район, ТекДанные.Договор, ТекДанные.ДатаВозникновенияЗадолженности),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиСуммаПени" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаПени",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиРеструктуризированнаяЗадолженность" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаРеструктуризированнойЗадолженности",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиБезнадежнаяЗадолженность" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаБезнадежнойЗадолженности",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ДолжникиМораторнаяЗадолженность" Тогда
		ТекДанные = Элементы.Должники.ТекущиеДанные;
		ОткрытьФорму("Обработка.бестРаботаСДолжникамиЮЛ.Форма.РасшифровкаМораторнойЗадолженности",Новый Структура("Организация, Район, Договор, КонецПериода", Организация, ТекДанные.Район, ТекДанные.Договор, Период),ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПереносСФизиков 

&НаСервере
Процедура ОбновитьДокументыКСогласованиюНаСервере()
	ДокументыКСогласованию.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтатусСогласованияСобытийСрезПоследних.Организация КАК Организация,
		|	энргСтатусСогласованияСобытийСрезПоследних.Район КАК Район,
		|	энргСтатусСогласованияСобытийСрезПоследних.ДокРегистратор КАК ДокРегистратор,
		|	энргСтатусСогласованияСобытийСрезПоследних.Статус КАК Статус,
		|	энргСтатусСогласованияСобытийСрезПоследних.Исполнитель КАК Исполнитель,
		|	энргСтатусСогласованияСобытийСрезПоследних.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ СтатусыСобытий
		|ИЗ
		|	РегистрСведений.энргСтатусСогласованияСобытий.СрезПоследних(&Период, ) КАК энргСтатусСогласованияСобытийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
		|		ПО энргСтатусСогласованияСобытийСрезПоследних.ДокРегистратор = энргСобытиеАбоненты.Ссылка
		|ГДЕ
		|	энргСобытиеАбоненты.Абонент ССЫЛКА Справочник.энргДоговорыКонтрагентов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыСобытий.Организация КАК Организация,
		|	СтатусыСобытий.Район КАК Район,
		|	СтатусыСобытий.ДокРегистратор КАК ДокРегистратор,
		|	СтатусыСобытий.Статус КАК Статус,
		|	СтатусыСобытий.Комментарий КАК Комментарий
		|ИЗ
		|	СтатусыСобытий КАК СтатусыСобытий
		|ГДЕ
		|	СтатусыСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.энргСтатусыСогласованияСобытий.Согласовано)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусыСобытий.Организация,
		|	СтатусыСобытий.Район,
		|	СтатусыСобытий.ДокРегистратор,
		|	СтатусыСобытий.Статус,
		|	СтатусыСобытий.Комментарий
		|ИЗ
		|	СтатусыСобытий КАК СтатусыСобытий
		|ГДЕ
		|	НЕ СтатусыСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.энргСтатусыСогласованияСобытий.Согласовано)
		|	И СтатусыСобытий.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	Запрос.УстановитьПараметр("Исполнитель"	, Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НСтрока = ДокументыКСогласованию.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла; 	
КонецПроцедуры

&НаСервере
Функция СогласоватьСобытиеНаСервере(ДанныеДляЗаписи)
	ТекстУспеха				= "Статус успешно зарегистрирован";	
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= ДанныеДляЗаписи.Организация;
	ОписаниеОжидаемыхДанных.Район 			= ДанныеДляЗаписи.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= ДанныеДляЗаписи.ДокРегистратор;
	ОписаниеОжидаемыхДанных.Исполнитель 	= Пользователи.ТекущийПользователь();
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.Согласовано;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		ОбновитьДокументыКСогласованиюНаСервере();
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция СобытиеСогласовано(ТекСтрока)
	Возврат ТекСтрока.Статус = ПредопределенноеЗначение("Перечисление.энргСтатусыСогласованияСобытий.Согласовано");
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗапросаНаДоработку(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	          	
	ТекСтрока 				= Элементы.ДокументыКСогласованию.ТекущиеДанные;
	ДанныеДляЗаписи 		= Новый Структура("Организация,Район,ДокРегистратор");
	ЗаполнитьЗначенияСвойств(ДанныеДляЗаписи, ТекСтрока); 	
	РезультатСменыСтатуса 	= ВернутьНаДоработкуСобытиеНаСервере(ДанныеДляЗаписи, Результат);
	ПоказатьПредупреждение(, РезультатСменыСтатуса);
КонецПроцедуры

&НаСервере
Функция ВернутьНаДоработкуСобытиеНаСервере(ДанныеДляЗаписи, СтруктураОтвета)
	ТекстУспеха				= "Статус успешно зарегистрирован";	
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= ДанныеДляЗаписи.Организация;
	ОписаниеОжидаемыхДанных.Район 			= ДанныеДляЗаписи.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= ДанныеДляЗаписи.ДокРегистратор;
	ОписаниеОжидаемыхДанных.Исполнитель 	= СтруктураОтвета.Исполнитель;
	ОписаниеОжидаемыхДанных.Комментарий 	= СтруктураОтвета.Комментарий;
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.ТребуетДоработки;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		ОбновитьДокументыКСогласованиюНаСервере();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
