#Область ОписаниеПеременных

перем ВидЗадолженности Экспорт; // Вид задолженности оплаты услуги
перем ПериодНачисления Экспорт; // Период начисления услуги
перем Организация Экспорт; // Организация предоставляющая услуги
перем Район Экспорт; // Район, в котором оказывается услуга
перем МКД Экспорт; // Адресс МКД, по которому оказываются услуги
перем СписокМКД Экспорт; // Список адрессов МКД, по которым оказываются услуги
перем Абонент Экспорт; // Клиент, который пользуется услугой
перем ГраницыПериодаНачисления Экспорт; // Дата границы периода начисления
перем СначалаТекущиеНачисления Экспорт; // Параметр определяющий сначала текущие показания


перем РезультатЗапросаЗадолженности Экспорт; // Возвращает результат запроса задолжностей
перем ВыборкаЗадолженность Экспорт; // Выборка результата запроса задолжностей 

перем ДанныеЗадолженности Экспорт; // Данные, содержащие полный пакет информации касательно задолженности
перем РасшифровкаЗадолженностиВспомогательная Экспорт; // Таблица значений дополнительных данных задолженности  

перем РезультатЗапросаДанныеНачислений Экспорт; // Результат запроса данных начислений
перем ВыборкаДанныеНачислений Экспорт; // Выборка данных начислений

перем ДанныеНачислений Экспорт; // Дата начислений документа
перем РасшифровкаНачисленийВспомогательная Экспорт; // Таблица значений дополнительных данных начислений

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Инициализировать(МВТ) Экспорт 	
	
	ПараметрыЗапроса = СформироватьПараметрыЗапроса();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПараметрыВТ", СформироватьСписокОтборов());	 	
	
	РезультатЗапросаЗадолженности = РезультатЗапросаЗадолженностиНаГраницуСбитойПоследовательности(
		МВТ,
		ПараметрыЗапроса,
		ПараметрыОтбора);
		
	РезультатЗапросаДанныеНачислений = РезультатЗапросаДанныеДокументовСбитыхВПоследовательности(
		МВТ,
		ПараметрыЗапроса);	
		
	СоздатьТаблицыРасшифровок();	
	
КонецПроцедуры

Процедура ИнициализироватьВыборки() Экспорт 
	
	ВыборкаЗадолженность = РезультатЗапросаЗадолженности.Выбрать();
	ВыборкаЗадолженность.Следующий();
	
	ВыборкаДанныеНачислений = РезультатЗапросаДанныеНачислений.Выбрать();
	ВыборкаДанныеНачислений.Следующий();
	
КонецПроцедуры

Процедура СформироватьТаблицыДанныхЗадолженности(АбонентОбхода) Экспорт 
	ЗаполнитьТаблицуЗадолженностьНаГраницу(АбонентОбхода);
	ЗаполнитьТаблицуНачисленоВПериоде(АбонентОбхода);
КонецПроцедуры

#Область РеализацияИнтерфейса_РаспределениеДенежныхСредств

Процедура УвеличитьЗадолженностьАбонента(ПараметрыОперации, ДанныеДокумента) Экспорт 
	
	ДанныеНачисленияРегистратора = ДанныеНачислений[ДанныеДокумента.Регистратор];
	Если ДанныеНачисленияРегистратора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УвеличитьЗадолженность(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора);
	
КонецПроцедуры

Процедура РаспределитьОплатуАбонентаПоНазначению(ПараметрыОперации, Оплата, ДанныеДокумента) Экспорт 
	
	ОплатаДолга = Оплата[ВидЗадолженности];
	Если ОплатаДолга = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОплаты = ОплатаДолга[ДанныеДокумента.Регистратор];
	Если ДанныеОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаспределитьОплатуАбонентаПоНазначениюПлатежа(ПараметрыОперации, ДанныеОплаты, ДанныеДокумента);
	
КонецПроцедуры

Процедура РаспределитьОплатуАбонента(ПараметрыОперации, Оплата, ДанныеДокумента) Экспорт 
	
	Если ПараметрыОперации.ОсвободившиесяДеньги.Сумма <= 0 Тогда
		Возврат;		
	КонецЕсли;
	
	//ОплатаДолга = Оплата[ВидЗадолженности];
	//Если ОплатаДолга = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДанныеОплаты = ОплатаДолга[ДанныеДокумента.Регистратор];
	//Если ДанныеОплаты = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	ДанныеОплаты = Неопределено;
	РаспределитьОстатокОплатыАбонента(ПараметрыОперации, ДанныеОплаты, ДанныеДокумента);
	
КонецПроцедуры

Процедура РаспределитьПерерасчетСОплатой(ПараметрыОперации, Оплата, ДанныеДокумента) Экспорт
	
	Если ДанныеДокумента.ЭтоКорректировкаОплаты Тогда
		ДанныеНачисленияРегистратора = ДанныеНачислений[ДанныеДокумента.Регистратор];
		
		СторнироватьАвансыИОплату(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора);
		
		Если НЕ ДанныеНачисленияРегистратора = Неопределено Тогда
			УвеличитьЗадолженность(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора);			
		КонецЕсли;
	КонецЕсли;
		
	РаспределитьОплатуАбонентаПоНазначению(ПараметрыОперации, Оплата, ДанныеДокумента);	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерфейса_ПолучениеДанных

#Область ЗадолженностиНаГраницуСбитойПоследовательности

Функция РезультатЗапросаЗадолженностиНаГраницуСбитойПоследовательности(МВТ, ПараметрыЗапроса, ПараметрыОтбора)
	
	СхемаЗапроса = Новый СхемаЗапроса;
	
	ВспомогательныеТаблицы(СхемаЗапроса, ПараметрыОтбора);
	ОстаткиНаГраницу(СхемаЗапроса, ПараметрыОтбора);
	ОборотыЗаПериод(СхемаЗапроса, ПараметрыОтбора);
	СформироватьИтоговуюВыборку(СхемаЗапроса);
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПараметрыЗапроса, МВТ);
	Возврат РезультатЗапроса;	
	
КонецФункции

Процедура ВспомогательныеТаблицы(СхемаЗапроса, ПараметрыОтбора)
	
	ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КонецПериодаРасчета"));
	
	РегистрыСведений.энргСпособыРаспределенияОплаты.ЗаполнитьСхемуСпособыРаспределенияОплаты(СхемаЗапроса, ПараметрыОтбора, "СпособРаспределенияОплаты"); 
	РегистрыСведений.энргПорядокПогашенияЗадолженности.ЗаполнитьСхемуТекущееЗначениеПорядкаПогашенияУслуг(СхемаЗапроса, ПараметрыОтбора, "ПорядокПогашенияУслуг"); 
	РегистрыСведений.энргУслугиДляПогашенияТолькоДеньгами.УслугиДляПогашенияТолькоДеньгами(СхемаЗапроса, ПараметрыОтбора, "УслугиДляПогашенияТолькоДеньгами");
КонецПроцедуры

Процедура ОстаткиНаГраницу(СхемаЗапроса, ПараметрыОтбора)
	
	ПараметрыОтбора.Период = энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериодаРасчета");
	РегистрыНакопления.энргВзаиморасчетыПоМесяцам.ЗаполнитьСхемуЗадолженностьНаМоментВремени(СхемаЗапроса, ПараметрыОтбора, "ОстатокНачалоПериода");
	
	ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КонецПериодаРасчета"));
	РегистрыСведений.энргПросуженнаяЗадолженностьАбонентов.ПросуженнаяЗадолженностьЗаПериод(СхемаЗапроса, ПараметрыОтбора, "ПросуженнаяЗадолженностьНачалоПериода");
	
КонецПроцедуры 

Процедура ОборотыЗаПериод(СхемаЗапроса, ПараметрыОтбора)
	
	ПараметрыОтбора.Вставить("НачалоПериода", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериодаРасчета"));
	ПараметрыОтбора.Вставить("КонецПериода", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КонецПериодаРасчета"));
	РегистрыНакопления.энргВзаиморасчетыПоМесяцам.ЗаполнитьСхемуОборотыВзаиморасчетов(СхемаЗапроса, ПараметрыОтбора, "ВзаиморасчетыОбороты");	
	
КонецПроцедуры

Процедура СформироватьИтоговуюВыборку(СхемаЗапроса)
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(); 	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ПериодРасчета КАК ПериодРасчета,
	|	СУММА(ВложенныйЗапрос.ЗадолженностьНачалоПериода) КАК ЗадолженностьНачалоПериода,
	|	ВЫБОР
	|		КОГДА &СначалаТекущиеНачисления
	|				И ВложенныйЗапрос.ПериодРасчета = &ПериодНачисления
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокПериодРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособРаспределенияОплаты.СпособРаспределения, ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПропорцианальноЗадолженности)
	|			ТОГДА ЕСТЬNULL(ПорядокПогашенияУслуг.Порядок, 99999)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокПогашенияУслугиПриПропорциональномРаспределении,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособРаспределенияОплаты.СпособРаспределения, ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПоУслугамСогласноНастройкамРаспределения)
	|			ТОГДА ЕСТЬNULL(ПорядокПогашенияУслуг.Порядок, 99999)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокПогашенияУслуги,
	|	ВЫБОР
	|		КОГДА ПросуженнаяЗадолженностьНачалоПериода.Район ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокПросуженнойЗадолженности,
	|	ВЫБОР
	|		КОГДА УслугиДляПогашенияТолькоДеньгами.Услуга ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокУслугТолькоЖивымиДеньгами
	|ИЗ
	|	(ВЫБРАТЬ
	|		РазличныеАбоненты.ПериодНачисления КАК ПериодНачисления,
	|		РазличныеАбоненты.Район КАК Район,
	|		РазличныеАбоненты.МКД КАК МКД,
	|		РазличныеАбоненты.Абонент КАК Абонент,
	|		ЕСТЬNULL(ОстатокНачалоПериода.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|		ЕСТЬNULL(ОстатокНачалоПериода.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК Поставщик,
	|		ЕСТЬNULL(ОстатокНачалоПериода.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодРасчета,
	|		ЕСТЬNULL(ОстатокНачалоПериода.СуммаОстаток, 0) КАК ЗадолженностьНачалоПериода
	|	ИЗ
	|		РазличныеАбоненты КАК РазличныеАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ОстатокНачалоПериода КАК ОстатокНачалоПериода
	|			ПО РазличныеАбоненты.Район = ОстатокНачалоПериода.Район
	|				И РазличныеАбоненты.МКД = ОстатокНачалоПериода.МКД
	|				И РазличныеАбоненты.Абонент = ОстатокНачалоПериода.Абонент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.МКД,
	|		МинимумРегистратор.Абонент,
	|		ЕСТЬNULL(ВзаиморасчетыОбороты.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)),
	|		ЕСТЬNULL(ВзаиморасчетыОбороты.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)),
	|		ЕСТЬNULL(ВзаиморасчетыОбороты.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)),
	|		СУММА(ЕСТЬNULL(ВзаиморасчетыОбороты.СуммаОборот, 0))
	|	ИЗ
	|		МинимумРегистратор КАК МинимумРегистратор
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыОбороты КАК ВзаиморасчетыОбороты
	|			ПО (ВЫБОР
	|					КОГДА МинимумРегистратор.ДопПорядок = 10
	|						ТОГДА ИСТИНА
	|					КОГДА МинимумРегистратор.ДатаРегистратора > ВзаиморасчетыОбороты.Период
	|						ТОГДА ИСТИНА
	//|					КОГДА МинимумРегистратор.ДатаРегистратора = ВзаиморасчетыОбороты.Период
	//|						ТОГДА ВЫБОР
	//|								КОГДА МинимумРегистратор.ДопПорядок = 0
	//|										И ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.энргНачисление
	//|									ТОГДА ЛОЖЬ
	//|								КОГДА МинимумРегистратор.ДопПорядок = 10
	//|									ТОГДА ЛОЖЬ
	//|								ИНАЧЕ МинимумРегистратор.ДокРегистратор > ВзаиморасчетыОбороты.Регистратор
	//|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|				И МинимумРегистратор.Район = ВзаиморасчетыОбороты.Район
	|				И МинимумРегистратор.МКД = ВзаиморасчетыОбороты.МКД
	|				И МинимумРегистратор.Абонент = ВзаиморасчетыОбороты.Абонент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.МКД,
	|		МинимумРегистратор.Абонент,
	|		ВзаиморасчетыОбороты.Услуга,
	|		ВзаиморасчетыОбороты.Поставщик,
	|		ВзаиморасчетыОбороты.ПериодНачисления) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокПогашенияУслуг КАК ПорядокПогашенияУслуг
	|		ПО ВложенныйЗапрос.Услуга = ПорядокПогашенияУслуг.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособРаспределенияОплаты КАК СпособРаспределенияОплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПросуженнаяЗадолженностьНачалоПериода КАК ПросуженнаяЗадолженностьНачалоПериода
	|		ПО ВложенныйЗапрос.Район = ПросуженнаяЗадолженностьНачалоПериода.Район
	|			И ВложенныйЗапрос.МКД = ПросуженнаяЗадолженностьНачалоПериода.МКД
	|			И ВложенныйЗапрос.Абонент = ПросуженнаяЗадолженностьНачалоПериода.Абонент
	|			И ВложенныйЗапрос.Услуга = ПросуженнаяЗадолженностьНачалоПериода.Услуга
	|			И ВложенныйЗапрос.ПериодРасчета = ПросуженнаяЗадолженностьНачалоПериода.ПериодНачисления
	|			И ВложенныйЗапрос.Поставщик = ПросуженнаяЗадолженностьНачалоПериода.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиДляПогашенияТолькоДеньгами КАК УслугиДляПогашенияТолькоДеньгами
	|		ПО ВложенныйЗапрос.Услуга = УслугиДляПогашенияТолькоДеньгами.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.Поставщик,
	|	ВложенныйЗапрос.ПериодРасчета,
	|	ВЫБОР
	|		КОГДА &СначалаТекущиеНачисления
	|				И ВложенныйЗапрос.ПериодРасчета = &ПериодНачисления
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособРаспределенияОплаты.СпособРаспределения, ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПоУслугамСогласноНастройкамРаспределения)
	|			ТОГДА ЕСТЬNULL(ПорядокПогашенияУслуг.Порядок, 99999)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПросуженнаяЗадолженностьНачалоПериода.Район ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособРаспределенияОплаты.СпособРаспределения, ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПропорцианальноЗадолженности)
	|			ТОГДА ЕСТЬNULL(ПорядокПогашенияУслуг.Порядок, 99999)
	|		ИНАЧЕ 0
	|	КОНЕЦ ,
	|	ВЫБОР
	|		КОГДА УслугиДляПогашенияТолькоДеньгами.Услуга ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	Абонент,
	|	ПорядокПериодРасчета,
	|	ПорядокПросуженнойЗадолженности,
	|	ПорядокПогашенияУслугиПриПропорциональномРаспределении,
	|	ПериодРасчета,
	//|	ПорядокУслугТолькоЖивымиДеньгами,
	|	ПорядокПогашенияУслуги,
	|	Услуга");
	
КонецПроцедуры

#КонецОбласти

#Область ДанныеДокументовСбитыхВПоследовательности

Функция РезультатЗапросаДанныеДокументовСбитыхВПоследовательности(МВТ, ПараметрыЗапроса)
	
	Запрос = Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ТекстДанныеНачислений();		
	
	СписокПараметров  = Запрос.НайтиПараметры();
	Для Каждого ПараметрЗапроса Из СписокПараметров Цикл
		ЗначениеПараметра = ПараметрыЗапроса[ПараметрЗапроса.Имя];
		Запрос.УстановитьПараметр(ПараметрЗапроса.Имя, ЗначениеПараметра);
	КонецЦикла;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ТекстДанныеНачислений()
	Текст =
	//"ВЫБРАТЬ
	//|	ДокументыДляПроведения.Организация КАК Организация,
	//|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	//|	ДокументыДляПроведения.Район КАК Район,
	//|	ДокументыДляПроведения.МКД КАК МКД,
	//|	ДокументыДляПроведения.Абонент КАК Абонент,
	//|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	//|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	//|	ТаблицаКорректировкаОплаты.ДокументОплаты КАК ДокументОплаты,
	//|	ТаблицаКорректировкаОплаты.Разделитель КАК Разделитель
	//|ПОМЕСТИТЬ КорректировкаОплаты
	//|ИЗ
	//|	ДокументыДляПроведения КАК ДокументыДляПроведения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК ТаблицаКорректировкаОплаты
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	//|			ПО ТаблицаКорректировкаОплаты.Ссылка = энргПерерасчет.Ссылка
	//|				И (НЕ энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	//|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаКорректировкаОплаты.Ссылка
	//|			И ДокументыДляПроведения.Абонент = ТаблицаКорректировкаОплаты.АбонентБыло
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ДокументыДляПроведения.Организация,
	//|	ДокументыДляПроведения.ПериодНачисления,
	//|	ДокументыДляПроведения.Район,
	//|	ДокументыДляПроведения.МКД,
	//|	ДокументыДляПроведения.Абонент,
	//|	ДокументыДляПроведения.ДокРегистратор,
	//|	ДокументыДляПроведения.ДатаРегистратора,
	//|	ТаблицаКорректировкаОплаты.ДокументОплаты,
	//|	ТаблицаКорректировкаОплаты.Разделитель
	//|ИЗ
	//|	ДокументыДляПроведения КАК ДокументыДляПроведения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК ТаблицаКорректировкаОплаты
	//|			ПО энргПерерасчет.Ссылка = ТаблицаКорректировкаОплаты.Ссылка
	//|		ПО ДокументыДляПроведения.ДокРегистратор = энргПерерасчет.Ссылка
	//|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	//|			И ДокументыДляПроведения.Абонент = энргПерерасчет.Абонент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	ДокументыДляПроведения.Абонент КАК Абонент,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодРасчета
	|ПОМЕСТИТЬ ПерерасчетРаспределениеЗадолженностиШапка
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргПерерасчет.Ссылка
	|			И ДокументыДляПроведения.Абонент = энргПерерасчет.Абонент
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_РаспределениеЗадолженности))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПерерасчетРаспределениеЗадолженностиШапка.Организация КАК Организация,
	|	ПерерасчетРаспределениеЗадолженностиШапка.ПериодНачисления КАК ПериодНачисления,
	|	ПерерасчетРаспределениеЗадолженностиШапка.Район КАК Район,
	|	ПерерасчетРаспределениеЗадолженностиШапка.МКД КАК МКД,
	|	ПерерасчетРаспределениеЗадолженностиШапка.Абонент КАК Абонент,
	|	ПерерасчетРаспределениеЗадолженностиШапка.ДокРегистратор КАК ДокРегистратор,
	|	ПерерасчетРаспределениеЗадолженностиШапка.ДатаРегистратора КАК ДатаРегистратора,
	|	ПерерасчетРаспределениеЗадолженностиШапка.ПериодРасчета КАК ПериодРасчета,
	|	энргПерерасчетЗадолженностьБыла.Поставщик КАК Поставщик,
	|	энргПерерасчетЗадолженностьБыла.Услуга КАК Услуга,
	|	-энргПерерасчетЗадолженностьБыла.Задолженность КАК ЗадолженностьРасход,
	|	энргПерерасчетЗадолженностьБыла.ЗадолженностьНовая КАК ЗадолженностьПриход
	|ПОМЕСТИТЬ ПерерасчетРаспределениеЗадолженностиАбонентШапки
	|ИЗ
	|	ПерерасчетРаспределениеЗадолженностиШапка КАК ПерерасчетРаспределениеЗадолженностиШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.ЗадолженностьБыла КАК энргПерерасчетЗадолженностьБыла
	|		ПО ПерерасчетРаспределениеЗадолженностиШапка.ДокРегистратор = энргПерерасчетЗадолженностьБыла.Ссылка
	|			И (энргПерерасчетЗадолженностьБыла.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	энргПерерасчетРаспределениеЗадолженностиНовое.Абонент КАК Абонент,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодРасчета,
	|	энргПерерасчетРаспределениеЗадолженностиНовое.Поставщик КАК Поставщик,
	|	энргПерерасчетРаспределениеЗадолженностиНовое.Услуга КАК Услуга,
	|	энргПерерасчетРаспределениеЗадолженностиНовое.Задолженность КАК Задолженность
	|ПОМЕСТИТЬ ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.РаспределениеЗадолженностиНовое КАК энргПерерасчетРаспределениеЗадолженностиНовое
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргПерерасчетРаспределениеЗадолженностиНовое.Ссылка
	|			И (энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг))
	|			И ДокументыДляПроведения.Абонент = энргПерерасчетРаспределениеЗадолженностиНовое.Абонент
	|			И (энргПерерасчетРаспределениеЗадолженностиНовое.Задолженность > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	ДокументыДляПроведения.Абонент КАК Абонент,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособРаспределенияОплаты.ПерерасчетыВключатьВРасчетныйПериод, ЛОЖЬ)
	|			ТОГДА ДокументыДляПроведения.ПериодНачисления
	|		ИНАЧЕ энргОбъемНачислений.ПериодНачисления
	|	КОНЕЦ КАК ПериодРасчета,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	СУММА(энргОбъемНачислений.Сумма) КАК СуммаНачислений
	|ПОМЕСТИТЬ Начисления
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргОбъемНачислений.Регистратор
	|			И ДокументыДляПроведения.Район = энргОбъемНачислений.Район
	|			И ДокументыДляПроведения.Абонент = энргОбъемНачислений.Абонент
	|			И (энргОбъемНачислений.Сумма <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособРаспределенияОплаты КАК СпособРаспределенияОплаты
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыДляПроведения.ДокРегистратор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособРаспределенияОплаты.ПерерасчетыВключатьВРасчетныйПериод, ЛОЖЬ)
	|			ТОГДА ДокументыДляПроведения.ПериодНачисления
	|		ИНАЧЕ энргОбъемНачислений.ПериодНачисления
	|	КОНЕЦ,
	|	энргОбъемНачислений.Поставщик,
	|	энргОбъемНачислений.Услуга,
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.Абонент,
	|	ДокументыДляПроведения.Район,
	|	ДокументыДляПроведения.МКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаОплаты.ПериодНачисления,
	|	КорректировкаОплаты.Район,
	|	КорректировкаОплаты.МКД,
	|	КорректировкаОплаты.Абонент,
	|	КорректировкаОплаты.ДокРегистратор,
	|	энргВзаиморасчетыПоМесяцам.ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцам.Поставщик,
	|	энргВзаиморасчетыПоМесяцам.Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА КорректировкаОплаты.ДокументОплаты ССЫЛКА Документ.энргПерерасчет
	|					И энргВзаиморасчетыПоМесяцам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА 0
	|			ИНАЧЕ энргВзаиморасчетыПоМесяцам.Сумма
	|		КОНЕЦ)
	|ИЗ
	|	КорректировкаОплаты КАК КорректировкаОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
	|		ПО КорректировкаОплаты.ДокументОплаты = энргВзаиморасчетыПоМесяцам.Регистратор
	|			И КорректировкаОплаты.Абонент = энргВзаиморасчетыПоМесяцам.Абонент
	|			И КорректировкаОплаты.Разделитель = энргВзаиморасчетыПоМесяцам.Разделитель
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаОплаты.ПериодНачисления,
	|	КорректировкаОплаты.Район,
	|	КорректировкаОплаты.МКД,
	|	КорректировкаОплаты.Абонент,
	|	КорректировкаОплаты.ДокРегистратор,
	|	энргВзаиморасчетыПоМесяцам.ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцам.Поставщик,
	|	энргВзаиморасчетыПоМесяцам.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаОплаты.ПериодНачисления,
	|	КорректировкаОплаты.Район,
	|	КорректировкаОплаты.МКД,
	|	КорректировкаОплаты.Абонент,
	|	КорректировкаОплаты.ДокРегистратор,
	|	энргАвансыИспользованные.ПериодРасчета,
	|	энргАвансыИспользованные.Поставщик,
	|	энргАвансыИспользованные.Услуга,
	|	СУММА(энргАвансыИспользованные.Сумма)
	|ИЗ
	|	КорректировкаОплаты КАК КорректировкаОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргАвансыИспользованные КАК энргАвансыИспользованные
	|		ПО КорректировкаОплаты.Организация = энргАвансыИспользованные.Организация
	|			И КорректировкаОплаты.Район = энргАвансыИспользованные.Район
	|			И КорректировкаОплаты.МКД = энргАвансыИспользованные.МКД
	|			И КорректировкаОплаты.Абонент = энргАвансыИспользованные.Абонент
	|			И КорректировкаОплаты.ДокументОплаты = энргАвансыИспользованные.ДокументОплаты
	|			И КорректировкаОплаты.Разделитель = энргАвансыИспользованные.Разделитель
	|			И КорректировкаОплаты.ДатаРегистратора >= энргАвансыИспользованные.Период
	|			И (энргАвансыИспользованные.Сумма > 0)
	|			И (НЕ энргАвансыИспользованные.Регистратор ССЫЛКА Документ.энргНачислениеПени)
	|			И (НЕ энргАвансыИспользованные.Регистратор ССЫЛКА Документ.энргРучноеИзменениеПени)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаОплаты.ПериодНачисления,
	|	КорректировкаОплаты.Район,
	|	КорректировкаОплаты.МКД,
	|	КорректировкаОплаты.Абонент,
	|	КорректировкаОплаты.ДокРегистратор,
	|	энргАвансыИспользованные.ПериодРасчета,
	|	энргАвансыИспользованные.Поставщик,
	|	энргАвансыИспользованные.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодНачисления,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Район,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.МКД,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Абонент,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ДокРегистратор,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодРасчета,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Поставщик,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Услуга,
	|	СУММА(ПерерасчетРаспределениеЗадолженностиАбонентШапки.ЗадолженностьРасход)
	|ИЗ
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки КАК ПерерасчетРаспределениеЗадолженностиАбонентШапки
	|ГДЕ
	|	НЕ ПерерасчетРаспределениеЗадолженностиАбонентШапки.ЗадолженностьРасход = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Район,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Абонент,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодРасчета,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ДокРегистратор,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодНачисления,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Поставщик,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.МКД,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодНачисления,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Район,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.МКД,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Абонент,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ДокРегистратор,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодРасчета,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Поставщик,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Услуга,
	|	СУММА(ПерерасчетРаспределениеЗадолженностиАбонентШапки.ЗадолженностьПриход)
	|ИЗ
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки КАК ПерерасчетРаспределениеЗадолженностиАбонентШапки
	|ГДЕ
	|	НЕ ПерерасчетРаспределениеЗадолженностиАбонентШапки.ЗадолженностьПриход = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Район,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Абонент,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодРасчета,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ДокРегистратор,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.ПериодНачисления,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Поставщик,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.МКД,
	|	ПерерасчетРаспределениеЗадолженностиАбонентШапки.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.ПериодНачисления,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Район,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.МКД,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Абонент,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.ДокРегистратор,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.ПериодРасчета,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Поставщик,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Услуга,
	|	СУММА(ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Задолженность)
	|ИЗ
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы КАК ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы
	|
	|СГРУППИРОВАТЬ ПО
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Район,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Абонент,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.ПериодРасчета,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.ДокРегистратор,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.ПериодНачисления,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Поставщик,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.МКД,
	|	ПерерасчетРаспределениеЗадолженностиАбонентыТаблицы.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.ПериодНачисления КАК ПериодНачисления,
	|	Начисления.Район КАК Район,
	|	Начисления.МКД КАК МКД,
	|	Начисления.Абонент КАК Абонент,
	|	Начисления.ДокРегистратор КАК ДокРегистратор,
	|	Начисления.ПериодРасчета КАК ПериодРасчета,
	|	Начисления.Поставщик КАК Поставщик,
	|	Начисления.Услуга КАК Услуга,
	|	Начисления.СуммаНачислений КАК СуммаНачислений,
	|	ВЫБОР
	|		КОГДА &СначалаТекущиеНачисления
	|				И Начисления.ПериодРасчета = Начисления.ПериодНачисления
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокПериодРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпособРаспределенияОплаты.СпособРаспределения, ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОплаты.ПоУслугамСогласноНастройкамРаспределения)
	|			ТОГДА ЕСТЬNULL(ПорядокПогашенияУслуг.Порядок, 99999)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокПогашенияУслуги,
	|	ВЫБОР
	|		КОГДА УслугиДляПогашенияТолькоДеньгами.Услуга ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокУслугТолькоЖивымиДеньгами

	|ИЗ
	|	Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокПогашенияУслуг КАК ПорядокПогашенияУслуг
	|		ПО Начисления.Услуга = ПорядокПогашенияУслуг.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособРаспределенияОплаты КАК СпособРаспределенияОплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиДляПогашенияТолькоДеньгами КАК УслугиДляПогашенияТолькоДеньгами
	|		ПО Начисления.Услуга = УслугиДляПогашенияТолькоДеньгами.Услуга 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начисления.ПериодНачисления,
	|	Начисления.Район,
	|	Начисления.МКД,
	|	Начисления.Абонент,
	|	Начисления.ДокРегистратор,
	|	ПорядокУслугТолькоЖивымиДеньгами,
	|	Начисления.Услуга";	
	
	Возврат Текст;
	                  
КонецФункции
	
#КонецОбласти

#Область РаботаСОтборами

Функция СформироватьСписокОтборов()
	
	Результат 		= Новый Массив;
	ОсновнойОтбор 	= Новый Структура("Организация,Район,ПросуженнаяБлокированная", "Организация", "Район", "ПросуженнаяБлокированная");
	Результат.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(ОсновнойОтбор));
	
	Если НЕ МКД = Неопределено Тогда 
		Отбор = Новый Структура("МКД", "МКД");
		Результат.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Отбор));
	КонецЕсли;
	
	Если НЕ СписокМКД = Неопределено Тогда 
		Отбор = Новый Структура("МКД", "СписокМКД");
		Результат.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Отбор));
	КонецЕсли;
	
	Если НЕ Абонент = Неопределено Тогда 
		Отбор = Новый Структура("Абонент", "Абонент");
		Результат.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Отбор));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьПараметрыЗапроса()
	
	Результат = Новый Структура;
	Результат.Вставить("ПериодНачисления"			, ПериодНачисления);
	Результат.Вставить("Организация"				, Организация);
	Результат.Вставить("Район"						, Район);
	Результат.Вставить("НачалоПериодаРасчета"		, ГраницыПериодаНачисления.НачалоПериодаРасчета);
	Результат.Вставить("КонецПериодаРасчета"		, ГраницыПериодаНачисления.КонецПериодаРасчета);
	Результат.Вставить("СначалаТекущиеНачисления"	, СначалаТекущиеНачисления);	
	Результат.Вставить("ПросуженнаяБлокированная"	, Истина);
	
	Если НЕ МКД = Неопределено Тогда 
		Результат.Вставить("МКД", МКД);
	КонецЕсли;
	
	Если НЕ СписокМКД = Неопределено Тогда 
		Результат.Вставить("СписокМКД", СписокМКД);
	КонецЕсли;
	
	Если НЕ Абонент = Неопределено Тогда 
		Результат.Вставить("Абонент", Абонент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область РеализацияИнтерфейса_РаспределениеДенежныхСредств

#Область УвеличениеЗадолженности

Процедура УвеличитьЗадолженность(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора)
				
	Если НЕ ДанныеДокумента.ЭтоКорректировкаОплаты И ПараметрыОперации.СуммаАванса > 0 тогда
		УменьшитьАванс(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора);
	КонецЕсли;
	
	РасшифровкаЗадолженности = ДанныеЗадолженности.Расшифровка;
	ТаблицаВзаиморасчеты 	 = ДанныеДокумента.НаборТаблиц.энргВзаиморасчетыПоМесяцам;
		
	РасшифровкаНачислений 	 = ДанныеНачисленияРегистратора.Расшифровка;	
	РасшифровкаНачислений.Сортировать("СуммаНачислений,ПериодРасчета");
	
	БылиИзменения = Ложь;
	// сначала отрицательные строки записываем в аванс
	для Каждого СтрокаНачисления из РасшифровкаНачислений цикл
		
		Если СтрокаНачисления.СуммаНачислений = 0 ИЛИ (ДанныеДокумента.ЭтоКорректировкаОплаты И СтрокаНачисления.ПериодРасчета > ПараметрыОперации.ПериодНачисления) тогда
			Продолжить;
		ИначеЕсли  СтрокаНачисления.СуммаНачислений < 0 тогда
			
			ОтрицательнаяСуммаНачислений(
				ПараметрыОперации,
				ДанныеДокумента, 
				-СтрокаНачисления.СуммаНачислений, 
				СтрокаНачисления.Услуга, 
				СтрокаНачисления.Поставщик, 
				СтрокаНачисления.ПериодРасчета);
				
			БылиИзменения = Истина;
			СтрокаНачисления.СуммаНачислений = 0;
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Если отрицательные строки дали аванс, то закрываем им положительнве строки из этого же документа
	Если ПараметрыОперации.СуммаАванса > 0 тогда
	//Если НЕ ДанныеДокумента.ЭтоКорректировкаОплаты И ПараметрыОперации.СуммаАванса > 0 тогда
		УменьшитьАванс(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора);
	КонецЕсли;
	
	
	
	для Каждого СтрокаНачисления из РасшифровкаНачислений цикл
		
		Если СтрокаНачисления.СуммаНачислений = 0 ИЛИ (ДанныеДокумента.ЭтоКорректировкаОплаты И СтрокаНачисления.ПериодРасчета > ПараметрыОперации.ПериодНачисления) тогда
			Продолжить;
		ИначеЕсли СтрокаНачисления.СуммаНачислений < 0 тогда
			
			ОтрицательнаяСуммаНачислений(
				ПараметрыОперации, 
				ДанныеДокумента, 
				-СтрокаНачисления.СуммаНачислений, 
				СтрокаНачисления.Услуга, 
				СтрокаНачисления.Поставщик, 
				СтрокаНачисления.ПериодРасчета);
				
			СтрокаНачисления.СуммаНачислений = 0;
			Продолжить;
			
		КонецЕсли;
		
		БылиИзменения 									= Истина;
		
		СтрокаЗадолженности  							= РасшифровкаЗадолженности.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗадолженности, СтрокаНачисления);
		СтрокаЗадолженности.СуммаЗадолженности			= СтрокаНачисления.СуммаНачислений;
				
		СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчеты.Добавить();
		СтрокаВзаиморасчеты.Организация					= ПараметрыОперации.Организация;
		СтрокаВзаиморасчеты.ПериодРегистрации			= ПараметрыОперации.ПериодНачисления;		
		СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
		СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Приход;
		СтрокаВзаиморасчеты.Активность					= Истина;
		СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;
		СтрокаВзаиморасчеты.МКД 						= ДанныеДокумента.МКД;
		СтрокаВзаиморасчеты.Абонент 					= ДанныеДокумента.Абонент; 		
		СтрокаВзаиморасчеты.Услуга 						= СтрокаНачисления.Услуга;
		СтрокаВзаиморасчеты.Поставщик 					= СтрокаНачисления.Поставщик;
		СтрокаВзаиморасчеты.Сумма 						= СтрокаНачисления.СуммаНачислений;
		СтрокаВзаиморасчеты.ПериодНачисления			= СтрокаНачисления.ПериодРасчета;
		СтрокаВзаиморасчеты.Разделитель 				= ДанныеДокумента.Разделитель;
	КонецЦикла; 
	
	Если БылиИзменения Тогда
		РасшифровкаЗадолженности.Свернуть("ПериодРасчета,ПорядокПериодРасчета,ПорядокПогашенияУслуги,ПорядокПросуженнойЗадолженности,ПорядокПогашенияУслугиПриПропорциональномРаспределении,Поставщик,Услуга", "СуммаЗадолженности");
		РасшифровкаЗадолженности.Сортировать("ПорядокПериодРасчета,ПорядокПросуженнойЗадолженности,ПорядокПогашенияУслугиПриПропорциональномРаспределении,ПериодРасчета,ПорядокПогашенияУслуги,Услуга");
		ДанныеЗадолженности.СуммаЗадолженности = РасшифровкаЗадолженности.Итог("СуммаЗадолженности");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтрицательнаяСуммаНачислений(ПараметрыОперации, ДанныеДокумента, Сумма, Услуга, Поставщик, ПериодРасчета)

	ПараметрыОперации.вставить("СнятьТекущие",Истина);
	ПараметрыОперации.вставить("ВозвратАванса",Новый Структура("Услуга,Поставщик,ПериодРасчета", Услуга, Поставщик, ПериодРасчета));
	
	Если НЕ ПараметрыОперации.ОтрицательныеНачисленияСоздаютАвансы Или ПараметрыОперации.ЭтоНачислениеТекущегоМесяца Тогда
		// Списываем задолженность по услуге за текущий период.
		СписатьЗадолженность(ПараметрыОперации, ДанныеДокумента, Сумма, Услуга, Поставщик, ПериодРасчета);
		// Списываем задолженность по другим услугам за текущий период.
		СписатьЗадолженность(ПараметрыОперации, ДанныеДокумента, Сумма, Неопределено, Поставщик, ПериодРасчета);	
	КонецЕсли;	
	// Списываем пропорционально и записываем в аванс если что то останется.
	СписатьЗадолженность(ПараметрыОперации, ДанныеДокумента, Сумма);
	
	Если Сумма > 0 Тогда
		ПараметрыОперации.СуммаАванса = ПараметрыОперации.СуммаАванса + Сумма;
		Если ДанныеДокумента.ЭтоОплата Тогда
			ПараметрыОперации.СуммаАвансаЖивымиДеньгами = ПараметрыОперации.СуммаАвансаЖивымиДеньгами + Сумма;
	    КонецЕсли;
		УвеличитьАванс(ПараметрыОперации, ДанныеДокумента, Сумма, ДанныеДокумента.ЭтоОплата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УменьшениеЗадолженности

Процедура СписатьЗадолженность(ПараметрыОперации, ДанныеДокумента, Сумма, Услуга = Неопределено, Поставщик = Неопределено, ПериодНачисления  = Неопределено)
	
	Если Сумма <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Услуга = Неопределено И ЗначениеЗаполнено(Услуга) Тогда
		яУслуга = Услуга;
	КонецЕсли;
	
	Если НЕ ПериодНачисления = Неопределено И ЗначениеЗаполнено(ПериодНачисления) Тогда
		яПериодРасчета = ПериодНачисления;
	КонецЕсли;
	
	Если НЕ Поставщик = Неопределено И ЗначениеЗаполнено(Поставщик) Тогда
		яПоставщик = Поставщик;
	КонецЕсли;
	
	Если НЕ яУслуга = Неопределено ИЛИ НЕ яПериодРасчета = Неопределено ИЛИ НЕ яПоставщик = Неопределено Тогда
		СписатьЗадолженностьПоУслуге(ПараметрыОперации, ДанныеДокумента, Сумма, яУслуга, яПоставщик, яПериодРасчета);	
	иначеЕсли ПараметрыОперации.СпособРаспределенияОплаты = Перечисления.энргСпособыРаспределенияОплаты.ПоУслугамСогласноНастройкамРаспределения тогда
		СписатьЗадолженностьСогласноНастройкиРаспределения(ПараметрыОперации, ДанныеДокумента, Сумма);
	иначе
		СписатьЗадолженностьПропорциональноЗадолженности(ПараметрыОперации, ДанныеДокумента, Сумма);
	КонецЕсли;
	
КонецПроцедуры 

Процедура СписатьЗадолженностьПоУслуге(ПараметрыОперации, ДанныеДокумента, НадоСписать, Услуга, Поставщик, ПериодРасчета)
	перем яПериодРасчета, яУслуга, яПоставщик;
	
	УслугиДляПогашенияТолькоДеньгами			= ПараметрыОперации.УслугиДляПогашенияТолькоДеньгами;
	РасшифровкаЗадолженности 	= ДанныеЗадолженности.Расшифровка;		
	
	ТаблицаВзаиморасчеты 		= ДанныеДокумента.НаборТаблиц.энргВзаиморасчетыПоМесяцам;
	ЭтоОплата 					= Истина;
	СнятьТекущие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОперации, "СнятьТекущие", Ложь);
	Если СнятьТекущие Тогда
		ЭтоОплата = Ложь;
	КонецЕсли;
	
	ТаблицаОплатаУслуг = Неопределено;
	Если ЭтоОплата Тогда
		ТаблицаОплатаУслуг = ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
	КонецЕсли;
	
	Если НЕ ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("Услуга,ПериодРасчета,Поставщик");
		СтруктураПоиска.Услуга 					= Услуга;
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли НЕ ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("ПериодРасчета,Услуга");
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		СтруктураПоиска.Услуга 					= Услуга;
		
	ИначеЕсли НЕ ПериодРасчета = Неопределено И Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда 
		
		СтруктураПоиска  						= Новый Структура("ПериодРасчета,Поставщик");
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда 
		
		СтруктураПоиска  						= Новый Структура("Услуга,Поставщик");
		СтруктураПоиска.Услуга 					= Услуга;
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли НЕ ПериодРасчета = Неопределено И Услуга = Неопределено И Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("ПериодРасчета");
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		
	ИначеЕсли ПериодРасчета = Неопределено И Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("Поставщик");
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("Услуга");
		СтруктураПоиска.Услуга 					= Услуга;	
		
	Иначе
		ВызватьИсключение "Что то пошло не так";		
	КонецЕсли;
	
	СтрокиЗадолженности = РасшифровкаЗадолженности.НайтиСтроки(СтруктураПоиска); 	
	МассивУдаляемых 	= Новый Массив;
	
	для Каждого СтрокаЗадолженности из СтрокиЗадолженности цикл
		Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Найти(СтрокаЗадолженности.Услуга) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Списываем 								= Мин(НадоСписать, СтрокаЗадолженности.СуммаЗадолженности);
		
		// Уменьшаем задолженность по месяцам.
		СтрокаВзаиморасчеты 					= ТаблицаВзаиморасчеты.Добавить();		
		СтрокаВзаиморасчеты.Активность	 		= Истина;
		СтрокаВзаиморасчеты.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		СтрокаВзаиморасчеты.Организация 		= ПараметрыОперации.Организация;
		СтрокаВзаиморасчеты.Район		 		= ПараметрыОперации.Район;
		СтрокаВзаиморасчеты.ПериодРегистрации	= ПараметрыОперации.ПериодНачисления;
		СтрокаВзаиморасчеты.МКД			 		= ДанныеДокумента.МКД;
		СтрокаВзаиморасчеты.Абонент				= ДанныеДокумента.Абонент;
		СтрокаВзаиморасчеты.Период	 			= ДанныеДокумента.период;
		СтрокаВзаиморасчеты.Услуга				= СтрокаЗадолженности.Услуга;
		СтрокаВзаиморасчеты.Поставщик			= СтрокаЗадолженности.Поставщик;
		СтрокаВзаиморасчеты.ПериодНачисления	= СтрокаЗадолженности.ПериодРасчета;
		СтрокаВзаиморасчеты.Сумма				= Списываем; 		
		
		Если ЭтоОплата Тогда
			СтрокаОплатаУслуг 						= ТаблицаОплатаУслуг.Добавить();
			СтрокаОплатаУслуг.Активность	 		= Истина;
			СтрокаОплатаУслуг.Организация 			= ПараметрыОперации.Организация;
			СтрокаОплатаУслуг.Район		 			= ПараметрыОперации.Район;
			СтрокаОплатаУслуг.МКД			 		= ДанныеДокумента.МКД;
			СтрокаОплатаУслуг.Абонент				= ДанныеДокумента.Абонент;
			СтрокаОплатаУслуг.Период	 			= ДанныеДокумента.период;
			СтрокаОплатаУслуг.ИсточникПоступления	= ДанныеДокумента.ИсточникПоступления;
			СтрокаОплатаУслуг.Кассир				= ДанныеДокумента.Кассир;
			СтрокаОплатаУслуг.Услуга				= СтрокаЗадолженности.Услуга;
			СтрокаОплатаУслуг.Поставщик				= СтрокаЗадолженности.Поставщик;
			СтрокаОплатаУслуг.ПериодНачисления		= СтрокаЗадолженности.ПериодРасчета;
			СтрокаОплатаУслуг.ПериодРасчета			= ПараметрыОперации.ПериодНачисления;
			СтрокаОплатаУслуг.Сумма					= Списываем;
			СтрокаОплатаУслуг.Разделитель			= ДанныеДокумента.Разделитель;

		Иначе
			ТаблицаАвансыИспользованные 				= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные; 
			
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
			ЗаписьАвансыИспользованные.Активность  		= истина;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Сумма 			= Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= СтрокаЗадолженности.ПериодРасчета;
			ЗаписьАвансыИспользованные.Поставщик		= СтрокаЗадолженности.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= СтрокаЗадолженности.услуга;	
			ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;

			// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
			ЗаписьАвансыИспользованные.Активность  		= Истина;
			ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;				
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Сумма 			= - Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
			ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;

		КонецЕсли;
		
		СтрокаЗадолженности.СуммаЗадолженности 	= СтрокаЗадолженности.СуммаЗадолженности - Списываем; 		
		НадоСписать 							= НадоСписать - Списываем;
		
		Если СтрокаЗадолженности.СуммаЗадолженности = 0 тогда
			МассивУдаляемых.Добавить(СтрокаЗадолженности);
		КонецЕсли;  		
		
		Если НадоСписать = 0 Тогда
			Прервать;
		КонецЕсли; 		
		
	КонецЦикла;
	
	для Каждого УдаляемаяСтрока из МассивУдаляемых цикл
		РасшифровкаЗадолженности.Удалить(УдаляемаяСтрока);				
	КонецЦикла;
		
КонецПроцедуры

Процедура СписатьЗадолженностьСогласноНастройкиРаспределения(ПараметрыОперации, ДанныеДокумента, НадоСписать)
	
	ТаблицаВзаиморасчеты = ДанныеДокумента.НаборТаблиц.энргВзаиморасчетыПоМесяцам;
	
	Если ДанныеДокумента.ЭтоОплата Тогда 
		ТаблицаОплатаУслуг			 	= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
	иначе
		ТаблицаАвансыИспользованные 	= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные
	КонецЕсли;
	
	РасшифровкаЗадолженности 	= ДанныеЗадолженности.Расшифровка;	
	МассивУдаляемых				= Новый Массив;
	
	для Каждого СтрокаЗадолженности из РасшифровкаЗадолженности цикл
		
		Списываем = Мин(СтрокаЗадолженности.СуммаЗадолженности,НадоСписать);
		
		СтрокаЗадолженности.СуммаЗадолженности = СтрокаЗадолженности.СуммаЗадолженности - Списываем;
		
		Если СтрокаЗадолженности.СуммаЗадолженности = 0 тогда
			МассивУдаляемых.Добавить(СтрокаЗадолженности);
		КонецЕсли;
				
		СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчеты.Добавить();
		СтрокаВзаиморасчеты.Организация		 			= ПараметрыОперации.Организация;
		СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
		СтрокаВзаиморасчеты.ПериодНачисления 			= СтрокаЗадолженности.ПериодРасчета;
		СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Расход;
		СтрокаВзаиморасчеты.Активность					= Истина;
		СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;		
		СтрокаВзаиморасчеты.МКД 						= ДанныеДокумента.МКД;
		СтрокаВзаиморасчеты.Абонент 					= ДанныеДокумента.Абонент;
		СтрокаВзаиморасчеты.Услуга 						= СтрокаЗадолженности.услуга;
		СтрокаВзаиморасчеты.Сумма 						= Списываем;
		СтрокаВзаиморасчеты.Поставщик					= СтрокаЗадолженности.Поставщик;
		СтрокаВзаиморасчеты.ПериодРегистрации			= ПараметрыОперации.ПериодНачисления;
		
		Если ДанныеДокумента.ЭтоОплата тогда 
			СтрокаОплатаУслуг 							= ТаблицаОплатаУслуг.добавить();
			СтрокаОплатаУслуг.Активность				= истина;
			СтрокаОплатаУслуг.Период 					= ДанныеДокумента.Период;
			СтрокаОплатаУслуг.Организация				= ПараметрыОперации.Организация;
			СтрокаОплатаУслуг.Район 					= ПараметрыОперации.Район;
			СтрокаОплатаУслуг.МКД 						= ДанныеДокумента.МКД;
			СтрокаОплатаУслуг.Абонент 					= ДанныеДокумента.Абонент;
			СтрокаОплатаУслуг.Услуга 					= СтрокаЗадолженности.Услуга;
			СтрокаОплатаУслуг.Поставщик					= СтрокаЗадолженности.Поставщик;
			СтрокаОплатаУслуг.Сумма 					= Списываем;
			СтрокаОплатаУслуг.ПериодНачисления			= СтрокаЗадолженности.ПериодРасчета;
			СтрокаОплатаУслуг.ПериодРасчета				= ПараметрыОперации.ПериодНачисления;
			СтрокаОплатаУслуг.Кассир					= ДанныеДокумента.Кассир;
			СтрокаОплатаУслуг.ИсточникПоступления		= ДанныеДокумента.ИсточникПоступления;
			СтрокаОплатаУслуг.Разделитель				= ДанныеДокумента.Разделитель;
		иначе
			ТаблицаАвансыИспользованные					= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.добавить();
			ЗаписьАвансыИспользованные.Активность  		= истина;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Сумма 			= Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Поставщик		= СтрокаЗадолженности.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= СтрокаЗадолженности.услуга;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
			// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
			ТаблицаАвансыИспользованные					= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.добавить();
			ЗаписьАвансыИспользованные.Активность  		= истина;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Сумма 			= -Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
		КонецЕсли;
												
		НадоСписать = НадоСписать - Списываем;
	КонецЦикла; 
	
	для Каждого УдаляемаяСтрока из МассивУдаляемых цикл
		РасшифровкаЗадолженности.Удалить(УдаляемаяСтрока);
	КонецЦикла;
		
	//Если НадоСписать > 0 тогда
	//	УвеличитьАванс(ПараметрыОперации,ДанныеДокумента,НадоСписать);
	//КонецЕсли;

КонецПроцедуры

Процедура СписатьЗадолженностьПропорциональноЗадолженности(ПараметрыОперации, ДанныеДокумента, НадоСписать)
	
	РасшифровкаЗадолженности = ДанныеЗадолженности.Расшифровка;
	
	НайстрокиПогашенияЗадолженности							= ПараметрыОперации.НастройкиПорядкаПогашения;
	УслугиДляПогашенияТолькоДеньгами						= ПараметрыОперации.УслугиДляПогашенияТолькоДеньгами;
		
	ТаблицаВзаиморасчеты = ДанныеДокумента.НаборТаблиц.энргВзаиморасчетыПоМесяцам;	
	СтрокиУдалить = Новый Массив;
	
	ПериодыЗадолженности 									= РасшифровкаЗадолженности.Скопировать();
	
	Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ПериодыЗадолженности Цикл
			Если УслугиДляПогашенияТолькоДеньгами.Найти(ТекСтрока.Услуга) <> Неопределено Тогда
				СтрокиУдалить.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
			ПериодыЗадолженности.Удалить(СтрокаУдалить);
		КонецЦикла;
	КонецЕсли;
	
	ПериодыЗадолженности.Свернуть("ПорядокПогашенияУслугиПриПропорциональномРаспределении,ПорядокПросуженнойЗадолженности,ПериодРасчета","СуммаЗадолженности");
	ПериодыЗадолженности.Сортировать("ПорядокПросуженнойЗадолженности,ПорядокПогашенияУслугиПриПропорциональномРаспределении,ПериодРасчета"); 	
	
	
	СтрокиУдалить 											= Новый Массив;
	
	//
	//////Если НайстрокиПогашенияЗадолженности.количество()<> 0 Тогда
	//////	
	//////	Для Сч = 0 По НайстрокиПогашенияЗадолженности.Количество() - 1 Цикл
	//////		Если НайстрокиПогашенияЗадолженности[Сч].Порядок > 0 Тогда 
	//////			Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Найти(НайстрокиПогашенияЗадолженности[Сч].Услуга) <> Неопределено Тогда 
	//////				Продолжить;
	//////			КонецЕсли;
	//////			
	//////			НайденныеУслуги = РасшифровкаЗадолженности.НайтиСтроки(Новый Структура("Услуга", НайстрокиПогашенияЗадолженности[Сч].Услуга));
	//////			ОстатокСуммы 										= НадоСписать;
	//////			
	//////			Для ИндексСтроки = 0 По НайденныеУслуги.ВГраница() Цикл
	//////				Если НайденныеУслуги[ИндексСтроки].ПорядокПросуженнойЗадолженности = 1 Тогда
	//////					// блокированную задолженность гасим последней
	//////					Продолжить;
	//////				КонецЕсли;
	//////				
	//////				ОбщаяСуммаЗаПериод								= НайденныеУслуги[ИндексСтроки].СуммаЗадолженности;
	//////				Если ОбщаяСуммаЗаПериод = 0 Тогда
	//////					Продолжить;
	//////				КонецЕсли;
	//////				
	//////				ДоляВПериоде	 								= НайденныеУслуги[ИндексСтроки].СуммаЗадолженности / ОбщаяСуммаЗаПериод;
	//////				СписываемПоДоле 								= ?(ИндексСтроки = НайденныеУслуги.ВГраница(), НадоСписать, ДоляВПериоде * ОстатокСуммы);
	//////				Списываем 										= Окр(Мин(СписываемПоДоле, НайденныеУслуги[ИндексСтроки].СуммаЗадолженности), 2);
	//////				НадоСписать 									= НадоСписать - Списываем;
	//////				
	//////				СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчеты.Добавить();
	//////				СтрокаВзаиморасчеты.Организация		 			= ПараметрыОперации.Организация;
	//////				СтрокаВзаиморасчеты.ПериодНачисления 			= НайденныеУслуги[ИндексСтроки].ПериодРасчета;
	//////				СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
	//////				СтрокаВзаиморасчеты.ПериодРегистрации			= ПараметрыОперации.ПериодНачисления;
	//////				СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Расход;
	//////				СтрокаВзаиморасчеты.Активность					= Истина;
	//////				СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;			
	//////				СтрокаВзаиморасчеты.МКД 						= ДанныеДокумента.МКД;
	//////				СтрокаВзаиморасчеты.Абонент 					= ДанныеДокумента.Абонент;
	//////				СтрокаВзаиморасчеты.Услуга 						= НайденныеУслуги[ИндексСтроки].Услуга;
	//////				СтрокаВзаиморасчеты.Сумма 						= Списываем;
	//////				СтрокаВзаиморасчеты.Поставщик					= НайденныеУслуги[ИндексСтроки].Поставщик;
	//////				СтрокаВзаиморасчеты.Разделитель					= ДанныеДокумента.Разделитель;
	//////				
	//////				НайденныеУслуги[ИндексСтроки].СуммаЗадолженности = НайденныеУслуги[ИндексСтроки].СуммаЗадолженности - Списываем;
	//////				Если НайденныеУслуги[ИндексСтроки].СуммаЗадолженности = 0 Тогда
	//////					СтрокиУдалить.Добавить(НайденныеУслуги[ИндексСтроки]);
	//////				КонецЕсли;
	//////				
	//////				Если ДанныеДокумента.ЭтоОплата тогда          
	//////					ТаблицаОплатаУслуг 							= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
	//////					
	//////					СтрокаОплатаУслуг 							= ТаблицаОплатаУслуг.добавить();
	//////					СтрокаОплатаУслуг.Активность				= истина;  				
	//////					СтрокаОплатаУслуг.Организация				= ПараметрыОперации.Организация;
	//////					СтрокаОплатаУслуг.Район 					= ПараметрыОперации.Район;
	//////					СтрокаОплатаУслуг.ПериодРасчета				= ПараметрыОперации.ПериодНачисления;
	//////					СтрокаОплатаУслуг.Период 					= ДанныеДокумента.Период;
	//////					СтрокаОплатаУслуг.МКД 						= ДанныеДокумента.МКД;
	//////					СтрокаОплатаУслуг.Абонент 					= ДанныеДокумента.Абонент;
	//////					СтрокаОплатаУслуг.Кассир					= ДанныеДокумента.Кассир;
	//////					СтрокаОплатаУслуг.ИсточникПоступления		= ДанныеДокумента.ИсточникПоступления;
	//////					СтрокаОплатаУслуг.Услуга 					= НайденныеУслуги[ИндексСтроки].услуга;
	//////					СтрокаОплатаУслуг.Поставщик					= НайденныеУслуги[ИндексСтроки].Поставщик;
	//////					СтрокаОплатаУслуг.Сумма 					= Списываем;
	//////					СтрокаОплатаУслуг.ПериодНачисления			= НайденныеУслуги[ИндексСтроки].ПериодРасчета;
	//////					СтрокаОплатаУслуг.Разделитель				= ДанныеДокумента.Разделитель;
	//////				иначе
	//////					ТаблицаАвансыИспользованные 				= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные; 
	//////					
	//////					ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
	//////					ЗаписьАвансыИспользованные.Активность  		= истина;
	//////					ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
	//////					ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
	//////					ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
	//////					ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
	//////					ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
	//////					ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
	//////					ЗаписьАвансыИспользованные.Сумма 			= Списываем;
	//////					ЗаписьАвансыИспользованные.ПериодНачисления	= НайденныеУслуги[ИндексСтроки].ПериодРасчета;
	//////					ЗаписьАвансыИспользованные.Поставщик		= НайденныеУслуги[ИндексСтроки].Поставщик;
	//////					ЗаписьАвансыИспользованные.Услуга			= НайденныеУслуги[ИндексСтроки].услуга;	
	//////					ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
	//////					ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
	//////					
	//////					// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
	//////					ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
	//////					ЗаписьАвансыИспользованные.Активность  		= истина;
	//////					ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
	//////					ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;				
	//////					ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
	//////					ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
	//////					ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
	//////					ЗаписьАвансыИспользованные.Сумма 			= -Списываем;
	//////					ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
	//////					ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
	//////					ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
	//////					ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
	//////					ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
	//////					ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
	//////				КонецЕсли;
	//////				
	//////				Если НадоСписать = 0 тогда
	//////					Прервать;
	//////				КонецЕсли;
	//////			КонецЦикла;
	//////		иначе 
	//////			Продолжить;
	//////		КонецЕсли;
	//////	КонецЦикла;
	//////	
	//////	Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
	//////		РасшифровкаЗадолженности.Удалить(СтрокаУдалить);
	//////	КонецЦикла;
	//////	
	//////	СтрокиУдалить.Очистить();
	//////	
	//////КонецЕсли;

	БылиИзменения = Ложь;
	Для Сч = 0 По ПериодыЗадолженности.Количество() - 1 Цикл
		
		СтрокиВПериоде 										= РасшифровкаЗадолженности.НайтиСтроки(Новый Структура("ПорядокПогашенияУслугиПриПропорциональномРаспределении,ПорядокПросуженнойЗадолженности, ПериодРасчета",  ПериодыЗадолженности[Сч].ПорядокПогашенияУслугиПриПропорциональномРаспределении, ПериодыЗадолженности[Сч].ПорядокПросуженнойЗадолженности, ПериодыЗадолженности[Сч].ПериодРасчета));
		ОстатокСуммы 										= НадоСписать;
		ОбщаяСуммаЗаПериод									= ПериодыЗадолженности[Сч].СуммаЗадолженности;
		
		Для ИндексСтроки = 0 По СтрокиВПериоде.ВГраница() Цикл			
			
			Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Найти(СтрокиВПериоде[ИндексСтроки].Услуга) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбщаяСуммаЗаПериод = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДоляВПериоде	 								= СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности / ОбщаяСуммаЗаПериод;
			СписываемПоДоле 								= ?(ИндексСтроки = СтрокиВПериоде.ВГраница(), НадоСписать, ДоляВПериоде * ОстатокСуммы);
			Списываем 										= Окр(Мин(СписываемПоДоле, СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности), 2);
			НадоСписать 									= НадоСписать - Списываем;
			
			
			СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчеты.Добавить();
			СтрокаВзаиморасчеты.Организация		 			= ПараметрыОперации.Организация;
			СтрокаВзаиморасчеты.ПериодНачисления 			= СтрокиВПериоде[ИндексСтроки].ПериодРасчета;
			СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
			СтрокаВзаиморасчеты.ПериодРегистрации			= ПараметрыОперации.ПериодНачисления;
			СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Расход;
			СтрокаВзаиморасчеты.Активность					= Истина;
			СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;			
			СтрокаВзаиморасчеты.МКД 						= ДанныеДокумента.МКД;
			СтрокаВзаиморасчеты.Абонент 					= ДанныеДокумента.Абонент;
			СтрокаВзаиморасчеты.Услуга 						= СтрокиВПериоде[ИндексСтроки].Услуга;
			СтрокаВзаиморасчеты.Сумма 						= Списываем;
			СтрокаВзаиморасчеты.Поставщик					= СтрокиВПериоде[ИндексСтроки].Поставщик;
			СтрокаВзаиморасчеты.Разделитель					= ДанныеДокумента.Разделитель;
			
			СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности = СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности - Списываем;
			Если СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности = 0 Тогда
				СтрокиУдалить.Добавить(СтрокиВПериоде[ИндексСтроки]);
			КонецЕсли;
			БылиИзменения = Истина;
			
			Если ДанныеДокумента.ЭтоОплата тогда          
				ТаблицаОплатаУслуг 							= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
				
				СтрокаОплатаУслуг 							= ТаблицаОплатаУслуг.добавить();
				СтрокаОплатаУслуг.Активность				= истина;  				
				СтрокаОплатаУслуг.Организация				= ПараметрыОперации.Организация;
				СтрокаОплатаУслуг.Район 					= ПараметрыОперации.Район;
				СтрокаОплатаУслуг.ПериодРасчета				= ПараметрыОперации.ПериодНачисления;
				СтрокаОплатаУслуг.Период 					= ДанныеДокумента.Период;
				СтрокаОплатаУслуг.МКД 						= ДанныеДокумента.МКД;
				СтрокаОплатаУслуг.Абонент 					= ДанныеДокумента.Абонент;
				СтрокаОплатаУслуг.Кассир					= ДанныеДокумента.Кассир;
				СтрокаОплатаУслуг.ИсточникПоступления		= ДанныеДокумента.ИсточникПоступления;
				СтрокаОплатаУслуг.Услуга 					= СтрокиВПериоде[ИндексСтроки].услуга;
				СтрокаОплатаУслуг.Поставщик					= СтрокиВПериоде[ИндексСтроки].Поставщик;
				СтрокаОплатаУслуг.Сумма 					= Списываем;
				СтрокаОплатаУслуг.ПериодНачисления			= СтрокиВПериоде[ИндексСтроки].ПериодРасчета;
				СтрокаОплатаУслуг.Разделитель				= ДанныеДокумента.Разделитель;
			иначе
				ТаблицаАвансыИспользованные 				= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные; 
				
				ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
				ЗаписьАвансыИспользованные.Активность  		= истина;
				ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
				ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
				ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
				ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
				ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
				ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
				ЗаписьАвансыИспользованные.Сумма 			= Списываем;
				ЗаписьАвансыИспользованные.ПериодНачисления	= СтрокиВПериоде[ИндексСтроки].ПериодРасчета;
				ЗаписьАвансыИспользованные.Поставщик		= СтрокиВПериоде[ИндексСтроки].Поставщик;
				ЗаписьАвансыИспользованные.Услуга			= СтрокиВПериоде[ИндексСтроки].услуга;	
				ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
				ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
				
				// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
				ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
				ЗаписьАвансыИспользованные.Активность  		= истина;
				ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
				ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;				
				ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
				ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
				ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
				ЗаписьАвансыИспользованные.Сумма 			= -Списываем;
				ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
				ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
				ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
				ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
				ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
				ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
			КонецЕсли;
			
			Если НадоСписать = 0 тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НадоСписать = 0 тогда
			Прервать;
		КонецЕсли; 		
	КонецЦикла;
	
	Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
		РасшифровкаЗадолженности.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	Если БылиИзменения Тогда
		РасшифровкаЗадолженности.Свернуть("ПериодРасчета,ПорядокПериодРасчета,ПорядокПогашенияУслуги,ПорядокПросуженнойЗадолженности,ПорядокПогашенияУслугиПриПропорциональномРаспределении,Поставщик,Услуга", "СуммаЗадолженности");
		РасшифровкаЗадолженности.Сортировать("ПорядокПериодРасчета,ПорядокПросуженнойЗадолженности,ПорядокПогашенияУслугиПриПропорциональномРаспределении,ПериодРасчета,ПорядокПогашенияУслуги,Услуга");
		ДанныеЗадолженности.СуммаЗадолженности = РасшифровкаЗадолженности.Итог("СуммаЗадолженности");
	КонецЕсли;
	//Если НадоСписать > 0 Тогда		
	//	ПараметрыОперации.СуммаАванса  					= ПараметрыОперации.СуммаАванса + НадоСписать;
	//	УвеличитьАванс(ПараметрыОперации, ДанныеДокумента, НадоСписать);
	//	НадоСписать	 									= 0;
	//КонецЕсли;
	
КонецПроцедуры


Процедура СписатьЗадолженностьДопУслуг(ПараметрыОперации, ДанныеДокумента, Сумма, Услуга = Неопределено, Поставщик = Неопределено, ПериодНачисления  = Неопределено)
	
	Если Не ПараметрыОперации.АвансГаситДопУслуги Тогда
		Возврат;
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	// fix
	//СписатьЗадолженностьПениПропорциональноЗадолженности(ПараметрыОперации, ДанныеДокумента, Сумма);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСОплатой

Процедура РаспределитьОплатуАбонентаПоНазначениюПлатежа(ПараметрыОперации, ДанныеОплаты, ДанныеДокумента) 
	 
	РасшифровкаОплаты = ДанныеОплаты.Расшифровка;
	Для Каждого СтрокаОплаты Из РасшифровкаОплаты Цикл
		
		Если СтрокаОплаты.Разделитель <> ДанныеДокумента.Разделитель Тогда
			Продолжить;
		КонецЕсли;
		
		//ДанныеДокумента.Вставить("Разделитель", СтрокаОплаты.Разделитель);
		СписатьЗадолженность(ПараметрыОперации, ДанныеДокумента, СтрокаОплаты.Сумма, СтрокаОплаты.Услуга, СтрокаОплаты.Поставщик, СтрокаОплаты.ПериодВзаиморасчетов);
		СписатьЗадолженность(ПараметрыОперации, ДанныеДокумента, СтрокаОплаты.Сумма, Неопределено, Неопределено, Неопределено); 				
		СписатьЗадолженностьДопУслуг(ПараметрыОперации, ДанныеДокумента, СтрокаОплаты.Сумма, Неопределено, Неопределено, Неопределено); 								
		
		////пока коментирую
		//Если СтрокаОплаты.Сумма > 0 Тогда		
		//	ПараметрыОперации.СуммаАванса = ПараметрыОперации.СуммаАванса + СтрокаОплаты.Сумма;
		//	УвеличитьАванс(ПараметрыОперации, ДанныеДокумента, СтрокаОплаты.Сумма);
		//	СтрокаОплаты.Сумма = 0;
		//КонецЕсли;
		////пока коментирую
		
		Если СтрокаОплаты.Сумма > 0 Тогда
			ПараметрыОперации.ОсвободившиесяДеньги.Сумма = ПараметрыОперации.ОсвободившиесяДеньги.Сумма + СтрокаОплаты.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьОстатокОплатыАбонента(ПараметрыОперации, ДанныеОплаты, ДанныеДокумента) 
	
	СписатьЗадолженность(ПараметрыОперации, ДанныеДокумента, ПараметрыОперации.ОсвободившиесяДеньги.Сумма, Неопределено, Неопределено, Неопределено);
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСАвансами

Процедура УменьшитьАванс(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора)	
			
	Если ПараметрыОперации.СпособРаспределенияОплаты = Перечисления.энргСпособыРаспределенияОплаты.ПоУслугамСогласноНастройкамРаспределения тогда
		УменьшитьАвансСогласноНастройкиРаспределения(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора);
	иначе
		УменьшитьАвансПропорциональноЗадолженности(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора);
	КонецЕсли;
	
КонецПроцедуры

Процедура УменьшитьАвансСогласноНастройкиРаспределения(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора)
	
	ТаблицаАвансы 				= ДанныеДокумента.НаборТаблиц.энргАвансы;
	ТаблицаАвансыИспользованные = ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
		
	ОстатокАванса		 		= ПараметрыОперации.СуммаАванса;
	ОписаниеСтрокиначислений  	= Новый ФиксированнаяСтруктура("Период,Услуга,Организация, ПериодНачисления,Сумма");
	НастройкиПорядкаПогашения 	= ПараметрыОперации.НастройкиПорядкаПогашения;
	ВыборкаПорядок  			= НастройкиПорядкаПогашения.выбрать();
	Пока ВыборкаПорядок.Следующий() и ОстатокАванса > 0 цикл			
		
		НачисленияПоУслуге = ДанныеНачисленияРегистратора.Получить(ВыборкаПорядок.Услуга);
		
		Если НачисленияПоУслуге <> Неопределено тогда 
			
			ПериодыНачислений = НачисленияПоУслуге.ПериодыНачислений;			
			МассивУдаляемых = Новый Массив;
			
			для Каждого ПериодНачисления из ПериодыНачислений цикл 								
				
				Списываем = Мин(ОстатокАванса,ПериодНачисления.СуммаНачислений);
				Если  Списываем = 0 тогда
					Продолжить;
				КонецЕсли;			
				
				Если ПериодНачисления.СуммаНачислений < 0 тогда
					
					ПараметрыОперации.Сумма = -ПериодНачисления.СуммаНачислений;
					ОтрицательнаяСуммаНачислений(
						ПараметрыОперации, 
						ДанныеДокумента, 
						-ПериодНачисления.СуммаНачислений, 
						ВыборкаПорядок.Услуга,
						ПериодНачисления.Поставщик,
						ПериодНачисления.ПериодРасчета);
						
					ОстатокАванса = ОстатокАванса - ПериодНачисления.СуммаНачислений;
					МассивУдаляемых.Добавить(ПериодНачисления);
					
				иначе
					ВызватьИсключение "Проверь меня";
					
					ДобавитьРасходАванса(ПараметрыОперации, ДанныеДокумента, Списываем, Неопределено, 1);					
					ОстатокАванса  						= ОстатокАванса - Списываем;			
					ПериодНачисления.СуммаНачислений 	= ПериодНачисления.СуммаНачислений -Списываем;
				КонецЕсли;
				
				Если ПериодНачисления.СуммаНачислений = 0 тогда
					МассивУдаляемых.Добавить(ПериодНачисления);
				КонецЕсли;				
			КонецЦикла;
			
			// Удаляем нулевые строки.
			для Каждого УдаляемаяСтрока из МассивУдаляемых цикл
				ПериодыНачислений.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			
			// Если не осталось строк начисления удаляем все по ключу.
			Если НачисленияПоУслуге.ПериодыНачислений.количество() = 0 тогда
				ДанныеНачисленияРегистратора.Удалить(ВыборкаПорядок.Услуга)
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	//ПараметрыОперации.СуммаАванса = ОстатокАванса;
	
КонецПроцедуры

Процедура УменьшитьАвансПропорциональноЗадолженности(ПараметрыОперации, ДанныеДокумента, ДанныеНачисленияРегистратора)
	
	РасшифровкаНачислений   = ДанныеНачисленияРегистратора.Расшифровка;
	
	ПериодыЗадолженности 	= РасшифровкаНачислений.Скопировать();
	
	// {Авансом закрываем только положительное начисление (в перерасчете могут быть строки как +, так и - суммы)
	Для Каждого ТекСтрока Из ПериодыЗадолженности Цикл
		ТекСтрока.СуммаНачислений = Макс(0, ТекСтрока.СуммаНачислений);	
	КонецЦикла;
	// }
	
	ПериодыЗадолженности.Свернуть("ПериодРасчета, ПорядокУслугТолькоЖивымиДеньгами","СуммаНачислений");
	ПериодыЗадолженности.Сортировать("ПериодРасчета, ПорядокУслугТолькоЖивымиДеньгами");	
	
	ТаблицаАвансыИспользованные	= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
	
	БылиИзменения = Ложь;
	Для Сч = 0 По ПериодыЗадолженности.Количество() - 1 Цикл
		
		ОбщаяСуммаЗаПериод	= ПериодыЗадолженности[Сч].СуммаНачислений;
		
		Если ПериодыЗадолженности[Сч].ПорядокУслугТолькоЖивымиДеньгами = 0 Тогда
			СуммаАвансаДляСписания	= ПараметрыОперации.СуммаАвансаЖивымиДеньгами;
			ОсталосьСписать			= ПараметрыОперации.СуммаАвансаЖивымиДеньгами;
		Иначе
			СуммаАвансаДляСписания	= ПараметрыОперации.СуммаАванса;
			ОсталосьСписать			= ПараметрыОперации.СуммаАванса;
		КонецЕсли;
		
		СтрокиВПериоде 		= РасшифровкаНачислений.НайтиСтроки(Новый Структура("ПериодРасчета, ПорядокУслугТолькоЖивымиДеньгами", ПериодыЗадолженности[Сч].ПериодРасчета, ПериодыЗадолженности[Сч].ПорядокУслугТолькоЖивымиДеньгами));
		
		Для ИндексСтроки = 0 По СтрокиВПериоде.ВГраница() Цикл				
			
			Если ОбщаяСуммаЗаПериод = 0 Тогда 
				Продолжить;
			КонецЕсли;			
			
			Если СтрокиВПериоде[ИндексСтроки].СуммаНачислений < 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			ДоляВПериоде	 								= СтрокиВПериоде[ИндексСтроки].СуммаНачислений / ОбщаяСуммаЗаПериод;
			СписываемПоДоле 								= ?(ИндексСтроки = СтрокиВПериоде.ВГраница(), ОсталосьСписать, ДоляВПериоде * СуммаАвансаДляСписания);
			Списываем 										= Окр(Мин(СписываемПоДоле, СтрокиВПериоде[ИндексСтроки].СуммаНачислений), 2);
			ОсталосьСписать 								= ОсталосьСписать - Списываем;
			СтрокиВПериоде[ИндексСтроки].СуммаНачислений	= СтрокиВПериоде[ИндексСтроки].СуммаНачислений - Списываем;
			ПараметрыИспользованияАванса  					= Новый Структура("Услуга,Поставщик,ПериодРасчета", СтрокиВПериоде[ИндексСтроки].Услуга, СтрокиВПериоде[ИндексСтроки].Поставщик, СтрокиВПериоде[ИндексСтроки].ПериодРасчета);
			ДобавитьРасходАванса(ПараметрыОперации, ДанныеДокумента, Списываем, ПараметрыИспользованияАванса, ПериодыЗадолженности[Сч].ПорядокУслугТолькоЖивымиДеньгами);
			БылиИзменения									= Истина;
			
			Если ОсталосьСписать = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//Если ОсталосьСписать = 0 Тогда
		//	Прервать;
		//КонецЕсли;
		
		//Если ПериодыЗадолженности[Сч].ПорядокУслугТолькоЖивымиДеньгами = 0 Тогда
		//	ПараметрыОперации.СуммаАванса				= ПараметрыОперации.СуммаАванса - (ПараметрыОперации.СуммаАвансаЖивымиДеньгами - ОсталосьСписать);
		//	ПараметрыОперации.СуммаАвансаЖивымиДеньгами	= ОсталосьСписать;
		//Иначе
		//	ПараметрыОперации.СуммаАванса = ОсталосьСписать;
		//КонецЕсли;		
		
	КонецЦикла;
	
	
	
	Если БылиИзменения Тогда
		ДанныеНачисленияРегистратора.СуммаНачислений = ДанныеНачисленияРегистратора.Расшифровка.Итог("СуммаНачислений");	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРасходАванса(ПараметрыОперации, ДанныеДокумента, Сумма, ПараметрыИспользованияАванса, ПорядокУслугТолькоЖивымиДеньгами)
	
	ТаблицаАвансы 										= ДанныеДокумента.НаборТаблиц.энргАвансы;
	ТаблицаАвансыИспользованные 						= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
	
	Авансы 												= ПараметрыОперации.Авансы;
	ОсталосьСписать 									= Сумма;
	УдаляемыеСтроки 									= Новый Массив;
	
	Для Сч = 0 По Авансы.ВГраница() Цикл	
		
		Если ПорядокУслугТолькоЖивымиДеньгами = 0 И Не Авансы[Сч].ЖивыеДеньги Тогда
			Продолжить;
		КонецЕсли;
			
		//Если  Авансы[Сч].ДокументОплаты = ДанныеДокумента.Регистратор Тогда
		//	// это только для отрицательного Перерасчета, который образует аванс. Этот аванс списывать не надо.
		//	Продолжить;			
		//КонецЕсли;
		Списываем 										= Мин(Авансы[Сч].СуммаАванса,ОсталосьСписать);
		ОсталосьСписать 								= ОсталосьСписать - Списываем;
		Авансы[Сч].СуммаАванса 							= Авансы[Сч].СуммаАванса - Списываем;
		Если Авансы[Сч].ЖивыеДеньги Тогда
			ПараметрыОперации.СуммаАвансаЖивымиДеньгами	= ПараметрыОперации.СуммаАвансаЖивымиДеньгами - Списываем;	
		КонецЕсли;
		ПараметрыОперации.СуммаАванса				= ПараметрыОперации.СуммаАванса - Списываем;
		
		Если Авансы[Сч].СуммаАванса = 0 Тогда
			УдаляемыеСтроки.Добавить(Сч);
		КонецЕсли;
		
		ЗаписьАвансы  									= ТаблицаАвансы.добавить();
		ЗаписьАвансы.ВидДвижения 						= ВидДвиженияНакопления.Расход;
		ЗаписьАвансы.Активность  						= истина;
		ЗаписьАвансы.Период  							= ДанныеДокумента.Период;			
		ЗаписьАвансы.МКД	  							= ДанныеДокумента.МКД;
		ЗаписьАвансы.Абонент  							= ДанныеДокумента.Абонент;
		ЗаписьАвансы.Сумма 								= Списываем;
		ЗаписьАвансы.ПериодНачисления 					= ПараметрыОперации.ПериодНачисления;
		ЗаписьАвансы.Организация 						= ПараметрыОперации.Организация;
		ЗаписьАвансы.Район  							= ПараметрыОперации.Район;
		ЗаписьАвансы.ДокументОплаты 					= Авансы[Сч].ДокументОплаты;
		ЗаписьАвансы.Разделитель	 					= Авансы[Сч].Разделитель;
		
		Если НЕ ПараметрыИспользованияАванса = Неопределено Тогда
			ЗаписьАвансыИспользованые					= ТаблицаАвансыИспользованные.добавить();
			ЗаписьАвансыИспользованые.Активность		= Истина;
			ЗаписьАвансыИспользованые.Период  			= ДанныеДокумента.Период;		
			ЗаписьАвансыИспользованые.МКД	 			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованые.Абонент			= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованые.Услуга			= ПараметрыИспользованияАванса.Услуга;
			ЗаписьАвансыИспользованые.Поставщик			= ПараметрыИспользованияАванса.Поставщик;
			ЗаписьАвансыИспользованые.ПериодРасчета		= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованые.Сумма 			= Списываем;		
			ЗаписьАвансыИспользованые.ПериодНачисления	= ПараметрыИспользованияАванса.ПериодРасчета;
			ЗаписьАвансыИспользованые.Организация		= ПараметрыОперации.Организация;
			ЗаписьАвансыИспользованые.Район  			= ПараметрыОперации.Район;
			ЗаписьАвансыИспользованые.ДокументОплаты	= Авансы[Сч].ДокументОплаты;
			ЗаписьАвансыИспользованые.Разделитель		= Авансы[Сч].Разделитель;
		КонецЕсли;
	
		Если ОсталосьСписать = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Смещение = 0;
	
	Для Индекс = 0 По УдаляемыеСтроки.ВГраница() Цикл
		Авансы.Удалить(УдаляемыеСтроки[Индекс - Смещение]);
		Смещение = Смещение + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура СторнироватьАвансыИОплату(ПараметрыОперации, ДанныеДокумента, ДанныеНачислений)	
		
	ТаблицаАвансыПоступившие			= ДанныеДокумента.НаборТаблиц.энргАвансыПоступившие;
	ТаблицаАвансыИспользованные			= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
	ТаблицаОплатаУслуг  				= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
	ТаблицаАвансы  						= ДанныеДокумента.НаборТаблиц.энргАвансы;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	-энргАвансыПоступившие.Сумма КАК Сумма,
	|	&Ссылка КАК ДокументОплаты,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	&Абонент КАК Абонент,
	|	&период КАК Период,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&ИсточникПоступления КАК ИсточникПоступления,
	|	ИСТИНА КАК Активность,
	//|	энргАвансыПоступившие.Разделитель КАК Разделитель
	|	0 КАК Разделитель
	|ИЗ
	|	РегистрНакопления.энргАвансыПоступившие КАК энргАвансыПоступившие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ПО энргАвансыПоступившие.Регистратор = энргПерерасчетКорректировкаОплаты.ДокументОплаты
	|			И (энргАвансыПоступившие.Абонент = &Абонент)
	|			И энргАвансыПоступившие.Разделитель = энргПерерасчетКорректировкаОплаты.Разделитель
	|			И энргАвансыПоступившие.Сумма > 0
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Регистратор);
	Запрос.УстановитьПараметр("ПериодНачисления", ПараметрыОперации.ПериодНачисления);
	Запрос.УстановитьПараметр("Абонент", ДанныеДокумента.Абонент);
	Запрос.УстановитьПараметр("период", ДанныеДокумента.период);
	Запрос.УстановитьПараметр("МКД", ДанныеДокумента.МКД);
	Запрос.УстановитьПараметр("Район", ПараметрыОперации.Район);
	Запрос.УстановитьПараметр("Организация", ПараметрыОперации.Организация);
	Запрос.УстановитьПараметр("ИсточникПоступления", ДанныеДокумента.ИсточникПоступления);
	
	Результат 			= Запрос.Выполнить();
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаАвансыПоступившие.Добавить(), Выборка);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	&Абонент КАК Абонент,
	|	&Ссылка КАК ДокументОплаты,
	|	энргАвансыИспользованные.Услуга КАК Услуга,
	|	энргАвансыИспользованные.Поставщик КАК Поставщик,
	|	энргАвансыИспользованные.ПериодРасчета КАК ПериодНачисления,
	|	-энргАвансыИспользованные.Сумма КАК Сумма,
	|	&период КАК Период,
	|	&ПериодНачисления КАК ПериодРасчета,
	|	ИСТИНА КАК Активность,
	|	энргАвансыИспользованные.Разделитель КАК Разделитель
	|ИЗ
	|	РегистрНакопления.энргАвансыИспользованные КАК энргАвансыИспользованные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ПО энргАвансыИспользованные.ДокументОплаты = энргПерерасчетКорректировкаОплаты.ДокументОплаты
	|			И энргАвансыИспользованные.Разделитель = энргПерерасчетКорректировкаОплаты.Разделитель
	|			И (энргАвансыИспользованные.Абонент = &Абонент)
	|			И энргАвансыИспользованные.ПериодРасчета <= энргПерерасчетКорректировкаОплаты.Ссылка.ПериодНачисления
	|			И (энргПерерасчетКорректировкаОплаты.УслугаБыло = энргАвансыИспользованные.Услуга
	|				ИЛИ энргПерерасчетКорректировкаОплаты.УслугаБыло = ЗНАЧЕНИЕ(Справочник.энргвидыуслуг.пустаяссылка))
	|			И (энргПерерасчетКорректировкаОплаты.ПоставщикБыло = энргАвансыИспользованные.Поставщик
	|				ИЛИ энргПерерасчетКорректировкаОплаты.ПоставщикБыло = ЗНАЧЕНИЕ(Справочник.энргконтрагенты.пустаяссылка))
	|			И энргАвансыИспользованные.Сумма > 0
	|			
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка
	|	И энргАвансыИспользованные.Регистратор <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Регистратор);
	Запрос.УстановитьПараметр("ПериодНачисления", ПараметрыОперации.ПериодНачисления);
	Запрос.УстановитьПараметр("Абонент", ДанныеДокумента.Абонент);
	Запрос.УстановитьПараметр("период", ДанныеДокумента.период);
	Запрос.УстановитьПараметр("МКД", ДанныеДокумента.МКД);
	Запрос.УстановитьПараметр("Район", ПараметрыОперации.Район);
	Запрос.УстановитьПараметр("Организация", ПараметрыОперации.Организация);
	
	
	Результат 			= Запрос.Выполнить();
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаАвансыИспользованные.Добавить(), Выборка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	&Абонент КАК Абонент,
	|	&период КАК Период,
	|	&ПериодНачисления КАК ПериодРасчета,
	|	ИСТИНА КАК Активность,
	|	энргОплатаУслуг.Услуга КАК Услуга,
	|	энргОплатаУслуг.Поставщик КАК Поставщик,
	|	&ИсточникПоступления КАК ИсточникПоступления,
	|	энргОплатаУслуг.ПериодНачисления КАК ПериодНачисления,
	|	-энргОплатаУслуг.Сумма КАК Сумма,
	//|	энргОплатаУслуг.Разделитель КАК Разделитель
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОплатаУслуг КАК энргОплатаУслуг
	|		ПО энргПерерасчетКорректировкаОплаты.ДокументОплаты = энргОплатаУслуг.Регистратор
	|			И (энргОплатаУслуг.Абонент = &Абонент)
	|			И (энргПерерасчетКорректировкаОплаты.УслугаБыло = энргОплатаУслуг.Услуга
	|				ИЛИ энргПерерасчетКорректировкаОплаты.УслугаБыло = ЗНАЧЕНИЕ(Справочник.энргвидыуслуг.пустаяссылка))
	|			И (энргПерерасчетКорректировкаОплаты.ПоставщикБыло = энргОплатаУслуг.Поставщик
	|				ИЛИ энргПерерасчетКорректировкаОплаты.ПоставщикБыло = ЗНАЧЕНИЕ(Справочник.энргконтрагенты.пустаяссылка))
	|			И энргПерерасчетКорректировкаОплаты.Разделитель = энргОплатаУслуг.Разделитель
	|			И (энргОплатаУслуг.Сумма > 0)
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Регистратор);
	Запрос.УстановитьПараметр("ПериодНачисления", ПараметрыОперации.ПериодНачисления);
	Запрос.УстановитьПараметр("Абонент", ДанныеДокумента.Абонент);
	Запрос.УстановитьПараметр("период", ДанныеДокумента.период);
	Запрос.УстановитьПараметр("МКД", ДанныеДокумента.МКД);
	Запрос.УстановитьПараметр("Район", ПараметрыОперации.Район);
	Запрос.УстановитьПараметр("Организация", ПараметрыОперации.Организация);
	Запрос.УстановитьПараметр("ИсточникПоступления", ДанныеДокумента.ИсточникПоступления);
	
	
	Результат 			= Запрос.Выполнить();
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОплатаУслуг.Добавить(), Выборка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&МКД КАК МКД,
	|	&Абонент КАК Абонент,
	|	&период КАК Период,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ИСТИНА КАК Активность,
	|	ЕСТЬNULL(энргАвансыОстатки.СуммаОстаток, 0) КАК Сумма,
	|	энргПерерасчетКорректировкаОплаты.ДокументОплаты КАК ДокументОплаты,
	|	ЕСТЬNULL(энргАвансыОстатки.Разделитель, энргПерерасчетКорректировкаОплаты.Разделитель) КАК Разделитель
	|ИЗ
	|	Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргАвансы.Остатки(&Период, ) КАК энргАвансыОстатки
	|		ПО энргПерерасчетКорректировкаОплаты.ДокументОплаты = энргАвансыОстатки.ДокументОплаты
	|			И (энргАвансыОстатки.Абонент = &Абонент)
	|			И энргПерерасчетКорректировкаОплаты.Разделитель = энргАвансыОстатки.Разделитель
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка";
	                                                          		
	Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Регистратор);
	Запрос.УстановитьПараметр("ПериодНачисления", ПараметрыОперации.ПериодНачисления);
	Запрос.УстановитьПараметр("Абонент", ДанныеДокумента.Абонент);
	Запрос.УстановитьПараметр("период", ДанныеДокумента.период);
	Запрос.УстановитьПараметр("МКД", ДанныеДокумента.МКД);
	Запрос.УстановитьПараметр("Район", ПараметрыОперации.Район);
	Запрос.УстановитьПараметр("Организация", ПараметрыОперации.Организация);
	
	
	Результат 			= Запрос.Выполнить();
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = ТаблицаАвансы.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
		Стр.ВидДвижения = ВидДвиженияНакопления.Расход;
		ПараметрыОперации.СуммаАванса = ПараметрыОперации.СуммаАванса - Выборка.Сумма;
		
		МассивДляУдаления = Новый Массив;
		Для Каждого ТекСтрока Из ПараметрыОперации.Авансы Цикл
			Если ТекСтрока.ДокументОплаты = Выборка.ДокументОплаты и ТекСтрока.Разделитель = Выборка.Разделитель Тогда 
				ТекСтрока.СуммаАванса = ТекСтрока.СуммаАванса - Выборка.Сумма;
				
				Если ТекСтрока.ЖивыеДеньги Тогда
					ПараметрыОперации.СуммаАвансаЖивымиДеньгами	= ПараметрыОперации.СуммаАвансаЖивымиДеньгами - Выборка.Сумма;	
				КонецЕсли;
				
				Если ТекСтрока.СуммаАванса = 0 Тогда
					МассивДляУдаления.Добавить(ТекСтрока);									
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрока Из МассивДляУдаления Цикл
			ПараметрыОперации.Авансы.Удалить(ПараметрыОперации.Авансы.Найти(ТекСтрока));
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УвеличитьАванс(ПараметрыОперации, ДанныеДокумента, Сумма, ЖивыеДеньги)
		
	ТаблицаАвансы 									= ДанныеДокумента.НаборТаблиц.энргАвансы;
	
	ЗаписьАвансы  									= ТаблицаАвансы.добавить();
	ЗаписьАвансы.ВидДвижения 						= ВидДвиженияНакопления.Приход;
	ЗаписьАвансы.Активность  						= истина;
	ЗаписьАвансы.Период  							= ДанныеДокумента.Период;	
	ЗаписьАвансы.МКД	  							= ДанныеДокумента.МКД;
	ЗаписьАвансы.Абонент  							= ДанныеДокумента.Абонент;
	ЗаписьАвансы.ДокументОплаты						= ДанныеДокумента.Регистратор;
	ЗаписьАвансы.Сумма 								= Сумма;
	ЗаписьАвансы.Район  							= ПараметрыОперации.Район;
	ЗаписьАвансы.ПериодНачисления					= ПараметрыОперации.ПериодНачисления;
	ЗаписьАвансы.Организация						= ПараметрыОперации.Организация;
	ЗаписьАвансы.Разделитель						= ДанныеДокумента.Разделитель;
	
	ОписаниеАванса 									= ОписаниеАванса();
	ОписаниеАванса.СуммаАванса 						= Сумма;
	ОписаниеАванса.ДокументОплаты 					= ДанныеДокумента.Регистратор;
	ОписаниеАванса.Разделитель	 					= ДанныеДокумента.Разделитель;
	ОписаниеАванса.ЖивыеДеньги						= ЖивыеДеньги;
	мАвансы 										= ПараметрыОперации.Авансы;
	мАвансы.Добавить(ОписаниеАванса);
	
	Если ПараметрыОперации.свойство("СнятьТекущие") тогда
		ТаблицаАвансыИспользованные					= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
		ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.добавить();
		ЗаписьАвансыИспользованные.Активность  		= истина;
		ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;		
		ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
		ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
		ЗаписьАвансыИспользованные.Сумма 			= -Сумма;
		//ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
		ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
		ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
		ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
		ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
		ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.Услуга;
		//ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
		ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
		ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
		ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
	Иначе			
		ТаблицаАвансыПоступившие  					= ДанныеДокумента.НаборТаблиц.энргАвансыПоступившие;
		ЗаписьАвансыПоступившие						= ТаблицаАвансыПоступившие.добавить();
		ЗаписьАвансыПоступившие.Активность  		= истина;
		ЗаписьАвансыПоступившие.Период  			= ДанныеДокумента.Период;		
		ЗаписьАвансыПоступившие.МКД	  				= ДанныеДокумента.МКД;
		ЗаписьАвансыПоступившие.Абонент  			= ДанныеДокумента.Абонент;
		ЗаписьАвансыПоступившие.Кассир				= ДанныеДокумента.Кассир;
		ЗаписьАвансыПоступившие.ИсточникПоступления	= ДанныеДокумента.ИсточникПоступления;
		ЗаписьАвансыПоступившие.Сумма 				= Сумма;
		ЗаписьАвансыПоступившие.Район  				= ПараметрыОперации.Район;
		ЗаписьАвансыПоступившие.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
		ЗаписьАвансыПоступившие.Организация			= ПараметрыОперации.Организация;
		ЗаписьАвансыПоступившие.Разделитель			= ДанныеДокумента.Разделитель;
	КонецЕсли;  	 
	
КонецПроцедуры

Функция ОписаниеАванса()
	
	Возврат Новый Структура("ДокументОплаты, Разделитель, ЖивыеДеньги, СуммаАванса");
	
КонецФункции

#КонецОбласти
	
#КонецОбласти

#Область СозданиеТаблицЗадолженности

Процедура СоздатьТаблицыРасшифровок()
	
	РасшифровкаНачисленийВспомогательная = Новый ТаблицаЗначений;
	Колонки = РасшифровкаНачисленийВспомогательная.Колонки;
	Колонки.Добавить("ПериодРасчета"					, Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Колонки.Добавить("Услуга"							, Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	Колонки.Добавить("ПорядокПериодРасчета"				, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ПорядокПросуженнойЗадолженности"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ПорядокПогашенияУслугиПриПропорциональномРаспределении"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ПорядокПогашенияУслуги"			, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("СуммаНачислений"					, Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	Колонки.Добавить("Поставщик"						, Новый ОписаниеТипов("СправочникСсылка.энргКонтрагенты"));
	Колонки.Добавить("ПорядокУслугТолькоЖивымиДеньгами"	, Новый ОписаниеТипов("Число"));
	
	РасшифровкаЗадолженностиВспомогательная = Новый ТаблицаЗначений;
	Колонки = РасшифровкаЗадолженностиВспомогательная.Колонки;
	Колонки.Добавить("ПорядокПериодРасчета"				, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ПорядокПогашенияУслуги"			, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ПорядокПросуженнойЗадолженности"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ПорядокПогашенияУслугиПриПропорциональномРаспределении"	, Новый ОписаниеТипов("Число"));
	Колонки.Добавить("Услуга"							, Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	Колонки.Добавить("ПериодРасчета"					, Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Колонки.Добавить("СуммаЗадолженности"				, Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	Колонки.Добавить("Поставщик"						, Новый ОписаниеТипов("СправочникСсылка.энргКонтрагенты"));
	Колонки.Добавить("ПорядокУслугТолькоЖивымиДеньгами"	, Новый ОписаниеТипов("Число"));
	
КонецПроцедуры
	
#КонецОбласти

#Область ЗаполнениеТаблицЗадолженности

Функция ЗаполнитьТаблицуЗадолженностьНаГраницу(АбонентОбхода)
	перем ТекПериодыЗадолженность,ТекУслуга,ЗадолженностьУслуга;
	
	РасшифровкаЗадолженностиВспомогательная.Очистить();
	
	ОписаниеЗадолженности 	= ОписаниеЗадолженности();	
	ЗадолженностьВсего 		= 0;	
	ЕстьПоставщик 			= ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаЗадолженность, "Поставщик");
	
	Если АбонентОбхода = ВыборкаЗадолженность.Абонент тогда		
		Пока АбонентОбхода = ВыборкаЗадолженность.Абонент цикл 			
			Если ЗначениеЗаполнено(ВыборкаЗадолженность.Услуга)
				И (ЕстьПоставщик И ЗначениеЗаполнено(ВыборкаЗадолженность.Поставщик) Или Не ЕстьПоставщик) 
				И ЗначениеЗаполнено(ВыборкаЗадолженность.ПериодРасчета) Тогда 				
				
				СтрокаЗадолженности = РасшифровкаЗадолженностиВспомогательная.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗадолженности, ВыборкаЗадолженность);
				СтрокаЗадолженности.СуммаЗадолженности	= ВыборкаЗадолженность.ЗадолженностьНачалоПериода;
				ЗадолженностьВсего 						= ЗадолженностьВсего + ВыборкаЗадолженность.ЗадолженностьНачалоПериода;
				
			КонецЕсли;
			
			Если НЕ ВыборкаЗадолженность.Следующий() тогда
				Прервать;
			КонецЕсли; 
			
		КонецЦикла;				  
	КонецЕсли; 	
	
	ДанныеЗадолженности  					= Новый Структура(ОписаниеЗадолженности);
	ДанныеЗадолженности.СуммаЗадолженности 	= ЗадолженностьВсего;
	ДанныеЗадолженности.Расшифровка 		= РасшифровкаЗадолженностиВспомогательная;
	
	Возврат ДанныеЗадолженности;
КонецФункции

Функция ЗаполнитьТаблицуНачисленоВПериоде(АбонентОбхода)
	перем ТекРасшифровкаНачислений;	
		
	РасшифровкаНачисленийВспомогательная.Очистить();
	
	ОписаниеНачислений  	= Новый ФиксированнаяСтруктура("СуммаНачислений,Расшифровка");
	СуммаНачислений 		= 0;
	ТекДокументНачисления 	= Неопределено;
	
	ДанныеНачислений  		= Новый Соответствие;
	
	Если АбонентОбхода  = ВыборкаДанныеНачислений.Абонент тогда		
		Пока АбонентОбхода = ВыборкаДанныеНачислений.Абонент цикл 			
			
			Если НЕ ТекДокументНачисления = ВыборкаДанныеНачислений.ДокРегистратор Тогда
				Если НЕ ТекДокументНачисления = Неопределено Тогда
					
					текОписаниеНачислений = Новый Структура(ОписаниеНачислений);
					текОписаниеНачислений.СуммаНачислений 	= СуммаНачислений;
					текОписаниеНачислений.Расшифровка 		= ТекРасшифровкаНачислений;
					ДанныеНачислений.Вставить(ТекДокументНачисления, текОписаниеНачислений);
					
				КонецЕсли;				
				
				ТекРасшифровкаНачислений 	= РасшифровкаНачисленийВспомогательная.Скопировать();
				СуммаНачислений 			= 0;
				
			КонецЕсли;
						
			СтрокаНачисления = ТекРасшифровкаНачислений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНачисления, ВыборкаДанныеНачислений);
			//СтрокаНачисления.ПорядокПериодРасчета 	= ВыборкаДанныеНачислений.ПорядокПериодРасчета;
			//СтрокаНачисления.ПериодРасчета 			= ВыборкаДанныеНачислений.ПериодРасчета;			
			//СтрокаНачисления.Услуга		 			= ВыборкаДанныеНачислений.Услуга;
			//СтрокаНачисления.Поставщик 				= ВыборкаДанныеНачислений.Поставщик;
			//СтрокаНачисления.СуммаНачислений		= ВыборкаДанныеНачислений.СуммаНачислений;
			СуммаНачислений 						= СуммаНачислений + ВыборкаДанныеНачислений.СуммаНачислений;
			ТекДокументНачисления 					= ВыборкаДанныеНачислений.ДокРегистратор;
			
			Если не ВыборкаДанныеНачислений.Следующий() тогда
				Прервать;
			КонецЕсли;  				
		КонецЦикла;				  
	КонецЕсли; 	
	
	Если НЕ ТекДокументНачисления = Неопределено Тогда
		
		текОписаниеНачислений 					= Новый Структура(ОписаниеНачислений);
		текОписаниеНачислений.СуммаНачислений 	= СуммаНачислений;
		текОписаниеНачислений.Расшифровка 		= ТекРасшифровкаНачислений;
		
		ДанныеНачислений.Вставить(ТекДокументНачисления, текОписаниеНачислений);
		
	КонецЕсли;
	
	Возврат ДанныеНачислений; 
	
КонецФункции
	
#КонецОбласти

Функция ОписаниеЗадолженности()
	
	Возврат Новый ФиксированнаяСтруктура("СуммаЗадолженности,Расшифровка");	
	
КонецФункции

#КонецОбласти