#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();	
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
		
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	

	Пакет = ПолучитьДанные();	
	ДанныеСНТДНТ = Пакет[0]; 
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеСНТДНТ,	Движения.энргТочкиПоставкиСНТ);	
	
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(СНТДНТПотребление) 
		И Не ЗначениеЗаполнено(ТочкаПоставкиЮЛПотребление) Тогда 
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Параметр ""Точка поставки ЮЛ (потребление)"" не заполнен. 
		|Если объемы Абонента не должны вычитаться из объемов ЮЛ, то параметр ""СНТ/ДНТ (потребление)"" не должен быть заполнен.");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СНТДНТПривязан) 
		и НЕ ЗначениеЗаполнено(СНТДНТПотребление) Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Параметр ""СНТ/ДНТ (потребление)"" не заполнен.");
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанные()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДокументы", Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.СНТДНТПривязан КАК СНТДНТПривязан,
	|	Шапка.СНТДНТПотребление КАК СНТДНТПотребление,
	|	Шапка.ТочкаПоставкиЮЛПотребление КАК ТочкаПоставки
	|ИЗ
	|	Документ.энргИзменениеПодключенияАбонентовСНТДНТ КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)";
	
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли