#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ	= ОбменДанными.Загрузка;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДанныеШапки						= ДанныеШапки();
	Движения.энргТипСобственностиАбонентов.Записывать = Истина;
	
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьТипСобственностиЖилья(ДанныеШапки,Движения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	//ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("ТипСобственностиЖилья",	ТипСобственностиЖилья);
	ДанныеШапки.Вставить("Документ",				Ссылка);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("НомерДоговораСоцНайма",	НомерДоговораСоцНайма);
	ДанныеШапки.Вставить("ДатаДоговораСоцНайма",	ДатаДоговораСоцНайма);
	
	Возврат ДанныеШапки;
КонецФункции

#КонецОбласти

#КонецЕсли