
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьКнопки();
	НастроитьВидимостьИДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьКартуМаршрута(Команда)
	бестБизнесПроцессДоговорногоБлока.ОткрытьКартуМаршрута(Объект.БизнесПроцесс);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	ПринятьКИсполнениюНаСервере();
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ТиповаяОбработкаКоманд(Команда)
	
	ВыполнитьКомандуЗадачи(Сред(Команда.Имя, 5));
	
	Если Объект.Выполнена Тогда
		ВладелецФормы.Обновить();
		Модифицированность = Ложь;
		Закрыть();
	//Иначе
	//	НастроитьВидимостьИДоступность();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ПринятьКИсполнениюНаСервере()
	ТекОбъект	= РеквизитФормыВЗначение("Объект");
	ТекОбъект.ПринятьКИсполнению();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	НастроитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьИДоступность()
	ТекПользователь = Пользователи.ТекущийПользователь();
	 Если Объект.Выполнена ИЛИ НЕ бестБизнесПроцессДоговорногоБлока.ПроверитьДоступностьЗадачиДляПользователя(Объект.Ссылка, ТекПользователь) Тогда
		ТолькоПросмотр	= Истина;
	Иначе
		Элементы.ГруппаКнопок.Доступность				= Объект.Исполнитель = ТекПользователь;
		Элементы.ОтправляемыеФайлыФайл.ТолькоПросмотр   = Объект.Исполнитель <> ТекПользователь;
	КонецЕсли;
	Элементы.ФормаПринятьКИсполнению.Видимость 		= НЕ ЗначениеЗаполнено(Объект.Исполнитель);
	Элементы.Результат.Видимость 					= Объект.Выполнена;
	Элементы.ФактическийСрокИсполнения.Видимость	= Объект.Выполнена;
	Элементы.ОбъектЗадачи.Видимость					= ЗначениеЗаполнено(Объект.ОбъектЗадачи);
	
	Если Команды.Найти("бестОтправитьПоЭлПочтеСмс") <> Неопределено Тогда
		Элементы.ОтправляемыеФайлы.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьКнопки()
		
	МассивКнопок	= Задачи.бестЗадачаДоговорногоБлока.ПолучитьМассивКнопок(Объект.БизнесПроцесс, Объект.ТочкаМаршрута);
	Для Каждого СтруктураКнопки Из МассивКнопок Цикл
		НоваяКоманда	= Команды.Добавить("бест" + СтруктураКнопки.ИмяКнопки);
		НоваяКоманда.Заголовок					= СтруктураКнопки.Заголовок;
		НоваяКоманда.ИзменяетСохраняемыеДанные	= Истина;
		НоваяКоманда.Действие					= "ТиповаяОбработкаКоманд";
		НоваяКнопка						= Элементы.Добавить(СтруктураКнопки.ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаКнопок);
		НоваяКнопка.Вид					= ВидКнопкиФормы.ОбычнаяКнопка;
		НоваяКнопка.Заголовок			= СтруктураКнопки.Заголовок;
		НоваяКнопка.КнопкаПоУмолчанию	= МассивКнопок.Найти(СтруктураКнопки) = 0;
		НоваяКнопка.ИмяКоманды			= "бест" + СтруктураКнопки.ИмяКнопки;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуЗадачи(ИмяКоманды)
	ТекОбъект	= РеквизитФормыВЗначение("Объект");
	ТекОбъект.ВыполнитьКомандуЗадачи(ИмяКоманды);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры
#КонецОбласти
