#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Ответственный 		= Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ЗаписатьДанныеМКД();
	
	ЗаписатьДанныеТочекУчета();
	ЗаписатьВидДифференцированностиПриборовУчета();
	ЗаписатьПоказанияПриборовУчета();
	ЗаписатьЗначенияПлощадей();
	
	ЗаписьВРСОтложенныеДвиженияДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСДаннымиМКД

Процедура ЗаписатьДанныеМКД()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковМКД.Организация КАК Организация,
	|	энргВводНачальныхОстатковМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатковМКД.Район КАК Район,
	|	энргВводНачальныхОстатковМКДДома.МКД КАК МКД,
	|	энргВводНачальныхОстатковМКДДома.ДатаОткрытияМКД КАК Дата,
	|	энргВводНачальныхОстатковМКДДома.ФормаУправления КАК ФормаУправления,
	|	энргВводНачальныхОстатковМКДДома.УК КАК УК,
	|	энргВводНачальныхОстатковМКДДома.бестПостановление КАК бестПостановление,
	|	энргВводНачальныхОстатковМКДДома.ТипСхемыГВС КАК ТипСхемыГВС,
	|	энргВводНачальныхОстатковМКДДома.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	энргВводНачальныхОстатковМКДДома.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргВводНачальныхОстатковМКД.Дата КАК ПериодРегистрации,
	|	энргВводНачальныхОстатковМКДДома.КоличествоЭтажей КАК КоличествоЭтажей,
	|	энргВводНачальныхОстатковМКДДома.Бойлер КАК Бойлер
	|ИЗ
	|	Документ.энргВводНачальныхОстатковМКД.Дома КАК энргВводНачальныхОстатковМКДДома
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД КАК энргВводНачальныхОстатковМКД
	|		ПО энргВводНачальныхОстатковМКДДома.Ссылка = энргВводНачальныхОстатковМКД.Ссылка
	|			И (энргВводНачальныхОстатковМКДДома.Ссылка = &Ссылка)
	|			И (энргВводНачальныхОстатковМКД.Ссылка = &Ссылка)";
	
	Результат 		= Запрос.Выполнить();
	Выборка 		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		УстановитьФормуУправления(Выборка);
		УстановитьВидБлагоустроства(Выборка);
		УстановитьЭтажность(Выборка);
		УстановитьРабочиеПостановления(Выборка);
		УстановитьТипСхемыГВС(Выборка);				
		УстановитьТипПринадлежности(Выборка);
		УстановитьСостояниеМКД(Выборка);
		УстановитьБойлер(Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьФормуУправления(Выборка)	
	Запись  					= Движения.энргФормыУправленияМКД.добавить();
	Запись.Период  				= Выборка.Дата;
	Запись.Район  				= Выборка.Район;
	Запись.Организация  		= Выборка.Организация;
	Запись.МКД	 				= Выборка.МКД;
	Запись.ФормаУправления 		= Выборка.ФормаУправления;
	Запись.УК					= Выборка.УК;
	Запись.ПериодРегистрации	= Дата;
	Запись.ПериодНачисления		= Выборка.ПериодНачисления;	
КонецПроцедуры

Процедура УстановитьВидБлагоустроства(Выборка)
	Запись  						= Движения.энргВидБлагоустройствМКД.добавить();
	Запись.Период  					= Выборка.Дата;
	Запись.Район 					= Выборка.Район;
	Запись.Организация  			= Выборка.Организация;
	Запись.МКД 						= Выборка.МКД;
	Запись.ВидБлагоустройства 		= Выборка.ВидБлагоустройства;
	Запись.ПериодРегистрации		= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления			= Выборка.ПериодНачисления; 	
КонецПроцедуры

Процедура УстановитьЭтажность(Выборка)	
	Запись  					= Движения.энргЭтажностьМКД.добавить();
	Запись.Период  				= Выборка.Дата;
	Запись.Район  				= Выборка.Район;
	Запись.Организация  		= Выборка.Организация;
	Запись.МКД 					= Выборка.МКД;
	Запись.КоличествоЭтажей 	= Выборка.КоличествоЭтажей;
	Запись.ПериодРегистрации	= Дата;
	Запись.ПериодНачисления		= Выборка.ПериодНачисления;	
КонецПроцедуры

Процедура УстановитьРабочиеПостановления(Выборка)
	Запись  					= Движения.бестРабочиеПостановленияМКД.добавить();
	Запись.Период  				= Выборка.Дата;
	Запись.Район  				= Выборка.Район;
	Запись.Организация  		= Выборка.Организация;
	Запись.МКД 					= Выборка.МКД;
	Запись.Постановление 		= Выборка.бестПостановление;
	Запись.ПериодРегистрации	= Дата;
	Запись.ПериодНачисления		= Выборка.ПериодНачисления;
КонецПроцедуры

Процедура УстановитьТипСхемыГВС(Выборка)
	Запись  					= Движения.энргТипСхемыГВС.добавить();
	Запись.Период  				= Выборка.Дата;
	Запись.Район  				= Выборка.Район;
	Запись.Организация  		= Выборка.Организация;
	Запись.МКД 					= Выборка.МКД;
	Запись.ТипСхемы				= Выборка.ТипСхемыГВС;
	Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления		= Выборка.ПериодНачисления;
КонецПроцедуры

Процедура УстановитьТипПринадлежности(Выборка)
	
	Запись  						= Движения.энргТипПринадлежностиМКД.добавить();
	Запись.Период  					= Выборка.Дата;
	Запись.Район  					= Выборка.Район;
	Запись.Организация  			= Выборка.Организация;
	Запись.МКД 						= Выборка.МКД;
	Запись.ВидТепловогоПункта  		= Выборка.ВидТепловогоПункта;
	Запись.ПериодРегистрации		= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления			= Выборка.ПериодНачисления;
	
КонецПроцедуры

Процедура УстановитьСостояниеМКД(Выборка)
	
	Запись  				= Движения.энргСостояниеМКД.добавить();
	Запись.Период  			= Выборка.Дата; 
	Запись.Район  			= Выборка.Район;
	Запись.Организация  	= Выборка.Организация;
	Запись.МКД  			= Выборка.МКД;
	Запись.Состояние 		= Истина;
	
КонецПроцедуры

Процедура УстановитьБойлер(Выборка)
	Запись  				= Движения.энргНаличиеБойлера.добавить();
	Запись.Период  			= Выборка.Дата; 
	Запись.Район  			= Выборка.Район;
	Запись.Организация  	= Выборка.Организация;
	Запись.МКД  			= Выборка.МКД;
	Запись.Бойлер	 		= Выборка.Бойлер;	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДаннымиТочекУчета

Процедура ЗаписатьДанныеТочекУчета()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковМКД.Организация КАК Организация,
	|	энргВводНачальныхОстатковМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатковМКД.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодУслуги КАК ПериодУслуги,
	|	ВложенныйЗапрос.ДатаПриемки КАК ДатаПриемки,
	|	энргВводНачальныхОстатковМКД.Дата КАК ПериодРегистрации,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.НомерПломбы КАК НомерПломбы,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковМКДДома.МКД КАК МКД,
	|		энргВводНачальныхОстатковМКДТочкиУчета.ДатаПодключенияУслуги КАК ПериодУслуги,
	|		энргВводНачальныхОстатковМКДТочкиУчета.ДатаВводПрибораУчета КАК ДатаПриемки,
	|		энргВводНачальныхОстатковМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргВводНачальныхОстатковМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		энргВводНачальныхОстатковМКДТочкиУчета.Услуга КАК Услуга,
	|		энргВводНачальныхОстатковМКДТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|		ВЫБОР
	|			КОГДА энргВводНачальныхОстатковМКДТочкиУчета.КоэффициентПУ = 0
	|				ТОГДА 1
	|			ИНАЧЕ энргВводНачальныхОстатковМКДТочкиУчета.КоэффициентПУ
	|		КОНЕЦ КАК КоэффициентПУ,
	|		энргВводНачальныхОстатковМКДТочкиУчета.НомерПломбы КАК НомерПломбы,
	|		энргВводНачальныхОстатковМКДТочкиУчета.ДатаПоверки КАК ДатаПоверки
	|	ИЗ
	|		Документ.энргВводНачальныхОстатковМКД.ТочкиУчета КАК энргВводНачальныхОстатковМКДТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД.Дома КАК энргВводНачальныхОстатковМКДДома
	|			ПО энргВводНачальныхОстатковМКДТочкиУчета.IDСтрокиМКД = энргВводНачальныхОстатковМКДДома.IDСтроки
	|				И (энргВводНачальныхОстатковМКДТочкиУчета.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковМКДДома.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД КАК энргВводНачальныхОстатковМКД
	|		ПО (энргВводНачальныхОстатковМКД.Ссылка = &Ссылка)";
	
	Результат 		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		УстановитьВладельцаТочкиУчета(Выборка);
		УстановитьАктивностьТочек(Выборка);
		УстановитьУслугиТочекУчета(Выборка);
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			УстановитьПриборыТочекУчета(Выборка);
			УстановитьСостояниеПрибораУчета(Выборка);
			ЗаписатьКоэффициентПУ(Выборка);
			УстановитьНомерПломбыПрибораУчета(Выборка);		
			ЗаписатьДатуПоверки(Выборка);
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВладельцаТочкиУчета(Выборка)
	
	Запись 						= Движения.энргВладельцыТочекУчета.Добавить();
	Запись.Период  				= Выборка.ПериодУслуги;
	Запись.Район  				= Выборка.район;
	Запись.Организация  		= Выборка.Организация;
	Запись.ТочкаУчета 			= Выборка.ТочкаУчета;
	Запись.АбонентВладелец 		= Выборка.МКД;
	Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	
КонецПроцедуры

Процедура УстановитьАктивностьТочек(Выборка)
	
	Запись 						= Движения.энргАктивностьТочекУчетаМКД.Добавить();
	Запись.Период  				= Выборка.ПериодУслуги;
	Запись.Район  				= Выборка.район;
	Запись.Организация  		= Выборка.Организация;
	Запись.МКД	 				= Выборка.МКД;
	Запись.ТочкаУчета 			= Выборка.ТочкаУчета;
	Запись.Состояние 			= Перечисления.энргСостояниеТочекУчета.Включена;
//	Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
//	Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	
КонецПроцедуры

Процедура УстановитьУслугиТочекУчета(Выборка)
	
	Запись 						= Движения.энргУслугиТочекУчетаМКД.Добавить();
	Запись.Период  				= Выборка.ПериодУслуги;
	Запись.Район  				= Выборка.район;
	Запись.Организация  		= Выборка.Организация;
	Запись.МКД	 				= Выборка.МКД;
	Запись.ТочкаУчета 			= Выборка.ТочкаУчета;
	Запись.Услуга 				= Выборка.Услуга;
	Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	
КонецПроцедуры

Процедура УстановитьПриборыТочекУчета(Выборка)
	
	Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда 
		Запись  					= Движения.энргПриборыТочекМКД.Добавить();
		Запись.Период  				= Выборка.ДатаПриемки;
		Запись.Район  				= Выборка.район;
		Запись.Организация  		= Выборка.Организация;
		Запись.МКД	 				= Выборка.МКД;
		Запись.ТочкаУчета 			= Выборка.ТочкаУчета;
		Запись.ПриборУчета 			= Выборка.ПриборУчета; 
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСостояниеПрибораУчета(Выборка)
	
	Запись  					= Движения.энргСостояниеПриборовМКД.добавить();
	Запись.Период  				= Выборка.ДатаПриемки;
	Запись.Район 				= Выборка.Район;
	Запись.Организация			= Выборка.Организация;
	Запись.МКД	 				= Выборка.МКД;
	Запись.ТочкаУчета			= Выборка.ТочкаУчета;
	Запись.ПриборУчета 			= Выборка.ПриборУчета;  
	Запись.Состояние 			= Перечисления.энргСостояниеПриборовУчета.Ввод;
	Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
	Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	
КонецПроцедуры

Процедура ЗаписатьКоэффициентПУ(Выборка)
	
	Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
		Запись  					= Движения.энргКоэффциентыПриборовУчета.добавить();
		Запись.Период  				= Выборка.ДатаПриемки;
		Запись.Организация	 		= Выборка.Организация;
		Запись.Район	 			= Выборка.Район;
		Запись.ПриборУчета 			= Выборка.ПриборУчета;
		Запись.КлючПомещения		= Выборка.МКД;
		Запись.Коэффициент 			= Выборка.КоэффициентПУ;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;  
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьНомерПломбыПрибораУчета(Выборка)
	
	Если ЗначениеЗаполнено(Выборка.ПриборУчета) и  ЗначениеЗаполнено(Выборка.НомерПломбы) Тогда
		Запись  					= Движения.энргНомерПломбПриборовУчетаМКД.добавить();
		Запись.Период				= Выборка.ДатаПриемки;
		Запись.Район  				= Выборка.Район;
		Запись.Организация			= Выборка.Организация;
		Запись.МКД		  			= Выборка.МКД;
		Запись.ПриборУчета			= Выборка.ПриборУчета;
		Запись.НомерПломбы			= Выборка.НомерПломбы;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;			
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;  
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаписатьДатуПоверки(Выборка)
	  	
	Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
		Запись  					= Движения.энргДатыПоверкиПрибораУчета.добавить();
		Запись.Период  				= Выборка.ДатаПриемки;
		Запись.Район  				= Выборка.Район;
		Запись.Организация	 		= Выборка.Организация;
		Запись.КлючПомещения		= Выборка.МКД;
		Запись.ПриборУчета 			= Выборка.ПриборУчета;
		Запись.ДатаПоверки 			= Выборка.ДатаПоверки;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления; 
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоШкаламиТарифнымиЗонами

Процедура ЗаписатьВидДифференцированностиПриборовУчета()
	
	Запрос  = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковМКД.Организация КАК Организация,
	|	энргВводНачальныхОстатковМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатковМКД.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВводНачальныхОстатковМКД.Дата КАК Дата,
	|	энргВводНачальныхОстатковМКД.Дата КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаПриемки КАК ДатаПриемки
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковМКДДома.МКД КАК МКД,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		ВложенныйЗапрос.ДатаПриемки КАК ДатаПриемки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргВводНачальныхОстатковМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			энргВводНачальныхОстатковМКДШкалыПриборовУчета.Шкала КАК Шкала,
	|			энргВводНачальныхОстатковМКДШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|			энргВводНачальныхОстатковМКДТочкиУчета.IDСтрокиМКД КАК IDСтрокиМКД,
	|			энргВводНачальныхОстатковМКДТочкиУчета.ДатаВводПрибораУчета КАК ДатаПриемки
	|		ИЗ
	|			Документ.энргВводНачальныхОстатковМКД.ТочкиУчета КАК энргВводНачальныхОстатковМКДТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД.ШкалыПриборовУчета КАК энргВводНачальныхОстатковМКДШкалыПриборовУчета
	|				ПО энргВводНачальныхОстатковМКДТочкиУчета.IDСтроки = энргВводНачальныхОстатковМКДШкалыПриборовУчета.IDСтрокиТочкиУчета
	|					И (энргВводНачальныхОстатковМКДТочкиУчета.Ссылка = &Ссылка)
	|					И (энргВводНачальныхОстатковМКДШкалыПриборовУчета.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД.Дома КАК энргВводНачальныхОстатковМКДДома
	|			ПО (энргВводНачальныхОстатковМКДДома.Ссылка = &Ссылка)
	|				И ВложенныйЗапрос.IDСтрокиМКД = энргВводНачальныхОстатковМКДДома.IDСтроки) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД КАК энргВводНачальныхОстатковМКД
	|		ПО (энргВводНачальныхОстатковМКД.Ссылка = &Ссылка)";
	
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл		
		Запись 							= Движения.энргВидыДифференцированностиПриборовУчетаМКД.Добавить();
		Запись.Период  					= Выборка.ДатаПриемки;
		Запись.Район  					= Выборка.Район;
		Запись.Организация				= Выборка.Организация;
		Запись.МКД		  				= Выборка.МКД;
		Запись.ПриборУчета 				= Выборка.ПриборУчета;
		Запись.Шкала 					= Выборка.Шкала;
		Запись.ВидДифференцированности	= Выборка.ВидДифференцированности;
		Запись.ПериодРегистрации		= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления			= Выборка.ПериодНачисления;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьПоказанияПриборовУчета()
	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.IDСтрокиМКД КАК IDСтрокиМКД,
	|	ВложенныйЗапрос.ПериодПоказаний КАК ПериодПоказаний,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	энргВводНачальныхОстатковМКД.Организация КАК Организация,
	|	энргВводНачальныхОстатковМКД.Район КАК Район,
	|	энргВводНачальныхОстатковМКД.Дата КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргВводНачальныхОстатковМКД.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.IDСтрокиМКД КАК IDСтрокиМКД,
	|		ВложенныйЗапрос.ПериодПоказаний КАК ПериодПоказаний,
	|		энргВводНачальныхОстатковМКДДома.МКД КАК МКД,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргВводНачальныхОстатковМКДТочкиУчета.IDСтрокиМКД КАК IDСтрокиМКД,
	|			ВложенныйЗапрос.ПериодПоказаний КАК ПериодПоказаний,
	|			энргВводНачальныхОстатковМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.Шкала КАК Шкала,
	|			ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|			ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|			энргВводНачальныхОстатковМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргВводНачальныхОстатковМКДШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|				энргВводНачальныхОстатковМКДПоказанияПриборовУчета.ДатаПоказаний КАК ПериодПоказаний,
	|				энргВводНачальныхОстатковМКДШкалыПриборовУчета.Шкала КАК Шкала,
	|				энргВводНачальныхОстатковМКДПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|				энргВводНачальныхОстатковМКДПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания
	|			ИЗ
	|				Документ.энргВводНачальныхОстатковМКД.ПоказанияПриборовУчета КАК энргВводНачальныхОстатковМКДПоказанияПриборовУчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД.ШкалыПриборовУчета КАК энргВводНачальныхОстатковМКДШкалыПриборовУчета
	|					ПО энргВводНачальныхОстатковМКДПоказанияПриборовУчета.IDСтроки = энргВводНачальныхОстатковМКДШкалыПриборовУчета.IDСтроки
	|						И энргВводНачальныхОстатковМКДПоказанияПриборовУчета.Ссылка = энргВводНачальныхОстатковМКДШкалыПриборовУчета.Ссылка
	|						И (энргВводНачальныхОстатковМКДПоказанияПриборовУчета.Ссылка = &Ссылка)
	|						И (энргВводНачальныхОстатковМКДШкалыПриборовУчета.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД.ТочкиУчета КАК энргВводНачальныхОстатковМКДТочкиУчета
	|				ПО ВложенныйЗапрос.IDСтрокиТочкиУчета = энргВводНачальныхОстатковМКДТочкиУчета.IDСтроки
	|					И (энргВводНачальныхОстатковМКДТочкиУчета.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД.Дома КАК энргВводНачальныхОстатковМКДДома
	|			ПО ВложенныйЗапрос.IDСтрокиМКД = энргВводНачальныхОстатковМКДДома.IDСтроки
	|				И (энргВводНачальныхОстатковМКДДома.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД КАК энргВводНачальныхОстатковМКД
	|		ПО (энргВводНачальныхОстатковМКД.Ссылка = &Ссылка)";
	
	Результат  						= Запрос.Выполнить();
	Выборка 						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись 						= Движения.энргПоказанияПриборовУчетаМКД.Добавить();
		Запись.Период 				= Выборка.ПериодПоказаний;
		Запись.Организация			= Выборка.Организация;
		Запись.Район				= Выборка.Район;
		Запись.МКД					= Выборка.МКД;
		Запись.ПриборУчета			= Выборка.ПриборУчета;
		Запись.Шкала				= Выборка.Шкала;
		Запись.ТарифнаяЗона			= Выборка.ТарифнаяЗона;
		Запись.Разделитель			= 0;
		Запись.Показание			= Выборка.ТекущиеПоказания;
		Запись.СостояниеПоказаний	= Перечисления.энргСостояниеПоказаний.Приняты;
		Запись.КС					= Ложь;
		Запись.Переворот			= Ложь;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ТочкаУчета			= Выборка.ТочкаУчета;
		
		Запись 						= Движения.энргМаксимальныеПоказанияМКД.Добавить();
		Запись.Период 				= Выборка.ПериодПоказаний;
		Запись.Организация			= Выборка.Организация;
		Запись.Район				= Выборка.Район;
		Запись.МКД					= Выборка.МКД;
		Запись.ПриборУчета			= Выборка.ПриборУчета;
		Запись.Шкала				= Выборка.Шкала;
		Запись.ТарифнаяЗона			= Выборка.ТарифнаяЗона;
		Запись.Разделитель			= 0;
		Запись.Показание			= Выборка.ТекущиеПоказания;
		Запись.ДатаРегистратора 	= Выборка.ПериодПоказаний;
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

Процедура ЗаписьВРСОтложенныеДвиженияДокументов()
	
	НаборЗаписей 						= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборЗаписей.Записать();   
	
	Запрос  							= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 						=
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргВводНачальныхОстатковМКДДома.МКД
	|ИЗ
	|	Документ.энргВводНачальныхОстатковМКД.Дома КАК энргВводНачальныхОстатковМКДДома
	|ГДЕ
	|	энргВводНачальныхОстатковМКДДома.Ссылка = &Ссылка";
	
	Результат 							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		НоваяЗапись 					= НаборЗаписей.Добавить();	
		НоваяЗапись.ПериодНачисления 	= ПериодНачисления;
		НоваяЗапись.Район 				= Район;
		НоваяЗапись.Организация 		= Организация;
		НоваяЗапись.Строение 			= Выборка.МКД;
		НоваяЗапись.РазделЗаписи 		= Перечисления.энргРазделыЗаписи.СтабильныеПериодыМКД;
		НоваяЗапись.ДокРегистратор 		= Ссылка;
		НоваяЗапись.ДатаРегистратора 	= Дата;	
	КонецЦикла;  	
	
	НаборЗаписей.Записать(ложь);
	
КонецПроцедуры

Процедура ЗаписатьЗначенияПлощадей()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВводНачальныхОстатковМКД.Организация КАК Организация,
	|	энргВводНачальныхОстатковМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргВводНачальныхОстатковМКД.Район КАК Район,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ВидПлощади КАК ВидПлощади,
	|	ВложенныйЗапрос.ЗначениеПлощади КАК Площадь,
	|	энргВводНачальныхОстатковМКД.Дата КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВводНачальныхОстатковМКДЗначениеПлощадей.Период КАК Период,
	|		энргВводНачальныхОстатковМКДДома.МКД КАК МКД,
	|		энргВводНачальныхОстатковМКДЗначениеПлощадей.ВидПлощади КАК ВидПлощади,
	|		энргВводНачальныхОстатковМКДЗначениеПлощадей.ЗначениеПлощади КАК ЗначениеПлощади
	|	ИЗ
	|		Документ.энргВводНачальныхОстатковМКД.ЗначениеПлощадей КАК энргВводНачальныхОстатковМКДЗначениеПлощадей
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД.Дома КАК энргВводНачальныхОстатковМКДДома
	|			ПО энргВводНачальныхОстатковМКДЗначениеПлощадей.IDСтрокиМКД = энргВводНачальныхОстатковМКДДома.IDСтроки
	|				И (энргВводНачальныхОстатковМКДДома.Ссылка = &Ссылка)
	|				И (энргВводНачальныхОстатковМКДЗначениеПлощадей.Ссылка = &Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатковМКД КАК энргВводНачальныхОстатковМКД
	|		ПО (энргВводНачальныхОстатковМКД.Ссылка = &Ссылка)";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 		
		Запись 						= Движения.энргЗначениеПлощадейМКД.Добавить();
		Запись.Период 				= Выборка.Период;
		Запись.Организация 			= Выборка.Организация;
		Запись.Район 				= Выборка.Район;
		Запись.МКД	 				= Выборка.МКД;
		Запись.ВидПлощади 			= Выборка.ВидПлощади;
		Запись.Площадь 				= Выборка.Площадь;
		Запись.ПериодРегистрации 	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления 	= Выборка.ПериодНачисления;		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли