#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Услуга") Тогда
		Услуга 							= Параметры.Услуга;
	КонецЕсли;
	ИспользоватьШкалы 					= энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	ТипыРасходов  						= энргНачисления.ТипыРасходовВФормулахРасчета();
	ТипыКоэффициентов 					= Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("бестБиллингПроект") Тогда
		Модуль 							= ОбщегоНазначения.ОбщийМодуль("бестНачисленияНП");
		ТипыКоэффициентов 				= Модуль.ТипыКоэффициентовВФормулахРасчета();
	КонецЕсли;
	
	Если Параметры.Свойство("ОбщаяНастройка") и Параметры.ОбщаяНастройка Тогда
		Если Параметры.Свойство("СоставУслуги") Тогда
			Для Каждого ЧастьУслуги Из Параметры.СоставУслуги Цикл
				Ключ 					= Новый Структура("ТипРасхода, Услуга", ТипыРасходов["СуммарныйРасходПоУслуге"], XMLСтрока(ЧастьУслуги));
				ПараметрыРасчета.Добавить(ЧастьУслуги.УникальныйИдентификатор(),"СуммарныйРасходПоУслуге - " + ЧастьУслуги,,БиблиотекаКартинок.РегистрНакопления);
			КонецЦикла;		
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("УзелУчета") И Параметры.УзелУчета  Тогда
		Если Параметры.Свойство("ПриборыУчета") Тогда
			ТипРасхода 					= ТипыРасходов["РасходИзмерителяПоШкале"];
			КоллекцияПриборов 			= Параметры.ПриборыУчета;
			Для Сч = 0 По КоллекцияПриборов.ВГраница() Цикл				
				Шкалы 					= КоллекцияПриборов[Сч].Шкалы;
				Для ИндексШкалы = 0 По Шкалы.ВГраница() Цикл 					
					Если ИспользоватьШкалы Тогда
						Представление 	= "РасходИзмерителя - " + КоллекцияПриборов[Сч].ЗаводскойНомер + "("+ Шкалы[ИндексШкалы].ВидПараметра + ")";
						Представление 	= Представление + " по шкале - " + Шкалы[ИндексШкалы].Шкала + "";
					Иначе 
						Представление 	= "РасходИзмерителя - " + КоллекцияПриборов[Сч].ЗаводскойНомер + "("+ КоллекцияПриборов[Сч].ВидПараметра + ")";
					КонецЕсли;
					Ключ 				= Новый Структура("ТипРасхода, Шкала, ВидПараметра", ТипРасхода,XMLСтрока(Шкалы[ИндексШкалы].Шкала), ?(ИспользоватьШкалы, XMLСтрока(Шкалы[ИндексШкалы].ВидПараметра), XMLСтрока(КоллекцияПриборов[Сч].ВидПараметра)));
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),Представление,,БиблиотекаКартинок.РегистрНакопления);

					Ключ 				= Новый Структура("ТипРасхода, Шкала, ВидПараметра", ТипыРасходов["РасходПоШкалеЗаПредПериод"],XMLСтрока(Шкалы[ИндексШкалы].Шкала), ?(ИспользоватьШкалы, XMLСтрока(Шкалы[ИндексШкалы].ВидПараметра), XMLСтрока(КоллекцияПриборов[Сч].ВидПараметра)));
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),СтрЗаменить(Представление, "РасходИзмерителя", "РасходИзмерителяЗаПредыдущийПериод"),,БиблиотекаКартинок.РегистрНакопления);

				КонецЦикла;				 
			КонецЦикла;
			
			Если Параметры.Свойство("СоставУслуги")  Тогда
				Для Каждого ЧастьУслуги Из Параметры.СоставУслуги Цикл
					Представление 		= "ЗначениеНормативаПоУслуге - " + ЧастьУслуги;
					Ключ 				= Новый Структура("ТипРасхода, Услуга", ТипыРасходов["ЗначениеНормативаПоУслуге"], XMLСтрока(ЧастьУслуги));
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),Представление,,БиблиотекаКартинок.РегистрСведений);
				КонецЦикла;
			КонецЕсли;
			
			//Для Каждого КлючЗначение Из ТипыТемператур Цикл
			//	Ключ 					= Новый Структура("ТипРасхода, Параметр", ТипыРасходов["ЗначениеТемпературы"], КлючЗначение.Ключ);
			//	ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),КлючЗначение.Значение,,БиблиотекаКартинок.РегистрСведений);
			//КонецЦикла; 
			
			Для Каждого КлючЗначение Из ТипыКоэффициентов Цикл
				Если КлючЗначение.Ключ = "РасчетныйНормативНаПодогрев" 
					ИЛИ КлючЗначение.Ключ = "ТемпературныйКоэффициентПоВоздуху"
					ИЛИ КлючЗначение.Ключ = "ТемпературныйКоэффициентПоВоде"
					ИЛИ КлючЗначение.Ключ = "ПлотностьПодающейСетевойВоды"
					ИЛИ КлючЗначение.Ключ = "ПлотностьОбратнойСетевойВоды"
					ИЛИ КлючЗначение.Ключ = "ТемператураОбратнойСетевойВоды"
					ИЛИ КлючЗначение.Ключ = "ТемператураПодачи"
					ИЛИ КлючЗначение.Ключ = "ТемператураХолоднойВоды" Тогда
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(КлючЗначение.Ключ),КлючЗначение.Значение,,БиблиотекаКартинок.РегистрСведений);
				ИначеЕсли КлючЗначение.Ключ = "КоличествоЧасовРаботыТУ" 
					ИЛИ КлючЗначение.Ключ = "КоличествоЧасовШтатнойРаботыПУ"
					ИЛИ КлючЗначение.Ключ = "КолвоЧасовРаботыТУПред" 
					ИЛИ КлючЗначение.Ключ = "КолвоЧасовШтатнойРаботыПУПред" Тогда
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(КлючЗначение.Ключ),КлючЗначение.Значение,,БиблиотекаКартинок.РегламентныеЗадания);
				ИначеЕсли КлючЗначение.Ключ = "Объем_ПоПриборуПред" 
					ИЛИ КлючЗначение.Ключ = "РасчетПоНормативу" Тогда
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(КлючЗначение.Ключ),КлючЗначение.Значение,,БиблиотекаКартинок.РегистрНакопления);
				КонецЕсли;
			КонецЦикла; 
			            
			Для каждого значениеПеречисления из Метаданные.Перечисления.энргСпособНачислений.ЗначенияПеречисления Цикл
				ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(значениеПеречисления.Имя),значениеПеречисления.Синоним,,БиблиотекаКартинок.Перечисление);
			КонецЦикла;
		КонецЕсли;		
	Иначе 		
		Если Параметры.Свойство("СоставУслуги") Тогда
			Для Каждого ЧастьУслуги Из Параметры.СоставУслуги Цикл
				Ключ 					= Новый Структура("ТипРасхода, Услуга", ТипыРасходов["ЗначениеНормативаПоУслуге"], XMLСтрока(ЧастьУслуги));
				ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),"ЗначениеНормативаПоУслуге - " + ЧастьУслуги,,БиблиотекаКартинок.РегистрСведений);
			КонецЦикла;
			
			Если Параметры.Свойство("ОДН") и Параметры.ОДН Тогда
				Для Каждого ЧастьУслуги Из Параметры.СоставУслуги Цикл
					Ключ 				= Новый Структура("ТипРасхода, Услуга", ТипыРасходов["СуммаРасходовВсехПомещенийПоУслуге"], XMLСтрока(ЧастьУслуги));
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),"СуммаРасходовВсехПомещенийПоУслуге - " + ЧастьУслуги,,БиблиотекаКартинок.РегистрНакопления);
				КонецЦикла;	
				
				Для Каждого ЧастьУслуги Из Параметры.СоставУслуги Цикл
					Ключ 				= Новый Структура("ТипРасхода, Услуга", ТипыРасходов["РасходМКДПоУслуге"], XMLСтрока(ЧастьУслуги));
					ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),"РасходМКДПоУслуге - " + ЧастьУслуги,,БиблиотекаКартинок.РегистрНакопления);
				КонецЦикла;				
			КонецЕсли;			
		КонецЕсли;
		
		Если Параметры.Свойство("Шкалы") Тогда
			Для Каждого Шкала Из Параметры.Шкалы Цикл
				Ключ 					= Новый Структура("ТипРасхода, Услуга", ТипыРасходов["РасходМКДПоУслуге"], XMLСтрока(Шкала));
				ПараметрыРасчета.Добавить(ЗначениеВСтрокуВнутр(Ключ),"РасходПоШкале - " + Шкала,,БиблиотекаКартинок.РегистрРасчета);
			КонецЦикла;		
		КонецЕсли;  		
	КонецЕсли;
		
	Если Параметры.Свойство("ПредставлениеФормулы") и ЗначениеЗаполнено(Параметры.ПредставлениеФормулы) Тогда
		ПредставлениеФормулы 		= Новый ФорматированнаяСтрока(Параметры.ПредставлениеФормулы);
	Иначе		
		Строки 							= Новый Массив;
		Строки.Добавить(Новый ФорматированнаяСтрока("["));
		Строки.Добавить(Новый ФорматированнаяСтрока("Результат", Новый Шрифт(,,Истина)));
		Строки.Добавить(Новый ФорматированнаяСтрока("]"));
		ПредставлениеФормулы 			= Новый ФорматированнаяСтрока(Строки);
	КонецЕсли; 
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПараметрыРасчетаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекущиеДанные 									= Элементы.ПараметрыРасчета.ТекущиеДанные;
	Если ТекущиеДанные  = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строки 											= Новый Массив;
	Строки.Добавить(Новый ФорматированнаяСтрока("["));
	Строки.Добавить(Новый ФорматированнаяСтрока(ТекущиеДанные.Представление, Новый Шрифт(,,Истина)));
	Строки.Добавить(Новый ФорматированнаяСтрока("]"));
		
	ПараметрыПеретаскивания.Значение  				= Новый ФорматированнаяСтрока(Строки);
	ПараметрыПеретаскивания.Действие  			 	= ДействиеПеретаскивания.Копирование;
	ПараметрыПеретаскивания.ДопустимыеДействия   	= ДопустимыеДействияПеретаскивания.Копирование;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	ТекущиеДанные = Элементы.ПараметрыРасчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеФормулы = ПредставлениеФормулы + "[" + ТекущиеДанные.Представление + "]";
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	ФормулаРасчета 			= ПредставлениеФормулы;
	Для Каждого Параметр Из ПараметрыРасчета Цикл
		ФормулаРасчета 		= СтрЗаменить(ФормулаРасчета, "[" + Параметр.Представление + "]" ,"["+Параметр.Значение+"]");
	КонецЦикла;
	
	Закрыть(Новый Структура("ПредставлениеФормулы,ФормулаРасчета", ПредставлениеФормулы, ФормулаРасчета));
	
КонецПроцедуры

#КонецОбласти