#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Год = Год(ТекущаяДата());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;	
	
	ЗаполнитьДокумент  = Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			ЗаполнитьДокумент = истина;
			ЗаполнитьУслугиОбъектаСервер();
		КонецЕсли;
	КонецЕсли;
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьГарантированныеОбъемыНП(ЭтотОбъект, Объект.Ссылка);
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестУстановитьГарантированныеОбъемыНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		ПроверитьЗаполнениеДанных(Отказ);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиГарантированныеОбъемы

&НаКлиенте
Процедура ГарантированныеОбъемыЯнварьПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыФевральПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания1 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыМартПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания2 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыАпрельПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания3 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыМайПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания4 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыИюньПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания5 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыИюльПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания6 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыАвгустПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания7 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыСентябрьПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания8 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыОктябрьПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания9 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыНоябрьПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания10 = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыДекабрьПриИзменении(Элемент)
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания11 = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран объект расчета");
	Иначе 
		ЗаполнитьУслугиОбъектаСервер();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдрессОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьУслугиОбъектаСервер()
	
	Результат 								= бестРаботаСОбъектамиНПСервер.ДействующиеУслугиПоОбъектуСДоговорнымиОбъемами(?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), КонецДня(Объект.ДатаФактическогоСобытия), КонецДня(Объект.Дата)),Объект.Организация,Объект.Район, Объект.ОбъектРасчета); 
	Выборка  								= Результат.Выбрать();
	
	объект.ГарантированныеОбъемы.Очистить();
	ТекУслуга = Неопределено;
	Пока Выборка.следующий() Цикл 
		Если ТекУслуга <> Выборка.Услуга Тогда
			СтрокаПриборов  					= Объект.ГарантированныеОбъемы.Добавить();
		КонецЕсли;
		Если Выборка.Месяц = 1 Тогда
			СтрокаПриборов.ЯнварьДо = Выборка.ОбъемУслуги;
			СтрокаПриборов.Услуга 		        = Выборка.Услуга;	
		ИначеЕсли Выборка.Месяц = 2 Тогда
			СтрокаПриборов.ФевральДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 3 Тогда
			СтрокаПриборов.МартДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 4 Тогда
			СтрокаПриборов.АпрельДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 5 Тогда
			СтрокаПриборов.МайДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 6 Тогда
			СтрокаПриборов.ИюньДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 7 Тогда
			СтрокаПриборов.ИюльДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 8 Тогда
			СтрокаПриборов.АвгустДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 9 Тогда
			СтрокаПриборов.СентябрьДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 10 Тогда
			СтрокаПриборов.ОктябрьДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 11 Тогда
			СтрокаПриборов.НоябрьДо = Выборка.ОбъемУслуги;
		ИначеЕсли Выборка.Месяц = 12 Тогда
			СтрокаПриборов.ДекабрьДо = Выборка.ОбъемУслуги;
		КонецЕсли;
		ТекУслуга = Выборка.Услуга;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеДанных(Отказ)
	
	Если Объект.Организация <> Объект.Район.Организация Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте данные организации и района");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		МКД = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "МКД");
		Если ЗначениеЗаполнено(МКД) Тогда
			АдресОбъекта = МКД;
		Иначе
			АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти


