#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает значения свойств объекта.
//
// Параметры:
//  ЗонаОтвественности	-	СправочникСсылка.энргЗоныОтвественности.
//  ПолучаемыеСвойства	-	Структура.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияСвойствОбъекта(ЗонаОтвественности, ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжЗоныОтвественностиМенеджер") = Неопределено Тогда
				Возврат Обработки["слжЗоныОтвественностиМенеджер"].ЗначенияСвойствОбъекта(ЗонаОтвественности, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргЗоныОтвественности.ЗначенияСвойствОбъекта(ЗонаОтвественности, ПолучаемыеСвойства);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргЗоныОтвественностиМенеджер.ЗначенияСвойствОбъекта";
		ПараметрыМетода 			= Новый Структура("ЗонаОтвественности, ПолучаемыеСвойства", ЗонаОтвественности, ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат; 	
	
КонецФункции

// Получает филиалы района.
//
// Параметры:
//  ЗонаОтвественности	-	СправочникСсылка.энргЗоныОтвественности.
// 
// Возвращаемое значение:
//   СправочникСсылка.энргФилиалы.
//
Функция ФилиалыРайона(ЗонаОтвественности) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжЗоныОтвественностиМенеджер") = Неопределено Тогда
				Возврат Обработки["слжЗоныОтвественностиМенеджер"].ФилиалыРайона(ЗонаОтвественности);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргЗоныОтвественности.ФилиалыРайона(ЗонаОтвественности);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргЗоныОтвественностиМенеджер.ФилиалыРайона";
		ПараметрыМетода 			= Новый Структура("ЗонаОтвественности", ЗонаОтвественности);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли