#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСоставУзлаИШкалы(ТипУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТипыУзловУчета.Ссылка КАК ТипУзла,
		|	энргТипыУзловУчетаСоставУзла.ТипИзмерителя КАК ТипИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РегистрируетОбъем КАК РегистрируетОбъем,
		|	энргТипыУзловУчетаСоставУзла.ВспомогательноеОборудование КАК ВспомогательноеОборудование,
		|	энргТипыУзловУчетаСоставУзла.IDСтроки КАК IDСтроки,
		|	энргТипыУзловУчетаСоставУзла.Фаза КАК Фаза
		|ПОМЕСТИТЬ ВТ_СоставУзла
		|ИЗ
		|	Справочник.энргТипыУзловУчета КАК энргТипыУзловУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.СоставУзла КАК энргТипыУзловУчетаСоставУзла
		|		ПО энргТипыУзловУчета.Ссылка = энргТипыУзловУчетаСоставУзла.Ссылка
		|			И (энргТипыУзловУчета.Ссылка = &ТипУзла)
		|			И (энргТипыУзловУчетаСоставУзла.Ссылка = &ТипУзла)
		|			И (НЕ энргТипыУзловУчета.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставУзла.ТипУзла КАК ТипУзла,
		|	ВТ_СоставУзла.ТипИзмерителя КАК ТипИзмерителя,
		|	ВТ_СоставУзла.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	ВТ_СоставУзла.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ВТ_СоставУзла.ВспомогательноеОборудование КАК ВспомогательноеОборудование,
		|	ЕСТЬNULL(энргТипыУзловУчетаШкалыТипаИзмерителя.Шкала, """") КАК Шкала,
		|	ЕСТЬNULL(энргТипыУзловУчетаШкалыТипаИзмерителя.IDСтроки, """") КАК IDСтрокиШкалыИзмерителя,
		|	ВТ_СоставУзла.IDСтроки КАК IDСтрокиСостава,
		|	ВТ_СоставУзла.Фаза КАК Фаза
		|ИЗ
		|	ВТ_СоставУзла КАК ВТ_СоставУзла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.ШкалыТипаИзмерителя КАК энргТипыУзловУчетаШкалыТипаИзмерителя
		|		ПО ВТ_СоставУзла.IDСтроки = энргТипыУзловУчетаШкалыТипаИзмерителя.IDСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	IDСтрокиСостава";
	
	Запрос.УстановитьПараметр("ТипУзла", ТипУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСоставУзла(ТипУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТипыУзловУчета.Ссылка КАК ТипУзла,
		|	энргТипыУзловУчетаСоставУзла.ТипИзмерителя КАК ТипИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	энргТипыУзловУчетаСоставУзла.РегистрируетОбъем КАК РегистрируетОбъем,
		|	энргТипыУзловУчетаСоставУзла.ВспомогательноеОборудование КАК ВспомогательноеОборудование
		|ИЗ
		|	Справочник.энргТипыУзловУчета КАК энргТипыУзловУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.СоставУзла КАК энргТипыУзловУчетаСоставУзла
		|		ПО энргТипыУзловУчета.Ссылка = энргТипыУзловУчетаСоставУзла.Ссылка
		|			И (энргТипыУзловУчета.Ссылка = &ТипУзла)
		|			И (энргТипыУзловУчетаСоставУзла.Ссылка = &ТипУзла)
		|			И (НЕ энргТипыУзловУчета.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("ТипУзла", ТипУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли