#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	РезультатЗапроса = ПолучитьДанныеДляПроведения();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса,				Движения.бестЧасыПиковойНагрузки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьЧасыПиковойНагрузки.Организация КАК Организация,
	      		  |	бестИзменитьЧасыПиковойНагрузки.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЧасыПиковойНагрузкиПиковыеЧасы.День КАК День,
	      		  |	бестИзменитьЧасыПиковойНагрузкиПиковыеЧасы.Час КАК Час,
	      		  |	бестИзменитьЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Поставщик КАК Поставщик,
	      		  |	бестИзменитьЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Услуга КАК Услуга
	      		  |ИЗ
	      		  |	Документ.бестИзменитьЧасыПиковойНагрузки КАК бестИзменитьЧасыПиковойНагрузки
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЧасыПиковойНагрузки.РазрезыПиковыхЧасов КАК бестИзменитьЧасыПиковойНагрузкиРазрезыПиковыхЧасов
	      		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЧасыПиковойНагрузки.ПиковыеЧасы КАК бестИзменитьЧасыПиковойНагрузкиПиковыеЧасы
	      		  |			ПО (бестИзменитьЧасыПиковойНагрузкиПиковыеЧасы.Ссылка = бестИзменитьЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Ссылка)
	      		  |				И (бестИзменитьЧасыПиковойНагрузкиПиковыеЧасы.IDСтроки = бестИзменитьЧасыПиковойНагрузкиРазрезыПиковыхЧасов.IDСтроки
	      		  |					И бестИзменитьЧасыПиковойНагрузкиПиковыеЧасы.Час <> 0)
	      		  |		ПО бестИзменитьЧасыПиковойНагрузки.Ссылка = бестИзменитьЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьЧасыПиковойНагрузки.Ссылка = &Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли