#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
	энргЛокализацияСервер.ПриСозданииНаСервере_энргНастройкиВыполненияГодовойКорректировки(ЭтотОбъект);
	
	ПериодГод = Год(ТекущаяДата());
	НаборЗаписей.Отбор.Период.Значение 			= Дата(ПериодГод,1,1);
	НаборЗаписей.Отбор.Период.Использование 	= Истина;
	ПрочитатьНаборЗаписейСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрокаТаблицы Из НаборЗаписей Цикл
		СтрокаТаблицы.Период 			= Дата(ПериодГод,1,1);
		СтрокаТаблицы.Организация  		= Организация;
		СтрокаТаблицы.Район  			= Район;
		СтрокаТаблицы.НачалоПериода 	= ПериодКорректировки.ДатаНачала;
		СтрокаТаблицы.КонецПериода 		= ПериодКорректировки.ДатаОкончания;
		СтрокаТаблицы.Месяц 			= Месяц;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
 	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Район");
	ПроверяемыеРеквизиты.Добавить("Период");
	ПроверяемыеРеквизиты.Добавить("ПериодКорректировки");
	ПроверяемыеРеквизиты.Добавить("Месяц");
	ПроверяемыеРеквизиты.Добавить("НаборЗаписей");	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	НаборЗаписей.Отбор.Организация.Значение 		= Организация;
	НаборЗаписей.Отбор.Организация.Использование 	= Истина;
	ПрочитатьНаборЗаписейСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	НаборЗаписей.Отбор.Район.Значение 				= Район;
	НаборЗаписей.Отбор.Район.Использование 			= Истина;
	ПрочитатьНаборЗаписейСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПериодКорректировкиПриИзменении(Элемент)
	
	НаборЗаписей.Отбор.НачалоПериода.Значение 		= ПериодКорректировки.ДатаНачала;
	НаборЗаписей.Отбор.НачалоПериода.Использование 	= Истина;
	
	НаборЗаписей.Отбор.КонецПериода.Значение 		= ПериодКорректировки.ДатаОкончания;
	НаборЗаписей.Отбор.КонецПериода.Использование 	= Истина;
	
	ПрочитатьНаборЗаписейСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	НаборЗаписей.Отбор.Период.Значение 				= Дата(ПериодГод,1,1);
	НаборЗаписей.Отбор.Период.Использование 		= Истина;
	ПрочитатьНаборЗаписейСервер();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовТаблицыФормыНаборЗаписей
&НаКлиенте
Процедура НаборЗаписейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Сч = 0 По ВыбранноеЗначение.ВГраница() Цикл
			яЗначение  								= ВыбранноеЗначение[Сч];
			Если ТипЗнч(яЗначение) = Тип("СправочникСсылка.энргСтроения") Тогда
				мСтроки  = НаборЗаписей.НайтиСтроки(Новый Структура("МКД", яЗначение));
				Если мСтроки.Количество() = 0 Тогда
					СтрокаНабора  					= НаборЗаписей.Добавить();
					СтрокаНабора.МКД 				= яЗначение;
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы  

&НаКлиенте
Процедура ПодборМКД(Команда)
	
	ПараметрыФормы 						= Новый Структура("Отбор, МножественныйВыбор, ЗакрыватьПриВыборе", Новый Структура("ТипСтроения", ПредопределенноеЗначение("Перечисление.энргТипыСтроений.МКД")), Истина, Ложь);
	ОткрытьФорму("Справочник.энргСтроения.ФормаВыбора",ПараметрыФормы,Элементы.НаборЗаписей); 
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНаборЗаписейСервер()
	
	яНабор  = РеквизитФормыВЗначение("НаборЗаписей");
	яНабор.Прочитать();
	ЗначениеВРеквизитФормы(яНабор,"НаборЗаписей");
	
КонецПроцедуры

#КонецОбласти