#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимОтображения") И ТипЗнч(Параметры.РежимОтображения) = Тип("ОтображениеТаблицы") Тогда
		Элементы.Список.Отображение = Параметры.РежимОтображения;
	ИначеЕсли Параметры.Свойство("РежимОтображения") И ТипЗнч(Параметры.РежимОтображения) = Тип("Строка") и НРег(Параметры.РежимОтображения) = НРег("Список") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
	 Если Параметры.Свойство("ДополнительныеСвойства") Тогда
		УстановитьОтборПоДополнительнымСвойствам(Параметры.ДополнительныеСвойства);
	КонецЕсли;   	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоДополнительнымСвойствам(ДополнительныеСвойства)
	перем мСсылки; 	
	
	мСсылки 		= Обработки.энргЗначениеТарифовМенеджер.ТарифныеГруппыТекущийЗначений(ДополнительныеСвойства);		
	
	Если ДополнительныеСвойства.Свойство("ВыводитьПустойНабор") и мСсылки.Количество() = 0 Тогда 
		СписокСсылок 	= Новый СписокЗначений;
		СписокСсылок.ЗагрузитьЗначения(мСсылки);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокСсылок,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ЭтоГруппа",Ложь,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	ИначеЕсли мСсылки.Количество() = 0 Тогда
		Возврат;
	иначе 		
		СписокСсылок 	= Новый СписокЗначений;
		СписокСсылок.ЗагрузитьЗначения(мСсылки);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокСсылок,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ЭтоГруппа",Ложь,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти
