#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнициализацияФорм

Функция ПолучитьФормыДляОтображенияКакСтрока() Экспорт
	ШаблонСтроки			= "Обработка.энргСобытиеМенеджерФорм.Форма.%1";
	ФормаКакОбъектМетаданых = ПолучитьФормыДляОтображенияКакОбъектМетаданных();
	
	Результат = Новый Структура;
	Результат.Вставить("ФормаДокумента"	, СтрШаблон(ШаблонСтроки, ФормаКакОбъектМетаданых.ФормаДокумента.Имя));
	Результат.Вставить("ФормаСписка"	, СтрШаблон(ШаблонСтроки, ФормаКакОбъектМетаданых.ФормаСписка.Имя));
	Возврат Результат;
КонецФункции

Функция ПолучитьФормыДляОтображенияКакОбъектМетаданных() Экспорт
	Возврат Метаданные.Обработки.энргСобытиеМенеджерФорм.Формы;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли