#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс 

Процедура ДанныеЗабалансовойЗадолженности(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];		
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;			
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеЗабалансовойЗадолженности());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные = ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора = Пакет.Операторы[0];	
	Источник = ОператорВыбора.Источники[0].Источник;
	Параметры = Источник.Параметры;
	
	ПараметрПериод = Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Организация, Район, МКД, Абонент";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			ОператорВыбора.Источники[0].Источник.Параметры[1],
			ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеЗабалансовойЗадолженности()
	Текст  =	
	 "ВЫБРАТЬ
	 |	энргЗабалансоваяЗадолженностьОстатки.Организация КАК Организация,
	 |	энргЗабалансоваяЗадолженностьОстатки.Район КАК Район,
	 |	энргЗабалансоваяЗадолженностьОстатки.МКД КАК МКД,
	 |	энргЗабалансоваяЗадолженностьОстатки.Абонент КАК Абонент,
	 |	энргЗабалансоваяЗадолженностьОстатки.СуммаЗадолженностиОстаток КАК Сумма
	 |ИЗ
	 |	РегистрНакопления.энргЗабалансоваяЗадолженность.Остатки КАК энргЗабалансоваяЗадолженностьОстатки";
	
	Возврат Текст;
	
КонецФункции 

#КонецОбласти

#КонецЕсли