#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуНовогоДокументаПоВидуОперации(ИмяДокумента,ВидОперации,ПрефиксФормы,Параметры) Экспорт 
	ИмяФормы  	= "Документ." + ИмяДокумента + ".Форма." + "ФормаДокумента" + ПрефиксФормы;
	Форма 		= ПолучитьФорму(ИмяФормы,Параметры);
	ДанныеФормы = ЗаполнитьДанныеФормы(Форма.объект,Новый Структура("ВидОперации",ВидОперации));
	КопироватьДанныеФормы(ДанныеФормы,Форма.объект);
	Форма.открыть(); 
КонецПроцедуры

Процедура ПриИзмененииВидаОперации(ТипДокументаСтрока,ОбъектФормы,Ключ) Экспорт  
	ПрефиксФормы  			= энргРаботаСВидамиОперацийВызовСервера.ПрефиксФормы(ТипДокументаСтрока,ОбъектФормы.ВидОперации);	
	ИмяФормы				= "Документ." + ТипДокументаСтрока + ".Форма." + "ФормаДокумента" + ПрефиксФормы;
	Форма 					= ПолучитьФорму(ИмяФормы,Новый Структура("Ключ",Ключ));
	ДанныеФормы 			= ЗаполнитьДанныеФормы(Форма.объект,ОбъектФормы);
	КопироватьДанныеФормы(ДанныеФормы,Форма.объект);
	Форма.открыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломДобавленияДокумента(ИмяДокумента,Отказ,Копирование) Экспорт 
	Отказ = истина;
	ОткрытьФорму("ОбщаяФорма.энргФормаВыбораОперации",Новый Структура("ИмяДокумента",ИмяДокумента));
КонецПроцедуры

Процедура ВыборДокумента(ИмяДокумента,ДокументСсылка,ПрефиксФормы,СтандартнаяОбработка) Экспорт 
	СтандартнаяОбработка 	= Ложь;
	ОткрытьФормуДокумента(ИмяДокумента,ДокументСсылка,ПрефиксФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуДокумента(ИмяДокумента,Объект,ПрефиксФормы) 
	 ОткрытьФорму("Документ." +ИмяДокумента + ".Форма." + "ФормаДокумента" + ПрефиксФормы,Новый Структура("Ключ",Объект));
КонецПроцедуры

Функция ЗаполнитьДанныеФормы(Знач ДанныеФормы,Источник)
	если типЗнч(Источник) = тип("ДанныеФормыСтруктура") тогда
		Возврат Источник;
	иначе
		ЗаполнитьЗначенияСвойств(ДанныеФормы,Источник);
		Возврат ДанныеФормы;
	КонецЕсли;
	
КонецФункции

#КонецОбласти