#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	#Если ВебКлиент Тогда

		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	    
	    ДиалогВыбораФайла.Каталог = КаталогВыгрузки;
	    ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	    
	    ПараметрыСценария = Новый Структура;
	    Оповещение = Новый ОписаниеОповещения("КаталогНачалоВыбораЗавершение", ЭтаФорма);
	    ПараметрыСценария.Вставить("Оповещение_ПослеЗакрытияДиалогаВыбораФайла", Оповещение);
	    ПараметрыСценария.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	                                
	    ВыполнитьСценарийВыбораФайла(, ПараметрыСценария);
	#Иначе
		Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
		ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
		СтандартнаяОбработка = Ложь;
		ДиалогОткрытия.Каталог = ""; 
		ДиалогОткрытия.МножественныйВыбор = Ложь; 
		ДиалогОткрытия.Заголовок = "Выберите каталог"; 
		
		Если ДиалогОткрытия.Выбрать() Тогда 
			КаталогВыгрузки = ДиалогОткрытия.Каталог + "\"; 
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен каталог выгрузки!");
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Филиал) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация!");
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПериодНачисления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата выгрузки!");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда		
		Текст 					= Новый ТекстовыйДокумент;
		ТекПараметры			= Новый Структура;
		ТекПараметры.Вставить("Организация", Филиал);
		ТекПараметры.Вставить("ПериодНачисления", КонецДня(ПериодНачисления));
		ВыгрузитьНаСервере(Текст, ТекПараметры);
			
		ПолноеИмяФайла		= КаталогВыгрузки + СОКРЛП(ТекПараметры.ИНН) + "_" + СОКРЛП(ТекПараметры.НомерСчета) + "_001_"+ Формат(ПериодНачисления, "ДФ=MMyy") + ".txt";
		Текст.Записать(ПолноеИмяФайла, "windows-1251");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПолноеИмяФайла + " записан!");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьНаСервере(Текст, Текпараметры)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекОбъект.ВыгрузитьНаСервереМодуль(Текст, Текпараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    КаталогВыгрузки = Результат[0]+"\";
    
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтсчетШагов(ПараметрыСценария)
	
	Если ПараметрыСценария = Неопределено Тогда
		ПараметрыСценария = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПараметрыСценария.Свойство("ПредыдущийШаг") Тогда
		// при первом запуске основной процедуры это свойство отстуствует
		ПараметрыСценария.Вставить("ПредыдущийШаг", 0);
	КонецЕсли;
	
	ПараметрыСценария.Вставить("ТекущийШаг", 0);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтотШагЕщеНеВыполнялся(ПараметрыСценария)
	
	ПараметрыСценария.ТекущийШаг = ПараметрыСценария.ТекущийШаг + 1;

	Если ПараметрыСценария.ПредыдущийШаг >= ПараметрыСценария.ТекущийШаг Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыСценария.ПредыдущийШаг = ПараметрыСценария.ТекущийШаг;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ЭтоРезультатВыполненногоШага(ПараметрыСценария)

	Возврат ПараметрыСценария.ПредыдущийШаг = ПараметрыСценария.ТекущийШаг;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСценарийВыбораФайла(Результат = Неопределено, ПараметрыСценария = Неопределено) Экспорт
    
    НачатьОтсчетШагов(ПараметрыСценария);
    
    Оповещение = Новый ОписаниеОповещения("ВыполнитьСценарийВыбораФайла", ЭтаФорма, ПараметрыСценария);
    
    // подключить расширение работы с файлами
    Если ЭтотШагЕщеНеВыполнялся(ПараметрыСценария) Тогда
            НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
            Возврат;
        
    ИначеЕсли ЭтоРезультатВыполненногоШага(ПараметрыСценария) Тогда
        
        // если расширение подключилось, перейти к следующему шагу
        Если Результат = Истина Тогда
            
        // если расширение не подключилось, задать вопрос об его установке
        ИначеЕсли Результат = Ложь Тогда
            ТекстСообщения = "Расширение для работы с файлами не установлено. Установить?";
            ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
            Возврат;
            
        // пользователь отказался от установки расширения по работе с файлами
        ИначеЕсли Результат <> КодВозвратаДиалога.Да Тогда
            Возврат;
            
        // пользователь подтвердил установку расширения по работе с файлами
        ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
            НачатьУстановкуРасширенияРаботыСФайлами();
            Возврат;
            
        КонецЕсли;
            
    КонецЕсли;
    
    // открыть диалог выбора файла
    Если ЭтотШагЕщеНеВыполнялся(ПараметрыСценария) Тогда
        
        // переадресовываем результат на прикладную процедуру
        ПараметрыСценария.ДиалогВыбораФайла.Показать(ПараметрыСценария.Оповещение_ПослеЗакрытияДиалогаВыбораФайла);
        Возврат;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти