#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргПлатежноеПоручениеВходящие(ЭтотОбъект);
	
	ЗаполнитьВозможностьДобавленияЕдиничнойОплат();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли; 
	
	ОбновитьКолВоСтрокВТЧ();
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Фискализация ОФД
	Если ПодсистемаИнтеграцияОФДСуществует() Тогда
		МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
		МодульфискОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Фискализация ОФД	
	
	УстановитьВидимостьФункционалаРегистрацииПоказаний();
	УстановитьОтборДокументовРегистрацииПоказаний();
	
	УстановитьВерсиюДокумента(); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета, ТекущийОбъект);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект, яИспользоватьТарифныеЗоны, яИспользоватьШкалыПриборовУчета, ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "ТочкиУчета");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект, "Оплата");
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета, ТекущийОбъект);
	
	ПоказанияПредоставляютсяВСрок();
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();	
	
	// Фискализация ОФД
	Если ПодсистемаИнтеграцияОФДСуществует() Тогда
		МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
		ДокументФискализирован = МодульфискОбщегоНазначения.ПлатежныйДокументОтправленВСистемуОФД(Объект.Ссылка);
	КонецЕсли;
	// Фискализация ОФД
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаПоДокументу = Объект.Оплата.Итог("СуммаОплаты");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);	
	//Отказ = ПроверкаСуммыРаспределения(ТекущийОбъект.Задолженность);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета,ТекущийОбъект); 
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Оплата"); 	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
	// Фискализация ОФД
	Если ПодсистемаИнтеграцияОФДСуществует() Тогда
		МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
		МодульфискОбщегоНазначения.ПослеЗаписи(ЭтотОбъект);
	КонецЕсли;
	// Фискализация ОФД
	
	УстановитьВидимостьФункционалаРегистрацииПоказаний();
	УстановитьОтборДокументовРегистрацииПоказаний();
	
	УстановитьВерсиюДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗависимыеРеквизиты = ПолучитьЗависимыеРеквизиты();
	Если ЗначениеЗаполнено(Объект.Ссылка) И НеобходимоСкорректироватьСвязанныеДокументы(Объект.Ссылка, ЗависимыеРеквизиты) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеВопросаОНеобходимостиКорректировкиСвязанныхДокументов",
			ЭтотОбъект);		
			
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Дата документа была изменена. Даты документов созданных на основании будут скорректированы. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
			
	КонецЕсли;
	
	ЗаполнитьПериодНачисленияСервер();		
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) и ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(Объект.Ссылка) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(	
			"ПослеВопросаОПометкеСвязанныхДокументов",
			ЭтотОбъект);
			
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'На основании выбранного файла загрузки созданы документы ""Регистрация показаний"", удалить их?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
		
		Возврат;
		
	КонецЕсли;
	
	ФайлДляЧтенияНачалоВыбораКлиент();
	//СтандартнаяОбработка 		= Ложь;
	//Диалог 						= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	////Диалог.Фильтр 	= "Электронная таблица (*.dbf)|*.dbf";
	//Если Диалог.Выбрать() тогда
	//	Объект.ФайлДляЧтения 	= Диалог.ПолноеИмяФайла;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ТочкиУчета";
	ИмяТаблицыПоказания						= "ПОказанияПРиборовУчета";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,Истина,Ложь,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаАбонентПриИзменении(Элемент)
	ТекТаблица 		= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 					= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	ЕСли ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонентаВТабличнойЧасти(ТекущиеДанные);
		
	иначе
		ТекущиеДанные.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ТекущиеДанные.Помещение 	= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ТекущиеДанные.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	ТекущиеДанные.ТочкаУчета  = Неопределено; 
	ТекущиеДанные.Услуга  = Неопределено; 
	ТекущиеДанные.ПриборУчета  = Неопределено; 
	ТекущиеДанные.ТочкаУчета  = Неопределено; 
	ЗаполнитьПриборыУчетаСервер(ТекТаблица.ТекущаяСтрока, ТекущиеДанные.Район, ТекущиеДанные.КлючПомещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	ТекДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	//СтандартнаяОбработка	= Ложь;
	ДополнительныеПараметры = новый Структура("Дата,Организация,Район,КлючПомещения",Объект.Дата,Объект.Организация,ТекДанные.Район,ТекДанные.КлючПомещения);
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент,ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаПриИзменении(Элемент)
	ТекТаблица 		= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	ТекущиеДанные 	= ТекТаблица.ТекущиеДанные;
	ЗаполнитьПриборыУчетаСервер(ТекТаблица.ТекущаяСтрока, ТекущиеДанные.Район, ТекущиеДанные.КлючПомещения);
	//энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
	//ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриборУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура("Отбор", Новый Структура("Ссылка", ВернутьПУ(Объект.Дата, ТекущиеДанные.Абонент, ТекущиеДанные.ТочкаУчета)));
	ОткрытьФорму("Справочник.энргПриборыУчетаАбонента.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриборУчетаПриИзменении(Элемент)
	
	ТекущиеДанные	= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;//Элементы.ТочкиУчета.ТекущиеДанные;
	ТекущаяСтрока 	= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущаяСтрока;
	ЗаполнитьПриборыУчетаСервер(ТекущаяСтрока, ТекущиеДанные.Район, ТекущиеДанные.КлючПомещения);
	
КонецПроцедуры

#КонецОбласти 

#Область РаботаСОплатой

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплата

&НаКлиенте
Процедура ОплатаАбонентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Оплата.ТекущиеДанные;
	ЕСли ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонентаВТабличнойЧасти(ТекущиеДанные);
	иначе
		ТекущиеДанные.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ТекущиеДанные.Помещение 	= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ТекущиеДанные.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 		
		ТекущиеДанные 							= Элемент.ТекущиеДанные;
		// TODO FIX ME {
		ТекущиеДанные.Поставщик 				= ПолучитьКонтрагентаПоКоду("000000001");
		// }
		ТекущиеДанные.ДатаПлатежногоДокумента 	= Объект.Дата; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Элементы.Задолженность.ОтборСтрок = Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);
	Элементы.ПереносСуммыОплаты.ОтборСтрок = Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);
	//энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПереносСуммыОплаты, Неопределено, ТекущиеДанные.IDСтроки,, "");
	
	ОбновитьИтогиТЧЗадолженность(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаСуммаОплатыПриИзменении(Элемент)
	
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОбновитьОстатокСуммыОплаты(ТекДанные, "Авизо");
	
	//ТекСтрока.СуммаОстаток = ТекСтрока.СуммаОплаты - ТекСтрока.Авизо;	
	//ПереносСуммыОплатыСуммаПереносаПриИзменении(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаАвизоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОбновитьОстатокСуммыОплаты(ТекДанные, "Авизо");
	
	
	//ТекСтрока = Элементы.Оплата.ТекущиеДанные;
	//
	//Если ТекСтрока <> Неопределено Тогда
	//	
	//	ТекСтрока.СуммаОстаток = ТекСтрока.СуммаОплаты - ТекСтрока.Авизо;
	//	
	//	ПереносСуммыОплатыСуммаПереносаПриИзменении(Элемент, ИСтина);
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ДокументФискализирован Тогда		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОплатаУжеДобавлена = Ложь;
	Для Каждого СтрокаОплаты Из Объект.Оплата Цикл
		ОплатаУжеДобавлена = Истина;
		Прервать;
	КонецЦикла;
	
	Если РазрешеноДобавлятьОплату И ОплатаУжеДобавлена Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Добавлять больше одной строки запрещено'"));
			
		Возврат;
		
	КонецЕсли;
	
	
	Если НЕ РазрешеноДобавлятьОплату И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Документ загружен из реестра. Добавлять новые строки запрещено'"));
			
		Возврат;
			
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПередУдалением(Элемент, Отказ)
	
	Если ДокументФискализирован Тогда		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ РазрешеноДобавлятьОплату И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Документ загружен из реестра. Удалять строки запрещено'"));
		Возврат;
	КонецЕсли;

	ТекущиеДанные  = Элементы.Оплата.ТекущиеДанные;
	ОплатаПередУдалениемНаСервере(ТекущиеДанные.IDСтроки);
		
КонецПроцедуры

&НаСервере
Процедура ОплатаПередУдалениемНаСервере(ИдентификаторСтроки)	
	
	ТаблицаОчистки = Объект.ПереносСуммыОплаты;
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТаблицаОчистки, Новый Структура("IDСтроки", ИдентификаторСтроки));
	
	ТаблицаОчистки = Объект.Задолженность;
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТаблицаОчистки, Новый Структура("IDСтроки", ИдентификаторСтроки));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереносСуммыОплаты

&НаКлиенте
Процедура ПереносСуммыОплатыПриИзменении(Элемент)
	
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НовТекущиеДанные = Элементы.ПереносСуммыОплаты.ТекущиеДанные;
	Если НовТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НовТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереносСуммыОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран абонент с которого переносится оплата");
		
		Отказ = Истина;
		Возврат;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереносСуммыОплатыСуммаПереносаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Оплата.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанныеПереноса = Элементы.ПереносСуммыОплаты.ТекущиеДанные;
	ОбновитьОстатокСуммыОплаты(ТекДанныеПереноса, "СуммаПереноса"); 	
	
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныеМетоды

&НаКлиенте
Процедура ОбновитьОстатокСуммыОплаты(СтрокаОплаты, ИмяРеквизитаОбнуления)
	
	ТекДанныеОплаты 	= Элементы.Оплата.ТекущиеДанные;	
	ИдентификаторСтроки = ТекДанныеОплаты.IDСтроки;
	
	СуммаАвизо 	  = ТекДанныеОплаты.Авизо;
	СуммаПереноса = ПолучитьОбщуюСуммуОплатыПоИдентификатору(ИдентификаторСтроки, "ПереносСуммыОплаты", "СуммаПереноса");
	ОбщаяСумма    = СуммаАвизо + СуммаПереноса;
	ТекДанныеОплаты.СуммаОстаток = ТекДанныеОплаты.СуммаОплаты - ОбщаяСумма;
	
	Если ТекДанныеОплаты.СуммаОплаты < ОбщаяСумма Тогда
		ТекДанныеОплаты.СуммаОстаток = ТекДанныеОплаты.СуммаОстаток + СтрокаОплаты[ИмяРеквизитаОбнуления];
		СтрокаОплаты[ИмяРеквизитаОбнуления] = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма переноса превышает сумму оплаты");		
		
		Возврат;
	КонецЕсли;

	
	//ИтоговаяСуммаПереноса = 0;
	//
	//ТекДанные = Элементы.Оплата.ТекущиеДанные;
	//Если ТекДанные = Неопределено Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//НовТекущиеДанные 							= Элементы["ПереносСуммыОплаты"].ТекущиеДанные;
	//Если НовТекущиеДанные = Неопределено Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	//
	//Для Каждого СтрокаТЧ Из Объект.ПереносСуммыОплаты Цикл
	//	
	//	Если СтрокаТЧ.IDСтроки = ТекДанные.IDСтроки Тогда
	//		
	//		ИтоговаяСуммаПереноса = ИтоговаяСуммаПереноса + СтрокаТЧ.СуммаПереноса
	//		
	//	КонецЕсли
	//	
	//КонецЦикла;
	//
	//Если ИтоговаяСуммаПереноса > ТекДанные.СуммаОстаток И ЗначениеЗаполнено(ИзменениеСуммы) Тогда		
	//	
	//	Для Каждого СтрокаТЧ Из Объект.ПереносСуммыОплаты Цикл
	//		
	//		Если СтрокаТЧ.IDСтроки = ТекДанные.IDСтроки Тогда
	//			
	//			СтрокаТЧ.Суммапереноса = 0;
	//			
	//		КонецЕсли
	//		
	//	КонецЦикла;
	//	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма переноса превышает сумму оплаты");
	//	
	//КонецЕсли;
	//
	//Если ИтоговаяСуммаПереноса > ТекДанные.СуммаОстаток Тогда
	//	
	//	НовТекущиеДанные.СуммаПереноса = 0;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма переноса превышает сумму оплаты");
	//	
	//КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОбщуюСуммуОплатыПоИдентификатору(ИдентификаторСтроки, ИмяТаблицы, ИмяРеквизитаСуммы)
	
	ТаблицаОплат = Объект[ИмяТаблицы];
	ОбщаяСумма = 0;
	Для Каждого СтрокаНабора Из ТаблицаОплат Цикл 		
		Если СтрокаНабора.IDСтроки = ИдентификаторСтроки Тогда			
			ОбщаяСумма = ОбщаяСумма + СтрокаНабора[ИмяРеквизитаСуммы];			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат ОбщаяСумма;
КонецФункции

#КонецОбласти

#КонецОбласти    

#Область ВыборДиалогаФайла

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбораКлиент()
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПослеВыбораПутиКФайлу" , ЭтотОбъект);
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОбработчикЗавершения, Диалог);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПутиКФайлу(Результат, ДополнительныеПараметры) Экспорт 
	
	ПутьСохранения = "";	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Объект.ФайлДляЧтения = Результат[0];
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадолженность

&НаКлиенте
Процедура ЗадолженностьСуммаОплатыПриИзменении(Элемент)
	
	ТекСтр = Элементы.Задолженность.ТекущиеДанные;
	
	СтрУслуги = Объект.Оплата.НайтиСтроки(Новый Структура("IDСтроки", ТекСтр.IDСтроки));
	
	Если СтрУслуги.Количество() > 0 Тогда
		СуммаОплаты = СтрУслуги[0].СуммаОплаты;
		
		СтрокиЗадолженности = Объект.Задолженность.НайтиСтроки(Новый Структура("IDСтроки", ТекСтр.IDСтроки));
		
		СуммаОплатыЗадолженности = 0;
		
		Для ИндексСтр = 0 По СтрокиЗадолженности.ВГраница() Цикл	
			
			СуммаОплатыЗадолженности = СуммаОплатыЗадолженности + СтрокиЗадолженности[ИндексСтр].СуммаОплаты; 
			Если СуммаОплатыЗадолженности > СуммаОплаты Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту " + СтрУслуги[0].Абонент + " сумма распределения превысила сумму оплаты.");
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьИтогиТЧЗадолженность();
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ФайлДляЧтения) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите файл для чтения",,"ФайлДляЧтения","ФайлДляЧтения");
		Возврат;
	КонецЕсли;   	
	
	ДвоичныеДанные  	= Новый ДвоичныеДанные(Объект.ФайлДляЧтения); 	
	АдресХранилища  	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
	
	ОписаниеОшибки  	= ЗагрузитьФайлСервер(АдресХранилища,Объект.ИсточникПоступления);
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ПослеСообщенияОбОшибкеПередЗагрузкой",ЭтотОбъект);
	Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
		ПоказатьВопрос(ОписаниеОповещения,ОписаниеОшибки,РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьДанные(Команда)
	
	ТарифныеЗоны=ИспользоватьТарифныеЗоны;
	Шкалы=ИспользоватьШкалыПриборовУчета;
	ИсправитьДанныеНаСервере(ТарифныеЗоны, Шкалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказания(Команда)
	ОбновитьПоказанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗадолженности(Команда)
	
	ТекущиеДанные 							= Элементы.Оплата.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураОтбора = Новый Структура("Период,ПериодНачисления,Организация,Район,Строение,Абонент,Услуга",КонецДня(Объект.Дата));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекущиеДанные);
	
	МассивЗагруженныхПериодов = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	НайденныеСтроки = Объект.Задолженность.НайтиСтроки(Новый Структура("IDСтроки", ТекущиеДанные.IDСтроки));
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		ЗагруженныеДанные = Новый Структура("ПериодНачисления, ВидЗадолженности", Строка.ПериодНачисления, Строка.ВидЗадолженности);
		МассивЗагруженныхПериодов.Добавить(Новый Структура("ПериодНачисления, ВидЗадолженности", Строка.ПериодНачисления, Строка.ВидЗадолженности));
		
	КонецЦикла;
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора, ЗагруженныеПериоды", СтруктураОтбора, МассивЗагруженныхПериодов);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ФормаЗадолженностьОкончаниеВыбора",ЭтаФорма,Новый Структура("IDСтроки", ТекущиеДанные.IDСтроки));
	
	ОткрытьФорму("Документ.энргПлатежноеПоручениеВходящие.Форма.ФормаВыбораЗадолженности",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ПровестиРегистрацииПоказаний(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеПроведениеПоказанийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеРегистрацииПоказаний(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказанийКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиемакетаПоЗагрузкеДанных

&НаКлиенте
Процедура НеЗагруженныеДанные(Команда)
	
	спЗначений = СписокОпераций();
	ВыбратьОперациюИзСписка(спЗначений,Элементы.ЗагрузитьУ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОперациюИзСписка(СписокОпераций, элемент)
	
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВыбратьОперациюИзСпискаЗавершение",ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещения,СписокОпераций, элемент);
	
КонецПроцедуры

&НаКлиенте
Функция СписокОпераций()
	
	Список  = Новый СписокЗначений;
	Список.Добавить(0,"Загруженные данные");
	Список.Добавить(1,"Не загруженные данные");
	
	Возврат Список;	
КонецФункции

&НаКлиенте
Процедура ВыбратьОперациюИзСпискаЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено тогда
		Возврат;
	КонецЕсли;
	Если ВыбранныйЭлемент = Неопределено
		Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ничего не выбрано");
		
	ИначеЕсли ВыбранныйЭлемент.Значение = 0  тогда
		ТабДок = СформироватьПротоколЗагруженныхДанныхНАсервере();
		ТабДок.показать();
	ИначеЕсли ВыбранныйЭлемент.Значение = 1 Тогда
		ТАбДок = СформироватьПротоколНеЗагруженныхДанныхНаСервере();
		ТабДок.показать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРеестр(Команда)
	ТАбДок = СформироватьРеестрНаСервере();
	ИмяФайла	= "ПП №" + СокрЛП(Объект.Номер) + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	СохранитьВЭксель(ТАбДок, ИмяФайла + ".xlsx");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВЭксель(ТабДок, ИмяФайла, ВыбранныйКаталогСохранения = Неопределено)
	
	Попытка
		
		КаталогСохранения = КаталогВременныхФайлов();
		Если НЕ ВыбранныйКаталогСохранения = Неопределено Тогда
			КаталогСохранения = ВыбранныйКаталогСохранения;
		КонецЕсли;		
		ТабДок.Записать(КаталогСохранения + "\" + ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		ЗапуститьПриложение(КаталогСохранения + "\" + ИмяФайла);
		
	Исключение
		
		инфОшибки = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сохранить файл(ы) по причине: " + Символы.ПС + КраткоеПредставлениеОшибки(инфОшибки));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СформироватьПротоколЗагруженныхДанныхНАсервере()
	ТабДок = Документы.энргПлатежноеПоручениеВходящие.СформироватьПротоколЗагруженныхДанных(Объект);
	Возврат табДок;
КонецФункции	

&НаСервере
Функция СформироватьПротоколНеЗагруженныхДанныхНаСервере()
	ТабДок =Документы.энргПлатежноеПоручениеВходящие.СформироватьПротоколНеЗагруженныхДанных(Объект);
	Возврат табДок;
КонецФункции	

&НаСервере
Функция СформироватьРеестрНаСервере()
	ТабДок = Документы.энргПлатежноеПоручениеВходящие.СформироватьРеестрОплат(Объект);
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВопросаОПометкеСвязанныхДокументов(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказанийКлиент();
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеСообщенияОбОшибкеПередЗагрузкой(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные  	= Новый ДвоичныеДанные(Объект.ФайлДляЧтения); 	
	АдресХранилища  	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
	
	ЗагрузитьПослеПроверкиПослеЗагрузки(Неопределено, АдресХранилища, Неопределено);
	
КонецПроцедуры

&НаСервере
Функция ВернутьПУ(Период, Абонент,точкаучета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПриборыТочекУчетаСрезПоследних.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.энргПриборыТочекУчета.СрезПоследних(
	|			&Период,
	|			ТочкаУчета = &ТочкаУчета
	|				И Район = &Район
	|				И &КлючПомещения = КлючПомещения) КАК энргПриборыТочекУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("КлючПомещения"	, Абонент.КлючПомещения);
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Район"			,  Абонент.Район);
	Запрос.УстановитьПараметр("ТочкаУчета"		, ТочкаУчета);
	
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	МассивПриборов 		= новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПриборов.Добавить(Выборка.ПриборУчета);
	КонецЦикла;
	
	Возврат МассивПриборов; 	
	
КонецФункции

&НаСервере
Процедура ОбновитьКолВоСтрокВТЧ()
	СтрокВОплате 									= Объект.Оплата.Количество();
	СтрокВПоказаниях 								= Объект.ТочкиУчета.Количество();
	СтрокВНеЗагрежнных								= Объект.НеЗагруженныеДанные.Количество();
	
	Элементы.СтраницаОплата.Заголовок 				= "Оплата" + " (" + СтрокВОплате + ")";
	//Элементы.СтраницаПоказания.Заголовок 			= "Показания приборов учета" + " (" + СтрокВПоказаниях + ")";
	Элементы.СтраницыШкалыТарифныеЗоны.Заголовок	= "Показания приборов учета" + " (" + СтрокВПоказаниях + ")";
	Элементы.СтраницаНеЗагруженныеДанные.Заголовок 	= "Незагруженные данные" + " (" + СтрокВНеЗагрежнных + ")";
КонецПроцедуры

&НаСервере
Функция ЗагрузитьФайлСервер(АдресХранилища,ИсточникПоступления)
	
	ОбъектОбработки 		= ОбъектОбработкиЗагрузки(ИсточникПоступления);
	ДанныеДокумента  		= ОбъектОбработки.ДанныеДокумента();
	ЗаполнитьЗначенияСвойств(ДанныеДокумента,Объект);	
	ОшибкиПеред 			= "";
	Попытка
		ОшибкиПеред 		= ОбъектОбработки.ПередЗагрузкой(АдресХранилища,ДанныеДокумента);
	Исключение
		// Обработка не требуется
	КонецПопытки;
	
	Если ДанныеДокумента.Свойство("РеквизитыФормы") и НЕ ПустаяСтрока(ДанныеДокумента.РеквизитыФормы) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДокумента,ЭтаФорма,ДанныеДокумента.РеквизитыФормы);
	КонецЕсли; 	
	
	Если Не ПустаяСтрока(ОшибкиПеред) Тогда
		Возврат ОшибкиПеред; 
	КонецЕсли;	
	
	ЗагрузитьПослеПроверкиПослеЗагрузки(ОбъектОбработки, АдресХранилища, ДанныеДокумента);
	УстановитьВидимостьФункционалаРегистрацииПоказаний();
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПослеПроверкиПослеЗагрузки(Знач ОбъектОбработки, АдресХранилища, ДанныеДокумента) 
	
	Если ОбъектОбработки = Неопределено Тогда
		ОбъектОбработки 	= ОбъектОбработкиЗагрузки(Объект.ИсточникПоступления);
	КонецЕсли; 	
	
	Если ДанныеДокумента = Неопределено Тогда
		ДанныеДокумента 	= ОбъектОбработки.ДанныеДокумента();
		ЗаполнитьЗначенияСвойств(ДанныеДокумента,Объект);		
	КонецЕсли; 
	
	Ошибка  				= ОбъектОбработки.Загрузить(АдресХранилища,ДанныеДокумента);
	
	Если ЗначениеЗаполнено(Ошибка) тогда
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	ДействияПослеЗагрузкиФайлаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДействияПослеЗагрузкиФайлаСервер()
	ОбновитьКолВоСтрокВТЧ();
		
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Оплата");
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета,Объект);
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,Объект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, Объект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	ПоказанияПредоставляютсяВСрок();
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПриЗаполненииТабличнойЧастиПоказания();
	ВспомогательныеПараметры.Период = Объект.Дата;
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Неопределено); 
	тзПриборыДляОтклоненияПоказаний 			= ПолучитьТЗПриборыДляОтклоненияПоказаний(); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Объект.Организация,Неопределено,ТаблицаПоказанийДляЗаполнения,Объект.Дата, тзПриборыДляОтклоненияПоказаний);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета,ВспомогательныеПараметры);
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);	
	ПоказанияПредоставляютсяВСрок();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказанияНаСервере()	
	
	Запрос = Новый Запрос;
	Запрос. Текст ="ВЫБРАТЬ
	|	ТекущиеДанные.номерСтроки,
	|	ВЫРАЗИТЬ(ТекущиеДанные.Абонент КАК Справочник.энргАбоненты) КАК Абонент,
	|	ТекущиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ТекущиеДанные.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПриборУчета КАК ПриборУчета,
	|	ТекущиеДанные.КоэффициентПУ КАК Коэффициент,
	|	ТекущиеДанные.МаксимальноВозможныеПоказания КАК МаксимальноВозможные,
	|	ТекущиеДанные.МаксимальноВозможныйОбъемПотребления КАК МаксимальныйОбъемПотребления,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.Переворот КАК ТекущийПереворот,
	|	ТекущиеДанные.СостояниеПоказаний КАК ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем,
	|	ТекущиеДанные.СтатусИзмененПользователем
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанные.номерСтроки,
	|	ТекущиеДанные.Абонент,
	|	ТекущиеДанные.ТочкаУчета,
	|	ТекущиеДанные.ЗначениеТарифа,
	|	ТекущиеДанные.Услуга,
	|	ТекущиеДанные.ПриборУчета,
	|	ТекущиеДанные.Коэффициент,
	|	ТекущиеДанные.МаксимальноВозможные,
	|	ТекущиеДанные.МаксимальныйОбъемПотребления,
	|	ТекущиеДанные.ТекущиеПоказания,
	|	ТекущиеДанные.ТекущийПереворот,
	|	ТекущиеДанные.ТекущиеСостояниеПоказаний,
	|	ТекущиеДанные.ПереворотИзмененПользователем,
	|	ТекущиеДанные.СтатусИзмененПользователем,
	|	ТекущиеДанные.Абонент.Район КАК Район
	|ПОМЕСТИТЬ ВТ_Срайоном
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Срайоном.номерСтроки,
	|	ВТ_Срайоном.Абонент,
	|	ВТ_Срайоном.ТочкаУчета,
	|	ВТ_Срайоном.ЗначениеТарифа,
	|	ВТ_Срайоном.Услуга,
	|	ВТ_Срайоном.ПриборУчета,
	|	ВТ_Срайоном.Коэффициент,
	|	ВТ_Срайоном.МаксимальноВозможные,
	|	ВТ_Срайоном.МаксимальныйОбъемПотребления,
	|	ВТ_Срайоном.ТекущиеПоказания,
	|	ВТ_Срайоном.ТекущийПереворот,
	|	ВТ_Срайоном.ТекущиеСостояниеПоказаний,
	|	ВТ_Срайоном.ПереворотИзмененПользователем,
	|	ВТ_Срайоном.СтатусИзмененПользователем,
	|	ВТ_Срайоном.Район КАК Район
	|ИЗ
	|	ВТ_Срайоном КАК ВТ_Срайоном
	|ИТОГИ ПО
	|	Район";
	
	
	ТекущиеДанные  			= Объект.Показания.Выгрузить();
	ПоказанияПоРайону		= ТекущиеДанные.Скопировать();
	ПоказанияПоРайону.Очистить();
	
	Запрос.УстановитьПараметр("ТекущиеДанные",ТекущиеДанные);
	РезультатЗапроса 		= Запрос.Выполнить();
	
	ВыборкаРайон 			= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРайон.Следующий() Цикл
		// Вставить обработку выборки ВыборкаРайон 		
		Выборка 			= ВыборкаРайон.Выбрать(); 		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ПоказанияПоРайону.Добавить(),Выборка);
		КонецЦикла;      		
		ПоказанияПоРайону.Очистить();		
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентаПоКоду(Код)
	
	Возврат Справочники.энргКонтрагенты.НайтиПоКоду(Код);
	
КонецФункции

&НаСервере 
Процедура ИсправитьДанныенаСервере(ТарифнаяЗона, Шкала)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	ТекущиеДанные.ПериодОплаты КАК ПериодОплаты,
	|	ТекущиеДанные.СуммаОплаты КАК СуммаОплаты,
	|	ТекущиеДанные.ФИОПлательщика КАК ФИОПлательщика,
	|	ТекущиеДанные.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ТекущиеДанные.ЛицевойСчет КАК ЛицевойСчет,
	|	ТекущиеДанные.НомерПрибораУчета КАК НомерПрибораУчета,
	|	ТекущиеДанные.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	|	ТекущиеДанные.НомерПлатежногоДокумента КАК НомерПлатежа,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ТекущиеДанные КАК ТекущиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеДанные.Услуга КАК Услуга,
	|	энргАбоненты.Ссылка КАК Абонент,
	|	ТекущиеДанные.СуммаОплаты КАК СуммаОплаты,
	|	ТекущиеДанные.ПериодОплаты КАК ПериодОплаты,
	|	ТекущиеДанные.ДатаПлатежа КАК ДатаПлатежа,
	|	ТекущиеДанные.НомерПлатежа КАК НомерПлатежа,
	|	ТекущиеДанные.ФИОПлательщика КАК ФИОПлательщика,
	|	ТекущиеДанные.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ТекущиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТекущиеДанные.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргФилиалыАбонентовСрезПоследних.Филиал КАК Филиал
	|ПОМЕСТИТЬ ВТ_Абонент
	|ИЗ
	|	ТекущиеДанные КАК ТекущиеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних(&ДатаДок, ) КАК энргФилиалыАбонентовСрезПоследних
	|			ПО энргАбоненты.Ссылка = энргФилиалыАбонентовСрезПоследних.Абонент
	|		ПО ТекущиеДанные.ЛицевойСчет = энргАбоненты.ЛицевойСчет
	|ГДЕ
	|	энргАбоненты.ЛицевойСчет = ТекущиеДанные.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга,
	|	ВТ_Абонент.Абонент КАК Абонент,
	|	энргУслугиТочекУчетаСрезПоследних.Период КАК Период,
	|	энргУслугиТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргУслугиТочекУчетаСрезПоследних.Организация КАК Организация,
	|	энргУслугиТочекУчетаСрезПоследних.Район КАК Район
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	ВТ_Абонент КАК ВТ_Абонент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|				&ДатаДок,
	|				КлючПомещения В
	|					(ВЫБРАТЬ
	|						ВТ_Абонент.КлючПомещения КАК КлючПомещения
	|					ИЗ
	|						ВТ_Абонент КАК ВТ_Абонент)) КАК энргУслугиТочекУчетаСрезПоследних
	|		ПО ВТ_Абонент.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
	|ГДЕ
	|	энргУслугиТочекУчетаСрезПоследних.Услуга = ВТ_Абонент.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	ВТ_Услуги.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ТочкиУчета
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|				&ДатаДок,
	|				(Организация, Район, КлючПомещения) В
	|					(ВЫБРАТЬ
	|						ВТ_Услуги.Организация КАК Организация,
	|						ВТ_Услуги.Район КАК Район,
	|						ВТ_Услуги.КлючПомещения КАК КлючПомещения
	|					ИЗ
	|						ВТ_Услуги КАК ВТ_Услуги)) КАК энргАктивностьТочекУчетаСрезПоследних
	|		ПО ВТ_Услуги.ТочкаУчета = энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВТ_Услуги.КлючПомещения = энргАктивностьТочекУчетаСрезПоследних.КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Организация КАК Организация,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Район КАК Район,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(энргВидыКанальностиШкалы.Шкала) КАК Шкала
	|ПОМЕСТИТЬ ВТ_ПриборыУчета
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУчетаАбонента.СрезПоследних(
	|			&ДатаДок,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ВТ_Услуги.Организация КАК Организация,
	|					ВТ_Услуги.Район КАК Район,
	|					ВТ_Услуги.КлючПомещения КАК КлючПомещения,
	|					ВТ_Услуги.ТочкаУчета КАК ТочкаУчета
	|				ИЗ
	|					ВТ_Услуги КАК ВТ_Услуги)) КАК энргСостояниеПриборовУчетаАбонентаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|ГДЕ
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Состояние = ЗНАЧЕНИЕ(перечисление.энргСостояниеПриборовУчета.Ввод)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Организация,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Район,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.КлючПомещения,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПриборовУчетаСрезПоследних.Организация КАК Организация,
	|	энргПоказанияПриборовУчетаСрезПоследних.Район КАК Район,
	|	энргПоказанияПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчетаСрезПоследних.Шкала КАК Шкала,
	|	МАКСИМУМ(энргПоказанияПриборовУчетаСрезПоследних.Показание) КАК Показание,
	|	МАКСИМУМ(энргПоказанияПриборовУчетаСрезПоследних.Период) КАК ДатаПоследнихПоказаний
	|ПОМЕСТИТЬ ВТ_ПоказаниеПрибора
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета.СрезПоследних(
	|			&ДатаДок,
	|			(Организация, Район, КлючПомещения, ПриборУчета, Шкала) В
	|					(ВЫБРАТЬ
	|						ВТ_ПриборыУчета.Организация КАК Организация,
	|						ВТ_ПриборыУчета.Район КАК Район,
	|						ВТ_ПриборыУчета.КлючПомещения КАК КлючПомещения,
	|						ВТ_ПриборыУчета.ПриборУчета КАК ПриборУчета,
	|						ВТ_ПриборыУчета.Шкала КАК Шкала
	|					ИЗ
	|						ВТ_ПриборыУчета КАК ВТ_ПриборыУчета)
	|				И СостояниеПоказаний = ЗНАЧЕНИЕ(перечисление.энргСостояниеПоказаний.Приняты)) КАК энргПоказанияПриборовУчетаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПриборовУчетаСрезПоследних.Организация,
	|	энргПоказанияПриборовУчетаСрезПоследних.Район,
	|	энргПоказанияПриборовУчетаСрезПоследних.КлючПомещения,
	|	энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
	|	энргПоказанияПриборовУчетаСрезПоследних.Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.Организация КАК Организация,
	|	ВТ_Услуги.Район КАК Район,
	|	ВТ_Услуги.КлючПомещения КАК КлючПомещения,
	|	ВТ_Услуги.Услуга КАК Услуга,
	|	МАКСИМУМ(ВТ_ПриборыУчета.ПриборУчета) КАК ПриборУчета,
	|	ВТ_Услуги.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_УслугиИПриборыУчета
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПриборыУчета КАК ВТ_ПриборыУчета
	|		ПО ВТ_Услуги.Организация = ВТ_ПриборыУчета.Организация
	|			И ВТ_Услуги.Район = ВТ_ПриборыУчета.Район
	|			И ВТ_Услуги.КлючПомещения = ВТ_ПриборыУчета.КлючПомещения
	|			И ВТ_Услуги.ТочкаУчета = ВТ_ПриборыУчета.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Услуги.Организация,
	|	ВТ_Услуги.Район,
	|	ВТ_Услуги.КлючПомещения,
	|	ВТ_Услуги.Услуга,
	|	ВТ_Услуги.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УслугиИПриборыУчета.Организация КАК Организация,
	|	ВТ_УслугиИПриборыУчета.Район КАК Район,
	|	ВТ_УслугиИПриборыУчета.КлючПомещения КАК КлючПомещения,
	|	ВТ_УслугиИПриборыУчета.Услуга КАК Услуга,
	|	ВТ_УслугиИПриборыУчета.ПриборУчета КАК ПриборУчета,
	|	ВТ_ПриборыУчета.Шкала КАК Шкала,
	|	ВТ_ПриборыУчета.ТочкаУчета КАК ТочкаУчета,
	|	ЗНАЧЕНИЕ(перечисление.энргСостояниеПоказаний.Приняты) КАК ПредыдущиеПоказания,
	|	ЕСТЬNULL(ВТ_ПоказаниеПрибора.Показание, 0) КАК СостояниеПоказаний,
	|	ВТ_ПоказаниеПрибора.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний
	|ПОМЕСТИТЬ ВТ_ПриборыПомещения
	|ИЗ
	|	ВТ_УслугиИПриборыУчета КАК ВТ_УслугиИПриборыУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриборыУчета КАК ВТ_ПриборыУчета
	|		ПО ВТ_УслугиИПриборыУчета.Организация = ВТ_ПриборыУчета.Организация
	|			И ВТ_УслугиИПриборыУчета.Район = ВТ_ПриборыУчета.Район
	|			И ВТ_УслугиИПриборыУчета.КлючПомещения = ВТ_ПриборыУчета.КлючПомещения
	|			И ВТ_УслугиИПриборыУчета.ПриборУчета = ВТ_ПриборыУчета.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказаниеПрибора КАК ВТ_ПоказаниеПрибора
	|		ПО ВТ_УслугиИПриборыУчета.Организация = ВТ_ПоказаниеПрибора.Организация
	|			И ВТ_УслугиИПриборыУчета.Район = ВТ_ПоказаниеПрибора.Район
	|			И ВТ_УслугиИПриборыУчета.КлючПомещения = ВТ_ПоказаниеПрибора.КлючПомещения
	|			И ВТ_УслугиИПриборыУчета.ПриборУчета = ВТ_ПоказаниеПрибора.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_САбонентом.Абонент КАК Абонент,
	|	ВТ_ПриборыПомещения.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ПриборыПомещения.Услуга КАК Услуга,
	|	ВТ_САбонентом.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_САбонентом.ПериодОплаты КАК ПериодОплаты,
	|	ВТ_САбонентом.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_САбонентом.ФИОПлательщика КАК ФИОПлательщика,
	|	ВТ_САбонентом.НомерПлатежа КАК НомерПлатежа,
	|	ВТ_САбонентом.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТ_САбонентом.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_САбонентом.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВТ_САбонентом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ПриборыПомещения.ПриборУчета КАК ПриборУчета,
	|	ВТ_ПриборыПомещения.Шкала КАК Шкала,
	|	ВТ_САбонентом.Филиал КАК Филиал,
	|	ВТ_ПриборыПомещения.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	ВТ_ПриборыПомещения.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВТ_ПриборыПомещения.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение
	|ПОМЕСТИТЬ ВТ_СКлючом
	|ИЗ
	|	ВТ_Абонент КАК ВТ_САбонентом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриборыПомещения КАК ВТ_ПриборыПомещения
	|		ПО ВТ_САбонентом.КлючПомещения = ВТ_ПриборыПомещения.КлючПомещения
	|			И ВТ_САбонентом.Услуга = ВТ_ПриборыПомещения.Услуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВТ_САбонентом.КлючПомещения = энргКлючиПомещений.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПриборыПомещения.ТочкаУчета,
	|	ВТ_САбонентом.Абонент,
	|	ВТ_САбонентом.СуммаОплаты,
	|	ВТ_САбонентом.ПериодОплаты,
	|	ВТ_САбонентом.НазначениеПлатежа,
	|	ВТ_САбонентом.ФИОПлательщика,
	|	ВТ_САбонентом.НомерПлатежа,
	|	ВТ_САбонентом.ДатаПлатежа,
	|	ВТ_САбонентом.ТекущиеПоказания,
	|	ВТ_САбонентом.НомерСтроки,
	|	ВТ_САбонентом.ТарифнаяЗона,
	|	ВТ_ПриборыПомещения.Услуга,
	|	ВТ_ПриборыПомещения.ПриборУчета,
	|	ВТ_ПриборыПомещения.Шкала,
	|	ВТ_САбонентом.Филиал,
	|	ВТ_ПриборыПомещения.ПредыдущиеПоказания,
	|	ВТ_ПриборыПомещения.СостояниеПоказаний,
	|	ВТ_ПриборыПомещения.ДатаПоследнихПоказаний,
	|	энргКлючиПомещений.Строение,
	|	энргКлючиПомещений.Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_Услуги.Услуга КАК Услуга,
	|	ВТ_Услуги.Абонент КАК Абонент,
	|	ВТ_Услуги.Период КАК Период,
	|	ВТ_Услуги.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТочкиУчета.КлючПомещения КАК КлючПомещения,
	|	ВТ_ТочкиУчета.Абонент КАК Абонент
	|ИЗ
	|	ВТ_ТочкиУчета КАК ВТ_ТочкиУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СКлючом.Абонент КАК Абонент,
	|	ВТ_СКлючом.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_СКлючом.Услуга КАК Услуга,
	|	ВТ_СКлючом.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_СКлючом.ПериодОплаты КАК ПериодОплаты,
	|	ВТ_СКлючом.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_СКлючом.ФИОПлательщика КАК ФИОПлательщика,
	|	ВТ_СКлючом.НомерПлатежа КАК НомерПлатежа,
	|	ВТ_СКлючом.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТ_СКлючом.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_СКлючом.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВТ_СКлючом.НомерСтроки КАК НомерСтроки,
	|	ВТ_СКлючом.Абонент.КлючПомещения КАК КлючПомещения,
	|	ВТ_СКлючом.ПриборУчета КАК ПриборУчета,
	|	ВТ_СКлючом.Шкала КАК Шкала,
	|	ВТ_СКлючом.Филиал КАК Район,
	|	ВТ_СКлючом.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	ВТ_СКлючом.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВТ_СКлючом.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	ВТ_СКлючом.Строение КАК Строение,
	|	ВТ_СКлючом.Помещение КАК Помещение
	|ИЗ
	|	ВТ_СКлючом КАК ВТ_СКлючом";
	
	
	
	
	ТекущиеДанные  			= Объект.НеЗагруженныеДанные.Выгрузить();
	Запрос.УстановитьПараметр("ТекущиеДанные", ТекущиеДанные);
	Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
	
	нТочкиУчета = Объект.ТочкиУчета.Выгрузить();
	
	нНеНазгрДанные = Объект.ПоказанияПриборовУчета.Выгрузить();
	
	Результат = Запрос.ВыполнитьПакет();
	Если Результат[9].Пустой() тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не найдена услуга'"));
		Возврат;
	КонецЕсли;
	Если Результат[10].Пустой() тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не найдена точка учета'"));
		Возврат;
	Иначе 
		ДанныеЗапроса = Результат[11];
		Выборка = ДанныеЗапроса.выбрать();
	КонецЕсли;
	
	ТекТочкаУчета 								= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	
	Если ТарифнаяЗона = Истина и Шкала = Истина Тогда
		Пока Выборка.Следующий() цикл
			НоваяТочка=Ложь;
			
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				СтрокаТочкиУчета.Абонент			= Выборка.Абонент; 
			КонецЕсли;
			
			Если НоваяТочка  Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТекущиеПоказания        = Выборка.текущиепоказания;
			СтрокаПоказаний.ТарифнаяЗона        	= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.Сумма					= Выборка.СуммаОплаты;
			СтрокаПоказаний.КоэффициентПУ			= 1;
			СтрокаПоказаний.СостояниеПоказаний		= Перечисления.энргСостояниеПоказаний.Приняты;
			СтрокаПоказаний.ПредыдущиеПоказания		= Выборка.ПредыдущиеПоказания;
			СтрокаПоказаний.ДатаПоследнихПоказаний	= Выборка.ДатаПоследнихПоказаний;
			
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.периодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ТарифнаяЗона и Шкала Тогда 
		
		Пока Выборка.Следующий() цикл
			НоваяТочка = Ложь;
			
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				СтрокаТочкиУчета.Абонент			= Выборка.Абонент; 
				СтрокаТочкиУчета.КлючПомещения		= Выборка.КлючПомещения;
			КонецЕсли;
			
			Если НоваяТочка  Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ТекущиеПоказания        = Выборка.текущиепоказания;
				СтрокаШкалы.Сумма					= Выборка.СуммаОплаты;
				СтрокаШкалы.КоэффициентПУ			= 1;
				СтрокаШкалы.СостояниеПоказаний		= Перечисления.энргСостояниеПоказаний.Приняты;
			КонецЕсли;
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.ПериодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
	КонецЕсли;
	
	Если не Шкала и ТарифнаяЗона Тогда
		
		Пока Выборка.Следующий() цикл
			НоваяТочка = Ложь;
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				
			КонецЕсли;
			
			Если НоваяТочка  Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона        	= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.ТекущиеПоказания        = Выборка.ТекущиеПоказания;
			СтрокаПоказаний.Сумма					= Выборка.СуммаОплаты;
			СтрокаПоказаний.ПредыдущиеПоказания		= Выборка.ПредыдущиеПоказания;
			СтрокаПоказаний.ДатаПоследнихПоказаний	= Выборка.ДатаПоследнихПоказаний;
			СтрокаПоказаний.КоэффициентПУ			= 1;
			СтрокаПоказаний.СостояниеПоказаний		= Перечисления.энргСостояниеПоказаний.Приняты;
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.ПериодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если не Шкала и не ТарифнаяЗона Тогда
		Пока Выборка.Следующий() цикл
			НоваяТочка = Ложь;
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
				НоваяТочка = Истина;
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
				СтрокаТочкиУчета.Абонент			= Выборка.Абонент; 
				СтрокаТочкиУчета.ТекущиеПоказания        = Выборка.ТекущиеПоказания;
				СтрокаТочкиУчета.Сумма					 = Выборка.СуммаОплаты;
				СтрокаТочкиУчета.КоэффициентПУ			 = 1;
				СтрокаТочкиУчета.СостояниеПоказаний		 = Перечисления.энргСостояниеПоказаний.Приняты;
			КонецЕсли;
			
			СтрокаОплаты							= Объект.Оплата.Добавить();
			СтрокаОплаты.Абонент					= Выборка.Абонент;
			СтрокаОплаты.Услуга						= Выборка.Услуга;
			СтрокаОплаты.ПериодОплаты				= Выборка.ПериодОплаты;
			СтрокаОплаты.СуммаОплаты				= Выборка.СуммаОплаты; 
			СтрокаОплаты.ДатаПлатежногоДокумента	= Выборка.ДатаПлатежа;
			СтрокаОплаты.НомерПлатежногоДокумента	= Выборка.Номерплатежа;
			СтрокаОплаты.НазначениеПлатежа			= Выборка.НазначениеПлатежа;
			СтрокаОплаты.ФИОПлательщика				= Выборка.ФИОПлательщика;
			
		КонецЦикла;
		
	КонецЕсли;
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоРайонПриЧтении(Объект.ТочкиУчета,Объект);
	
	объект.НеЗагруженныеДанные.Удалить(Выборка.НомерСтроки-1);	
	
	ОбновитьКолВоСтрокВТЧ();
	
КонецПроцедуры

&НаСервере 
Функция УслугиАбонента(Период,ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Абонент
	|ИЗ
	|	Справочник.энргАбоненты КАК энргАбоненты
	|ГДЕ
	|	энргАбоненты.ЛицевойСчет = &ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	ВТ_Абонент КАК ВТ_Абонент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(&Период, ) КАК энргУслугиТочекУчетаСрезПоследних
	|		ПО ВТ_Абонент.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
	|			И ВТ_Абонент.Район = энргУслугиТочекУчетаСрезПоследних.Район
	|			И ВТ_Абонент.Организация = энргУслугиТочекУчетаСрезПоследних.Организация";
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	МассивПриборов 		= новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПриборов.Добавить(Выборка.Услуга);
	КонецЦикла;
	
	Возврат МассивПриборов; 
	
КонецФункции

&НаКлиенте
Процедура НеЗагруженныеДанныеУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные=Элементы.НеЗагруженныеДанные.ТекущиеДанные;
	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура("Отбор", Новый Структура("Ссылка", УслугиАбонента(Объект.Дата,ТекущиеДанные.лицевойсчет)));
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", ПараметрыФормы, Элемент);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ИдентификаторСтроки = Неопределено, Район, КлючПомещения)
	
	ТочкаУчета = Неопределено;
	СтрокиПоказаний = Неопределено;
	
	Если ИдентификаторСтроки = Неопределено Тогда
		ТаблицаТЧ 									= Объект.ПоказанияПриборовУчета.Выгрузить();
		Объект.ШкалыПриборовУчета.Очистить();
		Объект.ПоказанияПриборовУчета.Очистить();
		Объект.ТочкиУчета.Очистить();
	Иначе
		СтрокаТочкиУчета  							= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТочкаУчета 									= СтрокаТочкиУчета.ТочкаУчета;
		ПоискШкал	 								= Новый Структура("IDСтрокиТочкиУчета",СтрокаТочкиУчета.IDСтроки);
		СтрокиШкал  								= Объект.ШкалыПриборовУчета.НайтиСтроки(ПоискШкал);
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			ПоискПоказаний 							= Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки);
			СтрокиПоказаний 						= Объект.ПоказанияПриборовУчета.НайтиСтроки(ПоискПоказаний);
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
			КонецЦикла;
			Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
		КонецЦикла;		
	КонецЕсли;
	
	Результат 										= Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы(Объект.Дата,Объект.Организация,Район,КлючПомещения,ТочкаУчета,Новый Структура("ТолькоОткрытыеЛС", Истина)); 
	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			Если ИдентификаторСтроки = Неопределено Тогда
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			иначе 				
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
				IDСтрокиТочки 						= СтрокаТочкиУчета.IDСтроки;
			КонецЕсли;
			СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 			= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 		= Выборка.РегистрируетОбъем;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			Если НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
			
			Если НЕ СтрокиПоказаний = Неопределено Тогда
				Для Каждого СтрокаПоказанийСтарая Из СтрокиПоказаний Цикл
					
					Если НЕ СтрокаПоказанийСтарая.ТарифнаяЗона = Выборка.ТарифнаяЗона Тогда
						Продолжить;	
					КонецЕсли;
					
					СтрокаПоказаний.ТекущиеПоказания = СтрокаПоказанийСтарая.ТекущиеПоказания;
					
				КонецЦикла;	
			КонецЕсли;
			
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;
		ТекШкала 									= Выборка.Шкала;
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Район,КлючПомещения,ИдентификаторСтроки); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,Объект.Район,ТаблицаПоказанийДляЗаполнения,Объект.Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Функция ОбъектОбработкиЗагрузки(ИсточникПоступления) 
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Источник",ИсточникПоступления);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргНастройкиЗагрузкиОплаты.ОбработкаЗагрузки
	|ИЗ
	|	РегистрСведений.энргНастройкиЗагрузкиОплаты КАК энргНастройкиЗагрузкиОплаты
	|ГДЕ
	|	энргНастройкиЗагрузкиОплаты.Источник = &Источник";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить обработку для загрузки файла");
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка  = Результат.Выбрать();
	Выборка.Следующий();
	
	ВнешняяОбработкаОбъект  = Выборка.ОбработкаЗагрузки.ПолучитьОбъект();
	ИмяФайла  				= ПолучитьИмяВременногоФайла("epf");
	ДвоичныеДанные 			= ВнешняяОбработкаОбъект.ХранилищеОбработки.получить();
	ДвоичныеДанные.записать(ИмяФайла);
	
	Возврат ВнешниеОбработки.Создать(ИмяФайла,Ложь);
КонецФункции

&НаКлиенте
Процедура ФормаЗадолженностьОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		
		Модифицированность	= Истина;
		
		Для каждого СтрокаДолг Из РезультатЗакрытия Цикл
			
			СтрокаТЗ = Объект.Задолженность.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаДолг);
			СтрокаТЗ.IDСтроки = ДополнительныеПараметры.IDСтроки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте

Процедура ОбновитьИтогиТЧЗадолженность()
	
	ИтогСуммаОплаты = 0;
	ИтогЗадолженность = 0;
	
	Для каждого Стр Из Объект.Задолженность Цикл
		
		Если Элементы.Задолженность.ПроверитьСтроку(Стр.ПолучитьИдентификатор()) Тогда
			
			ИтогСуммаОплаты = ИтогСуммаОплаты + Стр.СуммаОплаты;
			ИтогЗадолженность = ИтогЗадолженность + Стр.Задолженность;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ЗадолженностьСуммаОплаты.ТекстПодвала = ИтогСуммаОплаты;
	Элементы.ЗадолженностьЗадолженность.ТекстПодвала = ИтогЗадолженность;
	
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчета

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	// энргРаботаСПоставщиками }
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	ИмяТаблицыПоказания						= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент) 
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
	
КонецПроцедуры

#Область СобытияТаблицыФормыПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
	//энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазница1ПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворот1ПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры   

#КонецОбласти

#КонецОбласти

#Область СервисПроверкиПоказанийПриборовУчета

&НаСервере
Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний()
	
	ТаблицаПриборов = энргРаботаСПоказаниямиПриборовУчетаСервер.НоваяТаблицаПриборовДляПроверки();
	Для Каждого ТекСтрока из Объект.ТочкиУчета Цикл
		НСтрока = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		НСтрока.Район 			= ТекСтрока.Район;
		НСтрока.КлючПомещения 	= ТекСтрока.КлючПомещения;
	КонецЦикла;
	
	ПериодЗапроса 		= Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПроверкиОтклоненияПоказаний();
	ВспомогательныеПараметры.ПоказанияВСрок = ПоказанияВСрок;
	ВспомогательныеПараметры.ПериодНачисления = Объект.ПериодНачисления;
	
	РезультатЗапроса = энргРаботаСПоказаниямиПриборовУчетаСервер.ПриборыДляОтклоненияПоказаний(ПериодЗапроса, Объект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ЭтотОбъект, РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ПоказанияПредоставляютсяВСрок()
	ПоказанияВСрок = энргРаботаСПоказаниямиПриборовУчетаСервер.ПоказанияПредоставляютсяВСрок(Объект.ПериодНачисления, Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные)
	РезультатПроверки = энргРаботаСПоказаниямиПриборовУчетаКлиент.ОпределитьСостояниеПоказанийПоСтроке(ТекущиеДанныеТочкиУчета.ПриборУчета, ЭтотОбъект, ТекущиеДанные);
	Если РезультатПроверки.СостояниеИзменено Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, РезультатПроверки);
		Возврат;
	КонецЕсли;
	
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата); 
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗПриборыДляОтклоненияПоказаний()
	
	тзПриборыДляОтклоненияПоказаний 							= Новый ТаблицаЗначений;		
	
	тзПриборыДляОтклоненияПоказаний.Колонки.добавить("ПриборУчета",						Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	тзПриборыДляОтклоненияПоказаний.Колонки.добавить("СостояниеПоказаний",				Новый ОписаниеТипов("ПеречислениеСсылка.энргСостояниеПоказаний"));
	тзПриборыДляОтклоненияПоказаний.Колонки.добавить("ПричинаОтклонения",				Новый ОписаниеТипов("ПеречислениеСсылка.энргПричиныОтклоненияПоказаний"));
	
	
	
	Для Каждого ТекСтрока из ЭтотОбъект.ПриборыДляОтклоненияПоказаний Цикл
		НСтрока = тзПриборыДляОтклоненияПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		
	КонецЦикла;
	
	Возврат тзПриборыДляОтклоненияПоказаний;
	
КонецФункции

#КонецОбласти

#Область СервисСозданияДокументовРегистрацииПоказаний

&НаСервере
Процедура УстановитьОтборДокументовРегистрацииПоказаний()
	
	ДокументОснованиеСсылка = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ДокументыПоказанийПриборовУчета,
		"ДокументОснование",
		ДокументОснованиеСсылка);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ДокументыПоказанийПриборовУчета,
		"ПоказыватьОтклоненные",
		Ложь);	
		
КонецПроцедуры


#Область ОтчетПоказаний

&НаКлиенте
Процедура ДокументыПоказанийПриборовУчетаПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ДокументыПоказанийПриборовУчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыПоказанийПриборовУчетаПриАктивизацииСтрокиНаСервере(ДанныеРегистрацииПоказаний, ТекДанные.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументыПоказанийПриборовУчетаПриАктивизацииСтрокиНаСервере(ТабДок, ДокументПоказаний)
	
	ТабДок.Очистить();
	энргМассоваяРегистрацияПоказаний.ЗаполнитьМакетПоказанийПоДокументуПоказаний(ТабДок, ДокументПоказаний);
	
	//Макет = Документы.энргПлатежноеПоручениеВходящие.ПолучитьМакет("МакетДанныеРегистрацииПоказаний");
	//ОбластьШапкаДетальныхЗаписей = Макет.ПолучитьОбласть("ШапкаДетали");
	//ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");	
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ПоказанияПредоставлены КАК Предоставлены,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	//	|	ПРЕДСТАВЛЕНИЕ(энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТарифнаяЗона) КАК ТарифнаяЗонаПредставление,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Переворот КАК Переворот,
	//	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Разница КАК Разница
	//	|ИЗ
	//	|	Документ.энргРегистрацияПоказанийАбонента.ТочкиУчета КАК энргРегистрацияПоказанийАбонентаТочкиУчета
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ШкалыПриборовУчета КАК энргРегистрацияПоказанийАбонентаШкалыПриборовУчета
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ПоказанияПриборовУчета КАК энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета
	//	|			ПО энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка
	//	|				И (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = &Ссылка)
	//	|				И (энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка.Ссылка = &Ссылка)
	//	|				И энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтроки = энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.IDСтроки
	//	|		ПО энргРегистрацияПоказанийАбонентаТочкиУчета.Ссылка = энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка
	//	|			И (энргРегистрацияПоказанийАбонентаТочкиУчета.Ссылка = &Ссылка)
	//	|			И (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = &Ссылка)
	//	|			И энргРегистрацияПоказанийАбонентаТочкиУчета.IDСтроки = энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтрокиТочкиУчета";
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументПоказаний);
	//
	//ТабДок.Вывести(ОбластьШапкаДетальныхЗаписей);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Выборка = РезультатЗапроса.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	ОбластьДетальныхЗаписей.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(ОбластьДетальныхЗаписей);
	//КонецЦикла; 
	
КонецФункции   
	
#КонецОбласти

#Область РаботаСФоновымСозданиемДокументов

&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументовВФоне()
	
	ПараметрыПередачи = Новый Структура("ДокументСсылка", Объект.Ссылка);
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормыРаботыВФоне", ЭтотОбъект);
	ОткрытьФорму(
		"Документ.энргЗагрузкаПоказанийИзВнешнихИсточников.Форма.ФормаСозданияДокументовВФоне",
		ПараметрыПередачи,,,,,ОповещениеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗакрытияФормыРаботыВФоне(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();	
	УстановитьОтборДокументовРегистрацииПоказаний();
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры	


&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументов(Команда)
	ОткрытьФормуЗапускаСозданияДокументовВФоне();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОпераций(Команда)
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОперацийКлиент()
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(Объект.Ссылка);
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНадписьСозданияДокументов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГрупппаВыполненияДлительныхОпераций",
		"Видимость",
		Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьВыполненияДлительныхОпераций",
		"ЦветТекста",
		Новый Цвет(255,0,0));
						
	ЭтоСтараяВерсия = ЭтоСтараяВерсияРегистрацииПоказанийКлиент();
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 ИЛИ ЭтоСтараяВерсия Тогда 
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГрупппаВыполненияДлительныхОпераций",
			"Видимость",
			Ложь);
				
		Возврат;
		
	КонецЕсли;
		
	Если КоличествоАктивныхДлительныхОпераций > 0 Тогда
		
		ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов %2";
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НадписьВыполненияДлительныхОпераций",
			"Заголовок",
			СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций, КоличествоАктивныхДлительныхОпераций));
			
		Возврат;
		
	КонецЕсли;	
	
	ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов нет, необходимо повторно запустить процесс создания документов.";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьВыполненияДлительныхОпераций",
		"Заголовок",
		СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций));	
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка)	
	
	Возврат	РегистрыСведений.энргЗагрузкаПоказанийТочкиУчета.КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка);
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьКоличествоАктивныхДлительныхОпераций()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КоличествоАктивныхДлительныхОпераций = 0;
	Активные = ДлительныеОперацииКлиент.АктивныеДлительныеОперации();
	
	Для Каждого КлючЗначение Из Активные.Список Цикл
		Попытка
			
			Если КлючЗначение.Значение.ОповещениеОЗавершении.ДополнительныеПараметры.ДокументСсылка = Объект.Ссылка Тогда
				КоличествоАктивныхДлительныхОпераций = КоличествоАктивныхДлительныхОпераций + 1;					
			КонецЕсли; 			
			
		Исключение
			
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти


#Область РаботаССостояниемДокументовПоказаний


#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	// 1. Запуск фонового задания на сервере.
	ЗависимыеРеквизиты = ПолучитьЗависимыеРеквизиты();
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитов", ЭтотОбъект);
	
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка, 
		ЗависимыеРеквизиты);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияСменаЗависимыхРеквизитов(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПроведениеПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеПроведениеПоказанийКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияПроведениеПоказаний", ЭтотОбъект);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеПроведениеПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
		
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияПроведениеПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиОтменаПроведенияПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказанийКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияОтменаПроведенияПоказаний", ЭтотОбъект);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
		
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияОтменаПроведенияПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиУстановкаПометкиУдаленияПоказаний

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказанийКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗаданияУстановкаПометкиУдаленияПоказаний", ЭтотОбъект);
	энргМассоваяРегистрацияПоказанийКлиент.ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказаний(
		ЭтотОбъект,
		Оповещение,
		Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗаданияУстановкаПометкиУдаленияПоказаний(РезультатВыполнения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	Элементы.ДокументыПоказанийПриборовУчета.Обновить();
	ФайлДляЧтенияНачалоВыбораКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДатойДокумента

&НаКлиенте
Процедура УстановитьДатуОтСвязанныхДокументовПоказаний()
	
	Объект.Дата = ПолучитьДатуОтСвязанныхДокументовПоказаний(Объект.Ссылка, Объект.Дата);	
	ЗаполнитьПериодНачисленияСервер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента)
	
	Возврат энргМассоваяРегистрацияПоказаний.ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента);
	
КонецФункции

#КонецОбласти

#КонецОбласти 

#Область РазграничениеФункционала

&НаСервере
Процедура УстановитьВидимостьФункционалаРегистрацииПоказаний()
	
	ЭтоСтараяВерсия = ЭтоСтараяВерсияРегистрацииПоказаний();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницыШкалыТарифныеЗоны",
		"Видимость",
		ЭтоСтараяВерсия);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаДокументыПоказанийПриборовУчета",
		"Видимость",
		НЕ ЭтоСтараяВерсия);	
	
КонецПроцедуры


// Функция - Обратная совместимость
// Разграничивает функционал регистрации показаний старых документов и новых 	
// СтараяВерсия - Регистрация и исправление показаний в текущем документе 
// НоваяВерсия - Регистрация и исправление показаний в документах Рег. показаний
//
// Возвращаемое значение:
// Результат  - Булево
//
&НаКлиенте
Функция ЭтоСтараяВерсияРегистрацииПоказанийКлиент()
	
	Результат = Объект.ТочкиУчета.Количество() > 0;
	Возврат Результат;
	
КонецФункции

// Функция - Обратная совместимость
// Разграничивает функционал регистрации показаний старых документов и новых 	
// СтараяВерсия - Регистрация и исправление показаний в текущем документе 
// НоваяВерсия - Регистрация и исправление показаний в документах Рег. показаний
//
// Возвращаемое значение:
// Результат  - Булево
//
&НаСервере
Функция ЭтоСтараяВерсияРегистрацииПоказаний()
	
	Результат = Объект.ТочкиУчета.Количество() > 0;
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты)
	//Возврат Документы.энргРегистрацияПоказанийАбонента.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
	Возврат энргМассоваяРегистрацияПоказаний.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
КонецФункции 

&НаКлиенте
Процедура ПослеВопросаОНеобходимостиКорректировкиСвязанныхДокументов(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		УстановитьДатуОтСвязанныхДокументовПоказаний();
		Возврат;
	КонецЕсли;
	
	ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитовКлиент();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗависимыеРеквизиты()
	
	Результат = Новый Структура("Дата", Объект.Дата);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПриИзмененииФайлаЗагрузки

&НаСервереБезКонтекста
Функция ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(ДокументОснование)
	
	Возврат энргМассоваяРегистрацияПоказаний.ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(ДокументОснование);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ФискальныеОперацииОФД

&НаСервереБезКонтекста

Функция ПодсистемаИнтеграцияОФДСуществует() 
	Возврат энргОбщегоНазначения.ПодсистемаИнтеграцияОФДСуществует();
КонецФункции

#КонецОбласти

#Область ЗаполнитьЕдиничнуюОплатуИзЗагрузкиДанных

Процедура ЗаполнитьВозможностьДобавленияЕдиничнойОплат()
	
	ДобавлениеЕдиничнойОплаты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры.ЗначенияЗаполнения,
		"ДобавлениеЕдиничнойОплаты",
		Неопределено);
		
	РазрешеноДобавлятьОплату = НЕ ДобавлениеЕдиничнойОплаты = Неопределено;
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСВерсиейФункционалаДокумента

&НаСервере
Процедура УстановитьВерсиюДокумента()
	
	ЭтоНоваяВерсияФункционала = ЗначениеЗаполнено(Объект.ДокументОснование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДокументОснование",
		"Видимость", 
		ЭтоНоваяВерсияФункционала);
		
	Если НЕ ЭтоНоваяВерсияФункционала Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗагрузитьИзDBF",
		"Видимость", 
		Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницыШкалыТарифныеЗоны",
		"Видимость", 
		Ложь);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаДокументыПоказанийПриборовУчета",
		"Видимость", 
		Ложь);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаНеЗагруженныеДанные",
		"Видимость", 
		Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтчеты",
		"Видимость", 
		Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Дата",
		"Доступность", 
		Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Организация",
		"ТолькоПросмотр", 
		Истина);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Район",
		"ТолькоПросмотр", 
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Поставщик",
		"ТолькоПросмотр", 
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФайлДляЧтения",
		"ТолькоПросмотр", 
		Истина);
		
	ТолькоПросмотрРеквизитовТЧОплаты = Истина;
	Если РазрешеноДобавлятьОплату Тогда
		ТолькоПросмотрРеквизитовТЧОплаты = Ложь;	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОплатаАбонент",
		"ТолькоПросмотр", 
		ТолькоПросмотрРеквизитовТЧОплаты);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОплатаСтроение",
		"ТолькоПросмотр", 
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОплатаПомещение",
		"ТолькоПросмотр", 
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОплатаУслуга",
		"ТолькоПросмотр", 
		ТолькоПросмотрРеквизитовТЧОплаты);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОплатаПоставщик",
		"ТолькоПросмотр", 
		ТолькоПросмотрРеквизитовТЧОплаты);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОплатаСуммаОплаты",
		"ТолькоПросмотр", 
		ТолькоПросмотрРеквизитовТЧОплаты);	
		
	УстановитьВерсиюДокументаПереопределяемый(ЭтоНоваяВерсияФункционала);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВерсиюДокументаПереопределяемый(ЭтоНоваяВерсияФункционала)
	// переопределено в расширении	
КонецПроцедуры
	
#КонецОбласти
