#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеДанных

Процедура АктуальныеДанные(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];		
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанные());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные = ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора = Пакет.Операторы[0];	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		Отбор 				= ОператорВыбора.Отбор;
		ИмяТаблицыОтбор		= "ТаблицаИнформации";
		ДоступныеПараметры 	= "ТарифнаяКатегория";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Отбор, ИмяТаблицыОтбор, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстЗапроса

Функция ТекстЗапросаАктуальныеДанные() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	ТаблицаИнформации.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	ТаблицаИнформации.НомерСтрокиСверхСоцНорматива КАК НомерСтрокиСверхСоцНорматива,
	|	ТаблицаИнформации.НомерСтрокиВПределахСоцНорматива КАК НомерСтрокиВПределахСоцНорматива
	|ИЗ
	|	РегистрСведений.бестФорма46НастройкаСвязиСТарифамиНаселения КАК ТаблицаИнформации";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

