#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриКопировании(ОбъектКопирования)
	Абонент					= Справочники.энргАбоненты.ПустаяСсылка();
	КлючПомещения 			= Неопределено;
	ДатаФактическогоСобытия = Неопределено;
	КлючПомещения 			= Неопределено;
	Ответственный 			= Неопределено;
	Примечание 				= "";
	Жильцы.Очистить();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДолеваяСобственность Тогда
		Для Сч = 0 По Жильцы.Количество()-1 Цикл
			ТекСтрока = Жильцы[Сч];
			
			Если Не ТекСтрока.Собственник Тогда 
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ДоляСобственностиЧислитель) Тогда
				Отказ = Истина;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена колонка ""Числитель"" в строке " +(Сч+1) +" списка ""Жильцы""",,"Жильцы["+ Сч +"].ДоляСобственностиЧислитель",ЭтотОбъект);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ДоляСобственностиЗнаменатель) Тогда
				Отказ = Истина;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена колонка ""Знаменатель"" в строке " +(Сч+1) +" списка ""Жильцы""",,"Жильцы["+ Сч +"].ДоляСобственностиЗнаменатель",ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.энргИзменениеКоличестваПрописанныхПроживающихСобственников.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	Документы.энргИзменениеКоличестваПрописанныхПроживающихСобственников.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	//Документы.энргОперацияСЛицевымСчетом.ПроведениеСобственниковПомещений(ЭтотОбъект, "энргИзменениеКоличестваПрописанныхПроживающихСобственников");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли