#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	РезультатЗапросаУслуги  = ДанныеПоПростымУслугам();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапросаУслуги, Движения.бестСпособНачисленияНормативаНП);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПоПростымУслугам()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА бестУстановитьСпособНачисленияПоНормативуНП.ДатаФактическогоСобытия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА КОНЕЦПЕРИОДА(бестУстановитьСпособНачисленияПоНормативуНП.ДатаФактическогоСобытия, ДЕНЬ)
		|		ИНАЧЕ бестУстановитьСпособНачисленияПоНормативуНП.Дата
		|	КОНЕЦ КАК Период,
		|	бестУстановитьСпособНачисленияПоНормативуНП.Организация КАК Организация,
		|	бестУстановитьСпособНачисленияПоНормативуНП.Район КАК Район,
		|	бестУстановитьСпособНачисленияПоНормативуНП.ОбъектРасчета КАК ОбъектРасчета,
		|	ВЫБОР
		|		КОГДА энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
		|			ТОГДА бестУстановитьСпособНачисленияПоНормативуНП.Услуга
		|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
		|	КОНЕЦ КАК Услуга,
		|	бестУстановитьСпособНачисленияПоНормативуНП.ПериодНачисления КАК ПериодНачисления,
		|	бестУстановитьСпособНачисленияПоНормативуНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	бестУстановитьСпособНачисленияПоНормативуНП.Дата КАК ПериодРегистрации,
		|	бестУстановитьСпособНачисленияПоНормативуНП.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	Документ.бестУстановитьСпособНачисленияПоНормативуНП КАК бестУстановитьСпособНачисленияПоНормативуНП
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО бестУстановитьСпособНачисленияПоНормативуНП.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|ГДЕ
		|	бестУстановитьСпособНачисленияПоНормативуНП.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Возврат РезультатЗапроса; 	
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли