#Область РаботаСФормой

Процедура ПриСозданииНаСервере(Форма) Экспорт
	Если НЕ ИспользованиеПрикрепленияФайлаСУказаниемТипаРазрешено() Тогда 
		Возврат;
	КонецЕсли;
	
	СоздатьКнопкуПрикрепленияФайла(Форма);
	СоздатьТаблицуСПрикрепленнымиФайлами(Форма);
КонецПроцедуры

Процедура СоздатьКнопкуПрикрепленияФайла(Форма)	
	НоваяКоманда 			= Форма.Команды.Добавить("ПрисоединитьФайлСУказаниемТипа");	
	НоваяКоманда.Действие 	= "ПрисоединитьФайлСУказаниемТипа";
	НовыйЭлемент 			= Форма.Элементы.Добавить("ПрисоединитьФайлСУказаниемТипа", Тип("КнопкаФормы"), Форма.КоманднаяПанель); 	
	НовыйЭлемент.Заголовок	= "Присоединить файл с указанием типа";
	НовыйЭлемент.ИмяКоманды = "ПрисоединитьФайлСУказаниемТипа"; 	
КонецПроцедуры

Процедура СоздатьТаблицуСПрикрепленнымиФайлами(Форма)	
	МассивДобавляемыхРеквизитов = Новый Массив;
    МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ФайлыСУказаниемТипа", Новый ОписаниеТипов("ТаблицаЗначений")));
	
	ОписаниеТаблицы = ПолучитьОписаниеТаблицыСПрикрепленнымиФайлами();
	Для Каждого ТекКолонка из ОписаниеТаблицы Цикл
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ТекКолонка.Имя, ТекКолонка.Тип, ТекКолонка.Путь, ТекКолонка.Заголовок));
	КонецЦикла;
	
    Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 		
КонецПроцедуры


Функция ПолучитьСтруктуруВидаОперации(ВладелецФайла) Экспорт
	ЗначенияРеквизитовВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВладелецФайла, "ЗначениеПустойСсылки, Имя");
	Результат 					= Новый Структура(
	"ФлагДоступностиВидаОперации, ПараметрыВыбораВидОперации, ТипВидаОперации, ВидОперации, УстанавливатьПараметрыВыбора", 
	Истина, ЗначенияРеквизитовВладельца.Имя, "ПеречислениеСсылка.энргВидыОпераций", Перечисления.энргВидыОпераций.ПустаяСсылка(), Истина);
	
	Если НЕ ЗначенияРеквизитовВладельца.ЗначениеПустойСсылки = Неопределено Тогда	
		Если ЗначенияРеквизитовВладельца.ЗначениеПустойСсылки = Задачи.энргЗадачаПИД.ПустаяСсылка() Тогда		 
			Результат.ФлагДоступностиВидаОперации 	= Ложь;
			Результат.УстанавливатьПараметрыВыбора 	= Ложь;
			Результат.ТипВидаОперации 				= "СправочникСсылка.энргВидыОперацийПИД";
			Результат.ВидОперации 					= ЗначенияРеквизитовВладельца.ЗначениеПустойСсылки;
			
		ИначеЕсли ЗначенияРеквизитовВладельца.ЗначениеПустойСсылки = Документы.энргСобытие.ПустаяСсылка() Тогда		
			Результат.ФлагДоступностиВидаОперации 	= Истина;
			Результат.УстанавливатьПараметрыВыбора 	= Ложь;
			Результат.ТипВидаОперации 				= "СправочникСсылка.энргСпособСвязи";
			Результат.ВидОперации 					= Справочники.энргСпособСвязи.ПустаяСсылка();
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЗначенияРеквизитовВладельца.ЗначениеПустойСсылки, "ВидОперации") 
			И ЗначенияРеквизитовВладельца.ЗначениеПустойСсылки.ВидОперации = Перечисления.рнтВидыОпераций.ПустаяСсылка() Тогда 
			
			Результат.ТипВидаОперации 				= "ПеречислениеСсылка.рнтВидыОпераций";
			Результат.ВидОперации 					= Перечисления.рнтВидыОпераций.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область РаботаСБД

Процедура ЗарегистрироватьСведенияОФайле(ДанныеДляЗаписи) Экспорт
	РегистрыСведений.энргСведенияОФайлахДополнительныеРеквизиты.ЗарегистрироватьЗапись(ДанныеДляЗаписи);		
КонецПроцедуры

Функция РезультатПолученияСведенийОФайлах(Файлы) Экспорт		
	Схема 			= Новый СхемаЗапроса;  	
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("Файл", "Файлы")));
					
	ПараметрыОтбора = Новый Структура;	
	ПараметрыОтбора.Вставить("Отбор", 	ПараметрыВТ); 	
	
	РегистрыСведений.энргСведенияОФайлахДополнительныеРеквизиты.ПолучитьСведенияОФайлах(Схема, ПараметрыОтбора);
	ПараметрыЗапроса 	= Новый Структура("Файлы"	, Файлы);
	Результат  			= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Возврат Результат;
КонецФункции

Функция РезультатПолученияОбязательныхТиповФайлов(ВладелецФайла, ВидОперации = Неопределено) Экспорт		
	Схема 			= Новый СхемаЗапроса;  	
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("ВладелецФайла", "ВладелецФайла")));
	Если НЕ ВидОперации = Неопределено Тогда 
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("ВидОперации", "ВидОперации")));
	КонецЕсли;
				
	ПараметрыОтбора = Новый Структура;	
	ПараметрыОтбора.Вставить("Отбор", 	ПараметрыВТ); 	
	
	РегистрыСведений.энргОбязательныеТипыФайловКПрикреплению.ПолучитьОбязательныеТипыФайлов(Схема, ПараметрыОтбора);
	
	ПараметрыЗапроса 	= Новый Структура("ВладелецФайла", ВладелецФайла);
	Если НЕ ВидОперации = Неопределено Тогда 
		ПараметрыЗапроса.Вставить("ВидОперации"	, ВидОперации);	
	КонецЕсли; 	
	Результат  			= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользованиеПрикрепленияФайлаСУказаниемТипаРазрешено() Экспорт 
	Возврат Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьПрикреплениеФайловСУказаниемТипа");
КонецФункции


Функция ПроверитьОбязательныеФайлы(СсылкаНаОбъект, ТипВладельцаФайла, ВидОперации, МассивВыбранныхТипов) Экспорт	
	ВладелецФайла = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельцаФайла);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда 
		МассивПрикрепленныхФайлов = РаботаСФайламиСлужебный.ПрисоединенныеФайлыКОбъекту(СсылкаНаОбъект);
		ДополнитьТипыПрикрепленныхФайловРанее(МассивПрикрепленныхФайлов, МассивВыбранныхТипов);
	КонецЕсли;
	
	ОбязательныеТипыФайлов = Обработки.энргОбязательныеТипыФайловКПрикреплениюМенеджер.РезультатПолученияОбязательныхТиповФайлов(ВладелецФайла, ВидОперации);
	Возврат СравнитьНаличиеТиповФайловСЭталоном(ОбязательныеТипыФайлов, МассивВыбранныхТипов);
КонецФункции

Процедура ДополнитьТипыПрикрепленныхФайловРанее(МассивПрикрепленныхФайлов, МассивВыбранныхТипов)
	ОписаниеФайлов 					= Обработки.энргСведенияОФайлахДополнительныеРеквизитыМенеджер.РезультатПолученияСведенийОФайлах(МассивПрикрепленныхФайлов);
	ТипыФайловПрикрепленныхРанее  	= ОписаниеФайлов.Выгрузить().ВыгрузитьКолонку("ТипФайла");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВыбранныхТипов, ТипыФайловПрикрепленныхРанее, Истина);
КонецПроцедуры 

Функция СравнитьНаличиеТиповФайловСЭталоном(ОбязательныеТипыФайлов, МассивВыбранныхТипов) Экспорт 
	Выборка 		= ОбязательныеТипыФайлов.Выбрать();	
	НехватаетФайлов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл		
		Если МассивВыбранныхТипов.Найти(Выборка.ТипФайла) = Неопределено Тогда
			НехватаетФайлов.Добавить(Выборка.ТипФайла);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтрСоединить(НехватаетФайлов, ", ");
КонецФункции


Функция ПолучитьОписаниеТаблицыСПрикрепленнымиФайлами() Экспорт 
	ОписаниеСтроки 	= "Имя, Тип, Путь, Заголовок";
	ОписаниеТаблицы = Новый Массив;
	
	ОписаниеТаблицы.Добавить(Новый Структура(ОписаниеСтроки, "ПутьКФайлу"	, ОбщегоНазначения.ОписаниеТипаСтрока(0)								,"ФайлыСУказаниемТипа" 	,"Путь к Файлу"));
	ОписаниеТаблицы.Добавить(Новый Структура(ОписаниеСтроки, "ТипФайла"		, Новый ОписаниеТипов("СправочникСсылка.энргТипыПрикрепляемыхФайлов")	,"ФайлыСУказаниемТипа" 	,"Тип файла"));
    ОписаниеТаблицы.Добавить(Новый Структура(ОписаниеСтроки, "Номер"		, ОбщегоНазначения.ОписаниеТипаСтрока(0)								,"ФайлыСУказаниемТипа" 	,"Номер"));
    ОписаниеТаблицы.Добавить(Новый Структура(ОписаниеСтроки, "Дата"			, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя)				,"ФайлыСУказаниемТипа" 	,"Дата"));
	
	Возврат ОписаниеТаблицы;
КонецФункции

Функция ВладельцыПрисоединенныхФайлов() Экспорт
	ТипыВладельцев 	= Метаданные.ОпределяемыеТипы.ВладелецПрисоединенныхФайлов.Тип.Типы();
	МассивИмен		= Новый Массив;
	Для Каждого ТекВладелец из ТипыВладельцев Цикл
		МассивИмен.Добавить(Метаданные.НайтиПоТипу(ТекВладелец).ПолноеИмя());	
	КонецЦикла;
	
	СсылкиИдентификаторов 	= ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(МассивИмен);
	МассивИдентификаторов	= Новый Массив;
	Для Каждого ТекКлючЗначение из СсылкиИдентификаторов Цикл
		МассивИдентификаторов.Добавить(ТекКлючЗначение.Значение);	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ИдентификаторыМетаданных
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.Ссылка В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИдентификаторыМетаданных.Ссылка КАК Ссылка
		|ИЗ
		|	ИдентификаторыМетаданных КАК ИдентификаторыМетаданных
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИдентификаторыМетаданных.Ссылка.Родитель
		|ИЗ
		|	ИдентификаторыМетаданных КАК ИдентификаторыМетаданных";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция ПроверитьСодержаниеНомераИДаты(Форма, ИмяКолллекции) Экспорт 
	ОписаниеСтрокиОтвета 	= "ИндексСтроки, НомерЕсть, ДатаЕсть";
	Ответ 					= Новый Массив;	
	
	ДанныеТабЧасти 					= Новый ТаблицаЗначений;
	ДанныеТабЧасти.Колонки.Добавить("ИдентификаторСтроки"	, Новый ОписаниеТипов("Число"));
	ДанныеТабЧасти.Колонки.Добавить("ТипФайла"				, Новый ОписаниеТипов("СправочникСсылка.энргТипыПрикрепляемыхФайлов"));
	
	Коллекция = Форма[ИмяКолллекции];
	Для Каждого СтрокаТабЧасти Из Коллекция Цикл		
		Строка 						= ДанныеТабЧасти.Добавить();
		Строка.ТипФайла 			= СтрокаТабЧасти.ТипФайла;
		Строка.ИдентификаторСтроки  = Коллекция.Индекс(СтрокаТабЧасти);
	КонецЦикла;
	
	Текст 							=
	"ВЫБРАТЬ
	|	ДанныеТабЧасти.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДанныеТабЧасти.ТипФайла КАК ТипФайла
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТабЧасти.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДанныеТабЧасти.ТипФайла КАК ТипФайла
	|ИЗ
	|	ДанныеТабЧасти КАК ДанныеТабЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыПрикрепляемыхФайлов КАК энргТипыПрикрепляемыхФайлов
	|		ПО ДанныеТабЧасти.ТипФайла = энргТипыПрикрепляемыхФайлов.Ссылка
	|			И (энргТипыПрикрепляемыхФайлов.СодержитНомерИДату)";
	
		
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДанныеТабЧасти"	, ДанныеТабЧасти);			
	
	Результат 		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	ПустаяДата		= Дата(1,1,1);
	Пока Выборка.Следующий() Цикл		
		ТекСтрока  				= Коллекция[Выборка.ИдентификаторСтроки];
		
		НомерЕсть 	= НЕ ПустаяСтрока(ТекСтрока.Номер);
		ДатаЕсть 	= НЕ ТекСтрока.Дата = ПустаяДата;
		
		Если НЕ НомерЕсть ИЛИ НЕ ДатаЕсть Тогда
			НСтрока = Новый Структура(ОписаниеСтрокиОтвета);
			НСтрока.ИндексСтроки 	= Выборка.ИдентификаторСтроки;
			НСтрока.НомерЕсть 		= НомерЕсть;
			НСтрока.ДатаЕсть 		= ДатаЕсть;
			
			Ответ.Добавить(НСтрока);
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

