#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерефейс

Функция ПолучитьУчетнуюЗапись(ТочкаМаршрутаБизнесПроцесса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестНастройкаОтправкиПочтыИзБП.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.бестНастройкаОтправкиПочтыИзБП КАК бестНастройкаОтправкиПочтыИзБП
	|ГДЕ
	|	бестНастройкаОтправкиПочтыИзБП.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрутаБизнесПроцесса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.УчетнаяЗапись;
	Иначе 
		Возврат РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	КонецЕсли;;
КонецФункции

#КонецОбласти

#КонецЕсли