#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		//Объект.ДатаФактическогоСобытия = Объект.Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
 	
	Если ЗначениеЗаполнено(Объект.Договор) и Не ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Объект.Договор.Контрагент;
	КонецЕсли;	
	
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("Контрагент"), Метаданные.Документы.бестОперацияСОбъектамиНП);
	// -- Акимов Д.В.	
		
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	// ++ gradum 000213955 2020.07.09
	ДоговорПриИзмененииНаКлиентеНаСервере(ЭтаФорма, Неопределено);
	// -- gradum 000213955 svb 2020.07.09
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// ++ gradum 000213955 2020.07.09
	индексОбъекта = Новый Соответствие;
	// Пустые - удаляем, ПОВТОРЫ - так же, оставляя первое упоминание
	индексОбъекта.Вставить(ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка"), Истина);
	ИндексСтроки = 0; былиКорректировки = Ложь;
	Пока ИндексСтроки<Объект.ОбъектыРасчета.Количество() Цикл
		строкаТЧ = Объект.ОбъектыРасчета.Получить(ИндексСтроки);
		Если индексОбъекта.Получить(строкаТЧ.ОбъектРасчета) = Истина Тогда
			Объект.ОбъектыРасчета.Удалить(ИндексСтроки);
			былиКорректировки = Истина;
		Иначе
			индексОбъекта.Вставить(строкаТЧ.ОбъектРасчета, Истина);
			ИндексСтроки = ИндексСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	Если былиКорректировки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Были удалены повторы Объектов расчета");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестОперацияСОбъектамиНП",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	// ++ gradum 000213955 2020.07.09
	ДоговорПриИзмененииНаКлиентеНаСервере(ЭтаФорма, Элемент); 
	// Если ЗначениеЗаполнено(Объект.Договор) тогда
	//	 бестПользовательскийВводКлиент.ПриИзмененииДоговораКонтрагента(Объект,"ДатаФактическогоСобытия"); 		 		 
	// КонецЕсли;
	// -- gradum 000213955 svb 2020.07.09

КонецПроцедуры

// ++ gradum 000213955 2020.07.09
&НаКлиентеНаСервереБезКонтекста
//&НаСервере
Функция ДоговорПриИзмененииНаКлиентеНаСервере(Форма, Элемент = Неопределено)

	Если ЗначениеЗаполнено(Форма.Объект.Договор) Тогда
		реквДоговор = Форма.Объект.Договор;
		массивОбъектовРасчета = ПолучитьАктивныеОбъектыРасчетаНаСервере(
			?(ЗначениеЗаполнено(Форма.Объект.ДатаФактическогоСобытия), Форма.Объект.ДатаФактическогоСобытия, 
				?(ЗначениеЗаполнено(Форма.Объект.Дата), Форма.Объект.Дата, ТекущаяДата()))
			, реквДоговор.Организация, реквДоговор.Район, Форма.Объект.Договор
		);
	Иначе
		реквДоговор = Новый Структура("Контрагент, Организация, Район"
			, Неопределено, Неопределено, Неопределено
		);
		массивОбъектовРасчета = Новый Массив; массивОбъектовРасчета.Добавить(Неопределено);
	КонецЕсли;
	
	Форма.Контрагент = реквДоговор.Контрагент;
	
	массПараметрыВыбора = Новый Массив;
	массПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", массивОбъектовРасчета));
	Форма.Элементы.ТочкиУчетаОбъектРасчета.ПараметрыВыбора = Новый ФиксированныйМассив(массПараметрыВыбора);
	
	Если Неопределено = Элемент Тогда
		// Например, ПриЧтенииНаСервере
	Иначе
		// Интерактивно, перезаплняем Объекты расчета
		
		Форма.Объект.Организация = реквДоговор.Организация;
		Форма.Объект.Район = реквДоговор.Район;
		
		Форма.Объект.ОбъектыРасчета.Очистить();
		Для Каждого эл Из массивОбъектовРасчета Цикл
			Форма.Объект.ОбъектыРасчета.Добавить().ОбъектРасчета = эл;
		КонецЦикла;
		
	КонецЕсли;
	
	массПараметрыВыбора = Новый Массив;
	Если ЗначениеЗаполнено(Форма.Контрагент) Тогда
		массПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Форма.Контрагент));
	КонецЕсли;
	Форма.Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(массПараметрыВыбора);
	
КонецФункции // УстановитьПараметрыВыбораОбъектаРасчета()	//-- gradum 000213955 svb 2020.07.09

// ++ gradum 000213955 2020.07.09
&НаСервереБезКонтекста
Функция ПолучитьАктивныеОбъектыРасчетаНаСервере(Период, Организация, Район, Договор)
	индексОбъектРасчета = Новый Соответствие;
	индексОбъектРасчета.Вставить(ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка"), Истина);
	РезультатФункции = Новый Массив;
	МВТ = новый МенеджерВременныхТаблиц;
	РегистрыСведений.бестВладельцыОбъектовРасчета.ПолучитьВладельцевОбъектовРасчета(МВТ, Период, Организация, Район,,Договор,"ВладельцыОбъектовРасчета");
	РезультатЗапроса	= РегистрыСведений.бестАктивностьОбъектовРасчета.ПолучитьАктивныеОбъектыРасчета(МВТ, Период, Организация, Район,Истина);
	Выборка 			= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если индексОбъектРасчета.Получить(Выборка.ОбъектРасчета) = Истина Тогда
			Продолжить;
		КонецЕсли;
		РезультатФункции.Добавить(Выборка.ОбъектРасчета);
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции	//-- gradum 000213955 2020.07.09

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ++ gradum 000213955 2020.07.10
	// бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация, Контрагент, СтандартнаяОбработка);
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент, Неопределено, Контрагент, СтандартнаяОбработка);
	// -- gradum 000213955 svb 2020.07.10
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораОбъекта(Элемент, Объект.Дата, Объект.Организация, Объект.Район, Объект.Договор, СтандартнаяОбработка, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"ОбъектыРасчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры             

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	// ++ gradum 000213955 2020.07.09
	Объект.Договор = Неопределено;
	ДоговорПриИзменении(Элемент);
	// -- gradum 000213955 svb 2020.07.09
КонецПроцедуры

#КонецОбласти
