#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьГруппуПотребителей(Движения, ДанныеШапки) Экспорт 
 	
	Для Каждого СтрокаВида Из ДанныеШапки.ТарифныеКатегорииУслуги Цикл
		Набор 							= Движения.бестТарифныеКатегорииНП;
		Запись							= Набор.Добавить();
		Запись.Период  					= ДанныеШапки.Дата;
		Запись.Район  					= ДанныеШапки.Район;
		Запись.Организация  			= ДанныеШапки.Организация;
		Запись.Договор 					= ДанныеШапки.Договор;
		Запись.ОбъектРасчета 			= ДанныеШапки.ОбъектРасчета;
		Запись.ТарифнаяКатегория  		= СтрокаВида.ТарифнаяКатегория;
		Запись.Услуга  					= СтрокаВида.Услуга;
		Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьДвижение(ДанныеШапки,ДвиженияНабор)  Экспорт 
	
	Запись = ДвиженияНабор.добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);		
КонецПроцедуры

Процедура ВыполнитьДвижения(ДанныеШапки,ДвиженияНабор,ИмяКоллекции)  Экспорт
	Для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Если ДанныеШапки.Свойство("Приход") Тогда
			Если ДанныеШапки.Приход Тогда
				Запись = ДвиженияНабор.ДобавитьПриход();
			Иначе
				Запись = ДвиженияНабор.ДобавитьРасход();
			КонецЕсли;
		Иначе
			Запись = ДвиженияНабор.добавить(); 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись, стр);
		ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);		
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса, ДвиженияНабор, СоответствиеКолонок = Неопределено)  Экспорт
	Выборка	= РезультатЗапроса.выбрать();	
	Пока Выборка.Следующий() цикл		
		Запись	= ДвиженияНабор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Если СоответствиеКолонок <> Неопределено Тогда 
			ДЛя Каждого ТекСоответствие Из СоответствиеКолонок Цикл
				Запись[ТекСоответствие.Ключ] = Выборка[ТекСоответствие.Значение];
			КонецЦикла;	
		КонецЕсли;			                                       
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
