&НаКлиенте
Перем ЗадачаПоПереговорам;

#Если Сервер Или ТолстыйКлиентОбычноеПредложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//// Востанавление последовательности для получения актуальной задолженности
	//Если ЗначениеЗаполнено(Объект.Абонент) И Не Объект.Выполнена И Не Объект.ПометкаУдаления Тогда
	//	Попытка
	//	    ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ТекущаяДата(), Объект.Организация);
	//		энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(Объект.Организация, ПериодНачисления, Объект.Район, Объект.МКД, Объект.Абонент);
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить актуальную задолженность по причине: " + ОписаниеОшибки());
	//	КонецПопытки;
	//КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Поставщик = энргОбщегоНазначенияСерверПовтИспол.ПолучитьЗначениеКонстанты("энргПоставщикПоУмолчанию");
		Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()), Объект.Организация,Объект.Район);
		
		СтатусыСудебныхДел.Параметры.УстановитьЗначениеПараметра("СудебноеДело", Неопределено);
	иначе
		СтатусыСудебныхДел.Параметры.УстановитьЗначениеПараметра("СудебноеДело", Объект.Ссылка);		
	КонецЕсли;
	НовОбъект = Неопределено;
	Если Параметры.Свойство("ПараметрыОбъекта", НовОбъект) Тогда
		ЗаполнитьЗначенияСвойств(Объект, НовОбъект);
		Задачи.энргЗадачаПИД.ЗаполнитьНаименованиеИЭтап(Объект, Справочники.энргВидыОперацийПИД.ПустаяСсылка());
	КонецЕсли;
	
	УстановитьПараметрыВнешВоздействие();
	// Создание команд планировния отправки ЭП
	СпрЭтаповПИД  = Справочники.энргВидыОперацийПИД;
	СписокМакетов = СпрЭтаповПИД.ПолучитьСписокМакетовПечати();
	
	Для каждого ТекМакет Из СписокМакетов Цикл
		Префикс	 = "ПФ_MXL_";
		ИмяЭтапа = СтрЗаменить(ТекМакет.Значение, Префикс, "ЭтапПретензионноИсковойДеятельности_");
		ИмяКмд	 = СтрЗаменить(ТекМакет.Значение, Префикс, "КомандаЭтап_");
		Этап	 = СпрЭтаповПИД[ИмяЭтапа];
		
		// Добавление команды
		Кмд			  = ЭтаФорма.Команды.Добавить(ИмяКмд);
		Кмд.Действие  = "ОтправитьНаПочту";
		Кмд.Заголовок = Строка(Этап);
		
		// Добавление новой кнопки
		ЭлементКМД			   = Элементы.Добавить(ИмяКмд, Тип("КнопкаФормы"), Элементы.ГрппаКнопкиОтправкиЭП);
		ЭлементКМД.Вид		   = ВидКнопкиФормы.ОбычнаяКнопка;
		ЭлементКМД.ИмяКоманды  = ИмяКмд;
		ЭлементКМД.Картинка	   = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо;
		ЭлементКМД.Отображение = ОтображениеКнопки.КартинкаИТекст;
		ЭлементКМД.Видимость   = Ложь;
	КонецЦикла;

	// Установка площадей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(энргСтатусыСудебныхДелСрезПоследних.Статус) КАК СтатусСудебногоДела
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	РегистрСведений.энргСтатусыСудебныхДел.СрезПоследних(, СудебноеДело = &Ссылка) КАК энргСтатусыСудебныхДелСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Данные.СтатусСудебногоДела) КАК СтатусСудебногоДела
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
	
	Запрос.УстановитьПараметр("Ссылка",		 Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЦикла;
	
	УстановитьПараметрыКомментарии();
	УстановитьПарметрыПредыдущиеСудебныеИнстанции();
	УстановитьПараметрыВнешВоздействие();
	// Запуск расчёта пени
	ЭтоСудебнаяРабота		= Перечисления.энргТипыЭтапов.СудебнаяРабота = Объект.Этап.Тип;
	ЭтоИсполнительнаяРабота = Перечисления.энргТипыЭтапов.ИсполнительнаяРабота = Объект.Этап.Тип;
	ЗаполнитьСуммуИска();

	
	УстановитьПараметрыИВидимостьБанкротства();
	ОбновитьЗадолженностьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуИска()
	
	Если ЭтоСудебнаяРабота Или ЭтоИсполнительнаяРабота Тогда
		Если ЭтоИсполнительнаяРабота И ЗначениеЗаполнено(Объект.ИсполнительныеДокументы) Тогда
		    Объект.СуммаЗадолженности 	= 0;
			Объект.СуммаПени			= 0;
			Объект.СуммаГоспошлина		= 0;
			Объект.Прочие				= 0;
			
			Для каждого СтрокаТЧ Из Объект.ИсполнительныеДокументы Цикл
				Объект.СуммаЗадолженности 	= Объект.СуммаЗадолженности + СтрокаТЧ.Долг;
				Объект.СуммаПени 			= Объект.СуммаПени + СтрокаТЧ.Пеня;
				Объект.СуммаГоспошлина 		= Объект.СуммаГоспошлина + СтрокаТЧ.Госпошлина;
				Объект.Прочие 				= Объект.Прочие + СтрокаТЧ.Прочие;
			КонецЦикла;
		КонецЕсли;
		
		СуммаИска   = Объект.СуммаЗадолженности + Объект.СуммаПени + Объект.Прочие;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СтатусСудебногоДела", СтатусСудебногоДела);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//подэтапы
	УстановитьСостояниеПодэтапов();

	УстановитьДоступностьЭлементов();
	УстановитьтолькоПросмотрДляЭлементов();

	СоздатьКоманды();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьСписки");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьДоступностьЭлементов();
	УстановитьПараметрыКомментарии();
	УстановитьтолькоПросмотрДляЭлементов();
	УстановитьСостояниеПодэтапов();
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Если Объект.ПометкаУдаления Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя выполнить помеченную на удаление задачу.");
		Возврат;
	КонецЕсли;
	
	Если ЗадачаПоПереговорам И Объект.СуммаЗадолженности = 0 Тогда
		Отказ = Истина;
		ПрекратитьПИД(Неопределено);
		Возврат;
	КонецЕсли;
	
	РекомендуемыйЭтап	= Неопределено;
	СписокЗначений		= ПолучитьИменаКомандЭтапов();

	ТипЭтапа = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап, "Тип");
	СудебнаяРабота = ПредопределенноеЗначение("Перечисление.энргТипыЭтапов.СудебнаяРабота") = ТипЭтапа;
	
	Если Не СудебнаяРабота И СписокЗначений.Количество() <> 0 Тогда 
		Отказ = Истина;

		СписокЗначений.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОбработкаВыбораЭтапа", ЭтотОбъект), "Выберите следующий этап.", РекомендуемыйЭтап);
	КонецЕсли;
	
	Если Не Отказ Тогда
		СледЭтап = ПолучитьСледующийЭтап(Объект.Схема, Объект.Этап);
		Если НачалоСудебнойРаботы(Объект.Этап, СледЭтап) Тогда
			Отказ = Истина;
			ОткрытьФормуПереходаНаСудебнуюРаботу(СледЭтап);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоСудебнаяРабота И Не Отказ Тогда
		Для каждого СтрокаТЧ Из Объект.СудебныеИнстанции Цикл
		
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Дата) Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Перед переходом на следующий этап должна быть заполнена дата в судебной инстанции.";
				Сообщение.Поле = "Объект.СудебныеИнстанции[" + (СтрокаТЧ.НомерСтроки-1) + "].Дата";
				Сообщение.УстановитьДанные(ЭтаФорма);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Номер) Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Перед переходом на следующий этап должен быть заполнен номер в судебной инстанции.";
				Сообщение.Поле = "Объект.СудебныеИнстанции[" + (СтрокаТЧ.НомерСтроки-1) + "].Номер";
				Сообщение.УстановитьДанные(ЭтаФорма);
				Сообщение.Сообщить();
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановитьДатуЭП" Тогда
		ОбновитьДатуОтправки("ДатаОповещенияПоЭП", ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту"));
		УстановитьДоступностьЭлементов();
	ИначеЕсли ИмяСобытия = "УстановитьДатуSMS" Тогда
		ОбновитьДатуОтправки("ДатаОтправкиSMS", ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаСМС"));
		УстановитьДоступностьЭлементов();
	ИначеЕсли ИмяСобытия = "ВернутьВРаботу" Тогда
		ВернутьВРаботу(Неопределено);
	ИначеЕсли ИмяСобытия = "ОбновитьСобытия" Тогда
		УстановитьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьЗадолженностьНаСервере();
	ЗаполнитьСуммуИска();
	УстановитьПараметрыВнешВоздействие();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЭтоИсполнительнаяРабота И Не ЭтоСудебнаяРабота Тогда
		Объект.Задолженность.Очистить();
		ЗаполнитьТЧ_Задолженность(ДеревоЗадолженности);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
	СоздатьКоманды();
	ОтобразатьКнопкуПечати();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
	
	УстановкаЭтапаНачальнойЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПланПогашенияЗадолженностиДатаПриИзменении(Элемент)
	ТекСтрока = Элементы.ПланПогашенияЗадолженности.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.Дата < Объект.Дата Тогда
		ТекСтрока.Дата = Объект.Дата;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата плановой выплаты не может быть раньше даты задачи.");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СудебныеИнстанцииПриИзменении(Элемент)
	УстановитьПроверитьТекущуюСудебнуюИнстанцию();
КонецПроцедуры

&НаКлиенте
Процедура СудебныеИнстанцииПослеУдаления(Элемент)
	УстановитьПроверитьТекущуюСудебнуюИнстанцию();
КонецПроцедуры

&НаКлиенте
Процедура ВидИсполненияПриИзменении(Элемент)
	Элементы.ГруппаИсполнительноеПроизводство.Видимость	= Объект.ВидИсполнения = ПредопределенноеЗначение("Перечисление.энргВидыИсполнительногоПроизводства.ФССП");
КонецПроцедуры

&НаКлиенте
Процедура СтатусСудебногоДелаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СудебныеЗаседанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	СохрнаитьИзмененияПередВыполнениемКоманды(Команды.Найти("НачатьБанкротство"));
КонецПроцедуры
#КонецОбласти

#Область ОбработкиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЗадолженность(Команда)
	Модифицированность = Истина;
	УстановитьПараметрыИВидимостьБанкротства();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВРаботу(Команда)
	Если Не Объект.Выполнена Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Задача находится в работе.");
		Возврат;
	КонецЕсли;
	
	СписокЗадач = ПодчинённыеЗадачи(Объект.Ссылка);
	Если СписокЗадач.Количество() > 0 Тогда
		ПарамФормы = Новый Структура("СписокЗадач", СписокЗадач);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаПоследующиеЗадачи", ПарамФормы, ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	Объект.Выполнена = Ложь;
	СоздатьКоманды();
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьЭтап(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед созданием подчиненной задачи, необходимо записать изменения.");
		Возврат;
	КонецЕсли;
	
	Если ПовторитьЭтапНаСервере() Тогда 
		УстановитьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьПИД(Команда)
	Если ПрекратитьПИДНаСервере(Истина) Тогда
		УстановитьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВозобновитьПИД(Команда)
	Если ПрекратитьПИДНаСервере(Ложь) Тогда
		УстановитьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВзятьВРаботу(Команда)
	Объект.Исполнитель = ПользователиКлиентСервер.АвторизованныйПользователь();
	Объект.ПринятоВРаботу = Истина; 
	Объект.ДатаПринятияВРаботу = ТекущаяДата();
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаЭтап(Команда)
	СледЭтап = ЭтапКоманды(Команда.Имя);
	
	Если НачалоСудебнойРаботы(Объект.Этап, СледЭтап) Тогда
		ОткрытьФормуПереходаНаСудебнуюРаботу(СледЭтап);
	Иначе
		Если ПерейтиНаЭтапНаСервере(Команда.Имя) Тогда
			УстановитьДоступностьЭлементов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаПочту(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьЗадачуДругомуПользователю(Команда)
	ОписОпов = Новый ОписаниеОповещения("СменаИсполнителя", ЭтаФорма);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя",, ЭтаФорма,,,, ОписОпов);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	Если Объект.Выполнена Тогда
		Возврат;
	КонецЕсли;
	
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяСудебнаяИнстанция(Команда)
	ТекСтрока = Элементы.СудебныеИнстанции.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	УстановитьПроверитьТекущуюСудебнуюИнстанцию(ТекСтрока.НомерСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявлениеОВынесенииСудебногоПриказа(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявленияОВыдачеСудебногоПриказаОВзыскании(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявленияОВозбужденииИсполнительногоПроизводства(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВажныеКомментарии(Команда)
	Если Команда = Команды.Найти("ТолькоВажныеКомментарии") Тогда
		Элемент = Элементы.КомментарииКДелуТолькоВажныеКомментарии;
	    ДинамСписок = "КомментарииКДелу"; 
	ИначеЕсли Команда = Команды.Найти("ТолькоВажныеСтатусОтчеты") Тогда
		Элемент = Элементы.СтатусОтчетыТолькоВажныеСтатусОтчеты;
		ДинамСписок = "СтатусОтчеты";
	Иначе
		Возврат;
	КонецЕсли;
	
	ТолькоВажные = Элемент.Заголовок = "Только важные";                  
	
	УстановитьПризнакОтоброжатьТолькоВажные(ДинамСписок, ТолькоВажные);
	Элемент.Заголовок = ?(ТолькоВажные, "Отобразить все", "Только важные");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадолженность(Команда)
	
	ОбновитьЗадолженностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммыИска(Команда)
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУслугу(Команда)
	ОсновноеДействиеКоманды(Команда);
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеФункцииНаКлиенте

&НаКлиенте
Процедура УстановитьДоступностьЭлементов() 
	
	Элементы.СобытияПоЭтапу.Обновить();
	ТипЭтапа 				= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап, "Тип");
	ВыпИлиПометУдал 		= Объект.Выполнена Или Объект.ПометкаУдаления Или Не Объект.ПринятоВРаботу;
	СудебнаяРабота		 	= ЭтоСудебнаяРабота;
	ИсполнительнаяРабота 	= ЭтоИсполнительнаяРабота;
	
	ПринятоВРаботу = Объект.ПринятоВРаботу; 
	Если ЕстьСобытияПоЗадаче(Объект.Ссылка) И Объект.ПринятоВРаботу Тогда 
		МожноВыполнить = Истина;
	иначе 
		МожноВыполнить = Ложь;
	КонецЕсли;
	
	Элементы.ФормаВыполнить.Доступность = МожноВыполнить;
	Элементы.ФормаВыполнитьИЗакрыть.Доступность = МожноВыполнить;
	
	ДатаСледующегоОтчёта 	= ПолучитьДатуСледСтатусОтчёта(Объект.Ссылка);	 
	
	Элементы.ФормаГруппаПерейтиНаЭтап.Видимость				  = Не СудебнаяРабота И Не ИсполнительнаяРабота;  
	Элементы.ГруппаЭтап.Видимость							  = Не СудебнаяРабота И Не ИсполнительнаяРабота;
	Элементы.ГруппаДатаНомер.Видимость						  = Не СудебнаяРабота И Не ИсполнительнаяРабота;
	Элементы.ГруппаШапкаДела.Видимость						  = СудебнаяРабота Или ИсполнительнаяРабота;
	Элементы.ГруппаСуммыСуд.Видимость						  = СудебнаяРабота Или ИсполнительнаяРабота;
	Элементы.Схема.Видимость								  = Не СудебнаяРабота И Не ИсполнительнаяРабота;
	Элементы.ГруппаСуммаЗадолжности.Видимость				  = Не СудебнаяРабота И Не ИсполнительнаяРабота;
	Элементы.ГруппаПериод.Видимость							  = Не СудебнаяРабота И Не ИсполнительнаяРабота;
	Элементы.СтраниицаСудебныеИнстанции.Видимость			  = СудебнаяРабота Или ИсполнительнаяРабота;
	Элементы.СтраницаИсполнительныеДокументы.Видимость		  = ИсполнительнаяРабота;
	
	//Элементы.СтраницаКомментарии.Видимость					  = СудебнаяРабота;
	Элементы.ВидСудопроизводства.Видимость					  = СудебнаяРабота;
	//Пока убираем  
	//Элементы.СтраницаСтатусОтчеты.Видимость					  = СудебнаяРабота;
	//
	
	//Элементы.СтатусСудебногоДела.Видимость	  				  = СудебнаяРабота;
	Элементы.ФормаПодменюПечать.Видимость					  = СудебнаяРабота Или ИсполнительнаяРабота;
	//Элементы.СтраницаЮрист.Видимость						  = СудебнаяРабота Или ИсполнительнаяРабота;
	Элементы.ГруппаИсполнительноеПроизводство.Видимость		  = ИсполнительнаяРабота И 
									Объект.ВидИсполнения = ПредопределенноеЗначение("Перечисление.энргВидыИсполнительногоПроизводства.ФССП");
	Элементы.ВидИсполнения.Видимость		  				  = ИсполнительнаяРабота;
	Элементы.ФормаПечатьЗаявленияОВозбужденииИсполнительногоПроизводства.Видимость = ИсполнительнаяРабота;
	Элементы.ФормаПечатьЗаявлениеОВынесенииСудебногоПриказа.Видимость = СудебнаяРабота;
	Элементы.ФормаПечатьЗаявленияОВыдачеСудебногоПриказаОВзыскании.Видимость = СудебнаяРабота;
	Элементы.ГруппаИсполнительногоЛиста.Видимость			  = ИсполнительнаяРабота;
	Элементы.ГруппаПредыдущиеСудебныеИнстанции.Видимость	  = ИсполнительнаяРабота;
	Элементы.СудебныеИнстанции.Видимость	  				  = НЕ ИсполнительнаяРабота;
	Элементы.ДатаУчётаНачислений.Видимость					  = СудебнаяРабота ИЛИ ИсполнительнаяРабота;	
	Элементы.ДатаРасчетаПени.Видимость						  = СудебнаяРабота ИЛИ ИсполнительнаяРабота;
	
	Элементы.ГруппаОбязательныеПоля.ТолькоПросмотр			  = ВыпИлиПометУдал;
	Элементы.ГруппаАбонент.ТолькоПросмотр					  = ВыпИлиПометУдал;
	Элементы.ГруппаШапкаДела.ТолькоПросмотр					  = ВыпИлиПометУдал;
	Элементы.СобытияПоЭтапу.ТолькоПросмотр					  = ВыпИлиПометУдал;
	Элементы.СудебныеИнстанции.ТолькоПросмотр				  = ВыпИлиПометУдал;
	Элементы.КомментарииКДелу.ТолькоПросмотр				  = ВыпИлиПометУдал;
	Элементы.СтатусОтчеты.ТолькоПросмотр					  = ВыпИлиПометУдал;
	Элементы.СтраницаЮрист.ТолькоПросмотр					  = ВыпИлиПометУдал;
	Элементы.СтраницаБанкротство.ТолькоПросмотр				  = ВыпИлиПометУдал;
	Элементы.ГруппаСуммаЗадолжности.ТолькоПросмотр	 		  = ВыпИлиПометУдал;
	Элементы.ГруппаДатаНомер.ТолькоПросмотр					  = ВыпИлиПометУдал;
	Элементы.СудебныеИнстанцииТекущаяСудебнаяИнстанция.Доступность = Не ВыпИлиПометУдал;
	Элементы.Комментарий.ТолькоПросмотр						  = Не СудебнаяРабота Или ВыпИлиПометУдал;
	Элементы.ГруппаИсполнительногоЛиста.ТолькоПросмотр		  = ВыпИлиПометУдал;
	Элементы.ФормаПередатьСотрудникуУКЗ.Видимость			  = ИсполнительнаяРабота И Не ВыпИлиПометУдал;
	Элементы.ДатаУчётаНачислений.ТолькоПросмотр				  = НЕ СудебнаяРабота;
	Элементы.ДатаРасчетаПени.ТолькоПросмотр					  = НЕ СудебнаяРабота;
	Элементы.СобытияПоЭтапуСоздать.Доступность	 			  = Не ВыпИлиПометУдал;
	//Элементы.ФормаПрикреплениеКвитанций.Видимость			  = НЕ ВыпИлиПометУдал;
	
	Элементы.ФормаВернутьВРаботу.Видимость					  = Объект.Выполнена;
	
	Если СудебнаяРабота Или ИсполнительнаяРабота Тогда
	
		АвтоЗаголовок = Ложь;
		Заголовок = Объект.Наименование;
	
	КонецЕсли;
	
	Элементы.ФормаПередатьЗадачуДругомуПользователю.Видимость = Не ВыпИлиПометУдал;
	Элементы.ФормаПовторитьЭтап.Видимость		 			  = Не ВыпИлиПометУдал И Не СудебнаяРабота И Не ИсполнительнаяРабота;
	Элементы.ФормаПрекратитьПИД.Видимость		 			  = Не ВыпИлиПометУдал;
	Элементы.ФормаВернутьНаДоработку.Видимость	 			  = Не ВыпИлиПометУдал И ЗначениеЗаполнено(Объект.Основание);
	Элементы.РассчитатьЗадолженность.Доступность	 		  = Не ВыпИлиПометУдал;
	
	Элементы.ДатаСледЭтапа.Видимость			 			  = Не Объект.Выполнена И Не СудебнаяРабота;
	Элементы.ДатаСледующегоОтчёта.Видимость                   = ЗначениеЗаполнено(ДатаСледующегоОтчёта);
	Элементы.ДатаВыполнения.Видимость			 			  = Объект.Выполнена И Не СудебнаяРабота;
	Для каждого КомандаЭтап Из Элементы.ФормаГруппаПерейтиНаЭтап.ПодчиненныеЭлементы Цикл
		КомандаЭтап.Видимость = Не Объект.Выполнена;
	КонецЦикла;
	
	Элементы.ФормаВозобновитьПИД.Видимость		 = Не Объект.ПометкаУдаления И Объект.ПрекращенаДеятельность;
	Элементы.ФормаВыполнитьИЗакрыть.Видимость	 = Не ВыпИлиПометУдал;
	Элементы.ФормаЗаписать.Видимость			 = Не ВыпИлиПометУдал;
	Элементы.ФормаВыполнить.Видимость			 = Не ВыпИлиПометУдал;
	Элементы.ФормаВзятьВРаботу.Видимость		 = Не Объект.Выполнена И Не Объект.ПометкаУдаления И (Не Объект.ПринятоВРаботу Или Объект.Исполнитель <> ПолучитьТекущегоПользователя());
	Элементы.ФормаНачатьБанкротство.Видимость	 = Не ВыпИлиПометУдал;
	Элементы.ФормаОтключитьУслугу.Видимость		 = Не ВыпИлиПометУдал;
	
	ЗадачаПоПереговорам							 = Объект.Этап = ПредопределенноеЗначение("Справочник.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Переговоры");
	Элементы.ПланПогашенияЗадолженности.Видимость= ЗадачаПоПереговорам;
	
	ОтобразатьКнопкуПечати();
	ОбновитьДатуОтправки("ДатаОповещенияПоЭП", ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту"));
	ОбновитьДатуОтправки("ДатаОтправкиSMS", ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаСМС"));
	
	//ИНТЕГРАЦИЯ
	Элементы.ИнтеграцияФССП.Видимость = Не ВыпИлиПометУдал И ИсполнительнаяРабота;
	
	// Передача пакетов документов
	ЭтоПередачаПакетовДокументов 								= Объект.Этап = ПредопределенноеЗначение("Справочник.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам");
	Элементы.СтатусСудебногоДелаДляПередачиДокументов.Видимость	= ЭтоПередачаПакетовДокументов;
	Если ЭтоПередачаПакетовДокументов Тогда
		ЗаполнитьСтатусСудДела();		
	КонецЕсли;
	           	
	Элементы.ГРСтатусыСудебныхДел.Видимость				 = СудебнаяРабота;
	// Судебное дело

	// Настройка видимости списка задолженности
	Элементы.СтраницаНепогашенныеНачисления.Видимость		  		= Не СудебнаяРабота И Не ИсполнительнаяРабота;
	Элементы.ГруппаПодэтапы.Видимость 								= ЗначениеЗаполнено(Объект.Подэтапы);
	Элементы.ФормаПодтвердитьПеренаправление.Видимость	 			= Объект.ТребуетПодтверждения И Не ВыпИлиПометУдал;
	Элементы.НепогашенныеНачисления.ИзменятьСоставСтрок  			= Не ВыпИлиПометУдал;
	Элементы.НепогашенныеНачисленияОбновитьЗадолженность.Видимость  = Не ВыпИлиПометУдал;
	
	Элементы.СтраницаЗадолженность.Видимость                        = СудебнаяРабота;
	Элементы.СтраницаРасчетПени.Видимость                        	= СудебнаяРабота;
	Элементы.ЗадолженностьЗадолженность.ТолькоПросмотр  			= ВыпИлиПометУдал;
	Элементы.ИсполнительныеДокументы.ТолькоПросмотр					= ВыпИлиПометУдал;

	// Доступность полей Суммы
	Элементы.ОбновитьСуммыИска.Видимость							= СудебнаяРабота;
	УстановитьДоступностьСуммИспол();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСуммИспол()
	
	Перем ТолькоПросмотрСумм;
	
	ТолькоПросмотрСумм	= Не ЭтоИсполнительнаяРабота Или ЗначениеЗаполнено(Объект.ИсполнительныеДокументы) Или Объект.Выполнена Или Не Объект.ПринятоВРаботу;
	
	Элементы.СуммаОсновногоДолга.ТолькоПросмотр	= ТолькоПросмотрСумм;
	Элементы.Пеня.ТолькоПросмотр				= ТолькоПросмотрСумм;
	Элементы.Прочие.ТолькоПросмотр				= ТолькоПросмотрСумм И (Не ЭтоСудебнаяРабота Или Объект.Выполнена Или Не Объект.ПринятоВРаботу);
	Элементы.СуммаИска.ТолькоПросмотр			= ТолькоПросмотрСумм;
	Элементы.СуммаГоспошлина.ТолькоПросмотр		= ТолькоПросмотрСумм;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЭтапа(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	ВыбранныйЭтап = ВыбранныйЭлемент;
	
	Если ВыбранныйЭтап <> Неопределено Тогда
		СледЭтап = ЭтапКоманды(ВыбранныйЭтап.Значение);
		Если НачалоСудебнойРаботы(Объект.Этап, СледЭтап) Тогда
			//Отказ = Истина;
			ОткрытьФормуПереходаНаСудебнуюРаботу(СледЭтап);
		Иначе
			ПерейтиНаЭтапНаСервере(ВыбранныйЭтап.Значение);
			Если ЭтаФорма.Открыта() Тогда
				Закрыть();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаСохранение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();
		Команда = ДополнительныеПараметры.Команда;
		ОсновноеДействиеКоманды(Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПечати()
	Перем ПараметрыФормы;
	
	ПараметрыФормы = Новый Структура("Задача, ИмяМакета, Этап", Объект.Ссылка, ИмяМакета, Объект.Этап);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаПечати", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СохрнаитьИзмененияПередВыполнениемКоманды(Команда)
	
	Перем ОписаниеОповещения;
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаСохранение", ЭтотОбъект, Новый Структура("Команда", Команда));
		ПоказатьВопрос(ОписаниеОповещения, "Сохранить изменения?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ОсновноеДействиеКоманды(Команда);
КонецПроцедуры

#Если НЕ МобильныйКлиент Тогда

&НаКлиенте
Процедура ОсновноеДействиеКоманды(Знач Команда)
	Префикс = "КомандаЭтап_";
	
	Если Команда = Команды.Найти("Печать") Тогда 
		ОткрытьФормуПечати();
		
	// события письмо, внеш воздействие 	
	ИначеЕсли Команда = Команды.Найти("ОтправитьПисьмо") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту"));
	ИначеЕсли Команда = Команды.Найти("ОтправитьСМС") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаСМС"));
	ИначеЕсли Команда = Команды.Найти("ВзаимодейтсвиеСРаботодателем") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.Работодатель"));
	ИначеЕсли Команда = Команды.Найти("ВзаимодействиеСОМС") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОМС"));
	ИначеЕсли Команда = Команды.Найти("АвтоЗвонок") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.АвтоЗвонок"));
	ИначеЕсли Команда = Команды.Найти("ЛичныйЗвонок") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ЛичныйЗвонок"));
	ИначеЕсли Команда = Команды.Найти("ОповещениеСМИ") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОповещениеСМИ"));
	ИначеЕсли Команда = Команды.Найти("РазмещениеНаСайте") Тогда
		ОткрытьНовоеСобытие(, ПредопределенноеЗначение("Справочник.энргСпособСвязи.РазмещениеНаСайте"));
		
	ИначеЕсли Команда = Команды.Найти("Создать") Тогда 
		ОткрытьНовоеСобытие(, Неопределено);
	ИначеЕсли Лев(Команда.Имя, СтрДлина(Префикс)) = Префикс Тогда 
		Если ОтправитьНаПочтуНаСервере(СтрЗаменить(Команда.Имя, Префикс, "ПФ_MXL_")) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение доставлено.");
		КонецЕсли;
		ОбработкаОповещения("УстановитьДатуЭП", Неопределено, Неопределено);
	ИначеЕсли Команда = Команды.Найти("ВернутьНаДоработку") Тогда
		ОписОпов = Новый ОписаниеОповещения("ВозвращниеНаДоработку", ЭтаФорма);
		ПарамФормы = Новый Структура("ВозращениеНаПредыдущийЭтап, Задача", Истина, Объект.Ссылка);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	ИначеЕсли Команда = Команды.Найти("ПечатьЗаявлениеОВынесенииСудебногоПриказа") Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыводЗаявленияОВынесенииСудебногоПриказа", ЭтотОбъект); 
		ПарамФормы = Новый Структура("Объект", Объект);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСписокПрилагаемыхДокументов", ПарамФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Команда = Команды.Найти("ПечатьЗаявленияОВыдачеСудебногоПриказаОВзыскании") Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыводЗаявленияОВыдачеСудебногоПриказаОВзыскании", ЭтотОбъект); 
		ПарамФормы = Новый Структура("Взыскание, Объект", Истина, Объект);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСписокПрилагаемыхДокументов", ПарамФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	ИначеЕсли Команда = Команды.Найти("ПечатьЗаявленияОВозбужденииИсполнительногоПроизводства") Тогда
		ПечатФорма = ПечатьЗаявленияОВозбужденииИсполнительногоПроизводстваНаСервере();
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("doc");
		Попытка
			МакетДоговора = ПолучитьИзВременногоХранилища(ПечатФорма.АдресХранилища);
			МакетДоговора.Записать(ВременныйФайл);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		Попытка
			Word = Новый COMОбъект("Word.Application");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при попытке создать объект ""MS Word""!" + Символы.ПС + 
			"Возможно приложение ""MS Word"" не установлено или установлено неправильно.");
			Возврат;
		КонецПопытки;
		
		Word.Documents.Open(ВременныйФайл); 
		
		// открываем и активируем документ
		СсылкаМакет = Word.Application.Documents(1);
		СсылкаМакет.Activate();
		
		Для каждого СтрокаТек Из ПечатФорма.ПараметрыШапки Цикл
			// в метод Bookmarks передаем название "закладки"
			Замена = СсылкаМакет.Content.Find;
			Замена.Execute("[" + СтрокаТек.Ключ + "]", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(СтрокаТек.Значение));
		КонецЦикла;
		
		// включаем видимость приложения
		СсылкаМакет.Application.Visible = Истина;
	ИначеЕсли Команда = Команды.Найти("ПечатьВыпискаСЛицевогоСчета") Тогда 
		ПечатьВыпискиСЛицевогоСчетаНаСервере().Показать("Выписка с лицевого счета");
	ИначеЕсли Команда = Команды.Найти("ПередатьСотрудникуУКЗ") Тогда 
		ОписОпов = Новый ОписаниеОповещения("СменаИсполнителяНаСотрудникаУКЗ", ЭтаФорма);
		ПарамФормы = Новый Структура("ПередачаУКЗ", Истина);
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	//ИначеЕсли Команда = Команды.Найти("НачатьБанкротство") Тогда 
	//	ОписОпов = Новый ОписаниеОповещения("ОбновитьСписокБанкротства", ЭтаФорма);
	//	ПарамФормы = Новый Структура("ПериодЗадолженностиНачало, ПериодЗадолженностиКонец, Абонент, Организация, Район");
	//	ЗаполнитьЗначенияСвойств(ПарамФормы, Объект);
	//	ПарамФормы.Вставить("Строение", Объект.МКД);
	//	ОткрытьФорму("Документ.энргБанкротство.Форма.ФормаДокументаСписаниеНаЗабаланс", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	ИначеЕсли Команда = Команды.Найти("ПодтвердитьПеренаправление") Тогда 
		ПарамФормы = Новый Структура("ПодтвердитьПеренаправление", Истина);
		Если ЗначениеЗаполнено(Объект.ИсторияПеренаправленийЗадачи) Тогда
			СтрокаТЧ = Объект.ИсторияПеренаправленийЗадачи[Объект.ИсторияПеренаправленийЗадачи.Количество()-1];
			
			ПарамЗапол = Новый Структура;
			ПарамЗапол.Вставить("ДатаСледующегоЭтапа",	СтрокаТЧ.ПланируемаяДатаВыполнения);
			ПарамЗапол.Вставить("Комментарий",			СтрокаТЧ.Комментарий);
			ПарамЗапол.Вставить("Пользователь", 		СтрокаТЧ.НовыйИсполнитель);
			
			ПарамФормы.Вставить("ЗначенияЗаполнения",	ПарамЗапол);
		КонецЕсли;
		ОписОпов = Новый ОписаниеОповещения("СменаИсполнителя", ЭтаФорма, Новый Структура("ПодтверждениеПередачи"));
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	ИначеЕсли Команда = Команды.Найти("ИзменитьШаг") Тогда
		ОткрытьФормуРедактированияШага();
	//ИначеЕсли Команда = Команды.Найти("ОтключитьУслугу") Тогда
	//	ПараметрыФормы = Новый Структура;
	//	ЗаполнитьДокумент = истина;
	//	ДопЗначЗапол = Неопределено;
	//	ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги");
	//	
	//	ПараметрыФормы.Вставить("ЗаполнитьДокумент",ЗаполнитьДокумент);
	//	Если ЗаполнитьДокумент тогда
	//		ЗначенияЗаполнения  				= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
	//		ЗначенияЗаполнения.КлючПомещения  	= КлючПомещения;
	//		ЗначенияЗаполнения.Организация  	= Объект.Организация;
	//		ЗначенияЗаполнения.Район		  	= Объект.Район;
	//		ЗначенияЗаполнения.Абонент  		= Объект.Абонент; 
	//		
	//	иначе
	//		ЗначенияЗаполнения = Новый Структура;
	//	КонецЕсли;
	//	
	//	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	//	ПараметрыФормы.Вставить("ВидОперации",ВидОперации);
	//	
	//	ОткрытьФорму("Документ.энргОперацияСУслугами.Форма.ФормаДокументаОтключениеУслуги", ПараметрыФормы);
	//ИначеЕсли Команда = Команды.Найти("ПрикреплениеКвитанций") Тогда
	//	СоотПериодов = Новый Соответствие;
	//	Для каждого СтрокаТЧ Из Объект.Задолженность Цикл
	//		СоотПериодов.Вставить(СтрокаТЧ.ПериодНачисления);
	//	КонецЦикла;
	//	
	//	ПарамЗапол = Новый Структура("Ссылка, Организация, Район, МКД, Абонент, СтартоваяЗадача");
	//	ЗаполнитьЗначенияСвойств(ПарамЗапол, Объект);
	//	ПарамЗапол.Вставить("Макет", "бестКвитанцияОТЭКНовая"); 
	//	
	//	ПарамФормы = Новый Структура("ПериодыНачисления, ЗначенияЗаполнения", СоотПериодов, ПарамЗапол);
	//	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаПрикрепленияКвитанций", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

#КонецЕсли

&НаКлиенте
Процедура ВыводЗаявленияОВынесенииСудебногоПриказа(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ПечатьЗаявлениеОВынесенииСудебногоПриказаНаСервере(Результат).Показать("Заявление о вынесении судебного приказа");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыводЗаявленияОВыдачеСудебногоПриказаОВзыскании(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ПечатьЗаявленияОВыдачеСудебногоПриказаОВзысканииНаСервере(Результат.СписокДок, Результат.ОтветНаПритензию).Показать("Заявления о выдаче судебного приказа о взыскании");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭтап(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ОбновитьНаименованиеНаСервере(ВыбранныйЭлемент.Значение);
	КонецЕсли;
	СоздатьКоманды();
	ОтобразатьКнопкуПечати();

КонецПроцедуры

&НаКлиенте
Процедура УстановкаЭтапаНачальнойЗадачи()
	Перем СписокЭтапов;
	
	СписокЭтапов = ПолучитьСписокЭтапов(Объект.Схема);
	
	Если СписокЭтапов.Количество() > 1 Тогда
		СписокЭтапов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("УстановитьЭтап", ЭтотОбъект), "Этап", СписокЭтапов[0]);
	Иначе
		СоздатьКоманды();
		ОтобразатьКнопкуПечати();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуПереходаНаСудебнуюРаботу(СледЭтап)
	ПарамФормы = Новый Структура("Задача, СледующийЭтап, Договор, ПериодЗадолженностиКонец, Организация, Район", Объект.Ссылка, СледЭтап);
	ПарамФормы.Вставить("ДатаЗадачи", Объект.Дата);
	ЗаполнитьЗначенияСвойств(ПарамФормы, Объект);
	ОписОпов = Новый ОписаниеОповещения("ПерейтиНаСудебнуюРаботу", ЭтаФорма);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаПереходаНаСудебнуюРаботу", ПарамФормы, ЭтаФорма,,,, ОписОпов);

	Возврат Истина;
КонецФункции 

&НаКлиенте
Процедура ОбработкаДобавленияЗадолженности(СтрокиЗадолженности, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(СтрокиЗадолженности) Тогда
		Для каждого НовДолг Из СтрокиЗадолженности Цикл
			СтрокаТЧ = Объект.Задолженность.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НовДолг);
		КонецЦикла;
		
		Модифицированность = Истина;
		ОбновитьЗадолженностьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСудебнуюРаботу(ПарамСудебнойРаботы, ДополнительныеПараметры) Экспорт
	
	Если ПарамСудебнойРаботы <> Неопределено Тогда
		Если ПерейтиНаСудебнуюРаботуНаСервере(ПарамСудебнойРаботы) Тогда
			ПрикрепитьФайлыКСудебнойРаботеНаКлиенте();
			УстановитьДоступностьЭлементов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СменаИсполнителя(ПарамВыбора, ДополнительныеПараметры) Экспорт
	
	Если ПарамВыбора <> Неопределено Тогда
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ПодтверждениеПередачи") Тогда
		 	ПодтверждениеПередачи = Истина;
		Иначе
		    ПодтверждениеПередачи = Ложь;
		КонецЕсли;
		
		Модифицированность = Истина;
		
		Если ПодтверждениеПередачи И ЗначениеЗаполнено(Объект.ИсторияПеренаправленийЗадачи) Тогда
			СтрокаТЧ = Объект.ИсторияПеренаправленийЗадачи[Объект.ИсторияПеренаправленийЗадачи.Количество()-1];
		Иначе
			СтрокаТЧ = Объект.ИсторияПеренаправленийЗадачи.Добавить();
			
			СтрокаТЧ.ДатаПеренаправления = ПолучитьДатуСеанса();
			СтрокаТЧ.Роль				 = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Этап, "Роль");
			СтрокаТЧ.Перенаправил		 = ПолучитьТекущегоПользователя();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПарамВыбора);
		
		РольРуководителя = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Роль, "РольРуководителя");
		
		Если ПодтверждениеПередачи Тогда
			Объект.Роль					= СтрокаТЧ.Роль;
			Объект.ТребуетПодтверждения = Ложь;
			Объект.Исполнитель 			= ПарамВыбора.НовыйИсполнитель;
		ИначеЕсли ЗначениеЗаполнено(РольРуководителя) Тогда
			Объект.Исполнитель 			= Неопределено;
			Объект.Роль					= РольРуководителя;
			Объект.ТребуетПодтверждения = Истина;
		Иначе
			Объект.Исполнитель = ПарамВыбора.НовыйИсполнитель;
		КонецЕсли;
		
		Объект.Комментарий		= ПарамВыбора.Комментарий;
		Объект.ПринятоВРаботу   = Ложь;
		Объект.ДатаПринятияВРаботу = Неопределено;
		
		Если ЗначениеЗаполнено(ПарамВыбора.ДатаСледЭтапа) Тогда
			Объект.ДатаСледЭтапа			   = ПарамВыбора.ДатаСледЭтапа;
			СтрокаТЧ.ПланируемаяДатаВыполнения = ПарамВыбора.ДатаСледЭтапа;
		КонецЕсли;
		
		//Если ПодтверждениеПередачи Тогда
		
			Записать();
			Закрыть();
		
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СменаИсполнителяНаСотрудникаУКЗ(ПарамВыбора, ДополнительныеПараметры) Экспорт
	
	Если ПарамВыбора <> Неопределено Тогда
		Модифицированность = Ложь;
		
		СтрокаТЧ = Объект.ИсторияПеренаправленийЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПарамВыбора);
		СтрокаТЧ.Перенаправил		 = ПолучитьТекущегоПользователя();
		СтрокаТЧ.ДатаПеренаправления = ПолучитьДатуСеанса();
		
		Объект.Исполнитель = ПарамВыбора.НовыйИсполнитель;
		Объект.Комментарий = ПарамВыбора.Комментарий;
		
		ДатаСледЭтапа = ?(ЗначениеЗаполнено(ПарамВыбора.ДатаСледЭтапа), ПарамВыбора.ДатаСледЭтапа, НачалоДня(ТекущаяДата() + 7*24+3600));
		Объект.ДатаСледЭтапа			   = ДатаСледЭтапа;
		СтрокаТЧ.ПланируемаяДатаВыполнения = ДатаСледЭтапа;
		
		Записать();
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВозвращниеНаДоработку(ПарамВыбора, ДополнительныеПараметры) Экспорт
	
	Если ПарамВыбора <> Неопределено Тогда
		Объект.ПометкаУдаления = Истина;
		Записать();
		Если Не ВернутьВРаботуОснование(Объект.Основание, ПарамВыбора) Тогда 
			Объект.ПометкаУдаления = Ложь;
			Записать();
		КонецЕсли;
		УстановитьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ_Задолженность(Ветвь)
	Ветви = Ветвь.ПолучитьЭлементы();
	
	Если ЗначениеЗаполнено(Ветви) Тогда
		Для каждого Подветвь Из Ветви Цикл
			ЗаполнитьТЧ_Задолженность(Подветвь);
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(Ветвь.Задолженность) Тогда 
			СтрокаТЧ = Объект.Задолженность.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Ветвь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОтобразатьКнопкуПечати()
	Элементы.ФормаПечать.Видимость = Ложь;
	ИмяМакета = "";
	
	Префикс = "КомандаЭтап_";
	Для каждого ТекКоманда Из Элементы.ГрппаКнопкиОтправкиЭП.ПодчиненныеЭлементы Цикл
		Если Лев(ТекКоманда.Имя, СтрДлина(Префикс)) <> Префикс Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЭтапа = СтрЗаменить(ТекКоманда.Имя, Префикс, "ЭтапПретензионноИсковойДеятельности_");
		Если Объект.Этап = ПредопределенноеЗначение("Справочник.энргВидыОперацийПИД." + ИмяЭтапа) Тогда
			ТекКоманда.Видимость = Истина;
			Элементы.ФормаПечать.Видимость = Истина;
			ИмяМакета = СтрЗаменить(ТекКоманда.Имя, Префикс, "ПФ_MXL_");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроверитьТекущуюСудебнуюИнстанцию(НомерСтроки = Неопределено)
	Если НомерСтроки = Неопределено Тогда
		НомерСтроки = 1;
		Для каждого СтрокаТЧ Из Объект.СудебныеИнстанции Цикл
			Если СтрокаТЧ.Текущая Тогда
				НомерСтроки = СтрокаТЧ.НомерСтроки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.СудебныеИнстанции Цикл
		СтрокаТЧ.Текущая = СтрокаТЧ.НомерСтроки = НомерСтроки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьтолькоПросмотрДляЭлементов()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Поставщик.ТолькоПросмотр	= Истина;
		Элементы.Схема.ТолькоПросмотр		= Истина;
		Элементы.Абонент.ТолькоПросмотр		= Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокБанкротства(ПарамВыбора, ДополнительныеПараметры) Экспорт
	УстановитьПараметрыИВидимостьБанкротства();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыКСудебнойРаботеНаКлиенте()
	
	ПутьКФайлам = ПолучитьПапкуДляПрикрепленияФайловСудебнойРаботы();
	Если НЕ ЗначениеЗаполнено(ПутьКФайлам) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВладелецФайла", ?(ЗначениеЗаполнено(Объект.СтартоваяЗадача), Объект.СтартоваяЗадача, Объект.Ссылка));
	ДополнительныеПараметры.Вставить("ГруппаФайлов", Неопределено);
	ДополнительныеПараметры.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	ДополнительныеПараметры.Вставить("Фильтр", "");
	ДополнительныеПараметры.Вставить("МассоваяЗагрузка", Истина);
	ДополнительныеПараметры.Вставить("ПутьКФайлам", ПутьКФайлам);
	
	РаботаСФайламиСлужебныйКлиент.ДобавитьФайлыРасширениеПредложено(Истина, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПодэтапов()

	Для каждого СтрокаТЧ Из Объект.Подэтапы Цикл
		Если СтрокаТЧ.Выполнен Тогда
			СтрокаТЧ.Состояние = "Завершен";
		ИначеЕсли СтрокаТЧ.Текущий Тогда
			СтрокаТЧ.Состояние = "Текущий";
		ИначеЕсли СтрокаТЧ.Отменен Тогда
			СтрокаТЧ.Состояние = "Отменен";
		Иначе
			СтрокаТЧ.Состояние = "Запланирован";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеФункцииНаСервере

&НаСервере
Процедура ОбновитьНаименованиеНаСервере(ПредЭтап = Неопределено)
	Задачи.энргЗадачаПИД.ЗаполнитьНаименованиеИЭтап(Объект, ПредЭтап);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодчинённыеЗадачи(Задача)

	СписокЗадач = Новый СписокЗначений;
	Задачи.энргЗадачаПИД.ПолучитьСписокНижележащихЗадач(Задача, СписокЗадач);
	
	Возврат СписокЗадач;
КонецФункции

&НаСервере
Функция ПовторитьЭтапНаСервере()
	Отказ = Ложь;
	
	Попытка
		Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, Объект.Этап, Объект);
		Если Не Отказ Тогда
			ОбъектЗадача = РеквизитФормыВЗначение("Объект");
			ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
			ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Не Отказ;
КонецФункции

&НаСервере
Функция ПрекратитьПИДНаСервере(ПрекращенаДеятельность=Истина)
	Попытка
		ОбъектЗадача = РеквизитФормыВЗначение("Объект");
		ОбъектЗадача.ПрекращенаДеятельность = ПрекращенаДеятельность;
		Если ПрекращенаДеятельность Тогда
			ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
		Иначе
			ОбъектЗадача.Выполнена = Ложь;
			ОбъектЗадача.Записать();
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Модифицированность = Ложь;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПерейтиНаЭтапНаСервере(ИмяКоманды)
	Попытка
		Команда = Команды.Найти(ИмяКоманды);
		НачатьТранзакцию();
		ОбъектЗадача = РеквизитФормыВЗначение("Объект");
		Если Модифицированность Тогда
			ОбъектЗадача.Записать();
		КонецЕсли;
		
		СледЭтап = Справочники.энргВидыОперацийПИД.НайтиПоНаименованию(Команда.Заголовок, Истина);
		Если Не ЗначениеЗаполнено(СледЭтап) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден этап """ + Команда.Заголовок + """.");
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		Отказ = Ложь;
		Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, СледЭтап, ОбъектЗадача);
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
		
		ЗафиксироватьТранзакцию();
		ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
		Модифицированность = Ложь;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
КонецФункции

&НаСервере
Процедура СоздатьКоманды()
	// Удаление старых команд
	КомандыЭтапов = Новый Массив;
	ЗадачаПоПереговорам	= Объект.Этап = ПредопределенноеЗначение("Справочник.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Переговоры");
	Для каждого КомандаЭтапа Из Элементы.ФормаГруппаПерейтиНаЭтап.ПодчиненныеЭлементы Цикл
		КомандыЭтапов.Добавить(КомандаЭтапа); 
	КонецЦикла;
	
	Для каждого КомандаЭтапа Из КомандыЭтапов Цикл
		ЭтаФорма.Команды.Удалить(ЭтаФорма.Команды.Найти(КомандаЭтапа.ИмяКоманды));
		Элементы.Удалить(КомандаЭтапа);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.Этап) Или Не ЗначениеЗаполнено(Объект.Схема)  Или Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Ссылка КАК Ссылка,
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	энргСхемыПИДЭтапы.НомерСтроки КАК НомерСтроки,
		|	энргСхемыПИДЭтапы.Необязательный КАК Необязательный
		|ПОМЕСТИТЬ ВТ_НомерЭтапа
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|ГДЕ
		|	энргСхемыПИДЭтапы.Ссылка = &Схема
		|	И энргСхемыПИДЭтапы.Этап = &Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	энргСхемыПИДЭтапы.НомерСтроки КАК НомерСтроки,
		|	энргСхемыПИДЭтапы.Этап.Наименование КАК Наименование,
		|	энргСхемыПИДЭтапы.Необязательный КАК Необязательный
		|ИЗ
		|	ВТ_НомерЭтапа КАК ВТ_НомерЭтапа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|		ПО ВТ_НомерЭтапа.Ссылка = энргСхемыПИДЭтапы.Ссылка
		|			И ВТ_НомерЭтапа.НомерСтроки < энргСхемыПИДЭтапы.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	Этап";
	
	Если ЗадачаПоПереговорам Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_НомерЭтапа.НомерСтроки <", "ВТ_НомерЭтапа.НомерСтроки <=");
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Схема", Объект.Схема);
	Запрос.УстановитьПараметр("Этап", Объект.Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЭтап = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭтоПервый	 = Истина;
	ЭтоПоследний = Ложь;
	Сч = 1;
	Пока ВыборкаЭтап.Следующий() Цикл
		Выборка = ВыборкаЭтап.Выбрать();
	
		Если Выборка.Следующий() Тогда
			Если Не Выборка.Необязательный Тогда
				Если ЭтоПервый И ЗадачаПоПереговорам Тогда
				ИначеЕсли ЭтоПервый И Не ЗадачаПоПереговорам Тогда
					Прервать;
				Иначе
				    ЭтоПоследний = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// Добавление команды
			ИмяКмд = "КомандаЭтап" + Формат(Сч, "ЧГ=0");
			
			Кмд = ЭтаФорма.Команды.Добавить(ИмяКмд);
			Кмд.Действие = "ПерейтиНаЭтап";
			Кмд.Заголовок = Выборка.Наименование;
			
			// Добавление новой кнопки
			ЭлементКМД = Элементы.Добавить(ИмяКмд, Тип("КнопкаФормы"), Элементы.ФормаГруппаПерейтиНаЭтап);
			ЭлементКМД.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			ЭлементКМД.ИмяКоманды = ИмяКмд;
			
			Сч = Сч + 1;
			ЭтоПервый = Ложь;
			Если ЭтоПоследний Тогда
				Прервать;			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого КомандаЭтап Из Элементы.ФормаГруппаПерейтиНаЭтап.ПодчиненныеЭлементы Цикл
		КомандаЭтап.Доступность = Не Объект.Выполнена;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаКомандЭтапов()

	СписокЗначений = Новый СписокЗначений;
	
	Для каждого КомандаЭтап Из Элементы.ФормаГруппаПерейтиНаЭтап.ПодчиненныеЭлементы Цикл
		Если КомандаЭтап.Доступность Тогда
			СписокЗначений.Добавить(КомандаЭтап.ИмяКоманды, Команды.Найти(КомандаЭтап.ИмяКоманды).Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокЗначений;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСеанса()

	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()

	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаСервере
Функция ОтправитьНаПочтуНаСервере(ИмяМакета)
	ТипСобытия = ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту");
	
	Возврат Документы.энргСобытие.СоздатьИВыполнитьСобытиеНаОсновеЗадачи(Объект.Ссылка, ТипСобытия,,, ИмяМакета);
КонецФункции

&НаСервере
Процедура ОбновитьДатуОтправки(ИмяЭлемента, ТипСобытия)

	Элементы[ИмяЭлемента].Видимость = Ложь;
	ЭтаФорма[ИмяЭлемента] = "";
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСобытияСрезПоследних.Период КАК Период,
		|	энргСобытияСрезПоследних.Успех КАК Успех,
		|	энргСобытияСрезПоследних.Результат КАК Результат
		|ИЗ
		|	РегистрСведений.энргСобытия.СрезПоследних(
		|			,
		|			ТипСобытия = &ТипСобытия
		|				И Основание = &Ссылка) КАК энргСобытияСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипСобытия", ТипСобытия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Элементы[ИмяЭлемента].Видимость = Истина;
		ЭтаФорма[ИмяЭлемента] = Формат(Выборка.Период, "ДФ=dd.MM.yyyy") + ?(Выборка.Успех, " (доставлено)", " (не доставлено)");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЭтапов(Схема)

	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	энргСхемыПИДЭтапы.НомерСтроки КАК НомерСтроки,
		|	энргСхемыПИДЭтапы.Необязательный КАК Необязательный,
		|	ЕСТЬNULL(энргСхемыПИДЭтапы1.Этап, НЕОПРЕДЕЛЕНО) КАК ПредЭтап
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы1
		|		ПО энргСхемыПИДЭтапы.Ссылка = энргСхемыПИДЭтапы1.Ссылка
		|			И (энргСхемыПИДЭтапы.НомерСтроки - 1 = энргСхемыПИДЭтапы1.НомерСтроки)
		|ГДЕ
		|	энргСхемыПИДЭтапы.Ссылка = &Схема
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Схема", Схема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ПредЭтап, Строка(Выборка.Этап));
		Если Не Выборка.Необязательный Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВнешВоздействие()
	СобытияПоЭтапуДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Ссылка", ?(Объект.Ссылка.Пустая(), Ложь, Объект.Ссылка));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПарметрыПредыдущиеСудебныеИнстанции()
	ПредыдущиеСудебныеИнстанции.Параметры.УстановитьЗначениеПараметра("СтартоваяЗадача", Объект.СтартоваяЗадача);
	ПредыдущиеСудебныеИнстанции.Параметры.УстановитьЗначениеПараметра("ДатаЗадачи",		 Объект.Дата);
	ПредыдущиеСудебныеИнстанции.Параметры.УстановитьЗначениеПараметра("Ссылка",			 Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыКомментарии()
	ПолеДело = Новый ПолеКомпоновкиДанных("Дело");
	Для каждого ТекЭлем Из КомментарииКДелу.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекЭлем.ЛевоеЗначение = ПолеДело Тогда
			ТекЭлем.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекЭлем Из СтатусОтчеты.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекЭлем.ЛевоеЗначение = ПолеДело Тогда
			ТекЭлем.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	//Для каждого ТекЭлем Из СудебныеЗаседания.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если ТекЭлем.ЛевоеЗначение = ПолеДело Тогда
	//		ТекЭлем.ПравоеЗначение = Объект.Ссылка;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакОтоброжатьТолькоВажные(ДинамСписок, Использовать)
	ПолеДело = Новый ПолеКомпоновкиДанных("Важно");
	Для каждого ТекЭлем Из ЭтаФорма[ДинамСписок].КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекЭлем.ЛевоеЗначение = ПолеДело Тогда
			ТекЭлем.Использование = Использовать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСледующийЭтап(Схема, Этап)

	Возврат Справочники.энргСхемыПИД.ПолучитьСледующийЭтап(Схема, Этап);
КонецФункции

&НаСервереБезКонтекста
Функция НачалоСудебнойРаботы(Этап, Знач СледЭтап) 

	Возврат Этап.Тип = Перечисления.энргТипыЭтапов.ДосудебнаяРабота И СледЭтап.Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота;
КонецФункции

&НаСервере
Функция ЭтапКоманды(ИмяКоманды)
	Команда = Команды.Найти(ИмяКоманды);
	
	Возврат Справочники.энргВидыОперацийПИД.НайтиПоНаименованию(Команда.Заголовок, Истина);
КонецФункции

&НаСервере
Функция ПерейтиНаСудебнуюРаботуНаСервере(ПарамСудебнойРаботы)
	Попытка
		НачатьТранзакцию();
		ОбъектЗадача = РеквизитФормыВЗначение("Объект");
		Если Модифицированность Тогда
			ОбъектЗадача.Записать();
		КонецЕсли;
		
		СледЭтап = ПарамСудебнойРаботы.СледующийЭтап;
		Если Не ЗначениеЗаполнено(СледЭтап) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определён следующий этап.");
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		Отказ = Ложь;
		Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, СледЭтап, ОбъектЗадача, ПарамСудебнойРаботы, ПарамСудебнойРаботы.Задолженность);
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
		
		ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
		Модифицированность = Ложь;
		
		СтартоваяЗадача = ?(ЗначениеЗаполнено(Объект.СтартоваяЗадача), Объект.СтартоваяЗадача, Объект.Ссылка);
		
		// Прикрепление файлов из документа
		Для каждого Справочник Из ПарамСудебнойРаботы.ПрикрепляемыеФайлы Цикл		
			ПараметрыДобавляемогоФайла	= Новый Структура;
			ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов", СтартоваяЗадача);
			ПараметрыДобавляемогоФайла.Вставить("Автор", Справочник.Автор);
			ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения", Справочник.Наименование);
			ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки", Справочник.Расширение);
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения", МестноеВремя(Справочник.ДатаМодификацииУниверсальная, ЧасовойПоясСеанса()));
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное", Справочник.ДатаМодификацииУниверсальная);
			    
			ЗаписьИсточник = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьМенеджерЗаписи();
			ЗаписьИсточник.Файл = Справочник;
			ЗаписьИсточник.Прочитать();
			ДвоичныйФайл = ЗаписьИсточник.ДвоичныеДанныеФайла.Получить();
			АдресХранилищаОтчета = ПоместитьВоВременноеХранилище(ДвоичныйФайл);
			
			РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, АдресХранилищаОтчета);
		КонецЦикла;
		
		ИмяКаталогаОтчета	= СтрЗаменить(ПолучитьИмяВременногоФайла(".tmp"), ".tmp", "");

		// Создание временного каталога
		Отказ = Ложь;
		Попытка
			СоздатьКаталог(ИмяКаталогаОтчета);
		Исключение
			Отказ = Истина;
		КонецПопытки;

		// Добавление в файлы "Уведомления"
		ТабДок = СформироватьТабДокУведомление(Объект.Ссылка, Ложь);
		Если ТабДок <> Неопределено Тогда
			
			ИмяФайла = ИмяКаталогаОтчета + "\Уведомление.pdf";
			
			// Создание временного каталога
			Попытка
				ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
				
				ФайлОтчета 				= Новый ДвоичныеДанные(ИмяФайла); 
				АдресХранилищаОтчета 	= ПоместитьВоВременноеХранилище(ФайлОтчета);
				
				ДатаМодификацииФайла		= ТекущаяДатаСеанса();
				ПараметрыДобавляемогоФайла	= Новый Структура;
				ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов"				, СтартоваяЗадача);
				ПараметрыДобавляемогоФайла.Вставить("Автор"							, Строка(ПараметрыСеанса.ТекущийПользователь));
				ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения"				, "Уведомление");
				ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки"			, "pdf");
				ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения"				, МестноеВремя(ДатаМодификацииФайла, ЧасовойПоясСеанса()));
				ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное"	, ДатаМодификацииФайла);
				РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, АдресХранилищаОтчета); 
			Исключение
			КонецПопытки;
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяКаталогаОтчета) Тогда
			Попытка
				УдалитьФайлы(ИмяКаталогаОтчета);
			Исключение
			КонецПопытки;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьТабДокУведомление(Задача, ТолькоКвитанцию = Истина)
	ИмяМакета = "ПФ_MXL_Уведомление";
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Если ТолькоКвитанцию Тогда
		ОбластиМакета = Новый Структура("Квитанция");
	Иначе
		ОбластиМакета = Новый Структура("БланкФилиала, Шапка");
	КонецЕсли;
	
	ЕстьКвит = Справочники.энргВидыОперацийПИД.СформироватьПечатнуюФормуЭтапа(Задача, ИмяМакета, ТабличныйДокумент, ОбластиМакета);

	Если ЕстьКвит Тогда 
		Возврат ТабличныйДокумент;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьВРаботуОснование(Основание, ПарамВозвращения)
	Попытка
		ОбъкетЗадача = Основание.ПолучитьОбъект();
		ОбъкетЗадача.Выполнена = Ложь;
		ЗаполнитьЗначенияСвойств(ОбъкетЗадача, ПарамВозвращения);
		ОбъкетЗадача.Исполнитель = ПарамВозвращения.НовыйИсполнитель;
		
		СтрокаТЧ = ОбъкетЗадача.ИсторияПеренаправленийЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПарамВозвращения);
		СтрокаТЧ.Перенаправил				= ПолучитьТекущегоПользователя();
		СтрокаТЧ.ДатаПеренаправления		= ТекущаяДатаСеанса();
		СтрокаТЧ.ПланируемаяДатаВыполнения	= ПарамВозвращения.ДатаСледЭтапа;
		
		ОбъкетЗадача.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось вернуть в работу предыдущую задачу по причине: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСледСтатусОтчёта(Дело)

	Если Не ЗначениеЗаполнено(Дело) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКомментарииКСудебномуДелу.Период КАК Период,
		|	энргКомментарииКСудебномуДелу.ДатаСледующегоОтчёта КАК ДатаСледующегоОтчёта,
		|	энргКомментарииКСудебномуДелу.Ссылка КАК СтатусОтчёт
		|ПОМЕСТИТЬ ВТ_СтатусОтчёт
		|ИЗ
		|	Справочник.энргКомментарииКСудебномуДелу КАК энргКомментарииКСудебномуДелу
		|ГДЕ
		|	энргКомментарииКСудебномуДелу.Дело = &Дело
		|	И энргКомментарииКСудебномуДелу.СтатусОтчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_СтатусОтчёт.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ДатаПослОтчёта
		|ИЗ
		|	ВТ_СтатусОтчёт КАК ВТ_СтатусОтчёт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_СтатусОтчёт.ДатаСледующегоОтчёта) КАК ДатаСледующегоОтчёта
		|ИЗ
		|	ВТ_ДатаПослОтчёта КАК ВТ_ДатаПослОтчёта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусОтчёт КАК ВТ_СтатусОтчёт
		|		ПО ВТ_ДатаПослОтчёта.Период = ВТ_СтатусОтчёт.Период";
	
	Запрос.УстановитьПараметр("Дело", Дело);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаСледующегоОтчёта;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции 

&НаСервере
Функция ПечатьЗаявлениеОВынесенииСудебногоПриказаНаСервере(СписокДок)
	ПарамДолга = Новый Структура("СуммаОсновногоДолга, Пеня", Объект.СуммаЗадолженности, Объект.СуммаПени);
	Возврат Задачи.энргЗадачаПИД.ПечатьЗаявлениеОВынесенииСудебногоПриказа(Объект.Ссылка, СписокДок, ПарамДолга);
КонецФункции

&НаСервере
Функция ПечатьЗаявленияОВыдачеСудебногоПриказаОВзысканииНаСервере(СписокДок, ОтветНаПритензию)
	ПарамДолга = Новый Структура("СуммаОсновногоДолга, Пеня, Госпошлина", Объект.СуммаЗадолженности, Объект.СуммаПени, Объект.СуммаГоспошлина);
	Возврат Задачи.энргЗадачаПИД.ПечатьЗаявленияОВыдачеСудебногоПриказаОВзыскании(Объект.Ссылка, СписокДок, ОтветНаПритензию, ПарамДолга);
КонецФункции

&НаСервере
Функция ПечатьЗаявленияОВозбужденииИсполнительногоПроизводстваНаСервере()
	
	ПарамДолга = Новый Структура("СуммаОсновногоДолга", Объект.СуммаЗадолженности);
	Возврат Задачи.энргЗадачаПИД.ПечатьЗаявленияОВозбужденииИсполнительногоПроизводстваНаСервере(Объект.Ссылка, ПарамДолга);
КонецФункции

&НаСервере
Функция ПечатьВыпискиСЛицевогоСчетаНаСервере()

	НачПериод = Объект.Дата;
	КонПериод = Дата(1,1,1);
	Для каждого СтрокаТЧ Из Объект.Задолженность Цикл
		НачПериод = Мин(СтрокаТЧ.ПериодНачисления, НачПериод);
		КонПериод = Макс(КонецМесяца(СтрокаТЧ.ПериодНачисления), КонПериод);
	КонецЦикла;
	
	Возврат Задачи.энргЗадачаПИД.ПечатьВыпискиСЛицевогоСчета(Объект, НачПериод, КонПериод);
КонецФункции

&НаСервере
Процедура УстановитьПараметрыИВидимостьБанкротства()

	СудебныеЗаседания.Параметры.УстановитьЗначениеПараметра("ПериодЗадолженностиНачало", Объект.ПериодЗадолженностиНачало);
	СудебныеЗаседания.Параметры.УстановитьЗначениеПараметра("ПериодЗадолженностиКонец",	 Объект.ПериодЗадолженностиКонец);
	СудебныеЗаседания.Параметры.УстановитьЗначениеПараметра("Абонент",					 Объект.Абонент);
	СудебныеЗаседания.Параметры.УстановитьЗначениеПараметра("Организация",				 Объект.Организация);
	СудебныеЗаседания.Параметры.УстановитьЗначениеПараметра("Район",					 Объект.Район);
	Элементы.СудебныеЗаседания.Обновить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СудебныеЗаседания.ТекстЗапроса;
	Запрос.УстановитьПараметр("ПериодЗадолженностиНачало",	Объект.ПериодЗадолженностиНачало);
	Запрос.УстановитьПараметр("ПериодЗадолженностиКонец",	Объект.ПериодЗадолженностиКонец);
	Запрос.УстановитьПараметр("Абонент",					Объект.Абонент);
	Запрос.УстановитьПараметр("Организация",				Объект.Организация);
	Запрос.УстановитьПараметр("Район",					 	Объект.Район);
	
	Банкротство = Не Запрос.Выполнить().Пустой();
	Элементы.СтраницаБанкротство.Видимость = Банкротство;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПапкуДляПрикрепленияФайловСудебнойРаботы()
	
	Возврат Константы.энргКаталогХраненияСудебныхДокументов.Получить();
	
КонецФункции

&НаСервере
Процедура ОбновитьЗадолженностьНаСервере()
	Если ЭтоСудебнаяРабота Или ЭтоИсполнительнаяРабота Тогда
		Возврат;
	КонецЕсли;
	
	СписокДолгов = Новый Массив;
	
	Для каждого СтрокаТЧ Из Объект.Задолженность Цикл
		СписокДолгов.Добавить(Новый Структура("ПериодНачисления, Услуга, СуммаДо", СтрокаТЧ.ПериодНачисления, СтрокаТЧ.Услуга, СтрокаТЧ.Задолженность));
	КонецЦикла;
	
	ПарамЗапроса = Новый Структура("Организация, Район, Договор");
	ЗаполнитьЗначенияСвойств(ПарамЗапроса, Объект);
	
	РезультатДерево = Задачи.энргЗадачаПИД.ПолучитьЗадолженность(СписокДолгов, ПарамЗапроса);
	Если РезультатДерево = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РезультатДерево = РезультатДерево.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(РезультатДерево, "ДеревоЗадолженности");
	
	Ветви = ДеревоЗадолженности.ПолучитьЭлементы();
	НовСуммаЗадолженности = ?(ЗначениеЗаполнено(Ветви), Ветви[0].Задолженность, 0);
	Если НовСуммаЗадолженности <> Объект.СуммаЗадолженности И Не ЭтоИсполнительнаяРабота И Не ЭтоСудебнаяРабота Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма задолженности изменена.");
		Объект.СуммаЗадолженности = НовСуммаЗадолженности;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСтатусСудДела()
	ЗадачаСудебногоДела = задачи.энргЗадачаПИД.ПолучитьЗадачуПоОснованию(Объект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтатусыСудебныхДелСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.энргСтатусыСудебныхДел.СрезПоследних(&ТекДата, СудебноеДело = &СудебноеДело) КАК энргСтатусыСудебныхДелСрезПоследних";
	
	Запрос.УстановитьПараметр("СудебноеДело", ЗадачаСудебногоДела);
	Запрос.УстановитьПараметр("ТекДата"		, ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СтатусСудебногоДелаДляПередачиДокументов = Справочники.энргСтатусыДелСудебнойРаботы.ПустаяСсылка();
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	СтатусСудебногоДелаДляПередачиДокументов = Выборка.Статус;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСобытияПоЗадаче(Задача)

	Возврат Задачи.энргЗадачаПИД.ЕстьСобытияПоЗадаче(Задача);
КонецФункции
#КонецОбласти

#Область РАБОТА_С_API_ФССП

#Область ЗАПРОС_НА_ПОИСК
// 5.1. «Запрос на поиск сведений о физическом лице»

&НаКлиенте
Процедура ЗапросНаПоиск(Команда)
	Если Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запишите объект перед отправкой запроса.");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СлужбаСудебныхПристовов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните реквизит ""Служба судебных пристовов""");
		Возврат;
	КонецЕсли;
	
	ЗапросНаПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапросНаПоискНаСервере()
	УровеньЖурнала 	= УровеньЖурналаРегистрации.Информация;
	ФизЛицо 		= Объект.Абонент.ФизЛицо;
	КодРегиона		= Объект.СлужбаСудебныхПристовов.КодРайона;
	ТекстЗапроса 	= "&region=" + СокрЛП(КодРегиона) + "&firstname="+ ФизЛицо.бестИмя + "&lastname=" + ФизЛицо.бестФамилия;
	
	Отчество 		= СокрЛП(ФизЛицо.бестОтчество);
	ДатаРождения 	= ФизЛицо.бестДатаРождения;
	Если не Отчество = "" Тогда
		ТекстЗапроса = ТекстЗапроса + "&secondname=" + Отчество;
	КонецЕсли;
	
	Если не ДатаРождения = Дата(1,1,1,0,0,0) Тогда
		ТекстЗапроса = ТекстЗапроса + "&birthdate=" + Формат(ДатаРождения,"ДФ=дд.ММ.гггг");
	КонецЕсли;
	ОсуществитьЗапросКСервису(ТекстЗапроса,"/search/physical",УровеньЖурнала);
КонецПроцедуры
	
#КонецОбласти

#Область ЗАПРОС_НА_ПОЛУЧЕНИЕ_РЕЗУЛЬТАТА
// 5.5. «Проверка статуса поданного запроса»
// Если 5.5 выполнился cо статусом success
// 5.6. «Получение результатов поданного запроса»

&НаКлиенте
Процедура ПроверкаСтатусаПоданногоЗапроса(Команда)
	Если Не ЗначениеЗаполнено(Объект.СлужбаСудебныхПристовов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните реквизит ""Служба судебных пристовов""");
		Возврат;
	КонецЕсли;
	
	Если Объект.Task = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выполнен запрос на поиск сведений о физическом лице.");
		Возврат;
	КонецЕсли;
	
	ПроверкаСтатусаПоданногоЗапросаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаСтатусаПоданногоЗапросаНаСервере()
	
	УровеньЖурнала 	= УровеньЖурналаРегистрации.Информация;
	ОсуществитьЗапросКСервису("&task=" + Объект.Task ,"/status",УровеньЖурнала);
	
	// Если  МетодВызова = "/status" тогда надо запросить следующий этап уже результат!
	Если не УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка Тогда		
		ОсуществитьЗапросКСервису("&task=" + Объект.Task ,"/result",УровеньЖурнала);
	КонецЕсли;
КонецПроцедуры
	
#КонецОбласти


#Область ОбработчикиСобытийЭтапов

&НаКлиенте
Процедура ПодэтапыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодэтапыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодэтапыПриАктивизацииСтроки(Элемент)
	ТекСтрока	= Элементы.Подэтапы.ТекущиеДанные;
	ТекущийЭтап = ТекСтрока <> Неопределено И ТекСтрока.Текущий;
	
	//Элементы.ПодэтапыЗавершитьПодэтап.Доступность = ТекущийЭтап;
КонецПроцедуры

&НаКлиенте
Процедура ПодэтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Команда = Команды.Найти("ИзменитьШаг");
	СохрнаитьИзмененияПередВыполнениемКоманды(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияШага()
	
	Перем ОписОпов, ПарамФормы, РекФормы;
	
	ТекСтрока = Элементы.Подэтапы.ТекущиеДанные;
	
	РекФормы	= Новый Структура("Задача, Этап, СтартоваяЗадача, IDЭтапа, Подэтап, ДатаНачала, ДатаОкончания, Выполнен, Текущий, Результат, Отменен",
			Объект.Ссылка, Объект.Этап, Объект.СтартоваяЗадача);
	ЗаполнитьЗначенияСвойств(РекФормы, ТекСтрока);		
	
	ПарамФормы  = Новый Структура("РеквизитыФормы", РекФормы);
	ОписОпов	= Новый  ОписаниеОповещения("ЗавершениеЭтапа", ЭтотОбъект);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаВыполнениеШага", ПарамФормы, ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовоеСобытие(IdЭтапа = Неопределено, ТипСобытия)

	ОписОпов = Новый ОписаниеОповещения("ОбновитьСобытия", ЭтотОбъект);
	бестРаботаСЗадачамиПИРКлиент.СоздатьСобытеДляЭтапа(Объект, IdЭтапа, Объект.Подэтапы, ЭтаФорма, ОписОпов, ТипСобытия);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСобытия(Результат, ДополнительныеПараметры) Экспорт
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЭтапа(Результат, ДополнительныеПараметры) Экспорт
	Перем IDЭтапа;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("IDЭтапа", IDЭтапа) Тогда 
		Отбор = Новый Структура("IDЭтапа", IDЭтапа);
		
		СтрокиТЗ = Объект.Подэтапы.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(СтрокиТЗ) Тогда
			ТекСтрока = СтрокиТЗ[0];
		Иначе
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		ЗаполнитьЗначенияСвойств(ТекСтрока, Результат);
		//ТекСтрока.Результат		  = Результат.Результат;
		//ТекСтрока.ДатаОкончания   = Результат.ДатаОкончания;
		
		СписокФайловШага = Неопределено;
		Если Результат.Свойство("СписокФайловШага", СписокФайловШага) Тогда
			ФайлыЭтапа = Объект.ФайлыПодэтапов.НайтиСтроки(Отбор);
			
			Для каждого ТекСтрока Из ФайлыЭтапа Цикл
				Объект.ФайлыПодэтапов.Удалить(ТекСтрока);
			КонецЦикла;
			
			Для каждого ТекФайл Из СписокФайловШага Цикл
			
				СтрокаТЧ = Объект.ФайлыПодэтапов.Добавить();
				СтрокаТЧ.IDЭтапа = IDЭтапа;
				СтрокаТЧ.Файл	 = ТекФайл;
			
			КонецЦикла;
			
		КонецЕсли;
		
		//ТекСтрока.Текущий		  = Ложь;
		//ТекСтрока.Отменен		  = Ложь;
		Если ТекСтрока.Выполнен И Не ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) Тогда
			ТекСтрока.ДатаОкончания = ТекущаяДата();
		КонецЕсли;
		Если (ТекСтрока.Выполнен Или ТекСтрока.Текущий) И Не ЗначениеЗаполнено(ТекСтрока.ДатаНачала) Тогда
			ТекСтрока.ДатаНачала = ТекущаяДата();
		КонецЕсли;
		
		СтрокиТЗ = Объект.Подэтапы.НайтиСтроки(Новый Структура("Текущий", Истина));
		НайденаСледующая = Ложь;
		Если Не ЗначениеЗаполнено(СтрокиТЗ) Тогда
		    Объект.Подэтапы.Сортировать("Порядок Возр");
			
			Для каждого ТекСтрока Из Объект.Подэтапы Цикл
			
				Если НайденаСледующая И Не ТекСтрока.Параллельно Тогда
					Прервать;
				КонецЕсли;
				
				Если Не (ТекСтрока.Выполнен Или ТекСтрока.Отменен) Тогда
					ТекСтрока.Текущий		= Истина;
					ТекСтрока.ДатаНачала	= ТекущаяДата();
					ТекСтрока.ДатаОкончания	= ?(ЗначениеЗаполнено(ТекСтрока.Продолжительность), ТекущаяДата()+24*3600*ТекСтрока.Продолжительность, Неопределено);
					
					НайденаСледующая		= Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НайденаСледующая = Истина;
		КонецЕсли;
		
		УстановитьСостояниеПодэтапов();
		ПодэтапыПриАктивизацииСтроки(Неопределено);
		//Модифицированность = Ложь;
		Записать();
		
		Если Не НайденаСледующая Тогда
		    Ответ = Неопределено;

		    ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаНаВыполнениеЗадачи", ЭтотОбъект), "Все шаги завершены. Перейти к следующему этапу?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВыполнениеЗадачи(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		Отказ = Ложь;
		ПередВыполнением(Отказ);
		Если Не Отказ Тогда
			Записать(Новый Структура("ВыполнитьЗадачу", Истина));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


Процедура ОсуществитьЗапросКСервису(ТекстЗапроса,МетодВызова,УровеньЖурнала)
	Модифицированность 	= Истина;
	Токен 				= "jtvB6OIPlyhn";
	ИтоговоыйТекст 		= МетодВызова + "?token=" + Токен + ТекстЗапроса;
	Сообщение			= "Запрос выполнен успешно";	
	
	Попытка 	
		
		ssl 		= Новый ЗащищенноеСоединениеOpenSSL( неопределено, неопределено );	
		Соединение 	= Новый HTTPСоединение("api-ip.fssprus.ru/api/v1.0",,,,,,ssl);	
		
		HTTPЗапрос 					= Новый HTTPЗапрос(ИтоговоыйТекст);		
		Результат 					= Соединение.Получить(HTTPЗапрос);		
		
		ЧтениеJSON 					= Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());			
		ДанныеИзЗапроса 			= ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		// Получение корректного текста из результата 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеИзЗАпроса);
		Тело		= ЗаписьJSON.Закрыть();
		
		ДопОписание = "";
		Если Результат.КодСостояния = 200 Тогда
			ОпределитьРезультат(МетодВызова,ДанныеИзЗапроса,ДопОписание,Тело);
		Иначе 
			ВызватьИсключение "Код ответа: " + Результат.КодСостояния + "; " + Тело;
		КонецЕсли;
		
		ИнформацияДляВывода = "Полный ответ: " + Тело + Символы.ПС + "Дополнительно - " + ДопОписание;
		УровеньЖурнала 		= УровеньЖурналаРегистрации.Информация;
	Исключение
		ИнформацияДляВывода = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение			= "Во время запроса произошла ошибка. " + ИнформацияДляВывода;
		УровеньЖурнала 		= УровеньЖурналаРегистрации.Ошибка;
	КонецПопытки;
	
	ИнформацияДляВывода = "Задача:" + Объект.Номер + ";" + Объект.Дата + ". Метод: " + МетодВызова + Символы.ПС + ИнформацияДляВывода;
	
	ЗаписьЖурналаРегистрации("Интеграция с ФССП",УровеньЖурнала,,,ИнформацияДляВывода);
	ОбщегоНазначения.СообщитьПользователю(Сообщение); 	
	
КонецПроцедуры

Процедура ОпределитьРезультат(МетодВызова,ДанныеИзЗапроса,ДопОписание,Тело)
	
	Если МетодВызова = "/search/physical" Тогда
		Объект.Task = ДанныеИзЗапроса.response.task;
		ДопОписание = "Task: " + Объект.Task;
	ИначеЕсли МетодВызова = "/result" Тогда
		
		ЗарегистрироватьСобытие(Тело);		
		Элементы.СобытияПоЭтапу.Обновить();
	КонецЕсли;	
	
КонецПроцедуры


#Область ВПОМОГАТЕЛЬНЫЕ_МЕТОДЫ	
Процедура ЗарегистрироватьСобытие(Тело)
	ДокСобытие = Неопределено;
	ТипСобытия = Справочники.энргСпособСвязи.НайтиПоКоду("000000005");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСобытиеАбоненты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
		|ГДЕ
		|	энргСобытиеАбоненты.Абонент = &Абонент
		|	И энргСобытиеАбоненты.Основание = &Основание
		|	И энргСобытиеАбоненты.Ссылка.ТипСобытия = &ТипСобытия";
	
	Запрос.УстановитьПараметр("Абонент"		, Объект.Абонент);
	Запрос.УстановитьПараметр("Основание"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипСобытия"	, ТипСобытия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ДокСобытие = Документы.энргСобытие.СоздатьДокумент();
		ДокСобытие.Дата	 					= ТекущаяДата(); 		
		ДокСобытие.ТипСобытия	 			= ТипСобытия; 		
		ДокСобытие.ПланируемаяДатаОтправки 	= ДокСобытие.Дата;
		ДокСобытие.ТемаСобытия 				= "Интеграция с ФССП";
		ДокСобытие.Организация 				= Объект.Организация;
	иначе
		Выборка 					= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокСобытие 					= Выборка.Ссылка.ПолучитьОбъект();
		ДокСобытие.ПометкаУдаления 	= Ложь;
	КонецЕсли;
	
	ДокСобытие.ТекстШаблона = Тело;
	
	ТЧАбонентов = ДокСобытие.Абоненты;
	
	// Предварительный обход необходим, чтобы предыдущие записи не очистились из регистра. 
	Для Каждого ТекСтрока из ТЧАбонентов Цикл
		ТекСтрока.Успех 	= Истина;
	КонецЦикла;
	
	// Добавляем новый результат метода /result
	НоваяСтрока = ТЧАбонентов.Добавить();
	НоваяСтрока.Абонент 	= Объект.Абонент;
	НоваяСтрока.Основание 	= Объект.Ссылка;		
	НоваяСтрока.Результат 	= Тело;
	НоваяСтрока.Статус 		= "Выполнено";  	
	ДокСобытие.Записать();

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ТабличнаяЧастьНастройкаПени

&НаКлиенте
Процедура ТаблицаРасчётаПениПриИзменении(Элемент)
	ОбновитьТаблицуРасчёта();
	//Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасчётаПениПослеУдаления(Элемент)
	ОбновитьТаблицуРасчёта();
	//Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуРасчёта()
	
	//Перем ПослДо, СтрокаТЗ, МаксЗнач;
	//
	//// Заполнение колонки "до"
	//МаксЗнач = 9999;
	//Для каждого СтрокаТЗ Из Объект.ТаблицаРасчётаПени Цикл
	//	Если СтрокаТЗ.До = 0 Тогда
	//		СтрокаТЗ.До = МаксЗнач;
	//	КонецЕсли;
	//КонецЦикла;	
	//
	//Объект.ТаблицаРасчётаПени.Сортировать("До Возр");
	//
	//// Заполнение колонки "от"
	//ПослДо = 0;
	//Для каждого СтрокаТЗ Из Объект.ТаблицаРасчётаПени Цикл
	//	СтрокаТЗ.От = ПослДо+1;  
	//	Если СтрокаТЗ.До < МаксЗнач Тогда
	//		ПослДо = СтрокаТЗ.До;
	//	Иначе 
	//		СтрокаТЗ.До = 0;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СудебныеИнстанцииСудебыйУчастокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСудебныйУчасток()
	//СудебныйУчасток = КлючПомещения.Строение.СудебныйУчасток;
	//Возврат СудебныйУчасток;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура СудебныеИнстанцииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.СудебыйУчасток = ПолучитьСудебныйУчасток();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СудебныеИнстанцииСудНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.СудебныеИнстанции.ТекущиеДанные;
	
	СписокСУ = ПолучитьСписокСУ(ТекДанные.СудебыйУчасток);
	ОткрытьФорму("Справочник.энргСуды.ФормаВыбора", Новый Структура("СписокСУ", СписокСУ), Элемент);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокСУ(СудУчасток)
	
	СписокУслуг = Новый СписокЗначений;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	отэкСуды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргСуды.СтроенияИСудебныеУчастки КАК отэкСудыСтроенияИСудебныеУчастки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСуды КАК отэкСуды
	|		ПО отэкСудыСтроенияИСудебныеУчастки.Ссылка = отэкСуды.Ссылка
	|ГДЕ
	|	отэкСудыСтроенияИСудебныеУчастки.СудебныйУчасток = &СудебныйУчасток";
	
	Запрос.УстановитьПараметр("СудебныйУчасток", СудУчасток);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции


#КонецОбласти

#Область ТабличнаяЧастьНепогашенныеНачисления

&НаКлиенте
Процедура НепогашенныеНачисленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ 		 = Истина;
	СписокДолгов = Новый Массив;
	
	Для каждого СтрокаТЧ Из Объект.Задолженность Цикл
		СписокДолгов.Добавить(Новый Структура("ПериодНачисления, Услуга", СтрокаТЧ.ПериодНачисления, СтрокаТЧ.Услуга));
	КонецЦикла;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор");
	ЗаполнитьЗначенияСвойств(ПарамФормы, Объект);
	ПарамФормы.Вставить("Задача", Объект.Ссылка);
	ПарамФормы.Вставить("СписокЗадолженности", СписокДолгов);
	                                        
	ОписОпов = Новый ОписаниеОповещения("ОбработкаДобавленияЗадолженности", ЭтаФорма);
	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаДобавленияЗадолженности", ПарамФормы, ЭтаФорма,,,, ОписОпов);
КонецПроцедуры

&НаКлиенте
Процедура НепогашенныеНачисленияПослеУдаления(Элемент)
	Модифицированность = Истина;
	Объект.Задолженность.Очистить();
	
	ЗаполнитьТЧ_Задолженность(ДеревоЗадолженности);
КонецПроцедуры

#КонецОбласти

#Область ТабличнаяЧасть_ИсполнительныеДокументы

&НаКлиенте
Процедура ИсполнительныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПерваяЗапись = Не ЗначениеЗаполнено(Объект.ИсполнительныеДокументы);
	СтрокаТЧ	 = Объект.ИсполнительныеДокументы.Добавить();
	
	СтрокаТЧ.ИсполнительныйДокумент = ?(Объект.ВидСудопроизводства = ПредопределенноеЗначение("Перечисление.энргВидыСудопроизводства.ПриказноеПроизводство"),
					ПредопределенноеЗначение("Перечисление.энргСтатусыСудебногоАкта.СудебныйПриказ"),
					ПредопределенноеЗначение("Перечисление.энргСтатусыСудебногоАкта.ИсполнительныйЛист"));
					
	Если ПерваяЗапись Тогда
		СтрокаТЧ.Предъявлен = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "Контрагент");
		СтрокаТЧ.Долг		= Объект.СуммаЗадолженности;
		СтрокаТЧ.Пеня		= Объект.СуммаПени;
		СтрокаТЧ.Госпошлина	= Объект.СуммаГоспошлина;
		СтрокаТЧ.Прочие		= Объект.Прочие;
		
		ЗаполнитьСуммуИска();
		УстановитьДоступностьСуммИспол();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительныеДокументыПослеУдаления(Элемент)
	ЗаполнитьСуммуИска();
	УстановитьДоступностьСуммИспол();
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительныеДокументыСуммаПриИзменении(Элемент)
	ЗаполнитьСуммуИска();
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительныеДокументыИсполнительныйДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргСтатусыСудебногоАкта.СудебныйПриказ"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргСтатусыСудебногоАкта.ИсполнительныйЛист"));
КонецПроцедуры

&НаКлиенте
Процедура СобытияПоЭтапуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительныеДокументыПредъявленНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;           
	ДанныеВыбора.Добавить(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "Контрагент"));
	//
	//ДанныеВыбора = ПолучитьСписокЖильцовЛС(Объект.Абонент);
КонецПроцедуры

#КонецОбласти

#КонецЕсли