#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.свойство("Основание") Тогда
		СтандартнаяОбработка 	= Ложь;
		ВыбраннаяФорма = "ФормаДокументаИзменениеПараметраРассчета";
		Возврат;
	КонецЕсли;	
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗаполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;	
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПерерасчетНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПерерасчетНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПерерасчетНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		Иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестПерерасчетНП");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
//	КомандаОтчет 									= КомандыОтчетов.Добавить();	
//	КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
//	КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");
//	КомандаОтчет.Порядок      						= 50;
//	//КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
//	//КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
//	//КомандаОтчет.ФункциональныеОпции 				= "";	
//	КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
//	
//	КомандаОтчет 									= КомандыОтчетов.Добавить();	
//	КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
//	КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
//	КомандаОтчет.Порядок      						= 50;
//	//КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
////	КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
//	КомандаОтчет.ФункциональныеОпции 				= "";
//	КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	
	//ВариантыОтчетовБиллингПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	
КонецПроцедуры

// Заполняет список команд создания на основании ОперацииСЛС.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииОперацииСЛС(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииОперацииСЛС";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованииеОперацииСЛС";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании ОперацияСПриборомУчета.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииОперацияСПриборомУчета(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииОперацияСПриборомУчета";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииОперацияСПриборомУчета";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании ОперацияСУслугами.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииОперацияСУслугами(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииОперацияСУслугами";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииОперацияСУслугами";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьВидБлагоустройстваАбонента.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьВидБлагоустройстваАбонента(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьВидБлагоустройстваАбонента";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьВидБлагоустройстваАбонента";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьГруппуПотребителейАбонента.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьГруппуПотребителейАбонента(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьГруппуПотребителейАбонента";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьГруппуПотребителейАбонента";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьЗначениеПлощади.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьЗначениеПлощади(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьЗначениеПлощади";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьЗначениеПлощади";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьКоличествоКомнат.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьКоличествоКомнат(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьКоличествоКомнат";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьКоличествоКомнат";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьКоличествоПрописанных.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьКоличествоПрописанных(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьКоличествоПрописанных";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьКоличествоПрописанных";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьФормулуРасчетаТочекУчета.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьФормулуРасчетаТочекУчета(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьФормулуРасчетаТочекУчета";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьФормулуРасчетаТочекУчета";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании ОперацияСЛицевымСчетом.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииОперацияСЛицевымСчетом(КомандыСоздатьНаОсновании) Экспорт

	Если ПравоДоступа("Добавление", Метаданные.Документы.бестПерерасчетНП) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииОперацияСЛицевымСчетом";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииОперацияСЛицевымСчетом";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет НП'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли