#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	энргДатаПоследнегоИзменения	= ТекущаяДата();
	
	Если ПометкаУдаления Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Записывать  			= Истина;
			Набор.Очистить();			
		КонецЦикла;		
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	ГраницыОтчетногоПериода 			= энргНачисления.ГраницыОтчетногоПериода(Организация,Район,ПериодНачисления);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.Перерасчет_СвязанныйПерерасчет тогда
		//Если не ДополнительныеСвойства.Свойство("ПроведениеРазрешено") тогда
		//	Отказ = истина;
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ создается автоматически из меню ""Выполнение начислений""");
			Возврат;
	//	КонецЕсли;
	//иначе
	//	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения)
	КонецЕсли; 	
	
	Если ВидОперации = Перечисления.бестВидыОпераций.Перерасчет_РучнойПерерасчет И НЕ ПометкаУдаления Тогда
		Для Каждого СтрокаНабора Из Движения.бестОбъемНачисленийНП Цикл
			СтрокаНабора.Период 		= Дата;
			СтрокаНабора.Активность 	= Истина;
			СтрокаНабора.ПериодРасчета 	= ПериодНачисления;		
			СтрокаНабора.Район			= Район;
			СтрокаНабора.Организация 	= Организация;
			//СтрокаНабора.ВидНачисления 	= Перечисления.энргВидыНачислений.Перерасчет;
			СтрокаНабора.НачалоПериода  = НачалоМесяца(ПериодНачисления);
			СтрокаНабора.КонецПериода   = КонецМесяца(ПериодНачисления);						
		КонецЦикла;			
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли