#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
		
КонецПроцедуры

// Формирует протокол загруженных данных.
//
// Параметры:
//  Объект	-	ДанныеФормыСтруктура.
// 
// Возвращаемое значение:
//   ТабличныйДокумент.
//
Функция СформироватьПротоколЗагруженныхДанных(Объект) Экспорт 
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ЗагруженныеДанные");	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные			= Макет.ПолучитьОбласть("Данные");
	ОбластьШапкаОплаты	= Макет.ПолучитьОбласть("ШапкаОплаты");
	ОбластьДанныеОплаты	= Макет.ПолучитьОбласть("ДанныеПоОплате");
	
	ОбластьШапка.Параметры.Номер = Объект.Номер;
	ОбластьШапка.Параметры.Дата  = Объект.Дата;
	
	ТабДок.Вывести(ОбластьШапка);
	
	ТЗ_ТочкиУчета = Новый ТаблицаЗначений();
	ТЗ_ТочкиУчета.Колонки.Добавить("IDСтроки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТЗ_ТочкиУчета.Колонки.Добавить("Абонент", Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	ТЗ_ТочкиУчета.Колонки.Добавить("ПриборУчета", Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	ТЗ_ТочкиУчета.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ТЗ_ТочкиУчета.Колонки.Добавить("КлючПомещения", Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	
	Для Каждого  строка из Объект.ТОчкиУЧета цикл 
			ЗаполнитьЗначенияСвойств(ТЗ_ТочкиУчета.Добавить(),строка);
	КонецЦикла;

	ТЗ_Показания = Новый ТаблицаЗначений();
	ТЗ_Показания.Колонки.Добавить("IDСтроки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТЗ_Показания.Колонки.Добавить("ТекущиеПоказания", Новый ОписаниеТипов("Число"));	
	
	Для Каждого  строка из Объект.ПоказанияПриборовУчета цикл 
		ЗаполнитьЗначенияСвойств(ТЗ_Показания.Добавить(), строка);
	КонецЦикла;
	
	
	ТЗ_Шкала = Новый ТаблицаЗначений();
	ТЗ_Шкала.Колонки.Добавить("IDСтроки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТЗ_Шкала.Колонки.Добавить("IDСтрокиТочкиУчета", Новый ОписаниеТипов("УникальныйИдентификатор"));	
	ТЗ_Шкала.Колонки.Добавить("ТекущиеПоказания", Новый ОписаниеТипов("Число"));	
	Для Каждого  строка из Объект.ШкалыПриборовУчета цикл 
		ЗаполнитьЗначенияСвойств(ТЗ_Шкала.Добавить(),Строка);
	КонецЦикла;
	
	
	
	Запрос = Новый  Запрос; 
	Запрос.УстановитьПараметр("ТЗ_Шкала", ТЗ_Шкала);
	Запрос.УстановитьПараметр("ТЗ_Показания", ТЗ_Показания);
	Запрос.УстановитьПараметр("ТЗ_ТочкиУчета", ТЗ_ТочкиУчета);
	
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТЗ_ТочкиУчета.IDСтроки КАК IDСтроки,
	             |	ТЗ_ТочкиУчета.Услуга КАК Услуга,
	             |	ТЗ_ТочкиУчета.КлючПомещения КАК КлючПомещения,
	             |	ТЗ_ТочкиУчета.Абонент КАК Абонент,
	             |	ТЗ_ТочкиУчета.ПриборУчета КАК ПриборУчета
	             |ПОМЕСТИТЬ ВТ_ТУ
	             |ИЗ
	             |	&ТЗ_ТочкиУчета КАК ТЗ_ТочкиУчета
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ТЗ_шкала.IDСтроки КАК IDСтроки,
	             |	ТЗ_шкала.IDСтрокиТОчкиУчета КАК IDСтрокиТОчкиУчета,
	             |	ТЗ_шкала.ТекущиеПоказания КАК ТекущиеПоказания
	             |ПОМЕСТИТЬ ВТ_шкала
	             |ИЗ
	             |	&ТЗ_Шкала КАК ТЗ_шкала
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВложенныйЗапрос.Услуга КАК Услуга,
	             |	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	             |	ВложенныйЗапрос.Абонент КАК Абонент,
	             |	ВложенныйЗапрос.Абонент КАК ФИО,
	             |	энргКлючиПомещений.Строение КАК Строение,
	             |	энргКлючиПомещений.Помещение КАК Помещение,
	             |	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	             |	ВложенныйЗапрос.Абонент.ЛицевойСЧет КАК ЛицевойСЧет
	             |ИЗ
	             |	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ВТ_шкала.IDСтроки КАК IDСтроки,
	             |			ВТ_ТУ.Услуга КАК Услуга,
	             |			ВТ_ТУ.КлючПомещения КАК КлючПомещения,
	             |			ВТ_ТУ.Абонент КАК Абонент,
	             |			ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	             |			ВТ_шкала.ТекущиеПоказания КАК ТекущиеПоказания
	             |		ИЗ
	             |			ВТ_ТУ КАК ВТ_ТУ
	             |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_шкала КАК ВТ_шкала
	             |				ПО ВТ_ТУ.IDСтроки = ВТ_шкала.IDСтрокиТОчкиУчета) КАК ВложенныйЗапрос
	             |		ПО (ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка)";
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	
	Счетчик = 0;
	Сумма = 0;
	Пока Выборка.Следующий() Цикл 
		Счетчик = Счетчик + 1;
		ОбластьДанные.Параметры.Заполнить(Выборка);
		ОбластьДанные.Параметры.Счетчик = Счетчик;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	
	ТЗ_Оплата = Новый ТаблицаЗначений();
	ТЗ_Оплата.Колонки.Добавить("ПериодОплаты", Новый ОписаниеТипов("Дата"));
	ТЗ_Оплата.Колонки.Добавить("СуммаОплаты", Новый ОписаниеТипов("Число"));
	ТЗ_Оплата.Колонки.Добавить("ДатаПлатежногоДокумента", Новый ОписаниеТипов("Дата"));
	ТЗ_Оплата.Колонки.Добавить("НомерПлатежногоДокумента", Новый ОписаниеТипов("Строка"));
	
	ТЗ_Оплата.Колонки.Добавить("Абонент", Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	ТЗ_Оплата.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ТЗ_Оплата.Колонки.Добавить("КлючПомещения", Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	
	Для Каждого  строка из Объект.Оплата цикл 
			ЗаполнитьЗначенияСвойств(ТЗ_Оплата.Добавить(),строка);
	КонецЦикла;


	
	
	Запрос = Новый  Запрос; 
	Запрос.УстановитьПараметр("ТЗ_Оплата", ТЗ_Оплата);
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ВТ_Оплата.ПериодОплаты КАК ПериодОплаты,
	             |	ВТ_Оплата.СуммаОплаты КАК СуммаОплаты,
	             |	ВТ_Оплата.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
	             |	ВТ_Оплата.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	             |	ВТ_Оплата.Абонент КАК Абонент,
	             |	ВТ_Оплата.Услуга КАК Услуга,
	             |	ВТ_Оплата.КлючПомещения КАК КлючПомещения
	             |ПОМЕСТИТЬ ВТ_оплата
	             |ИЗ
	             |	&ТЗ_Оплата КАК ВТ_Оплата
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	энргКлючиПомещений.Строение КАК Строение,
	             |	энргКлючиПомещений.Помещение КАК Помещение,
	             |	ВТ_оплата.ПериодОплаты КАК Период,
	             |	ВТ_оплата.СуммаОплаты КАК Сумма,
	             |	ВТ_оплата.НомерПлатежногоДокумента КАК НомерПлатежа,
	             |	ВТ_оплата.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	             |	ВТ_оплата.Абонент КАК ФИО,
	             |	ВТ_оплата.Услуга КАК Услуга,
	             |	ВТ_оплата.Абонент.ЛицевойСЧет КАК ЛицевойСЧет
	             |ИЗ
	             |	ВТ_оплата КАК ВТ_оплата
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	             |		ПО ВТ_оплата.КлючПомещения = энргКлючиПомещений.Ссылка";
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();

	ТабДок.Вывести(ОбластьШапкаОплаты);
	
	СчетчикОплата = 0;
	Пока Выборка.Следующий() Цикл 
		СчетчикОплата = СчетчикОплата + 1;
		ОбластьДанныеОплаты.Параметры.Заполнить(Выборка);
		ОбластьДанныеОплаты.Параметры.Счетчик = СчетчикОплата;

	ТабДок.Вывести(ОбластьДанныеОплаты);
	КонецЦикла;
	
	Возврат  ТабДок;
	
КонецФункции

// Формирует протокол не загруженных данных.
//
// Параметры:
//  Объект										-	ДанныеФормыСтруктура.
//  НеЗагруженныеДанныеНеЗагруженаОплата		-	Булево.
//  НеЗагруженныеДанныеНеЗагруженныеПоказания	-	Булево.
//  ОтклоненныеПоказания						-	Булево.
// 
// Возвращаемое значение:
//   ТабличныйДокумент.
//
Функция СформироватьПротоколНеЗагруженныхДанных(Объект,НеЗагруженныеДанныеНеЗагруженаОплата=Неопределено, НеЗагруженныеДанныеНеЗагруженныеПоказания=Неопределено,ОтклоненныеПоказания=Неопределено) Экспорт 
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("НеЗагруженныеДанные");	
	ОбластьШапка			= Макет.ПолучитьОбласть("ШапкаДанные");
	ОбластьДанные			= Макет.ПолучитьОбласть("Данные");
	
	ОбластьШапка.Параметры.Номер = Объект.Номер;
	ОбластьШапка.Параметры.Дата  = Объект.Дата;
	
	ТабДок.Вывести(ОбластьШапка);
	
	
	ТЗ_незагруженныеДанные = Новый ТаблицаЗначений();
	ТЗ_незагруженныеДанные.Колонки.Добавить("ПериодОплаты", Новый ОписаниеТипов("Дата"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("СуммаОплаты", Новый ОписаниеТипов("Число"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ДатаПлатежногоДокумента", Новый ОписаниеТипов("Дата"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("НомерПлатежногоДокумента", Новый ОписаниеТипов("Строка"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ЛицевойСчет", Новый ОписаниеТипов("Строка"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ФИОПлательщика", Новый ОписаниеТипов("Строка"));

	ТЗ_незагруженныеДанные.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ТЗ_незагруженныеДанные.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка"));
	
	Для Каждого  строка из Объект.Оплата цикл 
			ЗаполнитьЗначенияСвойств(ТЗ_незагруженныеДанные.Добавить(),строка);
	КонецЦикла;
	
	
	
	Запрос = Новый  Запрос; 
	Запрос.УстановитьПараметр("ТЗ_незагруженныеДанные", ТЗ_незагруженныеДанные);
	
	Запрос.Текст="ВЫБРАТЬ
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ФИОПлательщика КАК ФИО,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ЛицевойСчет КАК ЛицевойСчет,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.НомерПлатежногоДокумента КАК НомерПлатежа,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.Услуга КАК Услуга,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.ПериодОплаты КАК Период,
	             |	энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные.СуммаОплаты КАК Сумма
	             |ПОМЕСТИТЬ ВТ_НезагруженныеДанные
	             |ИЗ
	             |	&ТЗ_незагруженныеДанные КАК энргПлатежноеПоручениеВходящиеНеЗагруженныеДанные
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_НезагруженныеДанные.ФИО КАК ФИО,
	             |	ВТ_НезагруженныеДанные.ЛицевойСчет КАК ЛицевойСчет,
	             |	ВТ_НезагруженныеДанные.НомерПлатежа КАК НомерПлатежа,
	             |	ВТ_НезагруженныеДанные.ДатаПлатежа КАК ДатаПлатежа,
	             |	ВТ_НезагруженныеДанные.Услуга КАК Услуга,
	             |	ВТ_НезагруженныеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	             |	ВТ_НезагруженныеДанные.Период КАК Период,
	             |	ВТ_НезагруженныеДанные.Сумма КАК Сумма
	             |ИЗ
	             |	ВТ_НезагруженныеДанные КАК ВТ_НезагруженныеДанные";
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	
	Счетчик = 0;
	Сумма = 0;
	Пока Выборка.Следующий() Цикл 
		Счетчик = Счетчик + 1;
		ОбластьДанные.Параметры.Заполнить(Выборка);
		ОбластьДанные.Параметры.Счетчик = Счетчик;
		ТабДок.Вывести(ОбластьДанные);

	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции

// Формирует реестр оплат.
//
// Параметры:
//  Объект	-	ДанныеФормыСтруктура.
// 
// Возвращаемое значение:
//   ТабличныйДокумент.
//
Функция СформироватьРеестрОплат(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящиеОплата.Абонент КАК Абонент,
	|	энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты КАК СуммаОплаты,
	|	энргПлатежноеПоручениеВходящиеОплата.ДатаПлатежногоДокумента КАК ДатаПлатежа,
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|	энргАбоненты.Наименование КАК Наименование,
	|	энргПлатежноеПоручениеВходящиеОплата.НомерСтроки КАК НомерПлатежа,
	|	энргАбоненты.КлючПомещения.Строение КАК Строение
	|ПОМЕСТИТЬ ВТ_Абоненты
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргПлатежноеПоручениеВходящиеОплата.Абонент = энргАбоненты.Ссылка
	|ГДЕ
	|	энргПлатежноеПоручениеВходящиеОплата.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Абоненты.Абонент КАК Абонент,
	|	ВТ_Абоненты.НомерПлатежа КАК НомерПлатежа,
	|	ВТ_Абоненты.ДатаПлатежа КАК ДатаПлатежа,
	|	СУММА(ВТ_Абоненты.СуммаОплаты) КАК Сумма,
	|	ВТ_Абоненты.ЛицевойСчет КАК ЛС,
	|	МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.Адрес, """")) КАК Адрес,
	|	ВТ_Абоненты.Наименование КАК ФИО
	|ИЗ
	|	ВТ_Абоненты КАК ВТ_Абоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			МАКСИМУМ(энргАбонентыКонтактнаяИнформация.Представление) КАК Адрес
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_Абоненты.Абонент КАК Абонент
	|			ИЗ
	|				ВТ_Абоненты КАК ВТ_Абоненты
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВТ_Абоненты.Абонент) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|				ПО (энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|					И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))
	|					И ВложенныйЗапрос.Абонент = энргАбонентыКонтактнаяИнформация.Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Абонент) КАК ВложенныйЗапрос
	|		ПО ВТ_Абоненты.Абонент = ВложенныйЗапрос.Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Абоненты.Абонент,
	|	ВТ_Абоненты.НомерПлатежа,
	|	ВТ_Абоненты.ДатаПлатежа,
	|	ВТ_Абоненты.ЛицевойСчет,
	|	ВТ_Абоненты.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПлатежа";
	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Макет = ПолучитьМакет("ПФ_MXL_Реестр");
	ТабДок 						= Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб 			= Истина;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;

	Шапка 		= Макет.ПолучитьОбласть("Шапка");
	Данные 		= Макет.ПолучитьОбласть("Данные");
	Подвал 		= Макет.ПолучитьОбласть("Подвал");
	
	Шапка.Параметры.Период		= ТекущаяДата();
	Шапка.Параметры.Дата		= Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	Шапка.Параметры.Источник	= СокрЛП(Объект.ИсточникПоступления);
	ТабДок.Вывести(Шапка);
	
	Пока Выборка.Следующий() Цикл
		Данные.Параметры.Заполнить(Выборка);
		Данные.Параметры.ЛС 	= СокрЛП(Выборка.ЛС);
		Данные.Параметры.ФИО 	= СокрЛП(Выборка.ФИО);
		Данные.Параметры.Адрес 	= СокрЛП(Выборка.Адрес);
		УстановитьЦветФона(Объект, Выборка, Данные);
		ТабДок.Вывести(Данные);
	КонецЦикла;
	
	Подвал.Параметры.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ТабДок.Вывести(Подвал);
	
	Возврат ТабДок;
	
КонецФункции

// Проверяет необходимо ли скорректировать связанные документы.
//
// Параметры:
//  ДокументОснование	-	ДокументСсылка.энргЗагрузкаДанныхИзВнешнихИсточников.
//  ЗависимыеРеквизиты	-	Структура.
// 
// Возвращаемое значение:
//   Булево.
//
Функция НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
		|	И энргПлатежноеПоручениеВходящие.Проведен
		|	И (НЕ энргПлатежноеПоручениеВходящие.Дата = &Дата
		|			ИЛИ энргПлатежноеПоручениеВходящие.Организация = &Организация
		|			ИЛИ энргПлатежноеПоручениеВходящие.Район = &Район
		|			ИЛИ энргПлатежноеПоручениеВходящие.АбонентскийОтдел = &АбонентскийОтдел
		|			ИЛИ энргПлатежноеПоручениеВходящие.ПериодНачисления = &ПериодНачисления
		|			ИЛИ энргПлатежноеПоручениеВходящие.ИсточникПоступления = &ИсточникПоступления
		|			ИЛИ энргПлатежноеПоручениеВходящие.ФайлДляЧтения = &ФайлДляЧтения)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.УстановитьПараметр("Дата", ЗависимыеРеквизиты.Дата);
	Запрос.УстановитьПараметр("Организация", ЗависимыеРеквизиты.Организация);
	Запрос.УстановитьПараметр("Район", ЗависимыеРеквизиты.Район);
	Запрос.УстановитьПараметр("АбонентскийОтдел", ЗависимыеРеквизиты.АбонентскийОтдел);
	Запрос.УстановитьПараметр("ПериодНачисления", ЗависимыеРеквизиты.ПериодНачисления);
	Запрос.УстановитьПараметр("ИсточникПоступления", ЗависимыеРеквизиты.ИсточникПоступления);
	Запрос.УстановитьПараметр("ФайлДляЧтения", ЗависимыеРеквизиты.ФайлДляЧтения);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Получает дату от связанных документов.
//
// Параметры:
//  ДокументОснование		-	ДокументСсылка.энргЗагрузкаДанныхИзВнешнихИсточников.
//  ТекущаяДатаДокумента	-	Дата.
// 
// Возвращаемое значение:
//   Дата.
//
Функция ПолучитьДатуОтСвязанныхДокументов(ДокументОснование, ТекущаяДатаДокумента) Экспорт 
	
	Результат = ТекущаяДатаДокумента;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргПлатежноеПоручениеВходящие.Дата КАК Дата
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
		|	И энргПлатежноеПоручениеВходящие.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.Дата;
	
	Возврат Результат;
	
КонецФункции

// Проверяет есть ли созданные оплаты от документа основания.
//
// Параметры:
//  ДокументОснование	-	ДокументСсылка.энргЗагрузкаДанныхИзВнешнихИсточников.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЕстьСозданныеОплатыОтДокументаОснования(ДокументОснование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргПлатежноеПоручениеВходящие.Дата КАК Дата
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
		|	И НЕ энргПлатежноеПоручениеВходящие.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = НЕ РезультатЗапроса.Пустой();
	
	Возврат Результат; 	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстЗапросаОплаты(ЕстьВТДокументыДляПроведения = Ложь) Экспорт 
	
	ТекстЗапроса  = ?(ЕстьВТДокументыДляПроведения,
	"",
	"ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящиеОплата.Абонент КАК Абонент,
	|	энргПлатежноеПоручениеВходящиеОплата.Ссылка КАК ДокРегистратор,
	|	энргПлатежноеПоручениеВходящие.ПериодНачисления КАК ПериодНачисления,
	|	энргПлатежноеПоручениеВходящие.ИсточникПоступления КАК ИсточникПоступления,
	|	энргПлатежноеПоручениеВходящие.Дата КАК ДатаРегистратора,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД
	|ПОМЕСТИТЬ ДокументыДляПроведения
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|		ПО энргПлатежноеПоручениеВходящиеОплата.Ссылка = энргПлатежноеПоручениеВходящие.Ссылка
	|			И (энргПлатежноеПоручениеВходящиеОплата.Ссылка = &Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
	|		ПО энргПлатежноеПоручениеВходящиеОплата.Абонент = энргАбоненты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса,
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.Ссылка,
	|	энргПлатежноеПоручениеВходящие.ПериодНачисления,
	|	энргПлатежноеПоручениеВходящие.ИсточникПоступления,
	|	энргПлатежноеПоручениеВходящие.Дата,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.ПереносСуммыОплаты КАК энргПлатежноеПоручениеВходящиеПереносСуммыОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|		ПО энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.Ссылка = энргПлатежноеПоручениеВходящие.Ссылка
	|			И (энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.Ссылка = &Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
	|		ПО энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса = энргАбоненты.Ссылка" + ";");
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Абонент КАК Абонент,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.ИсточникПоступления КАК ИсточникПоступления,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.МКД КАК МКД
	|ПОМЕСТИТЬ ВТ_ДокументыДляПроведения
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыДляПроведения.ДатаРегистратора,
	|	ДокументыДляПроведения.Абонент,
	|	ДокументыДляПроведения.ИсточникПоступления,
	|	ДокументыДляПроведения.ДокРегистратор,
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	энргПлатежноеПоручениеВходящиеОплата.НомерСтроки КАК НомерСтроки,
	|	энргПлатежноеПоручениеВходящиеОплата.Абонент КАК Абонент,
	|	энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты КАК СуммаОплаты,
	|	энргПлатежноеПоручениеВходящиеОплата.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.ИсточникПоступления КАК ИсточникПоступления,
	|	энргПлатежноеПоручениеВходящиеОплата.СуммаОстаток КАК СуммаОстаток,
	|	энргПлатежноеПоручениеВходящиеОплата.Авизо КАК Авизо,
	|	энргПлатежноеПоручениеВходящиеОплата.IDСтроки КАК IDСтроки,
	|	ДокументыДляПроведения.ДатаРегистратора КАК Дата,
	|	энргПлатежноеПоручениеВходящиеОплата.ПериодОплаты КАК ПериодОплаты
	|ПОМЕСТИТЬ ТЧ_Оплата
	|ИЗ
	|	ВТ_ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргПлатежноеПоручениеВходящиеОплата.Ссылка
	|			И ДокументыДляПроведения.Абонент = энргПлатежноеПоручениеВходящиеОплата.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	ДокументыДляПроведения.ДатаРегистратора КАК Дата,
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.НомерСтроки КАК НомерСтроки,
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса КАК АбонентПереноса,
	|	ДокументыДляПроведения.ИсточникПоступления КАК ИсточникПоступления,
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.СуммаПереноса КАК СуммаПереноса,
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.IDСтроки КАК IDСтроки,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодОплаты
	|ПОМЕСТИТЬ ТЧ_ПереносСуммыОплаты
	|ИЗ
	|	ВТ_ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.ПереносСуммыОплаты КАК энргПлатежноеПоручениеВходящиеПереносСуммыОплаты
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.Ссылка
	|			И ДокументыДляПроведения.Абонент = энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ_Оплата.ДокРегистратор КАК ДокРегистратор,
	|	ТЧ_Оплата.МКД КАК МКД,
	|	ТЧ_Оплата.СуммаОплаты КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ТЧ_Оплата.ДатаПлатежногоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТЧ_Оплата.ПериодНачисления
	|		ИНАЧЕ ТЧ_Оплата.ДатаПлатежногоДокумента
	|	КОНЕЦ КАК ДатаПлатежа,
	|	ТЧ_Оплата.ПериодНачисления КАК ПериодНачисления,
	|	ТЧ_Оплата.Абонент КАК Абонент,
	|	энргАбоненты.Организация КАК Организация,
	|	ТЧ_Оплата.Дата КАК Дата,
	|	энргАбоненты.Район КАК Район,
	|	ТЧ_Оплата.ИсточникПоступления КАК ИсточникПоступления,
	|	ТЧ_Оплата.СуммаОстаток КАК СуммаКРаспределению,
	|	ТЧ_Оплата.Авизо КАК СуммаАвизо,
	|	ТЧ_Оплата.НомерСтроки КАК НомерСтроки,
	|	ТЧ_Оплата.IDСтроки КАК IDСтроки,
	|	ТЧ_Оплата.ПериодОплаты КАК ПериодОплаты
	|ПОМЕСТИТЬ ТаблицаОплата
	|ИЗ
	|	ТЧ_Оплата КАК ТЧ_Оплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ТЧ_Оплата.Абонент = энргАбоненты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ_ПереносСуммыОплаты.ДокРегистратор КАК ДокРегистратор,
	|	ТЧ_ПереносСуммыОплаты.МКД КАК МКД,
	|	0 КАК СуммаПлатежа,
	|	ТЧ_ПереносСуммыОплаты.Дата КАК ДатаПлатежа,
	|	ТЧ_ПереносСуммыОплаты.ПериодНачисления КАК ПериодНачисления,
	|	ТЧ_ПереносСуммыОплаты.АбонентПереноса КАК Абонент,
	|	энргАбоненты.Организация КАК Организация,
	|	ТЧ_ПереносСуммыОплаты.Дата КАК Дата,
	|	энргАбоненты.Район КАК Район,
	|	ТЧ_ПереносСуммыОплаты.ИсточникПоступления КАК ИсточникПоступления,
	|	ТЧ_ПереносСуммыОплаты.СуммаПереноса КАК СуммаКРаспределению,
	|	0 КАК СуммаАвизо,
	|	ТЧ_ПереносСуммыОплаты.НомерСтроки КАК НомерСтроки,
	|	ТЧ_ПереносСуммыОплаты.ПериодОплаты КАК ПериодОплаты
	|ПОМЕСТИТЬ ТаблицаПереносаОплаты
	|ИЗ
	|	ТЧ_ПереносСуммыОплаты КАК ТЧ_ПереносСуммыОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ТЧ_ПереносСуммыОплаты.АбонентПереноса = энргАбоненты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплата.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаОплата.Абонент КАК Абонент,
	|	МАКСИМУМ(ТаблицаОплата.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ МаксимальныйНомерСтроки
	|ИЗ
	|	ТаблицаОплата КАК ТаблицаОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПереносаОплаты КАК ТаблицаПереносаОплаты
	|		ПО ТаблицаОплата.Абонент = ТаблицаПереносаОплаты.Абонент
	|			И ТаблицаОплата.ДокРегистратор = ТаблицаПереносаОплаты.ДокРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОплата.Абонент,
	|	ТаблицаОплата.ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПереносаОплаты.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаПереносаОплаты.МКД КАК МКД,
	|	ТаблицаПереносаОплаты.СуммаПлатежа КАК СуммаПлатежа,
	|	ТаблицаПереносаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ТаблицаПереносаОплаты.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПереносаОплаты.Абонент КАК Абонент,
	|	ТаблицаПереносаОплаты.Организация КАК Организация,
	|	ТаблицаПереносаОплаты.Дата КАК Дата,
	|	ТаблицаПереносаОплаты.Район КАК Район,
	|	ТаблицаПереносаОплаты.ИсточникПоступления КАК ИсточникПоступления,
	|	ТаблицаПереносаОплаты.СуммаКРаспределению КАК СуммаКРаспределению,
	|	ТаблицаПереносаОплаты.СуммаАвизо КАК СуммаАвизо,
	|	ТаблицаПереносаОплаты.НомерСтроки + ЕСТЬNULL(МаксимальныйНомерСтроки.НомерСтроки, 0) КАК НомерСтроки,
	|	ТаблицаПереносаОплаты.ПериодОплаты КАК ПериодОплаты
	|ПОМЕСТИТЬ МаксимальныйНомерСтрокиАбонентаВТаблицеОплата
	|ИЗ
	|	ТаблицаПереносаОплаты КАК ТаблицаПереносаОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныйНомерСтроки КАК МаксимальныйНомерСтроки
	|		ПО ТаблицаПереносаОплаты.Абонент = МаксимальныйНомерСтроки.Абонент
	|			И ТаблицаПереносаОплаты.ДокРегистратор = МаксимальныйНомерСтроки.ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплата.СуммаПлатежа КАК СуммаПлатежа,
	|	ТаблицаОплата.ДатаПлатежа КАК ДатаПлатежа,
	|	ТаблицаОплата.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОплата.Абонент КАК Абонент,
	|	ТаблицаОплата.Организация КАК Организация,
	|	ТаблицаОплата.Дата КАК Дата,
	|	ТаблицаОплата.Район КАК Район,
	|	ТаблицаОплата.ИсточникПоступления КАК ИсточникПоступления,
	|	ТаблицаОплата.СуммаКРаспределению КАК СуммаКРаспределению,
	|	ТаблицаОплата.СуммаАвизо КАК СуммаАвизо,
	|	ТаблицаОплата.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОплата.IDСтроки КАК IDСтроки,
	|	ТаблицаОплата.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаОплата.МКД КАК МКД,
	|	ТаблицаОплата.ПериодОплаты КАК ПериодОплаты
	|ПОМЕСТИТЬ ОбщаяТаблицаОплатПоДокументу
	|ИЗ
	|	ТаблицаОплата КАК ТаблицаОплата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.СуммаПлатежа,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.ДатаПлатежа,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.ПериодНачисления,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.Абонент,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.Организация,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.Дата,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.Район,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.ИсточникПоступления,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.СуммаКРаспределению,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.СуммаАвизо,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.НомерСтроки,
	|	NULL,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.ДокРегистратор,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.МКД,
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата.ПериодОплаты
	|ИЗ
	|	МаксимальныйНомерСтрокиАбонентаВТаблицеОплата КАК МаксимальныйНомерСтрокиАбонентаВТаблицеОплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОплатаЛевая.СуммаПлатежа КАК СуммаПлатежа,
	|	ТаблицаОплатаЛевая.ДатаПлатежа КАК ДатаПлатежа,
	|	ТаблицаОплатаЛевая.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОплатаЛевая.Абонент КАК Абонент,
	|	ТаблицаОплатаЛевая.Организация КАК Организация,
	|	ТаблицаОплатаЛевая.Дата КАК Дата,
	|	ТаблицаОплатаЛевая.Район КАК Район,
	|	ТаблицаОплатаЛевая.ИсточникПоступления КАК ИсточникПоступления,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаОплатаЛевая.НомерСтроки = ТаблицаОплатаПравая.НомерСтроки
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Разделитель,
	|	ТаблицаОплатаЛевая.СуммаКРаспределению КАК СуммаКРаспределению,
	|	ТаблицаОплатаЛевая.СуммаАвизо КАК СуммаАвизо,
	|	ТаблицаОплатаЛевая.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОплатаЛевая.IDСтроки КАК IDСтроки,
	|	ТаблицаОплатаЛевая.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаОплатаЛевая.МКД КАК МКД,
	|	ТаблицаОплатаЛевая.ПериодОплаты КАК ПериодОплаты
	|ПОМЕСТИТЬ ВТ_ВсяОплатаПП
	|ИЗ
	|	ОбщаяТаблицаОплатПоДокументу КАК ТаблицаОплатаЛевая
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбщаяТаблицаОплатПоДокументу КАК ТаблицаОплатаПравая
	|		ПО ТаблицаОплатаЛевая.Абонент = ТаблицаОплатаПравая.Абонент
	|			И ТаблицаОплатаЛевая.НомерСтроки >= ТаблицаОплатаПравая.НомерСтроки
	|			И ТаблицаОплатаЛевая.ДокРегистратор = ТаблицаОплатаПравая.ДокРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОплатаЛевая.ИсточникПоступления,
	|	ТаблицаОплатаЛевая.ДатаПлатежа,
	|	ТаблицаОплатаЛевая.ПериодНачисления,
	|	ТаблицаОплатаЛевая.Абонент,
	|	ТаблицаОплатаЛевая.Организация,
	|	ТаблицаОплатаЛевая.Дата,
	|	ТаблицаОплатаЛевая.Район,
	|	ТаблицаОплатаЛевая.СуммаПлатежа,
	|	ТаблицаОплатаЛевая.СуммаКРаспределению,
	|	ТаблицаОплатаЛевая.СуммаАвизо,
	|	ТаблицаОплатаЛевая.НомерСтроки,
	|	ТаблицаОплатаЛевая.IDСтроки,
	|	ТаблицаОплатаЛевая.ДокРегистратор,
	|	ТаблицаОплатаЛевая.МКД,
	|	ТаблицаОплатаЛевая.ПериодОплаты";

	Возврат ТекстЗапроса;
КонецФункции

Процедура УстановитьЗависимыеРеквизитыОтДокументаОснования(ДокументОснование, ЗависимыеРеквизиты, Контекст = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли; 
	
	ДлительныеОперации.СообщитьПрогресс(1, "Корректировка документов оплат");
		
	ЗависимыеПоляПерезаписиПоУмолчанию = "Дата,Организация,Район,АбонентскийОтдел,ПериодНачисления,ИсточникПоступления,ФайлДляЧтения";
	ЗависимыеПоляПерезаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст, "ЗависимыеПоляПерезаписи", ЗависимыеПоляПерезаписиПоУмолчанию);
	
	ПовторноеПроведение = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка,
	|	энргПлатежноеПоручениеВходящие.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|ГДЕ
	|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
	|	И энргПлатежноеПоручениеВходящие.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Скорректировано документов оплат " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли;
		
		УстановитьЗависимыеРеквизиты(Выборка.Ссылка, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи, ПовторноеПроведение);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторноеПроведение Цикл 
		УстановитьЗависимыеРеквизиты(ДокументСсылка, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи, ПовторноеПроведение)
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиДокументыПоДокументуОснованию(ДокументОснование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ПовторноеПроведение = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка,
	|	энргПлатежноеПоручениеВходящие.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|ГДЕ
	|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
	|	И НЕ энргПлатежноеПоручениеВходящие.Проведен
	|	И НЕ энргПлатежноеПоручениеВходящие.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Проведено " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли;
		
		ПровестиДокумент(Выборка.Ссылка, ПовторноеПроведение);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторноеПроведение Цикл 
		ПровестиДокумент(ДокументСсылка);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОтменитьПроведениеДокументовПоДокументуОснованию(ДокументОснование) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ПовторнаяОтмена = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка,
		|	энргПлатежноеПоручениеВходящие.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
		|	И энргПлатежноеПоручениеВходящие.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Отменено " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли; 		
		
		ОтменитьПроведениеДокумента(Выборка.Ссылка, ПовторнаяОтмена);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
				
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторнаяОтмена Цикл 
		ОтменитьПроведениеДокумента(ДокументСсылка);
	КонецЦикла; 	
	
КонецПроцедуры

Процедура ПометкаНаУдалениеДокументовПоДокументуОснованию(ДокументОснование) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ПовторнаяОтмена = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка,
		|	энргПлатежноеПоручениеВходящие.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Помечено на удаление " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли; 		
		
		ПометкаНаУдалениеДокумента(Выборка.Ссылка, ПовторнаяОтмена);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
				
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторнаяОтмена Цикл 
		ПометкаНаУдалениеДокумента(ДокументСсылка);
	КонецЦикла; 	
	
КонецПроцедуры

Процедура УстановитьПометкуУдаленияПоДокументуОснованию(ДокументОснование, ПризнакПометки = Истина) Экспорт 

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(1, "Отмена документов оплат");
	
	ПовторнаяОтмена = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка,
		|	энргПлатежноеПоручениеВходящие.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
		|ГДЕ
		|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
		|	И НЕ энргПлатежноеПоручениеВходящие.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Отменено документов оплат " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли; 		
		
		УстановитьПометкуУдаленияПоказаний(Выборка.Ссылка, ПовторнаяОтмена, ПризнакПометки);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
				
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторнаяОтмена Цикл 
		УстановитьПометкуУдаленияПоказаний(ДокументСсылка,, ПризнакПометки);
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЦветФона(Объект, Выборка, Данные)
	// Переопределена в расширении
КонецПроцедуры

Процедура УстановитьЗависимыеРеквизиты(ДокументСсылка, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи, ПовторнаяЗапись = Неопределено)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменитьПроверкуДокументовРегистрацииПоказаний", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("ПроведениеПлатежногоРазрешено", Истина);
		ЗаполнитьЗначенияСвойств(ДокОбъект, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
			Возврат;
		КонецЕсли;
		
		Инфо = ИнформацияОбОшибке();
		Комментарий = ПодробноеПредставлениеОшибки(Инфо);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Смена зависимых реквизитов оплат'"),
			УровеньЖурналаРегистрации.Ошибка,,
			ДокументСсылка,
			Комментарий);
			
		ОбщегоНазначения.СообщитьПользователю("Ошибка по документу: " + ДокументСсылка);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПровестиДокумент(ДокументСсылка, ПовторнаяЗапись = Неопределено)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменитьПроверкуДокументовРегистрацииПоказаний", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("ПроведениеПлатежногоРазрешено", Истина);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
			Возврат;
		КонецЕсли;
		
		Инфо = ИнформацияОбОшибке();
		Комментарий = ПодробноеПредставлениеОшибки(Инфо);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Проведение документов оплат'"),
			УровеньЖурналаРегистрации.Ошибка,,
			ДокументСсылка,
			Комментарий);
			
		ОбщегоНазначения.СообщитьПользователю("Ошибка по документу: " + ДокументСсылка);
		
	КонецПопытки;
	
КонецПроцедуры


Процедура ОтменитьПроведениеДокумента(ДокументСсылка, ПовторнаяЗапись = Неопределено)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменитьПроверкуДокументовРегистрацииПоказаний", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменаПлатежногоРазрешена", Истина);
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
			Возврат;
		КонецЕсли;
		
		Инфо = ИнформацияОбОшибке();
		Комментарий = ПодробноеПредставлениеОшибки(Инфо);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Отмена проведения документов оплат'"),
			УровеньЖурналаРегистрации.Ошибка,,
			ДокументСсылка,
			Комментарий);
			
		ОбщегоНазначения.СообщитьПользователю("Ошибка по документу: " + ДокументСсылка);
		
	КонецПопытки; 	
	
КонецПроцедуры

Процедура ПометкаНаУдалениеДокумента(ДокументСсылка, ПовторнаяЗапись = Неопределено)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменитьПроверкуДокументовРегистрацииПоказаний", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменаПлатежногоРазрешена", Истина);
		ДокОбъект.ПометкаУдаления = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
			Возврат;
		КонецЕсли;
		
		Инфо = ИнформацияОбОшибке();
		Комментарий = ПодробноеПредставлениеОшибки(Инфо);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Пометка на удаление документов оплат'"),
			УровеньЖурналаРегистрации.Ошибка,,
			ДокументСсылка,
			Комментарий);
			
		ОбщегоНазначения.СообщитьПользователю("Ошибка по документу: " + ДокументСсылка);
		
	КонецПопытки; 	
	
КонецПроцедуры

Процедура УстановитьПометкуУдаленияПоказаний(ДокументСсылка, ПовторнаяЗапись = Неопределено, ПризнакПометки = Истина)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменитьПроверкуДокументовРегистрацииПоказаний", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтменаПлатежногоРазрешена", Истина);
		ДокОбъект.УстановитьПометкуУдаления(ПризнакПометки);		
			
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
			Возврат;
		КонецЕсли;
		
		Инфо = ИнформацияОбОшибке();
		Комментарий = ПодробноеПредставлениеОшибки(Инфо);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Установка пометки удаления документов оплат'"),
			УровеньЖурналаРегистрации.Ошибка,,
			ДокументСсылка,
			Комментарий);
			
		ОбщегоНазначения.СообщитьПользователю("Ошибка по документу: " + ДокументСсылка);
		
	КонецПопытки; 	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли