#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПостоянныйРасходТУ

&НаКлиенте
Процедура ПостоянныйРасходТУТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные 			= Элементы.ПостоянныйРасходТУ.ТекущиеДанные;	
	СтандартнаяОбработка 	= Ложь;
		
	ВыборУслугиИТочкиУчета(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
    	ТекущиеДанные.IDСтроки = Новый УникальныйИдентификатор;
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПостоянныйРасходОбъемы, 
			Неопределено, ТекущиеДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУПриАктивизацииСтроки(Элемент)    
	ТекущиеДанные = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПостоянныйРасходОбъемы, 
		Неопределено, ТекущиеДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУПередУдалением(Элемент, Отказ) 
	ТекущиеДанные = Элементы.ПостоянныйРасходТУ.ТекущиеДанные;
	ТаблицыФормы	= Новый Массив;
	
	ТаблицыФормы.Добавить("ПостоянныйРасходОбъемы");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйРасходТУТарифнаяЗонаПриИзменении(Элемент) 
	ЗаполнитьТЧОбъемовКлиент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПостоянныйРасходОбъемы

&НаКлиенте
Процедура ПостоянныйРасходОбъемыПередУдалением(Элемент, Отказ)
	  Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные)
	СтруктураОтбора = Новый Структура("Период, Организация, Район, ОбъектРасчета", Объект.Дата);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора", СтруктураОтбора);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора", ЭтаФорма, 
		Новый Структура("СтруктураОтбора, ТекДанные", СтруктураОтбора, ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета", ПараметрыВыбораФормы,,,,, 
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧОбъемовКлиент()
	ТекущиеДанные 			= Элементы.ПостоянныйРасходТУ.ТекущиеДанные;  
	СтруктураСтроки = Новый Структура("Организация, Район, ОбъектРасчета, IDСтроки, ТочкаУчета, Услуга, ТарифнаяЗона");
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, Объект); 
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные);
	СтруктураСтроки.Вставить("Период", Объект.Дата);
	ЗаполнитьТЧОбъемов(СтруктураСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПостоянныйРасходОбъемы, 
		Неопределено, ТекущиеДанные.IDСтроки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧОбъемов(СтруктураСтроки) 
	Если Не (ЗначениеЗаполнено(СтруктураСтроки.ТочкаУчета) 
		Или ЗначениеЗаполнено(СтруктураСтроки.Услуга)
		Или ЗначениеЗаполнено(СтруктураСтроки.ТарифнаяЗона)) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.бестОбъемыПостоянногоРасхода.ПолучитьОбъемыПостоянногоРасхода(СтруктураСтроки);
	
	Если РезультатЗапроса.Пустой() Тогда
		Месяц = 1;
		Пока Месяц <= 12 Цикл
			НоваяСтрока 			= Объект.ПостоянныйРасходОбъемы.Добавить();
			НоваяСтрока.Месяц 		= Месяц;
			НоваяСтрока.IDСтроки 	= СтруктураСтроки.IDСтроки;
			Месяц = Месяц + 1;
		КонецЦикла; 
		
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока 			= Объект.ПостоянныйРасходОбъемы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка,, "Объем"); 
			НоваяСтрока.IDСтроки = СтруктураСтроки.IDСтроки;
			НоваяСтрока.ОбъемБыл = Выборка.Объем;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		ТекДанные		= ДополнительныеПараметры.ТекДанные;		
		ЗаполнитьЗначенияСвойств(ТекДанные, РезультатЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти