#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	для Каждого СтрокаТЧ из ТочкиУчета цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ПриборУчета) и Не ЗначениеЗаполнено(СтрокаТЧ.ВидДифференцированности) тогда
			Отказ 		= истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле Вид дифференцированности",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ВидДифференцированности");
		КонецЕсли; 			
	КонецЦикла; 	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	МВТ  													= ЗаполнитьМВТ();		
		
	РезультатПоказанияПУ									= РезультатПоказанияПУ(Ссылка);
	ТаблицаВидБлагоустройств								= ПолучитьТаблицуВидыБлагоустройств(Ссылка);
	ТаблицаОтключаемых										= ПолучитьТаблицуОтключаемыхВНеполивнойСезон(Ссылка);	
	
	ЗаписатьВСостояниеЛС(МВТ);	
	ВладельцыУслугиАктивностьПриборыТочекУчета(МВТ);
	ЗначениеПлощадей();		
	
	ЗаписатьВПоказанияПУ(РезультатПоказанияПУ);
	Взаиморасчеты();
	ЗаписатьВВидыБлагоустройств(ТаблицаВидБлагоустройств);	
	ЗаписьВРСОтлоложенныеДвиженияДокументов();
	ЗаписьВРСэнргАбонентыОтключаемыеВНеполивнойСезон(ТаблицаОтключаемых);	
	УстановитьФормулыТочекУчета();
	УстановитьПоставщиков();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьФормулыТочекУчета()
	
	НаборРасчетныеСпособы  				= Движения.энргРасчетныеСпособыТочекУчета;
	НаборФормулы  						= Движения.энргФормулыРасчетаТочекУчета;
	
	Результат  							= РезультатФормулыРасчета();
	ВыборкаАбонент  					= Результат.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАбонент.следующий() цикл
		
		ВыборкаРасчитываемаяТУ 			= ВыборкаАбонент.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРасчитываемаяТУ.следующий() цикл
			
			Запись  					= НаборРасчетныеСпособы.Добавить();
			Запись.Период 				= Дата;
			Запись.Район 				= Район;
			Запись.Организация 			= Организация;

			Запись.Абонент 				= ВыборкаАбонент.Абонент;
			Запись.ТочкаУчета 			= ВыборкаРасчитываемаяТУ.РассчитываемаяТочка;
			Запись.РасчетныйСпособ 		= Истина;
			Запись.ПериодРегистрации	= Дата;
			Запись.ПериодНачисления 	= КонецМесяца(Дата) + 1;
			
			Детальная 					= ВыборкаРасчитываемаяТУ.выбрать();
			Пока Детальная.следующий() цикл
				  ЗаполнитьЗначенияСвойств(НаборФормулы.Добавить(),Детальная);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписьВРСОтлоложенныеДвиженияДокументов()
	НаборЗаписей 					= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборЗаписей.Записать();
	    
	НоваяЗапись 					= НаборЗаписей.Добавить();

	НоваяЗапись.ПериодНачисления 	= КонецМесяца(Дата)+1;//НачалоМесяца(НачалоМесяца(Дата)-1);
	НоваяЗапись.Район 				= Район;
	НоваяЗапись.Организация 		= Организация;
	НоваяЗапись.РазделЗаписи 		= Перечисления.энргРазделыЗаписи.СтабильныеПериоды;
	НоваяЗапись.ДокРегистратор 		= Ссылка;
	НоваяЗапись.ДатаРегистратора 	= Дата;

	НаборЗаписей.Записать(ложь);
КонецПроцедуры

Процедура ЗначениеПлощадей()
	Для Каждого стр из ЗначениеПлощадей цикл
		Запись						= Движения.энргЗначенияПлощадей.Добавить();
		Запись.Период 				= Дата;
		Запись.Район 				= стр.Абонент.Район;
		Запись.Организация 			= стр.Абонент.Организация;
		Запись.Абонент 				= стр.Абонент;
		Запись.ВидПлощади 			= Стр.ВидПлощади;
		Запись.Площадь 				= стр.ЗначениеПлощади;
		Запись.ПериодНачисления 	= КонецМесяца(Дата) + 1;
		Запись.ПериодРегистрации 	= Дата; 		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьВСостояниеЛС(МВТ)
	Запрос  = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеТочекУчета.Ссылка,
	|	ДанныеТочекУчета.Район,
	|	ДанныеТочекУчета.Организация,
	|	ДанныеТочекУчета.Абонент,
	|	ДанныеТочекУчета.ДатаОткрытияЛС КАК Период
	|ИЗ
	|	ДанныеТочекУчета КАК ДанныеТочекУчета"; 	
	Результат  						= Запрос.Выполнить();
	Выборка 							= Результат.Выбрать();
	Набор								= Движения.энргСостояниеЛС;
	НаборГруппаПотребителей  			= Движения.энргГруппыПотребителейАбонентов;
	пока Выборка.Следующий() цикл  	
		НовСтрока						= Набор.Добавить();
		НовСтрока.Период				= Выборка.Период;
		НовСтрока.Район					= Выборка.Район;
		НовСтрока.Организация			= Выборка.Организация;
		НовСтрока.Абонент				= Выборка.Абонент;
		НовСтрока.Состояние				= Истина;
		НовСтрока.ПериодНачисления 		= КонецМесяца(Дата) + 1;
		НовСтрока.ПериодРегистрации 	= Дата;
		
		НовСтрока						= НаборГруппаПотребителей.Добавить();
		НовСтрока.Период				= Выборка.Период;
		НовСтрока.Район					= Выборка.Район;
		НовСтрока.Организация			= Выборка.Организация;
		НовСтрока.Абонент				= Выборка.Абонент;
		НовСтрока.ГруппаПотребителей	= ГруппаПотребителей;
		НовСтрока.ПериодНачисления 		= КонецМесяца(Дата) + 1;
		НовСтрока.ПериодРегистрации 	= Дата;
	КонецЦикла;
КонецПроцедуры

Процедура ВладельцыУслугиАктивностьПриборыТочекУчета(МВТ)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст ="ВЫБРАТЬ
	|	ДанныеТочекУчета.Дата КАК Период,
	|	ДанныеТочекУчета.Район,
	|	ДанныеТочекУчета.Организация,
	|	ДанныеТочекУчета.МКД,
	|	ДанныеТочекУчета.Абонент,
	|	ДанныеТочекУчета.ТочкаУчета,
	|	ДанныеТочекУчета.ПриборУчета,
	|	ДанныеТочекУчета.ДатаПодключенияПУ,
	|	ДанныеТочекУчета.ДатаПоверки,
	|	ДанныеТочекУчета.Услуга,
	|	ДанныеТочекУчета.Головная,
	|	ДанныеТочекУчета.ДатаОткрытияЛС,
	|	ДанныеТочекУчета.КоэффициентПУ,
	|	ДанныеТочекУчета.ВидДифференцированности
	|ИЗ
	|	ДанныеТочекУчета КАК ДанныеТочекУчета
	|ГДЕ
	|	НЕ ДанныеТочекУчета.ТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)";
	Результат  									= Запрос.Выполнить();
	Выборка  									= Результат.Выбрать();
	
	НаборУслуги									= Движения.энргУслугиТочекУчета;
	НаборВладельцы								= Движения.энргВладельцыТочекУчета;
	НаборАктивностьТУ 							= Движения.энргАктивностьТочекУчета;
	НаборПриборыТочек							= Движения.энргПриборыТочекУчета;
	НаборСостояниеПУ 							= Движения.энргСостояниеПриборовУчетаАбонента;
	НаборКоэффициентыПУ 						= Движения.энргКоэффциентыПриборовУчета;
	НаборДатПоверки  							= Движения.энргДатыПоверкиПрибораУчета;
	НаборВидыДифференцированности				= Движения.энргВидыДифференцированностиПриборовУчета;
		
	ТочкаПодключена 							= Перечисления.энргСостояниеТочекУчета.Включена;
	ПриборВведен  								= Перечисления.энргСостояниеПриборовУчета.Ввод;
	
	Пока Выборка.Следующий() цикл
		НовСтрока								= НаборУслуги.Добавить();		
		НовСтрока.Период						= Выборка.Период;
		НовСтрока.Район							= Выборка.Район;
		НовСтрока.Организация					= Выборка.Организация;
		НовСтрока.Абонент						= Выборка.Абонент;
		НовСтрока.ТочкаУчета					= Выборка.ТочкаУчета;
		НовСтрока.Услуга						= Выборка.Услуга;
		НовСтрока.ПериодРегистрации				= Дата;
		НовСтрока.ПериодНачисления 				= КонецМесяца(Дата) + 1;
		
		НовСтрока								= НаборВладельцы.Добавить();
		НовСтрока.Период						= Выборка.Период;
		НовСтрока.Район							= Выборка.район;
		НовСтрока.Организация					= Выборка.Организация;
		НовСтрока.АбонентВладелец				= Выборка.Абонент;
		НовСтрока.ТочкаУчета					= Выборка.ТочкаУчета;
		НовСтрока.ПериодРегистрации				= Дата;
		НовСтрока.ПериодНачисления 				= КонецМесяца(Дата) + 1;
		
		НовСтрока								= НаборАктивностьТУ.Добавить();
		НовСтрока.Период						= Выборка.Период;
		НовСтрока.Абонент						= Выборка.Абонент;
		НовСтрока.Район							= Выборка.Район;
		НовСтрока.Организация					= Выборка.Организация;
		НовСтрока.Состояние 					= ТочкаПодключена;
		НовСтрока.ТочкаУчета 					= Выборка.ТочкаУчета;
		НовСтрока.ПериодРегистрации				= Дата;
		НовСтрока.ПериодНачисления 				= КонецМесяца(Дата) + 1;  	
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) тогда
			НовСтрока							= НаборПриборыТочек.Добавить();
			НовСтрока.Период					= ?(ЗначениеЗаполнено(Выборка.ДатаПодключенияПУ),Выборка.ДатаПодключенияПУ, Дата);
			НовСтрока.Район						= Выборка.Район;
			НовСтрока.Организация				= Выборка.Организация;
			НовСтрока.Абонент					= Выборка.Абонент;
			НовСтрока.ТочкаУчета				= Выборка.ТочкаУчета;
			НовСтрока.ПриборУчета				= Выборка.ПриборУчета;
			НовСтрока.ПериодРегистрации			= Дата;
			НовСтрока.ПериодНачисления 			= КонецМесяца(Дата) + 1;
			
			НовСтрока							= НаборСостояниеПУ.Добавить();
			НовСтрока.Период					= ?(ЗначениеЗаполнено(Выборка.ДатаПодключенияПУ),Выборка.ДатаПодключенияПУ, Дата);
			НовСтрока.Район						= Выборка.Район;
			НовСтрока.Организация				= Выборка.Организация;
			НовСтрока.Абонент					= Выборка.Абонент;
			НовСтрока.ТочкаУчета				= Выборка.ТочкаУчета;
			НовСтрока.ПриборУчета				= Выборка.ПриборУчета;
			НовСтрока.Состояние 				= ПриборВведен; 
			НовСтрока.ПериодРегистрации			= Дата;
			НовСтрока.ПериодНачисления 			= КонецМесяца(Дата) + 1;
		
			НовСтрока 							= НаборКоэффициентыПУ.Добавить();
			НовСтрока.Период 					= ?(ЗначениеЗаполнено(Выборка.ДатаПодключенияПУ),Выборка.ДатаПодключенияПУ, Дата);
			НовСтрока.ПриборУчета				= Выборка.ПриборУчета;
			НовСтрока.Абонент 					= Выборка.абонент;
			НовСтрока.Район 					= Выборка.Район;
			НовСтрока.Организация				= Выборка.Организация;
			НовСтрока.Коэффициент				= Выборка.КоэффициентПУ;
			НовСтрока.ПериодРегистрации			= Дата;
			НовСтрока.ПериодНачисления 			= КонецМесяца(Дата) + 1;
			
			НовСтрока 							= НаборВидыДифференцированности.Добавить();
			НовСтрока.Период 					= ?(ЗначениеЗаполнено(Выборка.ДатаПодключенияПУ),Выборка.ДатаПодключенияПУ, Дата);
			НовСтрока.ПриборУчета				= Выборка.ПриборУчета;
			НовСтрока.Абонент 					= Выборка.абонент;
			НовСтрока.Район 					= Выборка.Район;
			НовСтрока.Организация				= Выборка.Организация;
			НовСтрока.ВидДифференцированности	= Выборка.ВидДифференцированности;
			НовСтрока.ПериодРегистрации			= Дата;
			НовСтрока.ПериодНачисления 			= КонецМесяца(Дата) + 1;		
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) и значениеЗаполнено(Выборка.ДатаПоверки)  тогда
			НовСтрока 							= НаборДатПоверки.Добавить();
			НовСтрока.Период 					= ?(ЗначениеЗаполнено(Выборка.ДатаПодключенияПУ),Выборка.ДатаПодключенияПУ, Дата);
			НовСтрока.Район						= Выборка.Район;
			НовСтрока.Абонент					= Выборка.Абонент;
			НовСтрока.Организация				= Выборка.Организация;
			НовСтрока.ПриборУчета				= Выборка.ПриборУчета;
			НовСтрока.ДатаПоверки				= Выборка.ДатаПоверки;
			НовСтрока.ПериодРегистрации			= Дата;
			НовСтрока.ПериодНачисления 			= КонецМесяца(Дата) + 1; 
		КонецЕсли; 		
	КонецЦикла;   	
КонецПроцедуры

Процедура ЗаписатьВПоказанияПУ(РезультатЗапроса)
	СостояниеПоказаний						= Перечисления.энргСостояниеПоказаний.Приняты;
	Набор									= Движения.энргПоказанияПриборовУчета;
	
	НаборМакс 								= Движения.энргМаксимальныеПоказания;
	Выборка  								= РезультатЗапроса.выбрать();
	ТекАбонент								= Неопределено;
	ТекПериод  								= Неопределено;
	ТекПрибор  								= Неопределено;
	ТекТарифнаяЗона 						= Неопределено;
	ТекПоказания  							= Неопределено;
	ТекРайон	  							= Неопределено;
	ТекОрганизация	  						= Неопределено;
	
	пока Выборка.следующий() цикл
		Период  							= ?(ЗначениеЗаполнено(Выборка.ДатаПоказаний), Выборка.ДатаПоказаний, Дата);		
		
		Если  ТекАбонент = Неопределено тогда
			ТекАбонент						= Выборка.Абонент;
			ТекПериод  						= Период;
			ТекПрибор  						= Выборка.ПриборУчета;
			ТекТарифнаяЗона 				= Выборка.ТарифнаяЗона;
			ТекПоказания  					= Выборка.Показание;
			ТекРайон 						= Выборка.Район;
			ТекОрганизация 					= Выборка.Организация;
			Продолжить;
		КонецЕсли;
		
		Если ТекАбонент<> Выборка.Абонент или ТекПрибор <> Выборка.ПриборУчета или ТекПериод <> Период тогда 
			
			НовСтрока						= Набор.Добавить();
			НовСтрока.Период				= ТекПериод;
			НовСтрока.Район					= ТекРайон;
			НовСтрока.Организация			= ТекОрганизация;
			НовСтрока.Абонент				= ТекАбонент;
			НовСтрока.ПриборУчета			= ТекПрибор;
			НовСтрока.ТарифнаяЗона			= ТекТарифнаяЗона;
			НовСтрока.Показание				= ТекПоказания;
			НовСтрока.СостояниеПоказаний 	= СостояниеПоказаний;
			НовСтрока.ПериодНачисления 		= КонецМесяца(Дата) + 1;
			НовСтрока.ПериодРегистрации		= Дата;
			
			НовСтрока						= НаборМакс.Добавить();
			НовСтрока.Период				= ТекПериод;
			НовСтрока.Район					= ТекРайон;
			НовСтрока.Организация			= ТекОрганизация;
			НовСтрока.Абонент				= ТекАбонент;
			НовСтрока.ПриборУчета			= ТекПрибор;
			НовСтрока.ТарифнаяЗона			= ТекТарифнаяЗона;
			НовСтрока.Показание				= ТекПоказания;
		КонецЕсли;
		
		ТекАбонент							= Выборка.Абонент;
		ТекПериод  							= Период;
		ТекПрибор  							= Выборка.ПриборУчета;
		ТекТарифнаяЗона  					= Выборка.ТарифнаяЗона;
		ТекПоказания  						= Выборка.Показание;
		ТекРайон 							= Выборка.Район;
		ТекОрганизация 						= Выборка.Организация;
	КонецЦикла;	
	
	Если ТекАбонент<> Неопределено тогда 
		
		НовСтрока							= Набор.Добавить();
		НовСтрока.Период					= ТекПериод;
		НовСтрока.Район						= ТекРайон;
		НовСтрока.Организация				= ТекОрганизация;
		НовСтрока.Абонент					= ТекАбонент;
		НовСтрока.ПриборУчета				= ТекПрибор;
		НовСтрока.ТарифнаяЗона				= ТекТарифнаяЗона;
		НовСтрока.Показание					= ТекПоказания;
		НовСтрока.СостояниеПоказаний 		= СостояниеПоказаний;
		НовСтрока.ПериодНачисления 			= КонецМесяца(Дата) + 1;
		НовСтрока.ПериодРегистрации			= Дата;
		
		НовСтрока							= НаборМакс.Добавить();
		НовСтрока.Период					= ТекПериод;
		НовСтрока.Район						= ТекРайон;
		НовСтрока.Организация				= ТекОрганизация;
		НовСтрока.Абонент					= ТекАбонент;
		НовСтрока.ПриборУчета				= ТекПрибор;
		НовСтрока.ТарифнаяЗона				= ТекТарифнаяЗона;
		НовСтрока.Показание					= ТекПоказания;
	КонецЕсли;
	
КонецПроцедуры

Процедура Взаиморасчеты()
	
	Результат															= РезультатВзаиморасчеты();
	ВыборкаАбонент														= Результат.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НаборВзаиморасчеты													= Движения.энргВзаиморасчеты;
	НаборПоМесяцам  													= Движения.энргВзаиморасчетыПоМесяцам;
	НаборАвансы 														= Движения.энргАвансы;
		
	Пока ВыборкаАбонент.следующий() цикл
		
		АвансАбонента 													= ВыборкаАбонент.Сумма < 0;
		
		ДетальнаяВыборка  												= ВыборкаАбонент.выбрать();
		СуммаАванса 													= 0;
		ДанныеЗадолженности  											= Новый Соответствие;
		СуммаЗадолженности  											= 0;
		Пока ДетальнаяВыборка.следующий() цикл
			НадоСписать  												= ДетальнаяВыборка.Сумма;
			
			Если ДетальнаяВыборка.Сумма < 0 тогда
				СуммаАванса												= СуммаАванса - ДетальнаяВыборка.Сумма; 
			ИначеЕсли СуммаАванса > 0 тогда
				Списываем 												= Мин(СуммаАванса,ДетальнаяВыборка.Сумма);
				СуммаАванса 											= СуммаАванса - Списываем;					
				НадоСписать												= НадоСписать - Списываем;				
				Если НадоСписать > 0 тогда					
					Если ДанныеЗадолженности.Получить(ДетальнаяВыборка.услуга) = Неопределено тогда
						ДанныеЗадолженности.Вставить(ДетальнаяВыборка.услуга,НадоСписать);
					иначе
						ДанныеЗадолженности[ДетальнаяВыборка.услуга] 	= ДанныеЗадолженности[ДетальнаяВыборка.услуга] +НадоСписать; 
					КонецЕсли;
					СуммаЗадолженности 									= СуммаЗадолженности +НадоСписать;					
				КонецЕсли;				
			иначе
				Если ДанныеЗадолженности.Получить(ДетальнаяВыборка.услуга) = Неопределено тогда
					ДанныеЗадолженности.Вставить(ДетальнаяВыборка.услуга,НадоСписать);
				иначе
					ДанныеЗадолженности[ДетальнаяВыборка.услуга] 		=  ДанныеЗадолженности[ДетальнаяВыборка.услуга] +НадоСписать; 
				КонецЕсли;
				СуммаЗадолженности 										= СуммаЗадолженности +НадоСписать;
			КонецЕсли;			
		КонецЦикла;	
		
		Если СуммаАванса > 0 тогда
			Запись  													= НаборАвансы.ДобавитьПриход();
			Запись.Период												= Дата;
			Запись.Район												= Район;
			Запись.Организация											= Организация;
			Запись.Абонент												= ВыборкаАбонент.Абонент;
			Запись.МКД													= ВыборкаАбонент.МКД;
			Запись.Сумма 												= СуммаАванса;
			Запись.ПериодНачисления										= КонецМесяца(Дата) + 1;
							
			Запись 														= НаборВзаиморасчеты.ДобавитьРасход();
			Запись.Период												= Дата;
			Запись.Район												= Район;
			Запись.Организация											= Организация;
			Запись.Абонент												= ВыборкаАбонент.Абонент;
			Запись.МКД													= ВыборкаАбонент.МКД;
			Запись.Сумма 												= СуммаАванса;
			Запись.ПериодНачисления										= КонецМесяца(Дата) + 1;
		ИначеЕсли ДанныеЗадолженности.Количество() > 0 тогда
			Запись 														= НаборВзаиморасчеты.ДобавитьПриход();
			Запись.Период												= Дата;
			Запись.Район												= Район;
			Запись.Организация											= Организация;
			Запись.Абонент												= ВыборкаАбонент.Абонент;
			Запись.МКД													= ВыборкаАбонент.МКД;
			Запись.Сумма 												= СуммаЗадолженности;			
			Запись.ПериодНачисления										= КонецМесяца(Дата) + 1;
			для Каждого КлючЗначение из ДанныеЗадолженности цикл 
				Запись													= НаборПоМесяцам.ДобавитьПриход();
				Запись.Период											= Дата;
				Запись.Район											= Район;
				Запись.Организация										= Организация;
				Запись.Абонент											= ВыборкаАбонент.Абонент;
				Запись.МКД												= ВыборкаАбонент.МКД;
				Запись.Сумма											= КлючЗначение.Значение;
				Запись.Услуга											= КлючЗначение.Ключ;
				Запись.Поставщик										= ВыборкаАбонент.Поставщик;
				Запись.ПериодНачисления									= НачалоМесяца(Дата);
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьВВидыБлагоустройств(Таблица)
	Набор	 							= Движения.энргВидБлагоустройствАбонента;
	Для каждого стр из Таблица Цикл
		Если ЗначениеЗаполнено(стр.Абонент)	и ЗначениеЗаполнено(стр.ВидБлагоустройства) Тогда
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), стр);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписьВРСэнргАбонентыОтключаемыеВНеполивнойСезон(Таблица)
	Набор	 							= Движения.энргАбонентыОтключаемыеВНеполивнойСезон;
	Для каждого стр из Таблица Цикл
		Если ЗначениеЗаполнено(стр.Абонент)Тогда
			НовСтрока = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, стр);			
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура УстановитьПоставщиков()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	="ВЫБРАТЬ
	             	 |	энргВводНачальныхОстатков.Ссылка КАК Ссылка,
	             	 |	энргВводНачальныхОстатков.Район КАК Район,
	             	 |	энргВводНачальныхОстатковТочкиУчета.Абонент КАК Абонент,
	             	 |	энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	             	 |	энргВводНачальныхОстатковТочкиУчета.Поставщик КАК Поставщик,
	             	 |	энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
	             	 |	энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтроки,
	             	 |	энргВводНачальныхОстатков.Организация КАК Организация
	             	 |ПОМЕСТИТЬ ДанныеТЧ
	             	 |ИЗ
	             	 |	Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	             	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков КАК энргВводНачальныхОстатков
	             	 |		ПО энргВводНачальныхОстатковТочкиУчета.Ссылка = энргВводНачальныхОстатков.Ссылка
	             	 |			И (энргВводНачальныхОстатковТочкиУчета.Ссылка = &Ссылка)
	             	 |			И (энргВводНачальныхОстатков.Ссылка = &Ссылка)
	             	 |			И (НЕ энргВводНачальныхОстатковТочкиУчета.ТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	             	 |;
	             	 |
	             	 |////////////////////////////////////////////////////////////////////////////////
	             	 |ВЫБРАТЬ
	             	 |	ДанныеТЧ.Ссылка КАК Ссылка,
	             	 |	ДанныеТЧ.Район КАК Район,
	             	 |	ДанныеТЧ.Абонент КАК Абонент,
	             	 |	ДанныеТЧ.ТочкаУчета КАК ТочкаУчета,
	             	 |	ВЫБОР
	             	 |		КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	             	 |			ТОГДА ДанныеТЧ.Поставщик
	             	 |		ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Поставщик
	             	 |	КОНЕЦ КАК Поставщик,
	             	 |	ВЫБОР
	             	 |		КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	             	 |			ТОГДА ДанныеТЧ.Услуга
	             	 |		ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги
	             	 |	КОНЕЦ КАК Услуга,
	             	 |	ВЫБОР
	             	 |		КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	             	 |			ТОГДА ЛОЖЬ
	             	 |		ИНАЧЕ ИСТИНА
	             	 |	КОНЕЦ КАК ЧастьСоставной,
	             	 |	ДанныеТЧ.Организация КАК Организация
	             	 |ИЗ
	             	 |	ДанныеТЧ КАК ДанныеТЧ
	             	 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоставщикиСоставныхУслуг КАК энргВводНачальныхОстатковПоставщикиСоставныхУслуг
	             	 |		ПО ДанныеТЧ.Ссылка = энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка
	             	 |			И (энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка = &Ссылка)
	             	 |			И ДанныеТЧ.IDСтроки = энргВводНачальныхОстатковПоставщикиСоставныхУслуг.IDСтроки";
	
	Результат  				= Запрос.Выполнить();
	Выборка  				= Результат.Выбрать();
	Набор  					= Движения.энргПоставщикиУслугАбонента;
	
	Пока Выборка.Следующий() цикл
		СтрокаНабора  		= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		СтрокаНабора.Период = Дата;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьМВТ()
	МВТ  = Новый МенеджерВременныхТаблиц;
	Запрос			= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст 	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.Ссылка КАК Ссылка,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.Ссылка.Дата КАК Дата,
	             	  |	энргАбоненты.Район КАК Район,
	             	  |	энргАбоненты.МКД КАК МКД,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.Абонент КАК Абонент,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.ТочкаУчета КАК ТочкаУчета,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.Услуга КАК Услуга,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.Головная КАК Головная,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.ДатаОткрытияЛС КАК ДатаОткрытияЛС,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.ДатаПодключенияПУ КАК ДатаПодключенияПУ,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.ДатаПоверки КАК ДатаПоверки,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.ПриборУчета КАК ПриборУчета,
	             	  |	энргВводНачальныхОстатковДанныеТочекУчета.ВидДифференцированности КАК ВидДифференцированности,
	             	  |	ВЫБОР
	             	  |		КОГДА энргВводНачальныхОстатковДанныеТочекУчета.КоэффициентПУ = 0
	             	  |			ТОГДА 1
	             	  |		ИНАЧЕ энргВводНачальныхОстатковДанныеТочекУчета.КоэффициентПУ
	             	  |	КОНЕЦ КАК КоэффициентПУ,
	             	  |	энргАбоненты.Организация КАК Организация
	             	  |ПОМЕСТИТЬ ДанныеТочекУчета
	             	  |ИЗ
	             	  |	Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковДанныеТочекУчета
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	             	  |		ПО энргВводНачальныхОстатковДанныеТочекУчета.Абонент = энргАбоненты.Ссылка
	             	  |			И (энргВводНачальныхОстатковДанныеТочекУчета.Ссылка = &Ссылка)";
	Запрос.Выполнить();
	Возврат МВТ;	
КонецФункции

Функция РезультатПоказанияПУ(Док)
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.ДатаПоказаний КАК ДатаПоказаний,
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.Абонент.Район КАК Район,
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.Абонент КАК Абонент,
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.Показание КАК Показание,
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.Ссылка КАК Ссылка,
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.Абонент.Организация КАК Организация
	             	  |ИЗ
	             	  |	Документ.энргВводНачальныхОстатков.ПоказанияПриборовУчета КАК энргВводНачальныхОстатковПоказанияПриборовУчета
	             	  |ГДЕ
	             	  |	энргВводНачальныхОстатковПоказанияПриборовУчета.Ссылка = &Ссылка
	             	  |
	             	  |УПОРЯДОЧИТЬ ПО
	             	  |	Абонент,
	             	  |	ПриборУчета,
	             	  |	ТарифнаяЗона,
	             	  |	ДатаПоказаний,
	             	  |	Показание";
	
	Запрос.УстановитьПараметр("Ссылка", док);
	Результат 		= Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

Функция РезультатВзаиморасчеты()
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	энргВводНачальныхОстатковВзаиморасчеты.Абонент КАК Абонент,
	             	  |	энргВводНачальныхОстатковВзаиморасчеты.Услуга КАК Услуга,
	             	  |	СУММА(энргВводНачальныхОстатковВзаиморасчеты.Задолженность) КАК Сумма,
	             	  |	энргАбоненты.Район КАК Район,
	             	  |	энргАбоненты.МКД КАК МКД,
	             	  |	энргВводНачальныхОстатковВзаиморасчеты.Поставщик КАК Поставщик,
	             	  |	энргАбоненты.Организация КАК Организация
	             	  |ПОМЕСТИТЬ Задолженность
	             	  |ИЗ
	             	  |	Документ.энргВводНачальныхОстатков.Взаиморасчеты КАК энргВводНачальныхОстатковВзаиморасчеты
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	             	  |		ПО энргВводНачальныхОстатковВзаиморасчеты.Абонент = энргАбоненты.Ссылка
	             	  |			И (энргВводНачальныхОстатковВзаиморасчеты.Ссылка = &Ссылка)
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	энргВводНачальныхОстатковВзаиморасчеты.Услуга,
	             	  |	энргВводНачальныхОстатковВзаиморасчеты.Абонент,
	             	  |	энргАбоненты.Район,
	             	  |	энргАбоненты.МКД,
	             	  |	энргВводНачальныхОстатковВзаиморасчеты.Поставщик,
	             	  |	энргАбоненты.Организация
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	Задолженность.Абонент КАК Абонент,
	             	  |	Задолженность.Услуга КАК Услуга,
	             	  |	Задолженность.Сумма КАК Сумма,
	             	  |	Задолженность.Район КАК Район,
	             	  |	Задолженность.МКД КАК МКД,
	             	  |	ВЫБОР
	             	  |		КОГДА Задолженность.Сумма < 0
	             	  |			ТОГДА 0
	             	  |		ИНАЧЕ 1
	             	  |	КОНЕЦ КАК ДопПорядок,
	             	  |	энргПорядокПогашенияЗадолженности.Порядок КАК Порядок,
	             	  |	Задолженность.Поставщик КАК Поставщик,
	             	  |	Задолженность.Организация КАК Организация
	             	  |ИЗ
	             	  |	Задолженность КАК Задолженность
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПорядокПогашенияЗадолженности КАК энргПорядокПогашенияЗадолженности
	             	  |		ПО Задолженность.Услуга = энргПорядокПогашенияЗадолженности.Услуга
	             	  |
	             	  |УПОРЯДОЧИТЬ ПО
	             	  |	Задолженность.Абонент,
	             	  |	ДопПорядок,
	             	  |	Порядок
	             	  |ИТОГИ
	             	  |	СУММА(Сумма),
	             	  |	МАКСИМУМ(МКД),
	             	  |	МАКСИМУМ(Поставщик)
	             	  |ПО
	             	  |	Абонент";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат  = Запрос.Выполнить(); 
	Возврат Результат;
КонецФункции

Функция РезультатФормулыРасчета()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Период",Дата);
	Запрос.Текст 	="ВЫБРАТЬ
	             	 |	энргВводНачальныхОстатковДанныеТочекУчета.Абонент КАК Абонент,
	             	 |	энргВводНачальныхОстатковДанныеТочекУчета.ТочкаУчета КАК РасчитываемаяТочка,
	             	 |	энргВводНачальныхОстатковДанныеТочекУчета.Ссылка КАК Ссылка,
	             	 |	энргАбоненты.Район КАК Район,
	             	 |	энргАбоненты.Организация КАК Организация
	             	 |ПОМЕСТИТЬ ТочкиПоФормуле
	             	 |ИЗ
	             	 |	Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковДанныеТочекУчета
	             	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	             	 |		ПО энргВводНачальныхОстатковДанныеТочекУчета.Абонент = энргАбоненты.Ссылка
	             	 |			И (энргВводНачальныхОстатковДанныеТочекУчета.Ссылка = &Ссылка)
	             	 |			И (энргВводНачальныхОстатковДанныеТочекУчета.РасчетПоФормуле)
	             	 |;
	             	 |
	             	 |////////////////////////////////////////////////////////////////////////////////
	             	 |ВЫБРАТЬ
	             	 |	&Период КАК Период,
	             	 |	ТочкиПоФормуле.Район КАК Район,
	             	 |	ТочкиПоФормуле.Абонент КАК Абонент,
	             	 |	ТочкиПоФормуле.РасчитываемаяТочка КАК РассчитываемаяТочка,
	             	 |	энргВводНачальныхОстатковДанныеТочекУчета.ТочкаУчета КАК ТочкаИсточник,
	             	 |	энргВводНачальныхОстатковДанныеТочекУчета.КоэффициентФормулы КАК Коэффициент,
	             	 |	ИСТИНА КАК Актуальность,
	             	 |	ТочкиПоФормуле.Организация КАК Организация
	             	 |ИЗ
	             	 |	ТочкиПоФормуле КАК ТочкиПоФормуле
	             	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковДанныеТочекУчета
	             	 |		ПО ТочкиПоФормуле.Ссылка = энргВводНачальныхОстатковДанныеТочекУчета.Ссылка
	             	 |			И ТочкиПоФормуле.Абонент = энргВводНачальныхОстатковДанныеТочекУчета.Абонент
	             	 |			И ТочкиПоФормуле.РасчитываемаяТочка = энргВводНачальныхОстатковДанныеТочекУчета.ЗависимаяТочка
	             	 |ИТОГИ ПО
	             	 |	Абонент,
	             	 |	РассчитываемаяТочка";
	Результат  = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

Функция ПолучитьТаблицуВидыБлагоустройств(Док)
	Запрос = Новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	энргВводНачальныхОстатков.Ссылка КАК Регистратор,
	               |	энргВводНачальныхОстатков.Дата КАК Период,
	               |	энргАбоненты.Район КАК Район,
	               |	энргВводНачальныхОстатковВидыБлагоустройств.Абонент КАК Абонент,
	               |	энргВводНачальныхОстатковВидыБлагоустройств.ВидБлагоустройств КАК ВидБлагоустройства,
	               |	энргВводНачальныхОстатков.Дата КАК ПериодРегистрации,
	               |	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(энргВводНачальныхОстатков.Дата, МЕСЯЦ), СЕКУНДА, 1) КАК ПериодНачисления,
	               |	энргАбоненты.Организация КАК Организация
	               |ИЗ
	               |	Документ.энргВводНачальныхОстатков КАК энргВводНачальныхОстатков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ВидыБлагоустройств КАК энргВводНачальныхОстатковВидыБлагоустройств
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	               |			ПО энргВводНачальныхОстатковВидыБлагоустройств.Абонент = энргАбоненты.Ссылка
	               |		ПО (энргВводНачальныхОстатковВидыБлагоустройств.Ссылка = энргВводНачальныхОстатков.Ссылка)
	               |ГДЕ
	               |	энргВводНачальныхОстатков.Ссылка = &Док";
	Запрос.УстановитьПараметр("Док", Док);
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	
	Возврат Выгрузка;
КонецФункции

Функция ПолучитьТаблицуОтключаемыхВНеполивнойСезон(Док)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка.Дата КАК Период,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка КАК Регистратор,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка.Район КАК Район,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Абонент КАК Абонент,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Услуга КАК Услуга,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка.Организация КАК Организация
	               |ИЗ
	               |	Документ.энргВводНачальныхОстатков.ОтключаемыеВНеполивнойСезон КАК энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон
	               |ГДЕ
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка = &Док
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Абонент,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.ОтключатьВНеполивнойСезон,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Услуга,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка.Дата,
	               |	энргВводНачальныхОстатковОтключаемыеВНеполивнойСезон.Ссылка.Район";
	Запрос.УстановитьПараметр("Док", Док);
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	Возврат Выгрузка;
КонецФункции	

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли