#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерфейса_ПолучениеДанных

Функция ОстаткиНаГраницу(МВТ, Знач ТаблицаДляПомещения, Знач Организация, Знач Район, Знач Период = '0001-01-01', Знач МКД = Неопределено, Абонент = Неопределено) Экспорт	
	СоотвествиеПолей 		= Новый Структура("Организация,Район","Организация","Район");
	ПараметрыЗапроса 		= Новый Структура("Организация,Район",Организация,Район); 	
	Если НЕ МКД = Неопределено Тогда
		СоотвествиеПолей.Вставить("МКД","МКД");
		ПараметрыЗапроса.Вставить("МКД",МКД);
	КонецЕсли;	
	Если НЕ Абонент = Неопределено Тогда
		СоотвествиеПолей.Вставить("Абонент","Абонент");
		ПараметрыЗапроса.Вставить("Абонент",Абонент);
	КонецЕсли;	
	ПараметрыВТ 			= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	ПараметрПериод 			= энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период");
	ПараметрыЗапроса.Вставить("Период",Период);
	ПараметрыСхемы 			= Новый Структура("ПараметрыВТ,Период",ПараметрыВТ,ПараметрПериод);
	Схема  					= Неопределено;
	ЗаполнитьСхемуЗадолженностьНаМоментВремени(Схема,ПараметрыСхемы,ТаблицаДляПомещения);
	энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса,МВТ);
	Возврат Неопределено;
КонецФункции

Функция ОборотыЗаПериод(МВТ, Знач ТаблицаДляПомещения, Знач Организация, Знач Район, Знач НачалоПериода = '0001-01-01', Знач КонецПериода = '0001-01-01', Знач МКД = Неопределено, Знач Абонент = Неопределено) Экспорт 
	СоотвествиеПолей 		= Новый Структура("Организация,Район","Организация","Район");
	ПараметрыЗапроса 		= Новый Структура("Организация,Район",Организация,Район); 	
	Если НЕ МКД = Неопределено Тогда
		СоотвествиеПолей.Вставить("МКД","МКД");
		ПараметрыЗапроса.Вставить("МКД",МКД);
	КонецЕсли;	
	Если НЕ Абонент = Неопределено Тогда
		СоотвествиеПолей.Вставить("Абонент","Абонент");
		ПараметрыЗапроса.Вставить("Абонент",Абонент);
	КонецЕсли;	
	ПараметрыВТ 			= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	ПараметрНачалоПериода	= энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериода");
	ПараметрКонецПериода	= энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КонецПериода");
	ПараметрыЗапроса.Вставить("НачалоПериода",	НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода",	КонецПериода);
	ПараметрыСхемы 			= Новый Структура("ПараметрыВТ,НачалоПериода,КонецПериода",ПараметрыВТ,ПараметрНачалоПериода,ПараметрКонецПериода);
	Схема  					= Неопределено;
	ЗаполнитьСхемуОборотыВзаиморасчетов(Схема,ПараметрыСхемы,ТаблицаДляПомещения);
	энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса,МВТ); 	
	Возврат Неопределено;
КонецФункции


Процедура ЗаполнитьСхемуЗадолженностьНаМоментВремени(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗадолженностьНаМоментВремени());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("Период") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["Период"].ИмяПараметра));
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ОтборПакета 		= Операторы[0].Отбор;
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,Услуга,ПериодНачисления,Поставщик";
		ПараметрИсточника 	= ПараметрыИсточника[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуОборотыВзаиморасчетов(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОборотыВзаиморасчетов());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("НачалоПериода") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыСхемы["НачалоПериода"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыСхемы.Свойство("КонецПериода") Тогда
		ПараметрПериод 				= ПараметрыИсточника[1];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыСхемы["КонецПериода"].ИмяПараметра));		
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ОтборПакета 				= Пакет.Операторы[0].Отбор;
		ДоступныеПоляОтбора 		= "Организация,Район,МКД,Абонент,Услуга,ПериодНачисления,Поставщик";
		ПараметрИсточника 			= ПараметрыИсточника[3];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросовПолученияДанных

Функция ТекстЗапросаЗадолженностьНаМоментВремени()
	Текст  = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
	|	ВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
	|	ВзаиморасчетыПоМесяцамОстатки.МКД КАК МКД,
	|	ВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
	|	ВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	ВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	|	ВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик,
	|	ВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки КАК ВзаиморасчетыПоМесяцамОстатки";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОборотыВзаиморасчетов()	
	Текст  =
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоМесяцамОбороты.Организация КАК Организация,
	|	ВзаиморасчетыПоМесяцамОбороты.Район КАК Район,
	|	ВзаиморасчетыПоМесяцамОбороты.Период КАК Период,
	|	ВзаиморасчетыПоМесяцамОбороты.Регистратор КАК Регистратор,
	|	ВзаиморасчетыПоМесяцамОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ВзаиморасчетыПоМесяцамОбороты.МКД КАК МКД,
	|	ВзаиморасчетыПоМесяцамОбороты.Абонент КАК Абонент,
	|	ВзаиморасчетыПоМесяцамОбороты.Услуга КАК Услуга,
	|	ВзаиморасчетыПоМесяцамОбороты.СуммаОборот КАК СуммаОборот,
	|	ВзаиморасчетыПоМесяцамОбороты.Поставщик КАК Поставщик
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты(, , Регистратор, ) КАК ВзаиморасчетыПоМесяцамОбороты";
	Возврат Текст;
	
КонецФункции

#КонецОбласти
	
#КонецОбласти

#КонецЕсли