#Область СлужебныеПроцедурыИФункции

Функция ОписаниеКлючевыхПараметров() Экспорт 
	
	ОписаниеСтроки  						= Новый ФиксированнаяСтруктура("Имя,Тип, Заголовок, ЗначениеПоУмолчанию, Диапазон, ИспользоватьСвязиПараметровВыбора");
	Результат 								= Новый Соответствие;
	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "ВидБлагоустройства";
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= Справочники.энргВидыБлагоустройств.ПустаяСсылка();
	ОписаниеПараметра.Заголовок				= "Вид благоустройства";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("СправочникСсылка.энргВидыБлагоустройств");
	ОписаниеПараметра.Диапазон 				= Ложь;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.ВидБлагоустройства, ОписаниеПараметра);
	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "ВидСобственности";
	ОписаниеПараметра.Заголовок				= "Вид собственности";
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= Перечисления.энргТипыСобственниковЖилья.ПустаяСсылка();
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("ПеречислениеСсылка.энргТипыСобственниковЖилья");
	ОписаниеПараметра.Диапазон 				= Ложь;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.ВидСобственности, ОписаниеПараметра);
	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "ГодПостройки";
	ОписаниеПараметра.Заголовок				= "Год постройки";
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= 0;
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(4,0));;
	ОписаниеПараметра.Диапазон 				= Истина;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.ГодПостройки, ОписаниеПараметра);
	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "КоличествоКомнат";
	ОписаниеПараметра.Заголовок				= "Количество комнат";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0));
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= 0;
	ОписаниеПараметра.Диапазон 				= Истина;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.КоличествоКомнат, ОписаниеПараметра);
	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "КоличествоЧеловек";
	ОписаниеПараметра.Заголовок				= "Количество человек";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0));
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= 0;
	ОписаниеПараметра.Диапазон 				= Истина;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.КоличествоЧеловек, ОписаниеПараметра);
		
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "КоличествоПрописанных";
	ОписаниеПараметра.Заголовок				= "Количество прописанных";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0));
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= 0;
	ОписаниеПараметра.Диапазон 				= Истина;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.КоличествоПрописанных, ОписаниеПараметра);
	 	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "КоличествоПроживающих";
	ОписаниеПараметра.Заголовок				= "Количество проживающих";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0));
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= 0;
	ОписаниеПараметра.Диапазон 				= Истина;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.КоличествоПроживающих, ОписаниеПараметра);
				
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "КоличествоЭтажей";
	ОписаниеПараметра.Заголовок				= "Количество этажей";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(2,0, ДопустимыйЗнак.Неотрицательный)); // ОТЭК, 21.05.2020, 000202897.
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= 0;
	ОписаниеПараметра.Диапазон 				= Истина;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.КоличествоЭтажей, ОписаниеПараметра);
	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "ИзмерительНаправленияИспользования";
	ОписаниеПараметра.Заголовок				= "Измеритель направления использования";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("СправочникСсылка.энргНаправлениеИспользованияТочекУчета");
	ОписаниеПараметра.ЗначениеПоУмолчанию  	= Справочники.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка();
	ОписаниеПараметра.Диапазон 				= Ложь;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Истина;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования, ОписаниеПараметра);
	
	ОписаниеПараметра  						= Новый Структура(ОписаниеСтроки);
	ОписаниеПараметра.Имя 					= "КоличествоСобственников";
	ОписаниеПараметра.Заголовок				= "Количество собственников";
	ОписаниеПараметра.Тип 					= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0));
	ОписаниеПараметра.ЗначениеПоУмолчанию 	= 0;
	ОписаниеПараметра.Диапазон 				= Истина;
	ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора	= Ложь;
	Результат.Вставить(Перечисления.энргКлючевыеПараметрыНорматива.КоличествоСобственников, ОписаниеПараметра);
	
	Возврат Результат;
КонецФункции

Функция КлючиПараметров() Экспорт
	
	КлючевыеПараметры 	= ОписаниеКлючевыхПараметров();
	ОписаниеКлючей	 	= Новый Структура("
	|ВидБлагоустройства, ВидСобственности, ГодПостройкиОт, ГодПостройкиДо, ИзмерительНаправленияИспользования, 
	|КоличествоКомнатОт, КоличествоКомнатДо, 
	|КоличествоЧеловекОт, КоличествоЧеловекДо,
	|КоличествоПрописанныхОт, КоличествоПрописанныхДо,
	|КоличествоПроживающихОт, КоличествоПроживающихДо,
	|КоличествоЭтажейОт, КоличествоЭтажейДо,
	|КоличествоСобственниковОт, КоличествоСобственниковДо");
	
	Для Каждого КлючевойПараметр Из КлючевыеПараметры Цикл
		Если КлючевойПараметр.Значение.Диапазон Тогда
			ОписаниеКлючей[КлючевойПараметр.Значение.Имя + "От"] = КлючевойПараметр.Значение.ЗначениеПоУмолчанию;
			ОписаниеКлючей[КлючевойПараметр.Значение.Имя + "До"] = КлючевойПараметр.Значение.ЗначениеПоУмолчанию;
		Иначе
			ОписаниеКлючей[КлючевойПараметр.Значение.Имя]		 = КлючевойПараметр.Значение.ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(ОписаниеКлючей);
		
КонецФункции  

#КонецОбласти
