#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет максимальные показания срез.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция МаксимальныеПоказанияСрез(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМаксимальныеПоказанияСрез());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, ПриборУчета, Шкала, ТарифнаяЗона";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ОператорВыбора.Источники[0].Источник.Псевдоним, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Получает текст запроса максимальные показания срез.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаМаксимальныеПоказанияСрез() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	энргМаксимальныеПоказанияСрез.Организация КАК Организация,
	|	энргМаксимальныеПоказанияСрез.ПериодНачисления КАК ПериодНачисления,
	|	энргМаксимальныеПоказанияСрез.Район КАК Район,
	|	энргМаксимальныеПоказанияСрез.ЧастныйСектор КАК ЧастныйСектор,
	|	энргМаксимальныеПоказанияСрез.Строение КАК Строение,
	|	энргМаксимальныеПоказанияСрез.Помещение КАК Помещение,
	|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрез.Показания КАК Показания,
	|	энргМаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	энргМаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли