#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	//Если не ДополнительныеСвойства.Свойство("ПроведениеРазрешено") тогда
	//	Отказ = истина;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ создается автоматически из меню ""Выполнение начислений""");
	//	Возврат;
	//КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	энргДатаПоследнегоИзменения	= ТекущаяДата();
	
	ДополнительныеСвойства.Вставить("Кассир", Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления", Неопределено);
	ДополнительныеСвойства.Вставить("ЭтоОплата", Ложь);
	ДополнительныеСвойства.Вставить("ДанныеОплаты", Неопределено);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНачислениеПениДанныеНачислений.Договор КАК Договор,
		|	бестНачислениеПениДанныеНачислений.Услуга КАК Услуга,
		|	бестНачислениеПениДанныеНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(бестНачислениеПениДанныеНачислений.СуммаПени) КАК Сумма,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Организация КАК Организация,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Район КАК Район,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Дата КАК Период,
		|	бестНачислениеПениДанныеНачислений.Ссылка.ПериодНачисления КАК ПериодРасчета
		|ИЗ
		|	Документ.бестНачислениеПениНП.ДанныеНачислений КАК бестНачислениеПениДанныеНачислений
		|ГДЕ
		|	бестНачислениеПениДанныеНачислений.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бестНачислениеПениДанныеНачислений.Договор,
		|	бестНачислениеПениДанныеНачислений.Услуга,
		|	бестНачислениеПениДанныеНачислений.ПериодНачисления,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Организация,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Район,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Дата,
		|	бестНачислениеПениДанныеНачислений.Ссылка.ПериодНачисления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись  						= Движения.бестОбъемыПени.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.ВидОперации				= Перечисления.энргВидыОперацийНачисления.НачислениеПени;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНачислениеПениДанныеНачислений.Договор КАК Договор,
		|	СУММА(бестНачислениеПениДанныеНачислений.СуммаПени) КАК Сумма,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Организация КАК Организация,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Район КАК Район,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.бестНачислениеПениНП.ДанныеНачислений КАК бестНачислениеПениДанныеНачислений
		|ГДЕ
		|	бестНачислениеПениДанныеНачислений.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бестНачислениеПениДанныеНачислений.Договор,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Организация,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Район,
		|	бестНачислениеПениДанныеНачислений.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись  						= Движения.бестВзаиморасчетыПоПени.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.ВидДвижения				= ВидДвиженияНакопления.Приход;
		Запись.ВидОперации				= Перечисления.энргВидыОперацийНачисления.НачислениеПени;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли