
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
			
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьГруппуПотребителейНП(ЭтотОбъект, Объект.Ссылка);
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестУстановитьГруппуПотребителейНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ОбъектРасчетаПриИзмененииНаСервере();
	ЗаполнитьАдрессОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


#Область ВспомогательныеПроцедуры

&НаСервере
Процедура ОбъектРасчетаПриИзмененииНаСервере()
	
	Объект.ТарифныеКатегорииУслуги.Очистить();

	Результат 								= бестРаботаСОбъектамиНПСервер.ДействующиеУслугиПоОбъекту(Объект.Дата,Объект.Организация,Объект.Район, Объект.ОбъектРасчета); 
	Выборка  								= Результат.выбрать();
	Пока Выборка.следующий() цикл
		СтрокаТЧ  							= Объект.ТарифныеКатегорииУслуги.Добавить();
		СтрокаТЧ.Услуга 		        	= Выборка.Услуга;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифныеКатегорииУслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	СписокУслуг = бестПользовательскийВводСервер.ПолучитьСписокУслугДляВыбора(?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата), Объект.Организация, Объект.Район, объект.ОбъектРасчета, Неопределено);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);	
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТарифныеКатегорииУслугиУслугаПриИзменении(Элемент)
	ТекДанные = Элементы.ТарифныеКатегорииУслуги.ТекущиеДанные;
	УслугаПриИзмененииКлиент(текДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзмененииКлиент(ТекДанные)
		Услуга = ТекДанные.Услуга;
		НомерСтроки = ТекДанные.НомерСтроки;
		УслугаПриИзмененииНаСервере(Услуга,НомерСтроки);
КонецПроцедуры

&НаСервере
Процедура УслугаПриИзмененииНаСервере(Услуга,НомерСтроки)
	
	ЗаполняемаяТаблица = Объект.ТарифныеКатегорииУслуги;
	МассивСтрок = ЗаполняемаяТаблица.НайтиСтроки(новый Структура("Услуга",Услуга));
	
	Для Каждого ТекСтр из МассивСтрок  Цикл
		ЗаполняемаяТаблица.Удалить(ТекСтр);
	КонецЦикла;
	
	
	Запрос = новый запрос; 
	запрос.Текст = "ВЫБРАТЬ
	               |	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория КАК ТарифнаяКатегорияПред,
	               |	бестТарифныеКатегорииНПСрезПоследних.Услуга КАК Услуга
	               |ИЗ
	               |	РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И Услуга = &Услуга
	               |				И ОбъектРасчета = &ОбъектРасчета) КАК бестТарифныеКатегорииНПСрезПоследних"; 
	запрос.УстановитьПараметр("Район", Объект.Район);
	Запрос.УстановитьПараметр("Организация", объект.Организация);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Если Не ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета = &ОбъектРасчета", "Истина");
	Иначе
		Запрос.УстановитьПараметр("ОбъектРасчета",	Объект.ОбъектРасчета);
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока  Выборка.Следующий() Цикл 
		Новаястрока =  ЗаполняемаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(Новаястрока, Выборка);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифныеКатегорииУслугиТарифнаяКатегорияПриИзменении(Элемент)
	ТекДанные = Элементы.ТарифныеКатегорииУслуги.ТекущиеДанные;
	ТекСтр = Элементы.ТарифныеКатегорииУслуги.ТекущаяСтрока;
	
	Если ТекДанные.ТарифнаяКатегория  = ТекДанные.ТарифнаяКатегорияПред Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тарифная категория не изменилась");
		ТекДанные.ТарифнаяКатегория = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

