#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргЗначенияЛьготныхКатегорий(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.ПроцентОтНачислений <> 0 и Запись.Сумма <> 0 Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Должно быть заполнено только одно из значений - процент от начислений или конкретная сумма!",,,, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
