#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрефиксТочекУчета = "";
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
		
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"СпособРасчетаНорматива","СпособыРасчетаНормативаСоставныхУслуг","ПараметрыСпособовРасчетаНорматива");
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"Договор","ДоговорыСоставныхУслуг","ПараметрыДоговоров");
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьИтогиДоговорныхОбъемов();
		ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
	Иначе
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	ЗаполнитьТекстовыеПоля();
	ПрефиксТочекУчета = "";
	ДоступностьТЧТУ();
	бестЛокализацияСервер.ПриСозданииНаСервере_бестЗаключениеДоговоровСЮридическимиЛицами(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	ЗаполнитьТекстовыеПоля();
	
	ПриЧтенииНаСервереПереопределяемый(ТекущийОбъект);
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДанныеКварталов();
	ОбновитьЗаголовокКнопкиПереключенияИтогов();
	НастройкаВидимости();
	ЗаполнитьДеревоПИР();
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ДополнительныеНачисленияЗначения, Неопределено, Новый УникальныйИдентификатор());
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПроверкаДублированияНаименованийОбъектовРасчета(Отказ);			
	//энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект);
	СоответствиеСтрок 						= Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
	бестПользовательскийВводСервер.ЗаписатьПараметрыОбъекта(Объект.ОбъектыРасчета, ТекущийОбъект);
	
	// Добавлено для УК!
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПроверитьЗаполнениеДанных(Отказ);
		
		НовыеОбъектыРасчета					= Новый Массив;
		
		Сч = 0;
		Для Каждого СтрокаОбъектовРасчета Из ТекущийОбъект.ОбъектыРасчета Цикл
			Если СтрокаОбъектовРасчета.ОписаниеОбъекта <> Объект.ОбъектыРасчета[Сч].ОписаниеОбъекта И Не ПустаяСтрока(Объект.ОбъектыРасчета[Сч].ОписаниеОбъекта)	Тогда
				//Если НЕ ЗначениеЗаполнено(СтрокаОбъектовРасчета.ОбъектРасчета) Тогда
					СтрокаОбъектовРасчета.ОписаниеОбъекта	= Объект.ОбъектыРасчета[Сч].ОписаниеОбъекта;
				//КонецЕсли;
				СтрокаОбъектовРасчета.ОбъектРасчета	= Объект.ОбъектыРасчета[Сч].ОбъектРасчета;
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаОбъектовРасчета.ОписаниеОбъекта) И НЕ ЗначениеЗаполнено(СтрокаОбъектовРасчета.ОбъектРасчета) Тогда
				СтрокаОбъектовРасчета.ОбъектРасчета = Справочники.бестОбъектыРасчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеОбъектыРасчета.Добавить(СтрокаОбъектовРасчета.НомерСтроки);
			КонецЕсли;			
			Сч = Сч +1;
		КонецЦикла;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеОбъектыРасчета",НовыеОбъектыРасчета);
		//Если Объект.Договор.ТипДоговора <> Перечисления.бестТипыДоговоров.УправляющаяКомпания
		//	Или Объект.Договор.ТипДоговора = Перечисления.бестТипыДоговоров.УправляющаяКомпания И Объект.Договор.РасчетОбъемовВыполняетУК Тогда
		
		//энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаУзловПоПараметрам(ТекущийОбъект,"ПриборыУзловУчета",Отказ);		
		// TODO FIX ME
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		// TODO FIX ME
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеУзлыУчета 						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		НовыеИзмерители 					= Новый Массив;
		СоответствиеПрибора 				= Новый Соответствие;
		ТУОбъектовУК						= Новый Массив;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если СтрокаТочкиУчета.ОбъектУК Тогда
				ТУОбъектовУК.Добавить(СтрокаТочкиУчета.IDСтроки);
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			
			// Теперь это для узлов --
			//Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
			//	СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
			//	НовыеУзлыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			//КонецЕсли;
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;
			// --Теперь это для узлов					
			
		КонецЦикла;
		
		//Для Каждого СтрокаПриборовУчета Из ТекущийОбъект.ПриборыУзловУчета Цикл
		//	
		//	Если Не ПустаяСтрока(СтрокаПриборовУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаПриборовУчета.ПриборУчета) Тогда
		//		СтрокаПриборовУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеПриборыУчета.Добавить(СтрокаПриборовУчета.НомерСтроки);
		//	КонецЕсли;			
		//	
		//КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если ТУОбъектовУК.Найти(СтрокаИзмерителя.IDСтрокиТочкиУчета) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				//СтрокаИзмерителя.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				//НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				
				ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
			КонецЕсли;			
		КонецЦикла;
		
		
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеУзлыУчета", 	НовыеУзлыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		
		//КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для каждого стр из Объект.ОбъектыРасчета Цикл
			бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,стр.ОбъектРасчета);
		КонецЦикла;
	КонецЕсли;
	
	//Пока нет
	
	//ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	//Если ДопСвойства.свойство("УстановкаФормулыРасчета") тогда
	//	ДанныеУстановкиФормулыРасчета = ДопСвойства.УстановкаФормулыРасчета;		 
	//иначе
	//	ДанныеУстановкиФормулыРасчета = Неопределено;
	//КонецЕсли;
	//	
	//Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
	//	ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	//иначе
	//	ДанныеДляПерерасчета = Неопределено;
	//КонецЕсли;

	//Пока нет

	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Пока нет

	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеДляФормулРасчета(ТекущийОбъект);
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект);
	//КонецЕсли;
	
	//Пока нет
	
	//Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
	//	бестРаботаСТочкамиУчетаНПСервер.ПроверитьИСоздатьОбъектыРасчета(ТекущийОбъект,"ОбъектыРасчета");
	//	// Добавлено для УК!
	//	Если Объект.Договор.ТипДоговора <> Перечисления.бестТипыДоговоров.УправляющаяКомпания Тогда
	//		энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
	//		энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
	//		энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
	//	КонецЕсли;
	//КонецЕсли;

	Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		бестРаботаСОбъектамиНПСервер.ПроверитьИСоздатьОбъектыРасчета(ТекущийОбъект,"ОбъектыРасчета");
		// Добавлено для УК!
		////Если Объект.Договор.ТипДоговора <> Перечисления.бестТипыДоговоров.УправляющаяКомпания
		////	Или Объект.Договор.ТипДоговора = Перечисления.бестТипыДоговоров.УправляющаяКомпания И Объект.Договор.РасчетОбъемовВыполняетУК Тогда
		энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
		//энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
		
		
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		ТУОбъектовУК						= Новый Массив;
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			Если СтрокаТочки.ОбъектУК Тогда
				ТУОбъектовУК.Добавить(СтрокаТочки.IDСтроки);
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если ТУОбъектовУК.Найти(СтрокаИзмерителя.IDСтрокиТочкиУчета) <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);							
		КонецЦикла;
		////КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПрименитьПараметрыПИР();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьДанныеОбъектаРасчета" Тогда
		
		ПараметрыОтбора = Новый Структура("ОбъектРасчета", Параметр);
		НайденныеСтроки = Объект.ОбъектыРасчета.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбновитьДанныеОбъектаРасчета(НайденныеСтроки[0]);
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестЗаключениеДоговоровСЮридическимиЛицами",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Договор) тогда
		бестПользовательскийВводКлиент.ПриИзмененииДоговораКонтрагента(Объект, "ДатаФактическогоСобытия");
		ЗаполнитьДанныеДоговораСервер(Ложь);
		//--СДЕЛАНО ВРЕМЕННО
		Если ПолучитьТипДоговора() = ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.УправляющаяКомпания") Тогда
			
			Для Каждого ТекСтрока Из Объект.ТочкиУчета Цикл
				ТекущиеДанные 							= ТекСтрока; 
				
				энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);				
				ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга); 				
				// энргРаботаСПоставщиками {
				бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
				// энргРаботаСПоставщиками } 				
				
				// энргРаботаСоСпособамиРасчетаНорматива {
				бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
				// энргРаботаСоСпособамиРасчетаНорматива } 
				
				СоответствиеЗначенияПоУмолчанию = Новый Соответствие;
				СоответствиеЗначенияПоУмолчанию.Вставить("Договор", Объект.Договор);
				бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги,"ДоговорыСоставныхУслуг",СоответствиеЗначенияПоУмолчанию);
	
				Если ИспользоватьШкалыПриборовУчета Тогда
					СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
					бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
				КонецЕсли;
				
				
			КонецЦикла;	
			ЗаполнитьПоставщика();
			
			УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
			УстановитьУсловноеОФормлениеФормыКлиент("Договор","ПараметрыДоговоров");
		КонецЕсли;
		//--СДЕЛАНО ВРЕМЕННО
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер(); 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиОбъектыРасчета

&НаКлиенте
Процедура ОбъектыРасчетаПриАктивизацииСтроки(Элемент)
		
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекОбъектРасчета = ТекДанные.ОбъектРасчета;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.УслугиОбъектов,						Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.СезонныеНагрузки,						Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПотребителиГВС,						Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ГарантированныеОбъемы,					Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы["ТочкиУчета"],	Неопределено,		ТекДанные.IDСтроки,, "Владельца");
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТемпературныеГрафикиОбъектов,			Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.УслугиРаспределенияПотерь,				Неопределено,		ТекДанные.IDСтроки,, "Владельца");
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТарифныеКатегорииУслуги,				Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.МаксимальныеНагрузки	,				Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ДополнительныеНачисленияТУ	,			Неопределено,		ТекДанные.IDСтроки,, "Владельца");

	Если Объект.ОбъемыИНагрузкиВРазрезеДоговора И ТекДанные.НомерСтроки > 1 Тогда
		Элементы.ГарантированныеОбъемы.ТолькоПросмотр = Истина;
		Элементы.УслугиОбъектов.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ГарантированныеОбъемы.ТолькоПросмотр = Ложь;
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ИтогиДоговорныхОбъемов,				Неопределено,		ТекДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаНаименованиеОбъектаРасчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.НаименованиеОбъектаРасчета) и НЕ ЗначениеЗаполнено(ТекДанные.ОбъектРасчета) Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.Собственник) Тогда
			ТекДанные.Собственник	= Объект.Контрагент;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаОбъектРасчетаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	ОбновитьДанныеОбъектаРасчета(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ОбъектыРасчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("IDСтроки", 		Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки);
	ПроверкаУдаленияСтроки(ДопПараметры);	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;	
		НоваяСтрока = Объект.ОбъектыРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные);
		НоваяСтрока.idСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеДанных(Отказ)
	СтруктураОбязательныхРеквизитов = Новый Структура;
	ПолучитьСтруктуруОбязательныхРеквизитов(СтруктураОбязательныхРеквизитов);
	СтруктураОбязательныхТЧ = Новый Структура;
	ПолучитьМассивТЧ(СтруктураОбязательныхТЧ);
	
	Для каждого стр из СтруктураОбязательныхРеквизитов Цикл
		Если Не ЗначениеЗаполнено(стр.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение реквизита '" + стр.Ключ +"'");
			Отказ = Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Для каждого стр из СтруктураОбязательныхТЧ Цикл
		Если стр.Значение.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена ТЧ '" + стр.Ключ +"'");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
		
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",ТекДанные.АдресОбъекта,ТекДанные.АдресОбъектаЗначение);
	
	ПараметрыФормыКонтактнойИнформации.Значение 		= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	Оповещение 											= Новый ОписаниеОповещения("ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Истина);
	Оповещение.ДополнительныеПараметры.Вставить("КлючСтроки", 		 Элементы.ОбъектыРасчета.ТекущаяСтрока);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);


КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
		
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 									= Объект.ОбъектыРасчета.НайтиПоИдентификатору(ДополнительныеПараметры.КлючСтроки);	
	
	ТекущиеДанные.АдресОбъекта 						= РезультатЗакрытия.Представление;
	ТекущиеДанные.АдресОбъектаЗначение 				= РезультатЗакрытия.Значение; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;

	ТекДанные.АдресОбъектаЗначение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекДанные.АдресОбъекта, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаМКДПриИзменении(Элемент)
	Элементы.ОбъектыРасчета.ТекущиеДанные.АдресОбъекта 	= ПолучитьАдресМКД(Элементы.ОбъектыРасчета.ТекущиеДанные.МКД,ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома")); 
	Элементы.ОбъектыРасчета.ТекущиеДанные.Участвует		= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ОбъектыРасчетаДополнительнаяИнформация" Тогда
		ТекущиеДанные		= Элементы.ОбъектыРасчета.ТекущиеДанные;
		КлючДанных 			= бестПользовательскийВводКлиент.ПолучитьКлючЗаполненияИнформацииОбъекта();
		ВходныеДанные		= Новый Структура(КлючДанных);
		ЗаполнитьЗначенияСвойств(ВходныеДанные,ТекущиеДанные);
		
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ИнформацияОбъектаЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные));
		ОткрытьФорму("ОбщаяФорма.бестИнформацияОбъекта", Новый Структура("ВходныеДанные,КлючДанных",ВходныеДанные,КлючДанных),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиГарантированныеОбъемы

&НаКлиенте
Процедура ГарантированныеОбъемыПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеОбъемы = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанныеОбъемы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеОбъемы.IDСтроки = ТекДанные.IDСтроки;

	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
	
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыЯнварьПриИзменении(Элемент)
	СуммаПоКварталу()
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиУслугиОбъектов

&НаКлиенте
Процедура УслугиОбъектовУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Элементы.УслугиОбъектов.ТекущиеДанные.Услуга.Пустая()=Истина Тогда
		//Отказ=Истина;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("IDСтроки", Элементы.УслугиОбъектов.ТекущиеДанные.IDСтроки);
		ПараметрыОтбора.Вставить("Услуга", Элементы.УслугиОбъектов.ТекущиеДанные.Услуга);

		НайденныеСтроки = Объект.УслугиОбъектов.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()> 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По услуге "+ Элементы.УслугиОбъектов.ТекущиеДанные.Услуга + " уже введена нагрузка");
			//Объект.УслугиОбъектов.Удалить(Элементы.УслугиОбъектов.ТекущаяСтрока);
			
			ИдентификаторСтроки = Элементы.УслугиОбъектов.ТекущаяСтрока;
			ЭлементКоллекции = Объект.УслугиОбъектов.НайтиПоИдентификатору(ИдентификаторСтроки);
			ИндексЭлементаКоллекции = Объект.УслугиОбъектов.Индекс(ЭлементКоллекции);
			Объект.УслугиОбъектов.Удалить(ИндексЭлементаКоллекции);
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеУслуги = Элементы.УслугиОбъектов.ТекущиеДанные;
	Если ТекДанныеУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанныеУслуги.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"УслугиОбъектов");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиСезонныеНагрузки

&НаКлиенте
Процедура СезонныеНагрузкиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.СезонныеНагрузки.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СезонныеНагрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеУслуги = Элементы.СезонныеНагрузки.ТекущиеДанные;
	Если ТекДанныеУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанныеУслуги.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура СезонныеНагрузкиУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаВидКанальностиПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомКанальности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомКанальности }
	
	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ВидКанальности);
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	// энргРаботаСПоставщиками {
	бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСПоставщиками } 
	
	УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	СоответствиеЗначенияПоУмолчанию = Новый Соответствие;
	СоответствиеЗначенияПоУмолчанию.Вставить("Договор", Объект.Договор);
	
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги,"ДоговорыСоставныхУслуг",СоответствиеЗначенияПоУмолчанию);
	УстановитьУсловноеОФормлениеФормыКлиент("Договор","ПараметрыДоговоров");
	
	Если ИспользоватьШкалыПриборовУчета Тогда
		СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
		бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("IDСтроки", 		Элементы.ТочкиУчета.ТекущиеДанные.IDСтроки);
	ПроверкаУдаленияСтроки(ДопПараметры);	
	
	
	
	//ИмяТаблицыТочек 						= "ТочкиУчета"; 	
	//ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	//// энргРаботаСПоставщиками {
	//энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	//// энргРаботаСПоставщиками }
	//
	//// энргРаботаСоСпособамиРасчетаНорматива {
	//бестРаботаСоСпособомРасчетаНормативаКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	//// энргРаботаСоСпособамиРасчетаНорматива }
	//
	//энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ТекущиеДанные.IDСтроки,Объект);
	//
КонецПроцедуры  

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтрокиВладельца = ТекДанные.IDСтроки;
	
	ТочкиУчетаПриИзмененииСервер(ТекДанные.IDСтроки, ТекДанные.МКД);

КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаПриИзмененииСервер(IDСтроки, МКД)	
	бестРаботаСТочкамиУчетаНПСервер.ОбновитьГруппыПотребителейУслуги(ЭтотОбъект, IDСтроки,МКД);	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСпособРасчетаНормативаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");
	//бестРаботаСоСпособомРасчетаНормативаКлиент.СпособРасчетаНормативаАвтоПодбор(ЭтаФорма,ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСпособРасчетаНормативаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныНачалоДействияКоммерскогоУчета1ПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
		энргРаботаСТочкамиУчетаКлиент.ПриИзмененииДатДействияКоммерческогоУчета(ТекущиеДанные, "НачалоДействияКоммерскогоУчета");
	КонецЕсли;
	
	ПроставитьДатыКомУчетаДляПУ(ТекущиеДанные.IDСтроки, ТекущиеДанные.НачалоДействияКоммерскогоУчета, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныКонецДействияКоммерскогоУчета1ПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
		
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	//	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииДатДействияКоммерческогоУчета(ТекущиеДанные, "КонецДействияКоммерскогоУчета");
	//КонецЕсли;
	ПроставитьДатыКомУчетаДляПУ(ТекущиеДанные.IDСтроки, ТекущиеДанные.КонецДействияКоммерскогоУчета, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета"].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.СредстваИзмерения 		= "Не заполнены";
		ТекущиеДанные.ТехническиеСвойстваТУ		= "Не заполнены";
	КонецЕсли;
	
	Если Копирование Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета"].ТекущиеДанные;
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.ВидДифференцированности   = Неопределено;
		ТекущиеДанные.ВидКанальности            = Неопределено;
		ТекущиеДанные.ВидДифференцированности   = Неопределено;
		ТекущиеДанные.ДатаВыпуска               = Неопределено;
		ТекущиеДанные.ДатаПоверкиСчетчика       = Неопределено;
		ТекущиеДанные.ДатаУстановкиПломбы       = Неопределено;
		ТекущиеДанные.ЗаводскойНомер            = "";
		ТекущиеДанные.КонецДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.КоэффициентПУ             = 1;
		ТекущиеДанные.НаименованиеТочки         = "";
		ТекущиеДанные.НачалоДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.НетТехническойВозможностиУстановкиПУ = Ложь;
		ТекущиеДанные.НомерПломбы               = "";
		ТекущиеДанные.ОписаниеПрибора 			= "";
		ТекущиеДанные.ОписаниеТочки 			= "";
		ТекущиеДанные.ПриборУчета               = "";
		ТекущиеДанные.Расположение              = Неопределено;
		ТекущиеДанные.ТекущиеПоказания          = 0;
		ТекущиеДанные.ТочкаУчета                = Неопределено;
		ТекущиеДанные.УзелУчета                 = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТипУзлаУчета1ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;		
	Если ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		Если не ЗначениеЗаполнено(ТекущиеДанные.ВладелецУзлаУчета) Тогда
			ТекущиеДанные.ВладелецУзлаУчета = Объект.Контрагент;
		КонецЕсли;
	Иначе		
		ТекущиеДанные.ВладелецУзлаУчета = ПредопределенноеЗначение("Справочник.энргКонтрагенты.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект, "ЮЛ");
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения);
	ИначеЕсли Поле.Имя = "ТочкиУчетаТехническиеСвойстваТУ" Тогда
		ОткрытьФормуТехническихСвойствТУ();	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиУслугиРаспределенияПотерь

&НаКлиенте
Процедура УслугиРаспределенияПотерьПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.УслугиРаспределенияПотерь.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.РаспределениеПотерь, "IDСтроки", ТекДанные.IDСтроки);

	
КонецПроцедуры

&НаКлиенте
Процедура УслугиРаспределенияПотерьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеУслугиПотерь = Элементы.УслугиРаспределенияПотерь.ТекущиеДанные;
	Если ТекДанныеУслугиПотерь = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеУслугиПотерь.IDСтрокиВладельца = ТекДанные.IDСтроки;

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТарифныеКатегорииУслуги

&НаКлиенте
Процедура ТарифныеКатегорииУслугиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеТарифныеКатегории = Элементы.ТарифныеКатегорииУслуги.ТекущиеДанные;
	Если ТекДанныеТарифныеКатегории = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеТарифныеКатегории.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура ТарифныеКатегорииУслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПотребителиГВС

&НаКлиенте
Процедура ПотребителиГВСПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители = Элементы.ПотребителиГВС.ТекущиеДанные;
	Если ТекДанныеПотребители = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители.IDСтроки = ТекДанные.IDСтроки;
	Если Не ЗначениеЗаполнено(ТекДанныеПотребители.ТипНормы) Тогда
		ТекДанныеПотребители.ТипНормы = ПредопределенноеЗначение("Перечисление.бестВидыПериодов.Сутки");	
	КонецЕсли;
	Если ТекДанныеПотребители.КоличествоРабочихЧасовВДень = 0 Тогда
		ТекДанныеПотребители.КоличествоРабочихЧасовВДень = 24;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТемпературныеГрафикиОбъектов

&НаКлиенте
Процедура ТемпературныеГрафикиОбъектовПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители = Элементы.ТемпературныеГрафикиОбъектов.ТекущиеДанные;
	Если ТекДанныеПотребители = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиМаксимальныеНагрузки

&НаКлиенте
Процедура МаксимальныеНагрузкиНагрузкаПриИзменении(Элемент)
	ТекСтрока = Элементы.МаксимальныеНагрузки.ТекущиеДанные;
	Если Объект.УслугиОбъектов.Количество() > 0 Тогда
		ПроверкаЗначенияНагрузки("УслугиОбъектов", "Нагрузки",ТекСтрока.Услуга, ТекСтрока.Нагрузка, ТекСтрока.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныеНагрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители = Элементы.МаксимальныеНагрузки.ТекущиеДанные;
	Если ТекДанныеПотребители = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныеНагрузкиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиМаксимальныеНагрузки

&НаКлиенте
Процедура УслугиРаспределенияПотерьПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"УслугиРаспределенияПотерь");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура РаспределитьПотериНаСервере()
	
	Объект.ОбъемыРаспределенияПотерь.Очистить();
	
	Для Каждого Стр Из Объект.УслугиРаспределенияПотерь Цикл
		
		СтрокаПотери  					= Объект.ОбъемыРаспределенияПотерь.Добавить();
		
		ОбъемПотерьПоМесяцам = бестРаботаСОбъектамиНПСервер.РаспределенныеЗначенияПотерь(Объект.Район,объект.Организация, Стр.Год, Стр.ГодовойОбъемПотерь, Стр.СпособРаспределенияПотерь);
		
		Для Каждого МесячныйОбъем ИЗ ОбъемПотерьПоМесяцам Цикл
			
			СтрокаПотери[МесячныйОбъем.Ключ] = МесячныйОбъем.Значение;
			
		КонецЦикла;
		
		СтрокаПотери.IDСтроки =  Стр.IDСтроки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслугДляВыбора(IDСтрокиОбъекта)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтрокиВладельца", IDСтрокиОбъекта);
	НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	СписокУслуг = Новый СписокЗначений;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		СписокУслуг.Добавить(Стр.Услуга);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)";
	
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаКлиенте
Процедура СуммаПоКварталу()
	ТекСтрока 				= Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если НЕ ТекСтрока		= Неопределено ТОгда
		ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
		ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
		ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
		ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
		//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
		
		ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
		ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
		ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтруктуруОбязательныхРеквизитов(Структура)
	Структура.Вставить("Район", 		Объект.Район);
	Структура.Вставить("Организация", 	Объект.Организация);	
	Структура.Вставить("Договор", 		Объект.Договор);
	Структура.Вставить("Контрагент", 	Объект.Контрагент);
КонецПроцедуры

&НаСервере
Процедура ПолучитьМассивТЧ(Структура)
	Структура.Вставить("ОбъектыРасчета",				Объект.ОбъектыРасчета);
	Структура.Вставить("Услуги",						Объект.ТочкиУчета);

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Если ДополнительныеПараметры.ТЧ = "ОбъектыРасчета" Тогда
				УдалитьСвязанныеСОбъектомСтроки(ДополнительныеПараметры.IDСтроки);
			ИначеЕсли ДополнительныеПараметры.ТЧ = "ТочкиУчета" Тогда
				ТаблицыФормы	= Новый Массив;
				ТаблицыФормы.Добавить("ПоказанияПриборовУчета");
				ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
				ТаблицыФормы.Добавить("ШкалыПриборовУчета"); 
				ТаблицыФормы.Добавить("ШкалыИзмерителей");
				ТаблицыФормы.Добавить("НомераПломб");
				ТаблицыФормы.Добавить("Измерители"); 
				энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.IDСтроки, Объект, ТаблицыФормы,"ТочкиУчета");
				
				
				ТаблицыФормы	= Новый Массив;
				ТаблицыФормы.Добавить("ОбъемыРаспределенияПотерь");
				ТаблицыФормы.Добавить("ПоставщикиСоставныхУслуг");
				
				
				энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.IDСтроки, Объект, ТаблицыФормы);
				
				ТочкиУчетаПриИзмененииСервер(ДополнительныеПараметры.IDСтроки, Неопределено);
			ИначеЕсли ДополнительныеПараметры.ТЧ = "УслугиРаспределенияПотерь" Тогда
				
				ТаблицыФормы				= Новый Массив;	
				ТаблицыФормы.Добавить("ОбъемыРаспределенияПотерь");
				
				энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
			КонецЕсли;
			УдалитьСтроку(ДополнительныеПараметры);
			
			Если ДополнительныеПараметры.ТЧ = "ОбъектыРасчета" ИЛИ ДополнительныеПараметры.ТЧ = "ТочкиУчета" Тогда
				
				ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
				Если ТекДанные = Неопределено Тогда
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				
				ТочкиУчетаПриИзмененииСервер(ТекДанные.IDСтроки, ТекДанные.МКД);
			КонецЕсли;
			ДоступностьТЧТУ();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаСервере
Процедура ПроверкаДублированияНаименованийОбъектовРасчета(Отказ)
	МассивОбъектовРасчета = Новый ТаблицаЗначений;
	МассивОбъектовРасчета.Колонки.Добавить("НаименованиеОбъектаРасчета");
	МассивОбъектовРасчета.Колонки.Добавить("АдресОбъекта");
	Для каждого стр из Объект.ОбъектыРасчета Цикл
		Отбор		= Новый Структура("НаименованиеОбъектаРасчета, АдресОбъекта", стр.НаименованиеОбъектаРасчета, стр.АдресОбъекта);
		ИщемСтроки 	= МассивОбъектовРасчета.НайтиСтроки(ОТбор);
		Если ИщемСтроки.Количество()> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В ТЧ 'Объекты расчета' обнаружено несколько объектов с наименованием '" + стр.НаименованиеОбъектаРасчета + "' и адресом: " + стр.АдресОбъекта + "! Необходимо переименовать объект расчета");
			Отказ = Истина;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(МассивОбъектовРасчета.Добавить(), Отбор);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеКварталов() 
	
	ОбновитьСуммуПоКварталу();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКанальности) тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.ВидКанальности = ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры
		
// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер(НеПерезаполнятьОбъекты)
	
	Если Не Объект.Договор.ТипДоговора = ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.УправляющаяКомпания") Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ НеПерезаполнятьОбъекты Тогда
		Объект.ОбъектыРасчета.Очистить();
	КонецЕсли;
	Объект.ТочкиУчета.Очистить();
	Объект.ПоставщикиСоставныхУслуг.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ШкалыУслуг.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ПриборыУзловУчета.Очистить();
	Объект.ТарифныеКатегорииУслуги.Очистить();
	
	Результат 									= ПолучитьОбъектыРасчетаУправляющейКомпании(Объект.Дата,Объект.Организация,Объект.Район,Объект.Контрагент,Объект.Договор);
	Выборка  									= Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл		
		Если НеПерезаполнятьОбъекты Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("МКД", Выборка.МКД);
			НайденныеСтроки = Объект.ОбъектыРасчета.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НовСтр = НайденныеСтроки[0];
			Иначе
				НовСтр = Объект.ОбъектыРасчета.Добавить();
				НовСтр.МКД							= Выборка.МКД;
				НовСтр.ГруппаОбъектовРасчета		= Выборка.ГруппаПотребителейПоУмолчанию;
				НовСтр.НаименованиеОбъектаРасчета	= Выборка.МКД;
				НовСтр.Площадь						= Выборка.Площадь;
				НовСтр.IDСтроки						= Новый УникальныйИдентификатор;
			КонецЕсли;
		Иначе
			НовСтр = Объект.ОбъектыРасчета.Добавить();
			НовСтр.МКД							= Выборка.МКД;
			НовСтр.ГруппаОбъектовРасчета		= Выборка.ГруппаПотребителейПоУмолчанию;
			НовСтр.НаименованиеОбъектаРасчета	= Выборка.МКД;
			НовСтр.Площадь						= Выборка.Площадь;
			НовСтр.IDСтроки						= Новый УникальныйИдентификатор;
		КонецЕсли;
		
		НовСтр.ОбъектУК						= Истина;
		//ЗаполнитьУслугиМКД(НовСтр.МКД,НовСтр.IDСтроки);
		
		ЗаполнитьТочками(НовСтр.МКД,НовСтр.IDСтроки);
		
		энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация, Объект.Район,НовСтр.МКД,Ложь);
		
		бестРаботаСТочкамиУчетаНПСервер.ОбновитьГруппыПотребителейУслуги(ЭтотОбъект, НовСтр.IDСтроки,НовСтр.МКД);
	КонецЦикла;
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьОписаниеОбъекта(СтруктураОбъекта)
	Запись  									= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	Запись.ЗаписатьНачалоОбъекта();
	
	Запись.ЗаписатьИмяСвойства("Наименование");
	Запись.ЗаписатьЗначение(СтруктураОбъекта.НаименованиеОбъектаРасчета);
	Запись.ЗаписатьИмяСвойства("НазначениеНП");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.НазначениеНП.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("ГруппаОбъектовРасчета");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.ГруппаОбъектовРасчета.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("КатегорияОбъекта");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.КатегорияОбъекта.УникальныйИдентификатор());			
	Запись.ЗаписатьИмяСвойства("МКД");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.МКД.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("Контролер");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.Контролер.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("Организация");
	Запись.ЗаписатьЗначение("" + СтруктураОбъекта.Организация.УникальныйИдентификатор());
	Запись.ЗаписатьИмяСвойства("АдресОбъекта");
	Запись.ЗаписатьЗначение(?(ЗначениеЗаполнено(СтруктураОбъекта.АдресОбъекта), СтруктураОбъекта.АдресОбъекта,""));
	Запись.ЗаписатьИмяСвойства("АдресОбъектаЗначение");
	Запись.ЗаписатьЗначение(?(ЗначениеЗаполнено(СтруктураОбъекта.АдресОбъектаЗначение), СтруктураОбъекта.АдресОбъектаЗначение,""));
	
	Запись.ЗаписатьКонецОбъекта();
	Возврат Запись.Закрыть();	
	
КонецФункции

&НаКлиенте
Процедура ИзменитьМаксимальнуюНагрузку(ДополнительныеПараметры)
	Если ДополнительныеПараметры.Изменяем Тогда
		Если Не ДополнительныеПараметры.ТекСумма = Неопределено Тогда
			НоваяСТрока = ДополнительныеПараметры.ИщемСтроку[0];
		Иначе
			НоваяСтрока = Объект.МаксимальныеНагрузки.Добавить();
		КонецЕсли;
		
		НоваяСтрока.IDСтроки 	= ДополнительныеПараметры.IDСтроки;
		НоваяСтрока.Услуга 		= ДополнительныеПараметры.Услуга;
		НоваяСтрока.Нагрузка 	= ДополнительныеПараметры.ТекНагрузка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная нагрузка добавлена в ТЧ '" + ДополнительныеПараметры.ИмяТЧСиноним + "'! Скорректируйте значение в ТЧ '" + ДополнительныеПараметры.ИмяТЧСиноним + "', если необходимо!");	
	Иначе
		Если ДополнительныеПараметры.ИщемСтроку <> Неопределено Тогда
			ИзменяемаяСтрока = Объект.УслугиОбъектов[ДополнительныеПараметры.ТекНомерСтроки - 1];
			ИзменяемаяСтрока.Нагрузка =  ДополнительныеПараметры.ИщемСтроку[0].Нагрузка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗначенияНагрузки(ИмяТЧ, ИмяТЧСиноним,ТекУслуга, ТекНагрузка, ТекIDСтроки)
	Отбор 		= Новый Структура("IDСтроки, Услуга", ТекIDСтроки, ТекУслуга);
	ИщемСтроку	= Объект[ИмяТЧ].НайтиСтроки(Отбор);
	Если ИщемСтроку.Количество() > 0 Тогда
		ТекСумма= ИщемСтроку[0].Нагрузка;
	КонецЕсли;
	Если ТекСумма > ТекНагрузка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Максимальная нагрузка не может быть меньше нагрузки в ТЧ '" + ИмяТЧСиноним + "'! Необходимо скорректировать нагрузку!");
		ТекНагрузка	= ТекСумма; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеИтоговДоговорныхИтогов(Команда)
	ИтогиПоДоговору = Не ИтогиПоДоговору;
	ОбновитьЗаголовокКнопкиПереключенияИтогов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКнопкиПереключенияИтогов()
	Если ИтогиПоДоговору Тогда
		Элементы.ПереключениеИтоговДоговорныхИтогов.Заголовок = "Показать итоги по объекту";
		Элементы.ИтогиДоговорныхОбъемовПоДоговору.Видимость = Истина;
		Элементы.ИтогиДоговорныхОбъемов.Видимость = ложь;
	Иначе	
		Элементы.ПереключениеИтоговДоговорныхИтогов.Заголовок = "Показать итоги по договору";
		Элементы.ИтогиДоговорныхОбъемовПоДоговору.Видимость = Ложь;
		Элементы.ИтогиДоговорныхОбъемов.Видимость = Истина;
	КонецЕсли;	              
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДоговорныхОбъемов()
	ТЧ				= Объект.ГарантированныеОбъемы;
	ТЗ				= ИтогиДоговорныхОбъемов.Выгрузить();
	ТЗ.Очистить(); 
	Для каждого стр из ТЧ Цикл
		НовСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, стр);
		НовСтрока.ЕдиницаИзмерения = стр.Услуга.ЕдиницаИзмерения;
		НовСтрока.ИтогПервыйКвартал = стр.Январь + стр.Февраль + стр.Март;
		НовСтрока.ИтогВторойКвартал = стр.Апрель + стр.Май + стр.Июнь;
		НовСтрока.ИтогТретийКвартал = стр.Июль + стр.Август + стр.Сентябрь;
		НовСтрока.ИтогГод = стр.Январь + стр.Февраль + стр.Март + стр.Апрель + стр.Май + стр.Июнь + стр.Июль + стр.Август + стр.Сентябрь 
						+ стр.Октябрь + стр.Ноябрь + стр.Декабрь;
	КонецЦикла;
	ТЗ.Свернуть("IDСтроки, ЕдиницаИзмерения", "Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь, ИтогПервыйКвартал, ИтогВторойКвартал, ИтогТретийКвартал, ИтогГод");
	ИтогиДоговорныхОбъемов.Загрузить(ТЗ);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДоговорныхОбъемовПоДоговору()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь) КАК Январь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль) КАК Февраль,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март) КАК Март,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель) КАК Апрель,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май) КАК Май,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь) КАК Июнь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль) КАК Июль,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август) КАК Август,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь) КАК Сентябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь) КАК Октябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь) КАК Ноябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь) КАК Декабрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь) КАК ИтогГод,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март) КАК ИтогПервыйКвартал,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь) КАК ИтогВторойКвартал,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь) КАК ИтогТретийКвартал
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга.ЕдиницаИзмерения";
	
	Результат = Запрос.Выполнить();
	Выгрузка	= Результат.Выгрузить();

	ИтогиДоговорныхОбъемовПоДоговору.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуПоКварталу()
	Для каждого ТекСтрока из Объект.ГарантированныеОбъемы Цикл
		ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
		ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
		ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
		ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
		//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
		
		ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
		ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
		ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НастройкаВидимости()
	ДоговорнаяДеятельность = ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ДокументОснование.Видимость = ДоговорнаяДеятельность;
КонецПроцедуры

&НаСервере
Процедура ПроставитьДатыКомУчетаДляПУ(IDСтрокиТУ, ДатаКомУчета, ЭтоНачалоКомУчета)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтрокиТУ);
	НайденныеСтроки = Объект.ПриборыУзловУчета.НайтиСтроки(ПараметрыОтбора);
	Для каждого стр из НайденныеСтроки Цикл
		Если ЭтоНачалоКомУчета Тогда
			стр.НачалоДействияКоммерскогоУчета = ДатаКомУчета;
		Иначе
			стр.КонецДействияКоммерскогоУчета = ДатаКомУчета;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвязанныеСОбъектомСтроки(IDСтроки)
	ТаблицыФормы = Новый Массив;	
	ТаблицыФормы.Добавить("УслугиОбъектов");
	ТаблицыФормы.Добавить("СезонныеНагрузки");
	ТаблицыФормы.Добавить("ПотребителиГВС");
	ТаблицыФормы.Добавить("ГарантированныеОбъемы");
	ТаблицыФормы.Добавить("ТемпературныеГрафикиОбъектов");
	ТаблицыФормы.Добавить("УслугиРаспределенияПотерь");
	ТаблицыФормы.Добавить("ТарифныеКатегорииУслуги");
	
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы);
	
	СтруктураПоиска  				= Новый Структура("IDСтрокиВладельца", IDСтроки);
	Коллекция  					= Объект["ТочкиУчета"];
	Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ПоказанияПриборовУчета");
	Для Каждого УдаляемаяСтрока из Строки Цикл
		энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(УдаляемаяСтрока.IDСтроки, Объект, ТаблицыФормы,"ТочкиУчета");
	КонецЦикла;	
	ТаблицыФормы.Очистить();
	ТаблицыФормы.Добавить("ТочкиУчета");
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ОбъемыРаспределенияПотерь");
	
	ТаблицыФормыВторогоУровня.Добавить("ПоставщикиСоставныхУслуг");
	ТаблицыФормыВторогоУровня.Добавить("ШкалыПриборовУчета");
	ТаблицыФормыВторогоУровня.Добавить("ШкалыУслуг");
	ТаблицыФормыВторогоУровня.Добавить("ПриборыУзловУчета");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы,"Владельца", ТаблицыФормыВторогоУровня);
	
	
	ТаблицыФормы.Очистить();
	ТаблицыФормыВторогоУровня.Очистить();
	ТаблицыФормы.Добавить("ДополнительныеНачисленияТУ");
	ТаблицыФормыВторогоУровня.Добавить("ДополнительныеНачисленияЗначения");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы,"Владельца", ТаблицыФормыВторогоУровня);
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресМКД(пМКД,ВидКИ)
	 Возврат УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(пМКД,ВидКИ);
КонецФункции

&НаКлиенте
Процедура ИнформацияОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);
	ТекущиеДанные.ДополнительнаяИнформация 		= бестРаботаСОбъектамиНПСервер.ЗаполнитьТекстИнформацииОбъекта(Результат);
КонецПроцедуры

&НаСервере
Процедура ДоступностьТЧТУ()
	Элементы.ТочкиУчета.ТолькоПросмотр 			  = Объект.ОбъектыРасчета.Количество() = 0;
	Элементы.ГарантированныеОбъемы.ТолькоПросмотр = Объект.ОбъектыРасчета.Количество() = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОбъектаРасчета(ТекДанные)

	Если ЗначениеЗаполнено(ТекДанные.ОбъектРасчета) Тогда
		
		ТекСтрока 	= 	ТекДанные.ПолучитьИдентификатор();
		Отбор		= 	Новый Структура("ОбъектРасчета", ТекДанные.ОбъектРасчета);
		ИщемСтроки	=	Объект.ОбъектыРасчета.НайтиСтроки(Отбор);
		Если ИщемСтроки.Количество()>1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные по объекту расчета " + ТекДанные.ОбъектРасчета + " уже введены. Строка не будет добавлена");
			Объект.ОбъектыРасчета.Удалить(ТекДанные.НомерСтроки-1);
			Возврат;
		КонецЕсли;		
		
		Если ТекОбъектРасчета = ТекДанные.ОбъектРасчета Тогда
			ДанныеОбъекта = бестРаботаСОбъектамиНПСервер.ПолучитьИнформациюПоОбъекту(ТекДанные.ОбъектРасчета);
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеОбъекта.СтруктураОбъекта);
			ТекДанные.ОписаниеОбъекта = ЗаписатьОписаниеОбъекта(ДанныеОбъекта.СтруктураОбъекта);
		Иначе	
			// Ищем строки по индентификатору
			ТаблицыФормы				= Новый Массив;	
			ТаблицыФормы.Добавить("УслугиОбъектов");
			ТаблицыФормы.Добавить("СезонныеНагрузки");
			ТаблицыФормы.Добавить("ПотребителиГВС");
			ТаблицыФормы.Добавить("ГарантированныеОбъемы");
			ТаблицыФормы.Добавить("УслугиРаспределенияПотерь");
			ТаблицыФормы.Добавить("ТарифныеКатегорииУслуги");

			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
			
			ТаблицыФормы				= Новый Массив;	
			ТаблицыФормы.Добавить("ТочкиУчета");
			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "Владельца");
				
			ДанныеОбъекта = бестРаботаСОбъектамиНПСервер.ПолучитьИнформациюПоОбъекту(ТекДанные.ОбъектРасчета);
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеОбъекта.СтруктураОбъекта);
			
			СоответствиеНагрузок = ДанныеОбъекта.СоответствиеНагрузок;
			Для Каждого ТекНагрузка Из СоответствиеНагрузок Цикл
				НовСтрока = Объект.УслугиОбъектов.Добавить();
				НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
				НовСтрока.Услуга	= ТекНагрузка.Ключ;
				НовСтрока.Нагрузка	= ТекНагрузка.Значение;
			КонецЦикла;
			
			СоответствиеПотребителей = ДанныеОбъекта.СоответствиеПотребителей;
			Для Каждого ТекПотребитель Из СоответствиеПотребителей Цикл
				НовСтрока = Объект.ПотребителиГВС.Добавить();
				НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
				НовСтрока.Тип	= ТекПотребитель.Ключ;
				ЗаполнитьЗначенияСвойств(НовСтрока, ТекПотребитель.Значение);
			КонецЦикла;
			
			МассивОбъемов = ДанныеОбъекта.МассивОбъемов;
			Для Каждого ТекОбъем Из МассивОбъемов Цикл
				НовСтрока = Объект.ГарантированныеОбъемы.Добавить();
				НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
				ЗаполнитьЗначенияСвойств(НовСтрока, ТекОбъем);
			КонецЦикла;
		КонецЕсли;
		ОбновитьДанныеОбъектаРасчетаПереопределяемый(ТекДанные);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервереПереопределяемый(ТекущийОбъект);
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОбъектаРасчетаПереопределяемый(ТекДанные);
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

#Область ЗАПОЛНИТЬ_УК

Процедура ЗаполнитьТочками(МКД,IDСтрокиВладельца)
	
	Результат 									= энргРаботаСприборамиУчетаСервер.ПриборыВсехТочекУчетаМКД(Объект.Дата,Объект.Организация,Объект.Район,МКД);
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	//ПоставщикПоУмолчанию	= ЭтаФорма.ПараметрыПоставщиков.ПоставщикПоУмолчанию;
	Пока Выборка.следующий() цикл		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда 			
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
			СтрокаТочкиУчета.IDСтрокиВладельца	= IDСтрокиВладельца;
			//СтрокаТочкиУчета.Поставщик			= ПоставщикПоУмолчанию;
			СтрокаТочкиУчета.Расположение		= Выборка.ТочкаУчета.Расположение;
			СтрокаТочкиУчета.СтруктураСети		= Выборка.СтруктураСети;
			СтрокаТочкиУчета.Головная			= Выборка.ТочкаУчета.Головная;
			СтрокаТочкиУчета.ОбъектУК			= Истина;
			Если ЗначениеЗаполнено( Выборка.УзелУчета) Тогда
				СтрокаТочкиУчета.ТипУзлаУчета		= Выборка.УзелУчета.ТипУзлаУчета;
			КонецЕсли;
						
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) и НЕ ТекПрибор = Выборка.ПриборУчета Тогда 			
			
			СтрокаПриборов  					= Объект.ПриборыУзловУчета.Добавить();
			IDСтрокиШкалы						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаПриборов, Выборка);
			СтрокаПриборов.IDСтроки 			= IDСтрокиТочки;
			СтрокаПриборов.IDСтрокиШкалы 		= IDСтрокиШкалы;		
			
			ЗаполнитьДанныеПрибора(СтрокаПриборов,Выборка.ПриборУчета,МКД);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда //НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиТарифнаяЗона				= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.IDСтрокиТарифнаяЗона 	= IDСтрокиТарифнаяЗона;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидПараметра 			= Выборка.ВидПараметра;			
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтрокиТочкиУчета		= IDСтрокиТочки;
			СтрокаПоказаний.IDСтроки 				= IDСтрокиТарифнаяЗона;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли; 		
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекПрибор 								= Выборка.ПриборУчета;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанныеПрибора(ТекСтрока, ПриборУчета, МКД)
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета.Код КАК ЗаводскойНомер,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета.ТипПрибораУчета КАК ТипПрибораУчета,
	|	энргДатыПоверкиПрибораУчетаСрезПоследних.ПериодРегистрации КАК ДатаВыпуска,
	|	энргДатыПоверкиПрибораУчетаСрезПоследних.ДатаПоверки КАК ДатаПоверкиСчетчика,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.НомерПломбы КАК НомерПломбы,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.Период КАК ДатаУстановкиПломбы,
	|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.КонецПериодаКоммерскогоУчета КАК КонецДействияКоммерскогоУчета
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПриборУчета = &ПриборУчета) КАК энргСостояниеПриборовУзловУчетаМКДСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДатыПоверкиПрибораУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И КлючПомещения = &МКД
	|					И ПриборУчета = &ПриборУчета) КАК энргДатыПоверкиПрибораУчетаСрезПоследних
	|		ПО энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета = энргДатыПоверкиПрибораУчетаСрезПоследних.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНомерПломбПриборовУчетаМКД.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &МКД
	|					И ПриборУчета = &ПриборУчета) КАК энргНомерПломбПриборовУчетаМКДСрезПоследних
	|		ПО энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета = энргНомерПломбПриборовУчетаМКДСрезПоследних.ПриборУчета,
	|	РегистрСведений.энргДопускПриборовУчетаККоммерческомуУчетуМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПриборУчета = &ПриборУчета) КАК энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Запрос.УстановитьПараметр("МКД"				, МКД);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("Период"			, Новый Граница(Объект.Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район"			, Объект.Район);
	Запрос.УстановитьПараметр("ПриборУчета"		, ПриборУчета);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	ВыборкаТочкиУчета	= РезультатЗапроса.Выбрать();
	Пока  ВыборкаТочкиУчета.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТекСтрока, ВыборкаТочкиУчета);
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьТипДоговора()
	Возврат Объект.Договор.ТипДоговора;
КонецФункции

&НаСервере
Процедура ЗаполнитьПоставщика()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПоставщикиУслугМКДСрезПоследних.МКД КАК МКД,
		|	энргПоставщикиУслугМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргПоставщикиУслугМКДСрезПоследних.Услуга КАК Услуга,
		|	энргПоставщикиУслугМКДСрезПоследних.ЧастьСоставной КАК ЧастьСоставной,
		|	энргПоставщикиУслугМКДСрезПоследних.Поставщик КАК Поставщик
		|ИЗ
		|	РегистрСведений.энргПоставщикиУслугМКД.СрезПоследних(&Дата, МКД в (&МКД)) КАК энргПоставщикиУслугМКДСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("МКД"	, Объект.ОбъектыРасчета.Выгрузить(,"МКД"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица			 = РезультатЗапроса.Выгрузить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	Для каждого стр из Объект.ПоставщикиСоставныхУслуг Цикл
		СтрокиТУ = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки",стр.IDСтроки));
		Если СтрокиТУ.Количество() > 0 Тогда
			СтрокиПоставщиков = Таблица.НайтиСтроки(Новый Структура("ТочкаУчета,Услуга", СтрокиТУ[0].ТочкаУчета,стр.ЧастьСоставнойУслуги));
			Если СтрокиПоставщиков.Количество() > 0 Тогда
				стр.Поставщик = СтрокиПоставщиков[0].Поставщик;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	СтрокиНеСоставныхУслуг = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("ЭтоСоставнаяУслуга",Ложь));
	Для каждого стр из СтрокиНеСоставныхУслуг Цикл
		СтрокаПоставщиков = Таблица.НайтиСтроки(Новый Структура("ТочкаУчета,Услуга", стр.ТочкаУчета,стр.Услуга));
		Если СтрокаПоставщиков.Количество() > 0 Тогда
			стр.Поставщик = СтрокаПоставщиков[0].Поставщик;
		КонецЕсли;
	КонецЦикла;
	//СтрокиПоставщиков = Объект.ПоставщикиСоставныхУслуг.НайтиСтроки(Новый Структура("IDСтроки",ТекСтрока.IDСтроки));
	//Для Каждого СтрокаПоставщика Из СтрокиПоставщиков Цикл
	//	МассивСтрок =  Таблица.НайтиСтроки(Новый Структура("ТочкаУчета,",ТекСтрока.IDСтроки));
	//	
	//КонецЦикла;
	//
	//Поставщик = Константы.энргПоставщикПоУмолчанию.Получить();
	//Для Каждого СтрокаПоставщика Из Объект.ПоставщикиСоставныхУслуг Цикл
	//	СтрокаПоставщика.Поставщик = Поставщик;		
	//КонецЦикла;
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура РаспределитьПотери(Команда)
	РаспределитьПотериНаСервере();
КонецПроцедуры

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область РАБОТА_С_УЗЛАМИ

#Область ДОБАВЛЕНИЕ_ПУ_К_УЗЛАМ

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить тип узла учета!");
		Возврат;		
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

#КонецОбласти

#Область ПЕРЕОПРЕДЕЛЕННЫЕ_ПРОЦЕДУРЫ

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(бестРаботаСТочкамиУчетаНПСервер.ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= бестРаботаСТочкамиУчетаНПСервер.СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПриИзменении(Элемент)
	ДоступностьТЧТУ();
	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация,Объект.Контрагент,СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ТекТЧ	= Объект.НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов;
	НовТЗ   = Объект.ТочкиУчета.Выгрузить();
	НовТЗ.Свернуть("Услуга");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(объект.ДатаФактическогоСобытия), объект.ДатаФактическогоСобытия, объект.Дата));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Район",Объект.Район);
	Запрос.УстановитьПараметр("НовТЗ",НовТЗ);
	Запрос.Текст = "ВЫБРАТЬ
	|	НовТЗ.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	&НовТЗ КАК НовТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.Услуга КАК Услуга,
	|	ЕСТЬNULL(бестНастройкиФормированияАвансовыхСФПоУслугамСрезПоследних.Формировать, ЛОЖЬ) КАК Формировать
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкиФормированияАвансовыхСФПоУслугам.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестНастройкиФормированияАвансовыхСФПоУслугамСрезПоследних
	|		ПО ВрТ0.Услуга = бестНастройкиФормированияАвансовыхСФПоУслугамСрезПоследних.Услуга";
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	ТекТЧ.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентовПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Для каждого стр из Объект.ОбъектыРасчета Цикл
		ОповеститьОбИзменении(стр.ОбъектРасчета);		
	КонецЦикла;
	ОповеститьОбИзменении(Тип("СправочникСсылка.энргТочкиУчета"));
	
	ЗаполнитьДеревоПИР();
	
	ОбновитьСуммуПоКварталу();
	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорныеОбъемыНаСервере(ОчиститьТЧ = Ложь, IDСтроки)

	Если ОчиститьТЧ Тогда
		МассивУдвления = Объект.ГарантированныеОбъемы.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
		
		Для каждого СтрокаТЧ Из МассивУдвления Цикл
			Объект.ГарантированныеОбъемы.Удалить(СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СтрокаОбъекта = Объект.ОбъектыРасчета.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
	
	Запрос = Новый Запрос;
	МВТ  = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная КАК ТемператураОптимальная
		|ПОМЕСТИТЬ ВТ_ОптимальнаяТемпература
		|ИЗ
		|	РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КатегорияПомещения = &КатегорияПомещения) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература КАК ПроектнаяТемпература
		|ПОМЕСТИТЬ ВТ_ПроектнаяТемпература
		|ИЗ
		|	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеНагрузки.Услуга КАК Услуга,
		|	МаксимальныеНагрузки.Нагрузка КАК Нагрузка,
		|	МаксимальныеНагрузки.IDСтроки КАК IDСтроки
		|ПОМЕСТИТЬ ВТ_МаксимальныеНагрузки
		|ИЗ
		|	&МаксимальныеНагрузки КАК МаксимальныеНагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц КАК ПорядокМесяц,
		|	бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.РасчетТепловойЭнергии КАК РасчетТепловойЭнергии,
		|	бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.КоличествоДней КАК КоличествоДней,
		|	ВЫБОР
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 1
		|			ТОГДА ""Январь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 2
		|			ТОГДА ""Февраль""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 3
		|			ТОГДА ""Март""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 4
		|			ТОГДА ""Апрель""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 5
		|			ТОГДА ""Май""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 6
		|			ТОГДА ""Июнь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 7
		|			ТОГДА ""Июль""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 8
		|			ТОГДА ""Август""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 9
		|			ТОГДА ""Сентябрь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 10
		|			ТОГДА ""Октябрь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 11
		|			ТОГДА ""Ноябрь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 12
		|			ТОГДА ""Декабрь""
		|	КОНЕЦ КАК Месяц,
		|	ВЫБОР
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 3
		|			ТОГДА ""ГарантированныйОбъемИтогПервыйКвартал""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 6
		|			ТОГДА ""ГарантированныйОбъемИтогВторойКвартал""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 9
		|			ТОГДА ""ГарантированныйОбъемИтогТретийКвартал""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 12
		|			ТОГДА ""ГарантированныйОбъемИтогЧетвертыйКвартал""
		|	КОНЕЦ КАК Квартл
		|ПОМЕСТИТЬ ВТ_Месяцы
		|ИЗ
		|	РегистрСведений.бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВидыУслуг.Ссылка КАК Услуга,
		|	ВТ_МаксимальныеНагрузки.Нагрузка КАК Нагрузка,
		|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
		|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_Месяцы.Месяц КАК Месяц,
		|	ВТ_Месяцы.КоличествоДней КАК КоличествоДней,
		|	ВТ_Месяцы.ПорядокМесяц КАК ПорядокМесяц,
		|	ЕСТЬNULL(ВТ_ПроектнаяТемпература.ПроектнаяТемпература, 0) КАК ПроектнаяТемпература,
		|	ЕСТЬNULL(ВТ_ОптимальнаяТемпература.ТемператураОптимальная, 0) КАК ТемператураВнутриПомещения,
		|	24 КАК КоличествоЧасов,
		|	ВТ_Месяцы.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	ВТ_МаксимальныеНагрузки КАК ВТ_МаксимальныеНагрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Месяцы КАК ВТ_Месяцы
		|			ПО энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху = ВТ_Месяцы.РасчетТепловойЭнергии
		|		ПО ВТ_МаксимальныеНагрузки.Услуга = энргВидыУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОптимальнаяТемпература КАК ВТ_ОптимальнаяТемпература
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроектнаяТемпература КАК ВТ_ПроектнаяТемпература
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВТ_МаксимальныеНагрузки.IDСтроки = &IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(бестСредегодоваяРазницаТемпературДляДоговорныхОбъемовСрезПоследних.Температура) КАК Температура,
		|	ВТ_Месяцы.Месяц КАК Месяц,
		|	ВТ_Месяцы.ПорядокМесяц КАК ПорядокМесяц
		|ПОМЕСТИТЬ ВТ_СреднегодоваяРазница
		|ИЗ
		|	РегистрСведений.бестСредегодоваяРазницаТемпературДляДоговорныхОбъемов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестСредегодоваяРазницаТемпературДляДоговорныхОбъемовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Месяцы КАК ВТ_Месяцы
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Месяцы.Месяц,
		|	ВТ_Месяцы.ПорядокМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемовСрезПоследних.Температура) КАК Температура,
		|	ВТ_Месяцы.Месяц КАК Месяц,
		|	ВТ_Месяцы.ПорядокМесяц КАК ПорядокМесяц
		|ПОМЕСТИТЬ ВТ_СреднемесячнаяТемпература
		|ИЗ
		|	РегистрСведений.бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Месяцы КАК ВТ_Месяцы
		|		ПО (МЕСЯЦ(бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемовСрезПоследних.Месяц) = ВТ_Месяцы.ПорядокМесяц)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Месяцы.Месяц,
		|	ВТ_Месяцы.ПорядокМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.Услуга КАК Услуга,
		|	ВТ_Услуги.Месяц КАК Месяц,
		|	ВТ_Услуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
		|	ВТ_Услуги.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_Услуги.КоличествоДней КАК КоличествоДней,
		|	ВТ_СреднегодоваяРазница.Температура КАК СреднегодоваяРазница,
		|	ВТ_СреднемесячнаяТемпература.Температура КАК СреднемесячнаяТемпература,
		|	ВТ_Услуги.ПроектнаяТемпература КАК ПроектнаяТемпература,
		|	ВТ_Услуги.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
		|	ВТ_Услуги.КоличествоЧасов КАК КоличествоЧасов,
		|	ВТ_Услуги.Нагрузка КАК Нагрузка,
		|	ВТ_Услуги.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_Услуги.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_ДанныеРасчета
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СреднегодоваяРазница КАК ВТ_СреднегодоваяРазница
		|		ПО ВТ_Услуги.ПорядокМесяц = ВТ_СреднегодоваяРазница.ПорядокМесяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СреднемесячнаяТемпература КАК ВТ_СреднемесячнаяТемпература
		|		ПО ВТ_Услуги.ПорядокМесяц = ВТ_СреднемесячнаяТемпература.ПорядокМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеРасчета.Услуга КАК Услуга,
		|	ВТ_ДанныеРасчета.Месяц КАК Месяц,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеРасчета.СреднемесячнаяТемпература ЕСТЬ NULL
		|				ИЛИ ВТ_ДанныеРасчета.ПроектнаяТемпература = ВТ_ДанныеРасчета.ТемператураВнутриПомещения
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ДанныеРасчета.Нагрузка * ВТ_ДанныеРасчета.КоличествоДней * ВТ_ДанныеРасчета.КоличествоЧасов * (ВТ_ДанныеРасчета.ТемператураВнутриПомещения - ВТ_ДанныеРасчета.СреднемесячнаяТемпература) / (ВТ_ДанныеРасчета.ТемператураВнутриПомещения - ВТ_ДанныеРасчета.ПроектнаяТемпература)
		|	КОНЕЦ КАК Объем,
		|	NULL КАК ЗависитОтУслуги,
		|	NULL КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_ДанныеРасчета.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_ДанныеРасчета.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_ОбъемыБезОсновныхУслуг
		|ИЗ
		|	ВТ_ДанныеРасчета КАК ВТ_ДанныеРасчета
		|ГДЕ
		|	ВТ_ДанныеРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеРасчета.Услуга,
		|	ВТ_ДанныеРасчета.Месяц,
		|	ВТ_ДанныеРасчета.Нагрузка * ВТ_ДанныеРасчета.КоличествоДней * ВТ_ДанныеРасчета.КоличествоЧасов,
		|	ВТ_ДанныеРасчета.ЗависитОтУслуги,
		|	ВТ_ДанныеРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_ДанныеРасчета.ПорядокМесяц,
		|	ВТ_ДанныеРасчета.Квартл
		|ИЗ
		|	ВТ_ДанныеРасчета КАК ВТ_ДанныеРасчета
		|ГДЕ
		|	НЕ ВТ_ДанныеРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|	И ВТ_ДанныеРасчета.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ОбъемыБезОсновныхУслуг.Объем) КАК ОбъемПодчинённых,
		|	энргВидыУслуг.Ссылка КАК ОсновнаяУслуга,
		|	ВТ_ОбъемыБезОсновныхУслуг.Месяц КАК Месяц,
		|	ВТ_СреднегодоваяРазница.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_СреднегодоваяРазница.Температура КАК СреднегодоваяРазницаТемператур,
		|	ВТ_ОбъемыБезОсновныхУслуг.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_ОсновныеУслуги
		|ИЗ
		|	ВТ_ОбъемыБезОсновныхУслуг КАК ВТ_ОбъемыБезОсновныхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ПО ВТ_ОбъемыБезОсновныхУслуг.ЗависитОтУслуги = энргВидыУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СреднегодоваяРазница КАК ВТ_СреднегодоваяРазница
		|		ПО ВТ_ОбъемыБезОсновныхУслуг.ПорядокМесяц = ВТ_СреднегодоваяРазница.ПорядокМесяц
		|ГДЕ
		|	НЕ ВТ_ОбъемыБезОсновныхУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|	И НЕ энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВидыУслуг.Ссылка,
		|	ВТ_ОбъемыБезОсновныхУслуг.Месяц,
		|	ВТ_СреднегодоваяРазница.ПорядокМесяц,
		|	ВТ_СреднегодоваяРазница.Температура,
		|	ВТ_ОбъемыБезОсновныхУслуг.Квартл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеУслуги.ОсновнаяУслуга КАК Услуга,
		|	ВТ_ОсновныеУслуги.Месяц КАК Месяц,
		|	ВЫБОР
		|		КОГДА ВТ_ОсновныеУслуги.СреднегодоваяРазницаТемператур ЕСТЬ NULL
		|				ИЛИ ВТ_ОсновныеУслуги.СреднегодоваяРазницаТемператур = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ОсновныеУслуги.ОбъемПодчинённых / ВТ_ОсновныеУслуги.СреднегодоваяРазницаТемператур
		|	КОНЕЦ КАК Объем,
		|	ВТ_ОсновныеУслуги.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_ОсновныеУслуги.Квартл КАК Квартл
		|ИЗ
		|	ВТ_ОсновныеУслуги КАК ВТ_ОсновныеУслуги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОбъемыБезОсновныхУслуг.Услуга,
		|	ВТ_ОбъемыБезОсновныхУслуг.Месяц,
		|	ВТ_ОбъемыБезОсновныхУслуг.Объем,
		|	ВТ_ОбъемыБезОсновныхУслуг.ПорядокМесяц,
		|	ВТ_ОбъемыБезОсновныхУслуг.Квартл
		|ИЗ
		|	ВТ_ОбъемыБезОсновныхУслуг КАК ВТ_ОбъемыБезОсновныхУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	Услуга,
		|	ПорядокМесяц
		|ИТОГИ
		|	СУММА(Объем)
		|ПО
		|	Услуга,
		|	Квартл";
	
	Запрос.УстановитьПараметр("Дата", 					Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("Район",					Объект.Район);
	Запрос.УстановитьПараметр("МаксимальныеНагрузки", 	Объект.МаксимальныеНагрузки.Выгрузить());
	Запрос.УстановитьПараметр("IDСтроки",				IDСтроки);
	Запрос.УстановитьПараметр("КатегорияПомещения",		СтрокаОбъекта[0].КатегорияОбъекта);
	
	
	//РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаУслуга = РезультатЗапроса[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаУслуга = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуга.Следующий() Цикл
		НайденныеСтроки = Объект.ГарантированныеОбъемы.НайтиСтроки(Новый Структура("Услуга, IDСтроки", ВыборкаУслуга.Услуга, IDСтроки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТЧ = Объект.ГарантированныеОбъемы.Добавить();
			СтрокаТЧ.Услуга = ВыборкаУслуга.Услуга;
			СтрокаТЧ.Год = Объект.Дата;
			СтрокаТЧ.IDСтроки = IDСтроки;
		Иначе
			СтрокаТЧ = НайденныеСтроки[0];
		КонецЕсли;
		
		ВыборкаКвартл = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКвартл.Следующий() Цикл
			СтрокаТЧ[ВыборкаКвартл.Квартл] = ВыборкаКвартл.Объем;
			
			Выборка = ВыборкаКвартл.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ[Выборка.Месяц] = Выборка.Объем;
			КонецЦикла;
			
		КонецЦикла;
		
		СтрокаТЧ.ГарантированныйОбъемИтогГод = ВыборкаУслуга.Объем;
		
	КонецЦикла;
	
	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка)
	    СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;	
		Если НЕ ТекДанные = Неопределено Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("IDСтрокиВладельца", ТекДанные.IDСтроки);
			
			НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);	
			
			СписокУслуг = Новый СписокЗначений;
			
			Для Каждого Стр Из НайденныеСтроки Цикл
				СписокУслуг.Добавить(Стр.Услуга);
			КонецЦикла;
			
			ДанныеВыбора = ПолучитьСписокУслугДляВыбораНаСервере(СписокУслуг, Текст);
		КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокУслугДляВыбораНаСервере(СписокУслуг, Текст)			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)
	|	И энргВидыУслугСоставляющиеУслуг.Услуга.Наименование ПОДОБНО &Текст
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка
	|ИЗ
	|	Справочник.энргВидыУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)
	|	И энргВидыУслугСоставляющиеУслуг.Наименование ПОДОБНО &Текст";
	
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);	
	Запрос.УстановитьПараметр("Текст", Текст + "%");	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокУслуг.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
КонецФункции

&НаКлиенте
Процедура УслугиОбъектовУслугаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыУслугаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыПИР(СхемаПИР)

	РезультатЗапроса = Документы.бестЗаключениеДоговоровСЮридическимиЛицами.ЭтапыСхемы(СхемаПИР);
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.ЭтапыПИД.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;


КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область ПроцедурыПИР
&НаКлиенте
Процедура ЗаполнитьПоСхемеПИР(Команда)
	ОписОпов = Новый ОписаниеОповещения("ПолучитьСхемуПид", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.энргСхемыПИД.ФормаВыбора", , ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСхемуПид(СхемаПИД, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(СхемаПИД) Тогда
		Модифицированность = Истина;
		
	    Объект.ЭтапыПИД.Очистить();
		ДеревоПИР.ПолучитьЭлементы().Очистить();
	
		ЗаполнитьЭтапыПИР(СхемаПИД);
		ЗаполнитьДеревоПИР();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоПИР()

	Ветви = ДеревоПИР.ПолучитьЭлементы();
	Объект.ЭтапыПИД.Сортировать("Порядок");
	
	ТекВетвь = Новый Структура("Этап");
	Для каждого СтрокаТЧ Из Объект.ЭтапыПИД Цикл
		Если СтрокаТЧ.Этап <> ТекВетвь.Этап Тогда
			ТекВетвь = Ветви.Добавить();
			
			ТекВетвь.Этап = СтрокаТЧ.Этап;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Подэтап) Тогда
			ТекПодветвь = ТекВетвь.ПолучитьЭлементы().Добавить();
			
			ЗаполнитьЗначенияСвойств(ТекПодветвь, СтрокаТЧ);
		Иначе
			ТекВетвь.Срок 	 = СтрокаТЧ.Срок;
			ТекВетвь.Порядок = СтрокаТЧ.Порядок;
		КонецЕсли;		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПИРПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	ОписОпов = Новый ОписаниеОповещения("ПолучитьЭтап", ЭтотОбъект);
	ОткрытьФорму("Справочник.энргВидыОперацийПИД.ФормаВыбора", , ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЭтап(Этап, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Этап) Тогда
		Модифицированность = Истина;
		Ветвь = ДеревоПИР.ПолучитьЭлементы().Добавить();
		Ветвь.Этап = Этап;
		
		ЗаполнитьПодэтапы(Ветвь.ПолучитьИдентификатор(), Этап);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодэтапы(ИдВетвь, Этап)
	Ветвь = ДеревоПИР.НайтиПоИдентификатору(ИдВетвь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВидыОперацийПИД.ЕстьПодэтапы КАК ЕстьПодэтапы,
		|	энргВидыОперацийПИДПодэтапы.НомерСтроки КАК Порядок,
		|	энргВидыОперацийПИДПодэтапы.Подэтап КАК Подэтап,
		|	энргВидыОперацийПИДПодэтапы.Параллельно КАК Параллельно,
		|	энргВидыОперацийПИД.Ссылка КАК Этап
		|ИЗ
		|	Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД.Подэтапы КАК энргВидыОперацийПИДПодэтапы
		|		ПО энргВидыОперацийПИД.Ссылка = энргВидыОперацийПИДПодэтапы.Ссылка
		|ГДЕ
		|	энргВидыОперацийПИД.Ссылка = &Этап
		|	И энргВидыОперацийПИД.ЕстьПодэтапы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Подветвь = Ветвь.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Подветвь, Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодэтапПИР(Команда)
	ТекСтрока = Элементы.ДеревоПИР.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекВетвь  = ДеревоПИР.НайтиПоИдентификатору(Элементы.ДеревоПИР.ТекущаяСтрока);
	Пока ТекВетвь.ПолучитьРодителя() <> Неопределено Цикл 
		ТекВетвь = ТекВетвь.ПолучитьРодителя();
	КонецЦикла;
	
	ДопПарам = Новый Структура("ИдСтроки, Этап", ТекВетвь.ПолучитьИдентификатор(), ТекВетвь.Этап);
	ОписОпов = Новый ОписаниеОповещения("ПолучитьПодэтап", ЭтотОбъект, ДопПарам);
	ОткрытьФорму("Справочник.энргВидыОперацийПИД.ФормаВыбора", , ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПодэтап(Подэтап, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(Подэтап) Тогда
		Модифицированность = Истина;
		
		ИдСтроки = ДополнительныеПараметры.ИдСтроки;
		Этап	 = ДополнительныеПараметры.Этап;
		Ветвь 	 = ДеревоПИР.НайтиПоИдентификатору(ИдСтроки);
		
		Подветвь = Ветвь.ПолучитьЭлементы().Добавить();
		Подветвь.Этап	 = Этап;
		Подветвь.Подэтап = Подэтап;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьПараметрыПИР()
	Объект.ЭтапыПИД.Очистить();
	
	СчВетвь = 1;
	Для каждого Ветвь Из ДеревоПИР.ПолучитьЭлементы() Цикл
		Подветви = Ветвь.ПолучитьЭлементы();
		Если ЗначениеЗаполнено(Подветви) Тогда
			Сч = 1;
		
			Для каждого Подветвь Из Подветви Цикл
				СтрокаТЧ = Объект.ЭтапыПИД.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, Подветвь);
				СтрокаТЧ.Порядок = СчВетвь * 100 + Сч;
				
				Сч = Сч + 1;
			КонецЦикла;
		Иначе
			СтрокаТЧ = Объект.ЭтапыПИД.Добавить();
			
			СтрокаТЧ.Этап 	 = Ветвь.Этап;
			СтрокаТЧ.Срок 	 = Ветвь.Срок;
			СтрокаТЧ.Порядок = СчВетвь * 100;
		КонецЕсли;
		
		СчВетвь = СчВетвь + 1;	
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура ГарантированныеОбъемыПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ГарантированныеОбъемы");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ТарифныеКатегорииУслугиПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТемпературныеГрафикиОбъектовПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ТемпературныеГрафикиОбъектов");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныеНагрузкиПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"МаксимальныеНагрузки");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОплатыПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"НастройкиОплаты");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоступившейОплатыПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"РаспределениеПоступившейОплаты");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПотребителиГВСПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ПотребителиГВС");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДанныеТочекУчета(Команда)
	Если ПолучитьТипДоговора() = ПредопределенноеЗначение("Перечисление.бестТипыДоговоров.УправляющаяКомпания") Тогда
	ЗаполнитьДанныеДоговораСервер(Истина);
	//--СДЕЛАНО ВРЕМЕННО
		Для Каждого ТекСтрока Из Объект.ТочкиУчета Цикл
			ТекущиеДанные 							= ТекСтрока; 
			
			энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);				
			ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга); 				
			// энргРаботаСПоставщиками {
			бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
			// энргРаботаСПоставщиками } 				
			
			// энргРаботаСоСпособамиРасчетаНорматива {
			бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
			// энргРаботаСоСпособамиРасчетаНорматива } 				
			Если ИспользоватьШкалыПриборовУчета Тогда
				СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
				бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
			КонецЕсли;
			
			
		КонецЦикла;	
		ЗаполнитьПоставщика();
		
		УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","Договор"),"ДоговорыСоставныхУслуг","бестФормаВыбораДоговоров","ПараметрыДоговоров");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДоговорАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","Договор"),"ДоговорыСоставныхУслуг","бестФормаВыбораДоговоров","ПараметрыДоговоров");
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиДополнительныеНачисления

&НаКлиенте
Процедура ДополнительныеНачисленияТУТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка= Ложь;
	
	ТекущиеДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		
		ЗаполнитьСписокТочек(ДанныеВыбора,ТекущиеДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокТочек(ДанныеВыбора, IDСтроки)
	СтруктураПоиска  				= Новый Структура("IDСтрокиВладельца",IDСтроки);
	Коллекция  					= Объект["ТочкиУчета"];
	Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);	
	Для Каждого Стр из Строки Цикл 
		ДанныеВыбора.Добавить(Стр.НаименованиеТочки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияТУТочкаУчетаПриИзменении(Элемент)
	ТекущиеДанные 				= Элементы.ОбъектыРасчета.ТекущиеДанные;
	ТекущиеДанныеДопНачисления 	= Элементы.ДополнительныеНачисленияТУ.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда		
		СтруктураПоиска  				= Новый Структура("IDСтрокиВладельца, НаименованиеТочки",ТекущиеДанные.IDСтроки, ТекущиеДанныеДопНачисления.ТочкаУчета);
		Коллекция  					= Объект["ТочкиУчета"];
		Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);
		Если Строки.Количество() > 0 Тогда
			ТекущиеДанныеДопНачисления.IDСтрокиТУ = Строки[0].IDСтроки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияТУУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияТУПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ДополнительныеНачисленияТУ";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтрокиВладельца = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияТУПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока ИЛИ Копирование Тогда
		ТекущиеДанные 							= Элементы["ДополнительныеНачисленияТУ"].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияТУПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ДополнительныеНачисленияТУ.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ДополнительныеНачисленияЗначения, Неопределено, ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияЗначенияПриИзменении(Элемент)
	ТекДанные = Элементы.ДополнительныеНачисленияТУ.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ДополнительныеНачисленияЗначения";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ДополнительныеНачисленияЗначения, Неопределено, ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияТУПередУдалением(Элемент, Отказ)
	ТаблицыФормы = Новый Массив;	
	ТаблицыФормы.Добавить("ДополнительныеНачисленияЗначения");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ДополнительныеНачисленияТУ.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияТУПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область НОВАЯ_РАБОТА_С_УЗЛАМИ

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПараметрыОбновления) Экспорт 
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ);
	СтруктураДанныеПУ = ПараметрыОбновления.ДанныеПУ;
	СтруктураДанныеПУ.Удалить("НачалоДействияКоммерскогоУчета");
	СтруктураДанныеПУ.Удалить("КонецДействияКоммерскогоУчета");
	ТекСтрока = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", ПараметрыОбновления.IDСтроки));
	ТекСтрока[0].КоэффициентПУ = ПараметрыОбновления.Результат.КоэффициентПУ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()	
	Для Каждого ТекСтрока ИЗ Объект.ТочкиУчета Цикл
		ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
		ТекСтрока.ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(ТекСтрока, Объект.Потери,"ЮЛ");
		//энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстДанныеРасположения(ТекСтрока);
		//ТекСтрока.ДанныеРасположения = Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ТекСтрока.СтруктураСети);
	КонецЦикла;	
	
	Для Каждого ТекСтрока ИЗ Объект.ОбъектыРасчета Цикл
		ТекСтрока.ДополнительнаяИнформация = бестРаботаСОбъектамиНПСервер.ЗаполнитьТекстИнформацииОбъекта(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПотериИзРезультата(IDСтроки, Результат, ТехническиеСвойстваТУ)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери, Новый Структура("IDСтроки", IDСтроки));
	
	ПотериРезультат = ПолучитьИзВременногоХранилища(Результат.Потери);
	ПотериРезультат.Колонки.Добавить("IDСтроки");
	ПотериРезультат.ЗаполнитьЗначения(IDСтроки, "IDСтроки");
	Объект.Потери.Загрузить(ПотериРезультат); 	
	
	ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(Результат, ПотериРезультат,"ЮЛ");	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуТехническихСвойствТУ()
	ТекущиеДанные		= Элементы.ТочкиУчета.ТекущиеДанные;
	КлючиДанных			= ПолучитьКлючиДанныхТехСвойств();
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ТехническиеСвойстваТУЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные, КлючиДанных", ТекущиеДанные, КлючиДанных));
	ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаТехническиеСвойстваТУ", ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


/////////////////////////////////////////////
// Получение входных данных

&НаКлиенте
Функция ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных)
	ТехническиеСвойстваТУ 	= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);	
	ЗаполнитьЗначенияСвойств(ТехническиеСвойстваТУ, ТекущиеДанные, КлючиДанных.Реквизиты);
		
	ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, ТекущиеДанные.IDСтроки);
	ТехническиеСвойстваТУ.Вставить("ВызывающаяПодсистема", "ЮЛ");
	ТехническиеСвойстваТУ.Вставить("ИспользоватьТарифныеЗоны", ИспользоватьТарифныеЗоны);
	
	Возврат Новый Структура("ВходныеПараметры", ТехническиеСвойстваТУ);
КонецФункции

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, IDСтроки)
	ИдентификаторФормы 				= ЭтаФорма.УникальныйИдентификатор;
	Если ИспользоватьТарифныеЗоны Тогда
		Потери = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки), "ТарифнаяЗона, ФиксированныйОбъемПотерь, ПроцентПотерь");
		Шкалы = Объект.ШкалыПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки), "ВидДифференцированности");
		ТаблицаПотерь = Обработки.энргОперацияУзламиУчета.ПолучитьТаблицуПотерь(Шкалы, Потери);
	Иначе
		ТаблицаПотерь = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки));
	КонецЕсли;
	ТехническиеСвойстваТУ.Потери = ПоместитьВоВременноеХранилище(ТаблицаПотерь, ИдентификаторФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючиДанныхТехСвойств()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияТехническихСвойствТУ("ЮЛ");
КонецФункции


/////////////////////////////////////////////
// Обработка возврата результата

&НаКлиенте
Процедура ТехническиеСвойстваТУЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	КлючиДанных 	= ДополнительныеПараметры.КлючиДанных;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, КлючиДанных.Реквизиты);
	ТехническиеСвойстваТУ = "";
	ЗаполнитьПотериИзРезультата(ТекущиеДанные.IDСтроки, Результат, ТехническиеСвойстваТУ);
	ТекущиеДанные.ТехническиеСвойстваТУ 		= ТехническиеСвойстваТУ;//энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстТехническихСвойств(Результат, Результат.Потери);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;
	
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти
