#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ОбъектРасчета = Параметры.ОбъектРасчета;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыОбъектаРасчета,"ОбъектРасчета",ОбъектРасчета);
	Для каждого эл из ДокументыОбъектаРасчета.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если эл.ПредставлениеПользовательскойНастройки = "ЗаполнениеОбъектРасчета" Тогда
			эл.ПравоеЗначение = ОбъектРасчета;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти