#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	Док = ПолучитьДокумент(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник.Элементы.Абоненты.ТекущиеДанные.IDСтроки, ПараметрыВыполненияКоманды.Источник.Элементы.Абоненты.ТекущиеДанные.КлючПомещения);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Док);
	ОткрытьФорму("Документ.конвРедактироованиеВводаНачальныхОстатков.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДокумент(ПараметрКоманды, IDСтроки, КлючПомещения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	конвРедактироованиеВводаНачальныхОстатков.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.конвРедактироованиеВводаНачальныхОстатков КАК конвРедактироованиеВводаНачальныхОстатков
	|ГДЕ
	|	конвРедактироованиеВводаНачальныхОстатков.КлючПомещения = &КлючПомещения
	|	И конвРедактироованиеВводаНачальныхОстатков.ДокументОснование = &ДокументОснование
	|	И НЕ конвРедактироованиеВводаНачальныхОстатков.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	Запрос.УстановитьПараметр("ДокументОснование", ПараметрКоманды);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Док = Результат.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.конвРедактироованиеВводаНачальныхОстатков.СоздатьДокумент();
		ПараметрыЗаполнения = Новый Структура;   
		ПараметрыЗаполнения.Вставить("ДокументОснование", ПараметрКоманды);
		ПараметрыЗаполнения.Вставить("IDСтроки", IDСтроки);
		ПараметрыЗаполнения.Вставить("КлючПомещения", КлючПомещения);
		
		Док.Заполнить(ПараметрыЗаполнения);
		Док.Записать();
	КонецЕсли;
	
	Возврат Док.Ссылка;
КонецФункции

#КонецОбласти
