#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение
 
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса  	= Новый Структура;
	Схема 				= Неопределено;
	
	ДобавитьТекстЗапросаЗначенияТарифовДиапазоновДифференцированногоТарифа(Схема, Регистры);
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры = Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры
 	
#КонецОбласти

Процедура ДобавитьТекстЗапросаЗначенияТарифовДиапазоновДифференцированногоТарифа(Схема, Регистры)
	
	ИмяРегистра = "энргЗначенияТарифовДиапазоновДифференцированногоТарифа";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема = новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса( 
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Услуга КАК Услуга,
	|	ТаблицаРазрезыДиапазонов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ТаблицаРазрезыДиапазонов.Поставщик КАК Поставщик,
	|	ТаблицаРазрезыДиапазонов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаЗначенияТарифов.Диапазон КАК Диапазон,
	|	ТаблицаЗначенияТарифов.ЗначениеТарифа КАК Значение,
	|	ТаблицаЗначенияТарифов.НДСВнутри КАК НДСВнутри,
	|	ТаблицаЗначенияТарифов.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.энргУстановитьЗначенияТарифовДиапазоновДифференцированногоТарифа КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьЗначенияТарифовДиапазоновДифференцированногоТарифа.Разрезы КАК ТаблицаРазрезыДиапазонов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьЗначенияТарифовДиапазоновДифференцированногоТарифа.ЗначенияТарифов КАК ТаблицаЗначенияТарифов
	|			ПО ТаблицаРазрезыДиапазонов.Ссылка = ТаблицаЗначенияТарифов.Ссылка
	|				И ТаблицаРазрезыДиапазонов.ИдентификаторСтроки = ТаблицаЗначенияТарифов.ИдентификаторСтроки
	|				И (ТаблицаЗначенияТарифов.Ссылка В (&мДокументы))
	|		ПО Шапка.Ссылка = ТаблицаРазрезыДиапазонов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаРазрезыДиапазонов.Ссылка В (&мДокументы))");
				
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли