#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПоУслугам

&НаКлиенте
Процедура ШкалыПоУслугамШкалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПолеШкалы =  ЭтаФорма.Элементы.ШкалыПоУслугамШкала;
	ПолеШкалы.СписокВыбора.Очистить();
	ПолеШкалы.СписокВыбора.ЗагрузитьЗначения(ПолучитьШкалы());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьШкалы()
	Возврат Объект.Шкалы.Выгрузить(,"Шкала").ВыгрузитьКолонку("Шкала");
КонецФункции

#КонецОбласти
