
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("ФормаУстановитьПриоритеты"), Метаданные.РегистрыСведений.бестПриоритетПередачиПоказанийНП);
	// -- Акимов Д.В.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПриоритеты(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыУстановкиПриоритетов", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.бестПриоритетПередачиПоказанийНП.Форма.ФормаУстановкаПриоритетов",,,,,,ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыУстановкиПриоритетов(Результат, ДополнительныеПараметры) Экспорт 
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти
