#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Абонент") Тогда
		ЗаполнитьЗадолженность(Параметры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьЗадолженность(Параметры)
	Задолженность.Очистить();
	РезультатВзаиморасчеты 					= энргРаботаСТочкамиУчетаСервер.ДанныеДляОплатыАбонента(Параметры.Период, Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД, Параметры.Абонент, Ложь);
	Выборка									= РезультатВзаиморасчеты.выбрать();
	
	Пока Выборка.следующий() цикл
		Если Выборка.Задолженность <> 0 тогда
			СтрокаУслуги  					= Задолженность.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаУслуги,Выборка); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
