
&НаКлиенте
Процедура СписокСудебныхДелВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.СписокСудебныхДел.ТекущиеДанные;
	
	ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", Новый Структура("Ключ", ТекСтрока.Ссылка)); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("энргСотрудникУКЗ") Тогда 
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	ТекПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СписокСудебныхДел.ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", ТекПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	СписокСудебныхДел.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ТекПользователь);
КонецПроцедуры
