 
 #Область ПрограммныйИнтерфейс

// Процедура - Установить зависимые реквизиты договора контрагента 
// см. бестПользовательскийВводКлиент.ПриИзмененииДоговораКонтрагента
//
// Параметры:
//  Договор	 - СправочникСсылка.энргДоговорыКонтрагентов
//  Приемник - Структура из энргРаботаСЛицевымСчетомКлиент.СтруктураЗначенийЗаполненияДоговора()
//
Процедура УстановитьЗависимыеРеквизитыДоговораКонтрагента(Договор,Приемник) Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Дата КАК ДатаФактическогоСобытия,
	|	ДоговорыКонтрагентов.Район КАК Район,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Договор",Договор);
	Результат  		= Запрос.Выполнить();
	Выборка 		 = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Приемник,Выборка);
	
КонецПроцедуры

// Процедура - Заполнить подписантов
// Заполняет ТЗ Подписантов на форме
//
// Параметры:
//  СтруктураОтборов - Структура - ОбъектПечати,ИмяМакета,ТаблицаМакета,Организация,Район,НачалоПериода
//  ТаблицаПриемник	 - ДанныеФормыКоллекция
//
Процедура ЗаполнитьПодписантов(СтруктураОтборов, ТаблицаПриемник) Экспорт 
	
	ОбъектПечати 	= СтруктураОтборов.ОбъектПечати;
	НачалоПериода 	= СтруктураОтборов.НачалоПериода;
	Организация 	= СтруктураОтборов.Организация;
	Район 			= СтруктураОтборов.Район;
	ИмяМакета 		= СтруктураОтборов.ИмяМакета; 
		
	Если ЗначениеЗаполнено(ОбъектПечати) Тогда
		пМетаданные = ОбъектПечати.Метаданные().Имя; 
	ИначеЕсли ИмяМакета = "ПФ_MXL_АктСверки" Тогда
		пМетаданные = "бестАктСверки";
	КонецЕсли;
	
	пМетаданные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтборов, "пМетаданные", пМетаданные);
	
	МВТ = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.энргПодписанты.ПолучитьПодписантов(НачалоПериода, Организация, Район, пМетаданные, МВТ);
	РегистрыСведений.энргДолжностиСотрудников.ПолучитьДолжностиСотрудников(НачалоПериода, Организация,, МВТ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подписанты.ВидПодписанта КАК ВидПодписанта,
		|	Подписанты.Сотрудник КАК Сотрудник,
		|	Подписанты.Доверенность КАК Доверенность,
		|	ДолжностиСотрудников.Должность КАК Должность
		|ИЗ
		|	Подписанты КАК Подписанты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДолжностиСотрудников КАК ДолжностиСотрудников
		|		ПО Подписанты.Организация = ДолжностиСотрудников.Организация
		|			И Подписанты.Сотрудник = ДолжностиСотрудников.Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Записать параметры объекта
// Создает Запись JSON в ТЧ для создаваемых объектов расчета
//
// Параметры:
//  Коллекция		 - ДанныеФормыКоллекция 
//  ТекущийОбъект	 - ДокументОбъект.бестЗаключениеДоговоровСЮридическимиЛицами
//
Процедура ЗаписатьПараметрыОбъекта(Коллекция, ТекущийОбъект) Экспорт  
	
	Сч 											= 0;
	Для Каждого СтрокаОбъекта Из Коллекция Цикл
		Если ЗначениеЗаполнено(СтрокаОбъекта.ОбъектРасчета) Тогда
			ТекОбъект						= СтрокаОбъекта.ОбъектРасчета.ПолучитьОбъект();
			ТекОбъект.Организация 			= ТекущийОбъект.Организация;
			ТекОбъект.Наименование 			= СтрокаОбъекта.НаименованиеОбъектаРасчета;
			ТекОбъект.КатегорияПомещения 	= СтрокаОбъекта.КатегорияОбъекта;
			ЗаполнитьЗначенияСвойств(ТекОбъект, СтрокаОбъекта);
			ТекОбъект.Записать();
			
			Запись  									= Новый ЗаписьJSON;
			Запись.УстановитьСтроку();
			Запись.ЗаписатьНачалоОбъекта();
			
			Запись.ЗаписатьИмяСвойства("Наименование");
			Запись.ЗаписатьЗначение(СтрокаОбъекта.НаименованиеОбъектаРасчета);
			Запись.ЗаписатьИмяСвойства("НазначениеНП");
			Запись.ЗаписатьЗначение("" + СтрокаОбъекта.НазначениеНП.УникальныйИдентификатор());
			Запись.ЗаписатьИмяСвойства("ГруппаОбъектовРасчета");
			Запись.ЗаписатьЗначение("" + СтрокаОбъекта.ГруппаОбъектовРасчета.УникальныйИдентификатор());
			Запись.ЗаписатьИмяСвойства("КатегорияОбъекта");
			Запись.ЗаписатьЗначение("" + СтрокаОбъекта.КатегорияОбъекта.УникальныйИдентификатор());			
			Запись.ЗаписатьИмяСвойства("МКД");
			Запись.ЗаписатьЗначение("" + СтрокаОбъекта.МКД.УникальныйИдентификатор());
			Запись.ЗаписатьИмяСвойства("Контролер");
			Запись.ЗаписатьЗначение("" + СтрокаОбъекта.Контролер.УникальныйИдентификатор());
			Запись.ЗаписатьИмяСвойства("Организация");
			Запись.ЗаписатьЗначение("" + ТекущийОбъект.Организация.УникальныйИдентификатор());
			Запись.ЗаписатьИмяСвойства("АдресОбъекта");
			Запись.ЗаписатьЗначение(СтрокаОбъекта.АдресОбъекта);
			Запись.ЗаписатьИмяСвойства("АдресОбъектаЗначение");
			Запись.ЗаписатьЗначение(СтрокаОбъекта.АдресОбъектаЗначение);
			Запись.ЗаписатьИмяСвойства("Договор");
			Запись.ЗаписатьЗначение("" + ТекущийОбъект.Договор.УникальныйИдентификатор());
			
			Запись.ЗаписатьКонецОбъекта();
			СтрокаОбъекта.ОписаниеОбъекта 		= "";
			СтрокаОбъекта.ОписаниеОбъекта 	= Запись.Закрыть();					
			Сч 											= Сч + 1;	
		Иначе	
			ЕстьДанные  								= Ложь;
			Запись  									= Новый ЗаписьJSON;
			Запись.УстановитьСтроку();
			Запись.ЗаписатьНачалоОбъекта();	
			
			Если ЗначениеЗаполнено(СтрокаОбъекта.НаименованиеОбъектаРасчета) Тогда
				Запись.ЗаписатьИмяСвойства("Наименование");
				Запись.ЗаписатьЗначение(СтрокаОбъекта.НаименованиеОбъектаРасчета);
				ЕстьДанные 								= Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОбъекта.НазначениеНП) Тогда
				Запись.ЗаписатьИмяСвойства("НазначениеНП");
				Запись.ЗаписатьЗначение("" + СтрокаОбъекта.НазначениеНП.УникальныйИдентификатор());
				ЕстьДанные 								= Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОбъекта.ГруппаОбъектовРасчета) Тогда
				Запись.ЗаписатьИмяСвойства("ГруппаОбъектовРасчета");
				Запись.ЗаписатьЗначение("" + СтрокаОбъекта.ГруппаОбъектовРасчета.УникальныйИдентификатор());
				ЕстьДанные 								= Истина;
			КонецЕсли;
					
			Если ЗначениеЗаполнено(СтрокаОбъекта.КатегорияОбъекта) Тогда
				Запись.ЗаписатьИмяСвойства("КатегорияОбъекта");
				Запись.ЗаписатьЗначение("" + СтрокаОбъекта.КатегорияОбъекта.УникальныйИдентификатор());
				ЕстьДанные 								= Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОбъекта.МКД) Тогда
				Запись.ЗаписатьИмяСвойства("МКД");
				Запись.ЗаписатьЗначение("" + СтрокаОбъекта.МКД.УникальныйИдентификатор());
				ЕстьДанные 								= Истина;
			КонецЕсли;
						
			Если ЗначениеЗаполнено(СтрокаОбъекта.Контролер) Тогда
				Запись.ЗаписатьИмяСвойства("Контролер");
				Запись.ЗаписатьЗначение("" + СтрокаОбъекта.Контролер.УникальныйИдентификатор());
				ЕстьДанные 								= Истина;
			КонецЕсли;
		
			Если ЗначениеЗаполнено(ТекущийОбъект.Организация) Тогда
				Запись.ЗаписатьИмяСвойства("Организация");
				Запись.ЗаписатьЗначение("" + ТекущийОбъект.Организация.УникальныйИдентификатор());
				ЕстьДанные 								= Истина;
			КонецЕсли;		
			
			Если ЗначениеЗаполнено(ТекущийОбъект.Договор) Тогда
				Запись.ЗаписатьИмяСвойства("Договор");
				Запись.ЗаписатьЗначение("" + ТекущийОбъект.Договор.УникальныйИдентификатор());
				ЕстьДанные 								= Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОбъекта.АдресОбъекта) Тогда
				Запись.ЗаписатьИмяСвойства("АдресОбъекта");
				Запись.ЗаписатьЗначение(СтрокаОбъекта.АдресОбъекта);
				Запись.ЗаписатьИмяСвойства("АдресОбъектаЗначение");
				Запись.ЗаписатьЗначение(СтрокаОбъекта.АдресОбъектаЗначение);
				ЕстьДанные 								= Истина;
			КонецЕсли;		
			Запись.ЗаписатьКонецОбъекта();
			ЗаписываемаяСтрока  						= ТекущийОбъект.ОбъектыРасчета[Сч];
			ЗаписываемаяСтрока.ОписаниеОбъекта 		= "";
			Если ЕстьДанные Тогда
				ЗаписываемаяСтрока.ОписаниеОбъекта 	= Запись.Закрыть();
			КонецЕсли;
			Сч 											= Сч + 1;		
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Процедура - Бест заполнение даты создания документа перед записью
// Заполняет общий реквизит энргДатаСозданияДокумента через подписку на событие
//
// Параметры:
//	Источник 		- ОбщиеРеквизиты.энргДатаСозданияДокумента
//  Отказ 			- Булево
//  РежимЗаписи     - РежимЗаписиДокумента
//  РежимПроведения - РежимПроведенияДокумента
//
Процедура бестЗаполнениеДатыСозданияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Не ЗначениеЗаполнено(Источник.Ссылка)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "энргДатаПоследнегоИзменения") Тогда	
		Источник.энргДатаСозданияДокумента = ТекущаяДата();	
	КонецЕсли;
КонецПроцедуры

// Процедура - Бест заполнение даты последнего изменения документа перед записью
// Заполняет общий реквизит энргДатаПоследнегоИзменения через подписку на событие
//
// Параметры:
//	Источник 		- ОбщиеРеквизиты.энргДатаСозданияДокумента
//  Отказ 			- Булево
//  РежимЗаписи     - РежимЗаписиДокумента
//  РежимПроведения - РежимПроведенияДокумента
//
Процедура бестЗаполнениеДатыПоследнегоИзмененияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Не Источник.ДополнительныеСвойства.Свойство("ДатаИзмененияАктуальна") 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "энргДатаПоследнегоИзменения") Тогда
		Источник.энргДатаПоследнегоИзменения = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры

// Процедура - Бест заполнение даты последнего изменения справочника перед записью  
// Заполняет общий реквизит энргДатаПоследнегоИзменения через подписку на событие
//
// Параметры:
//	Источник 		- ОбщиеРеквизиты.энргДатаСозданияДокумента
//  Отказ 			- Булево
//  РежимЗаписи     - РежимЗаписиДокумента
//  РежимПроведения - РежимПроведенияДокумента
//
Процедура бестЗаполнениеДатыПоследнегоИзмененияСправочникаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Не Источник.ДополнительныеСвойства.Свойство("ДатаИзмененияАктуальна") Тогда	
		Источник.энргДатаПоследнегоИзменения = ТекущаяДата();	
	КонецЕсли;
КонецПроцедуры

// Функция - Получить список услуг для выбора
// Возвращает список услуг для отбора на форме выбора
//
// Параметры:
//  Период			 - Дата 
//  Организация		 - СправочникСсылка.Организации 
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета
//  ТочкаУчета		 - СправочникСсылка.энргТочкиУчета 
// 
// Возвращаемое значение:
//   Массив - Массив элементов с типом СправочникСсылка.энргВидыУслуг 
//
Функция ПолучитьСписокУслугДляВыбора(Период, Организация,Район,ОбъектРасчета,ТочкаУчета) Экспорт

	СписокУслуг = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Если Не ЗначениеЗаполнено(ОбъектРасчета) И  Не ЗначениеЗаполнено(ТочкаУчета) Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, энргВидыУслуг.Ссылка) КАК Услуга
		|ИЗ
		|	Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО (энргВидыУслугСоставляющиеУслуг.Ссылка = энргВидыУслуг.Ссылка)";
		
	Иначе
		
		Текст = 
		"ВЫБРАТЬ
		|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
		|ПОМЕСТИТЬ Услуги
		|ИЗ
		|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестУслугиТочекУчетаНПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, Услуги.Услуга) КАК Услуга
		|ИЗ
		|	Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО Услуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка";	
		
		Если Не ЗначениеЗаполнено(ОбъектРасчета) Тогда
			Текст = СтрЗаменить(Текст, "ОбъектРасчета = &ОбъектРасчета", "ИСТИНА");
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ТочкаУчета) Тогда
			Текст = СтрЗаменить(Текст, "ТочкаУчета = &ТочкаУчета", "ИСТИНА");
		КонецЕсли;	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	
	Запрос.Текст = Текст;

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

// Процедура - Заполнить МКД на форме
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения 
//
Процедура ЗаполнитьМКДНаФорме(Форма) Экспорт
	Форма.МКД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.ОбъектРасчета, "МКД");
КонецПроцедуры

// Процедура - Заполнить список ссылок
//
// Параметры:
//  Форма		 - ФормаКлиентскогоПриложения 
//  СписокСсылок - СписокЗначений
//  ИмяПоля		 - Строка
//
Процедура ЗаполнитьСписокСсылок(Форма, СписокСсылок, ИмяПоля) Экспорт 
	Перем Организация, Район, Период, Договор;
	
	Если Форма.Параметры.Свойство("Период") Тогда
		Период 					= Форма.Параметры.Период;
	КонецЕсли;
	
	Если Форма.Параметры.Свойство("Район") Тогда
		Район 					= Форма.Параметры.Район;
	КонецЕсли;
	
	Если Форма.Параметры.Свойство("Организация") Тогда
		Организация 			= Форма.Параметры.Организация;
	КонецЕсли;
	                      
	Если Форма.Параметры.Свойство("Договор") Тогда
		Договор 		= Форма.Параметры.Договор;
	КонецЕсли;
	
	Если Форма.Параметры.Свойство("МКД") Тогда
		МКД 		= Форма.Параметры.МКД;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Район) И ЗначениеЗаполнено(Период) Тогда
		
		Результат		= РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(Организация, Район, Период, Договор,,,,МКД);
		Выборка 		= Результат.выбрать();
		СписокСсылок	= Новый СписокЗначений;
		Пока Выборка.следующий() цикл
			СписокСсылок.Добавить(Выборка[ИмяПоля]);
		КонецЦикла;  	
	КонецЕсли;
	
КонецПроцедуры   

#КонецОбласти