#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка Тогда
		бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),		Движения.бестИндивидуальнаяНастройкаРазрядностиОбъема);
	Иначе
		бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),		Движения.бестОбщаяНастройкаРазрядностиОбъема);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестИзмененитьРазрядностьОбъемовУслуг.Дата КАК Период,
	|	бестИзмененитьРазрядностьОбъемовУслуг.Организация КАК Организация,
	|	бестИзмененитьРазрядностьОбъемовУслуг.Услуга КАК Услуга,
	|	бестИзмененитьРазрядностьОбъемовУслугДоговоры.Договор КАК Договор,
	|	ЕСТЬNULL(бестИзмененитьРазрядностьОбъемовУслугДоговоры.КоличествоЗнаковПослеЗапятой, бестИзмененитьРазрядностьОбъемовУслуг.КоличествоЗнаковПослеЗапятой) КАК КоличествоЗнаковПослеЗапятой
	|ИЗ
	|	Документ.бестИзмененитьРазрядностьОбъемовУслуг КАК бестИзмененитьРазрядностьОбъемовУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестИзмененитьРазрядностьОбъемовУслуг.Договоры КАК бестИзмененитьРазрядностьОбъемовУслугДоговоры
	|		ПО (бестИзмененитьРазрядностьОбъемовУслугДоговоры.Ссылка = бестИзмененитьРазрядностьОбъемовУслуг.Ссылка)
	|			И (бестИзмененитьРазрядностьОбъемовУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзмененитьРазрядностьОбъемовУслуг_ИндивидуальнаяНастройка))
	|ГДЕ
	|	бестИзмененитьРазрядностьОбъемовУслуг.Ссылка = &Ссылка" ;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли