#Область События_Формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область События_Шапка 

#КонецОбласти

#Область События_ТЧ_РазрезыПиковыхЧасов 

&НаКлиенте
Процедура РазрезыПиковыхЧасовПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.РазрезыПиковыхЧасов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПиковыеЧасы,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПиковыхЧасовПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.РазрезыПиковыхЧасов.ТекущиеДанные;
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ПиковыеЧасы");
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПиковыхЧасовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;	
	НоваяСтрока = Объект.РазрезыПиковыхЧасов.Добавить();
	НоваяСтрока.IDСтроки = Новый УникальныйИдентификатор;
	ЗаполнитьПиковыеЧасы(НоваяСтрока.IDСтроки);
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область События_ТЧ_ПиковыеЧасы

&НаКлиенте
Процедура ПиковыеЧасыПриИзменении(Элемент)
	
	ТекДанные = Элементы.РазрезыПиковыхЧасов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ПиковыеЧасы";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПиковыеЧасыДеньПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ПиковыеЧасы";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.ПериодНачисления = НачалоМесяца(ТекущиеДанные.ПериодНачисления);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьПиковыеЧасы(IDСтроки)
	Год 			= Год(Объект.Дата);
	Месяц = 0;
	Пока Месяц < 12 Цикл
		НовСтр 						= Объект.ПиковыеЧасы.Добавить();
		НовСтр.ПериодНачисления 	= ДобавитьМесяц(НачалоГода(Объект.Дата), Месяц);
		НовСтр.IDСтроки = IDСтроки;
		Месяц = Месяц + 1;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти