#Область ПрограммныйИнтерфейс

#Область РегламетныеПроцедуры

// Выполнение регламентных процедур Биллинг.
//
Процедура РегламетныеПроцедурыБиллинг() Экспорт
	
	ВыполнитьИндивидуальныеРегламетныеОперации();
	
КонецПроцедуры

// Отложенные движения документов начисления.
//
// Параметры:
//  Организация								-	СправочникСсылка.Организации.
//  ПериодНачисления						-	Дата.
//  Район									-	СправочникСсылка.энргЗоныОтвественности.
//  Строение								-	СправочникСсылка.энргСтроения.
//  СбрасыватьСостояниеПоследовательности	-	Булево.
//
Процедура ОтложенныеДвиженияДокументовНачисления(Организация, ПериодНачисления, Район, Строение = Неопределено, СбрасыватьСостояниеПоследовательности = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(ПериодНачисления) или Не ЗначениеЗаполнено(Район) тогда
		Возврат;
	КонецЕсли;
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  											= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления, Ложь);
	
	НачалоПериодаРасчета										= ГраницыПериода.НачалоОП;
	
	МВТ  														= Новый МенеджерВременныхТаблиц;
	
	Результат 													= РезультатНачальныеОстаткиСтабильногоПериода(МВТ,Организация, ПериодНачисления,Район,Строение,НачалоПериодаРасчета);
	Выборка  													= Результат[0].Выбрать();
	
	ВыборкаДокументов 											= Результат[1].Выбрать();
	ВыборкаПоказания 											= Результат[2].Выбрать();
	ВыборкаШкалы	 											= Результат[3].Выбрать();
	ВыборкаИзмерители 											= Результат[4].Выбрать();
	
	ПериодНачисленияПред 										= НачалоМесяца(НачалоМесяца(ПериодНачисления)-1);
	ТекМКД														= Неопределено;
	НаборСтабильныеПериоды 										= Неопределено;
	НаборСтабильныеПериодыШкалы									= Неопределено;
	НаборСтабильныеПериодыИзмерителиНаправлений 				= Неопределено;
	НаборНомерСтрокСтабПериода 									= Неопределено;
	НаборМаксимальныеПоказания 									= Неопределено;
	НаборОтложенныхДвижений 									= Неопределено;
	СоставЖильцовРазделенныхЛС 									= Новый Соответствие;
	
	ПустоеСтроение												= Справочники.энргСтроения.ПустаяСсылка();
	
	Если Выборка.Количество() = 0 тогда		
		РезультатДокументыДляПроведения 						= МВТ.Таблицы["ДокументыДляПроведения"].ПолучитьДанные();
		Если НЕ РезультатДокументыДляПроведения.Пустой() Тогда
			
			ВыборкаДокументыДляПроведения 						= РезультатДокументыДляПроведения.Выбрать();
			
			Пока ВыборкаДокументыДляПроведения.Следующий() Цикл
				НаборСтабильныеПериоды							= РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
				НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				НаборСтабильныеПериоды.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
				НаборСтабильныеПериоды.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборСтабильныеПериоды.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
				НаборСтабильныеПериоды.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
				Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
					НаборСтабильныеПериоды.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
				КонецЕсли;
				НаборСтабильныеПериоды.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор);
				
				НаборСтабильныеПериодыШкалы					= РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
				НаборСтабильныеПериодыШкалы.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				НаборСтабильныеПериодыШкалы.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
				НаборСтабильныеПериодыШкалы.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборСтабильныеПериодыШкалы.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
				НаборСтабильныеПериодыШкалы.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
				Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
					НаборСтабильныеПериодыШкалы.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
				КонецЕсли;
				НаборСтабильныеПериодыШкалы.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор);				 
				
				НаборСтабильныеПериодыИзмерителиНаправлений 	= РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
				НаборСтабильныеПериодыИзмерителиНаправлений.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
				НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
				НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
				Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
					НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
				КонецЕсли;
				НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор);				 
				
				НаборНомерСтрокСтабПериода 					= РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
				НаборНомерСтрокСтабПериода.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				НаборНомерСтрокСтабПериода.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
				НаборНомерСтрокСтабПериода.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборНомерСтрокСтабПериода.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
				НаборНомерСтрокСтабПериода.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
				Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
					НаборНомерСтрокСтабПериода.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
				КонецЕсли;
				НаборНомерСтрокСтабПериода.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор); 			 
				
				НаборМаксимальныеПоказания 					= РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
				НаборМаксимальныеПоказания.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				НаборМаксимальныеПоказания.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
				НаборМаксимальныеПоказания.Отбор.ПериодНачисления.Установить(ПериодНачисления);
				НаборМаксимальныеПоказания.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
				НаборМаксимальныеПоказания.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
				Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
					НаборМаксимальныеПоказания.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
				КонецЕсли;
				
				НачатьТранзакцию();
				Попытка
					НаборСтабильныеПериоды.записать();
					НаборСтабильныеПериодыШкалы.записать();
					НаборСтабильныеПериодыИзмерителиНаправлений.Записать();
					НаборНомерСтрокСтабПериода.записать(); 						
					НаборМаксимальныеПоказания.записать();
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
					ПредставлениеОшибки 											= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Ошибки 														= ?(Не ПустаяСтрока(Ошибки), Символы.ПС,"") + ПредставлениеОшибки;					
				КонецПопытки;				 
			КонецЦикла;			 
		КонецЕсли;
		
		Попытка
			ПересчитатьСреднийОбъем(Организация, ПериодНачисления, Район, Строение);
			
		Исключение
			ПредставлениеОшибки 											= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Ошибки 														= ?(Не ПустаяСтрока(Ошибки), Символы.ПС,"") + "Расчет среднего: " + ПредставлениеОшибки;	
		КонецПопытки;
		
		Если НЕ ПустаяСтрока(Ошибки) Тогда
			ВызватьИсключение Ошибки;
		КонецЕсли;
		Возврат;	
	КонецЕсли;	
	
	ЕстьСледующийДокумент										= ВыборкаДокументов.Следующий();
	ЕстьСледующийПоказания 										= ВыборкаПоказания.Следующий();
	ЕстьСледующийШКалы	 										= ВыборкаШкалы.Следующий();
	ЕстьСледующийИзмерители										= ВыборкаИзмерители.Следующий();
	Ошибки 														= "";
	НачатьТранзакцию();
	Пока Выборка.Следующий() цикл		
		МКД		 												= ?(НЕ Выборка.ЧастныйСектор, Выборка.Строение, ПустоеСтроение);
		Если ТекМКД <> МКД тогда  
			СоставЖильцовРазделенныхЛС = Новый Соответствие;
			
			Если ТекМКД <>Неопределено тогда
				
				Пока ЕстьСледующийПоказания И ?(НЕ ВыборкаПоказания.ЧастныйСектор, ВыборкаПоказания.Строение, ПустоеСтроение) = ТекМКД  Цикл
					
					СтрокаНабораПоказаний 						= НаборМаксимальныеПоказания.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаПоказания);
					
					Если ВыборкаПоказания.ЭтоВводНачальныхОстатков Тогда
						СтрокаНабораПоказаний 					= НаборМаксимальныеПоказания.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаПоказания);
						СтрокаНабораПоказаний.ПериодНачисления 	= НачалоМесяца(ВыборкаПоказания.ПериодНачисления - 1);						
					КонецЕсли; 					
					
					ЕстьСледующийПоказания 						= ВыборкаПоказания.Следующий();
					Если Не ЕстьСледующийПоказания Тогда
						Прервать;
					КонецЕсли;					
				КонецЦикла;	
				
				Пока ЕстьСледующийШКалы И ?(НЕ ВыборкаШкалы.ЧастныйСектор, ВыборкаШкалы.Строение, ПустоеСтроение) = ТекМКД  Цикл
					
					СтрокаНабораПоказаний 						= НаборСтабильныеПериодыШкалы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаШкалы);
					
					ЕстьСледующийШКалы 							= ВыборкаШкалы.Следующий();
					Если Не ЕстьСледующийШКалы Тогда
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				
				
				Пока ЕстьСледующийИзмерители И ?(НЕ ВыборкаИзмерители.ЧастныйСектор, ВыборкаИзмерители.Строение, ПустоеСтроение) = ТекМКД  Цикл
					
					СтрокаНабораИзмерители 						= НаборСтабильныеПериодыИзмерителиНаправлений.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабораИзмерители, ВыборкаИзмерители);
					
					ЕстьСледующийИзмерители 					= ВыборкаИзмерители.Следующий();
					Если Не ЕстьСледующийИзмерители Тогда
						Прервать;
					КонецЕсли;					
				КонецЦикла;
				
				Попытка 										
					Если СбрасыватьСостояниеПоследовательности тогда
						СброситьСостояниеПоследовательности("энргСтабильныеПериодыПоследовательность",	Организация,ПериодНачисления,Район,ТекМКД);
						СброситьСостояниеПоследовательности("энргПоказанияПУПоследовательность", 		Организация,ПериодНачисления,Район,ТекМКД);
						СброситьСостояниеПоследовательности("энргВзаиморасчетыПоследовательность",		Организация,ПериодНачисления,Район,ТекМКД);
					КонецЕсли;
					
					НаборОтложенные 							= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
					НаборОтложенные.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
					НаборОтложенные.отбор.Организация.установить(Организация);
					НаборОтложенные.отбор.ПериодНачисления.установить(ПериодНачисления);
					НаборОтложенные.отбор.Район.установить(Район); 						
					НаборОтложенные.отбор.РазделЗаписи.установить(Перечисления.энргРазделыЗаписи.СтабильныеПериоды);
					НаборОтложенные.Отбор.ЧастныйСектор.установить(НЕ ЗначениеЗаполнено(ТекМКД));
					НаборОтложенные.отбор.Строение.установить(ТекМКД);
					НаборОтложенные.Записать(); 
					
					НаборСтабильныеПериоды.записать(Ложь);
					НаборСтабильныеПериодыШкалы.записать(Ложь);
					НаборСтабильныеПериодыИзмерителиНаправлений.Записать(Ложь);
					НаборНомерСтрокСтабПериода.записать(Ложь); 						
					НаборМаксимальныеПоказания.записать(Ложь);
					
					ЗафиксироватьТранзакцию();
					НачатьТранзакцию(); 
				Исключение
					ОтменитьТранзакцию(); 					
					
					ПредставлениеОшибки 						= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Ошибки 										= ?(Не ПустаяСтрока(Ошибки), Символы.ПС,"") + ПредставлениеОшибки;
					
					НачатьТранзакцию();
				КонецПопытки;			
			КонецЕсли;
			
			
			
			// Очищаем набор записей и создаем приемники данных.
			Пока ЕстьСледующийДокумент И ?(НЕ ВыборкаДокументов.ЧастныйСектор, ВыборкаДокументов.Строение, ПустоеСтроение) = ?(НЕ Выборка.ЧастныйСектор, Выборка.Строение, ПустоеСтроение)  Цикл
				ОчиститьНаборыЗаписей(Организация, ПериодНачисления, Район, ВыборкаДокументов.ЧастныйСектор, ВыборкаДокументов.Строение, ВыборкаДокументов.ДокРегистратор, ВыборкаДокументов.ЭтоВводНачальныхОстатков);
				
				ЕстьСледующийДокумент 						= ВыборкаДокументов.Следующий();
				Если Не ЕстьСледующийДокумент Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			НаборСтабильныеПериоды								= РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
			НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			НаборСтабильныеПериодыШкалы							= РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
			НаборСтабильныеПериодыШкалы.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			НаборСтабильныеПериодыИзмерителиНаправлений 		= РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
			НаборСтабильныеПериодыИзмерителиНаправлений.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			НаборНомерСтрокСтабПериода 							= РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
			НаборНомерСтрокСтабПериода.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			НаборМаксимальныеПоказания 							= РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
			НаборМаксимальныеПоказания.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
		КонецЕсли;     		
		
		СтрокаСтабПериоды  										= НаборСтабильныеПериоды.добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСтабПериоды, Выборка);	
		Если Выборка.ЭтоВводНачальныхОстатков Тогда
			ЗаполнитьСоставЖильцов(СтрокаСтабПериоды, Выборка, СоставЖильцовРазделенныхЛС);
		КонецЕсли;
		СтрокаСтабПериоды.ПериодНачисления 						= ПериодНачисления;
		
		СтрокаНомеровСтрок 										= НаборНомерСтрокСтабПериода.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНомеровСтрок, Выборка);
		СтрокаНомеровСтрок.ПериодНачисления 					= ПериодНачисления;
		СтрокаНомеровСтрок.период  								= Выборка.ДатаРегистратора;
		
		ТекМКД		 											= ?(НЕ Выборка.ЧастныйСектор, Выборка.Строение, ПустоеСтроение);
	КонецЦикла;  
	
	Если ТекМКД <> Неопределено Тогда 
		
		Пока ЕстьСледующийПоказания И ?(НЕ ВыборкаПоказания.ЧастныйСектор, ВыборкаПоказания.Строение, ПустоеСтроение) = ТекМКД  Цикл
			
			СтрокаНабораПоказаний 								= НаборМаксимальныеПоказания.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаПоказания);
			
			Если ВыборкаПоказания.ЭтоВводНачальныхОстатков Тогда
				СтрокаНабораПоказаний 							= НаборМаксимальныеПоказания.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаПоказания);
				СтрокаНабораПоказаний.ПериодНачисления 			= НачалоМесяца(ВыборкаПоказания.ПериодНачисления - 1);
			КонецЕсли;
			
			ЕстьСледующийПоказания 								= ВыборкаПоказания.Следующий();
			Если Не ЕстьСледующийПоказания Тогда
				Прервать;
			КонецЕсли;					
		КонецЦикла;
		
		Пока ЕстьСледующийШКалы И ?(НЕ ВыборкаШкалы.ЧастныйСектор, ВыборкаШкалы.Строение, ПустоеСтроение) = ТекМКД Цикл
			
			СтрокаНабораПоказаний 								= НаборСтабильныеПериодыШкалы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаШкалы);
			
			ЕстьСледующийШКалы 									= ВыборкаШкалы.Следующий();
			Если Не ЕстьСледующийШКалы Тогда
				Прервать;
			КонецЕсли;					
		КонецЦикла;		
		
		Пока ЕстьСледующийИзмерители И ?(НЕ ВыборкаИзмерители.ЧастныйСектор, ВыборкаИзмерители.Строение, ПустоеСтроение) = ТекМКД  Цикл
			
			СтрокаНабораИзмерители 								= НаборСтабильныеПериодыИзмерителиНаправлений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабораИзмерители, ВыборкаИзмерители);
			
			ЕстьСледующийИзмерители 							= ВыборкаИзмерители.Следующий();
			Если Не ЕстьСледующийИзмерители Тогда
				Прервать;
			КонецЕсли;					
		КонецЦикла;
		
		Попытка 				
			Если СбрасыватьСостояниеПоследовательности тогда 
				СброситьСостояниеПоследовательности("энргСтабильныеПериодыПоследовательность",	Организация,ПериодНачисления,Район,ТекМКД);
				СброситьСостояниеПоследовательности("энргПоказанияПУПоследовательность",		Организация,ПериодНачисления,Район,ТекМКД);
				СброситьСостояниеПоследовательности("энргВзаиморасчетыПоследовательность",		Организация,ПериодНачисления,Район,ТекМКД);
			КонецЕсли;
			НаборОтложенные 									= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
			НаборОтложенные.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборОтложенные.отбор.Организация.установить(Организация);
			НаборОтложенные.отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборОтложенные.отбор.Район.установить(Район); 						
			НаборОтложенные.отбор.РазделЗаписи.установить(Перечисления.энргРазделыЗаписи.СтабильныеПериоды);
			НаборОтложенные.отбор.ЧастныйСектор.установить(Не ЗначениеЗаполнено(ТекМКД));
			НаборОтложенные.отбор.Строение.установить(ТекМКД);
			НаборОтложенные.Записать();  
			
			НаборСтабильныеПериоды.записать(Ложь);
			НаборСтабильныеПериодыШкалы.записать(Ложь);
			НаборСтабильныеПериодыИзмерителиНаправлений.Записать(Ложь);
			НаборНомерСтрокСтабПериода.записать(Ложь);			
			НаборМаксимальныеПоказания.записать(Ложь);
			
			ЗафиксироватьТранзакцию(); 			
		Исключение
			ОтменитьТранзакцию();
			
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("Заполнение начальных остатков по району " +Район + " за период:" + ПериодНачисления ,УровеньЖурналаРегистрации.Ошибка,,,ПредставлениеОшибки);
			Ошибки = ?(Не ПустаяСтрока(Ошибки), Символы.ПС,"") + ПредставлениеОшибки;			
		КонецПопытки;	
	КонецЕсли;  	
	
	Попытка
		ПересчитатьСреднийОбъем(Организация, ПериодНачисления, Район, Строение);
	Исключение
		ПредставлениеОшибки 										= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Ошибки 														= ?(Не ПустаяСтрока(Ошибки), Символы.ПС,"") + "Расчет среднего: " + ПредставлениеОшибки;	
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает средний объем.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Строение			-	СправочникСсылка.энргСтроения.
//
Процедура ПересчитатьСреднийОбъем(Организация, ПериодНачисления, Район, Строение)
	
	ЧастныйСектор 												= Неопределено;
	Если Не Строение = Неопределено И  ЗначениеЗаполнено(Строение) Тогда
		ЧастныйСектор 											= Ложь;
	ИначеЕсли Не Строение = Неопределено Тогда
		ЧастныйСектор 											= Истина;		
	КонецЕсли;	
	
	Если НЕ ЧастныйСектор = Неопределено И ЧастныйСектор И НЕ Строение = Неопределено И НЕ ЗначениеЗаполнено(Строение) Тогда
		ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления, Район, ЧастныйСектор);
	Иначе
		ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления, Район, ЧастныйСектор, Строение);
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьСреднийОбъем()

// Отложенные движения документов начисления МКД регламентных процедур.
//
// Параметры:
//   Организация							-	СправочникСсылка.Организации.
//   ПериодНачисления 						-	Дата.
//   Район									-	СправочникСсылка.энргЗоныОтвественности.
//   МКД									-	СправочникСсылка.энргСтроения.
//   СбрасыватьСостояниеПоследовательности	-	Булево.
//
Процедура ОтложенныеДвиженияДокументовНачисленияМКД(Организация, ПериодНачисления, Район, МКД = Неопределено,СбрасыватьСостояниеПоследовательности = Истина) Экспорт 
	
	Если Не ЗначениеЗаполнено(ПериодНачисления) или Не ЗначениеЗаполнено(Район) тогда
		Возврат;
	КонецЕсли;
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  											= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета										= ГраницыПериода.НачалоОП;
	
	МВТ  														= Новый МенеджерВременныхТаблиц;
	
	Результат 													= РезультатНачальныеОстаткиСтабильногоПериодаМКД(Организация, ПериодНачисления,Район,МКД,НачалоПериодаРасчета);
	Выборка  													= Результат[0].Выбрать();
	
	ВыборкаПоказания 											= Результат[1].Выбрать();
	ВыборкаШкалы	 											= Результат[2].Выбрать();
	ВыборкаСоставУзла											= Результат[3].Выбрать();
	
	ПериодНачисленияПред 										= НачалоМесяца(НачалоМесяца(ПериодНачисления)-1);
	ТекМКД  													= Неопределено;
	
	Если Выборка.Количество() > 0 тогда		
		НачатьТранзакцию();
	Иначе
		Возврат;	
	КонецЕсли;	
	
	мМКД 		= Результат[0].Выгрузить().ВыгрузитьКолонку("МКД");
	МассивМКД 	= ОбщегоНазначенияКлиентСервер.СвернутьМассив(мМКД);
	ОчиститьНаборыЗаписейМКД(Организация, ПериодНачисления, Район, МассивМКД);
	
	Если СбрасыватьСостояниеПоследовательности тогда 
		СброситьСостояниеПоследовательности("энргСтабильныеПериодыМКДПоследовательность",	Организация,ПериодНачисления,Район);
		СброситьСостояниеПоследовательности("энргПоказанияПУПоследовательностьМКД",			Организация,ПериодНачисления,Район);
	КонецЕсли;
	
	НаборСтабильныеПериоды										= РегистрыСведений.энргСтабильныеПериодыМКД.СоздатьНаборЗаписей();
	НаборСтабильныеПериодыШкалы									= РегистрыСведений.энргСтабильныеПериодыМКДШкалы.СоздатьНаборЗаписей();
	НаборСтабильныеПериодыСоставУзла							= РегистрыСведений.энргСтабильныеПериодыМКДСоставУзловУчета.СоздатьНаборЗаписей();
	НаборНомерСтрокСтабПериода 									= РегистрыСведений.энргНомераСтрокСтабильногоПериодаМКД.СоздатьНаборЗаписей();
	НаборМаксимальныеПоказания 									= РегистрыСведений.энргМаксимальныеПоказанияСрезМКД.СоздатьНаборЗаписей();			
	НаборМаксимальныеПоказанияПред 								= РегистрыСведений.энргМаксимальныеПоказанияСрезМКД.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() цикл		
		СтрокаСтабПериоды  										= НаборСтабильныеПериоды.добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСтабПериоды,Выборка);	
		СтрокаСтабПериоды.ПериодНачисления 						= ПериодНачисления;
		
		СтрокаНомеровСтрок 										= НаборНомерСтрокСтабПериода.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНомеровСтрок,Выборка);
		СтрокаНомеровСтрок.ПериодНачисления 					= ПериодНачисления;
		СтрокаНомеровСтрок.период  								= Выборка.ДатаРегистратора;		
	КонецЦикла;  
	
	Пока ВыборкаПоказания.Следующий() Цикл		
		СтрокаНабораПоказаний 									= НаборМаксимальныеПоказания.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаПоказания);
	КонецЦикла;	
	
	Пока ВыборкаШкалы.Следующий() Цикл		
		СтрокаНабора 											= НаборСтабильныеПериодыШкалы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаШкалы);					
	КонецЦикла;	
	
	Пока ВыборкаСоставУзла.Следующий() Цикл		
		СтрокаНабора 											= НаборСтабильныеПериодыСоставУзла.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаСоставУзла);					
	КонецЦикла;
	
	Попытка 				
		НаборОтложенные 									= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
		НаборОтложенные.отбор.Организация.установить(Организация);
		НаборОтложенные.отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборОтложенные.отбор.Район.установить(Район); 						
		НаборОтложенные.отбор.РазделЗаписи.установить(Перечисления.энргРазделыЗаписи.СтабильныеПериодыМКД);
		//Если Не МКД = Неопределено  Тогда
		//	НаборОтложенные.Отбор.ЧастныйСектор.установить(Ложь);
		//	НаборОтложенные.Отбор.Строение.установить(МКД);
		//КонецЕсли;
		НаборОтложенные.Записать();  
		
		НаборСтабильныеПериоды.записать(Ложь);
		НаборСтабильныеПериодыШкалы.записать(Ложь);
		НаборСтабильныеПериодыСоставУзла.записать(Ложь);
		НаборНомерСтрокСтабПериода.записать(Ложь);			
		НаборМаксимальныеПоказания.записать(Ложь);
		//Если ВводНачальныхОстатков тогда
		//	НаборМаксимальныеПоказанияПред.записать(Ложь);
		//КонецЕсли;
		ЗафиксироватьТранзакцию(); 			
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//ЗаписьЖурналаРегистрации("Заполнение начальных остатков МКД по району " +Район + " за период:" + ПериодНачисления ,УровеньЖурналаРегистрации.Ошибка,,,ПредставлениеОшибки);
		ВызватьИсключение ПредставлениеОшибки; 
		ОтменитьТранзакцию();
	КонецПопытки;		 	
	
	ПересчитатьСреднийОбъемПотребленияМКД(Организация, ПериодНачисления,Район); 	
	
КонецПроцедуры

// Пересчитывает средний объем потребления МКД.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//
Процедура ПересчитатьСреднийОбъемПотребленияМКД(Организация, ПериодНачисления,Район) Экспорт 
	
	Результат 						= РезультатаЗапросаСреднегоПотребленияМКД(Организация, ПериодНачисления,Район);
	Выборка  						= Результат.выбрать();
	Набор  							= РегистрыСведений.энргСреднийОбъемПотребленияМКД.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.район.установить(Район);	
	Набор.Записать();
	
	Набор  							= РегистрыСведений.энргСреднийОбъемПотребленияМКД.СоздатьНаборЗаписей();				 
	Пока Выборка.следующий() цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(),Выборка);		
	КонецЦикла;
	Набор.Записать(Ложь);
	
	
КонецПроцедуры

// Пересчитывает средний объем потребления абонентов.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  ЧастныйСектор		-	Булево.
//  Строение			-	СправочникСсылка.энргСтроения.
//  Помещение			-	СправочникСсылка.энргПомещения.
//
Процедура ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления,Район,ЧастныйСектор=Неопределено,Строение=Неопределено,Помещение=Неопределено) Экспорт 
	РегистрыСведений.энргСреднийОбъемПотребленияАбонентов.АктуализироватьДанныеСреднегоОбъема(Организация, ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение);	
КонецПроцедуры

#КонецОбласти

// Восстанавливает последовательность по абоненту.
//
// Параметры:
//   Организация			-	СправочникСсылка.Организации			-	организация, по которой происходит восстановление последовательности.
//   ПериодНачисления		-	Дата									-	период начисления, по которому происходит восстановление последовательности.
//   Район					-	СправочникСсылка.энргЗоныОтвественности	-	район, по которому происходит восстановление последовательности.
//   ЧастныйСектор			-	Булево									-	частный сектор, по которому происходит восстановление последовательности.
//   Строение				-	СправочникСсылка.энргСтроения			-	строение, по которому происходит восстановление последовательности.
//   Помещение				-	СправочникСсылка.энргПомещения			-	помещение, по которому происходит восстановление последовательности.
//   Абонент				-	СправочникСсылка.энргАбоненты			-	абонент, по которому происходит восстановление последовательности.
//   ТолькоПоказания 		-	Булево									-	структура передаваемых показаний.
//
Процедура ВосстановитьПоследовательностьПоАбоненту(Организация, ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Абонент,ТолькоПоказания = Истина) Экспорт  
	ПараметрыЗадания  			= Новый Массив;
	Параметры					= Новый Структура;
	Параметры.Вставить("Организация",		Организация);
	Параметры.Вставить("ПериодНачисления",	ПериодНачисления);
	Параметры.Вставить("Район",				Район);
	Параметры.Вставить("ЧастныйСектор",		ЧастныйСектор);
	Параметры.Вставить("Строение",			Строение);
	Параметры.Вставить("МКД",				?(ЧастныйСектор,Справочники.энргСтроения.ПустаяСсылка(),Строение));
	Параметры.Вставить("Помещение",			Помещение);
	Параметры.Вставить("Абонент",			Абонент);
	Параметры.Вставить("СписокМКД",			Неопределено);
	ПараметрыЗадания.Добавить(Параметры);
	
	Если Не ТолькоПоказания Тогда
		ФоновыеЗадания.Выполнить("энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериоды",		ПараметрыЗадания);
	КонецЕсли;
	
	ФоновыеЗадания.Выполнить("энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУ",			ПараметрыЗадания);	
	
КонецПроцедуры

// Восстанавливает последовательность по МКД.
//
// Параметры:
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//   МКД					- МКД, по которому происходит восстановление последовательности.
//
Процедура ВосстановитьПоследовательностьПоМКД(Организация, ПериодНачисления,Район,МКД) Экспорт  
	ПараметрыЗадания  			= Новый Массив;
	Параметры					= Новый Структура;
	Параметры.Вставить("Организация",		Организация);
	Параметры.Вставить("ПериодНачисления",	ПериодНачисления);
	Параметры.Вставить("Район",				Район);
	Параметры.Вставить("МКД",				МКД);
	ПараметрыЗадания.Добавить(Параметры);
	
	ФоновыеЗадания.Выполнить("энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериодыМКД",		ПараметрыЗадания);
	ФоновыеЗадания.Выполнить("энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУМКД",			ПараметрыЗадания);
КонецПроцедуры

// Выполняет регламетные операции ОДН.
//
// Параметры:
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//
Процедура ВыполнитьРегламетныеОперацииОДН(Организация, ПериодНачисления,Район) Экспорт 	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ОтложенныеДвиженияДокументовНачисленияМКД",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	ОтложенныеДвиженияДокументовНачисленияМКД(Организация, ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ВосстановитьПоследовательностьСтабильныеПериодыМКД",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	ВосстановитьПоследовательностьСтабильныеПериодыМКД(Организация, ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ВосстановитьПоследовательностьПоказанияПУМКД",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);	
	ВосстановитьПоследовательностьПоказанияПУМКД(Организация, ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
КонецПроцедуры

// Выполняет регламетные операции индивидуальные.
//
// Параметры:
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//
Процедура ВыполнитьРегламетныеОперацииИндивидуальные(Организация, ПериодНачисления,Район) Экспорт  	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ОтложенныеДвиженияДокументовНачисления",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	ОтложенныеДвиженияДокументовНачисления(Организация, ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ВосстановитьПоследовательностьСтабильныеПериоды",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериоды(Новый Структура("Организация,ПериодНачисления,Район,ЧастныйСектор,МКД,Помещение",Организация, ПериодНачисления,Район,Неопределено,Неопределено,Неопределено));
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ВосстановитьПоследовательностьПоказанияПУ",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	ВосстановитьПоследовательностьПоказанияПУ(Организация, ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ПерерасчетСреднихНачислений",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	энргНачисления.СнятьСредниеНачисления(Новый Структура("Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение",Организация, ПериодНачисления,Район,Неопределено,Неопределено,Неопределено));
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ВосстановитьПоследовательностиВзаиморасчетов",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	ВосстановитьПоследовательностьВзаиморасчеты(Организация, ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	
КонецПроцедуры

// Восстанавливает последовательность стабильные периоды МКД.
//
// Параметры:
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//   МКД					- МКД, по которому происходит восстановление последовательности.
//
Процедура ВосстановитьПоследовательностьСтабильныеПериодыМКД(Организация, ПериодНачисления,Район,МКД=Неопределено) Экспорт 
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  							= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета						= ГраницыПериода.НачалоОП;
	
	Отбор 										= Новый Структура;
	Отбор.Вставить("Организация",			Организация);
	Отбор.Вставить("ПериодНачисления",		ПериодНачисления);
	Отбор.Вставить("Район",Район);
	Если МКД<>Неопределено тогда
		Отбор.Вставить("МКД",МКД);
	КонецЕсли;
	
	Отказ 										= Ложь; 	
	
	//НачатьТранзакцию();
	//УстановитьБлокировкуНабораЗаписейПоследовательностиПоРегистратору(Отбор, "энргСтабильныеПериодыМКД",Отказ);
	//
	//Если Отказ тогда
	//	ОтменитьТранзакцию();
	//	Возврат;
	//КонецЕсли;
	
	Результат 									= РезультатЗапросаСтабильныеПериодыМКД(Отбор); 	
	Выборка  									= Результат.Выбрать();
	
	ПроведенВПоследовательности 				= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	Исключен 									= Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности; 
	Ошибки 										= "";
	МассивДокументов 							= Новый Массив;
	ТекМКД  									= Неопределено;
	
	НовыеУзлы									= энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД();
	
	Если Результат.Пустой() тогда
		Возврат;
	КонецЕсли;
	
	
	НачатьТранзакцию();
	УстановитьБлокировкуНабораЗаписейПоследовательностиПоРегистратору(Отбор, "энргСтабильныеПериодыМКД", Отказ);
	
	Если Отказ тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Пока Выборка.следующий() цикл  		
		Если ТекМКД <> Выборка.МКД тогда 						
			Если ТекМКД <> Неопределено тогда // Это не первая строка.				
				врОшибки 						= ПровестиПоСтабильнымПериодамМКД(МассивДокументов,Ошибки,НачалоПериодаРасчета);
				Если ПустаяСтрока(врОшибки) тогда
					// Если все выполнено тогда изменяем состояние в последовательности.
					НаборПоследовательности  	= РегистрыСведений.энргСтабильныеПериодыМКДПоследовательность.СоздатьНаборЗаписей();
					НаборПоследовательности.Отбор.Организация.установить(Организация);
					НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
					НаборПоследовательности.Отбор.Район.установить(Район);
					НаборПоследовательности.Отбор.МКД.установить(ТекМКД);
					НаборПоследовательности.Прочитать();
					ТаблицаНабора  				= НаборПоследовательности.Выгрузить();
					НаборПоследовательности.Очистить();
					НаборПоследовательности.Записать();
					для Каждого стр из ТаблицаНабора цикл
						стр.СостояниеПроведения = ПроведенВПоследовательности;
					КонецЦикла;
					НаборПоследовательности  	= РегистрыСведений.энргСтабильныеПериодыМКДПоследовательность.СоздатьНаборЗаписей();
					НаборПоследовательности.Загрузить(ТаблицаНабора);
					НаборПоследовательности.Записать(Ложь); 										
					ЗафиксироватьТранзакцию();
					НачатьТранзакцию();
				иначе
					Ошибки 						= Ошибки + ?(НЕ ПустаяСтрока(Ошибки),Символы.ПС,"") + врОшибки; 
					ОтменитьТранзакцию();
					НачатьТранзакцию();
				КонецЕсли;					
			КонецЕсли;
			МассивДокументов 					= Новый Массив; 			
		КонецЕсли;
		
		ОписаниеСтроки 							= Новый ФиксированнаяСтруктура("Организация, ПериодНачисления,Район,МКД,ПериодРегистрации,Документ,МоментВремени,Дата, НовыеУзлы");
		
		Набор 									= РегистрыСведений.энргСтабильныеПериодыМКД.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления); 
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Записать();
		
		Набор 									= РегистрыСведений.энргНомераСтрокСтабильногоПериодаМКД.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления); 
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Записать();		
		
		Набор 									= РегистрыСведений.энргСтабильныеПериодыМКДШкалы.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления); 
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Записать();
		
		Набор 									= РегистрыСведений.энргСтабильныеПериодыМКДСоставУзловУчета.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления); 
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Записать();
		
		Если Выборка.СостояниеПроведения = Исключен тогда
			
			НаборПоследовательности  			= РегистрыСведений.энргСтабильныеПериодыМКДПоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.Организация.установить(Организация);
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.МКД.установить(Выборка.МКД);
			НаборПоследовательности.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
			НаборПоследовательности.Записать();
			
			ТекМКД  							= Выборка.МКД;  	
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки  							= Новый Структура(ОписаниеСтроки);
		ДанныеСтроки.Организация 				= Организация;
		ДанныеСтроки.ПериодНачисления 			= ПериодНачисления;
		ДанныеСтроки.Район 						= Район;
		ДанныеСтроки.МКД 						= Выборка.МКД;
		ДанныеСтроки.Документ					= Выборка.ДокРегистратор;
		ДанныеСтроки.ПериодРегистрации			= Выборка.ПериодРегистрации;
		ДанныеСтроки.МоментВремени  			= Новый МоментВремени(Выборка.ДатаРегистратора,Выборка.ДокРегистратор);
		ДанныеСтроки.Дата			  			= Выборка.ДатаРегистратора;
		ДанныеСтроки.НовыеУзлы			  		= НовыеУзлы;
		
		МассивДокументов.Добавить(ДанныеСтроки);// Добавляем в набор.			
		ТекМКД  								= Выборка.МКД; 		
	КонецЦикла; 	
	
	Если ТекМКД <> Неопределено тогда
		// Закончили чистку можно проводить документы.
		врОшибки 								= ПровестиПоСтабильнымПериодамМКД(МассивДокументов,Ошибки,НачалоПериодаРасчета);
		Если ПустаяСтрока(врОшибки) тогда
			// Если все выполнено тогда изменяем состояние в последовательности.
			НаборПоследовательности  			= РегистрыСведений.энргСтабильныеПериодыМКДПоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.Организация.установить(Организация);
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.МКД.установить(ТекМКД);
			НаборПоследовательности.Прочитать();
			ТаблицаНабора  						= НаборПоследовательности.Выгрузить();
			НаборПоследовательности.Очистить();
			НаборПоследовательности.Записать();
			для Каждого стр из ТаблицаНабора цикл
				стр.СостояниеПроведения 		= ПроведенВПоследовательности;
			КонецЦикла;
			НаборПоследовательности  			= РегистрыСведений.энргСтабильныеПериодыМКДПоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Загрузить(ТаблицаНабора);
			НаборПоследовательности.Записать(Ложь);				
			ЗафиксироватьТранзакцию();
		иначе
			Ошибки 						= Ошибки + ?(НЕ ПустаяСтрока(Ошибки),Символы.ПС,"") + врОшибки;
			ОтменитьТранзакцию();	
		КонецЕсли; 					
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

// Устарел. Использовать обработку "энргСервисВосстановленияПоследовательностиПоказаний". Восстановить Последовательность
// Показания ПУ.
//
// Параметры:
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//	 ЧастныйСектор 			- Частный сектор, по которому происходит восстановление последовательности.
//	 Строение 				- Строение, по которому происходит восстановление последовательности.
//	 Помещение 				- Помещение, по которому происходит восстановление последовательности.
//
Процедура ВосстановитьПоследовательностьПоказанияПУ(Организация, ПериодНачисления,Район,ЧастныйСектор=Неопределено,Строение=Неопределено,Помещение=Неопределено) Экспорт 
	
	ВызватьИсключение "Метод устарел";
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  							= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета						= ГраницыПериода.НачалоОП;
	КолвоНедопусковПодряд						= энргРаботаСКонстантами.ЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний();
	
	Отбор 										= Новый Структура;
	Отбор.Вставить("Организация",				Организация);
	Отбор.Вставить("ПериодНачисления",			ПериодНачисления);
	Отбор.Вставить("Район",						Район);	
	Отбор.Вставить("ЧастныйСектор",				ЧастныйСектор);
	Отбор.Вставить("Строение",					Строение);
	Отбор.Вставить("Помещение",					Помещение);
	Отбор.Вставить("ПриборУчета",				Неопределено);
	Отбор.Вставить("КолвоНедопусковПодряд",		КолвоНедопусковПодряд);
	Отбор.Вставить("КонецПериодаРасчета",		ГраницыПериода.ЗавершениеОП);
	
	Отказ 										= Ложь;
	Ошибки 										= "";
	
	МВТ  										= Новый МенеджерВременныхТаблиц;
	Результат  									= РезультатЗапросаПоказанияПУ(МВТ,Отбор,НачалоПериодаРасчета);
	
	ДанныеМаксимальногоПотребления 				= ДанныеМаксимальногоПотребления(НачалоПериодаРасчета);
	
	РезультатСреднийОбъем 						= РезультатСреднийОбъемПотребления(МВТ,Отбор);
	ВыборкаСреднийОбъем 						= РезультатСреднийОбъем.выбрать();
	
	ПроведенСНарушением 						= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
	ПроведенВПоследовательности 				= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	ПредыдущиеМакс 								= 0;
	Выборка  									= Результат.выбрать();
	ТекЧастныйСектор							= Неопределено;
	ТекСтроение									= Неопределено;
	ТекПомещение								= Неопределено;
	ТекКлючПомещения							= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала		 							= Неопределено;
	ТекТарифнаяЗона 							= Неопределено;
	ТекРегистрируетОбъем 						= Неопределено;
	МассивДокументов							= Неопределено;
	НомерПозиции 								= Неопределено;
	ДанныеСреднегоОбъема 						= Неопределено;
	ТекНедопускПрибора                          = Неопределено;
	ОписаниеСтроки 								= Новый ФиксированнаяСтруктура("
	|ДокРегистратор,СостояниеПроведения,ПериодРегистрации,ДатаРегистратора,
	|СостояниеПоказаний,ПричинаОтклонения,Показание,Переворот,МаксПоказания,ПериодМаксПоказаний,	 
	|РегистраторМаксПоказаний,ДатаРегистратораМаксимальных,БылПереворот,Разделитель,НомерСтрокиТЧ,
	|КоэффициентПУ,МаксимальноВозможныеПоказания,ВыводПрибораУчета,ИмяТабЧасти,КС,ТочкаУчета");
	
	Если Выборка.количество() > 0 тогда
		ВыборкаСреднийОбъем.Следующий();
		НачатьТранзакцию();
	КонецЕсли;
	
	ОписаниеПараметрыПроведений					= "Организация, ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,КлючПомещения,
	|ПриборУчета,Шкала, ТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета,РегистрируетОбъем, НедопускПрибора, НачПокНеЯвляютсяКонечнымиПриУстПрибора, РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу";
	
	СтруктураСреза  							= РегистрыСведений.энргПериодыПриемаПоказаний.ПолучитьПоследнее(ПериодНачисления, Новый Структура("Организация", Организация));
	ПоказанияС									= ?(не ЗначениеЗаполнено(СтруктураСреза.ДатаС),1,СтруктураСреза.ДатаС);
	ПоказанияПО 								= ?(не ЗначениеЗаполнено(СтруктураСреза.ДатаПо),31,СтруктураСреза.ДатаПо);
	
	НачПокНеЯвляютсяКонечнымиПриУстПрибора				= энргРаботаСКонстантами.ЗначениеКонстантыНачальныеПоказанияПУНеРавныКонечнымВПериодеВведенияВЭксплуатациюПУ();
	РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу 	= энргРаботаСКонстантами.ЗначениеКонстантыРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу();
	
	//
	МенеджерэнргПоказанияПУПоследовательность = РегистрыСведений.энргПоказанияПУПоследовательность;
	МенеджерэнргПредоставленныеПоказания	  = РегистрыСведений.энргПредоставленныеПоказания;
	МенеджерэнргРасчетСреднегоОбъема		  =	РегистрыСведений.энргРасчетСреднегоОбъема;
	МенеджерэнргМаксимальныеПоказания		  = РегистрыСведений.энргМаксимальныеПоказания;
	МенеджерэнргМаксимальныеПоказанияСрез	  = РегистрыСведений.энргМаксимальныеПоказанияСрез;
	
	МенеджерыРегистров = Новый Структура;
	МенеджерыРегистров.Вставить("энргПоказанияПУПоследовательность", МенеджерэнргПоказанияПУПоследовательность);
	МенеджерыРегистров.Вставить("энргПредоставленныеПоказания", МенеджерэнргПредоставленныеПоказания);
	МенеджерыРегистров.Вставить("энргРасчетСреднегоОбъема", МенеджерэнргРасчетСреднегоОбъема);
	МенеджерыРегистров.Вставить("энргМаксимальныеПоказания", МенеджерэнргМаксимальныеПоказания);
	МенеджерыРегистров.Вставить("энргМаксимальныеПоказанияСрез", МенеджерэнргМаксимальныеПоказанияСрез);
	
	// 
	СтатичныеДопПараметры = СтатичныеДополнительныеПараметрыПоказаний();
	
	
	Пока Выборка.следующий() цикл
		Если НЕ ТекЧастныйСектор = Выборка.ЧастныйСектор
			ИЛИ НЕ ТекСтроение = Выборка.Строение 
			ИЛИ ТекПомещение<> Выборка.Помещение
			ИЛИ ТекПрибор <> Выборка.ПриборУчета
			ИЛИ ТекШкала <> Выборка.Шкала
			ИЛИ ТекТарифнаяЗона <> Выборка.ТарифнаяЗона тогда 			  			
			Если ТекПомещение <> Неопределено тогда
				
				Если Не Отказ Тогда
					ПараметрыПроведений  		= Новый Структура(ОписаниеПараметрыПроведений,
					Организация, ПериодНачисления, Район, ТекЧастныйСектор,ТекСтроение,ТекПомещение,ТекКлючПомещения,ТекПрибор,Текшкала,ТекТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета,ТекРегистрируетОбъем, ТекНедопускПрибора, НачПокНеЯвляютсяКонечнымиПриУстПрибора, РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу);
					ОтказПоТарифнойЗоне			= Ложь;
					ОтказПоТарифнойЗоне			= ПровестиПоказанияПриборовУчета(ПараметрыПроведений, МассивДокументов, ДанныеСреднегоОбъема, ДанныеМаксимальногоПотребления, Ошибки, МенеджерыРегистров, СтатичныеДопПараметры);
					
					Если ОтказПоТарифнойЗоне Тогда
						Отказ 					= Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если  ТекПомещение<> Выборка.Помещение или ТекПрибор <> Выборка.ПриборУчета тогда
					Если не Отказ Тогда
						// Если все выполнено тогда изменяем состояние в последовательности.
						НаборПоследовательности  = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);//РегистрыСведений.энргПоказанияПУПоследовательность.СоздатьНаборЗаписей();
						НаборПоследовательности.Отбор.Организация.установить(Организация);
						НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
						НаборПоследовательности.Отбор.Район.установить(Район);
						НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
						НаборПоследовательности.Отбор.ЧастныйСектор.установить(ТекЧастныйСектор);
						НаборПоследовательности.Отбор.Строение.установить(ТекСтроение);
						НаборПоследовательности.Отбор.Помещение.установить(ТекПомещение);
						НаборПоследовательности.Отбор.ПриборУчета.установить(ТекПрибор);
						НаборПоследовательности.Прочитать();
						ТаблицаНабора  			= НаборПоследовательности.Выгрузить();
						НаборПоследовательности.Очистить();
						НаборПоследовательности.Записать();
						
						ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности,"СостояниеПроведения");
						
						НаборПоследовательности  = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);//РегистрыСведений.энргПоказанияПУПоследовательность.СоздатьНаборЗаписей();
						НаборПоследовательности.Загрузить(ТаблицаНабора);
						НаборПоследовательности.Записать(Ложь); 										
						ЗафиксироватьТранзакцию();
						НачатьТранзакцию();
						Отказ					= Ложь;
					иначе
						ОтменитьТранзакцию();
						НачатьТранзакцию();
					КонецЕсли;
				КонецЕсли;
				
				МассивДокументов.очистить();
			КонецЕсли;
			
			Если ТекПомещение <> Выборка.Помещение Тогда
				ДанныеСреднегоОбъема 			= ДанныеСреднегоОбъемаАбонента(ВыборкаСреднийОбъем, Выборка.ЧастныйСектор, Выборка.Строение, Выборка.Помещение);
			КонецЕсли;
			
			МассивДокументов					= Новый Массив;
			НомерПозиции 						= Выборка.НомерПозици+1;
		КонецЕсли; 	
		
		ДанныеСтроки 							= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,Выборка);
		МассивДокументов.Добавить(ДанныеСтроки); 	
		
		// Очищаем данные
		Набор 									= СоздатьНаборЗаписей(МенеджерэнргПредоставленныеПоказания);//РегистрыСведений.энргПредоставленныеПоказания.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.периодНачисления.установить(ПериодНачисления);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
		Набор.Отбор.Строение.установить(Выборка.Строение);
		Набор.Отбор.Помещение.установить(Выборка.Помещение);
		Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
		Набор.Отбор.Шкала.установить(Выборка.Шкала);
		Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
		Набор.Записать();
		
		Набор 										= СоздатьНаборЗаписей(МенеджерэнргРасчетСреднегоОбъема);//РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
		Набор.Отбор.Строение.установить(Выборка.Строение);
		Набор.Отбор.Помещение.установить(Выборка.Помещение);
		Набор.Отбор.ТочкаУчета.установить(Выборка.ТочкаУчета);
		Набор.Отбор.Шкала.установить(Выборка.Шкала);
		Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		Набор.Записать();
		
		ТекЧастныйСектор 						= Выборка.ЧастныйСектор;
		ТекСтроение								= Выборка.Строение;
		ТекПомещение  							= Выборка.Помещение;
		ТекКлючПомещения						= Выборка.КлючПомещения;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекТарифнаяЗона 						= Выборка.ТарифнаяЗона;
		ТекРегистрируетОбъем					= Выборка.РегистрируетОбъем;
		ТекНедопускПрибора						= Выборка.НедопускПрибора;
	КонецЦикла;
	
	Если НЕ ТекПомещение = Неопределено  тогда
		
		Если Не Отказ Тогда
			ПараметрыПроведений  		= Новый Структура(ОписаниеПараметрыПроведений,
			Организация, ПериодНачисления,Район,ТекЧастныйСектор,ТекСтроение,ТекПомещение,ТекКлючПомещения,ТекПрибор,ТекШкала,ТекТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета,ТекРегистрируетОбъем, ТекНедопускПрибора, НачПокНеЯвляютсяКонечнымиПриУстПрибора, РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу);
			ОтказПоТарифнойЗоне			= Ложь;
			ОтказПоТарифнойЗоне			= ПровестиПоказанияПриборовУчета(ПараметрыПроведений, МассивДокументов, ДанныеСреднегоОбъема, ДанныеМаксимальногоПотребления, Ошибки, МенеджерыРегистров, СтатичныеДопПараметры);
			
			Если ОтказПоТарифнойЗоне Тогда
				Отказ 					= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если не Отказ тогда
			// Если все выполнено тогда изменяем состояние в последовательности.
			НаборПоследовательности  			= СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);//РегистрыСведений.энргПоказанияПУПоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.Организация.установить(Организация);
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
			НаборПоследовательности.Отбор.ЧастныйСектор.установить(ТекЧастныйСектор);
			НаборПоследовательности.Отбор.Строение.установить(ТекСтроение);
			НаборПоследовательности.Отбор.Помещение.установить(ТекПомещение);
			НаборПоследовательности.Отбор.ПриборУчета.установить(ТекПрибор);
			НаборПоследовательности.Прочитать();
			ТаблицаНабора  						= НаборПоследовательности.Выгрузить();
			НаборПоследовательности.Очистить();
			НаборПоследовательности.Записать();
			
			ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности,"СостояниеПроведения");
			
			НаборПоследовательности  			= СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);//РегистрыСведений.энргПоказанияПУПоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Загрузить(ТаблицаНабора);
			НаборПоследовательности.Записать(Ложь); 										
			ЗафиксироватьТранзакцию();
		иначе
			ОтменитьТранзакцию(); 			 
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

// Восстанавливает последовательность показания ПУ МКД.
//
// Параметры:
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//	 Строение 				- Строение, по которому происходит восстановление последовательности. 
//
Процедура ВосстановитьПоследовательностьПоказанияПУМКД(Организация, ПериодНачисления,Район,Строение=Неопределено) Экспорт 
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  							= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета						= ГраницыПериода.НачалоОП;
	
	Отбор 										= Новый Структура;
	Отбор.Вставить("Организация",		Организация);
	Отбор.Вставить("ПериодНачисления",	ПериодНачисления);
	Отбор.Вставить("Район",				Район);	
	Отбор.Вставить("Строение",			Строение);
	
	Отказ 										= Ложь;
	
	МВТ  										= Новый МенеджерВременныхТаблиц;
	Результат  									= РезультатЗапросаПоказанияПУМКД(МВТ,Отбор,НачалоПериодаРасчета);
	
	ДанныеМаксимальногоПотребления 				= ДанныеМаксимальногоПотребления(НачалоПериодаРасчета);
	
	РезультатСреднийОбъем 						= РезультатСреднийОбъемПотребленияМКД(МВТ,Отбор);
	ВыборкаСреднийОбъем 						= РезультатСреднийОбъем.выбрать();
	
	ПроведенСНарушением 						= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
	ПроведенВПоследовательности 				= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	ПредыдущиеМакс 								= 0;
	Выборка  									= Результат.выбрать();
	ТекМКД 										= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала		 							= Неопределено;
	ТекТарифнаяЗона 							= Неопределено;
	ТекРегистрируетОбъем 						= Неопределено;
	МассивДокументов							= Неопределено;
	НомерПозиции 								= Неопределено;
	ДанныеСреднегоОбъема 						= Неопределено;
	ОписаниеСтроки 								= Новый ФиксированнаяСтруктура("
	|ДокРегистратор,СостояниеПроведения,ПериодРегистрации,ДатаРегистратора,
	|СостояниеПоказаний,Показание,Переворот,МаксПоказания,ПериодМаксПоказаний,	 
	|РегистраторМаксПоказаний,ДатаРегистратораМаксимальных,БылПереворот,Разделитель,НомерСтрокиТЧ,
	|КоэффициентПУ,МаксимальноВозможныеПоказания,ВыводПрибораУчета,ИмяТабЧасти,КС,ТочкаУчета");
	
	Если Выборка.количество() > 0 тогда
		ВыборкаСреднийОбъем.Следующий();
		НачатьТранзакцию();
	КонецЕсли;
	
	СтруктураСреза  								= РегистрыСведений.энргПериодыПриемаПоказаний.ПолучитьПоследнее(ПериодНачисления, Новый Структура("Организация", Организация));
	ПоказанияС										= ?(не ЗначениеЗаполнено(СтруктураСреза.ДатаС),1,СтруктураСреза.ДатаС);
	ПоказанияПО 									= ?(не ЗначениеЗаполнено(СтруктураСреза.ДатаПо),31,СтруктураСреза.ДатаПо);
	
	Пока Выборка.следующий() цикл
		Если ТекМКД<> Выборка.МКД или ТекПрибор <> Выборка.ПриборУчета Или ТекШкала <> Выборка.Шкала или ТекТарифнаяЗона <> Выборка.ТарифнаяЗона тогда 			  			
			Если ТекМКД <> Неопределено тогда
				
				Если Не Отказ Тогда
					ПараметрыПроведений  			= Новый Структура("
					|Организация, ПериодНачисления,Район,МКД,ПриборУчета,Шкала, ТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета,РегистрируетОбъем",
					Организация, ПериодНачисления,Район,ТекМКД,ТекПрибор,Текшкала,ТекТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета,ТекРегистрируетОбъем);
					ОтказПоТарифнойЗоне				= Ложь;
					ОтказПоТарифнойЗоне				= ПровестиПоказанияПриборовУчетаМКД(ПараметрыПроведений,МассивДокументов,ДанныеСреднегоОбъема,ДанныеМаксимальногоПотребления);
					
					Если ОтказПоТарифнойЗоне Тогда
						Отказ 						= Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если  ТекМКД<> Выборка.МКД или ТекПрибор <> Выборка.ПриборУчета тогда
					Если не Отказ Тогда
						// Если все выполнено тогда изменяем состояние в последовательности.
						НаборПоследовательности  	= РегистрыСведений.энргПоказанияПУПоследовательностьМКД.СоздатьНаборЗаписей();
						НаборПоследовательности.Отбор.Организация.установить(Организация);
						НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
						НаборПоследовательности.Отбор.Район.установить(Район);
						НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
						НаборПоследовательности.Отбор.МКД.установить(ТекМКД);
						НаборПоследовательности.Отбор.ПриборУчета.установить(ТекПрибор);
						НаборПоследовательности.Прочитать();
						ТаблицаНабора  				= НаборПоследовательности.Выгрузить();
						НаборПоследовательности.Очистить();
						НаборПоследовательности.Записать();
						
						ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности,"СостояниеПроведения");
						
						НаборПоследовательности  	= РегистрыСведений.энргПоказанияПУПоследовательностьМКД.СоздатьНаборЗаписей();
						НаборПоследовательности.Загрузить(ТаблицаНабора);
						НаборПоследовательности.Записать(Ложь); 										
						ЗафиксироватьТранзакцию();
						НачатьТранзакцию();
						Отказ						= Ложь;
					иначе
						ОтменитьТранзакцию();
						НачатьТранзакцию();
					КонецЕсли;
				КонецЕсли;
				
				МассивДокументов.очистить();
			КонецЕсли;
			
			Если ТекМКД<> Выборка.МКД Тогда
				ДанныеСреднегоОбъема 				= ДанныеСреднегоОбъемаМКД(ВыборкаСреднийОбъем, Выборка.МКД);
			КонецЕсли;
			
			МассивДокументов						= Новый Массив;
			НомерПозиции 							= Выборка.НомерПозици+1;
		КонецЕсли; 	
		
		ДанныеСтроки 								= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,Выборка);
		МассивДокументов.Добавить(ДанныеСтроки); 	
		
		// Очищаем данные
		Набор 										= РегистрыСведений.энргПредоставленныеПоказанияМКД.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.периодНачисления.установить(ПериодНачисления);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
		Набор.Отбор.Шкала.установить(Выборка.Шкала);
		Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
		Набор.Записать();
		
		Набор 										= РегистрыСведений.энргРасчетСреднегоОбъемаМКД.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Отбор.ТочкаУчета.установить(Выборка.ТочкаУчета);
		Набор.Отбор.Шкала.установить(Выборка.Шкала);
		Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		Набор.Записать();
		
		ТекМКД  									= Выборка.МКД;
		ТекПрибор 									= Выборка.ПриборУчета;
		ТекШкала 									= Выборка.Шкала;
		ТекТарифнаяЗона 							= Выборка.ТарифнаяЗона;
		ТекРегистрируетОбъем						= Выборка.РегистрируетОбъем;
	КонецЦикла;
	
	Если ТекМКД<> Неопределено  тогда
		
		Если Не Отказ Тогда
			ПараметрыПроведений  		= Новый Структура("
			|Организация, ПериодНачисления,Район,МКД,ПриборУчета,Шкала,ТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета,РегистрируетОбъем",
			Организация, ПериодНачисления,Район,ТекМКД,ТекПрибор,ТекШкала,ТекТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета,ТекРегистрируетОбъем);
			ОтказПоТарифнойЗоне			= Ложь;
			ОтказПоТарифнойЗоне			= ПровестиПоказанияПриборовУчетаМКД(ПараметрыПроведений,МассивДокументов,ДанныеСреднегоОбъема,ДанныеМаксимальногоПотребления);
			
			Если ОтказПоТарифнойЗоне Тогда
				Отказ 					= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если не Отказ тогда
			// Если все выполнено тогда изменяем состояние в последовательности.
			НаборПоследовательности  			= РегистрыСведений.энргПоказанияПУПоследовательностьМКД.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.Организация.установить(Организация);
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
			НаборПоследовательности.Отбор.МКД.установить(ТекМКД);
			НаборПоследовательности.Отбор.ПриборУчета.установить(ТекПрибор);
			НаборПоследовательности.Прочитать();
			ТаблицаНабора  						= НаборПоследовательности.Выгрузить();
			НаборПоследовательности.Очистить();
			НаборПоследовательности.Записать();
			
			ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности,"СостояниеПроведения");
			
			НаборПоследовательности  			= РегистрыСведений.энргПоказанияПУПоследовательностьМКД.СоздатьНаборЗаписей();
			НаборПоследовательности.Загрузить(ТаблицаНабора);
			НаборПоследовательности.Записать(Ложь); 										
			ЗафиксироватьТранзакцию();
		иначе
			ОтменитьТранзакцию(); 			 
		КонецЕсли; 
	КонецЕсли;
	
	
	
КонецПроцедуры

// Восстанавливает последовательность взаиморасчетов.
//
// Параметры:
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//   МКД					- МКД, по которому происходит восстановление последовательности.
//   Абонент				- Абонент, по которому происходит восстановление последовательности.
//	 СписокМКД 				- Список МКД, по которому происходит восстановление последовательности.
//
Процедура ВосстановитьПоследовательностьВзаиморасчеты(Организация, ПериодНачисления, Район, МКД = Неопределено, Абонент = Неопределено, СписокМКД = Неопределено) Экспорт 
	перем ТекАбонент,ТекМКД,Авансы,МассивДокументов,ДанныеЗадолженности,ДанныеЗадолженностиПени;
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки									= "";
	ДанныеСреза 							= РегистрыСведений.энргСпособыРаспределенияОплаты.ПолучитьПоследнее(ПериодНачисления, Новый Структура("Организация", Организация));
	СпособРаспределенияОплаты 				= ДанныеСреза.СпособРаспределения;
	ОтрицательныеНачисленияСоздаютАвансы	= ДанныеСреза.ОтрицательныеНачисленияСоздаютАвансы;
	АвансГаситДопУслуги						= ДанныеСреза.АвансГаситДопУслуги;
	
	Если не ЗначениеЗаполнено(СпособРаспределенияОплаты) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки распределения оплаты, операция не может быть выполнена");
		Возврат;
	КонецЕсли;
	
	ВыполнитьОтложененоеПроведение(Организация, ПериодНачисления, Район, МКД, Абонент, СписокМКД);
	
	//Возврат;
	
	НастройкиПорядкаПогашения 			= РегистрыСведений.энргПорядокПогашенияЗадолженности.РезультатАктуальныйПорядокВзаиморасчетыПоследовательность();
	НастройкиПорядкаПогашения			= ОбщегоНазначения.ТаблицаЗначенийВМассив(НастройкиПорядкаПогашения.Выгрузить());
	УслугиДляПогашенияТолькоДеньгами	= РегистрыСведений.энргУслугиДляПогашенияТолькоДеньгами.РезультатУслугиДляПогашенияТолькоДеньгами().Выгрузить().ВыгрузитьКолонку("Услуга");
	
	СначалаТекущиеНачисления 	= энргРаботаСКонстантами.ЗначениеКонстантыСначалаГаситьТекущиеНачисления();
	ГраницыПериода  			= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	ОписаниеПериода = Новый Структура(
	"НачалоПериодаРасчета, КонецПериодаРасчета",
	ГраницыПериода.НачалоОП, ГраницыПериода.ЗавершениеОП-1);
	ОписаниеОтборов = Новый Структура(
	"Организация, ПериодНачисления, Район, МКД, Абонент, СначалаТекущиеНачисления, СписокМКД",
	Организация, ПериодНачисления, Район, МКД, Абонент, СначалаТекущиеНачисления, СписокМКД);
	
	
	ИсключенИзПоследовательности 	= Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности;
	ПроведенВПоследовательности 	= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	ПроведенСНарушением 			= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности; 	
	
	МВТ 							= ЗаполнитьМВТВзаиморасчеты(Организация, ПериодНачисления, Район, МКД, Абонент, СписокМКД);
	РезультатДокументыДляПроведения = РезультатДокументыДляПроведения(Организация, ПериодНачисления, Район, МКД, Абонент, МВТ, СписокМКД);
	ВыборкаДокументы  				= РезультатДокументыДляПроведения.Выбрать();
	
	РезультатАванс = Обработки.энргМенеджерАвансы.РезультатАвансыНаГраницуСбитойПоследовательности(МВТ, ОписаниеОтборов, ОписаниеПериода);
	ВыборкаАвансы  = РезультатАванс.Выбрать();		
	
	РезультатОплата	= РезультатОплата(МВТ, ОписаниеПериода.НачалоПериодаРасчета);
	ВыборкаОплата  	= РезультатОплата.Выбрать();  	
	
	СписокСервисовВзаиморасчетов = ИнициализироватьСервисыВзаиморасчетов(МВТ, ОписаниеПериода, ОписаниеОтборов); 
	
	ПустойРезультатОплаты = Истина;
	
	Всего 				= ВыборкаДокументы.Количество();	
	Итерация			= 0;
	КоличествоИтераций 	= Итерация;
	КолвоСообщений		= Цел(Всего / 15);
	Постфикс 			= " из " + Всего;
	
	Если Всего > 0 Тогда 
		
		НачатьТранзакцию();
		ПустойРезультатАвансы = ВыборкаАвансы.следующий();
		ПустойРезультатОплаты = НЕ ВыборкаОплата.Следующий();
		
		Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
			ТекущийСервис.ИнициализироватьВыборки();
		КонецЦикла;
		
	КонецЕсли;	
	
	ОписаниеСтроки  									= Новый ФиксированнаяСтруктура("
	|МКД,Абонент,СостояниеПроведения,ДатаРегистратора,ДокРегистратор,ЭтоОплата,Кассир,ИсточникПоступления,ЭтоКорректировкаОплаты,Разделитель,ВидОперации,ДокументОснование");
	НаборыПоТипам 										= НаборыПоТипам();	
	
	ПараметрыПроведения 								= Новый Структура;
	ПараметрыПроведения.Вставить("Организация"							, Организация);
	ПараметрыПроведения.Вставить("ПериодНачисления"						, ПериодНачисления);
	ПараметрыПроведения.Вставить("Район"								, Район);
	ПараметрыПроведения.Вставить("МассивДокументов"						, МассивДокументов);
	ПараметрыПроведения.Вставить("Авансы"								, Авансы);
	ПараметрыПроведения.Вставить("СуммаАванса"							, 0);
	ПараметрыПроведения.Вставить("СуммаАвансаЖивымиДеньгами"			, 0);
	ПараметрыПроведения.Вставить("СпособРаспределенияОплаты"			, СпособРаспределенияОплаты);
	ПараметрыПроведения.Вставить("ОтрицательныеНачисленияСоздаютАвансы"	, ОтрицательныеНачисленияСоздаютАвансы);
	ПараметрыПроведения.Вставить("АвансГаситДопУслуги"					, АвансГаситДопУслуги);
	ПараметрыПроведения.Вставить("НаборыПоТипам"						, НаборыПоТипам);
	ПараметрыПроведения.Вставить("Сортировка"							, "ПорядокПериодРасчета,ПериодРасчета,ПорядокПогашенияУслуги,Услуга");
	ПараметрыПроведения.Вставить("НастройкиПорядкаПогашения"			, НастройкиПорядкаПогашения);
	ПараметрыПроведения.Вставить("УслугиДляПогашенияТолькоДеньгами"		, УслугиДляПогашенияТолькоДеньгами);
	ПараметрыПроведения.Вставить("СписокСервисовВзаиморасчетов"			, СписокСервисовВзаиморасчетов);
	ПараметрыПроведения.Вставить("ДанныеОплаты"							, Новый Соответствие);
	ПараметрыПроведения.Вставить("ИсключенИзПоследовательности"			, ИсключенИзПоследовательности);
	ПараметрыПроведения.Вставить("ПроведенВПоследовательности"			, ПроведенВПоследовательности);
	ПараметрыПроведения.Вставить("МенеджерПоследовательности"			, РегистрыСведений.энргВзаиморасчетыПоследовательность);

	МассивДокументовНачисления = Новый Соответствие;
	ТекМКДРасчитанСОшибками	= Ложь;
	
	Пока ВыборкаДокументы.Следующий() цикл 					
		
		Если ТекАбонент <> ВыборкаДокументы.Абонент тогда	
			
			Если ТекАбонент <> Неопределено И Не ТекМКДРасчитанСОшибками тогда
				
				ПараметрыПроведения.МассивДокументов = МассивДокументов;
				ДанныеАвансы = АвансНаГраницу(ТекАбонент, ВыборкаАвансы);			
				ПараметрыПроведения.Авансы						= ДанныеАвансы.Авансы;
				ПараметрыПроведения.СуммаАванса					= ДанныеАвансы.СуммаАванса;
				ПараметрыПроведения.СуммаАвансаЖивымиДеньгами	= ДанныеАвансы.СуммаАвансаЖивымиДеньгами;

				
				ПараметрыПроведения.ДанныеОплаты = Новый Соответствие;
				Если Не ПустойРезультатОплаты Тогда
					ПараметрыПроведения.ДанныеОплаты = ДанныеОплаты(ТекАбонент, ВыборкаОплата); 
				КонецЕсли; 		
				
				Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
					ТекущийСервис.СформироватьТаблицыДанныхЗадолженности(ТекАбонент);
				КонецЦикла; 				
				
				Отказ = ПровестиВзаиморасчеты(ПараметрыПроведения, МассивДокументовНачисления);
				Если Отказ Тогда
					ТекМКДРасчитанСОшибками = Истина;	
				КонецЕсли;
				
				Если не Отказ и не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") Тогда
					Если ИзменитьСостояниеПоследовательности(Организация, ПериодНачисления,район,ПроведенСНарушением,ПроведенВПоследовательности,ТекМКД,ТекАбонент,Ошибки) тогда	
						ЗафиксироватьТранзакцию();
					Иначе
						ОтменитьТранзакцию();
					КонецЕсли;
					НачатьТранзакцию();
					ТекМКДРасчитанСОшибками	= Ложь;
				ИначеЕсли не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") тогда
					ОтменитьТранзакцию();
					НачатьТранзакцию();
					ТекМКДРасчитанСОшибками	= Ложь;
				КонецЕсли;
				
				
				Если ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") Тогда
					ПараметрыПроведения.Удалить("ЕстьДокументыНачисления");
				КонецЕсли;				
			КонецЕсли;
			
			Если ТекМКД <> ВыборкаДокументы.МКД и МассивДокументовНачисления.Количество() > 0 тогда
				Если ТекМКДРасчитанСОшибками Тогда
					ОтменитьТранзакцию();
				ИначеЕсли ЗаписатьНаборыДокументовНачисления(Организация, ПериодНачисления, Район, ТекМКД, ПроведенСНарушением, ПроведенВПоследовательности, МассивДокументовНачисления, Абонент, Ошибки) тогда
					ЗафиксироватьТранзакцию();
				Иначе
					ОтменитьТранзакцию();
				КонецЕсли;
				НачатьТранзакцию();
				ТекМКДРасчитанСОшибками	= Ложь;

				МассивДокументовНачисления 				= Новый Соответствие;				
			КонецЕсли; 	
			
			МассивДокументов  							= Новый Массив;
		КонецЕсли;  		
		ДанныеСтроки  									= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ВыборкаДокументы);
		МассивДокументов.Добавить(ДанныеСтроки);		
		ТекАбонент 										= ВыборкаДокументы.Абонент;
		ТекМКД 											= ВыборкаДокументы.МКД;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Итерация / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Восстановление последовательности взаиморасчетов: " + Итерация + Постфикс);
			КоличествоИтераций = 0;
		КонецЕсли;
		
		Итерация = Итерация + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;
	
	Если ТекАбонент <> Неопределено тогда
		
		ПараметрыПроведения.МассивДокументов = МассивДокументов;
		ДанныеАвансы = АвансНаГраницу(ТекАбонент, ВыборкаАвансы);			
		ПараметрыПроведения.Авансы		= ДанныеАвансы.Авансы;
		ПараметрыПроведения.СуммаАванса	= ДанныеАвансы.СуммаАванса;
		ПараметрыПроведения.СуммаАвансаЖивымиДеньгами	= ДанныеАвансы.СуммаАвансаЖивымиДеньгами;
		
		ПараметрыПроведения.ДанныеОплаты = Новый Соответствие;
		Если Не ПустойРезультатОплаты Тогда
			ПараметрыПроведения.ДанныеОплаты = ДанныеОплаты(ТекАбонент, ВыборкаОплата); 
		КонецЕсли; 		
		
		Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
			ТекущийСервис.СформироватьТаблицыДанныхЗадолженности(ТекАбонент);
		КонецЦикла;
		
		Отказ = ПровестиВзаиморасчеты(ПараметрыПроведения, МассивДокументовНачисления);
		
		Если Отказ Тогда
			ТекМКДРасчитанСОшибками = Истина;	
		КонецЕсли;
				
		ТранзакцияЗавершена = Ложь;
		Если не Отказ и не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") Тогда  
			Если ИзменитьСостояниеПоследовательности(Организация, ПериодНачисления,район,ПроведенСНарушением,ПроведенВПоследовательности,ТекМКД,ТекАбонент,Ошибки) тогда	
				ЗафиксироватьТранзакцию();
			Иначе
				ОтменитьТранзакцию();
			КонецЕсли;
			ТранзакцияЗавершена = Истина;
		ИначеЕсли не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") тогда  
			ОтменитьТранзакцию();
			ТранзакцияЗавершена = Истина;
		КонецЕсли; 		
		
		Если МассивДокументовНачисления.Количество() > 0 тогда
			
			Если ТранзакцияЗавершена Тогда
				НачатьТранзакцию(); 
			КонецЕсли;
			
			Если ТекМКДРасчитанСОшибками Тогда
				ОтменитьТранзакцию();
			ИначеЕсли ЗаписатьНаборыДокументовНачисления(Организация, ПериодНачисления,район,ТекМКД,ПроведенСНарушением,ПроведенВПоследовательности,МассивДокументовНачисления,Абонент,Ошибки) тогда
				ЗафиксироватьТранзакцию();
			иначе
				ОтменитьТранзакцию();
			КонецЕсли;							
		КонецЕсли; 		 		
	КонецЕсли;   
	
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

// Сбросывает состояние последовательности.
//
// Параметры:
//   ИмяПоследовательности	- Имя последовательности, по которой происходит сброс состояния.
//	 Организация 			- Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- Район, по которому происходит восстановление последовательности.
//	 Строение 				- Строение, по которому происходит восстановление последовательности.
//	 Помещение 				- Помещение, по которому происходит восстановление последовательности.
//
Процедура СброситьСостояниеПоследовательности(ИмяПоследовательности,Организация,ПериодНачисления,Район,Строение=Неопределено,Помещение=Неопределено) Экспорт 
	
	ПроведенСНарушением 				= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
	ПроведенВПоследовательности  		= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	
	Набор 								= РегистрыСведений[ИмяПоследовательности].СоздатьНаборЗаписей();
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.СостояниеПроведения.установить(ПроведенВПоследовательности);
	
	Если ИмяПоследовательности = "энргВзаиморасчетыПоследовательность" Тогда
		Набор.Отбор.МКД.установить(Строение);
		Если НЕ Помещение = Неопределено тогда
			Набор.Отбор.Абонент.установить(Помещение);
		КонецЕсли;
	ИначеЕсли НЕ Строение = Неопределено Тогда
		ЧастныйСектор 					= НЕ ЗначениеЗаполнено(Строение); 
		Набор.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
		Если Не ЧастныйСектор Тогда
			Набор.Отбор.Строение.установить(Строение); 
			Если НЕ Помещение = Неопределено тогда
				Набор.Отбор.Помещение.установить(Помещение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	 
	
	Набор.Прочитать();
	ТаблицаНабора 						= Набор.Выгрузить();
	Набор.Очистить();
	Набор.Записать();
	ТаблицаНабора.ЗаполнитьЗначения(ПроведенСНарушением,"СостояниеПроведения");
	Набор 								= РегистрыСведений[ИмяПоследовательности].СоздатьНаборЗаписей();
	Набор.Загрузить(ТаблицаНабора);
	Набор.Записать(Ложь); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьБлокировкуНабораЗаписейПоследовательностиПоРегистратору(ЗначенияБлокировки,ИмяПоследовательности, Отказ = Ложь, Заголовок = "") Экспорт
	
	ПараметрыБлокировки = Новый Структура();
	ПараметрыБлокировки.Вставить("ТипТаблицы", "РегистрСведений." + ИмяПоследовательности);
	ПараметрыБлокировки.Вставить("ИмяТаблицы", "");
	
	энргОбщегоНазначения.УстановитьУправляемуюБлокировку(ПараметрыБлокировки, ЗначенияБлокировки, , Отказ, Заголовок);
КонецПроцедуры

Процедура ВыполнитьОтложененоеПроведение(Организация, ПериодНачисления, Район, Строение = Неопределено, Абонент = Неопределено, СписокМКД = Неопределено) Экспорт
	перем ТекСтроение, ТекДок;
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргОтложенныеДвиженияДокументов.ДокРегистратор КАК ДокРегистратор,
	|	энргОтложенныеДвиженияДокументов.Организация КАК Организация,
	|	энргОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	|	энргОтложенныеДвиженияДокументов.Район КАК Район,
	|	энргОтложенныеДвиженияДокументов.Строение КАК Строение,
	|	энргОтложенныеДвиженияДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	ВЫБОР
	|		КОГДА энргОтложенныеДвиженияДокументов.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргОтложенныеДвиженияДокументов.Строение
	|	КОНЕЦ КАК МКД
	|ПОМЕСТИТЬ ДокументыНачисления
	|ИЗ
	|	РегистрСведений.энргОтложенныеДвиженияДокументов КАК энргОтложенныеДвиженияДокументов
	|ГДЕ
	|	энргОтложенныеДвиженияДокументов.Организация = &Организация
	|	И энргОтложенныеДвиженияДокументов.ПериодНачисления = &ПериодНачисления
	|	И энргОтложенныеДвиженияДокументов.Район = &Район
	|	И энргОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.Взаиморасчеты)
	|	И энргОтложенныеДвиженияДокументов.Строение = &Строение
	|	И энргОтложенныеДвиженияДокументов.Строение В(&СписокМКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.СостояниеПроведения КАК СостояниеПроведения,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка) КАК Услуга
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Документ.Организация КАК Организация,
	|		ДокументыНачисления.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыНачисления.Район КАК Район,
	|		ВЫБОР
	|			КОГДА НЕ ШапкаДокумента.ПометкаУдаления
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		КОНЕЦ КАК СостояниеПроведения,
	|		ВЫБОР
	|			КОГДА ДокументыНачисления.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяссылка)
	|					И НЕ Документ.ЧастныйСектор
	|				ТОГДА Документ.Строение
	|			ИНАЧЕ ДокументыНачисления.МКД
	|		КОНЕЦ КАК МКД,
	|		Документ.Абонент КАК Абонент,
	|		ДокументыНачисления.ДокРегистратор КАК ДокРегистратор,
	|		ДокументыНачисления.ДатаРегистратора КАК ДатаРегистратора
	|	ИЗ
	|		ДокументыНачисления КАК ДокументыНачисления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК Документ
	|			ПО ДокументыНачисления.ДокРегистратор = Документ.Регистратор
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргРаспределениеМКД)
	|				И (Документ.Абонент = &Абонент)
	|				И ДокументыНачисления.Организация = Документ.Организация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРаспределениеМКД КАК ШапкаДокумента
	|			ПО ДокументыНачисления.ДокРегистратор = ШапкаДокумента.Ссылка
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргРаспределениеМКД)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Документ.Организация,
	|		ДокументыНачисления.ПериодНачисления,
	|		ДокументыНачисления.Район,
	|		ВЫБОР
	|			КОГДА НЕ ШапкаДокумента.ПометкаУдаления
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДокументыНачисления.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяссылка)
	|					И НЕ Документ.ЧастныйСектор
	|				ТОГДА Документ.Строение
	|			ИНАЧЕ ДокументыНачисления.МКД
	|		КОНЕЦ,
	|		Документ.Абонент,
	|		ДокументыНачисления.ДокРегистратор,
	|		ДокументыНачисления.ДатаРегистратора
	|	ИЗ
	|		ДокументыНачисления КАК ДокументыНачисления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК Документ
	|			ПО ДокументыНачисления.ДокРегистратор = Документ.Регистратор
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргНачисление)
	|				И (Документ.Абонент = &Абонент)
	|				И ДокументыНачисления.Организация = Документ.Организация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргНачисление КАК ШапкаДокумента
	|			ПО ДокументыНачисления.ДокРегистратор = ШапкаДокумента.Ссылка
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргНачисление)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДокументыНачисления.Организация,
	|		ДокументыНачисления.ПериодНачисления,
	|		ДокументыНачисления.Район,
	|		ВЫБОР
	|			КОГДА НЕ ШапкаДокумента.ПометкаУдаления
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДокументыНачисления.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяссылка)
	|					И НЕ Документ.ЧастныйСектор
	|				ТОГДА Документ.Строение
	|			ИНАЧЕ ДокументыНачисления.МКД
	|		КОНЕЦ,
	|		Документ.Абонент,
	|		ДокументыНачисления.ДокРегистратор,
	|		ДокументыНачисления.ДатаРегистратора
	|	ИЗ
	|		ДокументыНачисления КАК ДокументыНачисления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргНачисленныйСреднийОбъем КАК Документ
	|			ПО ДокументыНачисления.ДокРегистратор = Документ.Регистратор
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргПерерасчет)
	|				И (Документ.Абонент = &Абонент)
	|				И ДокументыНачисления.Организация = Документ.Организация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК ШапкаДокумента
	|			ПО ДокументыНачисления.ДокРегистратор = ШапкаДокумента.Ссылка
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргПерерасчет)
	|				И (ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДокументыНачисления.Организация,
	|		ДокументыНачисления.ПериодНачисления,
	|		ДокументыНачисления.Район,
	|		ВЫБОР
	|			КОГДА НЕ ШапкаДокумента.ПометкаУдаления
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДокументыНачисления.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяссылка)
	|					И НЕ Документ.ЧастныйСектор
	|				ТОГДА Документ.Строение
	|			ИНАЧЕ ДокументыНачисления.МКД
	|		КОНЕЦ,
	|		Документ.Абонент,
	|		ДокументыНачисления.ДокРегистратор,
	|		ДокументыНачисления.ДатаРегистратора
	|	ИЗ
	|		ДокументыНачисления КАК ДокументыНачисления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК Документ
	|			ПО ДокументыНачисления.ДокРегистратор = Документ.Регистратор
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргПерерасчет)
	|				И (Документ.Абонент = &Абонент)
	|				И ДокументыНачисления.Организация = Документ.Организация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК ШапкаДокумента
	|			ПО ДокументыНачисления.ДокРегистратор = ШапкаДокумента.Ссылка
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргПерерасчет)
	|				И (ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Документ.Организация,
	|		ДокументыНачисления.ПериодНачисления,
	|		ДокументыНачисления.Район,
	|		ВЫБОР
	|			КОГДА НЕ ШапкаДокумента.ПометкаУдаления
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДокументыНачисления.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяссылка)
	|					И НЕ Документ.ЧастныйСектор
	|				ТОГДА Документ.Строение
	|			ИНАЧЕ ДокументыНачисления.МКД
	|		КОНЕЦ,
	|		Документ.Абонент,
	|		ДокументыНачисления.ДокРегистратор,
	|		ДокументыНачисления.ДатаРегистратора
	|	ИЗ
	|		ДокументыНачисления КАК ДокументыНачисления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК Документ
	|			ПО ДокументыНачисления.ДокРегистратор = Документ.Регистратор
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргДополнительныеНачисления)
	|				И (Документ.Абонент = &Абонент)
	|				И ДокументыНачисления.Организация = Документ.Организация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргДополнительныеНачисления КАК ШапкаДокумента
	|			ПО ДокументыНачисления.ДокРегистратор = ШапкаДокумента.Ссылка
	|				И (ДокументыНачисления.ДокРегистратор ССЫЛКА Документ.энргДополнительныеНачисления)) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ДокРегистратор";  
	
	Запрос  								= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	
	Если Абонент  = Неопределено тогда
		Текст 								= СтрЗаменить(Текст,"И (Документ.Абонент = &Абонент)","");
	иначе
		Запрос.УстановитьПараметр("Абонент",Абонент);
	КонецЕсли;
	
	Если Строение = Неопределено тогда
		Текст 								= СтрЗаменить(Текст,"И энргОтложенныеДвиженияДокументов.Строение = &Строение","");
	иначе
		Запрос.УстановитьПараметр("Строение", Строение);
	КонецЕсли;
	
	Если СписокМКД = Неопределено тогда
		Текст 								= СтрЗаменить(Текст,"И энргОтложенныеДвиженияДокументов.Строение В(&СписокМКД)","");
	иначе
		Запрос.УстановитьПараметр("СписокМКД", СписокМКД);
	КонецЕсли;
	
	Запрос.Текст   							= Текст;
	Результат  								= Запрос.Выполнить();
	Выборка  								= Результат.Выбрать(); 
	
	НаборЗаписи 							= РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
	НаборЗаписи.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	РазделВзаиморасчеты						= Перечисления.энргРазделыЗаписи.Взаиморасчеты;
	
	Если Выборка.Количество() > 0 тогда
		
	КонецЕсли;   	
	
	ТекстЗапроса_энргВзаиморасчетыПоМесяцам	= ТекстЗапросаэнргВзаиморасчетыПоМесяцам(Абонент);
	ТекстЗапроса_энргАвансыИспользованные	= ТекстЗапросаэнргАвансыИспользованные(Абонент);
	ТекстЗапроса_энргАвансы					= ТекстЗапросаэнргАвансы(Абонент);
	ТекстЗапроса_энргАвансыПоступившие		= ТекстЗапросаэнргАвансыПоступившие(Абонент);
	
	Пока Выборка.Следующий() цикл
		
		Если ТекДок <> Выборка.ДокРегистратор И НЕ ТекДок = Неопределено тогда 
			НачатьТранзакцию();
			Попытка
				
				#Область ОчисткаРегистров
				Если Абонент = Неопределено тогда
					// Выполняем только если абонент не указан.
					Набор 							= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
					Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
					Набор.Отбор.Организация.установить(Выборка.Организация);
					Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
					Набор.Отбор.Район.установить(Район);
					Набор.Отбор.РазделЗаписи.установить(РазделВзаиморасчеты);
					Набор.Отбор.ДокРегистратор.установить(ТекДок);
					Набор.Записать();
				КонецЕсли;
				
				
				Набор 							= РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
				Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				Набор.Отбор.Организация.установить(Выборка.Организация);
				Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
				Набор.Отбор.Район.установить(Район);
				Набор.Отбор.ДокРегистратор.установить(ТекДок);
				Если ЗначениеЗаполнено(Абонент) Тогда
					Набор.Отбор.Абонент.установить(Абонент);
				КонецЕсли;
				Набор.Записать(); 		
				
				// энргВзаиморасчетыПоМесяцам
				Запрос.Текст = ТекстЗапроса_энргВзаиморасчетыПоМесяцам;
				Запрос.УстановитьПараметр("Регистратор",	ТекДок);
				ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
				
				Набор  			= РегистрыНакопления.энргВзаиморасчетыПоМесяцам.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ТекДок);
				Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				Набор.Загрузить(ТаблицаНабора);
				Набор.Записать();
				
				// энргАвансы 
				Запрос.Текст	= ТекстЗапроса_энргАвансы;				
				ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
				
				Набор  			= РегистрыНакопления.энргАвансы.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ТекДок);
				Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				Набор.Загрузить(ТаблицаНабора);
				Набор.Записать();
				
				// энргАвансыИспользованные
				Запрос.Текст	= ТекстЗапроса_энргАвансыИспользованные;
				ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
				
				Набор  			= РегистрыНакопления.энргАвансыИспользованные.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ТекДок);
				Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				Набор.Загрузить(ТаблицаНабора);
				Набор.Записать();
				
				// энргАвансыПоступившие
				Запрос.Текст	= ТекстЗапроса_энргАвансыПоступившие;
				ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
				
				Набор  			= РегистрыНакопления.энргАвансыПоступившие.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ТекДок);
				Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				Набор.Загрузить(ТаблицаНабора);
				Набор.Записать();
				
				#КонецОбласти
				
				НаборЗаписи.Записать(Ложь);
				НаборЗаписи.Очистить();
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ИнформацияОбОшибке 				= ИнформацияОбОшибке();
				ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			КонецПопытки;
			
		КонецЕсли;						
		
		ЗаполнитьЗначенияСвойств(НаборЗаписи.Добавить(),Выборка); 
		ТекДок 									= Выборка.ДокРегистратор;		
	КонецЦикла;		
	
	Если ТекДок <> Неопределено тогда
		НачатьТранзакцию();
		Попытка
			Если Абонент = Неопределено тогда
				// Выполняем только если абонент не указан.
				Набор		= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
				Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				Набор.Отбор.Организация.установить(Организация);
				Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
				Набор.Отбор.Район.установить(Район);
				Набор.Отбор.РазделЗаписи.установить(РазделВзаиморасчеты);
				Набор.Отбор.ДокРегистратор.установить(ТекДок);
				Набор.Записать();
			КонецЕсли;
			
			
			Набор			= РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			Набор.Отбор.Организация.установить(Организация);
			Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
			Набор.Отбор.Район.установить(Район);
			Набор.Отбор.ДокРегистратор.установить(ТекДок);
			Если ЗначениеЗаполнено(Абонент) Тогда
				Набор.Отбор.Абонент.установить(Абонент);
			КонецЕсли;
			Набор.Записать(); 		
			
			// энргВзаиморасчетыПоМесяцам
			Запрос.Текст = ТекстЗапроса_энргВзаиморасчетыПоМесяцам;
			Запрос.УстановитьПараметр("Регистратор",	ТекДок);
			ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
			
			Набор  			= РегистрыНакопления.энргВзаиморасчетыПоМесяцам.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ТекДок);
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			Набор.Загрузить(ТаблицаНабора);
			Набор.Записать();
			
			// энргАвансы 
			Запрос.Текст	= ТекстЗапроса_энргАвансы;				
			ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
			
			Набор  			= РегистрыНакопления.энргАвансы.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ТекДок);
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			Набор.Загрузить(ТаблицаНабора);
			Набор.Записать();
			
			// энргАвансыИспользованные
			Запрос.Текст	= ТекстЗапроса_энргАвансыИспользованные;
			ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
			
			Набор  			= РегистрыНакопления.энргАвансыИспользованные.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ТекДок);
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			Набор.Загрузить(ТаблицаНабора);
			Набор.Записать();
			
			// энргАвансыПоступившие
			Запрос.Текст	= ТекстЗапроса_энргАвансыПоступившие;
			ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
			
			Набор  			= РегистрыНакопления.энргАвансыПоступившие.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ТекДок);
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			Набор.Загрузить(ТаблицаНабора);
			Набор.Записать();
			
			НаборЗаписи.Записать(Ложь);
			ЗафиксироватьТранзакцию();			
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке 				= ИнформацияОбОшибке();
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВосстановитьПоследовательностьСтабильныеПериодыМКД

Функция ПровестиПоСтабильнымПериодамМКД(Документы,Ошибки,НачалоПериодаРасчета)
	
	Ошибки  									= "";
	
	для Каждого ОписаниеДокумента из Документы цикл
		Район  									= ОписаниеДокумента.район;
		МКД 									= ОписаниеДокумента.МКД;
		Организация 							= ОписаниеДокумента.Организация;
		МоментВремени  							= ОписаниеДокумента.МоментВремени;
		Документ 								= ОписаниеДокумента.Документ;		
		Дата 									= ОписаниеДокумента.Дата;
		ПериодРегистрации						= ОписаниеДокумента.ПериодРегистрации;
		
		НаборСтабильныеПериоды  				= РегистрыСведений.энргСтабильныеПериодыМКД.СоздатьНаборЗаписей();
		НаборСтабильныеПериодыШкалы    			= РегистрыСведений.энргСтабильныеПериодыМКДШкалы.СоздатьНаборЗаписей();
		НаборСтабильныеПериодыСоставУзла    	= РегистрыСведений.энргСтабильныеПериодыМКДСоставУзловУчета.СоздатьНаборЗаписей();
		
		НаборПоследнихНомеров           		= РегистрыСведений.энргНомераСтрокСтабильногоПериодаМКД.СоздатьНаборЗаписей();
		
		ПараметрыЗапроса						= Новый Структура("Организация,Район,МКД,ПериодРегистрации",Организация, Район,МКД,Макс(ПериодРегистрации,НачалоПериодаРасчета));
		Параметры 								= Новый Структура("ПараметрыЗапроса,Отказ,МоментВремени,РазрешенПустойНабор,
		|ссылка,ДатаДок,ПериодНачисления,
		|НаборСтабильныеПериоды,НаборСтабильныеПериодыШкалы,НаборСтабильныеПериодыСоставУзла,НаборПоследнихНомеров, НовыеУзлы",
		ПараметрыЗапроса,Ложь,МоментВремени,Ложь,
		Документ,Дата, ОписаниеДокумента.ПериодНачисления,
		НаборСтабильныеПериоды,НаборСтабильныеПериодыШкалы,НаборСтабильныеПериодыСоставУзла,НаборПоследнихНомеров, ОписаниеДокумента.НовыеУзлы);
		
		энргРаботаСПериодомДействия.ПровестиПоСтабильнымПериодамМКД(Документ,Параметры);
		
		Если не Параметры.РазрешенПустойНабор и НаборСтабильныеПериоды.Количество() =0 тогда
			Ошибки  							= Ошибки + ?(НЕ ПустаяСтрока(Ошибки),Символы.ПС,"") + "Не удалось восстановить последовательности документов по мкд " + МКД +": " + Документ;
			Прервать;
		КонецЕсли; 		
		
		Попытка		
			НаборПоследнихНомеров.Записать(Ложь);
			НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
			НаборСтабильныеПериодыШкалы.Записать(Ложь);
			НаборСтабильныеПериодыСоставУзла.Записать(Ложь);
			НаборСтабильныеПериоды.Записать(Ложь);			
		Исключение
			Представление  						= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Ошибки  							= Ошибки + ?(НЕ ПустаяСтрока(Ошибки),Символы.ПС,"") + Представление;
			Прервать;
		КонецПопытки;				
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

Функция РезультатЗапросаСтабильныеПериодыМКД(Отбор) 
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргСтабильныеПериодыМКДПоследовательность.Организация,
	|	энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления,
	|	энргСтабильныеПериодыМКДПоследовательность.Район,
	|	энргСтабильныеПериодыМКДПоследовательность.МКД КАК МКД,
	|	МИНИМУМ(энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МинПериодРегистрации
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКДПоследовательность КАК энргСтабильныеПериодыМКДПоследовательность
	|ГДЕ
	|	энргСтабильныеПериодыМКДПоследовательность.Организация = &Организация
	|	И энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериодыМКДПоследовательность.Район = &Район
	|	И энргСтабильныеПериодыМКДПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И энргСтабильныеПериодыМКДПоследовательность.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКДПоследовательность.Организация,
	|	энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления,
	|	энргСтабильныеПериодыМКДПоследовательность.Район,
	|	энргСтабильныеПериодыМКДПоследовательность.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериодыМКДПоследовательность.Организация,
	|	энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления,
	|	энргСтабильныеПериодыМКДПоследовательность.Район,
	|	энргСтабильныеПериодыМКДПоследовательность.МКД КАК МКД,
	|	энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации,
	|	МИНИМУМ(энргСтабильныеПериодыМКДПоследовательность.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МинимальныйПериод
	|ИЗ
	|	МинПериодРегистрации КАК МинПериодРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКДПоследовательность КАК энргСтабильныеПериодыМКДПоследовательность
	|		ПО МинПериодРегистрации.Организация = энргСтабильныеПериодыМКДПоследовательность.Организация И МинПериодРегистрации.ПериодНачисления = энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления
	|			И МинПериодРегистрации.Район = энргСтабильныеПериодыМКДПоследовательность.Район
	|			И МинПериодРегистрации.МКД = энргСтабильныеПериодыМКДПоследовательность.МКД
	|			И МинПериодРегистрации.ПериодРегистрации = энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации
	|			И (энргСтабильныеПериодыМКДПоследовательность.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКДПоследовательность.Район = &Район)
	|			И (энргСтабильныеПериодыМКДПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И (энргСтабильныеПериодыМКДПоследовательность.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериодыМКДПоследовательность.Организация,
	|	энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления,
	|	энргСтабильныеПериодыМКДПоследовательность.Район,
	|	энргСтабильныеПериодыМКДПоследовательность.МКД,
	|	энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйПериод.Организация,
	|	МинимальныйПериод.ПериодНачисления,
	|	МинимальныйПериод.Район,
	|	МинимальныйПериод.МКД,
	|	МинимальныйПериод.ПериодРегистрации,
	|	МинимальныйПериод.ДатаРегистратора,
	|	МИНИМУМ(энргСтабильныеПериодыМКДПоследовательность.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МинимальныйРегистратор
	|ИЗ
	|	МинимальныйПериод КАК МинимальныйПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКДПоследовательность КАК энргСтабильныеПериодыМКДПоследовательность
	|		ПО МинимальныйПериод.Организация = энргСтабильныеПериодыМКДПоследовательность.Организация И МинимальныйПериод.ПериодНачисления = энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления
	|			И МинимальныйПериод.Район = энргСтабильныеПериодыМКДПоследовательность.Район
	|			И МинимальныйПериод.МКД = энргСтабильныеПериодыМКДПоследовательность.МКД
	|			И МинимальныйПериод.ПериодРегистрации = энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации
	|			И (энргСтабильныеПериодыМКДПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальныйПериод.ДатаРегистратора = энргСтабильныеПериодыМКДПоследовательность.ДатаРегистратора
	|			И (энргСтабильныеПериодыМКДПоследовательность.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКДПоследовательность.Район = &Район)
	|			И (энргСтабильныеПериодыМКДПоследовательность.МКД = &МКД)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныйПериод.Организация,
	|	МинимальныйПериод.ПериодНачисления,
	|	МинимальныйПериод.Район,
	|	МинимальныйПериод.МКД,
	|	МинимальныйПериод.ПериодРегистрации,
	|	МинимальныйПериод.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйРегистратор.Организация КАК Организация,
	|	МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
	|	МинимальныйРегистратор.Район КАК Район,
	|	МинимальныйРегистратор.МКД КАК МКД,
	|	энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргСтабильныеПериодыМКДПоследовательность.СостояниеПроведения,
	|	энргСтабильныеПериодыМКДПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргСтабильныеПериодыМКДПоследовательность.ДокРегистратор КАК ДокРегистратор
	|ИЗ
	|	МинимальныйРегистратор КАК МинимальныйРегистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКДПоследовательность КАК энргСтабильныеПериодыМКДПоследовательность
	|		ПО МинимальныйРегистратор.Организация = энргСтабильныеПериодыМКДПоследовательность.Организация И  МинимальныйРегистратор.ПериодНачисления = энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления
	|			И МинимальныйРегистратор.Район = энргСтабильныеПериодыМКДПоследовательность.Район
	|			И МинимальныйРегистратор.МКД = энргСтабильныеПериодыМКДПоследовательность.МКД
	|			И (ВЫБОР
	|				КОГДА МинимальныйРегистратор.ПериодРегистрации < энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации
	|					ТОГДА ИСТИНА
	|				КОГДА МинимальныйРегистратор.ПериодРегистрации = энргСтабильныеПериодыМКДПоследовательность.ПериодРегистрации
	|					ТОГДА ВЫБОР
	|							КОГДА МинимальныйРегистратор.ДатаРегистратора < энргСтабильныеПериодыМКДПоследовательность.ДатаРегистратора
	|								ТОГДА ИСТИНА
	|							КОГДА МинимальныйРегистратор.ДатаРегистратора = энргСтабильныеПериодыМКДПоследовательность.ДатаРегистратора
	|								ТОГДА МинимальныйРегистратор.ДокРегистратор <= энргСтабильныеПериодыМКДПоследовательность.ДокРегистратор
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (энргСтабильныеПериодыМКДПоследовательность.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКДПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериодыМКДПоследовательность.Район = &Район)
	|			И (энргСтабильныеПериодыМКДПоследовательность.МКД = &МКД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	ПериодРегистрации,
	|	ДатаРегистратора,
	|	ДокРегистратор";   	       
	
	Если не Отбор.свойство("МКД") тогда
		Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКДПоследовательность.МКД = &МКД","");
		Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКДПоследовательность.МКД = &МКД)","");		
	КонецЕсли;
	
	Запрос 		 	= Новый Запрос;
	Запрос.Текст 	= Текст;
	Запрос.УстановитьПараметр("Район",				Отбор.район);
	Запрос.УстановитьПараметр("Организация",		Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	Отбор.ПериодНачисления);
	
	Если Отбор.свойство("МКД") тогда
		Запрос.УстановитьПараметр("МКД",			Отбор.МКД);
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область ВосстановитьПоследовательностьПоказанияПУ

Процедура ОбновитьДанныеВДокументе(ПериодНачисления,ДокРегистратор,ПараметрыОперации)
	
	ПоказанияПриняты 									= Перечисления.энргСостояниеПоказаний.Приняты;
	ЭтоОперацияСПрибором								= ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчета");
	ЭтоСменаВидаДиффер									= ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргУстановитьВидДифференцированностиПриборУчета");
	ДокОбъект  											= ДокРегистратор.получитьОбъект();
	ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
	
	Если ЗначениеЗаполнено(ПараметрыОперации.ИмяТабЧасти) тогда
		ИмяТЧ 											= ПараметрыОперации.ИмяТабЧасти;
	иначе
		ИмяТЧ 											= ИмяТабличнойЧастиПоказаний(ДокРегистратор);
	КонецЕсли;
	
	тчТочкиУчета 										= ДокОбъект["ТочкиУчета"];
	тчШкалыПриборов 									= ДокОбъект["ШкалыПриборовУчета"];
	тчПоказания 										= ДокОбъект["ПоказанияПриборовУчета"];
	
	Если ПараметрыОперации.НомерСтрокиТЧ > 0 тогда
		СтрокаПоказаний									= тчПоказания[ПараметрыОперации.НомерСтрокиТЧ-1];
		СтрокиШкал										= тчШкалыПриборов.НайтиСтроки(Новый Структура("IDСтроки", СтрокаПоказаний.IDСтроки));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;		
		СтрокаШкалы 									= СтрокиШкал[0];
		СтрокиТочки										= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", 		СтрокаШкалы.IDСтрокиТочкиУчета));
		ЭтоНовыйВидДифф									= Истина;
		
		Если ЭтоОперацияСПрибором и СтрокиТочки.Количество() = 0 Тогда
			СтрокиТочки									= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиВывод", СтрокаШкалы.IDСтрокиТочкиУчета));
		КонецЕсли; 
		Если ЭтоСменаВидаДиффер и СтрокиТочки.Количество() = 0 Тогда
			СтрокиТочки									= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиВывод", СтрокаШкалы.IDСтрокиТочкиУчета));
			ЭтоНовыйВидДифф								= Ложь;
		КонецЕсли;
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;
		Если ЭтоСменаВидаДиффер И ЭтоНовыйВидДифф Тогда
			// Тарифная зона по новому виду дифференцированности. По строкам нового вида диф не должны обновляться строки 
			Возврат;
		КонецЕсли;
		
		СтрокаТочки 									= СтрокиТочки[0];
	иначе		
		СтрокиТочки		 								= тчТочкиУчета.найтиСтроки(Новый Структура("ПриборУчета",ПараметрыОперации.ПриборУчета));
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;		
		СтрокаТочки  									= СтрокиТочки[0];
		
		СтрокиШкал 										= тчШкалыПриборов.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета, Шкала",СтрокаТочки.IDСтроки, ПараметрыОперации.Шкала));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаШкалы                                    	= СтрокиШкал[0];
		СтрокиПоказаний 								= тчПоказания.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", СтрокаШкалы.IDСтроки, ПараметрыОперации.ТарифнаяЗона));
		Если СтрокиПоказаний.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета " +  ПараметрыОперации.ПриборУчета + " и тарифной зоны " +  ПараметрыОперации.ТарифнаяЗона  + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаПоказаний 								= СтрокиПоказаний[0];
		
	КонецЕсли;  
	
	ДанныеСреднегоОбъема 								= ПараметрыОперации.ДанныеСреднегоОбъема; 	
	
	Если СтрокаТочки = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли  ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона] = Неопределено тогда
		СреднийОбъема 									= 0;
	иначе
		СреднийОбъема 									= ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона];
	КонецЕсли;
	
	ДанныеМаксимальногоПотребления 						= ПараметрыОперации.ДанныеМаксимальногоПотребления;
	Если ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга] = Неопределено тогда
		МаксимальноВозможныйОбъемПотребления 			= 1000;
	иначе 
		СтрокаСоотвествия 								= ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга];
		МаксимальноВозможныйОбъемПотребления 			= СтрокаСоотвествия.ПовышающийКоэффициент * СтрокаСоотвествия.МаксимальноеПотребления;	
	КонецЕсли;
	
	ДанныеСтроки 										= энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ДанныеСтрокиПоказаний();
	
	ДанныеСтроки.ТекущиеПоказания	 					= СтрокаПоказаний.ТекущиеПоказания;
	ДанныеСтроки.Разница 								= СтрокаПоказаний.Разница;
	ДанныеСтроки.ПереворотИзмененПользователем 			= СтрокаПоказаний.ПереворотИзмененПользователем;
	ДанныеСтроки.СтатусИзмененПользователем 			= СтрокаПоказаний.СтатусИзмененПользователем;
	ДанныеСтроки.Сумма				 					= СтрокаПоказаний.Сумма;
	ДанныеСтроки.ЗначениеТарифа				 			= СтрокаПоказаний.ЗначениеТарифа;
	
	ДанныеСтроки.ПредыдущиеПоказания 					= ПараметрыОперации.ПредыдущиеМакс;
	ДанныеСтроки.ДатаПоследнихПоказаний 				= НачалоДня(ПараметрыОперации.ПериодПредыдущихМаксПок);
	ДанныеСтроки.СостояниеПоказаний 					= ПараметрыОперации.СостояниеПоказаний;
	ДанныеСтроки.ПричинаОтклонения 						= ПараметрыОперации.ПричинаОтклонения;
	ДанныеСтроки.СреднийОбъемПотребления 				= СреднийОбъема;
	ДанныеСтроки.МаксимальноВозможныеПоказания			= ПараметрыОперации.МаксимальноВозможныеПоказания;
	ДанныеСтроки.МаксимальноВозможныйОбъемПотребления	= МаксимальноВозможныйОбъемПотребления; 
	ДанныеСтроки.КоэффициентПУ							= ПараметрыОперации.КоэффициентПУ; 	
	ДанныеСтроки.Переворот 								= ПараметрыОперации.Переворот;			
	КонтрольныйСъем 									= ПараметрыОперации.КС;
	ДопПараменты	= Новый Структура("ПриборУчета", СтрокаТочки.ПриборУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(ДанныеСтроки, ПериодНачисления,КонтрольныйСъем,ДопПараменты);
	
	Если ПараметрыОперации.НедопускПрибора Тогда
		ДанныеСтроки.СостояниеПоказаний 				= Перечисления.энргСостояниеПоказаний.Отклонены;
	КонецЕсли;	
	
	Если ДанныеСтрокиИзменены(ДанныеСтроки,СтрокаПоказаний) тогда
		// Если что то изменилось в документе.
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний,ДанныеСтроки);				
		ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);	
		ДокОбъект.записать();
	КонецЕсли;
	
	Если ДанныеСтроки.СостояниеПоказаний <> ПараметрыОперации.СостояниеПоказаний или ДанныеСтроки.Переворот <> ПараметрыОперации.Переворот тогда
		
		МенеджерэнргПоказанияПриборовУчета = РегистрыСведений.энргПоказанияПриборовУчета;
		// Если данные изменились записываем их.
		НаборПоказаний 								= СоздатьНаборЗаписей(МенеджерэнргПоказанияПриборовУчета);//РегистрыСведений.энргПоказанияПриборовУчета.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Прочитать();
		ТаблицаПоказаний  							= НаборПоказаний.Выгрузить();
		для Каждого стр из ТаблицаПоказаний цикл
			стр.активность 							= истина;
		КонецЦикла;   			
		НаборПоказаний.Очистить();
		НаборПоказаний.Записать();
		СтрокиПоказаний  							= ТаблицаПоказаний.НайтиСтроки(Новый Структура("КлючПомещения,ПриборУчета,ТарифнаяЗона,Разделитель",ПараметрыОперации.КлючПомещения,ПараметрыОперации.ПриборУчета,ПараметрыОперации.ТарифнаяЗона,ПараметрыОперации.Разделитель)); 
		Если СтрокиПоказаний.Количество() = 0 тогда 	
			// Движений по данному пу нету.	
			Если СтрокаПоказаний.ТекущиеПоказания > 0 тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
			КонецЕсли;				
		иначеЕсли СтрокиПоказаний.Количество() > 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
		иначе
			СтрокаПоказаний  						= СтрокиПоказаний[0];
			СтрокаПоказаний.Показание 				= ДанныеСтроки.ТекущиеПоказания;
			СтрокаПоказаний.Переворот 				= ДанныеСтроки.Переворот;
			СтрокаПоказаний.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
		КонецЕсли;			
		
		// Записываем новый набор показаний.
		НаборПоказаний 								= СоздатьНаборЗаписей(МенеджерэнргПоказанияПриборовУчета);//РегистрыСведений.энргПоказанияПриборовУчета.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Загрузить(ТаблицаПоказаний);
		НаборПоказаний.Записать(Ложь);			
		ПараметрыОперации.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
		ПараметрыОперации.Переворот 				= ДанныеСтроки.Переворот;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеСреднегоОбъемаАбонента(ВыборкаСреднийОбъем,ЧастныйСектор, Строение,Помещение) 
	
	ТекТочкаУчета					= Неопределено;
	ТекШкала 						= Неопределено;
	СоотвествиеТочек 				= Новый Соответствие;
	СоответствиеЗоны 				= Неопределено;
	СоотвествиеШкал 				= Неопределено;
	Пока ВыборкаСреднийОбъем.ЧастныйСектор  = ЧастныйСектор и ВыборкаСреднийОбъем.Строение = Строение и ВыборкаСреднийОбъем.Помещение = Помещение цикл		
		Если ЗначениеЗаполнено(ВыборкаСреднийОбъем.Шкала) и ЗначениеЗаполнено(ВыборкаСреднийОбъем.ТарифнаяЗона) Тогда
			Если ТекШкала <> ВыборкаСреднийОбъем.Шкала Тогда
				Если ТекШкала <> Неопределено тогда
					СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли;
			
			Если ТекТочкаУчета <> ВыборкаСреднийОбъем.ТочкаУчета тогда
				Если ТекТочкаУчета <> Неопределено тогда
					СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли; 	
			
			СоответствиеЗоны.Вставить(ВыборкаСреднийОбъем.ТарифнаяЗона,ВыборкаСреднийОбъем.СреднееПотребление);
		КонецЕсли;
		
		Если не ВыборкаСреднийОбъем.следующий() тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Если ТекШкала <> Неопределено тогда
		СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
	КонецЕсли;		
	
	Если ТекТочкаУчета <> Неопределено тогда
		СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
	КонецЕсли;	  
	
	Возврат СоотвествиеТочек;
КонецФункции

Функция РезультатСреднийОбъемПотребления(МВТ,Отбор)
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияАбонентов.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияАбонентов.Район КАК Район,
	|	энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСреднийОбъемПотребленияАбонентов.Строение КАК Строение,
	|	энргСреднийОбъемПотребленияАбонентов.Помещение КАК Помещение,
	|	энргСреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияАбонентов.Объем КАК Объем
	|ПОМЕСТИТЬ СреднийОбъем
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК энргСреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	энргСреднийОбъемПотребленияАбонентов.Организация = &Организация
	|	И энргСреднийОбъемПотребленияАбонентов.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребленияАбонентов.Район = &Район
	|	И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор
	|	И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение
	|	И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Граница.Организация КАК Организация,
	|	Граница.ПериодНачисления КАК ПериодНачисления,
	|	Граница.Район КАК Район,
	|	Граница.ЧастныйСектор КАК ЧастныйСектор,
	|	Граница.Строение КАК Строение,
	|	Граница.Помещение КАК Помещение,
	|	ЕСТЬNULL(СреднийОбъем.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчета,
	|	ЕСТЬNULL(СреднийОбъем.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СреднийОбъем.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(СреднийОбъем.Объем, 0) КАК СреднееПотребление
	|ИЗ
	|	Граница КАК Граница
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъем КАК СреднийОбъем
	|		ПО Граница.Организация = СреднийОбъем.Организация
	|			И Граница.ПериодНачисления = СреднийОбъем.ПериодНачисления
	|			И Граница.Район = СреднийОбъем.Район
	|			И Граница.ЧастныйСектор = СреднийОбъем.ЧастныйСектор
	|			И Граница.Строение = СреднийОбъем.Строение
	|			И Граница.Помещение = СреднийОбъем.Помещение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	Помещение,
	|	Шкала,
	|	ТарифнаяЗона"; 
	
	Если Отбор.ЧастныйСектор  = Неопределено Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	ИначеЕсли Не ЗначениеЗаполнено(Отбор.Строение) Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	ИначеЕсли Не ЗначениеЗаполнено(Отбор.Помещение) И Не Отбор.ЧастныйСектор Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	КонецЕсли;
	
	Запрос 							= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Запрос.УстановитьПараметр("Район",					Отбор.район);
	Запрос.УстановитьПараметр("Организация",			Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",		Отбор.ПериодНачисления);
	Запрос.УстановитьПараметр("ЧастныйСектор", 			Отбор.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение", 				Отбор.Строение);
	
	Если ЗначениеЗаполнено(Отбор.Помещение) Или ЗначениеЗаполнено(Отбор.Строение) И Отбор.ЧастныйСектор Тогда
		Запрос.УстановитьПараметр("Помещение", 	Отбор.Помещение);
	КонецЕсли; 
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция ДанныеМаксимальногоПотребления(НачалоПериодаРасчета)
	МаксПотреб		 = Новый Соответствие;
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",КонецМесяца(НачалоПериодаРасчета)+1);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.Услуга,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ТарифнаяЗона,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ПовышающийКоэффициент,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.МаксимальноеПотребления
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказателиПотребления.СрезПоследних(&Период, ) КАК энргМаксимальныеПоказателиПотребленияСрезПоследних";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		МаксПотреб.Вставить(Выборка.Услуга,Новый Структура("ПовышающийКоэффициент,МаксимальноеПотребления",Выборка.ПовышающийКоэффициент,Выборка.МаксимальноеПотребления));
	КонецЦикла;
	
	Возврат МаксПотреб;
КонецФункции

Функция ДанныеСтрокиИзменены(Источник,Приемник)	
	
	для Каждого КлючЗначение из Источник цикл
		Если Источник[КлючЗначение.ключ] <> Приемник[КлючЗначение.ключ] тогда
			Возврат Истина;
			Прервать;				
		КонецЕсли;  		
	КонецЦикла; 	
	Возврат Ложь;
	
КонецФункции

Функция РезультатЗапросаПоказанияПУ(МВТ,Отбор,НачалоПериодаРасчета) 
	
	Запрос  = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Текст =
	"ВЫБРАТЬ
	|	энргКоэффциентыПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент КАК коэффициент
	|ПОМЕСТИТЬ КоэффициентыПриборов
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&НачалоПериодаРасчета, МЕСЯЦ), ДЕНЬ, 1),
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МинимальныйПериод
	|ИЗ
	|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|ГДЕ
	|	энргПоказанияПУПоследовательность.Организация = &Организация
	|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
	|	И энргПоказанияПУПоследовательность.Район = &Район
	|	И энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор
	|	И энргПоказанияПУПоследовательность.Строение = &Строение
	|	И энргПоказанияПУПоследовательность.Помещение = &Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПУПоследовательность.Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение,
	|	энргПоказанияПУПоследовательность.Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйПериод.Организация КАК Организация,
	|	МинимальныйПериод.ПериодНачисления КАК ПериодНачисления,
	|	МинимальныйПериод.Район КАК Район,
	|	МинимальныйПериод.ЧастныйСектор КАК ЧастныйСектор,
	|	МинимальныйПериод.Строение КАК Строение,
	|	МинимальныйПериод.Помещение КАК Помещение,
	|	МинимальныйПериод.ПриборУчета КАК ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации КАК ПериодРегистрации,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МинимальнаяДатаРегистратора
	|ИЗ
	|	МинимальныйПериод КАК МинимальныйПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО МинимальныйПериод.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальныйПериод.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальныйПериод.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальныйПериод.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И МинимальныйПериод.Строение = энргПоказанияПУПоследовательность.Строение
	|			И МинимальныйПериод.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И МинимальныйПериод.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальныйПериод.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныйПериод.Организация,
	|	МинимальныйПериод.ПериодНачисления,
	|	МинимальныйПериод.Район,
	|	МинимальныйПериод.ЧастныйСектор,
	|	МинимальныйПериод.Строение,
	|	МинимальныйПериод.Помещение,
	|	МинимальныйПериод.ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальнаяДатаРегистратора.Организация КАК Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район КАК Район,
	|	МинимальнаяДатаРегистратора.ЧастныйСектор КАК ЧастныйСектор,
	|	МинимальнаяДатаРегистратора.Строение КАК Строение,
	|	МинимальнаяДатаРегистратора.Помещение КАК Помещение,
	|	МинимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации КАК ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МинимальныйРегистратор
	|ИЗ
	|	МинимальнаяДатаРегистратора КАК МинимальнаяДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО МинимальнаяДатаРегистратора.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальнаяДатаРегистратора.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальнаяДатаРегистратора.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальнаяДатаРегистратора.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И МинимальнаяДатаРегистратора.Строение = энргПоказанияПУПоследовательность.Строение
	|			И МинимальнаяДатаРегистратора.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И МинимальнаяДатаРегистратора.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальнаяДатаРегистратора.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальнаяДатаРегистратора.Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район,
	|	МинимальнаяДатаРегистратора.ЧастныйСектор,
	|	МинимальнаяДатаРегистратора.Строение,
	|	МинимальнаяДатаРегистратора.Помещение,
	|	МинимальнаяДатаРегистратора.ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.Разделитель КАК Разделитель,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ ВложенныйЗапрос.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрацииПоказаний,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ Граница
	|ИЗ
	|	(ВЫБРАТЬ
	|		МинимальныйРегистратор.Организация КАК Организация,
	|		МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
	|		МинимальныйРегистратор.Район КАК Район,
	|		МинимальныйРегистратор.ЧастныйСектор КАК ЧастныйСектор,
	|		МинимальныйРегистратор.Строение КАК Строение,
	|		МинимальныйРегистратор.Помещение КАК Помещение,
	|		МинимальныйРегистратор.ПриборУчета КАК ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации КАК ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора КАК ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор КАК ДокРегистратор,
	|		МИНИМУМ(энргПоказанияПУПоследовательность.Разделитель) КАК Разделитель
	|	ИЗ
	|		МинимальныйРегистратор КАК МинимальныйРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|			ПО МинимальныйРегистратор.Организация = энргПоказанияПУПоследовательность.Организация
	|				И МинимальныйРегистратор.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|				И МинимальныйРегистратор.Район = энргПоказанияПУПоследовательность.Район
	|				И МинимальныйРегистратор.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|				И МинимальныйРегистратор.Строение = энргПоказанияПУПоследовательность.Строение
	|				И МинимальныйРегистратор.Помещение = энргПоказанияПУПоследовательность.Помещение
	|				И МинимальныйРегистратор.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|				И МинимальныйРегистратор.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|				И МинимальныйРегистратор.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|				И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|				И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|				И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|				И (энргПоказанияПУПоследовательность.Район = &Район)
	|				И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|				И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|				И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимальныйРегистратор.Организация,
	|		МинимальныйРегистратор.ПериодНачисления,
	|		МинимальныйРегистратор.Район,
	|		МинимальныйРегистратор.ЧастныйСектор,
	|		МинимальныйРегистратор.Строение,
	|		МинимальныйРегистратор.Помещение,
	|		МинимальныйРегистратор.ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.Строение = энргКлючиПомещений.Строение
	|			И ВложенныйЗапрос.Помещение = энргКлючиПомещений.Помещение
	|			И (энргКлючиПомещений.Строение = &Строение)
	|			И (энргКлючиПомещений.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ НаборПроведенныхВПоследовательности
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И Граница.Строение = энргПоказанияПУПоследовательность.Строение
	|			И Граница.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель > энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор > энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора > энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации > энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности))
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПроведенныхВПоследовательности.Организация КАК Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район КАК Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	НаборПроведенныхВПоследовательности.Строение КАК Строение,
	|	НаборПроведенныхВПоследовательности.Помещение КАК Помещение,
	|	НаборПроведенныхВПоследовательности.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МаксимальныйПериодРегистрацииПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПроведенныхВПоследовательности.Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.ЧастныйСектор,
	|	НаборПроведенныхВПоследовательности.Строение,
	|	НаборПроведенныхВПоследовательности.Помещение,
	|	НаборПроведенныхВПоследовательности.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйПериодРегистрацииПроведенных.Организация КАК Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район КАК Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйПериодРегистрацииПроведенных.Строение КАК Строение,
	|	МаксимальныйПериодРегистрацииПроведенных.Помещение КАК Помещение,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МаксимальнаяДатаПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериодРегистрацииПроведенных КАК МаксимальныйПериодРегистрацииПроведенных
	|		ПО НаборПроведенныхВПоследовательности.Организация = МаксимальныйПериодРегистрацииПроведенных.Организация
	|			И НаборПроведенныхВПоследовательности.ПериодНачисления = МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления
	|			И НаборПроведенныхВПоследовательности.Район = МаксимальныйПериодРегистрацииПроведенных.Район
	|			И НаборПроведенныхВПоследовательности.СостояниеПроведения = МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения
	|			И НаборПроведенныхВПоследовательности.ЧастныйСектор = МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор
	|			И НаборПроведенныхВПоследовательности.Строение = МаксимальныйПериодРегистрацииПроведенных.Строение
	|			И НаборПроведенныхВПоследовательности.Помещение = МаксимальныйПериодРегистрацииПроведенных.Помещение
	|			И НаборПроведенныхВПоследовательности.ПриборУчета = МаксимальныйПериодРегистрацииПроведенных.ПриборУчета
	|			И НаборПроведенныхВПоследовательности.ПериодРегистрации = МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйПериодРегистрацииПроведенных.Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор,
	|	МаксимальныйПериодРегистрацииПроведенных.Строение,
	|	МаксимальныйПериодРегистрацииПроведенных.Помещение,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаПроведенных.Организация КАК Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район КАК Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальнаяДатаПроведенных.Строение КАК Строение,
	|	МаксимальнаяДатаПроведенных.Помещение КАК Помещение,
	|	МаксимальнаяДатаПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныйРегистраторПроведенных
	|ИЗ
	|	МаксимальнаяДатаПроведенных КАК МаксимальнаяДатаПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальнаяДатаПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальнаяДатаПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальнаяДатаПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальнаяДатаПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальнаяДатаПроведенных.ЧастныйСектор = НаборПроведенныхВПоследовательности.ЧастныйСектор
	|			И МаксимальнаяДатаПроведенных.Строение = НаборПроведенныхВПоследовательности.Строение
	|			И МаксимальнаяДатаПроведенных.Помещение = НаборПроведенныхВПоследовательности.Помещение
	|			И МаксимальнаяДатаПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальнаяДатаПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальнаяДатаПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаПроведенных.Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.ЧастныйСектор,
	|	МаксимальнаяДатаПроведенных.Строение,
	|	МаксимальнаяДатаПроведенных.Помещение,
	|	МаксимальнаяДатаПроведенных.ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРегистраторПроведенных.Организация КАК Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район КАК Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйРегистраторПроведенных.Строение КАК Строение,
	|	МаксимальныйРегистраторПроведенных.Помещение КАК Помещение,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор КАК ДокРегистратор,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.Разделитель) КАК Разделитель
	|ПОМЕСТИТЬ МаксимальныйРазделительПроведенных
	|ИЗ
	|	МаксимальныйРегистраторПроведенных КАК МаксимальныйРегистраторПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальныйРегистраторПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальныйРегистраторПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальныйРегистраторПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальныйРегистраторПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальныйРегистраторПроведенных.ЧастныйСектор = НаборПроведенныхВПоследовательности.ЧастныйСектор
	|			И МаксимальныйРегистраторПроведенных.Строение = НаборПроведенныхВПоследовательности.Строение
	|			И МаксимальныйРегистраторПроведенных.Помещение = НаборПроведенныхВПоследовательности.Помещение
	|			И МаксимальныйРегистраторПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальныйРегистраторПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальныйРегистраторПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|			И МаксимальныйРегистраторПроведенных.ДокРегистратор = НаборПроведенныхВПоследовательности.ДокРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйРегистраторПроведенных.Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.ЧастныйСектор,
	|	МаксимальныйРегистраторПроведенных.Строение,
	|	МаксимальныйРегистраторПроведенных.Помещение,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРазделительПроведенных.Организация КАК Организация,
	|	МаксимальныйРазделительПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРазделительПроведенных.Район КАК Район,
	|	МаксимальныйРазделительПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйРазделительПроведенных.Строение КАК Строение,
	|	МаксимальныйРазделительПроведенных.Помещение КАК Помещение,
	|	МаксимальныйРазделительПроведенных.ПриборУчета КАК ПриборУчета,
	|	энргПредоставленныеПоказания.Шкала КАК Шкала,
	|	энргПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныйРазделительПроведенных.Разделитель КАК Разделитель,
	|	энргПредоставленныеПоказания.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ПоследниеНомераПозиции
	|ИЗ
	|	МаксимальныйРазделительПроведенных КАК МаксимальныйРазделительПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|		ПО МаксимальныйРазделительПроведенных.Организация = энргПредоставленныеПоказания.Организация
	|			И МаксимальныйРазделительПроведенных.ПериодНачисления = энргПредоставленныеПоказания.ПериодНачисления
	|			И МаксимальныйРазделительПроведенных.Район = энргПредоставленныеПоказания.Район
	|			И МаксимальныйРазделительПроведенных.ЧастныйСектор = энргПредоставленныеПоказания.ЧастныйСектор
	|			И МаксимальныйРазделительПроведенных.Строение = энргПредоставленныеПоказания.Строение
	|			И МаксимальныйРазделительПроведенных.Помещение = энргПредоставленныеПоказания.Помещение
	|			И МаксимальныйРазделительПроведенных.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И МаксимальныйРазделительПроведенных.ПериодРегистрации = энргПредоставленныеПоказания.ДатаРегистратора
	|			И МаксимальныйРазделительПроведенных.ДокРегистратор = энргПредоставленныеПоказания.ДокРегистратор
	|			И МаксимальныйРазделительПроведенных.Разделитель = энргПредоставленныеПоказания.Разделитель
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПредоставленныеПоказания.Строение = &Строение)
	|			И (энргПредоставленныеПоказания.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор КАК ДокРегистратор,
	|	Граница.Разделитель КАК Разделитель,
	|	МАКСИМУМ(энргМаксимальныеПоказания.Период) КАК ПериодМаксПоказаний
	|ПОМЕСТИТЬ МаксПерПоказаний
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО Граница.Организация = энргМаксимальныеПоказания.Организация
	|			И Граница.Район = энргМаксимальныеПоказания.Район
	|			И Граница.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И Граница.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор = энргМаксимальныеПоказания.Регистратор
	|						И Граница.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор > энргМаксимальныеПоказания.Регистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор,
	|	Граница.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	МаксПерПоказаний.Разделитель КАК Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	МАКСИМУМ(энргМаксимальныеПоказания.Регистратор) КАК РегистраторМаксПоказаний
	|ПОМЕСТИТЬ РегМакПок
	|ИЗ
	|	МаксПерПоказаний КАК МаксПерПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО МаксПерПоказаний.Организация = энргМаксимальныеПоказания.Организация
	|			И МаксПерПоказаний.Район = энргМаксимальныеПоказания.Район
	|			И МаксПерПоказаний.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И МаксПерПоказаний.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И МаксПерПоказаний.Шкала = энргМаксимальныеПоказания.Шкала
	|			И МаксПерПоказаний.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И МаксПерПоказаний.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И (ВЫБОР
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор = энргМаксимальныеПоказания.Регистратор
	|						И МаксПерПоказаний.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор > энргМаксимальныеПоказания.Регистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ МаксПерПоказаний.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор,
	|	МаксПерПоказаний.Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	МАКСИМУМ(ЕСТЬNULL(энргМаксимальныеПоказания.Разделитель, 0)) КАК РазделительМаксПоказаний
	|ПОМЕСТИТЬ РазделительМакПок
	|ИЗ
	|	РегМакПок КАК РегМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО РегМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РегМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РегМакПок.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И РегМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РегМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РегМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РегМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РегМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.Регистратор
	|			И (ВЫБОР
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор = энргМаксимальныеПоказания.Регистратор
	|						И РегМакПок.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор > энргМаксимальныеПоказания.Регистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ РегМакПок.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделительМакПок.Организация КАК Организация,
	|	РазделительМакПок.Район КАК Район,
	|	РазделительМакПок.КлючПомещения КАК КлючПомещения,
	|	РазделительМакПок.ПриборУчета КАК ПриборУчета,
	|	РазделительМакПок.Шкала КАК Шкала,
	|	РазделительМакПок.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РазделительМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РазделительМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	энргМаксимальныеПоказания.ДатаРегистратора КАК ДатаРегистратораМаксимальных,
	|	энргМаксимальныеПоказания.Показание КАК МаксПоказания
	|ПОМЕСТИТЬ ДанныеМаксПоказаний
	|ИЗ
	|	РазделительМакПок КАК РазделительМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО РазделительМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РазделительМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РазделительМакПок.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И РазделительМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РазделительМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РазделительМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РазделительМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РазделительМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.Регистратор
	|			И РазделительМакПок.РазделительМаксПоказаний = энргМаксимальныеПоказания.Разделитель
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель,
	|	энргПоказанияПУПоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	энргПоказанияПУПоследовательность.ИмяТабЧасти КАК ИмяТабЧасти,
	|	Граница.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности) КАК ИсключенИзПоследовательности
	|ПОМЕСТИТЬ НаборДокументов
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И Граница.Строение = энргПоказанияПУПоследовательность.Строение
	|			И Граница.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель <= энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор < энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора < энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации < энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.Организация КАК Организация,
	|	энргПоказанияПриборовУчета.Район КАК Район,
	|	энргПоказанияПриборовУчета.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргПоказанияПриборовУчета.Переворот
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БылПереворот
	|ПОМЕСТИТЬ ДанныеПоПереворотам
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.Район = энргПоказанияПриборовУчета.Район
	|			И НаборДокументов.КлючПомещения = энргПоказанияПриборовУчета.КлючПомещения
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И (энргПоказанияПриборовУчета.Период МЕЖДУ НаборДокументов.ДатаРегистратора И НаборДокументов.ПериодРегистрации)
	|			И (энргПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
	|			И НаборДокументов.ДокРегистратор <> энргПоказанияПриборовУчета.Регистратор
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПриборовУчета.Организация,
	|	энргПоказанияПриборовУчета.Район,
	|	энргПоказанияПриборовУчета.КлючПомещения,
	|	энргПоказанияПриборовУчета.ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборДокументов.Организация КАК Организация,
	|	НаборДокументов.ПериодНачисления КАК ПериодНачисления,
	|	НаборДокументов.Район КАК Район,
	|	НаборДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	НаборДокументов.Строение КАК Строение,
	|	НаборДокументов.Помещение КАК Помещение,
	|	НаборДокументов.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор КАК ДокРегистратор,
	|	НаборДокументов.Разделитель КАК Разделитель,
	|	НаборДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	энргПоказанияПриборовУчета.Показание КАК Показание,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	энргПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|	энргПоказанияПриборовУчета.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	энргПоказанияПриборовУчета.КС КАК КС,
	|	энргПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	НаборДокументов.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ ДанныеДокументов
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.ПериодРегистрации = энргПоказанияПриборовУчета.Период
	|			И НаборДокументов.ДокРегистратор = энргПоказанияПриборовУчета.Регистратор
	|			И НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.КлючПомещения = энргПоказанияПриборовУчета.КлючПомещения
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И НаборДокументов.Разделитель = энргПоказанияПриборовУчета.Разделитель
	|			И (НаборДокументов.ИсключенИзПоследовательности = ЛОЖЬ)
	//|			И (НЕ НаборДокументов.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.Район = &Район)
	|			И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборДокументов.Организация,
	|	НаборДокументов.ПериодНачисления,
	|	НаборДокументов.Район,
	|	НаборДокументов.ЧастныйСектор,
	|	НаборДокументов.Строение,
	|	НаборДокументов.Помещение,
	|	НаборДокументов.ПриборУчета,
	|	ДанныеМаксПоказаний.Шкала,
	|	ДанныеМаксПоказаний.ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор,
	|	НаборДокументов.Разделитель,
	|	НаборДокументов.ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены),
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	НаборДокументов.КлючПомещения
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО НаборДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И НаборДокументов.Район = ДанныеМаксПоказаний.Район
	|			И НаборДокументов.КлючПомещения = ДанныеМаксПоказаний.КлючПомещения
	|			И НаборДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И (НаборДокументов.ИсключенИзПоследовательности);" + 
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	//|		ПО НаборДокументов.Организация = энргМаксимальныеПоказанияСрез.Организация
	//|			И (НаборДокументов.ПериодНачисления = ДОБАВИТЬКДАТЕ(энргМаксимальныеПоказанияСрез.ПериодНачисления, МЕСЯЦ, 1))
	//|			И НаборДокументов.Район = энргМаксимальныеПоказанияСрез.Район
	//|			И НаборДокументов.ЧастныйСектор = энргМаксимальныеПоказанияСрез.ЧастныйСектор
	//|			И НаборДокументов.Строение = энргМаксимальныеПоказанияСрез.Строение
	//|			И НаборДокументов.Помещение = энргМаксимальныеПоказанияСрез.Помещение
	//|			И НаборДокументов.ПриборУчета = энргМаксимальныеПоказанияСрез.ПриборУчета
	//|			И (НаборДокументов.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	//|			И (энргМаксимальныеПоказанияСрез.Организация = &Организация)
	//|			И (энргМаксимальныеПоказанияСрез.Район = &Район) ;" + 
	////|ВЫБРАТЬ
	////|	энргСостояниеДопускаВПомещение.Период КАК Период,
	////|	энргСостояниеДопускаВПомещение.Регистратор КАК Регистратор,
	////|	энргСостояниеДопускаВПомещение.Организация КАК Организация,
	////|	энргСостояниеДопускаВПомещение.Район КАК Район,
	////|	энргСостояниеДопускаВПомещение.КлючПомещения КАК КлючПомещения,
	////|	энргСостояниеДопускаВПомещение.ТочкаУчета КАК ТочкаУчета,
	////|	энргСостояниеДопускаВПомещение.ПриборУчета КАК ПриборУчета,
	////|	энргСостояниеДопускаВПомещение.Недопуск КАК Недопуск,
	////|	энргСостояниеДопускаВПомещение.ПериодНачисления КАК ПериодНачисления,
	////|	энргСостояниеДопускаВПомещение.ПериодРегистрации КАК ПериодРегистрации
	////|ПОМЕСТИТЬ СостояниеДопускаВПомещение
	////|ИЗ
	////|	(ВЫБРАТЬ
	////|		ДанныеДокументов.Организация КАК Организация,
	////|		ДанныеДокументов.Район КАК Район,
	////|		ДанныеДокументов.КлючПомещения КАК КлючПомещения,
	////|		ДанныеДокументов.ПриборУчета КАК ПриборУчета,
	////|		МАКСИМУМ(ДанныеДокументов.ДатаРегистратора) КАК ДатаРегистратора
	////|	ИЗ
	////|		ДанныеДокументов КАК ДанныеДокументов
	////|	
	////|	СГРУППИРОВАТЬ ПО
	////|		ДанныеДокументов.Организация,
	////|		ДанныеДокументов.ПриборУчета,
	////|		ДанныеДокументов.Район,
	////|		ДанныеДокументов.КлючПомещения) КАК ВложенныйЗапрос
	////|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеДопускаВПомещение КАК энргСостояниеДопускаВПомещение
	////|		ПО ВложенныйЗапрос.Организация = энргСостояниеДопускаВПомещение.Организация
	////|			И ВложенныйЗапрос.Район = энргСостояниеДопускаВПомещение.Район
	////|			И ВложенныйЗапрос.КлючПомещения = энргСостояниеДопускаВПомещение.КлючПомещения
	////|			И ВложенныйЗапрос.ПриборУчета = энргСостояниеДопускаВПомещение.ПриборУчета
	////|			И (энргСостояниеДопускаВПомещение.Период <= ВложенныйЗапрос.ДатаРегистратора)
	////|;
	////|
	////|////////////////////////////////////////////////////////////////////////////////
	////|"
	////
	//////+ РегистрыСведений.энргСостояниеДопускаВПомещение.ТекстЗапросаПриборыБезДопускаПодрядБольшеОпределенногоЧисла("ДанныеДокументов") +
	
	" 
	|ВЫБРАТЬ
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокументов.Район КАК Район,
	|	ДанныеДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДокументов.Строение КАК Строение,
	|	ДанныеДокументов.Помещение КАК Помещение,
	|	ДанныеДокументов.ПриборУчета КАК ПриборУчета,
	|	ДанныеДокументов.Шкала КАК Шкала,
	|	ДанныеДокументов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	ДанныеДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	ДанныеДокументов.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеДокументов.Разделитель КАК Разделитель,
	|	ДанныеДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ДанныеДокументов.Показание КАК Показание,
	|	ДанныеДокументов.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ДанныеДокументов.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ДанныеДокументов.Переворот КАК Переворот,
	|	ДанныеДокументов.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ДанныеДокументов.КС КАК КС,
	|	ДанныеДокументов.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(КоэффициентыПриборов.коэффициент, 1) КАК коэффициентПУ,
	|	ЕСТЬNULL(ПоследниеНомераПозиции.НомерПозиции, -1) КАК НомерПозици,
	|	ЕСТЬNULL(ДанныеПоПереворотам.БылПереворот, 0) КАК БылПереворот,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ПериодМаксПоказаний, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.МаксПоказания, -1) КАК МаксПоказания,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.РегистраторМаксПоказаний, ЗНАЧЕНИЕ(Документ.энргРегистрацияПоказанийАбонента.ПустаяСсылка)) КАК РегистраторМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ДатаРегистратораМаксимальных, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратораМаксимальных,
	|	ДанныеДокументов.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	ЛОЖЬ КАК НедопускПрибора
	//|	ВЫБОР КОГДА ПриборыСНЕДопуском.Организация ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК НедопускПрибора
	|ИЗ
	|	ДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ДанныеДокументов.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриборов КАК КоэффициентыПриборов
	|		ПО ДанныеДокументов.КлючПомещения = КоэффициентыПриборов.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = КоэффициентыПриборов.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеНомераПозиции КАК ПоследниеНомераПозиции
	|		ПО ДанныеДокументов.Организация = ПоследниеНомераПозиции.Организация
	|			И ДанныеДокументов.ПериодНачисления = ПоследниеНомераПозиции.ПериодНачисления
	|			И ДанныеДокументов.Район = ПоследниеНомераПозиции.Район
	|			И ДанныеДокументов.ЧастныйСектор = ПоследниеНомераПозиции.ЧастныйСектор
	|			И ДанныеДокументов.Строение = ПоследниеНомераПозиции.Строение
	|			И ДанныеДокументов.Помещение = ПоследниеНомераПозиции.Помещение
	|			И ДанныеДокументов.ПриборУчета = ПоследниеНомераПозиции.ПриборУчета
	|			И ДанныеДокументов.Шкала = ПоследниеНомераПозиции.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ПоследниеНомераПозиции.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПереворотам КАК ДанныеПоПереворотам
	|		ПО ДанныеДокументов.Организация = ДанныеПоПереворотам.Организация
	|			И ДанныеДокументов.Район = ДанныеПоПереворотам.Район
	|			И ДанныеДокументов.КлючПомещения = ДанныеПоПереворотам.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = ДанныеПоПереворотам.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеПоПереворотам.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеПоПереворотам.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО ДанныеДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И ДанныеДокументов.Район = ДанныеМаксПоказаний.Район
	|			И ДанныеДокументов.КлючПомещения = ДанныеМаксПоказаний.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеМаксПоказаний.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеМаксПоказаний.ТарифнаяЗона
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ПриборыСНЕДопуском КАК ПриборыСНЕДопуском
	//|		ПО ДанныеДокументов.Организация = ПриборыСНЕДопуском.Организация
	//|			И ДанныеДокументов.Район = ПриборыСНЕДопуском.Район
	//|			И ДанныеДокументов.КлючПомещения = ПриборыСНЕДопуском.КлючПомещения
	//|			И ДанныеДокументов.ПриборУчета = ПриборыСНЕДопуском.ПриборУчета
	////|			И ДанныеДокументов.ДокРегистратор = ПриборыСНЕДопуском.ДокРегистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	Помещение,
	|	ПриборУчета,
	|	Шкала,
	|	ТарифнаяЗона,
	|	ПериодРегистрации,
	|	ДатаРегистратора,
	|	ДокРегистратор,
	|	Разделитель";
	
	Если Отбор.ЧастныйСектор = Неопределено Тогда
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Отбор.Строение) Тогда
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
	ИначеЕсли Не ЗначениеЗаполнено(Отбор.Помещение) И Не Отбор.ЧастныйСектор Тогда
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
	КонецЕсли;
	
	Запрос.Текст 		= Текст;
	Запрос.УстановитьПараметр("Район",						Отбор.район);
	Запрос.УстановитьПараметр("Организация",				Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",			Отбор.ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ЧастныйСектор",				Отбор.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение",					Отбор.Строение);
	Запрос.УстановитьПараметр("КолвоНедопусковПодряд",		Отбор.КолвоНедопусковПодряд);
	Запрос.УстановитьПараметр("Период",						Отбор.КонецПериодаРасчета); 	
	
	Если ЗначениеЗаполнено(Отбор.Помещение) Или ЗначениеЗаполнено(Отбор.Строение) И Отбор.ЧастныйСектор Тогда
		СтруктураКлючПомещения = РегистрыСведений.энргКлючиПомещений.ПолучитьДанныеПомещенияСОтбором(Отбор.Строение, Отбор.Помещение);
		
		Запрос.УстановитьПараметр("КлючПомещения",			СтруктураКлючПомещения.КлючПомещения);
		Запрос.УстановитьПараметр("Помещение",				Отбор.Помещение);
		
		Если Не Отбор.ПриборУчета  = Неопределено Тогда
			Запрос.УстановитьПараметр("ПриборУчета",		Отбор.ПриборУчета);
		КонецЕсли; 	
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПровестиПоказанияПриборовУчета(ПараметрыПроведений, МассивДокументов, ДанныеСреднегоОбъема, ДанныеМаксимальногоПотребления, Ошибки, МенеджерыРегистров, СтатичныеДопПараметры)
	
	МенеджерэнргПоказанияПУПоследовательность = МенеджерыРегистров.энргПоказанияПУПоследовательность;	
	МенеджерэнргПредоставленныеПоказания	  = МенеджерыРегистров.энргПредоставленныеПоказания;	
	МенеджерэнргРасчетСреднегоОбъема		  =	МенеджерыРегистров.энргРасчетСреднегоОбъема;
	МенеджерэнргМаксимальныеПоказания		  =	МенеджерыРегистров.энргМаксимальныеПоказания;	
	МенеджерэнргМаксимальныеПоказанияСрез	  =	МенеджерыРегистров.энргМаксимальныеПоказанияСрез;
	
	Организация 									= ПараметрыПроведений.Организация;
	ПериодНачисления 								= ПараметрыПроведений.ПериодНачисления;
	Район 											= ПараметрыПроведений.Район;
	ЧастныйСектор									= ПараметрыПроведений.ЧастныйСектор;
	Строение										= ПараметрыПроведений.Строение;
	Помещение 										= ПараметрыПроведений.Помещение;
	КлючПомещения 									= ПараметрыПроведений.КлючПомещения;
	ПриборУчета 									= ПараметрыПроведений.ПриборУчета;
	Шкала		 									= ПараметрыПроведений.Шкала;
	ТарифнаяЗона 									= ПараметрыПроведений.ТарифнаяЗона;
	НомерПозиции 									= ПараметрыПроведений.НомерПозиции;
	ПоказанияС 										= ПараметрыПроведений.ПоказанияС;
	ПоказанияПО 									= ПараметрыПроведений.ПоказанияПО;
	НачалоПериодаРасчета 							= ПараметрыПроведений.НачалоПериодаРасчета;
	РегистрируетОбъем								= ПараметрыПроведений.РегистрируетОбъем;
	НедопускПрибора                                 = ПараметрыПроведений.НедопускПрибора;
	
	РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу 	= ПараметрыПроведений.РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу;//Константы.энргРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу.Получить();
	НачПокНеЯвляютсяКонечнымиПриУстПрибора				= ПараметрыПроведений.НачПокНеЯвляютсяКонечнымиПриУстПрибора;
	
	Исключен  										= СтатичныеДопПараметры.Исключен;
	//ПроведенВПоследоватености  						= СтатичныеДопПараметры.ПроведенВПоследоватености;
	
	ПоказанияОтклонены 								= СтатичныеДопПараметры.ПоказанияОтклонены;
	ПоказанияПриняты 								= СтатичныеДопПараметры.ПоказанияПриняты;
	//ПустоеСостояниеПоказаний						= СтатичныеДопПараметры.ПустоеСостояниеПоказаний;
	
	Попытка
		
		ТекНомерПозиции 							= НомерПозиции;
		
		ПредыдущиеМакс 								= Макс(МассивДокументов[0].МаксПоказания,0);
		ПериодПредыдущихМаксПок 					= МассивДокументов[0].ПериодМаксПоказаний;
		РегистраторМаксимальных 					= МассивДокументов[0].РегистраторМаксПоказаний;
		ДатаРегистратораМаксимальных 				= МассивДокументов[0].ДатаРегистратораМаксимальных;
		
		МаксимальныеПоказания  						= Новый Соответствие; 		
		
		для Каждого Выборка из МассивДокументов цикл
			
			Если Выборка.состояниепроведения  = Исключен тогда 			
				// Очищаем данные.
				НаборПоследовательности 			= СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);//РегистрыСведений.энргПоказанияПУПоследовательность.СоздатьНаборЗаписей();
				НаборПоследовательности.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
				НаборПоследовательности.Отбор.Организация.установить(Организация);
				НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
				НаборПоследовательности.Отбор.Район.установить(Район);
				НаборПоследовательности.Отбор.СостояниеПроведения.установить(Выборка.СостояниеПроведения);
				НаборПоследовательности.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
				НаборПоследовательности.Отбор.Строение.установить(Строение);
				НаборПоследовательности.Отбор.Помещение.установить(Помещение);
				НаборПоследовательности.Отбор.ПриборУчета.установить(ПриборУчета);
				НаборПоследовательности.Отбор.ПериодРегистрации.установить(Выборка.ПериодРегистрации);
				НаборПоследовательности.Отбор.ДатаРегистратора.установить(Выборка.ДатаРегистратора);
				НаборПоследовательности.Записать();
				
				// Получаем таблицу максимальных показаний по регистратору.
				НаборМаксПоказаний  				= СоздатьНаборЗаписей(МенеджерэнргМаксимальныеПоказания);//РегистрыСведений.энргМаксимальныеПоказания.СоздатьНаборЗаписей();
				НаборМаксПоказаний.Отбор.регистратор.установить(Выборка.ДокРегистратор);
				НаборМаксПоказаний.Записать();
				
				НаборПредоставленных 				= СоздатьНаборЗаписей(МенеджерэнргПредоставленныеПоказания);//РегистрыСведений.энргПредоставленныеПоказания.СоздатьНаборЗаписей();
				НаборПредоставленных.Отбор.Докрегистратор.установить(Выборка.ДокРегистратор);
				НаборПредоставленных.Записать();
				
				НаборМаксПоказанийСрез				= СоздатьНаборЗаписей(МенеджерэнргМаксимальныеПоказанияСрез);//РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
				НаборМаксПоказанийСрез.Отбор.Организация.установить(Организация);
				НаборМаксПоказанийСрез.Отбор.ПериодНачисления.установить(ПериодНачисления);
				НаборМаксПоказанийСрез.Отбор.Район.установить(Район);
				НаборМаксПоказанийСрез.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
				НаборМаксПоказанийСрез.Отбор.Строение.установить(Строение);
				НаборМаксПоказанийСрез.Отбор.Помещение.установить(Помещение);
				НаборМаксПоказанийСрез.Отбор.ПриборУчета.установить(ПриборУчета); 				
				НаборМаксПоказанийСрез.Отбор.Шкала.установить(Шкала);
				НаборМаксПоказанийСрез.Отбор.ТарифнаяЗона.установить(ТарифнаяЗона);
				
				НаборМаксПоказанийСрез.Записать();
				
				Продолжить;
			КонецЕсли;
			
			СостояниеПоказаний  					= Выборка.состояниеПоказаний;
			ПричинаОтклонения						= Выборка.ПричинаОтклонения;
			Переворот  								= Выборка.Переворот;
			
			ОбновлятьДанные 						= Истина;
			ЭтоОткрытие 							= Ложь;
			
			Текущие  								= Выборка.Показание;
			
			ЭтоМаксимальные 						= Ложь;			
			Если РегистрируетОбъем Тогда
				ЭтоМаксимальные 					= СостояниеПоказаний = ПоказанияПриняты;
			Иначе
				ЭтоМаксимальные 					= (ПредыдущиеМакс <=  Текущие или Переворот);
			КонецЕсли;
			
			// Обновляем показания в документа.
			ТипДокумента = ТипЗнч(Выборка.ДокРегистратор);
			Если ТипДокумента = Тип("ДокументСсылка.энргОперацияСЛицевымСчетом") тогда
				Если  Выборка.ДокРегистратор.Видоперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС тогда
					ОбновлятьДанные 				= Ложь;
					ЭтоОткрытие 					= Истина;
					ЭтоМаксимальные 				= Истина;
				КонецЕсли;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.энргОперацияСУслугами")	тогда
				Если Выборка.ДокРегистратор.Видоперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда
					ОбновлятьДанные 				= Ложь;
					ЭтоМаксимальные 				= Истина;
					ЭтоОткрытие 					= Истина;
				КонецЕсли;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.энргПерерасчет")	тогда
				ОбновлятьДанные 					= Ложь;
				ЭтоМаксимальные 					= Истина;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.энргОперацияСПриборомУчета")	тогда
				Видоперации = Выборка.ДокРегистратор.Видоперации;
				
				Если Видоперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ тогда
					ОбновлятьДанные 				= Ложь;
					ЭтоМаксимальные 				= Истина;
					ЭтоОткрытие 					= Истина;
				ИначеЕсли Видоперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ тогда
					ТабЧасть  						= Выборка.ДокРегистратор["ТочкиУчета"];
					СтрокиПрибора 					= ТабЧасть.найтиСтроки(Новый Структура("ПриборУчета",ПриборУчета));
					Если НЕ СтрокиПрибора.количество() = 0 тогда
						ОбновлятьДанные 			= Ложь;
						ЭтоМаксимальные 			= Истина;
						ЭтоОткрытие 				= Истина;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
			Если РегистрируетОбъем Тогда
				ОбновлятьДанные 						= Ложь;
			КонецЕсли;
			
			Если ОбновлятьДанные тогда
				ПараметрыОперации  						= Новый Структура("
				|КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,ПериодПредыдущихМаксПок,СостояниеПоказаний,ПричинаОтклонения,ДанныеМаксимальногоПотребления,
				|Переворот,НомерСтрокиТЧ,Разделитель,ДанныеСреднегоОбъема,МаксимальноВозможныеПоказания,КоэффициентПУ,ИмяТабЧасти,КС, НедопускПрибора",
				КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,ПериодПредыдущихМаксПок,СостояниеПоказаний,ПричинаОтклонения,ДанныеМаксимальногоПотребления,
				Переворот,Выборка.НомерСтрокиТЧ,Выборка.разделитель,ДанныеСреднегоОбъема,Выборка.МаксимальноВозможныеПоказания,Выборка.КоэффициентПУ,Выборка.ИмяТабЧасти,Выборка.КС, НедопускПрибора);
				
				ОбновитьДанныеВДокументе(ПериодНачисления, Выборка.ДокРегистратор, ПараметрыОперации);
				
				СостояниеПоказаний 	= ПараметрыОперации.СостояниеПоказаний;
				Переворот 			= ПараметрыОперации.Переворот;
			КонецЕсли;	
			
			ВСрок = Истина;
			Если НЕ ЭтоОткрытие Тогда 
				// Проверять "ВСрок" только документы регистрации показаний
				ВСрок = Выборка.ПериодРегистрации >= НачалоПериодаРасчета и День(Выборка.ПериодРегистрации) >= ПоказанияС и День(Выборка.ПериодРегистрации) <= ПоказанияПО И НЕ НедопускПрибора;
			КонецЕсли;			
			
			Если РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу и ВСрок и СостояниеПоказаний = Перечисления.энргСостояниеПоказаний.Отклонены Тогда
				Продолжить;
			КонецЕсли;
			
			Если НачПокНеЯвляютсяКонечнымиПриУстПрибора И ЭтоОткрытие и ВСрок Тогда 
				// Показания ввода прибора учета не должны учитываться как конечные при непредоставлении показаний
				ВСрок = Ложь;
			КонецЕсли;
			
			
			// Получаем таблицу максимальных показаний по регистратору.
			НаборМаксПоказаний  						= СоздатьНаборЗаписей(МенеджерэнргМаксимальныеПоказания);//РегистрыСведений.энргМаксимальныеПоказания.СоздатьНаборЗаписей();
			НаборМаксПоказаний.Отбор.регистратор.установить(Выборка.ДокРегистратор);
			НаборМаксПоказаний.Прочитать();
			ТаблицаМаксимальных 						= НаборМаксПоказаний.Выгрузить();
			для Каждого стр из ТаблицаМаксимальных цикл
				стр.активность  						= истина;
			КонецЦикла;
			
			НаборМаксПоказаний.Очистить(); 
			//НаборМаксПоказаний.Записать();
			
			Если Выборка.ДатаРегистратора < Выборка.ПериодРегистрации тогда
				// Может быть либо у потерянной квитанции или у контрольного съема который НЕ с 23-26.
				Если Выборка.БылПереворот = 1 тогда
					ЭтоМаксимальные 					= Ложь;			 
				КонецЕсли; 			 
			КонецЕсли;
			
			Если НЕ СостояниеПоказаний = ПоказанияПриняты тогда
				ЭтоМаксимальные 						= Ложь;
			КонецЕсли;
			
			Если СостояниеПоказаний = ПоказанияПриняты и Не ЭтоОткрытие Тогда
				НаборРасчетСреднего 					= СоздатьНаборЗаписей(МенеджерэнргРасчетСреднегоОбъема);//РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
				НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
				СтрокаНабор  							= НаборРасчетСреднего.Добавить();
				СтрокаНабор.Организация 	 			= Организация;
				СтрокаНабор.Район						= Район;
				СтрокаНабор.Строение					= Строение;
				СтрокаНабор.Помещение					= Помещение;
				СтрокаНабор.ЧастныйСектор				= ЧастныйСектор;
				СтрокаНабор.ТочкаУчета					= Выборка.ТочкаУчета;
				СтрокаНабор.Шкала						= Шкала;
				СтрокаНабор.ТарифнаяЗона				= ТарифнаяЗона;
				СтрокаНабор.ПериодНачисления			= ПериодНачисления;
				СтрокаНабор.ДокРегистратор  			= Выборка.ДокРегистратор;
				СтрокаНабор.Разделитель 				= Выборка.Разделитель;
				Если РегистрируетОбъем Тогда
					СтрокаНабор.ОбъемУслуги 			= Текущие;
				Иначе	
					СтрокаНабор.ОбъемУслуги 			= Текущие - ПредыдущиеМакс;
				КонецЕсли;
				НаборРасчетСреднего.Записать(Ложь);
			КонецЕсли;
			
			ПоказанияТекущегоПериода 					= Выборка.ПериодРегистрации >= НачалоПериодаРасчета;
			
			Если ЭтоМаксимальные тогда
				ПериодПредыдущихМаксПок 				= Выборка.ПериодРегистрации;
				ПредыдущиеМакс 							= Текущие;				
				РегистраторМаксимальных 				= Выборка.ДокРегистратор;
				ДатаРегистратораМаксимальных 			= Выборка.ДатаРегистратора
			КонецЕсли;
			
			Если ЭтоМаксимальные ИЛИ ВСрок тогда 				
				
				ПараметрыСтрокиМаксимальных  			= Новый Структура("Период,Активность,Организация, Район,КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,Разделитель",Выборка.ПериодРегистрации,истина,Организация,Район,КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,Выборка.Разделитель);
				СтрокиТаблицыМаксимальных				= ТаблицаМаксимальных.НайтиСтроки(ПараметрыСтрокиМаксимальных);
				
				Если СтрокиТаблицыМаксимальных.Количество() = 0 и ЭтоМаксимальные тогда
					// Строки такой нет значит добавляем.
					СтрокаМаксимальных  				= ТаблицаМаксимальных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаМаксимальных,ПараметрыСтрокиМаксимальных);
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				ИначеЕсли СтрокиТаблицыМаксимальных.Количество() = 1 и ЭтоМаксимальные тогда
					// Меняем показания.
					СтрокаМаксимальных  				= СтрокиТаблицыМаксимальных[0];
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				ИначеЕсли ЭтоМаксимальные тогда
					// Удаляем строки по прибору учета.
					для Каждого СтрокаТаблицыМаксимальных из СтрокиТаблицыМаксимальных цикл
						ТаблицаМаксимальных.Удалить(СтрокаТаблицыМаксимальных)
					КонецЦикла;
					// Добавляем новую.
					СтрокаМаксимальных  				= ТаблицаМаксимальных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаМаксимальных,ПараметрыСтрокиМаксимальных);
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				иначе
					Если СтрокиТаблицыМаксимальных.Количество() > 0 тогда
						// Удаляем строку из максимальных показаний.
						ТаблицаМаксимальных.Удалить(СтрокиТаблицыМаксимальных[0]);
					КонецЕсли;  // Иначе ничего не деляем там и так не никаких данных.
				КонецЕсли; // Иначе ничего не делаем оставляем строку так как она уже есть.
			КонецЕсли; 			
			
			Если  СостояниеПоказаний = ПоказанияПриняты ИЛИ ВСрок Тогда
				// Записываем набор.
				НаборПредоставленных 					= СоздатьНаборЗаписей(МенеджерэнргПредоставленныеПоказания);//РегистрыСведений.энргПредоставленныеПоказания.СоздатьНаборЗаписей();
				НаборПредоставленных.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
				СтрокаНабор  							= НаборПредоставленных.Добавить();
				СтрокаНабор.Организация 	 			= Организация;
				СтрокаНабор.ПериодНачисления 			= ПериодНачисления;
				СтрокаНабор.Район						= Район;
				СтрокаНабор.ЧастныйСектор				= ЧастныйСектор;
				СтрокаНабор.Строение					= Строение;
				СтрокаНабор.Помещение					= Помещение;
				СтрокаНабор.ПриборУчета					= ПриборУчета;
				СтрокаНабор.Шкала						= Шкала;
				СтрокаНабор.ТарифнаяЗона				= ТарифнаяЗона;
				СтрокаНабор.НомерПозиции  				= ?(ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.энргПерерасчет"),-1,ТекНомерПозиции);
				СтрокаНабор.ДатаРегистратора  			= Выборка.ПериодРегистрации;
				СтрокаНабор.ДокРегистратор  			= Выборка.ДокРегистратор;
				СтрокаНабор.Разделитель		  			= Выборка.Разделитель;
				Если РегистрируетОбъем Тогда
					СтрокаНабор.Показания  				= ?(СостояниеПоказаний = ПоказанияПриняты,Текущие,0);
				Иначе
					СтрокаНабор.Показания  				= ?(ПредыдущиеМакс<0,0,ПредыдущиеМакс);
				КонецЕсли;
				СтрокаНабор.ВСрок  						= ВСрок;
				СтрокаНабор.ПоказанияТекущегоПериода	= ПоказанияТекущегоПериода;
				
				НаборПредоставленных.Записать(Ложь); 				     			
				
				ТекНомерПозиции 						= ТекНомерПозиции +1;			
			КонецЕсли;			
			
			// Записываем максимальные показаний.
			НаборМаксПоказаний.Загрузить(ТаблицаМаксимальных);
			//НаборМаксПоказаний.Записать(Ложь);
			НаборМаксПоказаний.Записать();
			
		КонецЦикла;
		
		// Записываем максимальные показаний.
		Набор 											= СоздатьНаборЗаписей(МенеджерэнргМаксимальныеПоказанияСрез);//РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
		Набор.Отбор.Строение.установить(Строение);
		Набор.Отбор.Помещение.установить(Помещение);
		Набор.Отбор.ПриборУчета.установить(ПриборУчета);
		Набор.Отбор.Шкала.установить(Шкала);
		Набор.Отбор.ТарифнаяЗона.установить(ТарифнаяЗона);
		СтрокаНабора 									= Набор.Добавить();
		СтрокаНабора.Организация 						= Организация;
		СтрокаНабора.ПериодНачисления 					= ПериодНачисления;
		СтрокаНабора.Район								= Район;
		СтрокаНабора.ЧастныйСектор						= ЧастныйСектор;
		СтрокаНабора.Строение							= Строение;
		СтрокаНабора.Помещение							= Помещение;
		СтрокаНабора.ПриборУчета						= ПриборУчета;
		СтрокаНабора.Шкала								= Шкала;
		СтрокаНабора.ТарифнаяЗона						= ТарифнаяЗона;
		СтрокаНабора.Показания 							= ПредыдущиеМакс;
		СтрокаНабора.ДокРегистратор 					= РегистраторМаксимальных;
		СтрокаНабора.ДатаРегистратора 					= ДатаРегистратораМаксимальных;
		Набор.Записать();
		
		Возврат Ложь;
	Исключение
		ИнформацияОбОшибке  					= ИнформацияОбОшибке();
		Ошибки 									= Ошибки +
		Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		//Представление  									= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Представление);
		Возврат Истина;
	КонецПопытки;
КонецФункции

Функция ИмяТабличнойЧастиПоказаний(Регистратор)
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргКвитанция") тогда
		Возврат "ПриборыУчета";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОбходнойЛист")	тогда
		Возврат "ПриборыУчета";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСЛицевымСчетом")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС тогда
			Возврат "ТочкиУчетаЗакрытие";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли  ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчета")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ тогда
			Возврат "ПоказанияПУВВод";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ тогда
			Возврат "ПоказанияПУЗамена";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ тогда
			Возврат "ПоказанияПУВывод";	
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСУслугами")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги тогда
			Возврат "ТочкиУчета";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие")	тогда	
		Возврат "Показания";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента")	тогда	
		Возврат "ПриборыУчета";			
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера")	тогда	
		Возврат "ПриборыУчета";		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера")	тогда	
		Возврат "ПриборыУчета";		
	иначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргРегистрацияПоказанийМКД") тогда
		Возврат "ПриборыУчета";
	ИначеЕсли  ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчетаМКД")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ тогда
			Возврат "ПоказанияПУВВод";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ тогда
			Возврат "ПоказанияПУЗамена";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ тогда
			Возврат "ПоказанияПУВывод";	
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСУслугамиМКД")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги тогда
			Возврат "ТочкиУчетаВывод";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОткрытиеМКД")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие тогда
			Возврат "ТочкиУчетаВывод";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли; 
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОбходнойЛистМКД")	тогда
		Возврат "ПриборыУчета";
		
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
	КонецЕсли; 	
КонецФункции

Функция СтатичныеДополнительныеПараметрыПоказаний()
	
	Результат = Новый Структура;
	Результат.Вставить("Исключен", Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности);
	Результат.Вставить("ПроведенВПоследоватености", Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности);
	
	Результат.Вставить("ПоказанияОтклонены", Перечисления.энргСостояниеПоказаний.Отклонены);
	Результат.Вставить("ПоказанияПриняты", Перечисления.энргСостояниеПоказаний.Приняты);
	Результат.Вставить("ПустоеСостояниеПоказаний", Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область ВосстановитьПоследовательностьПоказанияПУМКД

Функция ОбновитьДанныеВДокументеМКД(ПериодНачисления,ДокРегистратор,ПараметрыОперации)
	
	ПоказанияПриняты 									= Перечисления.энргСостояниеПоказаний.Приняты;
	
	ДокОбъект  											= ДокРегистратор.получитьОбъект();
	ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
	
	Если ЗначениеЗаполнено(ПараметрыОперации.ИмяТабЧасти) тогда
		ИмяТЧ 											= ПараметрыОперации.ИмяТабЧасти;
	иначе
		ИмяТЧ 											= ИмяТабличнойЧастиПоказаний(ДокРегистратор);
	КонецЕсли;
	
	тчТочкиУчета 										= ДокОбъект["ТочкиУчета"];
	тчШкалыПриборов 									= ДокОбъект["ШкалыПриборовУчета"];
	тчПоказания 										= ДокОбъект["ПоказанияПриборовУчета"];
	
	Если ПараметрыОперации.НомерСтрокиТЧ > 0 тогда
		СтрокаПоказаний									= тчПоказания[ПараметрыОперации.НомерСтрокиТЧ-1];
		СтрокиШкал										= тчШкалыПриборов.НайтиСтроки(Новый Структура("IDСтроки", СтрокаПоказаний.IDСтроки));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;		
		СтрокаШкалы 									= СтрокиШкал[0];
		СтрокиТочки										= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтрокиТочкиУчета));
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			Возврат Ложь;
		КонецЕсли;
		СтрокаТочки 									= СтрокиТочки[0];
	иначе		
		СтрокиТочки		 								= тчТочкиУчета.найтиСтроки(Новый Структура("ПриборУчета",ПараметрыОперации.ПриборУчета));
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
			Возврат Ложь;
		КонецЕсли;		
		СтрокаТочки  									= СтрокиТочки[0];
		
		СтрокиШкал 										= тчШкалыПриборов.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета, Шкала",СтрокаТочки.IDСтроки, ПараметрыОперации.Шкала));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаШкалы                                    	= СтрокиШкал[0];
		СтрокиПоказаний 								= тчПоказания.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", СтрокаШкалы.IDСтроки, ПараметрыОперации.ТарифнаяЗона));
		Если СтрокиПоказаний.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета " +  ПараметрыОперации.ПриборУчета + " и тарифной зоны " +  ПараметрыОперации.ТарифнаяЗона  + " найдено более одной строки");
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаПоказаний 								= СтрокиПоказаний[0];
		
	КонецЕсли;  
	
	ДанныеСреднегоОбъема 								= ПараметрыОперации.ДанныеСреднегоОбъема; 	
	
	Если СтрокаТочки = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли  ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона] = Неопределено тогда
		СреднийОбъема 									= 0;
	иначе
		СреднийОбъема 									= ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона];
	КонецЕсли;
	
	ДанныеМаксимальногоПотребления 						= ПараметрыОперации.ДанныеМаксимальногоПотребления;
	Если ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга] = Неопределено тогда
		МаксимальноВозможныйОбъемПотребления 			= 1000;
	иначе 
		СтрокаСоотвествия 								= ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга];
		МаксимальноВозможныйОбъемПотребления 			= СтрокаСоотвествия.ПовышающийКоэффициент * СтрокаСоотвествия.МаксимальноеПотребления;	
	КонецЕсли;
	
	ДанныеСтроки 										= энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ДанныеСтрокиПоказанийМКД();
	
	ДанныеСтроки.ТекущиеПоказания	 					= СтрокаПоказаний.ТекущиеПоказания;
	ДанныеСтроки.Разница 								= СтрокаПоказаний.Разница;
	ДанныеСтроки.ПереворотИзмененПользователем 			= СтрокаПоказаний.ПереворотИзмененПользователем;
	ДанныеСтроки.СтатусИзмененПользователем 			= СтрокаПоказаний.СтатусИзмененПользователем;
	
	ДанныеСтроки.ПредыдущиеПоказания 					= ПараметрыОперации.ПредыдущиеМакс;
	ДанныеСтроки.ДатаПоследнихПоказаний 				= НачалоДня(ПараметрыОперации.ПериодПредыдущихМаксПок);
	ДанныеСтроки.СостояниеПоказаний 					= ПараметрыОперации.СостояниеПоказаний; 	
	ДанныеСтроки.СреднийОбъемПотребления 				= СреднийОбъема;
	ДанныеСтроки.МаксимальноВозможныеПоказания			= ПараметрыОперации.МаксимальноВозможныеПоказания;
	ДанныеСтроки.МаксимальноВозможныйОбъемПотребления	= МаксимальноВозможныйОбъемПотребления; 
	ДанныеСтроки.КоэффициентПУ							= ПараметрыОперации.КоэффициентПУ; 	
	ДанныеСтроки.Переворот 								= ПараметрыОперации.Переворот;			
	КонтрольныйСъем 									= ПараметрыОперации.КС;
	
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчетаМКД(ДанныеСтроки, ПериодНачисления,КонтрольныйСъем);
	
	Если ДанныеСтрокиИзменены(ДанныеСтроки,СтрокаПоказаний) тогда
		// Если что то изменилось в документе.
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний,ДанныеСтроки);				
		ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
		ДокОбъект.записать();
	КонецЕсли;
	
	Если ДанныеСтроки.СостояниеПоказаний <> ПараметрыОперации.СостояниеПоказаний или ДанныеСтроки.Переворот <> ПараметрыОперации.Переворот тогда
		// Если данные изменились записываем их.
		НаборПоказаний 								= РегистрыСведений.энргПоказанияПриборовУчетаМКД.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Прочитать();
		ТаблицаПоказаний  							= НаборПоказаний.Выгрузить();
		для Каждого стр из ТаблицаПоказаний цикл
			стр.активность 							= истина;
		КонецЦикла;   			
		НаборПоказаний.Очистить();
		НаборПоказаний.Записать();
		СтрокиПоказаний  							= ТаблицаПоказаний.НайтиСтроки(Новый Структура("МКД,ПриборУчета,Шкала,ТарифнаяЗона,Разделитель",ПараметрыОперации.МКД,ПараметрыОперации.ПриборУчета,ПараметрыОперации.Шкала, ПараметрыОперации.ТарифнаяЗона,ПараметрыОперации.Разделитель)); 
		Если СтрокиПоказаний.Количество() = 0 тогда 	
			// Движений по данному пу нету.	
			Если СтрокаПоказаний.ТекущиеПоказания > 0 тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
				Возврат Ложь;
			КонецЕсли;				
		иначеЕсли СтрокиПоказаний.Количество() > 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
			Возврат Ложь;
		иначе
			СтрокаПоказаний  						= СтрокиПоказаний[0];
			СтрокаПоказаний.Показание 				= ДанныеСтроки.ТекущиеПоказания;
			СтрокаПоказаний.Переворот 				= ДанныеСтроки.Переворот;
			СтрокаПоказаний.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
		КонецЕсли;			
		
		// Записываем новый набор показаний.
		НаборПоказаний 								= РегистрыСведений.энргПоказанияПриборовУчетаМКД.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Загрузить(ТаблицаПоказаний);
		НаборПоказаний.Записать(Ложь);			
		ПараметрыОперации.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
		ПараметрыОперации.Переворот 				= ДанныеСтроки.Переворот;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция РезультатЗапросаПоказанияПУМКД(МВТ,Отбор,НачалоПериодаРасчета) 
	
	Запрос  = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Текст =
	"ВЫБРАТЬ
	|	энргКоэффциентыПриборовУчетаСрезПоследних.КлючПомещения КАК МКД,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент КАК коэффициент
	|ПОМЕСТИТЬ КоэффициентыПриборов
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&НачалоПериодаРасчета, МЕСЯЦ), ДЕНЬ, 1),
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &Строение) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.МКД КАК МКД,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МинимальныйПериод
	|ИЗ
	|	РегистрСведений.энргПоказанияПУПоследовательностьМКД КАК энргПоказанияПУПоследовательность
	|ГДЕ
	|	энргПоказанияПУПоследовательность.Организация = &Организация
	|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
	|	И энргПоказанияПУПоследовательность.Район = &Район
	|	И энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И энргПоказанияПУПоследовательность.МКД = &Строение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПУПоследовательность.Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район,
	|	энргПоказанияПУПоследовательность.МКД,
	|	энргПоказанияПУПоследовательность.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйПериод.Организация КАК Организация,
	|	МинимальныйПериод.ПериодНачисления КАК ПериодНачисления,
	|	МинимальныйПериод.Район КАК Район,
	|	МинимальныйПериод.МКД КАК МКД,
	|	МинимальныйПериод.ПриборУчета КАК ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации КАК ПериодРегистрации,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МинимальнаяДатаРегистратора
	|ИЗ
	|	МинимальныйПериод КАК МинимальныйПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательностьМКД КАК энргПоказанияПУПоследовательность
	|		ПО МинимальныйПериод.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальныйПериод.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальныйПериод.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальныйПериод.МКД = энргПоказанияПУПоследовательность.МКД
	|			И МинимальныйПериод.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальныйПериод.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.МКД = &Строение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныйПериод.Организация,
	|	МинимальныйПериод.ПериодНачисления,
	|	МинимальныйПериод.Район,
	|	МинимальныйПериод.МКД,
	|	МинимальныйПериод.ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальнаяДатаРегистратора.Организация КАК Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район КАК Район,
	|	МинимальнаяДатаРегистратора.МКД КАК МКД,
	|	МинимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации КАК ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МинимальныйРегистратор
	|ИЗ
	|	МинимальнаяДатаРегистратора КАК МинимальнаяДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательностьМКД КАК энргПоказанияПУПоследовательность
	|		ПО МинимальнаяДатаРегистратора.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальнаяДатаРегистратора.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальнаяДатаРегистратора.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальнаяДатаРегистратора.МКД = энргПоказанияПУПоследовательность.МКД
	|			И МинимальнаяДатаРегистратора.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальнаяДатаРегистратора.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.МКД = &Строение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальнаяДатаРегистратора.Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район,
	|	МинимальнаяДатаРегистратора.МКД,
	|	МинимальнаяДатаРегистратора.ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.Разделитель КАК Разделитель,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ ВложенныйЗапрос.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрацииПоказаний
	|ПОМЕСТИТЬ Граница
	|ИЗ
	|	(ВЫБРАТЬ
	|		МинимальныйРегистратор.Организация КАК Организация,
	|		МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
	|		МинимальныйРегистратор.Район КАК Район,
	|		МинимальныйРегистратор.МКД КАК МКД,
	|		МинимальныйРегистратор.ПриборУчета КАК ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации КАК ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора КАК ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор КАК ДокРегистратор,
	|		МИНИМУМ(энргПоказанияПУПоследовательность.Разделитель) КАК Разделитель
	|	ИЗ
	|		МинимальныйРегистратор КАК МинимальныйРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательностьМКД КАК энргПоказанияПУПоследовательность
	|			ПО МинимальныйРегистратор.Организация = энргПоказанияПУПоследовательность.Организация
	|				И МинимальныйРегистратор.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|				И МинимальныйРегистратор.Район = энргПоказанияПУПоследовательность.Район
	|				И МинимальныйРегистратор.МКД = энргПоказанияПУПоследовательность.МКД
	|				И МинимальныйРегистратор.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|				И МинимальныйРегистратор.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|				И МинимальныйРегистратор.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|				И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|				И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|				И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|				И (энргПоказанияПУПоследовательность.Район = &Район)
	|				И (энргПоказанияПУПоследовательность.МКД = &Строение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимальныйРегистратор.Организация,
	|		МинимальныйРегистратор.ПериодНачисления,
	|		МинимальныйРегистратор.Район,
	|		МинимальныйРегистратор.МКД,
	|		МинимальныйРегистратор.ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.МКД КАК МКД,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ НаборПроведенныхВПоследовательности
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательностьМКД КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.МКД = энргПоказанияПУПоследовательность.МКД
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель > энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор > энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора > энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации > энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности))
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.МКД = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПроведенныхВПоследовательности.Организация КАК Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район КАК Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.МКД КАК МКД,
	|	НаборПроведенныхВПоследовательности.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МаксимальныйПериодРегистрацииПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПроведенныхВПоследовательности.Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.МКД,
	|	НаборПроведенныхВПоследовательности.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйПериодРегистрацииПроведенных.Организация КАК Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район КАК Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.МКД КАК МКД,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МаксимальнаяДатаПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериодРегистрацииПроведенных КАК МаксимальныйПериодРегистрацииПроведенных
	|		ПО НаборПроведенныхВПоследовательности.Организация = МаксимальныйПериодРегистрацииПроведенных.Организация
	|			И НаборПроведенныхВПоследовательности.ПериодНачисления = МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления
	|			И НаборПроведенныхВПоследовательности.Район = МаксимальныйПериодРегистрацииПроведенных.Район
	|			И НаборПроведенныхВПоследовательности.СостояниеПроведения = МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения
	|			И НаборПроведенныхВПоследовательности.МКД = МаксимальныйПериодРегистрацииПроведенных.МКД
	|			И НаборПроведенныхВПоследовательности.ПриборУчета = МаксимальныйПериодРегистрацииПроведенных.ПриборУчета
	|			И НаборПроведенныхВПоследовательности.ПериодРегистрации = МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйПериодРегистрацииПроведенных.Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.МКД,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаПроведенных.Организация КАК Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район КАК Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.МКД КАК МКД,
	|	МаксимальнаяДатаПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныйРегистраторПроведенных
	|ИЗ
	|	МаксимальнаяДатаПроведенных КАК МаксимальнаяДатаПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальнаяДатаПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальнаяДатаПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальнаяДатаПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальнаяДатаПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальнаяДатаПроведенных.МКД = НаборПроведенныхВПоследовательности.МКД
	|			И МаксимальнаяДатаПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальнаяДатаПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальнаяДатаПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаПроведенных.Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.МКД,
	|	МаксимальнаяДатаПроведенных.ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРегистраторПроведенных.Организация КАК Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район КАК Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.МКД КАК МКД,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор КАК ДокРегистратор,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.Разделитель) КАК Разделитель
	|ПОМЕСТИТЬ МаксимальныйРазделительПроведенных
	|ИЗ
	|	МаксимальныйРегистраторПроведенных КАК МаксимальныйРегистраторПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальныйРегистраторПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальныйРегистраторПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальныйРегистраторПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальныйРегистраторПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальныйРегистраторПроведенных.МКД = НаборПроведенныхВПоследовательности.МКД
	|			И МаксимальныйРегистраторПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальныйРегистраторПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальныйРегистраторПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|			И МаксимальныйРегистраторПроведенных.ДокРегистратор = НаборПроведенныхВПоследовательности.ДокРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйРегистраторПроведенных.Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.МКД,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРазделительПроведенных.Организация КАК Организация,
	|	МаксимальныйРазделительПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРазделительПроведенных.Район КАК Район,
	|	МаксимальныйРазделительПроведенных.МКД КАК МКД,
	|	МаксимальныйРазделительПроведенных.ПриборУчета КАК ПриборУчета,
	|	энргПредоставленныеПоказания.Шкала КАК Шкала,
	|	энргПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныйРазделительПроведенных.Разделитель КАК Разделитель,
	|	энргПредоставленныеПоказания.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ПоследниеНомераПозиции
	|ИЗ
	|	МаксимальныйРазделительПроведенных КАК МаксимальныйРазделительПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказанияМКД КАК энргПредоставленныеПоказания
	|		ПО МаксимальныйРазделительПроведенных.Организация = энргПредоставленныеПоказания.Организация
	|			И МаксимальныйРазделительПроведенных.ПериодНачисления = энргПредоставленныеПоказания.ПериодНачисления
	|			И МаксимальныйРазделительПроведенных.Район = энргПредоставленныеПоказания.Район
	|			И МаксимальныйРазделительПроведенных.МКД = энргПредоставленныеПоказания.МКД
	|			И МаксимальныйРазделительПроведенных.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И МаксимальныйРазделительПроведенных.ПериодРегистрации = энргПредоставленныеПоказания.ДатаРегистратора
	|			И МаксимальныйРазделительПроведенных.ДокРегистратор = энргПредоставленныеПоказания.ДокРегистратор
	|			И МаксимальныйРазделительПроведенных.Разделитель = энргПредоставленныеПоказания.Разделитель
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.МКД = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.МКД КАК МКД,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор КАК ДокРегистратор,
	|	Граница.Разделитель КАК Разделитель,
	|	МАКСИМУМ(энргМаксимальныеПоказания.Период) КАК ПериодМаксПоказаний
	|ПОМЕСТИТЬ МаксПерПоказаний
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияМКД КАК энргМаксимальныеПоказания
	|		ПО Граница.Организация = энргМаксимальныеПоказания.Организация
	|			И Граница.Район = энргМаксимальныеПоказания.Район
	|			И Граница.МКД = энргМаксимальныеПоказания.МКД
	|			И Граница.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор = энргМаксимальныеПоказания.Регистратор
	|						И Граница.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор > энргМаксимальныеПоказания.Регистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.МКД = &Строение)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.МКД,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор,
	|	Граница.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.МКД КАК МКД,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	МаксПерПоказаний.Разделитель КАК Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	МАКСИМУМ(энргМаксимальныеПоказания.Регистратор) КАК РегистраторМаксПоказаний
	|ПОМЕСТИТЬ РегМакПок
	|ИЗ
	|	МаксПерПоказаний КАК МаксПерПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияМКД КАК энргМаксимальныеПоказания
	|		ПО МаксПерПоказаний.Организация = энргМаксимальныеПоказания.Организация
	|			И МаксПерПоказаний.Район = энргМаксимальныеПоказания.Район
	|			И МаксПерПоказаний.МКД = энргМаксимальныеПоказания.МКД
	|			И МаксПерПоказаний.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И МаксПерПоказаний.Шкала = энргМаксимальныеПоказания.Шкала
	|			И МаксПерПоказаний.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И МаксПерПоказаний.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И (ВЫБОР
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор = энргМаксимальныеПоказания.Регистратор
	|						И МаксПерПоказаний.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор > энргМаксимальныеПоказания.Регистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ МаксПерПоказаний.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.МКД = &Строение)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.МКД,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор,
	|	МаксПерПоказаний.Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.МКД КАК МКД,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	МАКСИМУМ(ЕСТЬNULL(энргМаксимальныеПоказания.Разделитель, 0)) КАК РазделительМаксПоказаний
	|ПОМЕСТИТЬ РазделительМакПок
	|ИЗ
	|	РегМакПок КАК РегМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияМКД КАК энргМаксимальныеПоказания
	|		ПО РегМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РегМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РегМакПок.МКД = энргМаксимальныеПоказания.МКД
	|			И РегМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РегМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РегМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РегМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РегМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.Регистратор
	|			И (ВЫБОР
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор = энргМаксимальныеПоказания.Регистратор
	|						И РегМакПок.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор > энргМаксимальныеПоказания.Регистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ РегМакПок.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.МКД = &Строение)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.МКД,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделительМакПок.Организация КАК Организация,
	|	РазделительМакПок.Район КАК Район,
	|	РазделительМакПок.МКД КАК МКД,
	|	РазделительМакПок.ПриборУчета КАК ПриборУчета,
	|	РазделительМакПок.Шкала КАК Шкала,
	|	РазделительМакПок.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РазделительМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РазделительМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	энргМаксимальныеПоказания.ДатаРегистратора КАК ДатаРегистратораМаксимальных,
	|	энргМаксимальныеПоказания.Показание КАК МаксПоказания
	|ПОМЕСТИТЬ ДанныеМаксПоказаний
	|ИЗ
	|	РазделительМакПок КАК РазделительМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияМКД КАК энргМаксимальныеПоказания
	|		ПО РазделительМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РазделительМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РазделительМакПок.МКД = энргМаксимальныеПоказания.МКД
	|			И РазделительМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РазделительМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РазделительМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РазделительМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РазделительМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.Регистратор
	|			И РазделительМакПок.РазделительМаксПоказаний = энргМаксимальныеПоказания.Разделитель
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.МКД = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.МКД КАК МКД,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель,
	|	энргПоказанияПУПоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	энргПоказанияПУПоследовательность.ИмяТабЧасти КАК ИмяТабЧасти
	|ПОМЕСТИТЬ НаборДокументов
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательностьМКД КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.МКД = энргПоказанияПУПоследовательность.МКД
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель <= энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор < энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора < энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации < энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.МКД = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.Организация КАК Организация,
	|	энргПоказанияПриборовУчета.Район КАК Район,
	|	энргПоказанияПриборовУчета.МКД КАК МКД,
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргПоказанияПриборовУчета.Переворот
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БылПереворот
	|ПОМЕСТИТЬ ДанныеПоПереворотам
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчетаМКД КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.Район = энргПоказанияПриборовУчета.Район
	|			И НаборДокументов.МКД = энргПоказанияПриборовУчета.МКД
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И (энргПоказанияПриборовУчета.Период МЕЖДУ НаборДокументов.ДатаРегистратора И НаборДокументов.ПериодРегистрации)
	|			И (энргПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
	|			И НаборДокументов.ДокРегистратор <> энргПоказанияПриборовУчета.Регистратор
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.Район = &Район)
	|			И (энргПоказанияПриборовУчета.МКД = &Строение)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПриборовУчета.Организация,
	|	энргПоказанияПриборовУчета.Район,
	|	энргПоказанияПриборовУчета.МКД,
	|	энргПоказанияПриборовУчета.ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборДокументов.Организация КАК Организация,
	|	НаборДокументов.ПериодНачисления КАК ПериодНачисления,
	|	НаборДокументов.Район КАК Район,
	|	НаборДокументов.МКД КАК МКД,
	|	НаборДокументов.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор КАК ДокРегистратор,
	|	НаборДокументов.Разделитель КАК Разделитель,
	|	НаборДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	энргПоказанияПриборовУчета.Показание КАК Показание,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|	энргПоказанияПриборовУчета.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	энргПоказанияПриборовУчета.КС КАК КС,
	|	энргПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ДанныеДокументов
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчетаМКД КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.ПериодРегистрации = энргПоказанияПриборовУчета.Период
	|			И НаборДокументов.ДокРегистратор = энргПоказанияПриборовУчета.Регистратор
	|			И НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.МКД = энргПоказанияПриборовУчета.МКД
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И НаборДокументов.Разделитель = энргПоказанияПриборовУчета.Разделитель
	|			И (НЕ НаборДокументов.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.Район = &Район)
	|			И (энргПоказанияПриборовУчета.МКД = &Строение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборДокументов.Организация,
	|	НаборДокументов.ПериодНачисления,
	|	НаборДокументов.Район,
	|	НаборДокументов.МКД,
	|	НаборДокументов.ПриборУчета,
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка),
	|	НаборДокументов.СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор,
	|	НаборДокументов.Разделитель,
	|	НаборДокументов.ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|ГДЕ
	|	НаборДокументов.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокументов.Район КАК Район,
	|	ДанныеДокументов.МКД КАК МКД,
	|	ДанныеДокументов.ПриборУчета КАК ПриборУчета,
	|	ДанныеДокументов.Шкала КАК Шкала,
	|	ДанныеДокументов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	ДанныеДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	ДанныеДокументов.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеДокументов.Разделитель КАК Разделитель,
	|	ДанныеДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ДанныеДокументов.Показание КАК Показание,
	|	ДанныеДокументов.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ДанныеДокументов.Переворот КАК Переворот,
	|	ДанныеДокументов.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ДанныеДокументов.КС КАК КС,
	|	ДанныеДокументов.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(КоэффициентыПриборов.коэффициент, 1) КАК коэффициентПУ,
	|	ЕСТЬNULL(ПоследниеНомераПозиции.НомерПозиции, -1) КАК НомерПозици,
	|	ЕСТЬNULL(ДанныеПоПереворотам.БылПереворот, 0) КАК БылПереворот,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ПериодМаксПоказаний, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.МаксПоказания, -1) КАК МаксПоказания,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.РегистраторМаксПоказаний, ЗНАЧЕНИЕ(Документ.энргРегистрацияПоказанийАбонента.ПустаяСсылка)) КАК РегистраторМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ДатаРегистратораМаксимальных, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратораМаксимальных,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем
	|ИЗ
	|	ДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ДанныеДокументов.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриборов КАК КоэффициентыПриборов
	|		ПО ДанныеДокументов.МКД = КоэффициентыПриборов.МКД
	|			И ДанныеДокументов.ПриборУчета = КоэффициентыПриборов.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеНомераПозиции КАК ПоследниеНомераПозиции
	|		ПО ДанныеДокументов.Организация = ПоследниеНомераПозиции.Организация
	|			И ДанныеДокументов.ПериодНачисления = ПоследниеНомераПозиции.ПериодНачисления
	|			И ДанныеДокументов.Район = ПоследниеНомераПозиции.Район
	|			И ДанныеДокументов.МКД = ПоследниеНомераПозиции.МКД
	|			И ДанныеДокументов.ПриборУчета = ПоследниеНомераПозиции.ПриборУчета
	|			И ДанныеДокументов.Шкала = ПоследниеНомераПозиции.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ПоследниеНомераПозиции.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПереворотам КАК ДанныеПоПереворотам
	|		ПО ДанныеДокументов.Организация = ДанныеПоПереворотам.Организация
	|			И ДанныеДокументов.Район = ДанныеПоПереворотам.Район
	|			И ДанныеДокументов.МКД = ДанныеПоПереворотам.МКД
	|			И ДанныеДокументов.ПриборУчета = ДанныеПоПереворотам.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеПоПереворотам.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеПоПереворотам.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО ДанныеДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И ДанныеДокументов.Район = ДанныеМаксПоказаний.Район
	|			И ДанныеДокументов.МКД = ДанныеМаксПоказаний.МКД
	|			И ДанныеДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеМаксПоказаний.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеМаксПоказаний.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	ПриборУчета,
	|	Шкала,
	|	ТарифнаяЗона,
	|	ПериодРегистрации,
	|	ДатаРегистратора,
	|	ДокРегистратор,
	|	Разделитель";
	
	Если Отбор.Строение = Неопределено  тогда
		Текст 		= СтрЗаменить(Текст,"И КлючПомещения = &Строение","");		
		Текст 		= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.МКД = &Строение","");				
		Текст 		= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.МКД = &Строение)","");		
		Текст		= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.МКД = &Строение)","");		
		Текст		= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.МКД = &Строение","");		
		Текст 		= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.МКД = &Строение)","");		
		Текст 		= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.МКД = &Строение)","");		
	КонецЕсли;
	
	Запрос.Текст 	= Текст;
	Запрос.УстановитьПараметр("Район",					Отбор.район);
	Запрос.УстановитьПараметр("Организация",			Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",		Отбор.ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);	
	Если НЕ Отбор.Строение = Неопределено тогда
		Запрос.УстановитьПараметр("Строение",			Отбор.Строение);
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПровестиПоказанияПриборовУчетаМКД(ПараметрыПроведений,МассивДокументов,ДанныеСреднегоОбъема,ДанныеМаксимальногоПотребления)
	
	Организация 									= ПараметрыПроведений.Организация;
	ПериодНачисления 								= ПараметрыПроведений.ПериодНачисления;
	Район 											= ПараметрыПроведений.Район;
	МКД 											= ПараметрыПроведений.МКД;
	ПриборУчета 									= ПараметрыПроведений.ПриборУчета;
	Шкала		 									= ПараметрыПроведений.Шкала;
	ТарифнаяЗона 									= ПараметрыПроведений.ТарифнаяЗона;
	НомерПозиции 									= ПараметрыПроведений.НомерПозиции;
	ПоказанияС 										= ПараметрыПроведений.ПоказанияС;
	ПоказанияПО 									= ПараметрыПроведений.ПоказанияПО;
	НачалоПериодаРасчета 							= ПараметрыПроведений.НачалоПериодаРасчета;
	РегистрируетОбъем								= ПараметрыПроведений.РегистрируетОбъем;
	
	Попытка
		Исключен  									= Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности;
		ПроведенВПоследоватености  					= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
		
		ПоказанияОтклонены 							= Перечисления.энргСостояниеПоказаний.Отклонены;
		ПоказанияПриняты 							= Перечисления.энргСостояниеПоказаний.Приняты;
		ПустоеСостояниеПоказаний					= Перечисления.энргСостояниеПоказаний.ПустаяСсылка();
		ТекНомерПозиции 							= НомерПозиции;
		
		ПредыдущиеМакс 								= Макс(МассивДокументов[0].МаксПоказания,0);
		ПериодПредыдущихМаксПок 					= МассивДокументов[0].ПериодМаксПоказаний;
		РегистраторМаксимальных 					= МассивДокументов[0].РегистраторМаксПоказаний;
		ДатаРегистратораМаксимальных 				= МассивДокументов[0].ДатаРегистратораМаксимальных;
		
		МаксимальныеПоказания  						= Новый Соответствие; 		
		
		для Каждого Выборка из МассивДокументов цикл
			
			Если Выборка.состояниепроведения  = Исключен тогда 			
				// Очищаем данные.
				НаборПоследовательности 			= РегистрыСведений.энргПоказанияПУПоследовательностьМКД.СоздатьНаборЗаписей();
				НаборПоследовательности.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
				НаборПоследовательности.Отбор.Организация.установить(Организация);
				НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
				НаборПоследовательности.Отбор.Район.установить(Район);
				НаборПоследовательности.Отбор.СостояниеПроведения.установить(Выборка.СостояниеПроведения);
				НаборПоследовательности.Отбор.МКД.установить(МКД);
				НаборПоследовательности.Отбор.ПриборУчета.установить(ПриборУчета);
				НаборПоследовательности.Отбор.ПериодРегистрации.установить(Выборка.ПериодРегистрации);
				НаборПоследовательности.Отбор.ДатаРегистратора.установить(Выборка.ДатаРегистратора);
				НаборПоследовательности.Записать();
				
				// Получаем таблицу максимальных показаний по регистратору.
				НаборМаксПоказаний  				= РегистрыСведений.энргМаксимальныеПоказанияМКД.СоздатьНаборЗаписей();
				НаборМаксПоказаний.Отбор.регистратор.установить(Выборка.ДокРегистратор);
				НаборМаксПоказаний.Записать();
				
				НаборПредоставленных 				= РегистрыСведений.энргПредоставленныеПоказанияМКД.СоздатьНаборЗаписей();
				НаборПредоставленных.Отбор.Докрегистратор.установить(Выборка.ДокРегистратор);
				НаборПредоставленных.Записать();
				
				Продолжить;
			КонецЕсли;
			
			СостояниеПоказаний  					= Выборка.состояниеПоказаний;
			Переворот  								= Выборка.Переворот;
			ЭтоОткрытие 							= Ложь;
			ОбновлятьДанные 						= Истина;
			// Обновляем показания в документа.
			Если ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.энргОткрытиеМКД") тогда
				Если  Выборка.ДокРегистратор.Видоперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие тогда
					ОбновлятьДанные 				= Ложь;
					ЭтоОткрытие						= Истина;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.энргОперацияСУслугамиМКД")	тогда
				Если Выборка.ДокРегистратор.Видоперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги тогда
					ОбновлятьДанные 				= Ложь;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчетаМКД")	тогда
				Если Выборка.ДокРегистратор.Видоперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ тогда
					ОбновлятьДанные 				= Ложь;
				ИначеЕсли Выборка.ДокРегистратор.Видоперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ Тогда
					ТабЧасть  						= Выборка.ДокРегистратор["ТочкиУчета"];
					СтрокиПрибора 					= ТабЧасть.найтиСтроки(Новый Структура("ПриборУчета",ПриборУчета));
					Если СтрокиПрибора.количество() = 0 тогда
						ОбновлятьДанные 			= Ложь;
					КонецЕсли;
				КонецЕсли; 				 
			КонецЕсли;
			
			Если РегистрируетОбъем Тогда
				ОбновлятьДанные 						= Ложь;
			КонецЕсли;
			
			Если ОбновлятьДанные тогда
				ПараметрыОперации  					= Новый Структура("
				|МКД,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,ПериодПредыдущихМаксПок,СостояниеПоказаний,ДанныеМаксимальногоПотребления,
				|Переворот,НомерСтрокиТЧ,Разделитель,ДанныеСреднегоОбъема,МаксимальноВозможныеПоказания,КоэффициентПУ,ИмяТабЧасти,КС",
				МКД,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,ПериодПредыдущихМаксПок,СостояниеПоказаний,ДанныеМаксимальногоПотребления,
				Переворот,Выборка.НомерСтрокиТЧ,Выборка.разделитель,ДанныеСреднегоОбъема,Выборка.МаксимальноВозможныеПоказания,Выборка.КоэффициентПУ,Выборка.ИмяТабЧасти,Выборка.КС);
				
				Если Не ОбновитьДанныеВДокументеМКД(ПериодНачисления,Выборка.ДокРегистратор,ПараметрыОперации) Тогда
					Возврат Истина;
				КонецЕсли;
				
				СостояниеПоказаний 					= ПараметрыОперации.СостояниеПоказаний;
				Переворот 							= ПараметрыОперации.Переворот;
			КонецЕсли;	
			
			// Получаем таблицу максимальных показаний по регистратору.
			НаборМаксПоказаний  					= РегистрыСведений.энргМаксимальныеПоказанияМКД.СоздатьНаборЗаписей();
			НаборМаксПоказаний.Отбор.регистратор.установить(Выборка.ДокРегистратор);
			НаборМаксПоказаний.Прочитать();
			ТаблицаМаксимальных 					= НаборМаксПоказаний.Выгрузить();
			для Каждого стр из ТаблицаМаксимальных цикл
				стр.активность  = истина;
			КонецЦикла;
			
			НаборМаксПоказаний.Очистить(); 
			НаборМаксПоказаний.Записать(); 
			
			Текущие  								= Выборка.Показание;
			
			Если РегистрируетОбъем Тогда
				ЭтоМаксимальные 					= СостояниеПоказаний = ПоказанияПриняты;
			Иначе
				ЭтоМаксимальные 					= (ПредыдущиеМакс <=  Текущие или Переворот);
			КонецЕсли;
			
			Если Выборка.ДатаРегистратора < Выборка.ПериодРегистрации тогда
				// Может быть либо у потерянной квитанции или у контрольного съема который НЕ с 23-26.
				Если Выборка.БылПереворот = 1 тогда
					ЭтоМаксимальные 					= Ложь;			 
				КонецЕсли; 			 
			КонецЕсли;
			
			Если СостояниеПоказаний<> ПоказанияПриняты тогда
				ЭтоМаксимальные 						= ложь;
			КонецЕсли;
			
			ПараметрыСтрокиМаксимальных  				= Новый Структура("Период,Активность,Организация,Район,МКД,ПриборУчета,Шкала,ТарифнаяЗона,Разделитель",Выборка.ПериодРегистрации,истина,Организация,Район,МКД,ПриборУчета,Шкала,ТарифнаяЗона,Выборка.Разделитель);
			СтрокиТаблицыМаксимальных					= ТаблицаМаксимальных.НайтиСтроки(ПараметрыСтрокиМаксимальных);
			ПоказанияТекущегоПериода 					= Выборка.ПериодРегистрации >= НачалоПериодаРасчета;
			ВСрок 										= Выборка.ПериодРегистрации >= НачалоПериодаРасчета и День(Выборка.ПериодРегистрации)>=ПоказанияС и День(Выборка.ПериодРегистрации)<=ПоказанияПО;
			
			Если СостояниеПоказаний = ПоказанияПриняты И Не ЭтоОткрытие Тогда
				НаборРасчетСреднего 					= РегистрыСведений.энргРасчетСреднегоОбъемаМКД.СоздатьНаборЗаписей();
				НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
				СтрокаНабор  							= НаборРасчетСреднего.Добавить();
				СтрокаНабор.Организация 	 			= Организация;
				СтрокаНабор.Район						= Район;
				СтрокаНабор.МКД							= МКД;
				СтрокаНабор.ТочкаУчета					= Выборка.ТочкаУчета;
				СтрокаНабор.Шкала						= Шкала;
				СтрокаНабор.ТарифнаяЗона				= ТарифнаяЗона;
				СтрокаНабор.ПериодНачисления			= ПериодНачисления;
				СтрокаНабор.ДокРегистратор  			= Выборка.ДокРегистратор;
				СтрокаНабор.Разделитель 				= Выборка.Разделитель;
				Если РегистрируетОбъем Тогда
					СтрокаНабор.ОбъемУслуги 			= Текущие;
				Иначе	
					СтрокаНабор.ОбъемУслуги 			= Текущие - ПредыдущиеМакс;
				КонецЕсли;
				НаборРасчетСреднего.Записать(Ложь);
			КонецЕсли;
			
			Если ЭтоМаксимальные или ВСрок тогда 				
				Если ЭтоМаксимальные тогда
					ПериодПредыдущихМаксПок 			= Выборка.ПериодРегистрации;
					ПредыдущиеМакс 						= Текущие;				
					РегистраторМаксимальных 			= Выборка.ДокРегистратор;
					ДатаРегистратораМаксимальных 		= Выборка.ДатаРегистратора
				КонецЕсли;
				
				Если СтрокиТаблицыМаксимальных.Количество() = 0 и ЭтоМаксимальные тогда
					// Строки такой нет значит добавляем.
					СтрокаМаксимальных  				= ТаблицаМаксимальных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаМаксимальных,ПараметрыСтрокиМаксимальных);
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				ИначеЕсли СтрокиТаблицыМаксимальных.Количество() = 1 и ЭтоМаксимальные тогда
					// Меняем показания.
					СтрокаМаксимальных  				= СтрокиТаблицыМаксимальных[0];
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				ИначеЕсли ЭтоМаксимальные тогда
					// Удаляем строки по прибору учета.
					для Каждого СтрокаТаблицыМаксимальных из СтрокиТаблицыМаксимальных цикл
						ТаблицаМаксимальных.Удалить(СтрокаТаблицыМаксимальных)
					КонецЦикла;
					// Добавляем новую.
					СтрокаМаксимальных  				= ТаблицаМаксимальных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаМаксимальных,ПараметрыСтрокиМаксимальных);
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				иначе
					Если СтрокиТаблицыМаксимальных.Количество() > 0 тогда
						// Удаляем строку из максимальных показаний.
						ТаблицаМаксимальных.Удалить(СтрокиТаблицыМаксимальных[0]);
					КонецЕсли;  // Иначе ничего не деляем там и так не никаких данных.
				КонецЕсли; // Иначе ничего не делаем оставляем строку так как она уже есть.
			иначе
				Если СтрокиТаблицыМаксимальных.Количество() > 0 тогда
					// Удаляем строку из максимальных показаний.
					ТаблицаМаксимальных.Удалить(СтрокиТаблицыМаксимальных[0]);
				КонецЕсли;  // Иначе ничего не деляем там и так не никаких данных.
			КонецЕсли; 			
			
			Если  СостояниеПоказаний = ПоказанияПриняты или ВСрок тогда
				// Записываем набор.
				НаборПредоставленных 					= РегистрыСведений.энргПредоставленныеПоказанияМКД.СоздатьНаборЗаписей();
				НаборПредоставленных.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
				СтрокаНабор  							= НаборПредоставленных.Добавить();
				СтрокаНабор.Организация 	 			= Организация;
				СтрокаНабор.ПериодНачисления 			= ПериодНачисления;
				СтрокаНабор.Район						= Район;
				СтрокаНабор.МКД							= МКД;
				СтрокаНабор.ПриборУчета					= ПриборУчета;
				СтрокаНабор.Шкала						= Шкала;
				СтрокаНабор.ТарифнаяЗона				= ТарифнаяЗона;
				СтрокаНабор.НомерПозиции  				= ТекНомерПозиции;
				СтрокаНабор.ДатаРегистратора  			= Выборка.ПериодРегистрации;
				СтрокаНабор.ДокРегистратор  			= Выборка.ДокРегистратор;
				СтрокаНабор.Разделитель		  			= Выборка.Разделитель;
				Если РегистрируетОбъем Тогда
					СтрокаНабор.Показания  				= ?(СостояниеПоказаний = ПоказанияПриняты,Текущие,0);
				Иначе
					СтрокаНабор.Показания  				= ?(ПредыдущиеМакс<0,0,ПредыдущиеМакс);
				КонецЕсли;
				//СтрокаНабор.Показания  					= ?(ПредыдущиеМакс<0,0,ПредыдущиеМакс);
				СтрокаНабор.ВСрок  						= ВСрок;
				СтрокаНабор.ПоказанияТекущегоПериода	= ПоказанияТекущегоПериода;
				
				НаборПредоставленных.Записать(Ложь); 				     			
				
				ТекНомерПозиции 						= ТекНомерПозиции +1;			
			КонецЕсли;   
			
			// Записываем максимальные показаний.
			НаборМаксПоказаний.Загрузить(ТаблицаМаксимальных);
			НаборМаксПоказаний.Записать(Ложь);			
		КонецЦикла;
		
		// Записываем максимальные показаний.
		Набор = РегистрыСведений.энргМаксимальныеПоказанияСрезМКД.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(МКД);
		Набор.Отбор.ПриборУчета.установить(ПриборУчета);
		Набор.Отбор.Шкала.установить(Шкала);
		Набор.Отбор.ТарифнаяЗона.установить(ТарифнаяЗона);
		Набор.Записать();
		
		Набор 										= РегистрыСведений.энргМаксимальныеПоказанияСрезМКД.СоздатьНаборЗаписей();
		СтрокаНабора 								= Набор.Добавить();
		СтрокаНабора.Организация 					= Организация;
		СтрокаНабора.ПериодНачисления 				= ПериодНачисления;
		СтрокаНабора.Район							= Район;
		СтрокаНабора.МКД 							= МКД;
		СтрокаНабора.ПриборУчета					= ПриборУчета;
		СтрокаНабора.Шкала							= Шкала;
		СтрокаНабора.ТарифнаяЗона					= ТарифнаяЗона;
		СтрокаНабора.Показания 						= ПредыдущиеМакс;
		СтрокаНабора.ДокРегистратор 				= РегистраторМаксимальных;
		СтрокаНабора.ДатаРегистратора 				= ДатаРегистратораМаксимальных;
		Набор.Записать(Ложь);
		Возврат Ложь;
	Исключение
		Представление  								= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Представление);
		Возврат Истина;
	КонецПопытки;
	
КонецФункции 

Функция РезультатСреднийОбъемПотребленияМКД(МВТ,Отбор)
	
	Запрос 							= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 							=
	"ВЫБРАТЬ
	|	энргСреднийОбъемПотребления.Организация КАК Организация,
	|	энргСреднийОбъемПотребления.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребления.Район КАК Район,
	|	энргСреднийОбъемПотребления.МКД КАК МКД,
	|	энргСреднийОбъемПотребления.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребления.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребления.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребления.Объем КАК Объем
	|ПОМЕСТИТЬ СреднийОбъем
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК энргСреднийОбъемПотребления
	|ГДЕ
	|	энргСреднийОбъемПотребления.Организация = &Организация
	|	И энргСреднийОбъемПотребления.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребления.Район = &Район
	|	И энргСреднийОбъемПотребления.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Граница.Организация КАК Организация,
	|	Граница.ПериодНачисления КАК ПериодНачисления,
	|	Граница.Район КАК Район,
	|	Граница.МКД КАК МКД,
	|	ЕСТЬNULL(СреднийОбъем.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчета,
	|	ЕСТЬNULL(СреднийОбъем.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СреднийОбъем.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(СреднийОбъем.Объем, 0) КАК СреднееПотребление
	|ИЗ
	|	Граница КАК Граница
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъем КАК СреднийОбъем
	|		ПО Граница.Организация = СреднийОбъем.Организация
	|			И Граница.ПериодНачисления = СреднийОбъем.ПериодНачисления
	|			И Граница.Район = СреднийОбъем.Район
	|			И Граница.МКД = СреднийОбъем.МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	Шкала,
	|	ТарифнаяЗона";
	
	Если не Отбор.свойство("МКД") тогда
		Текст 							= СтрЗаменить(Текст,"И энргСреднийОбъемПотребления.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",			Отбор.МКД);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Район",				Отбор.район);
	Запрос.УстановитьПараметр("Организация",		Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	Отбор.ПериодНачисления);
	
	Запрос.Текст 						= Текст;
	Возврат Запрос.Выполнить();
КонецФункции

Функция ДанныеСреднегоОбъемаМКД(ВыборкаСреднийОбъем,ТекМКД) 
	
	ТекТочкаУчета					= Неопределено;
	ТекШкала 						= Неопределено;
	СоотвествиеТочек 				= Новый Соответствие;
	СоответствиеЗоны 				= Неопределено;
	СоотвествиеШкал 				= Неопределено;
	Пока ВыборкаСреднийОбъем.МКД  = ТекМКД цикл		
		Если ЗначениеЗаполнено(ВыборкаСреднийОбъем.Шкала) и ЗначениеЗаполнено(ВыборкаСреднийОбъем.ТарифнаяЗона) Тогда
			Если ТекШкала <> ВыборкаСреднийОбъем.Шкала Тогда
				Если ТекШкала <> Неопределено тогда
					СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли;
			
			Если ТекТочкаУчета <> ВыборкаСреднийОбъем.ТочкаУчета тогда
				Если ТекТочкаУчета <> Неопределено тогда
					СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли; 	
			
			СоответствиеЗоны.Вставить(ВыборкаСреднийОбъем.ТарифнаяЗона,ВыборкаСреднийОбъем.СреднееПотребление);
		КонецЕсли;
		
		Если не ВыборкаСреднийОбъем.следующий() тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Если ТекШкала <> Неопределено тогда
		СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
	КонецЕсли;		
	
	Если ТекТочкаУчета <> Неопределено тогда
		СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
	КонецЕсли;	  
	
	Возврат СоотвествиеТочек;
	
КонецФункции

#КонецОбласти

#Область ВосстановитьПоследовательностьВзаиморасчеты

Функция ТекстЗапросаэнргВзаиморасчетыПоМесяцам(Абонент)
	Текст = 
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцам.Период КАК Период,
	|	энргВзаиморасчетыПоМесяцам.Регистратор КАК Регистратор,
	|	энргВзаиморасчетыПоМесяцам.НомерСтроки КАК НомерСтроки,
	|	энргВзаиморасчетыПоМесяцам.Активность КАК Активность,
	|	энргВзаиморасчетыПоМесяцам.ВидДвижения КАК ВидДвижения,
	|	энргВзаиморасчетыПоМесяцам.Организация КАК Организация,
	|	энргВзаиморасчетыПоМесяцам.Район КАК Район,
	|	энргВзаиморасчетыПоМесяцам.МКД КАК МКД,
	|	энргВзаиморасчетыПоМесяцам.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоМесяцам.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцам.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцам.Поставщик КАК Поставщик,
	|	энргВзаиморасчетыПоМесяцам.Сумма КАК Сумма,
	|	энргВзаиморасчетыПоМесяцам.ПериодРегистрации КАК ПериодРегистрации,
	|	энргВзаиморасчетыПоМесяцам.Разделитель КАК Разделитель,
	|	энргВзаиморасчетыПоМесяцам.МоментВремени КАК МоментВремени
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
	|ГДЕ
	|	энргВзаиморасчетыПоМесяцам.Регистратор = &Регистратор
	|	И энргВзаиморасчетыПоМесяцам.Организация = &Организация
	|	И энргВзаиморасчетыПоМесяцам.Абонент <> &Абонент";
	
	Если Не ЗначениеЗаполнено(Абонент) Тогда
		Текст	= СтрЗаменить(Текст, "энргВзаиморасчетыПоМесяцам.Абонент <> &Абонент", "ИСТИНА");
	КонецЕсли;

	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаэнргАвансы(Абонент)
	Текст =
	"ВЫБРАТЬ
	|	энргАвансы.Период КАК Период,
	|	энргАвансы.Регистратор КАК Регистратор,
	|	энргАвансы.НомерСтроки КАК НомерСтроки,
	|	энргАвансы.Активность КАК Активность,
	|	энргАвансы.ВидДвижения КАК ВидДвижения,
	|	энргАвансы.Организация КАК Организация,
	|	энргАвансы.Район КАК Район,
	|	энргАвансы.МКД КАК МКД,
	|	энргАвансы.Абонент КАК Абонент,
	|	энргАвансы.ДокументОплаты КАК ДокументОплаты,
	|	энргАвансы.Разделитель КАК Разделитель,
	|	энргАвансы.Сумма КАК Сумма,
	|	энргАвансы.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	РегистрНакопления.энргАвансы КАК энргАвансы
	|ГДЕ
	|	энргАвансы.Регистратор = &Регистратор
	|	И энргАвансы.Организация = &Организация
	|	И энргАвансы.Абонент <> &Абонент";
	
	Если Не ЗначениеЗаполнено(Абонент) Тогда
		Текст	= СтрЗаменить(Текст, "энргАвансы.Абонент <> &Абонент", "ИСТИНА");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаэнргАвансыИспользованные(Абонент)
	Текст =
	"ВЫБРАТЬ
	|	энргАвансыИспользованные.Период КАК Период,
	|	энргАвансыИспользованные.Регистратор КАК Регистратор,
	|	энргАвансыИспользованные.НомерСтроки КАК НомерСтроки,
	|	энргАвансыИспользованные.Активность КАК Активность,
	|	энргАвансыИспользованные.Организация КАК Организация,
	|	энргАвансыИспользованные.Район КАК Район,
	|	энргАвансыИспользованные.МКД КАК МКД,
	|	энргАвансыИспользованные.Абонент КАК Абонент,
	|	энргАвансыИспользованные.ДокументОплаты КАК ДокументОплаты,
	|	энргАвансыИспользованные.Услуга КАК Услуга,
	|	энргАвансыИспользованные.Поставщик КАК Поставщик,
	|	энргАвансыИспользованные.ПериодРасчета КАК ПериодРасчета,
	|	энргАвансыИспользованные.ПериодНачисления КАК ПериодНачисления,
	|	энргАвансыИспользованные.Сумма КАК Сумма,
	|	энргАвансыИспользованные.Разделитель КАК Разделитель,
	|	энргАвансыИспользованные.МоментВремени КАК МоментВремени
	|ИЗ
	|	РегистрНакопления.энргАвансыИспользованные КАК энргАвансыИспользованные
	|ГДЕ
	|	энргАвансыИспользованные.Регистратор = &Регистратор
	|	И энргАвансыИспользованные.Организация = &Организация
	|	И энргАвансыИспользованные.Абонент <> &Абонент";
	
	Если Не ЗначениеЗаполнено(Абонент) Тогда
		Текст	= СтрЗаменить(Текст, "энргАвансыИспользованные.Абонент <> &Абонент", "ИСТИНА");
	КонецЕсли;
	
	Возврат Текст;

КонецФункции

Функция ТекстЗапросаэнргАвансыПоступившие(Абонент)
	Текст =
	"ВЫБРАТЬ
	|	энргАвансыПоступившие.Период КАК Период,
	|	энргАвансыПоступившие.Регистратор КАК Регистратор,
	|	энргАвансыПоступившие.НомерСтроки КАК НомерСтроки,
	|	энргАвансыПоступившие.Активность КАК Активность,
	|	энргАвансыПоступившие.Организация КАК Организация,
	|	энргАвансыПоступившие.Район КАК Район,
	|	энргАвансыПоступившие.МКД КАК МКД,
	|	энргАвансыПоступившие.Абонент КАК Абонент,
	|	энргАвансыПоступившие.ПериодНачисления КАК ПериодНачисления,
	|	энргАвансыПоступившие.Кассир КАК Кассир,
	|	энргАвансыПоступившие.ИсточникПоступления КАК ИсточникПоступления,
	|	энргАвансыПоступившие.Сумма КАК Сумма,
	|	энргАвансыПоступившие.Разделитель КАК Разделитель,
	|	энргАвансыПоступившие.МоментВремени КАК МоментВремени
	|ИЗ
	|	РегистрНакопления.энргАвансыПоступившие КАК энргАвансыПоступившие
	|ГДЕ
	|	энргАвансыПоступившие.Регистратор = &Регистратор
	|	И энргАвансыПоступившие.Организация = &Организация
	|	И энргАвансыПоступившие.Абонент <> &Абонент";

	
	Если Не ЗначениеЗаполнено(Абонент) Тогда
		Текст	= СтрЗаменить(Текст, "энргАвансыПоступившие.Абонент <> &Абонент", "ИСТИНА");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ПровестиВзаиморасчеты(ПараметрыПроведения, МассивДокументовНачисления)
	
	СписокСервисовВзаиморасчетов = ПараметрыПроведения.СписокСервисовВзаиморасчетов;
	
	Организация 				= ПараметрыПроведения.Организация;
	ПериодНачисления			= ПараметрыПроведения.ПериодНачисления;
	Район						= ПараметрыПроведения.Район;
	МассивДокументов			= ПараметрыПроведения.МассивДокументов;
	СпособРаспределенияОплаты 	= ПараметрыПроведения.СпособРаспределенияОплаты;
	Исключен  					= ПараметрыПроведения.ИсключенИзПоследовательности;
	ПроведенВПоследоватености  	= ПараметрыПроведения.ПроведенВПоследовательности;
	МенеджерПоследовательности	= ПараметрыПроведения.МенеджерПоследовательности;

	текДокРегистратор 			= Неопределено;
	текРазделитель	 			= Неопределено;
	
	ОсвободившиесяДеньги = Новый Структура("Сумма", 0);
	
	//Параметры = Новый Структура("
	//|Организация, ПериодНачисления,Район,
	//|Авансы,СуммаАванса,ДанныеЗадолженности,ДанныеЗадолженностиПени,
	//|СпособРаспределенияОплаты, АвансГаситДопУслуги, НастройкиПорядкаПогашения, ОтрицательныеНачисленияСоздаютАвансы,
	//|ОсвободившиесяДеньги",
	// Организация, ПериодНачисления, Район,
	// ПараметрыПроведения.Авансы, ПараметрыПроведения.СуммаАванса, ДанныеЗадолженности, ДанныеЗадолженностиПени,
	// СпособРаспределенияОплаты, ПараметрыПроведения.АвансГаситДопУслуги, ПараметрыПроведения.НастройкиПорядкаПогашения, ПараметрыПроведения.ОтрицательныеНачисленияСоздаютАвансы,
	//ОсвободившиесяДеньги);
	
	Параметры = Новый Структура("
	|Организация, ПериодНачисления, Район, Авансы, СуммаАванса, СуммаАвансаЖивымиДеньгами,
	|СпособРаспределенияОплаты, АвансГаситДопУслуги, НастройкиПорядкаПогашения, УслугиДляПогашенияТолькоДеньгами, ОтрицательныеНачисленияСоздаютАвансы,
	|ОсвободившиесяДеньги",
	Организация, ПериодНачисления, Район, ПараметрыПроведения.Авансы, ПараметрыПроведения.СуммаАванса, ПараметрыПроведения.СуммаАвансаЖивымиДеньгами,	
	СпособРаспределенияОплаты, ПараметрыПроведения.АвансГаситДопУслуги, ПараметрыПроведения.НастройкиПорядкаПогашения, ПараметрыПроведения.УслугиДляПогашенияТолькоДеньгами, ПараметрыПроведения.ОтрицательныеНачисленияСоздаютАвансы,
	ОсвободившиесяДеньги);
	
	Для Каждого Документ из МассивДокументов цикл 
		ТипЗнчРегистратора = ТипЗнч(Документ.ДокРегистратор);
		
		Если ТипЗнчРегистратора = Тип("ДокументСсылка.энргРаспределениеМКД") Тогда
			Параметры.Вставить("ЭтоНачислениеТекущегоМесяца", Истина);
		Иначе
			Параметры.Вставить("ЭтоНачислениеТекущегоМесяца", Ложь);
		КонецЕсли;
		ОчищатьСтроки 							= Истина;
		Если текДокРегистратор = Документ.ДокРегистратор И текРазделитель = Документ.Разделитель Тогда
			ОчищатьСтроки 						= Ложь;
		КонецЕсли;
		
		Если Документ.состояниепроведения = Исключен тогда 			
			// Очищаем данные.
			НаборПоследовательности = СоздатьНаборЗаписей(МенеджерПоследовательности);//РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.ДокРегистратор.установить(Документ.ДокРегистратор);
			НаборПоследовательности.Отбор.Разделитель.установить(Документ.Разделитель);
			НаборПоследовательности.Отбор.Организация.установить(Организация);
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.СостояниеПроведения.установить(Документ.СостояниеПроведения);
			НаборПоследовательности.Отбор.МКД.установить(Документ.МКД);
			НаборПоследовательности.Отбор.Абонент.установить(Документ.Абонент);
			НаборПоследовательности.Записать();		
			Продолжить;
		КонецЕсли;
		
		текДокРегистратор = Документ.ДокРегистратор;
		текРазделитель	  = Документ.Разделитель;
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Абонент", 				Документ.Абонент);
		ДанныеДокумента.Вставить("МКД",						Документ.МКД); 				
		ДанныеДокумента.Вставить("Период",					Документ.ДатаРегистратора);
		ДанныеДокумента.Вставить("Кассир",					Документ.Кассир);
		ДанныеДокумента.Вставить("ИсточникПоступления",		Документ.ИсточникПоступления);		
		ДанныеДокумента.Вставить("Регистратор",				текДокРегистратор);
		ДанныеДокумента.Вставить("ЭтоОплата",				Документ.ЭтоОплата);
		ДанныеДокумента.Вставить("ЭтоКорректировкаОплаты",	Документ.ЭтоКорректировкаОплаты);
		ДанныеДокумента.Вставить("Разделитель",				Документ.Разделитель);
		ДанныеДокумента.Вставить("ВидОперации",				Документ.ВидОперации);
		
		СтруктураТаблицНаборов = СтруктураТаблицНаборов(МассивДокументовНачисления, ОчищатьСтроки, ДанныеДокумента, ПараметрыПроведения, текДокРегистратор, текРазделитель);
		
		ДанныеДокумента.Вставить("НаборТаблиц",				СтруктураТаблицНаборов.НаборТаблиц);
		ДанныеДокумента.Вставить("НаборыЗаписей",			СтруктураТаблицНаборов.НаборыЗаписей);
		
		Если ТипЗнчРегистратора = Тип("ДокументСсылка.энргПерерасчет") и НЕ Документ.ЭтоОплата Тогда
			
			Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
				ТекущийСервис.УвеличитьЗадолженностьАбонента(Параметры, ДанныеДокумента);
			КонецЦикла;
			
		ИначеЕсли ТипЗнчРегистратора = Тип("ДокументСсылка.энргПерерасчет") и Документ.ЭтоОплата Тогда
			
			Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
				ТекущийСервис.РаспределитьПерерасчетСОплатой(Параметры, ПараметрыПроведения.ДанныеОплаты, ДанныеДокумента);
			КонецЦикла;
			
			Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
				ТекущийСервис.РаспределитьОплатуАбонента(Параметры, ПараметрыПроведения.ДанныеОплаты, ДанныеДокумента);
			КонецЦикла;			
			
			Если Параметры.ОсвободившиесяДеньги.Сумма > 0 Тогда		
				Параметры.СуммаАванса = Параметры.СуммаАванса + Параметры.ОсвободившиесяДеньги.Сумма;
				Параметры.СуммаАвансаЖивымиДеньгами	= Параметры.СуммаАвансаЖивымиДеньгами + Параметры.ОсвободившиесяДеньги.Сумма;
				УвеличитьАванс(Параметры, ДанныеДокумента, Параметры.ОсвободившиесяДеньги.Сумма, Истина);
				Параметры.ОсвободившиесяДеньги.Сумма = 0;
			КонецЕсли; 		
			
		ИначеЕсли Не Документ.ЭтоОплата Тогда 
			
			Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
				ТекущийСервис.УвеличитьЗадолженностьАбонента(Параметры, ДанныеДокумента);
			КонецЦикла;
			
		Иначе 
			
			Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
				ТекущийСервис.РаспределитьОплатуАбонентаПоНазначению(Параметры, ПараметрыПроведения.ДанныеОплаты, ДанныеДокумента);
			КонецЦикла;
			
			Для Каждого ТекущийСервис Из СписокСервисовВзаиморасчетов Цикл
				ТекущийСервис.РаспределитьОплатуАбонента(Параметры, ПараметрыПроведения.ДанныеОплаты, ДанныеДокумента);
			КонецЦикла;			
			
			Если Параметры.ОсвободившиесяДеньги.Сумма > 0 Тогда		
				Параметры.СуммаАванса				= Параметры.СуммаАванса + Параметры.ОсвободившиесяДеньги.Сумма;
				Параметры.СуммаАвансаЖивымиДеньгами	= Параметры.СуммаАвансаЖивымиДеньгами + Параметры.ОсвободившиесяДеньги.Сумма;
				УвеличитьАванс(Параметры, ДанныеДокумента, Параметры.ОсвободившиесяДеньги.Сумма, Истина);
				Параметры.ОсвободившиесяДеньги.Сумма = 0;
			КонецЕсли;
			
		КонецЕсли;
		
		// Удаляем не нужные параметры.
		МассивПараметров = ПараметрыВзаиморасчетов();
		для Каждого УдаляемыйПараметр из МассивПараметров цикл
			Если Параметры.Свойство(УдаляемыйПараметр) тогда
				Параметры.Удалить(УдаляемыйПараметр);
			КонецЕсли;			
		КонецЦикла;
		
		// Не будем выполнять запись сразу, сначало пройдем всех абонентов.
		ТипЗнчтекДокРегистратор = ТипЗнч(текДокРегистратор);
		
		Если ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргНачисление")
			или ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргНачислениеПени")
			или ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргРаспределениеМКД")
			или (ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие") 
			И Не ЗначениеЗаполнено(Документ.ДокументОснование))
			или (ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргПерерасчет")
			И Документ.ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
			или ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера") тогда
			
			НаборыЗаписей 	= Новый Структура("энргВзаиморасчетыПоМесяцам,энргАвансы,энргАвансыИспользованные,энргВзаиморасчетыПоПени");			
			НаборТаблиц 	= Новый Структура("энргАвансы,энргАвансыИспользованные,энргВзаиморасчетыПоМесяцам,энргВзаиморасчетыПоПени"); 			
			
			Если ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие")
				или ТипЗнчтекДокРегистратор = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера") Тогда				
				
				НаборыЗаписей.Вставить("энргОплатаУслуг"		, Неопределено);
				НаборыЗаписей.Вставить("энргАвансыПоступившие"	, Неопределено);				
				НаборыЗаписей.Вставить("энргВзаиморасчетыПоПени", Неопределено);
				НаборыЗаписей.Вставить("энргОплатаПени"			, Неопределено);
				
				НаборТаблиц.Вставить("энргОплатаУслуг"			, Неопределено);
				НаборТаблиц.Вставить("энргАвансыПоступившие"	, Неопределено);
				НаборТаблиц.Вставить("энргВзаиморасчетыПоПени"	, Неопределено);
				НаборТаблиц.Вставить("энргОплатаПени"			, Неопределено);
				
			КонецЕсли;  	
			ЗаполнитьЗначенияСвойств(НаборыЗаписей, ДанныеДокумента.НаборыЗаписей);
			ЗаполнитьЗначенияСвойств(НаборТаблиц, ДанныеДокумента.НаборТаблиц);
			
			НаборыОтложеннаяЗапись = Новый Структура("НаборыЗаписей, НаборТаблиц", НаборыЗаписей, НаборТаблиц);
			
			Если МассивДокументовНачисления.Получить(текДокРегистратор) = Неопределено тогда				
				МассивДокументовНачисления.Вставить(текДокРегистратор, НаборыОтложеннаяЗапись);
			иначе
				МассивДокументовНачисления[текДокРегистратор] = НаборыОтложеннаяЗапись;
			КонецЕсли;
			
			ПараметрыПроведения.Вставить("ЕстьДокументыНачисления",Истина); 
			Продолжить;
			
		иначе
			
			НаборыЗаписей 	= ДанныеДокумента.НаборыЗаписей;			
			НаборТаблиц 	= ДанныеДокумента.НаборТаблиц;
			для Каждого СтрокаНабора из НаборыЗаписей цикл
				СтрокаНабора.Значение.загрузить(НаборТаблиц[СтрокаНабора.ключ]);
			КонецЦикла;	
			
		КонецЕсли;   	
		
		Попытка
			
			Для Каждого СтрокаНаборов из НаборыЗаписей цикл
				СтрокаНаборов.Значение.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				СтрокаНаборов.Значение.записать();
			КонецЦикла;	
			
		Исключение                      
			
			Представление = "Не восстановлена последоватеность по абоненту: " + Документ.Абонент;
			Представление = Представление + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Представление);
			
			Возврат Истина;
			
		КонецПопытки;
		
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции

Функция СтруктураТаблицНаборов(МассивДокументовНачисления, ОчищатьСтроки, ДанныеДокумента, ПараметрыПроведения, ДокРегистратор, Разделитель)
	
	НаборТаблиц  	= Новый Структура;
	НаборыЗаписей 	= Новый Структура;		
	Если (ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргНачисление")
		или ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргНачислениеПени")
		или ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргРаспределениеМКД")
		или (ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие")
		И Не ЗначениеЗаполнено(ДокРегистратор.ДокументОснование))
		или (ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргПерерасчет")
		И ДанныеДокумента.ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
		или ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера"))
		и МассивДокументовНачисления.Получить(ДокРегистратор) <> Неопределено тогда
		
		НаборыЗаписей  	= МассивДокументовНачисления[ДокРегистратор].НаборыЗаписей;
		НаборТаблиц 	= МассивДокументовНачисления[ДокРегистратор].НаборТаблиц;
	иначе 			
		
		ЭтоРучнойПерерасчетПени = ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргРучноеИзменениеПени");
		
		МассивИмен = ПараметрыПроведения.НаборыПоТипам.получить(ТипЗнч(ДокРегистратор));
		Для Каждого ИмяРегистра из МассивИмен Цикл 
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	*
			|ИЗ
			|	РегистрНакопления." + ИмяРегистра + " КАК РегистрыНакопления
			|ГДЕ
			|	РегистрыНакопления.Регистратор = &Регистратор";
			
			Запрос.УстановитьПараметр("Регистратор", ДокРегистратор);
			Таблица 	= Запрос.Выполнить().Выгрузить();
			
			Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ДокРегистратор);

			Если ЭтоРучнойПерерасчетПени Тогда
				Набор.ДополнительныеСвойства.Вставить("ЭтоРучнойПерерасчетПени", Истина);	
			КонецЕсли;
			
			НаборыЗаписей.Вставить(ИмяРегистра, Набор);
			НаборТаблиц.Вставить(ИмяРегистра, Таблица);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если ОчищатьСтроки  Тогда 		
		
		Для Каждого СтрокаТаблиц из НаборТаблиц Цикл
			
			Если СтрокаТаблиц.Значение = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура("Абонент", ДанныеДокумента.Абонент);
			
			Если ТипЗнч(ДокРегистратор) = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие") И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблиц.Значение.Колонки, "Разделитель") Тогда
				Отбор.Вставить("Разделитель", Разделитель);
			КонецЕсли;
			
			Строки = СтрокаТаблиц.Значение.НайтиСтроки(Отбор);
			для Каждого Строка из Строки цикл
				СтрокаТаблиц.Значение.Удалить(Строка);
			КонецЦикла;  
			
		КонецЦикла; 		
	КонецЕсли;
	
	Возврат Новый Структура("НаборТаблиц,НаборыЗаписей", НаборТаблиц, НаборыЗаписей);
	
КонецФункции

#Область УменьшениеЗадолженности

Процедура СписатьЗадолженностьСогласноНастройкиРаспределения(ПараметрыОперации,ДанныеДокумента,НадоСписать)
	
	ТаблицаВзаиморасчетыПоМесяцам 						= ДанныеДокумента.НаборТаблиц.энргВзаиморасчетыПоМесяцам;
	
	Если ДанныеДокумента.ЭтоОплата тогда
		ТаблицаОплатаУслуг			 					= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
	иначе
		ТаблицаАвансыИспользованные 					= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные
	КонецЕсли;
	
	ДанныеЗадолженности 								= ПараметрыОперации.ДанныеЗадолженности;
	Расшифровка 										= ДанныеЗадолженности.Расшифровка;
	
	МассивУдаляемых										= Новый Массив;
	
	для Каждого СтрокаЗадолженности из Расшифровка цикл
		
		Списываем 										= Мин(СтрокаЗадолженности.СуммаЗадолженности,НадоСписать);
		
		СтрокаЗадолженности.СуммаЗадолженности 			= СтрокаЗадолженности.СуммаЗадолженности - Списываем;
		
		Если СтрокаЗадолженности.СуммаЗадолженности = 0 тогда
			МассивУдаляемых.Добавить(СтрокаЗадолженности);
		КонецЕсли;
		
		СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчетыПоМесяцам.Добавить();
		СтрокаВзаиморасчеты.Организация		 			= ПараметрыОперации.Организация;
		СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
		СтрокаВзаиморасчеты.ПериодНачисления 			= СтрокаЗадолженности.ПериодРасчета;
		СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Расход;
		СтрокаВзаиморасчеты.Активность					= Истина;
		СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;		
		СтрокаВзаиморасчеты.МКД 						= ДанныеДокумента.МКД;
		СтрокаВзаиморасчеты.Абонент 					= ДанныеДокумента.Абонент;
		СтрокаВзаиморасчеты.Услуга 						= СтрокаЗадолженности.услуга;
		СтрокаВзаиморасчеты.Сумма 						= Списываем;
		СтрокаВзаиморасчеты.Поставщик					= СтрокаЗадолженности.Поставщик;
		СтрокаВзаиморасчеты.ПериодРегистрации			= ПараметрыОперации.ПериодНачисления;
		
		Если ДанныеДокумента.ЭтоОплата тогда 
			СтрокаОплатаУслуг 							= ТаблицаОплатаУслуг.добавить();
			СтрокаОплатаУслуг.Активность				= истина;
			СтрокаОплатаУслуг.Период 					= ДанныеДокумента.Период;
			СтрокаОплатаУслуг.Организация				= ПараметрыОперации.Организация;
			СтрокаОплатаУслуг.Район 					= ПараметрыОперации.Район;
			СтрокаОплатаУслуг.МКД 						= ДанныеДокумента.МКД;
			СтрокаОплатаУслуг.Абонент 					= ДанныеДокумента.Абонент;
			СтрокаОплатаУслуг.Услуга 					= СтрокаЗадолженности.Услуга;
			СтрокаОплатаУслуг.Поставщик					= СтрокаЗадолженности.Поставщик;
			СтрокаОплатаУслуг.Сумма 					= Списываем;
			СтрокаОплатаУслуг.ПериодНачисления			= СтрокаЗадолженности.ПериодРасчета;
			СтрокаОплатаУслуг.ПериодРасчета				= ПараметрыОперации.ПериодНачисления;
			СтрокаОплатаУслуг.Кассир					= ДанныеДокумента.Кассир;
			СтрокаОплатаУслуг.ИсточникПоступления		= ДанныеДокумента.ИсточникПоступления;
			СтрокаОплатаУслуг.Разделитель				= ДанныеДокумента.Разделитель;
		иначе
			ТаблицаАвансыИспользованные					= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.добавить();
			ЗаписьАвансыИспользованные.Активность  		= истина;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Сумма 			= Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Поставщик		= СтрокаЗадолженности.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= СтрокаЗадолженности.услуга;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
			// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
			ТаблицаАвансыИспользованные					= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.добавить();
			ЗаписьАвансыИспользованные.Активность  		= истина;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Сумма 			= -Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
		КонецЕсли;
		
		НадоСписать										= НадоСписать - Списываем;
	КонецЦикла; 
	
	для Каждого УдаляемаяСтрока из МассивУдаляемых цикл
		Расшифровка.удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура СписатьЗадолженностьПропорциональноЗадолженности(ПараметрыОперации, ДанныеДокумента, НадоСписать)
	
	ДанныеЗадолженности 									= ПараметрыОперации.ДанныеЗадолженности.Расшифровка;
	
	НайстрокиПогашенияЗадолженности							= ПараметрыОперации.НастройкиПорядкаПогашения;
	УслугиДляПогашенияТолькоДеньгами						= ПараметрыОперации.УслугиДляПогашенияТолькоДеньгами;
	
	ПериодыЗадолженности 									= ДанныеЗадолженности.Скопировать();
	
	СтрокиУдалить 											= Новый Массив;
	Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ПериодыЗадолженности Цикл
			Если УслугиДляПогашенияТолькоДеньгами.Найти(ТекСтрока.Услуга) <> Неопределено Тогда
				СтрокиУдалить.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
			ПериодыЗадолженности.Удалить(СтрокаУдалить);
		КонецЦикла;
	КонецЕсли;
	
	ПериодыЗадолженности.Свернуть("ПериодРасчета","СуммаЗадолженности");
	ПериодыЗадолженности.Сортировать("ПериодРасчета"); 	
	
	ТаблицаВзаиморасчетыПоМесяцам 							= ДанныеДокумента.НаборТаблиц.энргВзаиморасчетыПоМесяцам;
	
	СтрокиУдалить 											= Новый Массив;
	
	//
	Если НайстрокиПогашенияЗадолженности.количество()<> 0 Тогда
		
		Для Сч = 0 По НайстрокиПогашенияЗадолженности.Количество() - 1 Цикл
			Если НайстрокиПогашенияЗадолженности[Сч].Порядок > 0 Тогда 
				Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Найти(НайстрокиПогашенияЗадолженности[Сч].Услуга) <> Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				НайденныеУслуги = ДанныеЗадолженности.НайтиСтроки(Новый Структура("Услуга", НайстрокиПогашенияЗадолженности[Сч].Услуга)) ;
				ОстатокСуммы 										= НадоСписать;
				
				Для ИндексСтроки = 0 По НайденныеУслуги.ВГраница() Цикл			
					ОбщаяСуммаЗаПериод								= НайденныеУслуги[ИндексСтроки].СуммаЗадолженности;
					Если ОбщаяСуммаЗаПериод = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ДоляВПериоде	 								= НайденныеУслуги[ИндексСтроки].СуммаЗадолженности / ОбщаяСуммаЗаПериод;
					СписываемПоДоле 								= ?(ИндексСтроки = НайденныеУслуги.ВГраница(), НадоСписать, ДоляВПериоде * ОстатокСуммы);
					Списываем 										= Окр(Мин(СписываемПоДоле, НайденныеУслуги[ИндексСтроки].СуммаЗадолженности),2);
					НадоСписать 									= НадоСписать - Списываем;
					
					СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчетыПоМесяцам.Добавить();
					СтрокаВзаиморасчеты.Организация		 			= ПараметрыОперации.Организация;
					СтрокаВзаиморасчеты.ПериодНачисления 			= НайденныеУслуги[ИндексСтроки].ПериодРасчета;
					СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
					СтрокаВзаиморасчеты.ПериодРегистрации			= ПараметрыОперации.ПериодНачисления;
					СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Расход;
					СтрокаВзаиморасчеты.Активность					= Истина;
					СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;			
					СтрокаВзаиморасчеты.МКД 						= ДанныеДокумента.МКД;
					СтрокаВзаиморасчеты.Абонент 					= ДанныеДокумента.Абонент;
					СтрокаВзаиморасчеты.Услуга 						= НайденныеУслуги[ИндексСтроки].Услуга;
					СтрокаВзаиморасчеты.Сумма 						= Списываем;
					СтрокаВзаиморасчеты.Поставщик					= НайденныеУслуги[ИндексСтроки].Поставщик;
					СтрокаВзаиморасчеты.Разделитель					= ДанныеДокумента.Разделитель;
					
					НайденныеУслуги[ИндексСтроки].СуммаЗадолженности = НайденныеУслуги[ИндексСтроки].СуммаЗадолженности - Списываем;
					Если НайденныеУслуги[ИндексСтроки].СуммаЗадолженности = 0 Тогда
						СтрокиУдалить.Добавить(НайденныеУслуги[ИндексСтроки]);
					КонецЕсли;
					
					Если ДанныеДокумента.ЭтоОплата тогда          
						ТаблицаОплатаУслуг 							= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
						
						СтрокаОплатаУслуг 							= ТаблицаОплатаУслуг.добавить();
						СтрокаОплатаУслуг.Активность				= истина;  				
						СтрокаОплатаУслуг.Организация				= ПараметрыОперации.Организация;
						СтрокаОплатаУслуг.Район 					= ПараметрыОперации.Район;
						СтрокаОплатаУслуг.ПериодРасчета				= ПараметрыОперации.ПериодНачисления;
						СтрокаОплатаУслуг.Период 					= ДанныеДокумента.Период;
						СтрокаОплатаУслуг.МКД 						= ДанныеДокумента.МКД;
						СтрокаОплатаУслуг.Абонент 					= ДанныеДокумента.Абонент;
						СтрокаОплатаУслуг.Кассир					= ДанныеДокумента.Кассир;
						СтрокаОплатаУслуг.ИсточникПоступления		= ДанныеДокумента.ИсточникПоступления;
						СтрокаОплатаУслуг.Услуга 					= НайденныеУслуги[ИндексСтроки].услуга;
						СтрокаОплатаУслуг.Поставщик					= НайденныеУслуги[ИндексСтроки].Поставщик;
						СтрокаОплатаУслуг.Сумма 					= Списываем;
						СтрокаОплатаУслуг.ПериодНачисления			= НайденныеУслуги[ИндексСтроки].ПериодРасчета;
						СтрокаОплатаУслуг.Разделитель				= ДанныеДокумента.Разделитель;
					иначе
						ТаблицаАвансыИспользованные 				= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные; 
						
						ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
						ЗаписьАвансыИспользованные.Активность  		= истина;
						ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
						ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
						ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
						ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
						ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
						ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
						ЗаписьАвансыИспользованные.Сумма 			= Списываем;
						ЗаписьАвансыИспользованные.ПериодНачисления	= НайденныеУслуги[ИндексСтроки].ПериодРасчета;
						ЗаписьАвансыИспользованные.Поставщик		= НайденныеУслуги[ИндексСтроки].Поставщик;
						ЗаписьАвансыИспользованные.Услуга			= НайденныеУслуги[ИндексСтроки].услуга;	
						ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
						ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
						
						// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
						ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
						ЗаписьАвансыИспользованные.Активность  		= истина;
						ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
						ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;				
						ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
						ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
						ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
						ЗаписьАвансыИспользованные.Сумма 			= -Списываем;
						ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
						ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
						ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
						ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
						ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
						ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
					КонецЕсли;
					
					Если НадоСписать = 0 тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			иначе 
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
			ДанныеЗадолженности.Удалить(СтрокаУдалить);
		КонецЦикла;
		
		СтрокиУдалить.Очистить();
	КонецЕсли;
	
	Для Сч = 0 По ПериодыЗадолженности.Количество() - 1 Цикл
		
		СтрокиВПериоде 										= ДанныеЗадолженности.НайтиСтроки(Новый Структура("ПериодРасчета", ПериодыЗадолженности[Сч].ПериодРасчета));
		ОстатокСуммы 										= НадоСписать;
		
		ОбщаяСуммаЗаПериод									= ПериодыЗадолженности[Сч].СуммаЗадолженности;
		
		Для ИндексСтроки = 0 По СтрокиВПериоде.ВГраница() Цикл			
			
			Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Найти(СтрокиВПериоде[ИндексСтроки].Услуга) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбщаяСуммаЗаПериод = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДоляВПериоде	 								= СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности / ОбщаяСуммаЗаПериод;
			СписываемПоДоле 								= ?(ИндексСтроки = СтрокиВПериоде.ВГраница(), НадоСписать, ДоляВПериоде * ОстатокСуммы);
			Списываем 										= Окр(Мин(СписываемПоДоле, СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности),2);
			НадоСписать 									= НадоСписать - Списываем;
			
			СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчетыПоМесяцам.Добавить();
			СтрокаВзаиморасчеты.Организация		 			= ПараметрыОперации.Организация;
			СтрокаВзаиморасчеты.ПериодНачисления 			= СтрокиВПериоде[ИндексСтроки].ПериодРасчета;
			СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
			СтрокаВзаиморасчеты.ПериодРегистрации			= ПараметрыОперации.ПериодНачисления;
			СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Расход;
			СтрокаВзаиморасчеты.Активность					= Истина;
			СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;			
			СтрокаВзаиморасчеты.МКД 						= ДанныеДокумента.МКД;
			СтрокаВзаиморасчеты.Абонент 					= ДанныеДокумента.Абонент;
			СтрокаВзаиморасчеты.Услуга 						= СтрокиВПериоде[ИндексСтроки].Услуга;
			СтрокаВзаиморасчеты.Сумма 						= Списываем;
			СтрокаВзаиморасчеты.Поставщик					= СтрокиВПериоде[ИндексСтроки].Поставщик;
			СтрокаВзаиморасчеты.Разделитель					= ДанныеДокумента.Разделитель;
			
			СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности = СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности - Списываем;
			Если СтрокиВПериоде[ИндексСтроки].СуммаЗадолженности = 0 Тогда
				СтрокиУдалить.Добавить(СтрокиВПериоде[ИндексСтроки]);
			КонецЕсли;
			
			Если ДанныеДокумента.ЭтоОплата тогда          
				ТаблицаОплатаУслуг 							= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
				
				СтрокаОплатаУслуг 							= ТаблицаОплатаУслуг.добавить();
				СтрокаОплатаУслуг.Активность				= истина;  				
				СтрокаОплатаУслуг.Организация				= ПараметрыОперации.Организация;
				СтрокаОплатаУслуг.Район 					= ПараметрыОперации.Район;
				СтрокаОплатаУслуг.ПериодРасчета				= ПараметрыОперации.ПериодНачисления;
				СтрокаОплатаУслуг.Период 					= ДанныеДокумента.Период;
				СтрокаОплатаУслуг.МКД 						= ДанныеДокумента.МКД;
				СтрокаОплатаУслуг.Абонент 					= ДанныеДокумента.Абонент;
				СтрокаОплатаУслуг.Кассир					= ДанныеДокумента.Кассир;
				СтрокаОплатаУслуг.ИсточникПоступления		= ДанныеДокумента.ИсточникПоступления;
				СтрокаОплатаУслуг.Услуга 					= СтрокиВПериоде[ИндексСтроки].услуга;
				СтрокаОплатаУслуг.Поставщик					= СтрокиВПериоде[ИндексСтроки].Поставщик;
				СтрокаОплатаУслуг.Сумма 					= Списываем;
				СтрокаОплатаУслуг.ПериодНачисления			= СтрокиВПериоде[ИндексСтроки].ПериодРасчета;
				СтрокаОплатаУслуг.Разделитель				= ДанныеДокумента.Разделитель;
			иначе
				ТаблицаАвансыИспользованные 				= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные; 
				
				ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
				ЗаписьАвансыИспользованные.Активность  		= истина;
				ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
				ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
				ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
				ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
				ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
				ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
				ЗаписьАвансыИспользованные.Сумма 			= Списываем;
				ЗаписьАвансыИспользованные.ПериодНачисления	= СтрокиВПериоде[ИндексСтроки].ПериодРасчета;
				ЗаписьАвансыИспользованные.Поставщик		= СтрокиВПериоде[ИндексСтроки].Поставщик;
				ЗаписьАвансыИспользованные.Услуга			= СтрокиВПериоде[ИндексСтроки].услуга;	
				ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
				ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
				
				// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
				ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
				ЗаписьАвансыИспользованные.Активность  		= истина;
				ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
				ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;				
				ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
				ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
				ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
				ЗаписьАвансыИспользованные.Сумма 			= -Списываем;
				ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
				ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
				ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
				ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
				ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
				ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
			КонецЕсли;
			
			Если НадоСписать = 0 тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НадоСписать = 0 тогда
			Прервать;
		КонецЕсли; 		
	КонецЦикла;
	
	Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
		ДанныеЗадолженности.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	//Если НадоСписать > 0 Тогда		
	//	ПараметрыОперации.СуммаАванса  					= ПараметрыОперации.СуммаАванса + НадоСписать;
	//	УвеличитьАванс(ПараметрыОперации, ДанныеДокумента, НадоСписать);
	//	НадоСписать	 									= 0;
	//КонецЕсли;
	
КонецПроцедуры

Процедура СписатьЗадолженностьПоУслуге(ПараметрыОперации,ДанныеДокумента,НадоСписать,Услуга,Поставщик,ПериодРасчета)
	перем яПериодРасчета, яУслуга, яПоставщик;
	ДанныеЗадолженности 						= ПараметрыОперации.ДанныеЗадолженности.Расшифровка;
	УслугиДляПогашенияТолькоДеньгами			= ПараметрыОперации.УслугиДляПогашенияТолькоДеньгами;
	
	ТаблицаВзаиморасчетыПоМесяцам 				= ДанныеДокумента.НаборТаблиц.энргВзаиморасчетыПоМесяцам;
	ЭтоОплата 									= Истина;
	Если ПараметрыОперации.Свойство("СнятьТекущие") И ПараметрыОперации.СнятьТекущие Тогда
		ЭтоОплата 								= Ложь;
	КонецЕсли;
	
	ТаблицаОплатаУслуг 							= Неопределено;
	Если ЭтоОплата Тогда
		ТаблицаОплатаУслуг 						= ДанныеДокумента.НаборТаблиц.энргОплатаУслуг;
	КонецЕсли;
	
	Если НЕ ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("Услуга,ПериодРасчета,Поставщик");
		СтруктураПоиска.Услуга 					= Услуга;
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли НЕ ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("ПериодРасчета,Услуга");
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		СтруктураПоиска.Услуга 					= Услуга;
		
	ИначеЕсли НЕ ПериодРасчета = Неопределено И Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда 
		
		СтруктураПоиска  						= Новый Структура("ПериодРасчета,Поставщик");
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда 
		
		СтруктураПоиска  						= Новый Структура("Услуга,Поставщик");
		СтруктураПоиска.Услуга 					= Услуга;
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли НЕ ПериодРасчета = Неопределено И Услуга = Неопределено И Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("ПериодРасчета");
		СтруктураПоиска.ПериодРасчета 			= ПериодРасчета;
		
	ИначеЕсли ПериодРасчета = Неопределено И Услуга = Неопределено И НЕ Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("Поставщик");
		СтруктураПоиска.Поставщик 				= Поставщик;
		
	ИначеЕсли ПериодРасчета = Неопределено И НЕ Услуга = Неопределено И Поставщик = Неопределено Тогда
		
		СтруктураПоиска  						= Новый Структура("Услуга");
		СтруктураПоиска.Услуга 					= Услуга;	
		
	Иначе
		ВызватьИсключение "Что то пошло не так";		
	КонецЕсли;
	
	СтрокиЗадолженности 						= ДанныеЗадолженности.НайтиСтроки(СтруктураПоиска);
	
	МассивУдаляемых 							= Новый Массив;
	
	для Каждого СтрокаЗадолженности из СтрокиЗадолженности цикл
		Если Не ДанныеДокумента.ЭтоОплата И УслугиДляПогашенияТолькоДеньгами.Найти(СтрокаЗадолженности.Услуга) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Списываем 								= Мин(НадоСписать,СтрокаЗадолженности.СуммаЗадолженности);
		
		// Уменьшаем задолженность по месяцам.
		СтрокаВзаиморасчеты 					= ТаблицаВзаиморасчетыПоМесяцам.Добавить();		
		СтрокаВзаиморасчеты.Активность	 		= Истина;
		СтрокаВзаиморасчеты.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		СтрокаВзаиморасчеты.Организация 		= ПараметрыОперации.Организация;
		СтрокаВзаиморасчеты.Район		 		= ПараметрыОперации.Район;
		СтрокаВзаиморасчеты.ПериодРегистрации	= ПараметрыОперации.ПериодНачисления;
		СтрокаВзаиморасчеты.МКД			 		= ДанныеДокумента.МКД;
		СтрокаВзаиморасчеты.Абонент				= ДанныеДокумента.Абонент;
		СтрокаВзаиморасчеты.Период	 			= ДанныеДокумента.период;
		СтрокаВзаиморасчеты.Услуга				= СтрокаЗадолженности.Услуга;
		СтрокаВзаиморасчеты.Поставщик			= СтрокаЗадолженности.Поставщик;
		СтрокаВзаиморасчеты.ПериодНачисления	= СтрокаЗадолженности.ПериодРасчета;
		СтрокаВзаиморасчеты.Сумма				= Списываем; 		
		
		Если ЭтоОплата Тогда
			СтрокаОплатаУслуг 						= ТаблицаОплатаУслуг.Добавить();
			СтрокаОплатаУслуг.Активность	 		= Истина;
			СтрокаОплатаУслуг.Организация 			= ПараметрыОперации.Организация;
			СтрокаОплатаУслуг.Район		 			= ПараметрыОперации.Район;
			СтрокаОплатаУслуг.МКД			 		= ДанныеДокумента.МКД;
			СтрокаОплатаУслуг.Абонент				= ДанныеДокумента.Абонент;
			СтрокаОплатаУслуг.Период	 			= ДанныеДокумента.период;
			СтрокаОплатаУслуг.ИсточникПоступления	= ДанныеДокумента.ИсточникПоступления;
			СтрокаОплатаУслуг.Кассир				= ДанныеДокумента.Кассир;
			СтрокаОплатаУслуг.Услуга				= СтрокаЗадолженности.Услуга;
			СтрокаОплатаУслуг.Поставщик				= СтрокаЗадолженности.Поставщик;
			СтрокаОплатаУслуг.ПериодНачисления		= СтрокаЗадолженности.ПериодРасчета;
			СтрокаОплатаУслуг.ПериодРасчета			= ПараметрыОперации.ПериодНачисления;
			СтрокаОплатаУслуг.Сумма					= Списываем;
			СтрокаОплатаУслуг.Разделитель			= ДанныеДокумента.Разделитель;
			
		Иначе
			ТаблицаАвансыИспользованные 				= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные; 
			
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
			ЗаписьАвансыИспользованные.Активность  		= истина;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Сумма 			= Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= СтрокаЗадолженности.ПериодРасчета;
			ЗаписьАвансыИспользованные.Поставщик		= СтрокаЗадолженности.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= СтрокаЗадолженности.услуга;	
			ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
			
			// Возвращаем использованный аванс на услугу с которой снимаем начисления.					
			ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.Добавить();
			ЗаписьАвансыИспользованные.Активность  		= истина;
			ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
			ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;				
			ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
			ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.Период;
			ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
			ЗаписьАвансыИспользованные.Сумма 			= -Списываем;
			ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
			ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
			ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.услуга;
			ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
			ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
			
		КонецЕсли;
		
		СтрокаЗадолженности.СуммаЗадолженности 	= СтрокаЗадолженности.СуммаЗадолженности - Списываем; 		
		НадоСписать 							= НадоСписать - Списываем;
		
		Если СтрокаЗадолженности.СуммаЗадолженности = 0 тогда
			МассивУдаляемых.Добавить(СтрокаЗадолженности);
		КонецЕсли;  		
		
		Если НадоСписать = 0 Тогда
			Прервать;
		КонецЕсли; 		
		
	КонецЦикла;
	
	для Каждого УдаляемаяСтрока из МассивУдаляемых цикл
		ДанныеЗадолженности.Удалить(УдаляемаяСтрока);				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСАвансами

Процедура УвеличитьАванс(ПараметрыОперации,ДанныеДокумента,Сумма,ЖивыеДеньги)
	
	ТаблицаАвансы 									= ДанныеДокумента.НаборТаблиц.энргАвансы;
	
	ЗаписьАвансы  									= ТаблицаАвансы.добавить();
	ЗаписьАвансы.ВидДвижения 						= ВидДвиженияНакопления.Приход;
	ЗаписьАвансы.Активность  						= истина;
	ЗаписьАвансы.Период  							= ДанныеДокумента.Период;	
	ЗаписьАвансы.МКД	  							= ДанныеДокумента.МКД;
	ЗаписьАвансы.Абонент  							= ДанныеДокумента.Абонент;
	ЗаписьАвансы.ДокументОплаты						= ДанныеДокумента.Регистратор;
	ЗаписьАвансы.Сумма 								= Сумма;
	ЗаписьАвансы.Район  							= ПараметрыОперации.Район;
	ЗаписьАвансы.ПериодНачисления					= ПараметрыОперации.ПериодНачисления;
	ЗаписьАвансы.Организация						= ПараметрыОперации.Организация;
	ЗаписьАвансы.Разделитель						= ДанныеДокумента.Разделитель;
	
	ОписаниеАванса 									= ОписаниеАванса();
	ОписаниеАванса.СуммаАванса 						= Сумма;
	ОписаниеАванса.ДокументОплаты 					= ДанныеДокумента.Регистратор;
	ОписаниеАванса.Разделитель	 					= ДанныеДокумента.Разделитель;
	ОписаниеАванса.ЖивыеДеньги	 					= ЖивыеДеньги;
	мАвансы 										= ПараметрыОперации.Авансы;
	мАвансы.Добавить(ОписаниеАванса);
	
	Если ПараметрыОперации.свойство("СнятьТекущие") тогда
		ТаблицаАвансыИспользованные					= ДанныеДокумента.НаборТаблиц.энргАвансыИспользованные;
		ЗаписьАвансыИспользованные					= ТаблицаАвансыИспользованные.добавить();
		ЗаписьАвансыИспользованные.Активность  		= истина;
		ЗаписьАвансыИспользованные.Период  			= ДанныеДокумента.период;		
		ЗаписьАвансыИспользованные.МКД	  			= ДанныеДокумента.МКД;
		ЗаписьАвансыИспользованные.Абонент  		= ДанныеДокумента.Абонент;
		ЗаписьАвансыИспользованные.Сумма 			= -Сумма;
		//ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
		ЗаписьАвансыИспользованные.ПериодНачисления	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
		ЗаписьАвансыИспользованные.Организация		= ПараметрыОперации.Организация;
		ЗаписьАвансыИспользованные.Район  			= ПараметрыОперации.Район;
		ЗаписьАвансыИспользованные.Поставщик		= ПараметрыОперации.ВозвратАванса.Поставщик;
		ЗаписьАвансыИспользованные.Услуга			= ПараметрыОперации.ВозвратАванса.Услуга;
		//ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ВозвратАванса.ПериодРасчета;
		ЗаписьАвансыИспользованные.ПериодРасчета	= ПараметрыОперации.ПериодНачисления;
		ЗаписьАвансыИспользованные.ДокументОплаты	= ДанныеДокумента.Регистратор;
		ЗаписьАвансыИспользованные.Разделитель		= ДанныеДокумента.Разделитель;
	Иначе			
		ТаблицаАвансыПоступившие  					= ДанныеДокумента.НаборТаблиц.энргАвансыПоступившие;
		ЗаписьАвансыПоступившие						= ТаблицаАвансыПоступившие.добавить();
		ЗаписьАвансыПоступившие.Активность  		= истина;
		ЗаписьАвансыПоступившие.Период  			= ДанныеДокумента.период;		
		ЗаписьАвансыПоступившие.МКД	  				= ДанныеДокумента.МКД;
		ЗаписьАвансыПоступившие.Абонент  			= ДанныеДокумента.Абонент;
		ЗаписьАвансыПоступившие.Кассир				= ДанныеДокумента.Кассир;
		ЗаписьАвансыПоступившие.ИсточникПоступления	= ДанныеДокумента.ИсточникПоступления;
		ЗаписьАвансыПоступившие.Сумма 				= Сумма;
		ЗаписьАвансыПоступившие.Район  				= ПараметрыОперации.Район;
		ЗаписьАвансыПоступившие.ПериодНачисления	= ПараметрыОперации.ПериодНачисления;
		ЗаписьАвансыПоступившие.Организация			= ПараметрыОперации.Организация;
		ЗаписьАвансыПоступившие.Разделитель			= ДанныеДокумента.Разделитель;
	КонецЕсли;  	 
	
КонецПроцедуры

Функция АвансНаГраницу(Абонент,ВыборкаАванс)
	
	Авансы  					= Новый Массив;
	СуммаАванса					= 0;
	СуммаАвансаЖивымиДеньгами	= 0;
	
	Если Абонент  = ВыборкаАванс.Абонент тогда		
		
		Пока Абонент = ВыборкаАванс.Абонент цикл 			
			
			ОписаниеАванса = ОписаниеАванса();
			ЗаполнитьЗначенияСвойств(ОписаниеАванса, ВыборкаАванс);			
			Авансы.Добавить(ОписаниеАванса);
			
			СуммаАванса = СуммаАванса + ВыборкаАванс.СуммаАванса;
			Если ВыборкаАванс.ЖивыеДеньги тогда
				СуммаАвансаЖивымиДеньгами	= СуммаАвансаЖивымиДеньгами + ВыборкаАванс.СуммаАванса;
			КонецЕсли;
			
			Если не ВыборкаАванс.следующий() тогда
				Прервать;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 			
	
	Возврат Новый Структура("Авансы, СуммаАванса, СуммаАвансаЖивымиДеньгами", Авансы, СуммаАванса, СуммаАвансаЖивымиДеньгами);
	
КонецФункции


Функция ОписаниеАванса()
	Возврат Новый Структура("ДокументОплаты, Разделитель, ЖивыеДеньги, СуммаАванса");	
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетодыПоРаботеСДолгом

Функция ДанныеОплаты(Абонент, ВыборкаОплата)
	перем ТекРасшифровкаОплаты;
	
	Результат  								= Новый Соответствие;
	СоответствиеВидаДолга					= Новый Соответствие;
	
	РасшифровкаОплаты  						= Новый ТаблицаЗначений;
	РасшифровкаОплаты.Колонки.Добавить("ПериодВзаиморасчетов",	Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РасшифровкаОплаты.Колонки.Добавить("Услуга",				Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	РасшифровкаОплаты.Колонки.Добавить("Поставщик",				Новый ОписаниеТипов("СправочникСсылка.энргКонтрагенты"));
	РасшифровкаОплаты.Колонки.Добавить("Сумма",					Новый ОписаниеТипов("Число"));
	РасшифровкаОплаты.Колонки.Добавить("Разделитель",			Новый ОписаниеТипов("Число"));
	
	ТекДокументОплаты 						= Неопределено;
	ОписаниеОплаты  						= Новый ФиксированнаяСтруктура("Сумма,Расшифровка");
	Сумма 									= 0;
	//Если Абонент  = ВыборкаОплата.Абонент тогда	
	//	Пока Абонент = ВыборкаОплата.Абонент цикл			
	//		Если НЕ ТекДокументОплаты = ВыборкаОплата.ДокРегистратор Тогда
	//			Если НЕ ТекДокументОплаты = Неопределено Тогда
	//				текОписание 			= Новый Структура(ОписаниеОплаты);
	//				текОписание.Сумма 		= Сумма;
	//				текОписание.Расшифровка = ТекРасшифровкаОплаты;
	//				Результат.Вставить(ТекДокументОплаты, текОписание);
	//			КонецЕсли;				
	//			ТекРасшифровкаОплаты 		= РасшифровкаОплаты.Скопировать();
	//		КонецЕсли;
	//		
	//		ЗначениеРасшифровкаОплаты = СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности]; 
	//		Если ЗначениеРасшифровкаОплаты = Неопределено Тогда
	//			ТекРасшифровкаОплаты 		= РасшифровкаОплаты.Скопировать();
	//			СоответствиеВидаДолга.Вставить(ВыборкаОплата.ВидЗадолженности, ТекРасшифровкаОплаты);
	//		Иначе 
	//			ТекРасшифровкаОплаты = ЗначениеРасшифровкаОплаты;
	//		КонецЕсли;			
	//		
	//		СтрокаНачисления	  			= ТекРасшифровкаОплаты.Добавить();
	//		ЗаполнитьЗначенияСвойств(СтрокаНачисления,ВыборкаОплата);
	//		
	//		Сумма 							= Сумма + ВыборкаОплата.Сумма;
	//		ТекДокументОплаты 				= ВыборкаОплата.ДокРегистратор;
	//		
	//		Если не ВыборкаОплата.следующий() тогда
	//			Прервать;
	//		КонецЕсли;  				
	//	КонецЦикла;				  
	//КонецЕсли;
	//
	//Если НЕ ТекДокументОплаты = Неопределено Тогда
	//	текОписание 						= Новый Структура(ОписаниеОплаты);
	//	текОписание.Сумма 					= Сумма;
	//	текОписание.Расшифровка 			= ТекРасшифровкаОплаты;
	//	Результат.Вставить(ТекДокументОплаты, текОписание);
	//КонецЕсли;
	
	
	////
	Если Абонент  = ВыборкаОплата.Абонент тогда	
		Пока Абонент = ВыборкаОплата.Абонент цикл
			СменаДокумента = НЕ ТекДокументОплаты = ВыборкаОплата.ДокРегистратор;
			
			Если НЕ СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности] = Неопределено
				И НЕ СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности][ВыборкаОплата.ДокРегистратор] = Неопределено Тогда 
				текОписание 		= СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности][ВыборкаОплата.ДокРегистратор];
				
				текОписание.Сумма	= текОписание.Сумма + ВыборкаОплата.Сумма;				
				СтрокаНачисления	= текОписание.Расшифровка.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисления,ВыборкаОплата);
				
			ИначеЕсли НЕ СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности] = Неопределено
				И СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности][ВыборкаОплата.ДокРегистратор] = Неопределено Тогда
				
				ТекРасшифровкаОплаты 				= РасшифровкаОплаты.Скопировать();
				//ТекДокументОплатыДляЗаписи			= ?(ТекДокументОплаты = Неопределено, ВыборкаОплата.ДокРегистратор, ТекДокументОплаты);
				
				текОписание 						= Новый Структура(ОписаниеОплаты);
				текОписание.Сумма 					= ВыборкаОплата.Сумма;
				текОписание.Расшифровка 			= ТекРасшифровкаОплаты;
				СтрокаНачисления					= текОписание.Расшифровка.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисления,ВыборкаОплата);
				
				СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности].Вставить(ВыборкаОплата.ДокРегистратор, текОписание);
				
			ИначеЕсли СоответствиеВидаДолга[ВыборкаОплата.ВидЗадолженности] = Неопределено Тогда
				
				ТекРасшифровкаОплаты 				= РасшифровкаОплаты.Скопировать();
				//ТекДокументОплатыДляЗаписи			= ?(ТекДокументОплаты = Неопределено, ВыборкаОплата.ДокРегистратор, ТекДокументОплаты);
				
				текОписание 						= Новый Структура(ОписаниеОплаты);
				текОписание.Сумма 					= ВыборкаОплата.Сумма;
				текОписание.Расшифровка 			= ТекРасшифровкаОплаты;
				СтрокаНачисления					= текОписание.Расшифровка.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисления,ВыборкаОплата);
				
				Результат  							= Новый Соответствие;
				Результат.Вставить(ВыборкаОплата.ДокРегистратор, текОписание); 		
				
				СоответствиеВидаДолга.Вставить(ВыборкаОплата.ВидЗадолженности, Результат);				
			КонецЕсли;
			
			ТекДокументОплаты 				= ВыборкаОплата.ДокРегистратор;
			
			Если не ВыборкаОплата.следующий() тогда
				Прервать;
			КонецЕсли;  				
		КонецЦикла;				  
	КонецЕсли;
	
	Возврат СоответствиеВидаДолга;
КонецФункции

Функция ПараметрыВзаиморасчетов()	
	МассивКлючей  = Новый Массив;
	МассивКлючей.Добавить("СнятьТекущие");
	МассивКлючей.Добавить("ВозвратАванса");
	МассивКлючей.Добавить("ДанныеНачисления");
	МассивКлючей.Добавить("Кассир");
	МассивКлючей.Добавить("ИсточникПоступления");
	Возврат МассивКлючей;	
КонецФункции

#КонецОбласти 

Функция ЗаписатьНаборыДокументовНачисления(Организация, ПериодНачисления,Район,Строение,ПроведенСНарушением,ПроведенВПоследовательности,МассивДокументовНачисления,Абонент,Ошибки)
	
	// Записываем наборы документов начисления сбрасываем состояние и фиксируем транзакцию.
	Попытка
		для Каждого стр из МассивДокументовНачисления цикл
			СтруктураДанных	= стр.Значение;
			НаборыЗаписей  	= СтруктураДанных.НаборыЗаписей;
			НаборТаблиц 	= СтруктураДанных.НаборТаблиц;
			для Каждого Набор из НаборыЗаписей цикл	
				
				Если Набор.Значение = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				Набор.Значение.загрузить(НаборТаблиц[Набор.ключ]);
				Набор.Значение.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
				Набор.Значение.записать();
			КонецЦикла; 					   						
		КонецЦикла;
		
		Если Абонент = Неопределено Тогда
			// Выполняем только если абонент не указан.
			НаборОтложенные 	= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
			НаборОтложенные.Отбор.Организация.Установить(Организация);
			НаборОтложенные.Отбор.ПериодНачисления.Установить(ПериодНачисления);
			НаборОтложенные.Отбор.Район.Установить(Район);				
			НаборОтложенные.Отбор.РазделЗаписи.Установить(Перечисления.энргРазделыЗаписи.Взаиморасчеты);
			НаборОтложенные.Отбор.ЧастныйСектор.Установить(НЕ ЗначениеЗаполнено(Строение));
			НаборОтложенные.Отбор.Строение.Установить(Строение);
			НаборОтложенные.Записать();
		КонецЕсли;		
	Исключение
		ИнформацияОбОшибке		= ИнформацияОбОшибке();
		Ошибки					= Ошибки + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Возврат Ложь;  			
	КонецПопытки;
	
	// Если успешено записали пытаемся изменить состояние последовательности.
	Возврат ИзменитьСостояниеПоследовательности(Организация, ПериодНачисления,Район,ПроведенСНарушением,ПроведенВПоследовательности,Строение,Абонент,Ошибки);	
КонецФункции

Функция ИзменитьСостояниеПоследовательности(Организация, ПериодНачисления,Район,ПроведенСНарушением,ПроведенВПоследовательности,Строение,Абонент,Ошибки)
	//Возврат Истина;
	Попытка
		//ОтборБлокировки	= Новый Структура;
		//ОтборБлокировки.Вставить("Организация",			Организация);
		//ОтборБлокировки.Вставить("ПериодНачисления",	ПериодНачисления);
		//ОтборБлокировки.Вставить("Район",				Район);
		//ОтборБлокировки.Вставить("МКД",					Строение);
		//Если ЗначениеЗаполнено(Абонент) Тогда
		//	ОтборБлокировки.Вставить("Абонент",			Абонент);
		//КонецЕсли;
		
		Отказ	= Ложь;
		//УстановитьБлокировкуНабораЗаписейПоследовательностиПоРегистратору(ОтборБлокировки, "энргВзаиморасчетыПоследовательность",Отказ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоследовательность.Организация КАК Организация,
		|	энргВзаиморасчетыПоследовательность.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоследовательность.Район КАК Район,
		|	&ПроведенВПоследовательности КАК СостояниеПроведения,
		|	энргВзаиморасчетыПоследовательность.МКД КАК МКД,
		|	энргВзаиморасчетыПоследовательность.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
		|	энргВзаиморасчетыПоследовательность.ДокРегистратор КАК ДокРегистратор,
		|	энргВзаиморасчетыПоследовательность.Разделитель КАК Разделитель,
		|	энргВзаиморасчетыПоследовательность.ЭтоОплата КАК ЭтоОплата,
		|	энргВзаиморасчетыПоследовательность.Кассир КАК Кассир,
		|	энргВзаиморасчетыПоследовательность.ИсточникПоступления КАК ИсточникПоступления,
		|	энргВзаиморасчетыПоследовательность.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты
		|ИЗ
		|	РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
		|ГДЕ
		|	энргВзаиморасчетыПоследовательность.Организация = &Организация
		|	И энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргВзаиморасчетыПоследовательность.Район = &Район
		|	И энргВзаиморасчетыПоследовательность.СостояниеПроведения = &ПроведенСНарушением
		|	И энргВзаиморасчетыПоследовательность.МКД = &МКД
		|	И энргВзаиморасчетыПоследовательность.Абонент = &Абонент";
		
		Если Абонент = Неопределено тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргВзаиморасчетыПоследовательность.Абонент = &Абонент", "");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация",					Организация);
		Запрос.УстановитьПараметр("ПериодНачисления",				ПериодНачисления);
		Запрос.УстановитьПараметр("Район",							Район);
		Запрос.УстановитьПараметр("ПроведенСНарушением",			ПроведенСНарушением);
		Запрос.УстановитьПараметр("ПроведенВПоследовательности",	ПроведенВПоследовательности);
		Запрос.УстановитьПараметр("МКД",							Строение);
		Запрос.УстановитьПараметр("Абонент",						Абонент);
		
		НаборПоследовательности  					= РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
		//НаборПоследовательности.Отбор.слжРазделительДляТестов.установить(0);
		НаборПоследовательности.Отбор.Организация.установить(Организация);
		НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборПоследовательности.Отбор.Район.установить(Район);
		НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
		НаборПоследовательности.Отбор.МКД.установить(Строение);
		
		Если Абонент <> Неопределено тогда
			НаборПоследовательности.Отбор.Абонент.установить(Абонент);
		КонецЕсли;
		
		ТаблицаНабора	= Запрос.Выполнить().Выгрузить();
		
		НаборПоследовательности.Записать();
		
		НаборПоследовательности  					= РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
		НаборПоследовательности.Загрузить(ТаблицаНабора);
		НаборПоследовательности.Записать(Ложь);
		Возврат Истина;
	Исключение
		ИнформацияОбОшибке		= ИнформацияОбОшибке();
		Ошибки					= Ошибки + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции    	

Функция НаборыПоТипам()
	
	Соотвествие  			= Новый Соответствие;	
	МассивРегистров  		= Новый Массив;
	МассивРегистров.Добавить("энргАвансы");
	МассивРегистров.Добавить("энргАвансыИспользованные");
	МассивРегистров.Добавить("энргАвансыПоступившие");
	МассивРегистров.Добавить("энргВзаиморасчетыПоМесяцам");
	МассивРегистров.Добавить("энргВзаиморасчетыПоПени");
	МассивРегистров.Добавить("энргОплатаУслуг"); 	
	МассивРегистров.Добавить("энргОплатаПени");
	
	для Каждого Регистр из  МассивРегистров цикл
		Типы 					= Метаданные.РегистрыНакопления[Регистр].СтандартныеРеквизиты.Регистратор.Тип.типы();		
		Для Каждого ТипРегистратора из Типы цикл			
			Если Соотвествие.Получить(ТипРегистратора) = Неопределено тогда
				Массив 			= Новый Массив;
				Массив.Добавить(Регистр);
				Соотвествие.Вставить(ТипРегистратора,Массив);
			иначе
				Соотвествие[ТипРегистратора].добавить(Регистр);
			КонецЕсли;  			
		КонецЦикла;	
	КонецЦикла;
	
	Соотвествие[Тип("ДокументСсылка.энргРучноеИзменениеПени")].Добавить("энргНачислениеПени");
	
	Возврат Соотвествие;
	
КонецФункции


#Область ПолучениеДанныхДляВосстановенияВзаиморасчетов

// Результаты выполнения

Функция ЗаполнитьМВТВзаиморасчеты(Организация, ПериодНачисления, Район, МКД, Абонент, СписокМКД)
	МВТ 							= Новый МенеджерВременныхТаблиц;	
	Запрос  						= Новый Запрос;
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Район"			, Район);
	Запрос.УстановитьПараметр("МКД"				, МКД);
	Запрос.УстановитьПараметр("Абонент"			, Абонент);
	Запрос.УстановитьПараметр("СписокМКД"		, СписокМКД);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 							= ТекстМВТ_Взаиморасчеты();	
	Если МКД = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И энргВзаиморасчетыПоследовательность.МКД = &МКД","");
		Текст 						= СтрЗаменить(Текст,"И (энргВзаиморасчетыПоследовательность.МКД = &МКД)","");
	КонецЕсли;
	
	Если СписокМКД = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И энргВзаиморасчетыПоследовательность.МКД В(&СписокМКД)","");
		Текст 						= СтрЗаменить(Текст,"И (энргВзаиморасчетыПоследовательность.МКД В (&СписокМКД))","");
	КонецЕсли;
	
	Если Абонент = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И энргВзаиморасчетыПоследовательность.Абонент = &Абонент","");
		Текст 						= СтрЗаменить(Текст,"И (энргВзаиморасчетыПоследовательность.Абонент = &Абонент)","");
	КонецЕсли;
	
	Запрос.Текст 					= Текст;
	Запрос.Выполнить();
	Возврат МВТ;
КонецФункции

Функция РезультатДокументыДляПроведения(Организация, ПериодНачисления, Район, МКД, Абонент, МВТ, СписокМКД)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				МКД);
	Запрос.УстановитьПараметр("СписокМКД",			СписокМКД);
	Запрос.УстановитьПараметр("Абонент",			Абонент);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 							= ТекстДокументыДляПроведения();
	
	Если МКД = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И (энргВзаиморасчетыПоследовательность.МКД = &МКД)","");
	КонецЕсли;
	
	Если СписокМКД = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И (энргВзаиморасчетыПоследовательность.МКД В (&СписокМКД))","");
	КонецЕсли;
	
	Если Абонент = Неопределено тогда
		Текст 						= СтрЗаменить(Текст,"И (энргВзаиморасчетыПоследовательность.Абонент = &Абонент)","");
	КонецЕсли;
	
	Запрос.Текст 					= Текст;
	Возврат Запрос.Выполнить();	
КонецФункции

Функция РезультатОплата(МВТ, НачалоПериодаРасчета) 	
	Запрос  						= Новый Запрос(ТекстОплата());
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ПустойИдентификатор"	, ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Возврат Запрос.Выполнить(); 	
КонецФункции

// Тексты запросов
Функция ТекстМВТ_Взаиморасчеты()
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоследовательность.Организация КАК Организация,
	|	энргВзаиморасчетыПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоследовательность.Район КАК Район,
	|	энргВзаиморасчетыПоследовательность.МКД КАК МКД,
	|	энргВзаиморасчетыПоследовательность.Абонент КАК Абонент,
	|	МИНИМУМ(энргВзаиморасчетыПоследовательность.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МинимумДатаРегистратора
	|ИЗ
	|	РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
	|ГДЕ
	|	энргВзаиморасчетыПоследовательность.Организация = &Организация
	|	И энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления
	|	И энргВзаиморасчетыПоследовательность.Район = &Район
	|	И энргВзаиморасчетыПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И энргВзаиморасчетыПоследовательность.МКД = &МКД
	|	И энргВзаиморасчетыПоследовательность.МКД В(&СписокМКД)
	|	И энргВзаиморасчетыПоследовательность.Абонент = &Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыПоследовательность.Организация,
	|	энргВзаиморасчетыПоследовательность.ПериодНачисления,
	|	энргВзаиморасчетыПоследовательность.Район,
	|	энргВзаиморасчетыПоследовательность.МКД,
	|	энргВзаиморасчетыПоследовательность.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимумДатаРегистратора.Организация КАК Организация,
	|	МинимумДатаРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимумДатаРегистратора.Район КАК Район,
	|	МинимумДатаРегистратора.МКД КАК МКД,
	|	МинимумДатаРегистратора.Абонент КАК Абонент,
	|	МинимумДатаРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргПерерасчет
	|				ТОГДА ВЫБОР
	|						КОГДА ВЫРАЗИТЬ(энргВзаиморасчетыПоследовательность.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|							ТОГДА 2
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргНачислениеПени
	|				ТОГДА 10
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ДопПорядок
	|ПОМЕСТИТЬ МинимумДопПорядокРегистратора
	|ИЗ
	|	МинимумДатаРегистратора КАК МинимумДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
	|		ПО (энргВзаиморасчетыПоследовательность.Организация = &Организация)
	|			И (энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргВзаиморасчетыПоследовательность.Район = &Район)
	|			И (энргВзаиморасчетыПоследовательность.МКД = &МКД)
	|			И (энргВзаиморасчетыПоследовательность.МКД В (&СписокМКД))
	|			И (энргВзаиморасчетыПоследовательность.Абонент = &Абонент)
	|			И (энргВзаиморасчетыПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимумДатаРегистратора.Организация = энргВзаиморасчетыПоследовательность.Организация
	|			И МинимумДатаРегистратора.ПериодНачисления = энргВзаиморасчетыПоследовательность.ПериодНачисления
	|			И МинимумДатаРегистратора.Район = энргВзаиморасчетыПоследовательность.Район
	|			И МинимумДатаРегистратора.МКД = энргВзаиморасчетыПоследовательность.МКД
	|			И МинимумДатаРегистратора.Абонент = энргВзаиморасчетыПоследовательность.Абонент
	|			И МинимумДатаРегистратора.ДатаРегистратора = энргВзаиморасчетыПоследовательность.ДатаРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимумДатаРегистратора.Организация,
	|	МинимумДатаРегистратора.ПериодНачисления,
	|	МинимумДатаРегистратора.Район,
	|	МинимумДатаРегистратора.МКД,
	|	МинимумДатаРегистратора.Абонент,
	|	МинимумДатаРегистратора.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимумДопПорядокРегистратора.Организация КАК Организация,
	|	МинимумДопПорядокРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимумДопПорядокРегистратора.Район КАК Район,
	|	МинимумДопПорядокРегистратора.МКД КАК МКД,
	|	МинимумДопПорядокРегистратора.Абонент КАК Абонент,
	|	МинимумДопПорядокРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МинимумДопПорядокРегистратора.ДопПорядок КАК ДопПорядок,
	|	МИНИМУМ(энргВзаиморасчетыПоследовательность.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МинимумРегистратор
	|ИЗ
	|	МинимумДопПорядокРегистратора КАК МинимумДопПорядокРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
	|		ПО (энргВзаиморасчетыПоследовательность.Организация = &Организация)
	|			И (энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргВзаиморасчетыПоследовательность.Район = &Район)
	|			И (энргВзаиморасчетыПоследовательность.МКД = &МКД)
	|			И (энргВзаиморасчетыПоследовательность.МКД В (&СписокМКД))
	|			И (энргВзаиморасчетыПоследовательность.Абонент = &Абонент)
	|			И (энргВзаиморасчетыПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимумДопПорядокРегистратора.Организация = энргВзаиморасчетыПоследовательность.Организация
	|			И МинимумДопПорядокРегистратора.ПериодНачисления = энргВзаиморасчетыПоследовательность.ПериодНачисления
	|			И МинимумДопПорядокРегистратора.Район = энргВзаиморасчетыПоследовательность.Район
	|			И МинимумДопПорядокРегистратора.МКД = энргВзаиморасчетыПоследовательность.МКД
	|			И МинимумДопПорядокРегистратора.Абонент = энргВзаиморасчетыПоследовательность.Абонент
	|			И МинимумДопПорядокРегистратора.ДатаРегистратора = энргВзаиморасчетыПоследовательность.ДатаРегистратора
	|			И (ВЫБОР
	|				КОГДА МинимумДопПорядокРегистратора.ДопПорядок = 0
	|					ТОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргПерерасчет
	|							И НЕ ВЫРАЗИТЬ(энргВзаиморасчетыПоследовательность.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|				КОГДА МинимумДопПорядокРегистратора.ДопПорядок = 2
	|					ТОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргПерерасчет
	|							И ВЫРАЗИТЬ(энргВзаиморасчетыПоследовательность.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|				КОГДА МинимумДопПорядокРегистратора.ДопПорядок = 10
	|					ТОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргНачислениеПени
	|				КОГДА НЕ МинимумДопПорядокРегистратора.ДопПорядок = 10
	|						И энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргНачислениеПени
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимумДопПорядокРегистратора.Организация,
	|	МинимумДопПорядокРегистратора.ПериодНачисления,
	|	МинимумДопПорядокРегистратора.Район,
	|	МинимумДопПорядокРегистратора.МКД,
	|	МинимумДопПорядокРегистратора.Абонент,
	|	МинимумДопПорядокРегистратора.ДатаРегистратора,
	|	МинимумДопПорядокРегистратора.ДопПорядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МинимумРегистратор.Организация КАК Организация,
	|	МинимумРегистратор.ПериодНачисления КАК ПериодНачисления,
	|	МинимумРегистратор.Район КАК Район,
	|	МинимумРегистратор.МКД КАК МКД,
	|	МинимумРегистратор.Абонент КАК Абонент
	|ПОМЕСТИТЬ РазличныеАбоненты
	|ИЗ
	|	МинимумРегистратор КАК МинимумРегистратор";	
	Возврат Текст;
	
КонецФункции

Функция ТекстДокументыДляПроведения()
	Текст  =
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоследовательность.Организация КАК Организация,
	|	энргВзаиморасчетыПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоследовательность.Район КАК Район,
	|	энргВзаиморасчетыПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргВзаиморасчетыПоследовательность.МКД КАК МКД,
	|	энргВзаиморасчетыПоследовательность.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргВзаиморасчетыПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргВзаиморасчетыПоследовательность.ЭтоОплата КАК ЭтоОплата,
	|	энргВзаиморасчетыПоследовательность.Кассир КАК Кассир,
	|	энргВзаиморасчетыПоследовательность.ИсточникПоступления КАК ИсточникПоступления,
	|	энргВзаиморасчетыПоследовательность.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты,
	|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыПоследовательность.ДатаРегистратора, ДЕНЬ) КАК ДатаРегистратораНачалоДня,
	|	энргВзаиморасчетыПоследовательность.Разделитель КАК Разделитель,
	|	ВЫБОР
	|		КОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА ВЫРАЗИТЬ(энргВзаиморасчетыПоследовательность.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА ВЫРАЗИТЬ(энргВзаиморасчетыПоследовательность.ДокРегистратор КАК Документ.энргПлатежноеПоручениеВходящие).ДокументОснование
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокументОснование
	|ПОМЕСТИТЬ ДокументыДляПроведения
	|ИЗ
	|	МинимумРегистратор КАК МинимумРегистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
	|		ПО (энргВзаиморасчетыПоследовательность.Организация = &Организация)
	|			И (энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргВзаиморасчетыПоследовательность.Район = &Район)
	|			И (энргВзаиморасчетыПоследовательность.МКД = &МКД)
	|			И (энргВзаиморасчетыПоследовательность.МКД В (&СписокМКД))
	|			И (энргВзаиморасчетыПоследовательность.Абонент = &Абонент)
	|			И (ВЫБОР
	|				КОГДА МинимумРегистратор.ДопПорядок = 10
	|					ТОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргНачислениеПени
	|				КОГДА МинимумРегистратор.ДатаРегистратора <= энргВзаиморасчетыПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И МинимумРегистратор.Организация = энргВзаиморасчетыПоследовательность.Организация
	|			И МинимумРегистратор.ПериодНачисления = энргВзаиморасчетыПоследовательность.ПериодНачисления
	|			И МинимумРегистратор.Район = энргВзаиморасчетыПоследовательность.Район
	|			И МинимумРегистратор.МКД = энргВзаиморасчетыПоследовательность.МКД
	|			И МинимумРегистратор.Абонент = энргВзаиморасчетыПоследовательность.Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыПоследовательность.Организация,
	|	энргВзаиморасчетыПоследовательность.ПериодНачисления,
	|	энргВзаиморасчетыПоследовательность.Район,
	|	энргВзаиморасчетыПоследовательность.СостояниеПроведения,
	|	энргВзаиморасчетыПоследовательность.МКД,
	|	энргВзаиморасчетыПоследовательность.Абонент,
	|	энргВзаиморасчетыПоследовательность.ДатаРегистратора,
	|	энргВзаиморасчетыПоследовательность.ДокРегистратор,
	|	энргВзаиморасчетыПоследовательность.ЭтоОплата,
	|	энргВзаиморасчетыПоследовательность.Кассир,
	|	энргВзаиморасчетыПоследовательность.ИсточникПоступления,
	|	энргВзаиморасчетыПоследовательность.ЭтоКорректировкаОплаты,
	|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыПоследовательность.ДатаРегистратора, ДЕНЬ),
	|	энргВзаиморасчетыПоследовательность.Разделитель,
	|	ВЫБОР
	|		КОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА ВЫРАЗИТЬ(энргВзаиморасчетыПоследовательность.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА энргВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА ВЫРАЗИТЬ(энргВзаиморасчетыПоследовательность.ДокРегистратор КАК Документ.энргПлатежноеПоручениеВходящие).ДокументОснование
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	ДокументыДляПроведения.Абонент КАК Абонент,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ТаблицаКорректировкаОплаты.ДокументОплаты КАК ДокументОплаты,
	|	ТаблицаКорректировкаОплаты.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ КорректировкаОплаты
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК ТаблицаКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО ТаблицаКорректировкаОплаты.Ссылка = энргПерерасчет.Ссылка
	|				И (НЕ энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаКорректировкаОплаты.Ссылка
	|			И ДокументыДляПроведения.Абонент = ТаблицаКорректировкаОплаты.АбонентБыло
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация,
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.Район,
	|	ДокументыДляПроведения.МКД,
	|	ДокументыДляПроведения.Абонент,
	|	ДокументыДляПроведения.ДокРегистратор,
	|	ДокументыДляПроведения.ДатаРегистратора,
	|	ТаблицаКорректировкаОплаты.ДокументОплаты,
	|	ТаблицаКорректировкаОплаты.Разделитель
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК ТаблицаКорректировкаОплаты
	|			ПО энргПерерасчет.Ссылка = ТаблицаКорректировкаОплаты.Ссылка
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргПерерасчет.Ссылка
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|			И ДокументыДляПроведения.Абонент = энргПерерасчет.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.СостояниеПроведения КАК СостояниеПроведения,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	ДокументыДляПроведения.Абонент КАК Абонент,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ВЫБОР
	|		КОГДА ДокументыДляПроведения.ДокРегистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ДокументыДляПроведения.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|						ТОГДА 2
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОГДА ДокументыДляПроведения.ДокРегистратор ССЫЛКА Документ.энргНачислениеПени
	|			ТОГДА 10
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ДопПорядок,
	|	ДокументыДляПроведения.ЭтоОплата КАК ЭтоОплата,
	|	ДокументыДляПроведения.Кассир КАК Кассир,
	|	ДокументыДляПроведения.ИсточникПоступления КАК ИсточникПоступления,
	|	ДокументыДляПроведения.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты,
	|	ДокументыДляПроведения.Разделитель КАК Разделитель,
	|	ДокументыДляПроведения.ВидОперации КАК ВидОперации,
	|	ДокументыДляПроведения.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	Абонент,
	|	ДатаРегистратора,
	|	ДопПорядок,
	|	ДокРегистратор,
	|	Разделитель";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстОплата()
	Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	МАКСИМУМ(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	МАКСИМУМ(ВложенныйЗапрос.IDСтроки) КАК IDСтроки,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	|ПОМЕСТИТЬ ШапкаПерерасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргПерерасчетКорректировкаОплатыСтало.Абонент КАК Абонент,
	|		энргПерерасчет.Ссылка КАК Ссылка,
	|		энргПерерасчет.ПериодНачисления КАК ПериодВзаиморасчетов,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.МКД КАК МКД,
	|		энргПерерасчетКорректировкаОплатыСтало.Сумма КАК Сумма,
	|		энргПерерасчетКорректировкаОплатыСтало.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплатыСтало КАК энргПерерасчетКорректировкаОплатыСтало
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|				ПО энргПерерасчетКорректировкаОплатыСтало.Ссылка = энргПерерасчет.Ссылка
	|					И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|			ПО ДокументыДляПроведения.ДокРегистратор = энргПерерасчетКорректировкаОплатыСтало.Ссылка
	|				И ДокументыДляПроведения.Абонент = энргПерерасчетКорректировкаОплатыСтало.Абонент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПерерасчет.Абонент,
	|		энргПерерасчет.Ссылка,
	|		энргПерерасчет.ПериодНачисления,
	|		ДокументыДляПроведения.ПериодНачисления,
	|		ДокументыДляПроведения.Район,
	|		ДокументыДляПроведения.МКД,
	|		0,
	|		&ПустойИдентификатор
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО ДокументыДляПроведения.ДокРегистратор = энргПерерасчет.Ссылка
	|				И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|				И ДокументыДляПроведения.Абонент = энргПерерасчет.Абонент) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.Ссылка,
	|	ВложенныйЗапрос.ПериодВзаиморасчетов,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШапкаПерерасчета.Абонент КАК Абонент,
	|	ШапкаПерерасчета.Ссылка КАК Ссылка,
	|	энргПерерасчетЗадолженностьСтала.Услуга КАК Услуга,
	|	СУММА(энргПерерасчетЗадолженностьСтала.СуммаОплаты) КАК СуммаОплаты,
	|	энргПерерасчетЗадолженностьСтала.Поставщик КАК Поставщик,
	|	энргПерерасчетЗадолженностьСтала.ПериодНачисления КАК ПериодВзаиморасчетов,
	|	ШапкаПерерасчета.Район КАК Район,
	|	ШапкаПерерасчета.МКД КАК МКД,
	|	ШапкаПерерасчета.ПериодНачисления КАК ПериодНачисления,
	|	энргПерерасчетЗадолженностьСтала.ВидЗадолженности КАК ВидЗадолженности
	|ПОМЕСТИТЬ РаспределеноПоУслугамВПерерасчете
	|ИЗ
	|	ШапкаПерерасчета КАК ШапкаПерерасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.ЗадолженностьСтала КАК энргПерерасчетЗадолженностьСтала
	|		ПО ШапкаПерерасчета.Ссылка = энргПерерасчетЗадолженностьСтала.Ссылка
	|			И ШапкаПерерасчета.IDСтроки = энргПерерасчетЗадолженностьСтала.IDСтрокиКорректировкаСтала
	|			И (энргПерерасчетЗадолженностьСтала.СуммаОплаты > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШапкаПерерасчета.Абонент,
	|	энргПерерасчетЗадолженностьСтала.Поставщик,
	|	энргПерерасчетЗадолженностьСтала.ПериодНачисления,
	|	энргПерерасчетЗадолженностьСтала.Услуга,
	|	ШапкаПерерасчета.Ссылка,
	|	ШапкаПерерасчета.Район,
	|	ШапкаПерерасчета.МКД,
	|	ШапкаПерерасчета.ПериодНачисления,
	|	энргПерерасчетЗадолженностьСтала.ВидЗадолженности
	|;
	|
	| " + Документы.энргПлатежноеПоручениеВходящие.ТекстЗапросаОплаты(Истина) + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	СУММА(энргПриходныйКассовыйОрдер.СуммаОплаты) КАК СуммаОплаты,
	|	ДокументыДляПроведения.Абонент КАК Абонент,
	|	&ПустойИдентификатор КАК IDСтроки,
	|	энргПриходныйКассовыйОрдер.ПериодНачисления КАК ПериодОплаты,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.МКД КАК МКД,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	0 КАК Разделитель
	|ПОМЕСТИТЬ ОбщаяСуммаПоДокументу
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПриходныйКассовыйОрдер КАК энргПриходныйКассовыйОрдер
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргПриходныйКассовыйОрдер.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыДляПроведения.ДокРегистратор,
	|	ДокументыДляПроведения.Абонент,
	|	ДокументыДляПроведения.МКД,
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.Район,
	|	энргПриходныйКассовыйОрдер.ПериодНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВсяОплатаПП.ДокРегистратор,
	|	ВТ_ВсяОплатаПП.СуммаКРаспределению,
	|	ВТ_ВсяОплатаПП.Абонент,
	|	ВТ_ВсяОплатаПП.IDСтроки,
	|	ВТ_ВсяОплатаПП.ПериодОплаты,
	|	ВТ_ВсяОплатаПП.Район,
	|	ВТ_ВсяОплатаПП.МКД,
	|	ВТ_ВсяОплатаПП.ПериодНачисления,
	|	ВТ_ВсяОплатаПП.Разделитель
	|ИЗ
	|	ВТ_ВсяОплатаПП КАК ВТ_ВсяОплатаПП
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщаяСуммаПоДокументу.ДокРегистратор КАК ДокРегистратор,
	|	ОбщаяСуммаПоДокументу.Абонент КАК Абонент,
	|	энргПриходныйКассовыйОрдерУслуги.Услуга КАК Услуга,
	|	энргПриходныйКассовыйОрдерУслуги.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(энргПриходныйКассовыйОрдерУслуги.Оплачено) КАК Оплачено,
	|	энргПриходныйКассовыйОрдерУслуги.ВидЗадолженности КАК ВидЗадолженности,
	|	энргПриходныйКассовыйОрдерУслуги.Поставщик КАК Поставщик,
	|	ОбщаяСуммаПоДокументу.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ ДанныеПоВидуЗадолженности
	|ИЗ
	|	ОбщаяСуммаПоДокументу КАК ОбщаяСуммаПоДокументу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПриходныйКассовыйОрдер.Услуги КАК энргПриходныйКассовыйОрдерУслуги
	|		ПО ОбщаяСуммаПоДокументу.ДокРегистратор = энргПриходныйКассовыйОрдерУслуги.Ссылка
	|			И (энргПриходныйКассовыйОрдерУслуги.Оплачено > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяСуммаПоДокументу.Абонент,
	|	энргПриходныйКассовыйОрдерУслуги.Услуга,
	|	энргПриходныйКассовыйОрдерУслуги.Поставщик,
	|	энргПриходныйКассовыйОрдерУслуги.ПериодНачисления,
	|	энргПриходныйКассовыйОрдерУслуги.ВидЗадолженности,
	|	ОбщаяСуммаПоДокументу.ДокРегистратор,
	|	ОбщаяСуммаПоДокументу.Разделитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщаяСуммаПоДокументу.ДокРегистратор,
	|	ОбщаяСуммаПоДокументу.Абонент,
	|	энргПлатежноеПоручениеВходящиеЗадолженность.Услуга,
	|	энргПлатежноеПоручениеВходящиеЗадолженность.ПериодНачисления,
	|	СУММА(энргПлатежноеПоручениеВходящиеЗадолженность.СуммаОплаты),
	|	энргПлатежноеПоручениеВходящиеЗадолженность.ВидЗадолженности,
	|	энргПлатежноеПоручениеВходящиеЗадолженность.Поставщик,
	|	ОбщаяСуммаПоДокументу.Разделитель КАК Разделитель
	|ИЗ
	|	ОбщаяСуммаПоДокументу КАК ОбщаяСуммаПоДокументу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.Задолженность КАК энргПлатежноеПоручениеВходящиеЗадолженность
	|		ПО ОбщаяСуммаПоДокументу.ДокРегистратор = энргПлатежноеПоручениеВходящиеЗадолженность.Ссылка
	|			И ОбщаяСуммаПоДокументу.IDСтроки = энргПлатежноеПоручениеВходящиеЗадолженность.IDСтроки
	|			И (энргПлатежноеПоручениеВходящиеЗадолженность.СуммаОплаты > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяСуммаПоДокументу.Абонент,
	|	энргПлатежноеПоручениеВходящиеЗадолженность.Услуга,
	|	энргПлатежноеПоручениеВходящиеЗадолженность.Поставщик,
	|	энргПлатежноеПоручениеВходящиеЗадолженность.ПериодНачисления,
	|	энргПлатежноеПоручениеВходящиеЗадолженность.ВидЗадолженности,
	|	ОбщаяСуммаПоДокументу.ДокРегистратор,
	|	ОбщаяСуммаПоДокументу.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщаяСуммаПоДокументу.ПериодНачисления КАК ПериодНачисления,
	|	ОбщаяСуммаПоДокументу.Район КАК Район,
	|	ОбщаяСуммаПоДокументу.МКД КАК МКД,
	|	ОбщаяСуммаПоДокументу.Абонент КАК Абонент,
	|	ОбщаяСуммаПоДокументу.ДокРегистратор КАК ДокРегистратор,
	|	ОбщаяСуммаПоДокументу.ПериодОплаты КАК ПериодВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка) КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка) КАК Поставщик,
	|	ОбщаяСуммаПоДокументу.СуммаОплаты - ЕСТЬNULL(ДанныеПоМесяцам.ОплатаПени, 0) - ЕСТЬNULL(ДанныеПоМесяцам.ОплатаДолга, 0) КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг) КАК ВидЗадолженности,
	|	ОбщаяСуммаПоДокументу.Разделитель КАК Разделитель
	|ИЗ
	|	ОбщаяСуммаПоДокументу КАК ОбщаяСуммаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДанныеПоВидуЗадолженности.ДокРегистратор КАК ДокРегистратор, 
	|			ДанныеПоВидуЗадолженности.Разделитель КАК Разделитель,
	|			ДанныеПоВидуЗадолженности.Абонент КАК Абонент,
	|			СУММА(ВЫБОР
	|					КОГДА ДанныеПоВидуЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
	|						ТОГДА ДанныеПоВидуЗадолженности.Оплачено
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ОплатаПени,
	|			СУММА(ВЫБОР
	|					КОГДА НЕ ДанныеПоВидуЗадолженности.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
	|						ТОГДА ДанныеПоВидуЗадолженности.Оплачено
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ОплатаДолга
	|		ИЗ
	|			ДанныеПоВидуЗадолженности КАК ДанныеПоВидуЗадолженности
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДанныеПоВидуЗадолженности.ДокРегистратор,
	|			ДанныеПоВидуЗадолженности.Разделитель,
	|			ДанныеПоВидуЗадолженности.Абонент) КАК ДанныеПоМесяцам
	|		ПО ОбщаяСуммаПоДокументу.ДокРегистратор = ДанныеПоМесяцам.ДокРегистратор
	|			И ОбщаяСуммаПоДокументу.Разделитель = ДанныеПоМесяцам.Разделитель
	|			И ОбщаяСуммаПоДокументу.Абонент = ДанныеПоМесяцам.Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщаяСуммаПоДокументу.ПериодНачисления,
	|	ОбщаяСуммаПоДокументу.Район,
	|	ОбщаяСуммаПоДокументу.МКД,
	|	ОбщаяСуммаПоДокументу.Абонент,
	|	ОбщаяСуммаПоДокументу.ДокРегистратор,
	|	ДанныеПоВидуЗадолженности.ПериодНачисления,
	|	ДанныеПоВидуЗадолженности.Услуга,
	|	ДанныеПоВидуЗадолженности.Поставщик,
	|	ДанныеПоВидуЗадолженности.Оплачено,
	|	ДанныеПоВидуЗадолженности.ВидЗадолженности,
	|	ОбщаяСуммаПоДокументу.Разделитель
	|ИЗ
	|	ОбщаяСуммаПоДокументу КАК ОбщаяСуммаПоДокументу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоВидуЗадолженности КАК ДанныеПоВидуЗадолженности
	|		ПО ОбщаяСуммаПоДокументу.ДокРегистратор = ДанныеПоВидуЗадолженности.ДокРегистратор
	|			И ОбщаяСуммаПоДокументу.Разделитель = ДанныеПоВидуЗадолженности.Разделитель 
	|			И ОбщаяСуммаПоДокументу.Абонент = ДанныеПоВидуЗадолженности.Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.Район,
	|	ДокументыДляПроведения.МКД,
	|	ДокументыДляПроведения.Абонент,
	|	ДокументыДляПроведения.ДокРегистратор,
	|	ТаблицаКорректировкаОплаты.ПериодНачисленияСтало,
	|	ТаблицаКорректировкаОплаты.УслугаСтало,
	|	ТаблицаКорректировкаОплаты.ПоставщикСтало,
	|	ВЫБОР
	|		КОГДА ТаблицаКорректировкаОплаты.АбонентБыло = ТаблицаКорректировкаОплаты.АбонентСтало
	|			ТОГДА ТаблицаКорректировкаОплаты.СуммаСтало
	|		КОГДА ТаблицаКорректировкаОплаты.АбонентБыло = ДокументыДляПроведения.Абонент
	|			ТОГДА ТаблицаКорректировкаОплаты.СуммаБыло - ТаблицаКорректировкаОплаты.СуммаСтало
	|		ИНАЧЕ ТаблицаКорректировкаОплаты.СуммаСтало
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг),
	|	0
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК ТаблицаКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО ТаблицаКорректировкаОплаты.Ссылка = энргПерерасчет.Ссылка
	|				И (НЕ энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаКорректировкаОплаты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШапкаПерерасчета.ПериодНачисления,
	|	ШапкаПерерасчета.Район,
	|	ШапкаПерерасчета.МКД,
	|	ШапкаПерерасчета.Абонент,
	|	ШапкаПерерасчета.Ссылка,
	|	ШапкаПерерасчета.ПериодВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка),
	|	ШапкаПерерасчета.Сумма - ЕСТЬNULL(РаспределеноПоУслугамВПерерасчетеГруппировка.ОплатаПени, 0) - ЕСТЬNULL(РаспределеноПоУслугамВПерерасчетеГруппировка.ОплатаДолга, 0),
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг),
	|	0
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаПерерасчета КАК ШапкаПерерасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				РаспределеноПоУслугамВПерерасчете.Абонент КАК Абонент,
	|				РаспределеноПоУслугамВПерерасчете.Ссылка КАК Ссылка,
	|				СУММА(ВЫБОР
	|						КОГДА РаспределеноПоУслугамВПерерасчете.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
	|							ТОГДА РаспределеноПоУслугамВПерерасчете.СуммаОплаты
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК ОплатаПени,
	|				СУММА(ВЫБОР
	|						КОГДА НЕ РаспределеноПоУслугамВПерерасчете.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
	|							ТОГДА РаспределеноПоУслугамВПерерасчете.СуммаОплаты
	|						ИНАЧЕ 0
	|					КОНЕЦ) КАК ОплатаДолга
	|			ИЗ
	|				РаспределеноПоУслугамВПерерасчете КАК РаспределеноПоУслугамВПерерасчете
	|			
	|			СГРУППИРОВАТЬ ПО
	|				РаспределеноПоУслугамВПерерасчете.Абонент,
	|				РаспределеноПоУслугамВПерерасчете.Ссылка) КАК РаспределеноПоУслугамВПерерасчетеГруппировка
	|			ПО ШапкаПерерасчета.Ссылка = РаспределеноПоУслугамВПерерасчетеГруппировка.Ссылка
	|				И ШапкаПерерасчета.Абонент = РаспределеноПоУслугамВПерерасчетеГруппировка.Абонент
	|		ПО ДокументыДляПроведения.ДокРегистратор = ШапкаПерерасчета.Ссылка
	|			И ДокументыДляПроведения.Абонент = ШапкаПерерасчета.Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределеноПоУслугамВПерерасчете.ПериодНачисления,
	|	РаспределеноПоУслугамВПерерасчете.Район,
	|	РаспределеноПоУслугамВПерерасчете.МКД,
	|	РаспределеноПоУслугамВПерерасчете.Абонент,
	|	РаспределеноПоУслугамВПерерасчете.Ссылка,
	|	РаспределеноПоУслугамВПерерасчете.ПериодВзаиморасчетов,
	|	РаспределеноПоУслугамВПерерасчете.Услуга,
	|	РаспределеноПоУслугамВПерерасчете.Поставщик,
	|	РаспределеноПоУслугамВПерерасчете.СуммаОплаты,
	|	РаспределеноПоУслугамВПерерасчете.ВидЗадолженности,
	|	0
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределеноПоУслугамВПерерасчете КАК РаспределеноПоУслугамВПерерасчете
	|		ПО ДокументыДляПроведения.ДокРегистратор = РаспределеноПоУслугамВПерерасчете.Ссылка
	|			И ДокументыДляПроведения.Абонент = РаспределеноПоУслугамВПерерасчете.Абонент
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ДокументыДляПроведения.ПериодНачисления,
	//|	ДокументыДляПроведения.Район,
	//|	ДокументыДляПроведения.МКД,
	//|	ДокументыДляПроведения.Абонент,
	//|	ДокументыДляПроведения.ДокРегистратор,
	//|	ДокументыДляПроведения.ПериодНачисления,
	//|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка),
	//|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка),
	//|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.СуммаПереноса,
	//|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг),
	//|	0
	//|ИЗ
	//|	ДокументыДляПроведения КАК ДокументыДляПроведения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.ПереносСуммыОплаты КАК энргПлатежноеПоручениеВходящиеПереносСуммыОплаты
	//|		ПО ДокументыДляПроведения.ДокРегистратор = энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.Ссылка
	//|			И ДокументыДляПроведения.Абонент = энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	Абонент,
	|	ДокРегистратор,
	|	ВидЗадолженности,
	|	Разделитель,
	|	Услуга Убыв";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОтложенныеДвиженияДокументовНачисления

Процедура ОчиститьНаборыЗаписей(Организация, ПериодНачисления,Район,ЧастныйСектор,Строение,ДокРегистратор,ВводНачальныхОстатков)
	
	НаборСтабильныеПериоды					= РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборСтабильныеПериоды.Отбор.Организация.установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.установить(Район);
	НаборСтабильныеПериоды.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборСтабильныеПериоды.Отбор.Строение.установить(Строение);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	
	НаборСтабильныеПериоды					= РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборСтабильныеПериоды.Отбор.Организация.установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.установить(Район);
	НаборСтабильныеПериоды.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборСтабильныеПериоды.Отбор.Строение.установить(Строение);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	
	НаборСтабильныеПериоды					= РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборСтабильныеПериоды.Отбор.Организация.установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.установить(Район);
	НаборСтабильныеПериоды.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборСтабильныеПериоды.Отбор.Строение.установить(Строение);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	
	НаборНомерСтрокСтабПериода 				= РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
	НаборНомерСтрокСтабПериода.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборНомерСтрокСтабПериода.Отбор.Организация.установить(Организация);
	НаборНомерСтрокСтабПериода.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборНомерСтрокСтабПериода.Отбор.Район.установить(Район);
	НаборНомерСтрокСтабПериода.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборНомерСтрокСтабПериода.Отбор.Строение.установить(Строение);
	КонецЕсли;
	НаборНомерСтрокСтабПериода.Записать();
	
	НаборМаксимальныеПоказания 				= РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
	НаборМаксимальныеПоказания.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборМаксимальныеПоказания.Отбор.Организация.установить(Организация);
	НаборМаксимальныеПоказания.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборМаксимальныеПоказания.Отбор.Район.установить(Район);
	НаборМаксимальныеПоказания.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборМаксимальныеПоказания.Отбор.Строение.установить(Строение);
	КонецЕсли;
	НаборМаксимальныеПоказания.Записать();
	
	Если ВводНачальныхОстатков тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета
		|ИЗ
		|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
		|ГДЕ
		|	энргМаксимальныеПоказанияСрез.Организация = &Организация
		|	И энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПериодНачисления
		|	И энргМаксимальныеПоказанияСрез.Район = &Район
		|	И энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор
		|	И энргМаксимальныеПоказанияСрез.Строение = &Строение
		|	И энргМаксимальныеПоказанияСрез.ДокРегистратор = &ДокРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	энргМаксимальныеПоказанияСрез.ПриборУчета";
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ПериодНачисления",	НачалоМесяца(ПериодНачисления-1));
		Запрос.УстановитьПараметр("Район",				Район);
		Запрос.УстановитьПараметр("ЧастныйСектор",		ЧастныйСектор);
		Запрос.УстановитьПараметр("ДокРегистратор",		ДокРегистратор);
		Если НЕ ЧастныйСектор Тогда 
			Запрос.УстановитьПараметр("Строение",		Строение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргМаксимальныеПоказанияСрез.Строение = &Строение", "ИСТИНА");
		КонецЕсли;
		ВыборкаМаксПок = Запрос.Выполнить().Выбрать();
		Пока ВыборкаМаксПок.Следующий() Цикл 
			
			НаборМаксимальныеПоказания = РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
			НаборМаксимальныеПоказания.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборМаксимальныеПоказания.Отбор.Организация.установить(Организация);
			НаборМаксимальныеПоказания.Отбор.ПериодНачисления.установить(НачалоМесяца(ПериодНачисления-1));
			НаборМаксимальныеПоказания.Отбор.Район.установить(Район);
			НаборМаксимальныеПоказания.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
			Если НЕ ЧастныйСектор Тогда 
				НаборМаксимальныеПоказания.Отбор.Строение.установить(Строение);
			КонецЕсли;
			НаборМаксимальныеПоказания.Отбор.ПриборУчета.установить(ВыборкаМаксПок.ПриборУчета);
			НаборМаксимальныеПоказания.Записать();
		КонецЦикла;
	КонецЕсли; 
	
	НаборОтложенныхДвижений = РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НаборОтложенныхДвижений.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборОтложенныхДвижений.Отбор.ДокРегистратор.установить(ДокРегистратор);
	НаборОтложенныхДвижений.Записать();
КонецПроцедуры

Функция РезультатНачальныеОстаткиСтабильногоПериода(МВТ,Организация, ПериодНачисления,Район,Строение,ПериодРегистрации, Помещение  = Неопределено)
	
	Разделить = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Текст 	=
	"ВЫБРАТЬ
	|	ОтложенныеДвиженияДокументов.Организация КАК Организация,
	|	ОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	|	ОтложенныеДвиженияДокументов.Район КАК Район,
	|	ОтложенныеДвиженияДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	ОтложенныеДвиженияДокументов.Строение КАК Строение,
	|	ОтложенныеДвиженияДокументов.ДокРегистратор КАК ДокРегистратор,
	|	ОтложенныеДвиженияДокументов.ДатаРегистратора КАК ДатаРегистратора
	|ПОМЕСТИТЬ ДокументыДляПроведения
	|ИЗ
	|	РегистрСведений.энргОтложенныеДвиженияДокументов КАК ОтложенныеДвиженияДокументов
	|ГДЕ
	|	ОтложенныеДвиженияДокументов.Организация = &Организация
	|	И ОтложенныеДвиженияДокументов.ПериодНачисления = &Периодначисления
	|	И ОтложенныеДвиженияДокументов.Район = &Район
	|	И ОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.СтабильныеПериоды)
	|	И ОтложенныеДвиженияДокументов.ЧастныйСектор = &ЧастныйСектор
	|	И ОтложенныеДвиженияДокументов.Строение = &Строение";
	
	Текст 	= Текст + Разделить;
	
	Текст 	= Текст + СтабильныеПериодыВводНачальныхОстатков(Строение, Неопределено);
	
	Текст 	= Текст + Разделить;	
	
	Текст 	= Текст + СтабильныеПериодыДокументыНачисления(ПериодНачисления,Строение, Неопределено);
	
	Если Строение = Неопределено тогда
		Текст						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.ЧастныйСектор = &ЧастныйСектор","");
		Текст						= СтрЗаменить(Текст,"И СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор)","");
		Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение = &Строение)","");
		Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение)","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Строение = &Строение)","");
		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Помещение = &Помещение)",""); 		
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
		Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Помещение = &Помещение)","");
	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение)","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Строение = &Строение)","");
		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Помещение = &Помещение)",""); 		
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Помещение = &Помещение)","");
	ИначеЕсли Помещение = Неопределено Тогда 				
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Помещение = &Помещение)",""); 		
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");
	КонецЕсли;
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодРегистрации",		ПериодРегистрации);
	Запрос.УстановитьПараметр("ПредыдущийПериод",		НачалоМесяца(ПериодНачисления-1));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Периодначисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Период",					КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("МоментВремени",			ПериодНачисления);
	
	Если НЕ Строение = Неопределено Тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",		НЕ ЗначениеЗаполнено(Строение));
		Если ЗначениеЗаполнено(Строение) Тогда
			Запрос.УстановитьПараметр("Строение",		Строение);
		КонецЕсли;
		Если Не Помещение = Неопределено Тогда
			Запрос.УстановитьПараметр("Помещение",		Помещение);
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипНачисления",			Перечисления.энргТипыНачислений.ИндивидуальныеНачисления);
	Запрос.Выполнить();
	
	Текст 							=  
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыДокументыНачислений","НомерПозиции,СоставЖильцов",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	ЛОЖЬ КАК ЭтоВводНачальныхОстатков,
	|	НЕОПРЕДЕЛЕНО КАК КлючПомещения,
	|	НЕОПРЕДЕЛЕНО КАК ПомещениеРодитель
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыВводНачальныхОстатков","НомерПозиции,СоставЖильцов",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	ИСТИНА КАК ЭтоВводНачальныхОстатков,
	|	СтабильныеПериодыВводНачальныхОстатков.КлючПомещения КАК КлючПомещения,
	|	СтабильныеПериодыВводНачальныхОстатков.ПомещениеРодитель КАК ПомещениеРодитель
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|
	|УПОРЯДОЧИТЬ ПО	
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	ДокРегистратор,
	|	Абонент УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДокументыНачислений.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыДокументыНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР КОГДА СтабильныеПериодыДокументыНачислений.ЧастныйСектор ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ СтабильныеПериодыДокументыНачислений.Строение КОНЕЦ КАК Строение,
	|	ЛОЖЬ КАК ЭтоВводНачальныхОстатков
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР КОГДА СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ СтабильныеПериодыВводНачальныхОстатков.Строение КОНЕЦ КАК Строение,
	|	ИСТИНА КАК ЭтоВводНачальныхОстатков
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|
	|УПОРЯДОЧИТЬ ПО	
	|	ЧастныйСектор,
	|	Строение,
	|	ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДокументыНачислений.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыДокументыНачислений.Район КАК Район,
	|	СтабильныеПериодыДокументыНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыДокументыНачислений.Строение КАК Строение,
	|	СтабильныеПериодыДокументыНачислений.Помещение КАК Помещение,
	|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрез.Показания КАК Показания,
	|	энргМаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	энргМаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора,
	|	ЛОЖЬ КАК ЭтоВводНачальныхОстатков
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|		ПО СтабильныеПериодыДокументыНачислений.Организация = энргМаксимальныеПоказанияСрез.Организация
	|			И (СтабильныеПериодыДокументыНачислений.ПериодНачисления = ДОБАВИТЬКДАТЕ(энргМаксимальныеПоказанияСрез.ПериодНачисления, МЕСЯЦ, 1))
	|			И СтабильныеПериодыДокументыНачислений.Район = энргМаксимальныеПоказанияСрез.Район
	|			И СтабильныеПериодыДокументыНачислений.ЧастныйСектор = энргМаксимальныеПоказанияСрез.ЧастныйСектор
	|			И СтабильныеПериодыДокументыНачислений.Строение = энргМаксимальныеПоказанияСрез.Строение
	|			И СтабильныеПериодыДокументыНачислений.Помещение = энргМаксимальныеПоказанияСрез.Помещение
	|			И СтабильныеПериодыДокументыНачислений.ПриборУчета = энргМаксимальныеПоказанияСрез.ПриборУчета
	|			И (СтабильныеПериодыДокументыНачислений.ПриборВведен)
	|			И (энргМаксимальныеПоказанияСрез.Организация = &Организация)
	|			И (энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПредыдущийПериод)
	|			И (энргМаксимальныеПоказанияСрез.Район = &Район)
	|			И (энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргМаксимальныеПоказанияСрез.Строение = &Строение)
	|			И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	энргВводНачальныхОстатковПоказанияПриборовУчета.ТарифнаяЗона,
	|	энргВводНачальныхОстатковПоказанияПриборовУчета.ТекущиеПоказания,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ИСТИНА
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыВводНачальныхОстатков.Организация КАК Организация,
	|		СтабильныеПериодыВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыВводНачальныхОстатков.Район КАК Район,
	|		СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыВводНачальныхОстатков.Строение КАК Строение,
	|		СтабильныеПериодыВводНачальныхОстатков.Помещение КАК Помещение,
	|		СтабильныеПериодыВводНачальныхОстатков.ПриборУчета КАК ПриборУчета,
	|		энргВводНачальныхОстатковШкалыПриборовУчета.Шкала КАК Шкала,
	|		СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|		СтабильныеПериодыВводНачальныхОстатков.ДатаРегистратора КАК ДатаРегистратора,
	|		энргВводНачальныхОстатковШкалыПриборовУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ШкалыПриборовУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
	|			ПО СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор = энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка
	|				И СтабильныеПериодыВводНачальныхОстатков.IDСтрокиТочкиУчета = энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета
	|				И (СтабильныеПериодыВводНачальныхОстатков.ПриборВведен)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоказанияПриборовУчета КАК энргВводНачальныхОстатковПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргВводНачальныхОстатковПоказанияПриборовУчета.IDСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДокументыНачислений.Организация КАК Организация,
	|	СтабильныеПериодыДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыДокументыНачислений.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериодыДокументыНачислений.ДокРегистратор КАК ДокРегистратор,
	|	0 КАК НомерПозиции,
	|	ПараметрыШкалСтаблиногоПериода.Район КАК Район,
	|	ПараметрыШкалСтаблиногоПериода.ЧастныйСектор КАК ЧастныйСектор,
	|	ПараметрыШкалСтаблиногоПериода.Строение КАК Строение,
	|	ПараметрыШкалСтаблиногоПериода.Помещение КАК Помещение,
	|	ПараметрыШкалСтаблиногоПериода.ТочкаУчета КАК ТочкаУчета,
	|	ПараметрыШкалСтаблиногоПериода.Шкала КАК Шкала,
	|	ПараметрыШкалСтаблиногоПериода.ВидДифференцированности КАК ВидДифференцированности
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыШкалСтаблиногоПериода КАК ПараметрыШкалСтаблиногоПериода
	|		ПО СтабильныеПериодыДокументыНачислений.Организация = ПараметрыШкалСтаблиногоПериода.Организация
	|			И СтабильныеПериодыДокументыНачислений.ПериодНачисления = ПараметрыШкалСтаблиногоПериода.ПериодНачисления
	|			И СтабильныеПериодыДокументыНачислений.Район = ПараметрыШкалСтаблиногоПериода.Район
	|			И СтабильныеПериодыДокументыНачислений.ЧастныйСектор = ПараметрыШкалСтаблиногоПериода.ЧастныйСектор
	|			И СтабильныеПериодыДокументыНачислений.Строение = ПараметрыШкалСтаблиногоПериода.Строение
	|			И СтабильныеПериодыДокументыНачислений.Помещение = ПараметрыШкалСтаблиногоПериода.Помещение
	|			И СтабильныеПериодыДокументыНачислений.ТочкаУчета = ПараметрыШкалСтаблиногоПериода.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыВводНачальныхОстатков.Организация,
	|	СтабильныеПериодыВводНачальныхОстатков.ПериодНачисления,
	|	СтабильныеПериодыВводНачальныхОстатков.ДатаРегистратора,
	|	СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор,
	|	0,
	|	СтабильныеПериодыВводНачальныхОстатков.Район,
	|	СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор,
	|	СтабильныеПериодыВводНачальныхОстатков.Строение,
	|	СтабильныеПериодыВводНачальныхОстатков.Помещение,
	|	СтабильныеПериодыВводНачальныхОстатков.ТочкаУчета,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.Шкала,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.ВидДифференцированности
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ШкалыПриборовУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
	|		ПО СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор = энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка
	|			И СтабильныеПериодыВводНачальныхОстатков.IDСтрокиТочкиУчета = энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыИзмерителиНаправлений","ПараметрыИзмерителиСтаблиногоПериода","НомерПозиции,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	СтабильныеПериодыДокументыНачислений.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериодыДокументыНачислений.ДокРегистратор КАК ДокРегистратор	
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыИзмерителиСтаблиногоПериода КАК ПараметрыИзмерителиСтаблиногоПериода
	|		ПО СтабильныеПериодыДокументыНачислений.Организация = ПараметрыИзмерителиСтаблиногоПериода.Организация
	|			И СтабильныеПериодыДокументыНачислений.ПериодНачисления = ПараметрыИзмерителиСтаблиногоПериода.ПериодНачисления
	|			И СтабильныеПериодыДокументыНачислений.Район = ПараметрыИзмерителиСтаблиногоПериода.Район
	|			И СтабильныеПериодыДокументыНачислений.ЧастныйСектор = ПараметрыИзмерителиСтаблиногоПериода.ЧастныйСектор
	|			И СтабильныеПериодыДокументыНачислений.Строение = ПараметрыИзмерителиСтаблиногоПериода.Строение
	|			И СтабильныеПериодыДокументыНачислений.Помещение = ПараметрыИзмерителиСтаблиногоПериода.Помещение
	|			И СтабильныеПериодыДокументыНачислений.ТочкаУчета = ПараметрыИзмерителиСтаблиногоПериода.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыИзмерителиНаправлений","СтабильныеПериодыВводНачальныхОстатковСИзмерителями","НомерПозиции,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	СтабильныеПериодыВводНачальныхОстатковСИзмерителями.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериодыВводНачальныхОстатковСИзмерителями.ДокРегистратор КАК ДокРегистратор
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатковСИзмерителями КАК СтабильныеПериодыВводНачальныхОстатковСИзмерителями   
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение";  	                            	
	
	Если Строение = Неопределено тогда		
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор)","");
		Текст				= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение = &Строение)","");
		Текст 				= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.Строение = &Строение","");
		Текст 				= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение = &Строение","");
		Текст 				= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение = &Строение","");
		Текст 				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение = &Строение)","");
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда 
		Текст				= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение = &Строение)","");
		Текст 				= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.Строение = &Строение","");
		Текст 				= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение = &Строение","");
		Текст 				= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение = &Строение","");
		Текст 				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение = &Строение)","");
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
	ИначеЕсли Помещение = Неопределено Тогда
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
	КонецЕсли;
	
	Запрос.Текст 			= Текст;
	
	Возврат Запрос.ВыполнитьПакет(); 		
КонецФункции

Функция СтабильныеПериодыВводНачальныхОстатков(Строение, Помещение)
	Текст 	=  
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|	ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|	ВложенныйЗапрос.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.Плательщик КАК Плательщик,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|	ВложенныйЗапрос.Техническая КАК Техническая,
	|	ВложенныйЗапрос.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(энргВводНачальныхОстатковТочкиУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ЗависимаяТочкаУчета,
	|	ВложенныйЗапрос.КоэффициентФормула КАК КоэффициентФормула,
	|	ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|	0 КАК ФиксированныйОбъемПотребления,
	|	0 КАК ДоляПотребленияЧислитель,
	|	0 КАК ДоляПотребленияЗнаменатель,
	|	0 КАК КоэффициентРаспределенияОстатка,
	|	0 КАК ГодПостройки,
	|	0 КАК КоличествоЭтажей,
	|	"""" КАК СоставЖильцов,
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка) КАК ТипСхемы,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыТепловыхПунктов.ПустаяСсылка) КАК ВидТепловогоПункта,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ПустаяСсылка) КАК СпособРаспределенияОбъемаПомещения,
	|	ЛОЖЬ КАК БлокировочныйАкт,
	|	ВложенныйЗапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|	ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|	0 КАК ПотериОбъем,
	|	0 КАК ПотериПроцент,
	|	0 КАК ДопСоциальнаяНормаПотребления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНачальногоНедопуска,
	|	0 КАК КоличествоНедопусков,
	|	ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	энргПомещения.Родитель КАК ПомещениеРодитель,
	|	ЛОЖЬ КАК УслугаОграничена,
	|	ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка) КАК ВладелецЗависимойТочкиУчета,
	|	ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ ВсеПараметрыРасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|		ВложенныйЗапрос.Строение КАК Строение,
	|		ВложенныйЗапрос.Помещение КАК Помещение,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|		ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|		ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|		ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|		ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|		ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|		ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|		ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|		ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|		ЕСТЬNULL(энргВводНачальныхОстатковЗначениеПлощадей.ЗначениеПлощади, 0) КАК ЗначениеПлощади,
	|		ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|		ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|		ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|		ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|		ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|		ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|		ВложенныйЗапрос.Поставщик КАК Поставщик,
	|		ВложенныйЗапрос.Плательщик КАК Плательщик,
	|		ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|		ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|		ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|		ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|		ВложенныйЗапрос.Техническая КАК Техническая,
	|		ВложенныйЗапрос.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.IDСтрокиТочкиУчета, НЕОПРЕДЕЛЕНО) КАК IDСтрокиЗависимаяТочкаУчета,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.Коэффициент, 0) КАК КоэффициентФормула,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле.Ссылка ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК РасчетПоФормуле,
	|		ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|		ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|		ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|		ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|		ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|		ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.Район КАК Район,
	|			ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|			ВложенныйЗапрос.Строение КАК Строение,
	|			ВложенныйЗапрос.Помещение КАК Помещение,
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|			ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|			ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|			ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|			ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|			ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|			ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|			ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|			ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|			ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|			ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|			ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|			ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|			ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|			ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|			ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|			ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|			ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|			ВложенныйЗапрос.Поставщик КАК Поставщик,
	|			ВложенныйЗапрос.Плательщик КАК Плательщик,
	|			ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|			ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|			ЕСТЬNULL(энргСпособыРасчетаПоНаправлениям.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|			ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|			ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|			ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|			ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|			ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|			ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|			ВложенныйЗапрос.Техническая КАК Техническая,
	|			ВложенныйЗапрос.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|			ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|			ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|			ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|			ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|			ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВложенныйЗапрос.Организация КАК Организация,
	|				ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|				ВложенныйЗапрос.Район КАК Район,
	|				ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|				ВложенныйЗапрос.Строение КАК Строение,
	|				ВложенныйЗапрос.Помещение КАК Помещение,
	|				ВложенныйЗапрос.Абонент КАК Абонент,
	|				ВложенныйЗапрос.Услуга КАК Услуга,
	|				ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|				ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|				ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|				ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|				ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|				ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|				ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|				ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|				ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|				ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|				ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|				ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|				ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|				ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|				ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|				ЕСТЬNULL(энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройства, ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)) КАК ВидБлагоустройства,
	|				ЕСТЬNULL(энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ТарифнаяГруппа,
	|				ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|				ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|				ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|				ВложенныйЗапрос.Поставщик КАК Поставщик,
	|				ВложенныйЗапрос.Плательщик КАК Плательщик,
	|				ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|				ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|				ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|				ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|				ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|				ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|				ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|				ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|				ВложенныйЗапрос.Техническая КАК Техническая,
	|				ЕСТЬNULL(энргВводНачальныхОстатковТочкиУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчетаРодитель,
	|				ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|				ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|				ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|				ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|				ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|				ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|				ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ВложенныйЗапрос.Организация КАК Организация,
	|					ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|					ВложенныйЗапрос.Район КАК Район,
	|					ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|					ВложенныйЗапрос.Строение КАК Строение,
	|					ВложенныйЗапрос.Помещение КАК Помещение,
	|					ВложенныйЗапрос.Абонент КАК Абонент,
	|					ВЫБОР
	|						КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Услуга
	|						ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги
	|					КОНЕЦ КАК Услуга,
	|					ВЫБОР
	|						КОГДА НЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Услуга
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|					КОНЕЦ КАК СоставнаяУслуга,
	|					ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|					ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|					ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|					ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|					ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|					ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|					ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|					ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|					ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|					ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|					ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|					ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|					ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|					ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|					ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|					ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|					ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|					ВЫБОР
	|						КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Поставщик
	|						ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Поставщик
	|					КОНЕЦ КАК Поставщик,
	|					ВЫБОР
	|						КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Плательщик
	|						ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Плательщик
	|					КОНЕЦ КАК Плательщик,
	|					ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|					ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|					ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|					ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|					ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|					ВложенныйЗапрос.IDСтрокиРодительТочкиУчета КАК IDСтрокиРодительТочкиУчета,
	|					ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|					ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|					ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|					ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|					ВложенныйЗапрос.Техническая КАК Техническая,
	|					ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|					ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|					ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|					ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|					ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|					ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|					ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ВложенныйЗапрос.Организация КАК Организация,
	|						ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|						ВложенныйЗапрос.Район КАК Район,
	|						энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|						энргКлючиПомещений.Строение КАК Строение,
	|						энргКлючиПомещений.Помещение КАК Помещение,
	|						ВложенныйЗапрос.Абонент КАК Абонент,
	|						энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
	|						энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|						0 КАК НомерПозиции,
	|						&ПериодРегистрации КАК ПериодРегистрации,
	|						ВложенныйЗапрос.Дата КАК ДатаРегистратора,
	|						ВложенныйЗапрос.Регистратор КАК ДокРегистратор,
	|						ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|						ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|						ИСТИНА КАК УслугаПодключена,
	|						НЕ энргВводНачальныхОстатковТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка) КАК ПриборВведен,
	|						энргВводНачальныхОстатковТочкиУчета.ПриборУчета КАК ПриборУчета,
	|						ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|						ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|						ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|						ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаПоверки КАК ДатаПоверки,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаПоверки КАК ДатаРегистрацииПоверки,
	|						энргВводНачальныхОстатковТочкиУчета.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|						энргВводНачальныхОстатковТочкиУчета.Поставщик КАК Поставщик,
	|						энргВводНачальныхОстатковТочкиУчета.Плательщик КАК Плательщик,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаВводПрибораУчета КАК ДатаСостоянияПрибора,
	|						энргВводНачальныхОстатковТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|						энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|						энргВводНачальныхОстатковТочкиУчета.IDСтрокиРодитель КАК IDСтрокиРодительТочкиУчета,
	|						энргВводНачальныхОстатковТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|						энргВводНачальныхОстатковТочкиУчета.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|						ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|						ВЫБОР
	|							КОГДА энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ = 0
	|								ТОГДА 1
	|							ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ
	|						КОНЕЦ КАК КоэффициентПУ,
	|						ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|						энргВводНачальныхОстатковТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|						ЕСТЬNULL(энргДиаметрСеченияТочекУчетаСрезПоследних.Использовать, ЛОЖЬ) КАК ИспользоватьДиаметрСечения,
	|						ЕСТЬNULL(энргДиаметрСеченияТочекУчетаСрезПоследних.ДиаметрСечения, 0) КАК ДиаметрСечения,
	|						энргВводНачальныхОстатковТочкиУчета.Техническая КАК Техническая,
	|						ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|						ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|						энргВводНачальныхОстатковТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаВыводаПрибораУчета КАК ПериодНачисленияВыводаПрибора,
	|						ЛОЖЬ КАК СрокПоверкиИстек,
	|						ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|					ИЗ
	|						(ВЫБРАТЬ
	|							энргВводНачальныхОстатков.Ссылка КАК Регистратор,
	|							энргВводНачальныхОстатков.Дата КАК Дата,
	|							энргВводНачальныхОстатков.Район КАК Район,
	|							энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|							энргВводНачальныхОстатков.Организация КАК Организация,
	|							энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|							энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|							ИСТИНА КАК ЛСОткрыт,
	|							энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС КАК ДатаСостоянияЛицевогоСчета,
	|							энргВводНачальныхОстатковАбоненты.IDСтроки КАК IDСтрокиАбонента,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПроживающих КАК КоличествоПроживающих,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПрописанных КАК КоличествоПрописанных,
	|							энргВводНачальныхОстатковАбоненты.КоличествоСобственников КАК КоличествоСобственников,
	|							энргВводНачальныхОстатковАбоненты.КоличествоКомнат КАК КоличествоКомнат,
	|							энргВводНачальныхОстатковАбоненты.ТипСобственностиЖилья КАК ВидСобственности,
	|							СУММА(ВЫБОР
	|									КОГДА НЕ энргВводНачальныхОстатковАбоненты1.КоличествоПроживающих ЕСТЬ NULL
	|											И энргВводНачальныхОстатковАбоненты1.КоличествоПроживающих <> 0
	|										ТОГДА энргВводНачальныхОстатковАбоненты1.КоличествоПроживающих
	|									КОГДА НЕ энргВводНачальныхОстатковАбоненты1.КоличествоПрописанных ЕСТЬ NULL
	|											И энргВводНачальныхОстатковАбоненты1.КоличествоПрописанных <> 0
	|										ТОГДА энргВводНачальныхОстатковАбоненты1.КоличествоПрописанных
	|									КОГДА НЕ энргВводНачальныхОстатковАбоненты1.КоличествоСобственников ЕСТЬ NULL
	|											И энргВводНачальныхОстатковАбоненты1.КоличествоСобственников <> 0
	|										ТОГДА энргВводНачальныхОстатковАбоненты1.КоличествоСобственников
	|									ИНАЧЕ 0
	|								КОНЕЦ) КАК КоличествоЖильцов,
	|							энргВводНачальныхОстатковАбоненты.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|						ИЗ
	|							ДокументыДляПроведения КАК ДокументыДляПроведения
	|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты
	|									ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты1
	|									ПО энргВводНачальныхОстатковАбоненты.Ссылка = энргВводНачальныхОстатковАбоненты1.Ссылка
	|										И энргВводНачальныхОстатковАбоненты.IDСтроки = энргВводНачальныхОстатковАбоненты1.IDСтрокиРодитель
	|								ПО ДокументыДляПроведения.ДокРегистратор = энргВводНачальныхОстатковАбоненты.Ссылка
	|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков КАК энргВводНачальныхОстатков
	|								ПО ДокументыДляПроведения.ДокРегистратор = энргВводНачальныхОстатков.Ссылка
	|						
	|						СГРУППИРОВАТЬ ПО
	|							энргВводНачальныхОстатков.Ссылка,
	|							энргВводНачальныхОстатков.Дата,
	|							энргВводНачальныхОстатков.Район,
	|							энргВводНачальныхОстатковАбоненты.КлючПомещения,
	|							энргВводНачальныхОстатков.Организация,
	|							энргВводНачальныхОстатков.ПериодНачисления,
	|							энргВводНачальныхОстатковАбоненты.Абонент,
	|							энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС,
	|							энргВводНачальныхОстатковАбоненты.IDСтроки,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПроживающих,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПрописанных,
	|							энргВводНачальныхОстатковАбоненты.КоличествоСобственников,
	|							энргВводНачальныхОстатковАбоненты.КоличествоКомнат,
	|							энргВводНачальныхОстатковАбоненты.ТипСобственностиЖилья,
	|							энргВводНачальныхОстатковАбоненты.ДоговорЗаключенДоТП) КАК ВложенныйЗапрос
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	|							ПО ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента
	|								И ВложенныйЗапрос.Регистратор = энргВводНачальныхОстатковТочкиУчета.Ссылка
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|							ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДиаметрСеченияТочекУчета.СрезПоследних КАК энргДиаметрСеченияТочекУчетаСрезПоследних
	|							ПО ВложенныйЗапрос.Регистратор = энргДиаметрСеченияТочекУчетаСрезПоследних.Регистратор
	|								И ВложенныйЗапрос.Организация = энргДиаметрСеченияТочекУчетаСрезПоследних.Организация
	|								И ВложенныйЗапрос.Район = энргДиаметрСеченияТочекУчетаСрезПоследних.Район
	|								И ВложенныйЗапрос.КлючПомещения = энргДиаметрСеченияТочекУчетаСрезПоследних.КлючПомещения
	|								И (энргВводНачальныхОстатковТочкиУчета.ТочкаУчета = энргДиаметрСеченияТочекУчетаСрезПоследних.ТочкаУчета)) КАК ВложенныйЗапрос
	|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоставщикиСоставныхУслуг КАК энргВводНачальныхОстатковПоставщикиСоставныхУслуг
	|						ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка
	|							И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргВводНачальныхОстатковПоставщикиСоставныхУслуг.IDСтроки
	|							И (ВложенныйЗапрос.ЭтоСоставнаяУслуга)) КАК ВложенныйЗапрос
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ВидыБлагоустройстваТарифныеКатегории КАК энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории
	|					ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.Ссылка
	|						И ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.IDСтрокиАбонента
	|						И ВложенныйЗапрос.Услуга = энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.Услуга
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	|					ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковТочкиУчета.Ссылка
	|						И ВложенныйЗапрос.IDСтрокиРодительТочкиУчета = энргВводНачальныхОстатковТочкиУчета.IDСтроки) КАК ВложенныйЗапрос
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(&МоментВремени, ) КАК энргСпособыРасчетаПоНаправлениям
	|				ПО ВложенныйЗапрос.Организация = энргСпособыРасчетаПоНаправлениям.Организация
	|					И ВложенныйЗапрос.Район = энргСпособыРасчетаПоНаправлениям.Район
	|					И ВложенныйЗапрос.Услуга = энргСпособыРасчетаПоНаправлениям.Услуга
	|					И ВложенныйЗапрос.НаправлениеИспользованияТУ = энргСпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ЗначениеПлощадей КАК энргВводНачальныхОстатковЗначениеПлощадей
	|			ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковЗначениеПлощадей.Ссылка
	|				И ВложенныйЗапрос.ВидПлощади = энргВводНачальныхОстатковЗначениеПлощадей.ВидПлощади
	|				И ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковЗначениеПлощадей.IDСтрокиАбонента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ФормулыРасчета КАК энргВводНачальныхОстатковФормулыРасчета
	|			ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковФормулыРасчета.Ссылка
	|				И ВложенныйЗапрос.ТочкаУчета = энргВводНачальныхОстатковФормулыРасчета.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ФормулыРасчета КАК энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле
	|			ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле.IDСтрокиТочкиУчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.ЧастныйСектор,
	|		ВложенныйЗапрос.Строение,
	|		ВложенныйЗапрос.Помещение,
	|		ВложенныйЗапрос.Абонент,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.ТочкаУчета,
	|		ВложенныйЗапрос.НомерПозиции,
	|		ВложенныйЗапрос.ПериодРегистрации,
	|		ВложенныйЗапрос.ДатаРегистратора,
	|		ВложенныйЗапрос.ДокРегистратор,
	|		ВложенныйЗапрос.ЛСОткрыт,
	|		ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета,
	|		ВложенныйЗапрос.УслугаПодключена,
	|		ВложенныйЗапрос.ПриборВведен,
	|		ВложенныйЗапрос.ПриборУчета,
	|		ВложенныйЗапрос.КоличествоПрописанных,
	|		ВложенныйЗапрос.КоличествоСобственников,
	|		ВложенныйЗапрос.ТарифнаяГруппа,
	|		ВложенныйЗапрос.ДатаПоверки,
	|		ВложенныйЗапрос.ДатаРегистрацииПоверки,
	|		ВложенныйЗапрос.Поставщик,
	|		ВложенныйЗапрос.Плательщик,
	|		ВложенныйЗапрос.ДатаСостоянияПрибора,
	|		ВложенныйЗапрос.НетВозможностьУстановкиПУ,
	|		ВложенныйЗапрос.ОтключатьВНеполивнойСезон,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.СоставнаяУслуга,
	|		ВложенныйЗапрос.ВидБлагоустройства,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|		ВложенныйЗапрос.Техническая,
	|		ВложенныйЗапрос.ВидСобственности,
	|		ВложенныйЗапрос.ИспользоватьДиаметрСечения,
	|		ВложенныйЗапрос.ТочкаУчетаРодитель,
	|		ВложенныйЗапрос.КлючПомещения,
	|		ВложенныйЗапрос.КоличествоПроживающих,
	|		ВложенныйЗапрос.КоличествоКомнат,
	|		ЕСТЬNULL(энргВводНачальныхОстатковЗначениеПлощадей.ЗначениеПлощади, 0),
	|		ВложенныйЗапрос.КоэффициентПУ,
	|		ВложенныйЗапрос.ДиаметрСечения,
	|		ВложенныйЗапрос.КоличествоЖильцов,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.Коэффициент, 0),
	|		ВложенныйЗапрос.РасчетТолькоПоПоказаниям,
	|		ВложенныйЗапрос.ПрименятьФормулуВсегда,
	|		ВложенныйЗапрос.ПериодНачисленияВыводаПрибора,
	|		ВложенныйЗапрос.СрокПоверкиИстек,
	|		ВложенныйЗапрос.ДоговорЗаключенДоТП,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.IDСтрокиТочкиУчета, НЕОПРЕДЕЛЕНО)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковТочкиУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиЗависимаяТочкаУчета = энргВводНачальныхОстатковТочкиУчета.IDСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ВложенныйЗапрос.Помещение = энргПомещения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПараметрыРасчета.Организация КАК Организация,
	|	ВсеПараметрыРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ВсеПараметрыРасчета.Район КАК Район,
	|	ВсеПараметрыРасчета.ЧастныйСектор КАК ЧастныйСектор,
	|	ВсеПараметрыРасчета.Строение КАК Строение,
	|	ВсеПараметрыРасчета.Помещение КАК Помещение,
	|	ВсеПараметрыРасчета.Абонент КАК Абонент,
	|	ВсеПараметрыРасчета.Услуга КАК Услуга,
	|	ВсеПараметрыРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ВсеПараметрыРасчета.НомерПозиции КАК НомерПозиции,
	|	ВсеПараметрыРасчета.ПериодРегистрации КАК ПериодРегистрации,
	|	ВсеПараметрыРасчета.ДатаРегистратора КАК ДатаРегистратора,
	|	ВсеПараметрыРасчета.ДокРегистратор КАК ДокРегистратор,
	|	ВсеПараметрыРасчета.ЛСОткрыт КАК ЛСОткрыт,
	|	ВсеПараметрыРасчета.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ВсеПараметрыРасчета.УслугаПодключена КАК УслугаПодключена,
	|	ВсеПараметрыРасчета.ПриборВведен КАК ПриборВведен,
	|	ВсеПараметрыРасчета.ПриборУчета КАК ПриборУчета,
	|	ВсеПараметрыРасчета.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВсеПараметрыРасчета.КоличествоСобственников КАК КоличествоСобственников,
	|	ВсеПараметрыРасчета.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВсеПараметрыРасчета.КоличествоКомнат КАК КоличествоКомнат,
	|	ВсеПараметрыРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВсеПараметрыРасчета.КоэффициентПУ КАК КоэффициентПУ,
	|	ВсеПараметрыРасчета.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВсеПараметрыРасчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВсеПараметрыРасчета.ДатаПоверки КАК ДатаПоверки,
	|	ВсеПараметрыРасчета.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	ВсеПараметрыРасчета.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ВсеПараметрыРасчета.Поставщик КАК Поставщик,
	|	ВсеПараметрыРасчета.Плательщик КАК Плательщик,
	|	ВсеПараметрыРасчета.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВсеПараметрыРасчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВсеПараметрыРасчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	ВсеПараметрыРасчета.ВидСобственности КАК ВидСобственности,
	|	ВсеПараметрыРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВсеПараметрыРасчета.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ВсеПараметрыРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ВсеПараметрыРасчета.Техническая КАК Техническая,
	|	ВсеПараметрыРасчета.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	ВсеПараметрыРасчета.КлючПомещения КАК КлючПомещения,
	|	ВсеПараметрыРасчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВсеПараметрыРасчета.КоэффициентФормула КАК КоэффициентФормула,
	|	ВсеПараметрыРасчета.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ВсеПараметрыРасчета.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	ВсеПараметрыРасчета.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	ВсеПараметрыРасчета.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	ВсеПараметрыРасчета.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ВсеПараметрыРасчета.ГодПостройки КАК ГодПостройки,
	|	ВсеПараметрыРасчета.КоличествоЭтажей КАК КоличествоЭтажей,
	|	ВсеПараметрыРасчета.Шкала КАК Шкала,
	|	ВсеПараметрыРасчета.ТипСхемы КАК ТипСхемы,
	|	ВсеПараметрыРасчета.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ВсеПараметрыРасчета.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	ВсеПараметрыРасчета.БлокировочныйАкт КАК БлокировочныйАкт,
	|	ВсеПараметрыРасчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргВводНачальныхОстатковЗначенияИзмерителей.НаправлениеИспользованияТУ КАК Измеритель,
	|	энргВводНачальныхОстатковЗначенияИзмерителей.Значение КАК Количество,
	|	ВсеПараметрыРасчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	0 КАК ПотериОбъем,
	|	0 КАК ПотериПроцент,
	|	ВсеПараметрыРасчета.ПериодНачальногоНедопуска КАК ПериодНачальногоНедопуска,
	|	ВсеПараметрыРасчета.КоличествоНедопусков КАК КоличествоНедопусков,
	|	ВсеПараметрыРасчета.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	ВсеПараметрыРасчета.УслугаОграничена КАК УслугаОграничена,
	|	ВсеПараметрыРасчета.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ ВсеПараметрыРасчетаСИзмерителями
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ЗначенияИзмерителей КАК энргВводНачальныхОстатковЗначенияИзмерителей
	|		ПО ВсеПараметрыРасчета.ДокРегистратор = энргВводНачальныхОстатковЗначенияИзмерителей.Ссылка
	|			И ВсеПараметрыРасчета.IDСтрокиТочкиУчета = энргВводНачальныхОстатковЗначенияИзмерителей.IDСтроки";
	
	Текст  = Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст = Текст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНорматива(Истина);
	
	Текст  = Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст  = Текст +
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.*,
	|	КлючиНорматива.КлючНорматива КАК КлючНорматива,
	|	КлючиНорматива.КлючСоцНорматива КАК КлючСоцНорматива,
	|	ЛОЖЬ КАК ЯвляетсяПомещениемСРазделеннымиЛС
	|ПОМЕСТИТЬ СтабильныеПериодыВводНачальныхОстатков
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
	|		ПО (ВсеПараметрыРасчета.Строение = КлючиНорматива.Строение)
	|		И (ВсеПараметрыРасчета.Помещение = КлючиНорматива.Помещение)
	|		И (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
	|		И (ВсеПараметрыРасчета.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ)
	|		И (КлючиНорматива.Измеритель = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПараметрыРасчетаСИзмерителями.*,
	|	КлючиНорматива.КлючНорматива КАК КлючНорматива,
	|	КлючиНорматива.КлючСоцНорматива КАК КлючСоцНорматива,
	|	ЛОЖЬ КАК ЯвляетсяПомещениемСРазделеннымиЛС
	|ПОМЕСТИТЬ СтабильныеПериодыВводНачальныхОстатковСИзмерителями
	|ИЗ
	|	ВсеПараметрыРасчетаСИзмерителями КАК ВсеПараметрыРасчетаСИзмерителями
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
	|		ПО ВсеПараметрыРасчетаСИзмерителями.Строение = КлючиНорматива.Строение
	|			И ВсеПараметрыРасчетаСИзмерителями.Помещение = КлючиНорматива.Помещение
	|			И ВсеПараметрыРасчетаСИзмерителями.Услуга = КлючиНорматива.Услуга
	|			И ВсеПараметрыРасчетаСИзмерителями.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ
	|			И ВсеПараметрыРасчетаСИзмерителями.Измеритель = КлючиНорматива.Измеритель";
	
	Возврат Текст;
	
КонецФункции 

Функция СтабильныеПериодыДокументыНачисления(ПериодНачисления, Строение, Помещение)
	
	Текст 	=  
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомерСтрок
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|ГДЕ
	|	СтабильныеПериоды.Организация = &Организация
	|	И СтабильныеПериоды.ПериодНачисления = &ПредыдущийПериод
	|	И СтабильныеПериоды.Район = &Район
	|	И СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор
	|	И СтабильныеПериоды.Строение = &Строение
	|	И СтабильныеПериоды.Помещение = &Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.ПериодНачисления,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.ЧастныйСектор,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.Услуга,
	|	СтабильныеПериоды.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	0 КАК НомерПозиции,
	|	ЛОЖЬ КАК БлокировочныйАкт,
	|	0 КАК ГодПостройки,
	| "+ энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","Организация,ПериодНачисления,НомерПозиции,БлокировочныйАкт,СоставЖильцов") + "
	|ПОМЕСТИТЬ ПараметрыСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|		ПО НомерСтрок.Организация = СтабильныеПериоды.Организация
	|			И НомерСтрок.ПериодНачисления = СтабильныеПериоды.ПериодНачисления
	|			И НомерСтрок.Район = СтабильныеПериоды.Район
	|			И НомерСтрок.ЧастныйСектор = СтабильныеПериоды.ЧастныйСектор
	|			И НомерСтрок.Строение = СтабильныеПериоды.Строение
	|			И НомерСтрок.Помещение = СтабильныеПериоды.Помещение
	|			И НомерСтрок.Услуга = СтабильныеПериоды.Услуга
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериоды.ТочкаУчета
	|			И НомерСтрок.НомерПозиции = СтабильныеПериоды.НомерПозиции
	|			И (СтабильныеПериоды.Организация = &Организация)
	|			И (СтабильныеПериоды.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериоды.Район = &Район)
	|			И (СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)
	|			И (СтабильныеПериоды.Строение = &Строение)
	|			И (СтабильныеПериоды.Помещение = &Помещение)
	|ГДЕ
	|	СтабильныеПериоды.УслугаПодключена";
	
	ИмяТаблицыПараметрыСтаблиногоПериода = "ПараметрыСтаблиногоПериода";
	Если ПериодНачисления = НачалоГода(ПериодНачисления) Тогда
		Текст 	= Текст + ОбщегоНазначения.РазделительПакетаЗапросов(); 
		
		Текст 	= Текст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНорматива(Ложь,"ПараметрыСтаблиногоПериода");
		
		Текст 	= Текст + ОбщегоНазначения.РазделительПакетаЗапросов(); 	
		
		Текст  	= Текст +
		"ВЫБРАТЬ
		| "+ энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ВсеПараметрыРасчета","КлючНорматива,КлючСоцНорматива,СоставЖильцов",Истина,Ложь) + "
		|	КлючиНорматива.КлючНорматива КАК КлючНорматива,
		|	КлючиНорматива.КлючСоцНорматива КАК КлючСоцНорматива
		|ПОМЕСТИТЬ ВсеПараметрыРасчетаКлючНорматива
		|ИЗ
		|	ПараметрыСтаблиногоПериода КАК ВсеПараметрыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНормативаПараметрыСтаблиногоПериода КАК КлючиНорматива
		|		ПО (ВсеПараметрыРасчета.Строение = КлючиНорматива.Строение)
		|		И (ВсеПараметрыРасчета.Помещение = КлючиНорматива.Помещение)
		|		И (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
		|		И (ВсеПараметрыРасчета.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ)
		|		И (КлючиНорматива.Измеритель = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))";
		
		ИмяТаблицыПараметрыСтаблиногоПериода = "ВсеПараметрыРасчетаКлючНорматива";		
	КонецЕсли;
	
	Текст 		= Текст + ОбщегоНазначения.РазделительПакетаЗапросов();	
	
	Текст 		= Текст + 
	"ВЫБРАТЬ
	| "+ энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ПараметрыСтаблиногоПериода","ПериодРегистрации,ДатаРегистратора,ДокРегистратор,СоставЖильцов",Истина,Ложь) + "
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор	
	|ПОМЕСТИТЬ СтабильныеПериодыДокументыНачислений
	|ИЗ
	|	" + ИмяТаблицыПараметрыСтаблиногоПериода + " КАК ПараметрыСтаблиногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ПО ПараметрыСтаблиногоПериода.Организация = ДокументыДляПроведения.Организация
	|			И ПараметрыСтаблиногоПериода.ПериодНачисления = ДокументыДляПроведения.ПериодНачисления
	|			И ПараметрыСтаблиногоПериода.Район = ДокументыДляПроведения.Район
	|			И ПараметрыСтаблиногоПериода.ЧастныйСектор = ДокументыДляПроведения.ЧастныйСектор
	|			И НЕ ДокументыДляПроведения.ДокРегистратор Ссылка Документ.энргВводНачальныхОстатков
	|			И (ВЫБОР
	|					КОГДА ДокументыДляПроведения.ЧастныйСектор
	|						ТОГДА ИСТИНА 
	|					ИНАЧЕ ПараметрыСтаблиногоПериода.Строение = ДокументыДляПроведения.Строение
	|				КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыШкалы","СтабильныеПериодыШкалы","Организация,ПериодНачисления,НомерПозиции,ДатаРегистратора,ДокРегистратор") + "		
	|ПОМЕСТИТЬ ПараметрыШкалСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО НомерСтрок.Организация = СтабильныеПериодыШкалы.Организация
	|			И НомерСтрок.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И НомерСтрок.Район = СтабильныеПериодыШкалы.Район
	|			И НомерСтрок.ЧастныйСектор = СтабильныеПериодыШкалы.ЧастныйСектор
	|			И НомерСтрок.Строение = СтабильныеПериодыШкалы.Строение
	|			И НомерСтрок.Помещение = СтабильныеПериодыШкалы.Помещение
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (СтабильныеПериодыШкалы.Организация = &Организация)
	|			И (СтабильныеПериодыШкалы.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериодыШкалы.Район = &Район)
	|			И (СтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор)
	|			И (СтабильныеПериодыШкалы.Строение = &Строение)
	|			И (СтабильныеПериодыШкалы.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыИзмерителиНаправлений","энргСтабильныеПериодыИзмерителиНаправлений","Организация,ПериодНачисления,НомерПозиции,ДатаРегистратора,ДокРегистратор") + "		
	|ПОМЕСТИТЬ ПараметрыИзмерителиСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК энргСтабильныеПериодыИзмерителиНаправлений
	|		ПО НомерСтрок.Организация = энргСтабильныеПериодыИзмерителиНаправлений.Организация
	|			И НомерСтрок.ПериодНачисления = энргСтабильныеПериодыИзмерителиНаправлений.ПериодНачисления
	|			И НомерСтрок.Район = энргСтабильныеПериодыИзмерителиНаправлений.Район
	|			И НомерСтрок.ЧастныйСектор = энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор
	|			И НомерСтрок.Строение = энргСтабильныеПериодыИзмерителиНаправлений.Строение
	|			И НомерСтрок.Помещение = энргСтабильныеПериодыИзмерителиНаправлений.Помещение
	|			И НомерСтрок.ТочкаУчета = энргСтабильныеПериодыИзмерителиНаправлений.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = энргСтабильныеПериодыИзмерителиНаправлений.НомерПозиции
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Организация = &Организация)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.ПериодНачисления = &ПредыдущийПериод)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Район = &Район)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Строение = &Строение)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)";
	
	Возврат Текст;
	
КонецФункции  

#КонецОбласти

#Область ОтложенныеДвиженияДокументовНачисленияМКД

Процедура ОчиститьНаборыЗаписейМКД(Организация,ПериодНачисления,Район,МассивМКД)
	
	Для каждого МКД из МассивМКД Цикл
		
		НаборСтабильныеПериоды					= РегистрыСведений.энргСтабильныеПериодыМКД.СоздатьНаборЗаписей();
		НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
		НаборСтабильныеПериоды.Отбор.Организация.установить(Организация);
		НаборСтабильныеПериоды.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборСтабильныеПериоды.Отбор.Район.установить(Район);
		//Если Не МКД = Неопределено  Тогда
		НаборСтабильныеПериоды.Отбор.МКД.установить(МКД);
		//КонецЕсли;
		НаборСтабильныеПериоды.записать();
		
		НаборСтабильныеПериодыШкалы				= РегистрыСведений.энргСтабильныеПериодыМКДШкалы.СоздатьНаборЗаписей();
		НаборСтабильныеПериодыШкалы.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
		НаборСтабильныеПериодыШкалы.Отбор.Организация.установить(Организация);
		НаборСтабильныеПериодыШкалы.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборСтабильныеПериодыШкалы.Отбор.Район.установить(Район);
		//Если Не МКД = Неопределено  Тогда
		НаборСтабильныеПериодыШкалы.Отбор.МКД.установить(МКД);
		//КонецЕсли;
		НаборСтабильныеПериодыШкалы.записать();
		
		НаборСоставУзлов					= РегистрыСведений.энргСтабильныеПериодыМКДСоставУзловУчета.СоздатьНаборЗаписей();
		НаборСоставУзлов.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
		НаборСоставУзлов.Отбор.Организация.установить(Организация);
		НаборСоставУзлов.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборСоставУзлов.Отбор.Район.установить(Район);
		//Если Не МКД = Неопределено  Тогда
		НаборСоставУзлов.Отбор.МКД.установить(МКД);
		//КонецЕсли;
		НаборСоставУзлов.записать();
		
		НаборНомерСтрокСтабПериода 				= РегистрыСведений.энргНомераСтрокСтабильногоПериодаМКД.СоздатьНаборЗаписей();
		НаборНомерСтрокСтабПериода.Отбор.Организация.установить(Организация);
		НаборНомерСтрокСтабПериода.Отбор.Район.установить(Район);
		НаборНомерСтрокСтабПериода.Отбор.ПериодНачисления.установить(ПериодНачисления);
		//Если Не МКД = Неопределено  Тогда
		НаборНомерСтрокСтабПериода.Отбор.МКД.установить(МКД);
		//КонецЕсли;
		НаборНомерСтрокСтабПериода.Записать();
		
		НаборМаксимальныеПоказания 				= РегистрыСведений.энргМаксимальныеПоказанияСрезМКД.СоздатьНаборЗаписей();
		НаборМаксимальныеПоказания.Отбор.Организация.установить(Организация);
		НаборМаксимальныеПоказания.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборМаксимальныеПоказания.Отбор.Район.установить(Район);
		//Если Не МКД = Неопределено  Тогда
		НаборМаксимальныеПоказания.Отбор.МКД.установить(МКД);
		//КонецЕсли;
		НаборМаксимальныеПоказания.Записать();    	
		
		//НаборМаксимальныеПоказания 			= РегистрыСведений.энргМаксимальныеПоказанияСрезМКД.СоздатьНаборЗаписей();
		//НаборМаксимальныеПоказания.Отбор.Организация.установить(Организация);
		//НаборМаксимальныеПоказания.Отбор.ПериодНачисления.установить(ДобавитьМесяц(ПериодНачисления,-1));
		//НаборМаксимальныеПоказания.Отбор.Район.установить(Район);
		//Если Не МКД = Неопределено  Тогда
		//	НаборМаксимальныеПоказания.Отбор.МКД.установить(МКД);
		//КонецЕсли;
		//НаборМаксимальныеПоказания.Записать();  
		
		НаборОтложенныхДвижений  				= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
		НаборОтложенныхДвижений.Отбор.Организация.установить(Организация);
		НаборОтложенныхДвижений.Отбор.ПериодНачисления.установить(ДобавитьМесяц(ПериодНачисления,-1));
		НаборОтложенныхДвижений.Отбор.Район.установить(Район);
		//Если Не МКД = Неопределено  Тогда
		//	НаборОтложенныхДвижений.Отбор.ЧастныйСектор.установить(Ложь);
		НаборОтложенныхДвижений.Отбор.Строение.установить(МКД);
		//КонецЕсли;
		НаборОтложенныхДвижений.Отбор.РазделЗаписи.установить(Перечисления.энргРазделыЗаписи.СтабильныеПериодыМКД);
		НаборОтложенныхДвижений.Записать();
		
	КонецЦикла;
КонецПроцедуры

Функция РезультатНачальныеОстаткиСтабильногоПериодаМКД(Организация, ПериодНачисления,Район,Строение,ПериодРегистрации)
	Разделить = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Текст 	=
	"ВЫБРАТЬ
	|	ОтложенныеДвиженияДокументов.Организация КАК Организация,
	|	ОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	|	ОтложенныеДвиженияДокументов.Район КАК Район,
	|	ОтложенныеДвиженияДокументов.ЧастныйСектор КАК ЧастныйСектор,
	//|	ОтложенныеДвиженияДокументов.Строение КАК Строение,
	|	ОтложенныеДвиженияДокументов.ДокРегистратор КАК ДокРегистратор,
	|	ОтложенныеДвиженияДокументов.ДатаРегистратора КАК ДатаРегистратора
	|ПОМЕСТИТЬ ДокументыДляПроведения
	|ИЗ
	|	РегистрСведений.энргОтложенныеДвиженияДокументов КАК ОтложенныеДвиженияДокументов
	|ГДЕ
	|	ОтложенныеДвиженияДокументов.Организация = &Организация
	|	И ОтложенныеДвиженияДокументов.ПериодНачисления = &Периодначисления
	|	И ОтложенныеДвиженияДокументов.Район = &Район
	|	И ОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.СтабильныеПериодыМКД)
	|	И НЕ ОтложенныеДвиженияДокументов.ЧастныйСектор";
	//|	И ОтложенныеДвиженияДокументов.Строение = &Строение";
		
	Текст 							= Текст + Разделить;	
	
	Текст 							= Текст + СтабильныеПериодыДокументыНачисленияМКД(Строение);
	
	МВТ 							= Новый МенеджерВременныхТаблиц;
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодРегистрации",		ПериодРегистрации);
	Запрос.УстановитьПараметр("ПредыдущийПериод",		НачалоМесяца(ПериодНачисления-1));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Периодначисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Период",					КонецМесяца(ПериодНачисления));
	Запрос.Выполнить();
	
	Текст 							=  
	"ВЫБРАТЬ
	|	0 КАК НомерПозиции,
	|	ЛОЖЬ КАК МенялосьСостояниеПУ,
	|	ЛОЖЬ КАК ВводНачальныхОстатков,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыМКД","ДокументыНачальныхОстатков","НомерПозиции,МенялосьСостояниеПУ,ВводНачальныхОстатков,ФормулаРасчета") + "
	|	
	|ИЗ
	|	ДокументыНачальныхОстатков КАК ДокументыНачальныхОстатков
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	РасчетныеДанные.Организация,
	//|	РасчетныеДанные.ПериодНачисления,
	//|	РасчетныеДанные.Район,
	//|	РасчетныеДанные.МКД,
	//|	РасчетныеДанные.Услуга,
	//|	РасчетныеДанные.ТочкаУчета,
	//|	0,
	//|	&ПериодРегистрации,
	//|	РасчетныеДанные.Дата,
	//|	РасчетныеДанные.Регистратор,
	//|	РасчетныеДанные.Бойлер,
	//|	РасчетныеДанные.ВидБлагоустройства,
	//|	РасчетныеДанные.ВидДифференцированности,
	//|	РасчетныеДанные.ДатаСостоянияПрибора,
	//|	РасчетныеДанные.ЗначениеПлощади,
	//|	РасчетныеДанные.КлючНорматива,
	//|	РасчетныеДанные.КоэффициентПУ,
	//|	ЛОЖЬ,
	//|	РасчетныеДанные.МКДОткрыт,
	//|	РасчетныеДанные.НетВозможностьУстановкиПУ,
	//|	РасчетныеДанные.Поставщик,
	//|	РасчетныеДанные.ПриборВведен,
	//|	РасчетныеДанные.ПриборУчета,
	//|	РасчетныеДанные.РасчетПоФормуле,
	//|	РасчетныеДанные.СоставнаяУслуга,
	//|	РасчетныеДанные.УслугаПодключена,
	//|	РасчетныеДанные.ФормулаРасчета,
	//|	РасчетныеДанные.Шкала,
	//|	РасчетныеДанные.Этажность,
	//|	ИСТИНА
	//|ИЗ
	//|	РасчетныеДанные КАК РасчетныеДанные
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДокРегистратор,
	//|	Организация,
	//|	ПериодНачисления,
	//|	Район,
	//|	МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргМаксимальныеПоказанияСрез.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргМаксимальныеПоказанияСрез.Район КАК Район,
	|	энргМаксимальныеПоказанияСрез.МКД КАК МКД,
	|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрез.Показания КАК Показания,
	|	энргМаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	энргМаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора
	|ИЗ
	|	СтаблиныеПериодыСоставУзла КАК СтаблиныеПериодыСоставУзла
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК энргМаксимальныеПоказанияСрез
	|		ПО СтаблиныеПериодыСоставУзла.Организация = энргМаксимальныеПоказанияСрез.Организация
	|			И (СтаблиныеПериодыСоставУзла.ПериодНачисления = ДОБАВИТЬКДАТЕ(энргМаксимальныеПоказанияСрез.ПериодНачисления, МЕСЯЦ, 1))
	|			И СтаблиныеПериодыСоставУзла.Район = энргМаксимальныеПоказанияСрез.Район
	|			И СтаблиныеПериодыСоставУзла.МКД = энргМаксимальныеПоказанияСрез.МКД
	|			И СтаблиныеПериодыСоставУзла.ЧастьУзлаУчета = энргМаксимальныеПоказанияСрез.ПриборУчета
	|			И (СтаблиныеПериодыСоставУзла.ПриборВведен)
	|			И (энргМаксимальныеПоказанияСрез.Организация = &Организация)
	|			И (энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПредыдущийПериод)
	|			И (энргМаксимальныеПоказанияСрез.Район = &Район)
	//|			И (энргМаксимальныеПоказанияСрез.МКД = &Строение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыНачальныхОстатков.Организация КАК Организация,
	|	ДокументыНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|	0 КАК НомерПозиции,	
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыМКДШкалы","ПараметрыШкалСтаблиногоПериода","Организация,ПериодНачисления,ДокРегистратор,НомерПозиции") + "
	|ИЗ
	|	ДокументыНачальныхОстатков КАК ДокументыНачальныхОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыШкалСтаблиногоПериода КАК ПараметрыШкалСтаблиногоПериода
	|		ПО ДокументыНачальныхОстатков.Организация = ПараметрыШкалСтаблиногоПериода.Организация
	|			И ДокументыНачальныхОстатков.ПериодНачисления = ПараметрыШкалСтаблиногоПериода.ПериодНачисления
	|			И ДокументыНачальныхОстатков.Район = ПараметрыШкалСтаблиногоПериода.Район
	|			И ДокументыНачальныхОстатков.МКД = ПараметрыШкалСтаблиногоПериода.МКД
	|			И ДокументыНачальныхОстатков.ТочкаУчета = ПараметрыШкалСтаблиногоПериода.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыНачальныхОстатков.Организация КАК Организация,
	|	ДокументыНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|	0 КАК НомерПозиции,	
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыМКДСоставУзловУчета","СтаблиныеПериодыСоставУзла","Организация,ПериодНачисления,ДокРегистратор,НомерПозиции") + "
	|ИЗ
	|	ДокументыНачальныхОстатков КАК ДокументыНачальныхОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтаблиныеПериодыСоставУзла КАК СтаблиныеПериодыСоставУзла
	|		ПО ДокументыНачальныхОстатков.Организация = СтаблиныеПериодыСоставУзла.Организация
	|			И ДокументыНачальныхОстатков.ПериодНачисления = СтаблиныеПериодыСоставУзла.ПериодНачисления
	|			И ДокументыНачальныхОстатков.Район = СтаблиныеПериодыСоставУзла.Район
	|			И ДокументыНачальныхОстатков.МКД = СтаблиныеПериодыСоставУзла.МКД
	|			И ДокументыНачальныхОстатков.ТочкаУчета = СтаблиныеПериодыСоставУзла.ТочкаУчета";   	                            	
	
	//Если Строение = Неопределено Тогда
	//	Текст 		= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И (СтабильныеПериоды.МКД = &Строение)","");
	//	Текст		= СтрЗаменить(Текст,"И (СтабильныеПериоды.МКД = &Строение)","");
	//	Текст 		= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.МКД = &Строение)","");
	//КонецЕсли;
	
	Запрос.Текст 			= Текст;
	
	Возврат Запрос.ВыполнитьПакет();
КонецФункции

Функция СтабильныеПериодыДокументыНачисленияМКД(Строение)
	
	Текст 			=  
	"ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериода.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериода.МКД КАК МКД,
	|	энргНомераСтрокСтабильногоПериода.Услуга КАК Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомерСтрок
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериодаМКД КАК энргНомераСтрокСтабильногоПериода
	|ГДЕ
	|	энргНомераСтрокСтабильногоПериода.Организация = &Организация
	|	И энргНомераСтрокСтабильногоПериода.ПериодНачисления = &ПредыдущийПериод
	|	И энргНомераСтрокСтабильногоПериода.Район = &Район
	//|	И энргНомераСтрокСтабильногоПериода.МКД = &Строение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериода.Организация,
	|	энргНомераСтрокСтабильногоПериода.ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериода.Район,
	|	энргНомераСтрокСтабильногоПериода.МКД,
	|	энргНомераСтрокСтабильногоПериода.Услуга,
	|	энргНомераСтрокСтабильногоПериода.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	0 КАК НомерПозиции,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыМКД","СтабильныеПериоды","Организация,ПериодНачисления,НомерПозиции,ДокРегистратор,ФормулаРасчета") + "
	|		
	|ПОМЕСТИТЬ ПараметрыСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериоды
	|		ПО НомерСтрок.Организация = СтабильныеПериоды.Организация
	|			И НомерСтрок.ПериодНачисления = СтабильныеПериоды.ПериодНачисления
	|			И НомерСтрок.Район = СтабильныеПериоды.Район
	|			И НомерСтрок.МКД = СтабильныеПериоды.МКД
	|			И НомерСтрок.Услуга = СтабильныеПериоды.Услуга
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериоды.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = СтабильныеПериоды.НомерПозиции
	|			И (СтабильныеПериоды.Организация = &Организация)
	|			И (СтабильныеПериоды.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериоды.Район = &Район)
	//|			И (СтабильныеПериоды.МКД = &Строение)	
	|ГДЕ
	|	СтабильныеПериоды.МКДОткрыт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ 
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыМКДШкалы","СтабильныеПериодыШкалы","Организация,ПериодНачисления,НомерПозиции,ДокРегистратор") + "
	|		
	|ПОМЕСТИТЬ ПараметрыШкалСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКДШкалы КАК СтабильныеПериодыШкалы
	|		ПО НомерСтрок.Организация = СтабильныеПериодыШкалы.Организация
	|			И НомерСтрок.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И НомерСтрок.Район = СтабильныеПериодыШкалы.Район
	|			И НомерСтрок.МКД = СтабильныеПериодыШкалы.МКД
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (СтабильныеПериодыШкалы.Организация = &Организация)
	|			И (СтабильныеПериодыШкалы.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериодыШкалы.Район = &Район)
	//|			И (СтабильныеПериодыШкалы.МКД = &Строение)	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыМКДСоставУзловУчета","энргСтабильныеПериодыМКДСоставУзловУчета","Организация,ПериодНачисления,НомерПозиции,ДокРегистратор") + "
	|		
	|ПОМЕСТИТЬ СтаблиныеПериодыСоставУзла
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКДСоставУзловУчета КАК энргСтабильныеПериодыМКДСоставУзловУчета
	|		ПО НомерСтрок.Организация = энргСтабильныеПериодыМКДСоставУзловУчета.Организация
	|			И НомерСтрок.ПериодНачисления = энргСтабильныеПериодыМКДСоставУзловУчета.ПериодНачисления
	|			И НомерСтрок.Район = энргСтабильныеПериодыМКДСоставУзловУчета.Район
	|			И НомерСтрок.МКД = энргСтабильныеПериодыМКДСоставУзловУчета.МКД
	|			И НомерСтрок.ТочкаУчета = энргСтабильныеПериодыМКДСоставУзловУчета.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = энргСтабильныеПериодыМКДСоставУзловУчета.НомерПозиции
	|			И (энргСтабильныеПериодыМКДСоставУзловУчета.Организация = &Организация)
	|			И (энргСтабильныеПериодыМКДСоставУзловУчета.ПериодНачисления = &ПредыдущийПериод)
	|			И (энргСтабильныеПериодыМКДСоставУзловУчета.Район = &Район)
	//|			И (энргСтабильныеПериодыМКДСоставУзловУчета.МКД = &Строение)
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	&Организация КАК Организация,
	//|	&ПериодНачисления КАК ПериодНачисления,
	//|	ПараметрыСтаблиногоПериода.Район КАК Район,
	//|	ПараметрыСтаблиногоПериода.МКД КАК МКД,
	//|	ПараметрыСтаблиногоПериода.ТочкаУчета КАК ТочкаУчета,
	//|	ПараметрыСтаблиногоПериода.ПриборУчета КАК УзелУчета,
	//|	ПараметрыСтаблиногоПериода.ПриборУчета КАК ЧастьУзлаУчета,
	//|	ПараметрыСтаблиногоПериода.ДатаРегистратора КАК ДатаРегистратора,
	//|	ПараметрыСтаблиногоПериода.ПриборВведен КАК ПриборВведен,
	//|	ПараметрыСтаблиногоПериода.КоэффициентПУ КАК КоэффициентПУ,
	//|	ПараметрыСтаблиногоПериода.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора
	//|		
	//|ПОМЕСТИТЬ СтаблиныеПериодыСоставУзла
	//|ИЗ
	//|	ПараметрыСтаблиногоПериода КАК ПараметрыСтаблиногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыМКД","ПараметрыСтаблиногоПериода","ПериодРегистрации,ДатаРегистратора,ДокРегистратор,ФормулаРасчета") + "	
	|ПОМЕСТИТЬ ДокументыНачальныхОстатков
	|ИЗ
	|	ПараметрыСтаблиногоПериода КАК ПараметрыСтаблиногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ПО ПараметрыСтаблиногоПериода.Организация = ДокументыДляПроведения.Организация
	|			И ПараметрыСтаблиногоПериода.ПериодНачисления = ДокументыДляПроведения.ПериодНачисления
	|			И ПараметрыСтаблиногоПериода.Район = ДокументыДляПроведения.Район";
	//|			И ПараметрыСтаблиногоПериода.МКД = ДокументыДляПроведения.Строение";
	
	//Если Строение = Неопределено Тогда
	//	Текст 		= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И (СтабильныеПериоды.МКД = &Строение)","");
	//	Текст 		= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.Строение = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.МКД = &Строение)","");
	//	Текст 		= СтрЗаменить(Текст,"И СтабильныеПериодыШкалы.МКД = &Строение","");
	//	Текст 		= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКДСоставУзловУчета.МКД = &Строение)","");
	//	Текст 		= СтрЗаменить(Текст,"И энргСтабильныеПериодыМКДСоставУзловУчета.МКД = &Строение","");
	//КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СреднийОбъемПотребленияМКД

Функция РезультатаЗапросаСреднегоПотребленияМКД(Организация,ПериодНачисления,Район)
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	МВТ  											= Новый МенеджерВременныхТаблиц;
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	//Запрос.УстановитьПараметр("МКД",				МКД);
	Запрос.МенеджерВременныхТаблиц  				= МВТ;
	Текст 											= ТекстЗапросаСреднийОбъемМКД();
	
	//Если МКД = Неопределено Тогда
	//	Текст 										= СтрЗаменить(Текст, "И (СтабильныеПериоды.МКД = &МКД)","");
	//	Текст 										= СтрЗаменить(Текст, "И СтабильныеПериоды.МКД = &МКД","");
	//	Текст 										= СтрЗаменить(Текст, "И (РасчетСреднегоОбъема.МКД = &МКД)","");
	//	Текст 										= СтрЗаменить(Текст, "И РасчетСреднегоОбъема.МКД = &МКД","");					
	//КонецЕсли;	
	
	Запрос.Текст 		= Текст;
	Запрос.Выполнить();
	
	Текст 								= "ВЫБРАТЬ * ИЗ ПериодыПолученияСезонности КАК ПериодыПолученияСезонности";
	Запрос 								= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	РезультатПериодыПолученияСезонности = Запрос.Выполнить();
	Выборка 							= РезультатПериодыПолученияСезонности.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстГраницОтчетногоПериода 	= энргНачисления.ТекстГраницОтчетногоПериода(Выборка.ПериодНачисленияНачало,Выборка.ПериодНачисленияКонец,Ложь);
	КонецЕсли;
	
	Текст 								= "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаПериодов  ИЗ (" + ТекстГраницОтчетногоПериода + ") КАК ВложенныйЗапрос";
	Если НЕ ПустаяСтрока(ТекстГраницОтчетногоПериода) Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
		Пакет.УстановитьТекстЗапроса(Текст);
		//Пакет.Операторы[0].ВыбираемыеПоля.Добавить("&Район");
		//Колонка  							= Пакет.Колонки[Пакет.Колонки.Количество()-1];
		//Колонка.Псевдоним 					= "Район";
		СоотвествиеПолей 					= Новый Структура("Организация,Район","Организация","Район");
		
		Параметры 							= Новый Структура;
		ПараметрыВТ 						= Новый Массив;
		ПараметрыВТ.Добавить(Новый Структура());
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", СоотвествиеПолей));
		
		РегистрыСведений.энргДлительностиПериодов.ПериодыСезонностиКоллекцияПериодов(Схема,Параметры,"ТаблицаПериодов", "ПериодыСезонности");		
	Иначе		
		РегистрыСведений.энргДлительностиПериодов.ПериодыСезонностиПустаяТаблица(Схема,Параметры,"ПериодыСезонности");				
	КонецЕсли;
	
	Запрос 								= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.Выполнить(); 
	
	Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) КАК КоличествоРасчитанныхОбъемов,
	|	МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный) КАК ЭтоОбъемПотребленный,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|				И МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный)
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемПотребленный)
	|		КОГДА НЕ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемПотребленный)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ОбъемПотребленный,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|				И НЕ МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный)
	|			ТОГДА СУММА(ВложенныйЗапрос.Объем)
	|		КОГДА НЕ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|			ТОГДА СУММА(ВложенныйЗапрос.Объем)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК Объем,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцевПотребленный) КАК КоличествоМесяцевПотребленный,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцев) КАК КоличествоМесяцев,
	|	МАКСИМУМ(ВложенныйЗапрос.СуммарныйОбъемПотребленный) КАК СуммарныйОбъемПотребленный,
	|	МАКСИМУМ(ВложенныйЗапрос.СуммарныйОбъем) КАК СуммарныйОбъем,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцевСезонности) КАК КоличествоМесяцевСезонности,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцевСезонностиПотребленный) КАК КоличествоМесяцевСезонностиПотребленный
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|		ВложенныйЗапрос.СуммарныйОбъемПотребленный КАК СуммарныйОбъемПотребленный,
	|		ВложенныйЗапрос.СуммарныйОбъем КАК СуммарныйОбъем,
	|		ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА НЕ ВложенныйЗапрос.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПУстаяСсылка)
	|						ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|					ИНАЧЕ ВложенныйЗапрос.КоличествоМесяцев
	|				КОНЕЦ = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВложенныйЗапрос.СуммарныйОбъемПотребленный / ВЫБОР
	|					КОГДА НЕ ВложенныйЗапрос.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПУстаяСсылка)
	|						ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|					ИНАЧЕ ВложенныйЗапрос.КоличествоМесяцев
	|				КОНЕЦ
	|		КОНЕЦ КАК ОбъемПотребленный,
	|		ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА НЕ ВложенныйЗапрос.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПУстаяСсылка)
	|						ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|					ИНАЧЕ ВложенныйЗапрос.КоличествоМесяцев
	|				КОНЕЦ = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВложенныйЗапрос.СуммарныйОбъем / ВЫБОР
	|					КОГДА НЕ ВложенныйЗапрос.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПУстаяСсылка)
	|						ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|					ИНАЧЕ ВложенныйЗапрос.КоличествоМесяцев
	|				КОНЕЦ
	|		КОНЕЦ КАК Объем,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА ВложенныйЗапрос.КоличествоМесяцев
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцевПотребленный,
	|		ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА ВложенныйЗапрос.КоличествоМесяцев
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцев,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцевСезонностиПотребленный,
	|		ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцевСезонности
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПериодыРасчетаСреднего.Организация КАК Организация,
	|			ПериодыРасчетаСреднего.Район КАК Район,
	|			ПериодыРасчетаСреднего.МКД КАК МКД,
	|			ПериодыРасчетаСреднего.Услуга КАК Услуга,
	|			ПериодыРасчетаСреднего.ТочкаУчета КАК ТочкаУчета,
	|			ПериодыРасчетаСреднего.Шкала КАК Шкала,
	|			ПериодыРасчетаСреднего.КоличествоМесяцев КАК КоличествоМесяцев,
	|			ПериодыРасчетаСреднего.ТарифнаяЗона КАК ТарифнаяЗона,
	|			ПериодыРасчетаСреднего.НачалоПериода КАК НачалоПериода,
	|			ПериодыРасчетаСреднего.КонецПериода КАК КонецПериода,
	|			ПериодыРасчетаСреднего.Сезонность КАК Сезонность,
	|			ПериодыРасчетаСреднего.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|			ВЫБОР
	|				КОГДА ПериодыРасчетаСреднего.ЭтоОбъемПотребленный
	|					ТОГДА СУММА(РасчетСреднегоОбъема.ОбъемУслуги)
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммарныйОбъемПотребленный,
	|			ВЫБОР
	|				КОГДА НЕ ПериодыРасчетаСреднего.ЭтоОбъемПотребленный
	|					ТОГДА СУММА(РасчетСреднегоОбъема.ОбъемУслуги)
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммарныйОбъем
	|		ИЗ
	|			ПериодыРасчетаСреднего КАК ПериодыРасчетаСреднего
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|				ПО ПериодыРасчетаСреднего.Район = РасчетСреднегоОбъема.Район
	|					И ПериодыРасчетаСреднего.МКД = РасчетСреднегоОбъема.МКД
	|					И ПериодыРасчетаСреднего.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|					И ПериодыРасчетаСреднего.Шкала = РасчетСреднегоОбъема.Шкала
	|					И ПериодыРасчетаСреднего.ТарифнаяЗона = РасчетСреднегоОбъема.ТарифнаяЗона
	|					И (РасчетСреднегоОбъема.ПериодНачисления МЕЖДУ ПериодыРасчетаСреднего.НачалоПериода И ПериодыРасчетаСреднего.КонецПериода)
	|					И (РасчетСреднегоОбъема.Организация = &Организация)
	|					И (РасчетСреднегоОбъема.Район = &Район)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПериодыРасчетаСреднего.Организация,
	|			ПериодыРасчетаСреднего.Район,
	|			ПериодыРасчетаСреднего.МКД,
	|			ПериодыРасчетаСреднего.Услуга,
	|			ПериодыРасчетаСреднего.ТочкаУчета,
	|			ПериодыРасчетаСреднего.Шкала,
	|			ПериодыРасчетаСреднего.КоличествоМесяцев,
	|			ПериодыРасчетаСреднего.ТарифнаяЗона,
	|			ПериодыРасчетаСреднего.ЭтоОбъемПотребленный,
	|			ПериодыРасчетаСреднего.НачалоПериода,
	|			ПериодыРасчетаСреднего.КонецПериода,
	|			ПериодыРасчетаСреднего.Сезонность) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПериодыСезонности КАК ПериодыСезонности
	|			ПО ВложенныйЗапрос.Организация = ПериодыСезонности.Организация
	|				И ВложенныйЗапрос.Район = ПериодыСезонности.Район
	|				И ВложенныйЗапрос.Сезонность = ПериодыСезонности.Сезонность
	|				И (ПериодыСезонности.ПериодНачисления МЕЖДУ ВложенныйЗапрос.НачалоПериода И ВложенныйЗапрос.КонецПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.МКД,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.ТочкаУчета,
	|		ВложенныйЗапрос.Шкала,
	|		ВложенныйЗапрос.СуммарныйОбъемПотребленный,
	|		ВложенныйЗапрос.СуммарныйОбъем,
	|		ВложенныйЗапрос.КоличествоМесяцев,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.Сезонность) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона";
	
	Запрос 								= Новый Запрос();
	//Если МКД = Неопределено Тогда
	//	Текст 							= СтрЗаменить(Текст, "И (РасчетСреднегоОбъема.МКД = &МКД)","");
	//	Текст 							= СтрЗаменить(Текст, "И РасчетСреднегоОбъема.МКД = &МКД","");
	//КонецЕсли;
	
	Запрос.Текст 						= Текст;
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	//Запрос.УстановитьПараметр("МКД",				МКД);
	результат 							= Запрос.Выполнить();
	
	Возврат результат;
	
КонецФункции

Функция ТекстЗапросаСреднийОбъемМКД()
	
	текст  = 
	"ВЫБРАТЬ
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.Организация КАК Организация,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПоказаний КАК КоличествоПоказаний,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПериодов КАК КоличествоПериодов,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный
	|ПОМЕСТИТЬ НастройкиРасчетаСреднегоПотребления
	|ИЗ
	|	РегистрСведений.энргНастройкиРасчетаСреднегоПотребления.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкиРасчетаСреднегоПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Организация КАК Организация,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Район КАК Район,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Услуга КАК Услуга,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.ВидПлощади КАК ВидПлощади,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Сезонность КАК Сезонность
	|ПОМЕСТИТЬ СпособыРасчетаПоНаправлениям
	|ИЗ
	|	РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргСпособыРасчетаПоНаправлениямСрезПоследних
	|ГДЕ
	|	НЕ энргСпособыРасчетаПоНаправлениямСрезПоследних.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.КоличествоПредоставленных КАК КоличествоПредоставленных,
	|	ВложенныйЗапрос.СрокНеПредоставления КАК СрокНеПредоставления,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.КоличествоПоказаний КАК КоличествоПоказаний,
	|	ВложенныйЗапрос.КоличествоПериодов КАК КоличествоПериодов,
	|	ВложенныйЗапрос.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	ВложенныйЗапрос.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)) КАК Сезонность
	|ПОМЕСТИТЬ ТочкиДляРасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетСреднегоОбъема.Район КАК Район,
	|		РасчетСреднегоОбъема.МКД КАК МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета КАК ТочкаУчета,
	|		СтабильныеПериоды.Услуга КАК Услуга,
	|		РасчетСреднегоОбъема.Шкала КАК Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона КАК ТарифнаяЗона,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(РасчетСреднегоОбъема.ПериодНачисления, МЕСЯЦ)) КАК КоличествоПредоставленных,
	|		РАЗНОСТЬДАТ(МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления), &ПериодНачисления, МЕСЯЦ) КАК СрокНеПредоставления,
	|		МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления) КАК КонецПериода,
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПоказаний) КАК КоличествоПоказаний,
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПериодов) КАК КоличествоПериодов,
	|		МАКСИМУМ(СтабильныеПериоды.ЗаПрошлыйГод) КАК ЗаПрошлыйГод,
	|		МАКСИМУМ(СтабильныеПериоды.НачислятьСреднийОбъемНеБолееМесяцев) КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|		ЛОЖЬ КАК ЭтоОбъемПотребленный,
	|		СтабильныеПериоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация КАК Организация
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтабильныеПериоды.Район КАК Район,
	|			СтабильныеПериоды.МКД КАК МКД,
	|			СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			СтабильныеПериоды.Услуга КАК Услуга,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПоказаний КАК КоличествоПоказаний,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПериодов КАК КоличествоПериодов,
	|			НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|			НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|			НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|			СтабильныеПериоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|			СтабильныеПериоды.Организация КАК Организация
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|				ПО СтабильныеПериоды.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга
	|					И (НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|					И (СтабильныеПериоды.Организация = &Организация)
	|					И (СтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|					И (СтабильныеПериоды.Район = &Район)
	|					И (СтабильныеПериоды.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга)
	|					И (СтабильныеПериоды.УслугаПодключена)
	|					И (ВЫБОР
	|						КОГДА НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод
	|							ТОГДА ИСТИНА
	|						КОГДА СтабильныеПериоды.ПриборВведен
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ НЕ НАЧАЛОПЕРИОДА(СтабильныеПериоды.ПериодНачисленияВыводаПрибора, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1)
	|					КОНЕЦ)) КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|			ПО СтабильныеПериоды.Район = РасчетСреднегоОбъема.Район
	|				И СтабильныеПериоды.МКД = РасчетСреднегоОбъема.МКД
	|				И СтабильныеПериоды.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|				И (РасчетСреднегоОбъема.ПериодНачисления < ВЫБОР
	|					КОГДА СтабильныеПериоды.ЗаПрошлыйГод
	|						ТОГДА НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД)
	|					ИНАЧЕ &ПериодНачисления
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетСреднегоОбъема.Район,
	|		РасчетСреднегоОбъема.МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета,
	|		СтабильныеПериоды.Услуга,
	|		РасчетСреднегоОбъема.Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона,
	|		СтабильныеПериоды.ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетСреднегоОбъема.Район,
	|		РасчетСреднегоОбъема.МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета,
	|		СтабильныеПериоды.Услуга,
	|		РасчетСреднегоОбъема.Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(РасчетСреднегоОбъема.ПериодНачисления, МЕСЯЦ)),
	|		РАЗНОСТЬДАТ(МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления), &ПериодНачисления, МЕСЯЦ),
	|		МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления),
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПоказанийОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПериодовОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.ЗаПрошлыйГодОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный),
	|		ИСТИНА,
	|		СтабильныеПериоды.ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтабильныеПериоды.Район КАК Район,
	|			СтабильныеПериоды.МКД КАК МКД,
	|			СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			СтабильныеПериоды.Услуга КАК Услуга,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|			СтабильныеПериоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|			СтабильныеПериоды.Организация КАК Организация
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|				ПО СтабильныеПериоды.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга
	|					И (НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|					И (СтабильныеПериоды.Организация = &Организация)
	|					И (СтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|					И (СтабильныеПериоды.Район = &Район)
	|					И (СтабильныеПериоды.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга)
	|					И (СтабильныеПериоды.УслугаПодключена)
	|					И (ВЫБОР
	|						КОГДА НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод
	|							ТОГДА ИСТИНА
	|						КОГДА СтабильныеПериоды.ПриборВведен
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ НЕ НАЧАЛОПЕРИОДА(СтабильныеПериоды.ПериодНачисленияВыводаПрибора, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1)
	|					КОНЕЦ)) КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|			ПО СтабильныеПериоды.Район = РасчетСреднегоОбъема.Район
	|				И СтабильныеПериоды.МКД = РасчетСреднегоОбъема.МКД
	|				И СтабильныеПериоды.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|				И (РасчетСреднегоОбъема.ПериодНачисления < ВЫБОР
	|					КОГДА СтабильныеПериоды.ЗаПрошлыйГодОбъемПотребленный
	|						ТОГДА НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД)
	|					ИНАЧЕ &ПериодНачисления
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетСреднегоОбъема.Район,
	|		РасчетСреднегоОбъема.МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета,
	|		СтабильныеПериоды.Услуга,
	|		РасчетСреднегоОбъема.Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона,
	|		СтабильныеПериоды.ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО ВложенныйЗапрос.Организация = СпособыРасчетаПоНаправлениям.Организация
	|			И ВложенныйЗапрос.Район = СпособыРасчетаПоНаправлениям.Район
	|			И ВложенныйЗапрос.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И (СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|			И (НЕ ВложенныйЗапрос.ЗаПрошлыйГод)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЗаПрошлыйГод
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВложенныйЗапрос.КоличествоПредоставленных >= 1
	|					И ВложенныйЗапрос.СрокНеПредоставления <= ВложенныйЗапрос.НачислятьСреднийОбъемНеБолееМесяцев
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|	МАКСИМУМ(ВложенныйЗапрос.НачалоПериода) КАК НачалоПериода,
	|	РАЗНОСТЬДАТ(МАКСИМУМ(ВложенныйЗапрос.НачалоПериода), ВложенныйЗапрос.КонецПериода, МЕСЯЦ) + 1 КАК КоличествоМесяцев,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность
	|ПОМЕСТИТЬ ПериодыРасчетаСреднего
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|		МИНИМУМ(ВложенныйЗапрос.НачалоПериода) КАК НачалоПериода,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.КоличествоПоказаний КАК КоличествоПоказаний,
	|		ВложенныйЗапрос.Сезонность КАК Сезонность
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТочкиДляРасчета.Район КАК Район,
	|			ТочкиДляРасчета.МКД КАК МКД,
	|			ТочкиДляРасчета.Услуга КАК Услуга,
	|			ТочкиДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|			ТочкиДляРасчета.Шкала КАК Шкала,
	|			ТочкиДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|			ТочкиДляРасчета.КонецПериода КАК КонецПериода,
	|			ТочкиДляРасчета.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|			МИНИМУМ(РасчетСреднегоОбъема.ПериодНачисления) КАК НачалоПериода,
	|			ТочкиДляРасчета.Организация КАК Организация,
	|			ТочкиДляРасчета.КоличествоПоказаний КАК КоличествоПоказаний,
	|			ТочкиДляРасчета.Сезонность КАК Сезонность
	|		ИЗ
	|			ТочкиДляРасчета КАК ТочкиДляРасчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|				ПО ТочкиДляРасчета.Район = РасчетСреднегоОбъема.Район
	|					И ТочкиДляРасчета.МКД = РасчетСреднегоОбъема.МКД
	|					И ТочкиДляРасчета.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|					И ТочкиДляРасчета.Шкала = РасчетСреднегоОбъема.Шкала
	|					И ТочкиДляРасчета.ТарифнаяЗона = РасчетСреднегоОбъема.ТарифнаяЗона
	|					И (РасчетСреднегоОбъема.ПериодНачисления < НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД))
	|					И (РасчетСреднегоОбъема.ПериодНачисления >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД), ГОД, -1))
	|					И (РасчетСреднегоОбъема.Организация = &Организация)
	|					И (РасчетСреднегоОбъема.Район = &Район)
	//|					И (РасчетСреднегоОбъема.МКД = &МКД)
	|					И (ТочкиДляРасчета.ЗаПрошлыйГод)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТочкиДляРасчета.Район,
	|			ТочкиДляРасчета.МКД,
	|			ТочкиДляРасчета.Услуга,
	|			ТочкиДляРасчета.ТочкаУчета,
	|			ТочкиДляРасчета.Шкала,
	|			ТочкиДляРасчета.ТарифнаяЗона,
	|			ТочкиДляРасчета.КонецПериода,
	|			ТочкиДляРасчета.ЭтоОбъемПотребленный,
	|			ТочкиДляРасчета.Организация,
	|			ТочкиДляРасчета.КоличествоПоказаний,
	|			ТочкиДляРасчета.Сезонность
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВложенныйЗапрос.Район,
	|			ВложенныйЗапрос.МКД,
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТочкаУчета,
	|			ВложенныйЗапрос.Шкала,
	|			ВложенныйЗапрос.ТарифнаяЗона,
	|			ВложенныйЗапрос.КонецПериода,
	|			ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|			МАКСИМУМ(ВложенныйЗапрос.НачалоПериода),
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.КоличествоПоказаний,
	|			ВложенныйЗапрос.Сезонность
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ТочкиДляРасчета.Район КАК Район,
	|				ТочкиДляРасчета.МКД КАК МКД,
	|				ТочкиДляРасчета.Услуга КАК Услуга,
	|				ТочкиДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|				ТочкиДляРасчета.Шкала КАК Шкала,
	|				ТочкиДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|				ТочкиДляРасчета.КонецПериода КАК КонецПериода,
	|				ТочкиДляРасчета.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|				МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления) КАК НачалоПериода,
	|				ТочкиДляРасчета.Организация КАК Организация,
	|				ТочкиДляРасчета.КоличествоПоказаний КАК КоличествоПоказаний,
	|				ТочкиДляРасчета.Сезонность КАК Сезонность
	|			ИЗ
	|				ТочкиДляРасчета КАК ТочкиДляРасчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|					ПО ТочкиДляРасчета.Район = РасчетСреднегоОбъема.Район
	|						И ТочкиДляРасчета.МКД = РасчетСреднегоОбъема.МКД
	|						И ТочкиДляРасчета.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|						И ТочкиДляРасчета.Шкала = РасчетСреднегоОбъема.Шкала
	|						И ТочкиДляРасчета.ТарифнаяЗона = РасчетСреднегоОбъема.ТарифнаяЗона
	|						И (РасчетСреднегоОбъема.ПериодНачисления <= ДОБАВИТЬКДАТЕ(ТочкиДляРасчета.КонецПериода, МЕСЯЦ, -ТочкиДляРасчета.КоличествоПериодов + 1))
	|						И (РасчетСреднегоОбъема.Организация = &Организация)
	|						И (РасчетСреднегоОбъема.Район = &Район)
	//|						И (РасчетСреднегоОбъема.МКД = &МКД)
	|						И (НЕ ТочкиДляРасчета.ЗаПрошлыйГод)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТочкиДляРасчета.Район,
	|				ТочкиДляРасчета.МКД,
	|				ТочкиДляРасчета.Услуга,
	|				ТочкиДляРасчета.ТочкаУчета,
	|				ТочкиДляРасчета.Шкала,
	|				ТочкиДляРасчета.ТарифнаяЗона,
	|				ТочкиДляРасчета.КонецПериода,
	|				ТочкиДляРасчета.ЭтоОбъемПотребленный,
	|				ТочкиДляРасчета.Организация,
	|				ТочкиДляРасчета.КоличествоПоказаний,
	|				ТочкиДляРасчета.Сезонность) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.КонецПериода,
	|			ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|			ВложенныйЗапрос.Район,
	|			ВложенныйЗапрос.МКД,
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТочкаУчета,
	|			ВложенныйЗапрос.Шкала,
	|			ВложенныйЗапрос.ТарифнаяЗона,
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.КоличествоПоказаний,
	|			ВложенныйЗапрос.Сезонность) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.МКД,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.ТочкаУчета,
	|		ВложенныйЗапрос.Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.КонецПериода,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.КоличествоПоказаний,
	|		ВложенныйЗапрос.Сезонность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТочкиДляРасчета.Район,
	|		ТочкиДляРасчета.МКД,
	|		ТочкиДляРасчета.Услуга,
	|		ТочкиДляРасчета.ТочкаУчета,
	|		ТочкиДляРасчета.Шкала,
	|		ТочкиДляРасчета.ТарифнаяЗона,
	|		ТочкиДляРасчета.КонецПериода,
	|		ТочкиДляРасчета.ЭтоОбъемПотребленный,
	|		ТочкиДляРасчета.ДатаСостоянияПрибора,
	|		ТочкиДляРасчета.Организация,
	|		ТочкиДляРасчета.КоличествоПоказаний,
	|		ТочкиДляРасчета.Сезонность
	|	ИЗ
	|		ТочкиДляРасчета КАК ТочкиДляРасчета) КАК ВложенныйЗапрос
	|ГДЕ
	|	РАЗНОСТЬДАТ(ВложенныйЗапрос.НачалоПериода, ВложенныйЗапрос.КонецПериода, МЕСЯЦ) + 1 >= ВложенныйЗапрос.КоличествоПоказаний
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.КонецПериода,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ПериодыРасчетаСреднего.Район КАК Район,
	|	МИНИМУМ(ПериодыРасчетаСреднего.НачалоПериода) КАК ПериодНачисленияНачало,
	|	МАКСИМУМ(ПериодыРасчетаСреднего.КонецПериода) КАК ПериодНачисленияКонец
	|ПОМЕСТИТЬ ПериодыПолученияСезонности
	|ИЗ
	|	ПериодыРасчетаСреднего КАК ПериодыРасчетаСреднего
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыРасчетаСреднего.Район"; 
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция ПараметрыЗаписиЖурнала(ИмяОперации,ПериодНачисления,Район)
	
	ПараметрыЗаписиЖурнала  = Новый Структура();
	
	СоотвествиеОпераций  	= Новый Структура;	
	СоотвествиеОпераций.Вставить("ОтложенныеДвиженияДокументовНачисленияМКД",			"Работа с последовательностями (биллинг). Чтение данных на начало периода расчета (мкд)");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьСтабильныеПериодыМКД",	"Работа с последовательностями (биллинг). События мкд");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьПоказанияПУМКД",		"Работа с последовательностями (биллинг). Показания мкд");
	СоотвествиеОпераций.Вставить("ОтложенныеДвиженияДокументовНачисления",				"Работа с последовательностями (биллинг). Чтение данных на начало периода расчета");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьСтабильныеПериоды",		"Работа с последовательностями (биллинг). События абонентов");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьПоказанияПУ",			"Работа с последовательностями (биллинг). Показания абонентов");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностиВзаиморасчетов",		"Работа с последовательностями (биллинг). Взаиморасчеты с абонентами");
	СоотвествиеОпераций.Вставить("ПерерасчетСреднихНачислений",							"Работа с начислениями (биллинг). Перерасчет средних начислений");
	
	ПараметрыЗаписиЖурнала.Вставить("ИмяОперации", СоотвествиеОпераций[ИмяОперации]);
	ПараметрыЗаписиЖурнала.Вставить("Уровень", УровеньЖурналаРегистрации.Информация);
	ПараметрыЗаписиЖурнала.Вставить("Метаданные", РегистрыСведений.энргСтабильныеПериодыМКД);
	ПараметрыЗаписиЖурнала.Вставить("КомментарийСтарт", "Запуск по району " + Район + " за период " + Формат(ПериодНачисления,"ДФ='ММММ гггг'"));
	ПараметрыЗаписиЖурнала.Вставить("КомментарийСтоп", "Завершение по району " 	+ Район + " за период " + Формат(ПериодНачисления,"ДФ='ММММ гггг'"));
	
	Возврат ПараметрыЗаписиЖурнала;
	
КонецФункции

Процедура ЗаполнитьСоставЖильцов(СтрокаСтабПериоды, Выборка, СоставЖильцовРазделенныхЛС)
	Если НЕ ЗначениеЗаполнено(Выборка.Абонент) Тогда
		СтрокаСтабПериоды.СоставЖильцов = СоставЖильцовРазделенныхЛС[Выборка.Помещение];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПомещениеРодитель) Тогда
		Если СоставЖильцовРазделенныхЛС[Выборка.ПомещениеРодитель] = Неопределено Тогда
			СоставЖильцовРазделенныхЛС.Вставить(Выборка.ПомещениеРодитель, ПолучитьСоставЖильцов(Выборка))
		Иначе
			СоставЖильцовРазделенныхЛС[Выборка.ПомещениеРодитель] = ПолучитьСоставЖильцов(Выборка, СоставЖильцовРазделенныхЛС[Выборка.ПомещениеРодитель]);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСоставЖильцов(Выборка, стрСоставЖильцов = "")
	
	яСоставЖильцов 						= Новый ФиксированнаяСтруктура("КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников", 0, 0, 0);
	
	IDКлючПомещения 					= "" + Выборка.КлючПомещения.УникальныйИдентификатор();
	СоставЖильцов  						= Новый Соответствие;
	Если НЕ ПустаяСтрока(стрСоставЖильцов) Тогда
		Чтение  						= Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(стрСоставЖильцов);
		СоставЖильцов 					= ПрочитатьJSON(Чтение,Истина);
	КонецЕсли;
	
	Если СоставЖильцов[IDКлючПомещения] = Неопределено Тогда
		Значение 						= Новый Структура(яСоставЖильцов);
		ЗаполнитьЗначенияСвойств(Значение,Выборка); 
		СоставЖильцов.Вставить(IDКлючПомещения, Значение);
	Иначе
		Значение 						= Новый Структура(яСоставЖильцов);
		ЗаполнитьЗначенияСвойств(Значение,Выборка);
		СоставЖильцов[IDКлючПомещения] 	= Значение;
	КонецЕсли; 	
	
	Запись 								= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();	
	ЗаписатьJSON(Запись,СоставЖильцов);
	
	Возврат Запись.Закрыть()
	
КонецФункции

Функция СоздатьНаборЗаписей(МенеджерРегистраСведений)
	
	НаборЗаписей = МенеджерРегистраСведений.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	
	Возврат НаборЗаписей;
	
КонецФункции

Функция ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления)
	Отказ = Ложь;
	
	ДокДляПроверки = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ДокДляПроверки.Организация	= Организация;
	ДокДляПроверки.Дата			= ПериодНачисления;
	ДокДляПроверки.Район		= Район;	
	Попытка
		ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ДокДляПроверки, Отказ, Истина, Истина);
	Исключение
		Отказ	= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для пользователя " + Пользователи.ТекущийПользователь() + " район " + Район + " период " + ПериодНачисления + " закрыт для редактирования");
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

Функция ИнициализироватьСервисыВзаиморасчетов(МВТ, ОписаниеПериода, ОписаниеОтборов)
	
	Результат = Новый Массив;
	
	СервисДолга = Обработки.энргМенеджерВзаиморасчетовПоМесяцам.Создать();
	ЗаполнитьЗначенияСвойств(СервисДолга, ОписаниеОтборов);
	СервисДолга.ВидЗадолженности = Перечисления.энргВидыЗадолженности.ОсновнойДолг;
	СервисДолга.ГраницыПериодаНачисления = ОписаниеПериода;
	СервисДолга.Инициализировать(МВТ);
	
	Результат.Добавить(СервисДолга);	
	
	СервисДолга = Обработки.энргМенеджерВзаиморасчетовПоПене.Создать();
	ЗаполнитьЗначенияСвойств(СервисДолга, ОписаниеОтборов);
	СервисДолга.ВидЗадолженности = Перечисления.энргВидыЗадолженности.Пеня;
	СервисДолга.ГраницыПериодаНачисления = ОписаниеПериода;
	СервисДолга.Инициализировать(МВТ);
	
	Результат.Добавить(СервисДолга);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИндивидуальныеРегламентныеОперации

Процедура ВыполнитьИндивидуальныеРегламетныеОперации() 
	
	ВыполнитьРегламетныеОперацииВосстановленияПоследовательностиПоказанияПУ();
	
КонецПроцедуры

Процедура ВыполнитьРегламетныеОперацииВосстановленияПоследовательностиПоказанияПУ() 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ПериодНачисления) КАК ПериодНачисления
	|ИЗ
	|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|ГДЕ
	|	НЕ энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности)
	|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПУПоследовательность.Организация,
	|	энргПоказанияПУПоследовательность.Район";
		
	Запрос = Новый Запрос(Текст); 	
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(ТекущаяДатаСеанса()));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДопПараметры = Новый Структура("КоличествоПотоков", 20);
	ОписаниеПараметров = "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение";
	Пока Выборка.Следующий() Цикл
		ПараметрыОперации = Новый Структура(ОписаниеПараметров);
		ПараметрыОперации.Организация = Выборка.Организация;
		ПараметрыОперации.ПериодНачисления = Выборка.ПериодНачисления;
		ПараметрыОперации.Район = Выборка.Район;
		
		ПараметрыЗаписиЖурнала = ПараметрыЗаписиЖурнала(
			"ВосстановитьПоследовательностьПоказанияПУ", 
			Выборка.ПериодНачисления, 
			Выборка.Район);
			
		ЗаписьЖурналаРегистрации(
			ПараметрыЗаписиЖурнала.ИмяОперации,
			ПараметрыЗаписиЖурнала.Уровень,
			ПараметрыЗаписиЖурнала.Метаданные,
			ПараметрыЗаписиЖурнала.КомментарийСтарт);
			
			
		энргРаботаСПоказаниямиПриборовУчетаСервер.ВосстановитьПоказанияМногопоточно(ПараметрыОперации, ДопПараметры);
		
		ЗаписьЖурналаРегистрации(
			ПараметрыЗаписиЖурнала.ИмяОперации,
			УровеньЖурналаРегистрации.Информация,
			ПараметрыЗаписиЖурнала.Метаданные,
			ПараметрыЗаписиЖурнала.КомментарийСтоп);		
		
	КонецЦикла;		
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти