#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДополнительныеСвойства") Тогда
		УстановитьОтборДинамическогоСписка(Параметры.ДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ПараметрыОтбора)
	перем Организация, Район, Строение, Период, Абонент;
	
	Если ПараметрыОтбора.Свойство("Организация") и ЗначениеЗаполнено(ПараметрыОтбора.Организация) Тогда
		Организация		= ПараметрыОтбора.Организация;
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Район") и ЗначениеЗаполнено(ПараметрыОтбора.Район) Тогда
		Район 			= ПараметрыОтбора.Район;
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Строение") и ЗначениеЗаполнено(ПараметрыОтбора.Строение) Тогда
		Строение		= ПараметрыОтбора.Строение;
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Период") и ЗначениеЗаполнено(ПараметрыОтбора.Период) Тогда
		Период 			= ПараметрыОтбора.Период;
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Абонент") и ЗначениеЗаполнено(ПараметрыОтбора.Абонент) Тогда
		Абонент 		= ПараметрыОтбора.Абонент;
	КонецЕсли;

	Если Организация = Неопределено
		И Район = Неопределено 
		И Строение = Неопределено 
		И Абонент = Неопределено Тогда		
		Возврат;
	КонецЕсли;	
	
	СписокФилиалов 		= Обработки.энргФилиалыСтроенийМенеджер.СписокФилиаловПоОрганизацииРайонуСтрониюАбоненту(Организация, Район, Строение, Абонент, Период); 	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокФилиалов,ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
КонецПроцедуры

#КонецОбласти
