#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает пустой массив плательщиков.
// 
// Возвращаемое значение:
//   Массив.
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
		
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	ЛСОТкрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеЛС(Момент,Абонент,Район,Организация);
			
	МКДОткрыт 		= Истина;

	Если НЕ ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор тогда		
		Строение 		= ДополнительныеСвойства.ДанныеСтроения.Строение;
		МКДОткрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Момент,Район,Строение,Организация);			
	КонецЕсли;
	
	Если не ЛСОТкрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " лицевой счет закрыт");
	КонецЕсли;
	
	Если не МКДОткрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " мкд закрыт");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();	
	
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоСобственников(ДанныеШапки, Движения);
	
	ПолучаемыеСвойства  = Новый Структура("ТипПомещения, КлючПомещенияРодителя");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата),ПолучаемыеСвойства);
	
	Если ПолучаемыеСвойства.ТипПомещения = Перечисления.энргТипыПомещений.Комната И ПолучаемыеСвойства.КлючПомещенияРодителя <> Неопределено Тогда
		
		энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьКоличествоЖильцов(ДанныеШапки,ПолучаемыеСвойства.КлючПомещенияРодителя,Движения);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);   
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("КоличествоСобственников",	Количество);
	ДанныеШапки.Вставить("КоличествоЖильцов",		ПолучитьКоличествоЖильцов());

	Возврат ДанныеШапки; 
КонецФункции

Функция ПолучитьКоличествоЖильцов()
	
	ДатаГраницы 		= ?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		МоментВремени 	= Новый МоментВремени(ДатаГраницы, Ссылка);
	Иначе
		МоментВремени 	= ДатаГраницы;
	КонецЕсли;
	
	ПолучаемыеСвойства  = Новый Структура("КоличествоПрописанных, КоличествоПроживающих");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,МоментВремени,ПолучаемыеСвойства);

	
	Если ПолучаемыеСвойства.КоличествоПрописанных = Неопределено Тогда
		КоличествоЖильцов = ?(ПолучаемыеСвойства.КоличествоПроживающих = Неопределено, Количество, ПолучаемыеСвойства.КоличествоПроживающих);
	Иначе
		КоличествоЖильцов = ПолучаемыеСвойства.КоличествоПрописанных;
	КонецЕсли;
	
	Возврат КоличествоЖильцов;	
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли