#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) И Не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
	
	ЗаполнитьДокумент = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") Тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) И ЗаполнитьДокумент тогда
		ЗаполнитьДанныеОбъектаРасчетаСервер();		
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);

	КонецЕсли;
		
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьДатуПоверкиПУ(ЭтотОбъект, Объект.Ссылка);
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
		
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьПоказанияПередЗаписью();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.ОбъектРасчета);
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестУстановитьДатуПоверкиПУ(ЭтотОбъект, Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	
	ЗаполнитьДанныеОбъектаРасчетаСервер();
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	
	Если ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда
		Элементы[ИмяТаблицыТочек].ТекущаяСтрока	= Объект.ТочкиУчета[0].ПолучитьИдентификатор();
		Если ИспользоватьШкалыПриборовУчета И ЗначениеЗаполнено(Объект.ШкалыПриборовУчета)  Тогда
			Элементы[ИмяТаблицыШкал].ТекущаяСтрока	= Объект.ШкалыПриборовУчета[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьАдрессОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }

	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидДифференцированностиПриИзменении(Элемент)
	
	ТекДанные 								= Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ВидДифференцированности 				= ТекДанные.ВидДифференцированности;
	СоставКаналов = энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекДанные,СоставКаналов,"ПоказанияПриборовУчета",Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаПриИзменении(Элемент)
		
	ТекДанные = Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчета

&НаКлиенте
Процедура ШкалыПриборовУчетаПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьЗначения(Команда)
	ЗаполнитьДанныеОбъектаРасчетаСервер();	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбъектаРасчетаСервер()
	
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	//Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район, Объект.ОбъектРасчета);
	//Иначе
	//	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район,Объект.Договор);
	//КонецЕсли;
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
		КонецЕсли;
		
		//Если НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		//КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета
	КонецЦикла;
	

	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	Иначе	
		текСтрока 								= Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущиеДанные;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <> Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока, ДанныеСтроки);
	КонецЕсли;
	
	бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока, Объект.Дата, Ложь);	
	
	Если текСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПоказанияПередЗаписью()
	
	ПоказанияПриборов = Объект.ПоказанияПриборовУчета;
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ПроверитьОшибкуПрофиля(ПоказанияПриборов);
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.КонтрольОшибкиДругойЗоны(ПоказанияПриборов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти