////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов" (сервер, переопределяемый).
// 
// Выполняется на сервере, изменяется под специфику прикладной конфигурации,
// но предназначен для использования только данной подсистемой.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна панель отчетов.
// В Разделы необходимо добавить метаданные тех подсистем 1го уровня,
// в которых размещены команды вызова панелей отчетов.
//
// Параметры:
//  Разделы	-	СписокЗначений	-	разделы в которые выведена команды открытия панели отчетов:
//   * Значение			-	ОбъектМетаданных: Подсистема	-	Метаданные подсистемы.
//   * Представление	-	Строка							-	Заголовок панели отчетов этого раздела.
//
// Пример:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Разделы.Добавить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы(),
	НСтр("ru = 'Главное'"));
	
	Разделы.Добавить(Метаданные.Подсистемы.энргБиллингРаботаСАбонентами,
	НСтр("ru= 'Отчеты по абонентам'"));
	
	Разделы.Добавить(Метаданные.Подсистемы.энргБиллингРаботаСМКД,
	НСтр("ru= 'Отчеты по мкд'"));
	
	Разделы.Добавить(Метаданные.Подсистемы.энргБиллингРасчетНачислений,
	НСтр("ru= 'Отчеты по начислениям'"));
	
	Разделы.Добавить(Метаданные.Подсистемы.энргБиллингПретензионноИсковаяДеятельность,
	НСтр("ru= 'Отчеты по ПИР'"));
		
КонецПроцедуры

// Определить объекты с командами отчетов.
//
// Параметры:
//  Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами отчетов.
//
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт 
	
	Объекты.Добавить(Метаданные.Документы.энргЗагрузкаДанныхИзВнешнихСистем);
	Объекты.Добавить(Метаданные.Документы.энргЗакрытиеПериода);
	Объекты.Добавить(Метаданные.Документы.энргНачислениеНаПрочиеУслуги);
	Объекты.Добавить(Метаданные.Документы.энргПоступлениеОплатыЧерезКонтроллера);
	Объекты.Добавить(Метаданные.Документы.энргРасчетДебиторскойЗадолженности);
	Объекты.Добавить(Метаданные.Документы.энргРегистрацияВременногоОтсутствия);
	Объекты.Добавить(Метаданные.Документы.энргРеестрСформированныхДебиторскихЗадолженностей);
	Объекты.Добавить(Метаданные.Документы.энргБанкротство);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьЗначениеТарифа);
	Объекты.Добавить(Метаданные.Документы.энргНачисление);
	Объекты.Добавить(Метаданные.Документы.энргНачислениеМКД);
	Объекты.Добавить(Метаданные.Документы.энргНачислениеПени);
	Объекты.Добавить(Метаданные.Документы.энргНачислениеПоРассрочке);
	Объекты.Добавить(Метаданные.Документы.энргПерерасчет);
	Объекты.Добавить(Метаданные.Документы.энргПерерасчетМКД);
	Объекты.Добавить(Метаданные.Документы.энргРаспределениеМКД);
	Объекты.Добавить(Метаданные.Документы.энргРегистрацияРазовыхНачислений);
	Объекты.Добавить(Метаданные.Документы.энргВводНачальныхОстатковМКД);
	Объекты.Добавить(Метаданные.Документы.энргОперацияСПриборомУчетаМКД);
	Объекты.Добавить(Метаданные.Документы.энргОперацияСУслугамиМКД);
	Объекты.Добавить(Метаданные.Документы.энргОткрытиеМКД);
	Объекты.Добавить(Метаданные.Документы.энргРегистрацияПоказанийМКД);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьВидБлагоустройстваМКД);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьВидДифференцированностиПриборУчетаМКД);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьЗначениеПлощадиМКД);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов);
	Объекты.Добавить(Метаданные.Документы.энргВводНачальныхОстатков);
	Объекты.Добавить(Метаданные.Документы.энргПриходныйКассовыйОрдер);
	Объекты.Добавить(Метаданные.Документы.энргОбходнойЛист);
	Объекты.Добавить(Метаданные.Документы.энргОперацияСЛицевымСчетом);
	Объекты.Добавить(Метаданные.Документы.энргОперацияСПриборомУчета);
	Объекты.Добавить(Метаданные.Документы.энргОперацияСУслугами);
	Объекты.Добавить(Метаданные.Документы.энргПлатежноеПоручениеВходящие);
	Объекты.Добавить(Метаданные.Документы.энргРегистрацияПоказанийАбонента);
	Объекты.Добавить(Метаданные.Документы.энргСменаПоставщика);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьВидБлагоустройстваАбонента);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьВидДифференцированностиПриборУчета);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьГруппуПотребителейАбонента);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьДатуПоверкиПУ);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьЗначениеПлощади);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьКоличествоКомнат);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьКоличествоПроживающих);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьКоличествоПрописанных);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьКоличествоСобственников);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьСтатусАбонентовОтключаемыхВНеполивнойСезон);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьФормулуРасчетаТочекУчета);
	Объекты.Добавить(Метаданные.Документы.энргУстановкаСнятиеОграничения);
	Объекты.Добавить(Метаданные.Документы.энргЭтапПретензионноИсковойДеятельности);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьТехническуюВозможностьУстановкиПУ);
	
	Объекты.Добавить(Метаданные.Документы.энргУстановитьНормуПотребленияПоУслуге);
	Объекты.Добавить(Метаданные.Документы.энргЗагрузкаДанныхИзВнешнихСистем);
	Объекты.Добавить(Метаданные.Документы.энргЗакрытиеПериода);
	Объекты.Добавить(Метаданные.Документы.энргНачислениеНаПрочиеУслуги);
	Объекты.Добавить(Метаданные.Документы.энргПоступлениеОплатыЧерезКонтроллера);
	Объекты.Добавить(Метаданные.Документы.энргРасчетДебиторскойЗадолженности);
	Объекты.Добавить(Метаданные.Документы.энргРегистрацияВременногоОтсутствия);
	Объекты.Добавить(Метаданные.Документы.энргРеестрСформированныхДебиторскихЗадолженностей);
	Объекты.Добавить(Метаданные.Документы.энргБанкротство);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьЗначениеТарифа); 	
	Объекты.Добавить(Метаданные.Документы.энргСменаТипаСобственности);
	Объекты.Добавить(Метаданные.Документы.энргРаспределениеПомещения);
	Объекты.Добавить(Метаданные.Документы.энргРегистрацияАварийностиСтроения);
	Объекты.Добавить(Метаданные.Документы.энргИзменитьФормуУправленияМКД);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьТехническийСтатусТочкиУчета);
	Объекты.Добавить(Метаданные.Документы.энргСоглашениеОПотребленииВПомещении);
	Объекты.Добавить(Метаданные.Документы.энргРасходныйКассовыйОрдер);
	Объекты.Добавить(Метаданные.Документы.энргПереносОплаты);
	
	Объекты.Добавить(Метаданные.Документы.энргАктированиеНедопускаДопускаВПомещение);
	//Объекты.Добавить(Метаданные.Документы.отэкДокументыОРЭМ);
	Объекты.Добавить(Метаданные.Документы.энргСоглашениеПоРассрочке);
	Объекты.Добавить(Метаданные.Документы.энргВводНачальныхОстатковПомещения);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьСхемуПодчиненностиТочекУчета);
	Объекты.Добавить(Метаданные.Документы.энргСменаПоставщикаМКД);
	Объекты.Добавить(Метаданные.Документы.энргНачислениеДляЛьготныхЛиц);
	Объекты.Добавить(Метаданные.Документы.энргИзменениеЭтажностиСтроения);
	Объекты.Добавить(Метаданные.Документы.энргИзменениеЛьготыЖильцам);
	Объекты.Добавить(Метаданные.Документы.энргУстановитьНазначениеПУ);

	
	// Подсистема 
	Объекты.Добавить(Метаданные.Документы.энргУстановитьНормуПотребленияПоУслуге);
	
	// Подсистема Претензионно-исковая деятельность
	Объекты.Добавить(Метаданные.Документы.энргЭтапПретензионноИсковойДеятельности);
	
	Объекты.Добавить(Метаданные.Документы.энргОбходнойЛистМКД);
		
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
//   В данной процедуре необходимо указать каким именно образом предопределенные варианты отчетов
//   будут регистрироваться в программе и показываться в панели отчетов.
//   НастройкиОтчета   = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.<ИмяОтчета>);
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.<ИмяОтчета>/Метаданные.Подсистемы.<ИмяПодсистемы>, Истина/Ложь);
//   ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.<ИмяОтчета>);
//
//   Данные функции получают соответственно настройки отчета и настройки варианта отчета следующей структуры:
//       * Включен - Булево -
//           Если Ложь, то вариант отчета не регистрируется в подсистеме.
//           Используется для удаления технических и контекстных вариантов отчетов из всех интерфейсов.
//           Эти варианты отчета по прежнему можно открывать в форме отчета программно при помощи
//           параметров открытия (см. справку по "Расширение управляемой формы для отчета.КлючВарианта").
//       * ВидимостьПоУмолчанию - Булево -
//           Если Ложь, то вариант отчета по умолчанию скрыт в панели отчетов.
//           Пользователь может "включить" его в режиме настройки панели отчетов
//           или открыть через форму "Все отчеты".
//       * Описание - Строка - Дополнительная информация по варианту отчета.
//           В панели отчетов выводится в качестве подсказки.
//           Должно расшифровывать для пользователя содержимое варианта отчета
//           и не должно дублировать наименование варианта отчета.
//           Используется при поиске.
//       * Размещение - Соответствие - Настройки размещения варианта отчета в разделах.
//           ** Ключ     - ОбъектМетаданных: Подсистема - Подсистема, в которой размещается отчет или вариант отчета.
//           ** Значение - Строка - Необязательный. Настройки размещения в подсистеме.
//               ""        - Выводить отчет в своей группе обычным шрифтом.
//               СВажный"  - Выводить отчет в своей группе жирным шрифтом.
//               ССмТакже" - Выводить отчет в группе "См. также".
//       * ФункциональныеОпции - Массив из Строка -
//            Имена функциональных опций варианта отчета.
//       * НастройкиДляПоиска - Структура - Дополнительные настройки для поиска этого варианта отчета.
//           Эти настройки необходимо задавать только если СКД не используется или используется не в полном объеме.
//           Например, СКД может использоваться только для параметризации и получения данных,
//           а вывод выполняться в фиксированный макет табличного документа.
//           ** НаименованияПолей - Строка - Имена полей варианта отчета. Разделитель имен: Символы.ПС.
//           ** НаименованияПараметровИОтборов - Строка - Имена настроек варианта отчета. Разделитель имен: Символы.ПС.
//       * ОпределитьНастройкиФормы - Булево - Отчет имеет программный интерфейс для тесной интеграции с формой отчета,
//           в том числе может переопределять некоторые настройки формы и подписываться на ее события.
//           Если Истина и отчет подключен к общей форме ФормаОтчета,
//           тогда в модуле объекта отчета следует определить процедуру по шаблону:
//               
//               // Настройки общей формы отчета подсистемы "Варианты отчетов".
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//               //       Неопределено когда вызов без контекста.
//               //   КлючВарианта - Строка, Неопределено - Имя предопределенного
//               //       или уникальный идентификатор пользовательского варианта отчета.
//               //       Неопределено когда вызов без контекста.
//               //   Настройки - Структура - см. возвращаемое значение
//               //       ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//               //
//               Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
//               	// Код процедуры.
//               КонецПроцедуры
//   Отчет выступает в качестве контейнера вариантов.
//     Изменяя настройки отчета можно сразу изменять настройки всех его вариантов.
//     Однако, если явно получить настройки варианта отчета, то они станут самостоятельными,
//     т.е. более не будут наследовать изменения настроек от отчета. См. пример 3.
//   
//   Начальная настройка размещения отчетов по подсистемам зачитывается из метаданных,
//     ее дублирование в коде не требуется.
//   
//   Функциональные опции варианта объединяются с функциональными опциями этого отчета по следующим правилам:
//     (ФО1_Отчета ИЛИ ФО2_Отчета) И (ФО3_Варианта ИЛИ ФО4_Варианта).
//   Функциональные опции отчетов не зачитываются из метаданных,
//     они применяются на этапе использования подсистемы пользователем.
//   Через ОписаниеОтчета можно добавлять функциональные опции, которые будут соединяться по указанным выше правилам,
//     но надо помнить, что эти функциональные опции будут действовать только для предопределенных вариантов отчетов.
//   Для пользовательских вариантов отчета действуют только функциональные опции отчета
//     - они отключаются только с отключением всего отчета.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Пример:
//
//  (1) Добавить в подсистему вариант отчета.
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "ИмяВарианта1");
//	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ИмяРаздела.Подсистемы.ИмяПодсистемы);
//
//  (2) Отключить вариант отчета.
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "ИмяВарианта1");
//	Вариант.Включен = Ложь;
//
//  (3) Отключить все варианты отчета, кроме требуемого.
//	Отчет = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	Отчет.Включен = Ложь;
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Отчет, "ИмяВарианта");
//	Вариант.Включен = Истина;
//
//  (4) Заполнить наименования полей, параметров и отборов:
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчетаБезСхемы, "");
//	Вариант.НастройкиДляПоиска.НаименованияПолей =
//		НСтр("ru = 'Контрагент
//		|Договор
//		|Ответственный
//		|Скидка
//		|Дата'");
//	Вариант.НастройкиДляПоиска.НаименованияПараметровИОтборов =
//		НСтр("ru = 'Период
//		|Ответственный
//		|Контрагент
//		|Договор'");
//
//  (5) Переключить режим вывода в панели отчетов:
//  (5.1) По отчетам:
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.ИмяОтчета, "ПоОтчетам");
//  (5.2) По вариантам:
//	Отчет = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Отчет, "ПоВариантам");
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргКарточкаАбонента);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Карточка абонента'");
	УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
			
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргВедомостьРеализацииПоНачислению);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показывает объем реализации за выбранный период'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.энргБиллингРасчетНачислений.Подсистемы.ИндивидуальныеНачисления);
	 	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргОборотноСальдоваяВедомость);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Остатки задолженности на начало и на конец периода и суммы оборотов за период.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.энргБиллингРасчетНачислений.Подсистемы.ИндивидуальныеНачисления);

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргОтчетОПроделаннойРаботе);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Предоставляет данные о количестве событий произошедших в рамках периода.'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.энргБиллингРасчетНачислений.Подсистемы.ИндивидуальныеНачисления);
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргОтчетПоНормамЗаПериод);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показывает объем начисленных услуг рассчитанных по нормативу.'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показывает предполгаемые начисления, до моменты фактического расчета'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРеестрОплатыПоКассе);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показывает денежные средства поступившие в кассу предприятия'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.энргБиллингРаботаСАбонентами.Подсистемы.Оплата);

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРеестрПереданныхИсполнительныхДокументов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показывает данные переданные в юридический отедел.'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРеестрыДокументов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Реестр документов по абонентам за выбранный период'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргОтчетПоПоступлениюДенежныхСредствЗачетАвансов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Отображает общий объем денежных средств поступших от абонентов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСписокДолжников);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показывает абонентов имеющих задолженность на выбранный момент времени'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСписокПриборовУчета);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показывает приборы учета установленные у абонентов на выбранный момент времени'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргБалансПоМКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Баланс по МКД'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРеестрУправляющихКомпаний);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Реестр УК'");
	
	//ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргАнализЕжедневныхПоступлений);
	//ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	//ОписаниеВарианта.Описание = НСтр("ru= 'Анализ платежей'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргОбъемРеализации);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Объем реализации'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРаспределениеПлатежейПоСчетам);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Распределение платежей по счетам'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСводнаяВедомость);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Сводная ведомость'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРеестрУстановленныхСчетчиков);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Реестр установленных счетчиков'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргДанныеПоСчетчикамСПревышениемСрокаПоверки);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Данные по приборам учета, у которых превышен срок поверки'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСписокАбонентовПоКоторымНетРасчета);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Список абонентов, по которым нет расчета'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСписокАбонентовСКредиторкой);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Список абонентов с кредиторкой'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСписокАбонентовСРасчетомПоСреднему);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Список абонентов с расчетом по среднему'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргАнализФактическогоПотребленияПоЖилымДомам);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Анализ фактического потребления по жилым домам'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРеестрПлатежей);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Реестр платежей'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСверкаЛицевыхСчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Сверка лицевых счетов'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргДанныеОВосстановленииПоследовательности);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Данные о восстановлении последовательности'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргИнформацияПоЗадолженности);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Информация по задолженности'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргРаспределениеАвансовПредыдущихПериодов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Распределение авансов предыдущих периодов'");
	
	//ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргПроверкаНачислений);
	//ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	//ОписаниеВарианта.Описание = НСтр("ru= 'Проверка начислений'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргВыпискаИзЛС);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Выписка из ЛС'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргОтчетПоРаботеСотрудниковЮридическогоОтдела);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Отчет по работе сотрудников юридического отдела'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргСледующиеЗаседанияЮристов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Следующие заседания юристов'");

	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргЗадачиИЭтапыПИД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Задачи и этапы ПИД'");
	
	ОписаниеОтчета 		= ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.бестПоказанияПриборовУчета);
	ОписаниеВарианта 	= ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Показания ПУ'");
	
	ОписаниеОтчета 		= ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргОтчетПоКорректировкеГодовогоОбъема);
	ОписаниеВарианта 	= ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Отчет по корректировке годового объема'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.энргБиллингРасчетНачислений.Подсистемы.ИндивидуальныеНачисления);
	
	ОписаниеОтчета 		= ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргАнализЕжедневныхПоступлений);
	ОписаниеВарианта 	= ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru= 'Анализ ежедневных поступлений'");
	ОписаниеВарианта.Размещение.Вставить(Метаданные.Подсистемы.энргБиллингРаботаСАбонентами.Подсистемы.Оплата);
		
	ОписаниеОтчета 		= ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.энргЗадолженностьПоМесяцам);
	НастройкиВарианта 	= ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗадолженностьПоМесяцам");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.энргБиллингРасчетНачислений.Подсистемы.ИндивидуальныеНачисления);
	
КонецПроцедуры

// Содержит описания изменений имен вариантов отчетов. Используется
//   при обновлении информационной базы, в целях контроля ссылочной целостности
//   и для сохранения настроек варианта, сделанных администратором.
//   Старое имя варианта резервируется и не может быть использовано в дальнейшем.
//   Если изменений было несколько, то каждое изменение необходимо зарегистрировать,
//   указывая в актуальном имени варианта последнее (текущее) имя варианта отчета.
//   Поскольку имена вариантов отчетов не выводятся в пользовательском интерфейсе,
//   то рекомендуется задавать их таким образом, что бы затем не менять.
//   В Изменения необходимо добавить описания изменений имен вариантов
//   отчетов, подключенных к подсистеме.
//
// Параметры:
//   Изменения - ТаблицаЗначений - Таблица изменений имен вариантов. Колонки:
//       * Отчет - ОбъектМетаданных - Метаданные отчета, в схеме которого изменилось имя варианта.
//       * СтароеИмяВарианта - Строка - Старое имя варианта, до изменения.
//       * АктуальноеИмяВарианта - Строка - Текущее (последнее актуальное) имя варианта.
//
// Пример:
//	Изменение = Изменения.Добавить();
//	Изменение.Отчет = Метаданные.Отчеты.<ИмяОтчета>;
//	Изменение.СтароеИмяВарианта = "<СтароеИмяВарианта>";
//	Изменение.АктуальноеИмяВарианта = "<АктуальноеИмяВарианта>";
//
Процедура ЗарегистрироватьИзмененияКлючейВариантовОтчетов(Изменения) Экспорт
	
КонецПроцедуры

// Глобальные настройки, применяемые как умолчания для объектов подсистемы.
//
// Параметры:
//   Настройки - Коллекция настроек подсистемы. Реквизиты:
//       * ВыводитьОтчетыВместоВариантов - Булево - Умолчание для вывода гиперссылок в панели отчетов:
//           - Истина - Варианты отчетов по умолчанию скрыты, а отчеты включены и видимы.
//           - Ложь   - Значение по умолчанию. Варианты отчетов по умолчанию видимы, а отчеты отключены.
//       * ВыводитьОписания - Булево - Умолчание для вывода описаний в панели отчетов:
//           - Истина - Значение по умолчанию. Выводить описания в виде подписей под гиперссылками вариантов
//               (режим чтения описаний).
//           - Ложь   - Выводить описания в виде всплывающих подсказок
//               (как раньше).
//       * Поиск - Структура - Настройки поиска вариантов отчетов.
//           * ПодсказкаВвода - Строка - Текст подсказки выводится в поле поиска когда поиск не задан.
//               В качестве примера рекомендуется указывать часто используемые термины прикладной конфигурации.
//       * ДругиеОтчеты - Структура - Настройки формы "Другие отчеты":
//           * ЗакрыватьПослеВыбора - Булево - Закрывать ли форму после выбора гиперссылки отчета.
//               - Истина - Значение по умолчанию. Закрывать "Другие отчеты" после выбора.
//               - Ложь   - Не закрывать.
//           * ПоказыватьФлажок - Булево - Показывать ли флажок ЗакрыватьПослеВыбора.
//               - Истина - Показывать флажок "Закрывать это окно после перехода к другому отчету".
//               - Ложь   - Значение по умолчанию. Не показывать флажок.
//
// Пример:
//	Настройки.Поиск.ПодсказкаВвода = НСтр("ru = 'Например, себестоимость'");
//	Настройки.ДругиеОтчеты.ЗакрыватьПослеВыбора = Ложь;
//	Настройки.ДругиеОтчеты.ПоказыватьФлажок = Истина;
//
Процедура ОпределитьГлобальныеНастройки(Настройки) Экспорт
	
	
	
КонецПроцедуры

#Область ДвиженияДокумента

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандуДвиженияДокумента(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ДвиженияДокумента) Тогда		
		КомандаОтчет 				= КомандыОтчетов.Добавить(); 		
		КомандаОтчет.Идентификатор 	= Метаданные.Отчеты.ДвиженияДокумента.ПолноеИмя();
		КомандаОтчет.Представление 	= НСтр("ru = 'Движения документа'");
		КомандаОтчет.Порядок       	= 50;
		КомандаОтчет.Картинка 		= БиблиотекаКартинок.Отчет;			
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти

#Область СтруктураПодчиненности

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаменитьЗаголовокПериодаФормыБСП(ЭтаФорма, ПараметрыЗаполнения) Экспорт 
	
	// переопределено в расширении
		
КонецПроцедуры

Процедура УстановитьВажностьВариантаОтчета(ОписаниеВарианта, Важность, Подсистема = Неопределено) Экспорт
	
	Если ВажностьУказанаВерно(Важность) Тогда
		Размещение = ОписаниеВарианта.Размещение.Получить(Подсистема);
		
		Если Не Размещение = Неопределено Тогда
			ОписаниеВарианта.Размещение.Вставить(Подсистема, Важность);
		Иначе
			Для Каждого Размещение Из ОписаниеВарианта.Размещение Цикл 
				ОписаниеВарианта.Размещение.Вставить(Размещение.Ключ, Важность);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет строку на содержание параметров важности
//
// Параметры:
//  Важность   - (Строка)
//
// Возвращаемое значение: 
//  Булево   - Истина, если переданная строка равна одному из значений:
//               	|- ""        - Вывод отчета в своей группе обычным шрифтом.
//               	|- "Важный"  - Вывод отчета в своей группе жирным шрифтом.
//               	|- "СмТакже" - Вывод отчета в группе "См. также".
//             Ложь, в ином случае
//
Функция ВажностьУказанаВерно(Важность)
	
	Возврат ПустаяСтрока(Важность) Или Важность = "Важный" Или Важность = "СмТакже";
	
КонецФункции

#КонецОбласти