#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	СоставУслуги = Новый Массив;
	Для Каждого СтрокаСостава Из Услуги Цикл
		СоставУслуги.Добавить(СтрокаСостава.Услуга);
	КонецЦикла;
	ЭтоНовый  	= ЭтоНовый();
	ХэшСумма 	= энргОбщегоНазначения.КонтрольнаяСумма(СоставУслуги);
	
	ДополнительныеСвойства.Вставить("ОбновитьХэшСумму", ЭтоНовый);
	
	Если НЕ ЭтоНовый И НЕ Ссылка.ХэшСумма = ХэшСумма Тогда		
		ДополнительныеСвойства.ОбновитьХэшСумму = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("ОбновитьХэшСумму") И ДополнительныеСвойства.ОбновитьХэшСумму Тогда;
		Набор 							= РегистрыСведений.энргУникальныеФормулыРасчетаНорматива.СоздатьНаборЗаписей();
		Набор.Отбор.Услуга.Установить(Услуга);
		Запись  						= Набор.Добавить();
		Запись.Услуга 					= Услуга;
		Запись.ХэшСумма 				= ХэшСумма;
		Запись.ФормулаРасчетаНорматива 	= Ссылка;	
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли