#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ИзменяемыеПараметрыРасчета() Экспорт
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключ,Ресурсы","ТочкаУчета","ИспользоватьДиаметрСечения,ДиаметрСечения"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт
	перем Пакет;
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли