#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Район") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(МораторнаяЗадолженность,"Район", Параметры.Район);
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(МораторнаяЗадолженность,"Организация", Параметры.Организация);
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(МораторнаяЗадолженность,"Договор", Параметры.Договор);
	КонецЕсли;
	Если Параметры.Свойство("КонецПериода") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(МораторнаяЗадолженность,"КонецПериода", Параметры.КонецПериода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МораторнаяЗадолженностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.бестПлатежныйДокумент.ФормаОбъекта", Новый Структура("Ключ", Элементы.МораторнаяЗадолженность.ТекущиеДанные.ПлатежныйДокумент));
КонецПроцедуры

#КонецОбласти
