#Область ПрограммныйИнтерфейс

// Начисляет.
//
// Параметры:
//  Делегат		-	ОбработкаОбъект.энргДелегатНачислений.
//
Процедура Начислить(Делегат) Экспорт
	
	Если Делегат.ПроверятьДатуЗапретаИзменения Тогда
		Отказ = ПроверитьДатуЗапретаИзменения(Делегат.Организация, Делегат.Район, Делегат.ПериодНачисления);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПолучаемыеНаборы 	= Новый Массив;
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ЗначенияКлючейПомещений",									"ЗначенияКлючейПомещений"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","СпособыРасчетаПоНаправлениям",								"СпособыРасчетаПоНаправлениям"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ПоставщикиНеНачислять",										"ПоставщикиНеНачислять"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ЗначенияПовышающихКоэффициентов",							"ЗначенияПовышающихКоэффициентов"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ЗначенияТекущихНормПотребления",								"ЗначенияТекущихНормПотребления"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ЗначенияТекущихСоциальныхНормПотребления",					"ЗначенияТекущихСоциальныхНормПотребления"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ЗначенияТекущихТарифов",										"ЗначенияТекущихТарифов"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ИзменениеТарифовВПериоде",									"ИзменениеТарифовВПериоде"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НастройкаНачисленияГВСМКД",									"НастройкаНачисленияГВСМКД"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ТипСхемыГВС",												"ТипСхемыГВС"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ТипПринадлежностиМКД",										"ВидыТепловыхПунктов"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НастройкаСезонностиУслуг",									"НастройкаСезонностиУслуг"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НормаСкоростиДвиженияВоды",									"НормаСкоростиДвиженияВоды"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ПериодыСезонности",											"ПериодыСезонности"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ДокументыНачислений",										"ДокументыНачислений"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","СреднийОбъемПотребленияАбонентов",							"СреднееПотреблениеАбонентов"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","СтабильныеПериодыШкалы",										"СтабильныеПериодыШкалы"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","СтабильныеПериодыИзмерителиНаправлений",						"СтабильныеПериодыИзмерителиНаправлений"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","МаксимальныеПоказанияСрезПредыдущийПериод",					"МаксимальныеПоказанияСрезПредыдущийПериод"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","МаксимальныеПоказанияСрез",									"МаксимальныеПоказания"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ПредоставленныеПоказания",									"ПредоставленныеПоказания"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ЗначениеПлощадейМКД",										"ЗначениеПлощадейМКД"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ЗначениеИндивидуальныхПлощадей",								"ЗначениеИндивидуальныхПлощадей"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НаличиеПриборовУчетаСНачалаГода",							"НаличиеПриборовУчетаСНачалаГода"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ДанныеСтабильныхПериодов",									"СтабильныеПериодыНачало"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ДниИспользованияУслугПриОтсутствии",							"ДниИспользованияУслугПриОтсутствии"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ПроцентВетхостиСтроений",									"ПроцентВетхостиСтроений"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ДеньНачалаНачисленияПоСреднему",								"ДеньНачалаНачисленияПоСреднему"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ВидыДифференцированностиТарифныеЗоны",						"ВидыДифференцированностиТарифныеЗоны"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НастройкиРасчетовПриРегистрацииАктаНедопуска",				"НастройкиРасчетовПриРегистрацииАктаНедопуска"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НастройкиСниженияСтоимостиУслуг",							"НастройкиСниженияСтоимостиУслуг"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","УвеличениеСниженияСтоимостиУслуг",							"УвеличениеСниженияСтоимостиУслуг"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","СостояниеВыполненияОбязанностейГарантирующегоПоставщика",	"ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ДниИспользованияУслугПриВременномОтключенииУслуги",			"ДниИспользованияУслугПриВременномОтключенииУслуги"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НазначенияПриборовУчета",									"НазначенияПриборовУчета"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НастройкаПримененияТарифаВРазрезеКомнат",					"НастройкаПримененияТарифаВРазрезеКомнат"));
	
	МВТ  								= Новый МенеджерВременныхТаблиц; 	
	Делегат.Инициализировать(МВТ,ПолучаемыеНаборы);
	ДокументНачисленияПустаяСсылка  	= Делегат.ДокументНачисленияПустаяСсылка();
	РезультатЗапроса 					= РезультатЗапросаИндивидуальныеНачисления(МВТ, ДокументНачисленияПустаяСсылка); 	
		
	ОбработатьРезультатЗапросаНачислений(РезультатЗапроса, Делегат);
		
КонецПроцедуры

// Распределяет объем МКД.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Строение			-	СправочникСсылка.энргСтроения.
//  Документ			-	ДокументОбъект.
//
Процедура РаспредениеОбъемаМКД(Организация,ПериодНачисления, Район, Строение, Документ)  Экспорт 
	Перем ТекСтроение, ТекУслуга, НаборЗаписей, НаборОтрицательныйОбъемРаспределения, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейСверхНорма, ТекМКДАбонентов, ТекУслугаАбонентов,
	ДокументОбъект, ДанныеПоУслуге, НаборВыполненные, ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам;
	
	Ошибки = Новый Массив;
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураМКД_УК = Новый Соответствие;
	
	РаспредениеОбъемаМКД_УК(Организация, ПериодНачисления, Район, Строение, Документ, СтруктураМКД_УК);
		
	ГраницыПериода  						= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);	
	ГраницыПериодаЮЛ  						= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);	
	
	ВспомогательныеПараметры 				= Новый Структура("КонецПериодаРасчета", ГраницыПериода.ЗавершениеОП);
	МВТ 									= Новый МенеджерВременныхТаблиц;
	ПрочитатьНормативныеДанныеРаспределения(МВТ,Организация,ПериодНачисления,Район,ГраницыПериода);
	ПрочитатьДокументыДляРаспределения(МВТ,Организация,ПериодНачисления,Район,Строение,ГраницыПериода);
	ПрочитатьСозданныеДокументыИндивидуальныхНачислений(МВТ, Организация, ПериодНачисления, Район, Строение, ГраницыПериода.ЗавершениеОП - 1);
	ПрочитатьОбъемыНачисленийМКДДляРаспределения(МВТ,Организация,ПериодНачисления,Район,Строение,ГраницыПериода, ГраницыПериодаЮЛ);
	ПрочитатьВспомогательныеДанныеРаспределениеМКД(МВТ,Организация,ПериодНачисления,Район,Строение,ВспомогательныеПараметры);
	
	Запрос 									= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 			= МВТ;
	Запрос.Текст 							= ТекстЗапросаДанныеДляРаспределения(Строение);
	
	Результат  								= Запрос.ВыполнитьПакет();
	ВыборкаЗначенияТарифов 					= Результат[1].Выбрать();
	ВыборкаОбъемМКД							= Результат[2].Выбрать();
	ВыборкаАбоненты							= Результат[3].Выбрать(); 
	ВыборкаОбъемПоПриборуКорректировать		= Результат[4].Выбрать();
	ВыборкаРазделенныеЛицевыеСчета			= Результат[5].Выбрать();
	ВыборкаОбъемПоПриборуНПКорректировать	= Результат[6].Выбрать();
	ВыборкаОтрицательныйОбъемРаспределения	= Результат[7].Выгрузить();
    тзЗначенияСоциальныхНормативов 			= Результат[8].Выгрузить();
	ВыборкаДокументыРаспределения			= Результат[9].Выбрать();
		
	Пока ВыборкаДокументыРаспределения.Следующий() Цикл 
		ОчиститьНаборыЗаписейПриРаспределении(ВыборкаДокументыРаспределения);
	КонецЦикла;
	
	РазделенныеЛицевыеСчета 				= Новый Соответствие;
	КлючРазделенныеЛицевыеСчета 			= "Абонент,ЗначениеПлощади,СпособРаспределенияОбъемаПомещения,ФиксированныйОбъемПотребления,
	|ДоляПотребленияЧислитель,ДоляПотребленияЗнаменатель,КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников,КоличествоЧеловек,ТарифнаяГруппа,Поставщик,ЗначениеСоциальнойНормы,ДопСоциальнаяНормаПотребления";
			
	Если ВыборкаОбъемМКД.Количество() = 0 Тогда
		РазделЗаписи 						= Перечисления.энргРазделыЗаписи.РаспределениеМКД;
		РегистрыСведений.энргОтложенныеДвиженияДокументов.УдалосьОчиститьНаборЗаписей(Организация,Район, ПериодНачисления, РазделЗаписи, Строение);		
		Возврат;
	КонецЕсли;
	
	ЗначенияТарифов 							= ХэшТаблицаЗначенийТарифа(ВыборкаЗначенияТарифов);
		
	ВыборкаАбоненты.Следующий();
	ВыборкаОбъемПоПриборуНПКорректировать.Следующий();
	//ВыборкаОтрицательныйОбъемРаспределения.Следующий();
	
	ЕстьРазделенныеЛицевыеСчета 				= ВыборкаРазделенныеЛицевыеСчета.Следующий();
	
	Отказ 										= Ложь;
	ТипыНачислений 								= энргНачисления.ТипыРасходовВФормулахРасчета();
	ТекстИсключения		 						= "";
	//ИспользоватьТарифРек 						= Ложь;
	//Если РегистрыСведений.энргИспользованиеТарифовРЭК.ПолучитьПоследнее(ГраницыПериода.ЗавершениеОП-1,Новый Структура("Организация,Район",Организация, Район)).ПрименятьТарифРЭК Тогда
	//	ИспользоватьТарифРек 					= Истина;
	//КонецЕсли;  	
	
	РаспределениеОбъемаПоУслугам 				= Новый Соответствие;
	РаспределениеОбъемаПоУслугамПотребленный 	= Новый Соответствие;
	
	Пока ВыборкаОбъемМКД.Следующий() Цикл
		
		Если НЕ ТекСтроение = ВыборкаОбъемМКД.Строение 
			ИЛИ НЕ ТекУслуга = ВыборкаОбъемМКД.Услуга Тогда
												
			Если Не ТекУслуга  = Неопределено Тогда				
				Если ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда
					
					Попытка
						РаспределитьОбъемПоУслугеМКД(ПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугам, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейСверхНорма);
						РаспределитьОбъемПотребленныйПоУслугеМКД(ПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугамПотребленный, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма);	
					Исключение
						Отказ = Истина;
						Инфо = ИнформацияОбОшибке();
						Ошибки.Добавить(ПодробноеПредставлениеОшибки(Инфо));
					КонецПопытки;
					
				КонецЕсли;
				
				Если НЕ Отказ Тогда
					ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, ТекУслуга, НачисленияПоУслугам);
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ТекСтроение = ВыборкаОбъемМКД.Строение Тогда
				
				Если НЕ ТекСтроение = Неопределено Тогда
					
					Если НЕ Отказ Тогда
						// Рассчитываем норматив
						РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив,НачисленияПоУслугам,ЗначенияТарифов,ГраницыПериода,Отказ,НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП);
					КонецЕсли;
					
					ЗаписатьНаборыЗаписейПриРаспределении(Отказ, ДокументОбъект, ТекстИсключения, НаборВыполненные, НаборОтрицательныйОбъемРаспределения,НаборЗаписей, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейПомещений, НаборЗаписейСверхНорма);
					
				КонецЕсли;
				
				НачатьТранзакцию();
				// запоминаем свойства разделенных лицевых счетов по услугам
				РаспределениеОбъемаПоУслугам 	= Новый Соответствие;
				Отказ 							= Ложь;
				РассчитыватьНорматив 			= Новый Массив;
				ПараметрыРасчетаНорматива 		= Новый Соответствие;
				РазделенныеЛицевыеСчета 		= Новый Соответствие;
				НачисленияПоУслугам 			= Новый Соответствие;
				Если ЕстьРазделенныеЛицевыеСчета Тогда
					ЗаполнитьРазделенныеЛицевыеСчета(КлючРазделенныеЛицевыеСчета, РазделенныеЛицевыеСчета, ВыборкаРазделенныеЛицевыеСчета, ВыборкаОбъемМКД, тзЗначенияСоциальныхНормативов);					
				КонецЕсли; 				
			КонецЕсли;			
			
	       	ДанныеПоУслуге = ДанныеПоУслугиДляРаспределения(ВыборкаОбъемМКД, РазделенныеЛицевыеСчета);
			
			ЗаполнитьДанныеАбонентовДляРаспределения(ДанныеПоУслуге, ВыборкаАбоненты, ВыборкаОбъемМКД, ВыборкаОтрицательныйОбъемРаспределения, ВыборкаОбъемПоПриборуКорректировать, ВыборкаОбъемПоПриборуНПКорректировать);
						
			Если НЕ ТекСтроение = ВыборкаОбъемМКД.Строение Тогда
				ПрочитатьНаборыДляЗаписиПриРаспределении(ВыборкаОбъемМКД, ДокументОбъект, НаборВыполненные, НаборЗаписей, НаборОтрицательныйОбъемРаспределения, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейСверхНорма, ГраницыПериода);
			КонецЕсли;		
		КонецЕсли;
		
		ЗаполнитьОбъемыМКДПриРаспределении(ВыборкаОбъемМКД, ДанныеПоУслуге);
		
		ТекСтроение								= ВыборкаОбъемМКД.Строение;
		ТекУслуга 								= ВыборкаОбъемМКД.Услуга; 
		
	КонецЦикла; 	
	
	Если Не ТекСтроение = Неопределено Тогда		
		
		Если ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда
			
			Попытка
				РаспределитьОбъемПоУслугеМКД(ПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугам, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейСверхНорма);
				РаспределитьОбъемПотребленныйПоУслугеМКД(ПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугамПотребленный, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма);
			Исключение
				Отказ = Истина;
				Инфо = ИнформацияОбОшибке();
				Ошибки.Добавить(ПодробноеПредставлениеОшибки(Инфо));
			КонецПопытки;
			
		КонецЕсли;		
		
		Если НЕ Отказ Тогда
			ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, ТекУслуга, НачисленияПоУслугам);
			РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам, ЗначенияТарифов, ГраницыПериода, Отказ, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП);
		КонецЕсли;
		
		ЗаписатьНаборыЗаписейПриРаспределении(Отказ, ДокументОбъект, ТекстИсключения, НаборВыполненные, НаборОтрицательныйОбъемРаспределения,НаборЗаписей, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейПомещений, НаборЗаписейСверхНорма);
		
	КонецЕсли;
	
	Если Ошибки.Количество() > 0 Тогда   
		СтрокаИсключения = СтрСоединить(Ошибки, Символы.ПС);
		ВызватьИсключение СтрокаИсключения;
	КонецЕсли;
	
КонецПроцедуры

// Распределяет объем МКД УК.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  МКД					-	СправочникСсылка.энргСтроения.
//  Документ			-	ДокументОбъект.
//  СтруктураМКД_УК		-	Соответствие.
//
Процедура РаспредениеОбъемаМКД_УК(Организация,ПериодНачисления, Район,МКД, Документ,СтруктураМКД_УК)  Экспорт 
	
	ГраницыПериодаФЛ  				= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления, Ложь);
	ГраницыПериодаЮЛ  				= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления, Ложь);
	МВТ 							= Новый МенеджерВременныхТаблиц;
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);  
	Запрос.УстановитьПараметр("Дата",				ГраницыПериодаЮЛ.ЗавершениеОП-1);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Строение",			МКД);
	Запрос.УстановитьПараметр("НачалоПериодаФЛ",	ГраницыПериодаФЛ.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериодаФЛ",		ГраницыПериодаФЛ.ЗавершениеОП);
	Запрос.УстановитьПараметр("НачалоПериодаЮЛ",	ГраницыПериодаЮЛ.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериодаЮЛ",		ГраницыПериодаЮЛ.ЗавершениеОП);
	Запрос.Текст = ТекстРаспределениеУК();
	
	
	Если НЕ ЗначениеЗаполнено(МКД) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргРаспределениеМКД.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргОтложенныеДвиженияДокументов.Строение = &Строение","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериодыМКД.Строение = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериоды.Строение = &Строение)","");		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Строение = &Строение","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (бестОбъектыРасчета.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И МКД = &Строение","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериоды.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргНомераСтрокСтабильногоПериода.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргСтабильныеПериодыМКД.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (энргДокументыНачислений.МКД = &Строение)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргФормыУправленияМКД.МКД = &Строение","");		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СхемыДоначисленияМКД 					= РезультатЗапроса[РезультатЗапроса.Количество()-4].Выгрузить();
	СхемыДоначисленияМКД.Сортировать("МКД,ДоговорВладелец,ОбъектРасчетаВладелец,Услуга,НомерПП");
	ОбъемыДляДоначисленияМКД 				= РезультатЗапроса[РезультатЗапроса.Количество()-3].Выгрузить();
	ВыборкаМКД 								= РезультатЗапроса[РезультатЗапроса.Количество()-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЗОтрицательныйОбъемРаспределения 		= РезультатЗапроса[РезультатЗапроса.Количество()-1].Выгрузить();
	
	Пока ВыборкаМКД.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаМКД.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ВыборкаМКД.ДокументНачисления) Тогда
			ДокументОбъект = ВыборкаМКД.ДокументНачисления.ПолучитьОбъект();
			
			НаборОтрицательныйОбъем					= РегистрыНакопления.энргОтрицательныйОбъемРаспределенияМКД.СоздатьНаборЗаписей();
			НаборОтрицательныйОбъем.Отбор.Регистратор.Установить(ВыборкаМКД.ДокументНачисления);
			НаборОтрицательныйОбъем.Записать();
			
			НаборОбъемНачисленийНП					= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
			НаборОбъемНачисленийНП.Отбор.Регистратор.Установить(ВыборкаМКД.ДокументНачисления);
			НаборОбъемНачисленийНП.Записать();
			
			НаборОбъемНачисленийЭлектроэнергии					= РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.СоздатьНаборЗаписей();
			НаборОбъемНачисленийЭлектроэнергии.Отбор.Регистратор.Установить(ВыборкаМКД.ДокументНачисления);
			НаборОбъемНачисленийЭлектроэнергии.Записать();
		Иначе
			ДокументОбъект = Документы.бестНачислениеОбъемовУК.СоздатьДокумент();	
		КонецЕсли; 
		
		ДокументОбъект.Организация 		= Организация;
		ДокументОбъект.МКД 				= ВыборкаМКД.МКД;
		ДокументОбъект.Район 			= Район;
		ДокументОбъект.Дата				= ГраницыПериодаЮЛ.ЗавершениеОП-1; 
		ДокументОбъект.Записать();
				
		НаборОтрицательныйОбъемРаспределения 		= РегистрыНакопления.энргОтрицательныйОбъемРаспределенияМКД.СоздатьНаборЗаписей();
		НаборОтрицательныйОбъемРаспределения.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
		
		НаборОбъемНачисленийНП 		= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
		НаборОбъемНачисленийНП.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);

		НаборОбъемНачисленийЭлектроэнергии 		= РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.СоздатьНаборЗаписей();
		НаборОбъемНачисленийЭлектроэнергии.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Не ВыборкаДетальныеЗаписи.РасчетОбъемовВыполняетУК Тогда
				Если ВыборкаДетальныеЗаписи.ОбъемУслуги < 0 Тогда
					СтрокаНабораОтрицательный  							= НаборОтрицательныйОбъемРаспределения.ДобавитьПриход();
					ЗаполнитьЗначенияСвойств(СтрокаНабораОтрицательный, ВыборкаДетальныеЗаписи,,"ОбъемУслуги");
					СтрокаНабораОтрицательный.Период	 				= ДокументОбъект.Дата;
					СтрокаНабораОтрицательный.ОбъемУслуги				= ?(ВыборкаДетальныеЗаписи.ОбъемУслуги < 0, -ВыборкаДетальныеЗаписи.ОбъемУслуги, 0);
					СтрокаНабораОтрицательный.ПериодРасчета 			= ПериодНачисления;
				КонецЕсли;				
				ОбъемУслуги 			= ПолучитьОбъемСУчетомОтрицательногоРаспределенияУК(ВыборкаДетальныеЗаписи, ТЗОтрицательныйОбъемРаспределения, НаборОтрицательныйОбъемРаспределения, ДокументОбъект.Дата, "ОбъемУслуги");
			Иначе
				ОбъемУслуги 			= ВыборкаДетальныеЗаписи.ОбъемУслуги;
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ИспользоватьРасчетЭлектроэнергии Тогда
				Запись = НаборОбъемНачисленийЭлектроэнергии.Добавить();
			Иначе
				Запись = НаборОбъемНачисленийНП.Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Запись,ВыборкаДетальныеЗаписи);
			Запись.ОбъемУслуги		= ОбъемУслуги;
			Запись.Период			= ДокументОбъект.Дата;
			Запись.ВидНачисления	= Перечисления.энргВидыНачислений.Начисление;
			Запись.Распределение	= Истина;
			Запись.НачалоПериода    = ГраницыПериодаЮЛ.НачалоОП;
			Запись.КонецПериода		= ГраницыПериодаЮЛ.ЗавершениеОП;
			Запись.ПериодРасчета	= ПериодНачисления;	
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗначениеТарифа) Тогда
				Если ВыборкаДетальныеЗаписи.НДСВнутри Тогда
					Запись.Сумма 	= ОбъемУслуги * ВыборкаДетальныеЗаписи.ЗначениеТарифа;
					Запись.СуммаНДС = Запись.Сумма * ВыборкаДетальныеЗаписи.СтавкаНДС / (100 + ВыборкаДетальныеЗаписи.СтавкаНДС);
				Иначе
					Запись.Сумма 	= ОбъемУслуги * ВыборкаДетальныеЗаписи.ЗначениеТарифа + ОбъемУслуги * ВыборкаДетальныеЗаписи.ЗначениеТарифа * ВыборкаДетальныеЗаписи.СтавкаНДС / 100;
					Запись.СуммаНДС = ОбъемУслуги * ВыборкаДетальныеЗаписи.ЗначениеТарифа * ВыборкаДетальныеЗаписи.СтавкаНДС / 100;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.РасчетОбъемовВыполняетУК И Не ВыборкаДетальныеЗаписи.ИспользоватьРасчетЭлектроэнергии Тогда
				// снимаем с головы
				ЗаписьСторно = НаборОбъемНачисленийНП.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьСторно, Запись);
				ЗаписьСторно.ОбъемПоПрибору					= -ЗаписьСторно.ОбъемПоПрибору;
				ЗаписьСторно.ОбъемУслуги					= -ЗаписьСторно.ОбъемУслуги;
				ЗаписьСторно.ОбъемУслугиПотребленный		= -ЗаписьСторно.ОбъемУслугиПотребленный;
				ЗаписьСторно.КоличествоЧасовШтатнойРаботыПУ	= -ЗаписьСторно.КоличествоЧасовШтатнойРаботыПУ;
				ЗаписьСторно.ОбъемДосчитанный				= -ЗаписьСторно.ОбъемДосчитанный;
				ЗаписьСторно.ОбъемМГВ						= -ЗаписьСторно.ОбъемМГВ;
				ЗаписьСторно.КоличествоЧасовРаботыТУ		= -ЗаписьСторно.КоличествоЧасовРаботыТУ;
				ЗаписьСторно.Сумма							= -ЗаписьСторно.Сумма;
				ЗаписьСторно.СуммаНДС						= -ЗаписьСторно.СуммаНДС;
				
				// распределяем
				Отбор = Новый Структура("МКД,ДоговорВладелец,ОбъектРасчетаВладелец,Услуга", ВыборкаДетальныеЗаписи.МКД, ВыборкаДетальныеЗаписи.Договор, ВыборкаДетальныеЗаписи.ОбъектРасчета,ВыборкаДетальныеЗаписи.Услуга);
				Строки = СхемыДоначисленияМКД.НайтиСтроки(Отбор);
				
				Для Каждого ТекСтрока Из Строки Цикл
					Если ОбъемУслуги = 0 Тогда
						Прервать;
					КонецЕсли;
					
				    ОтборОбъемыДляДоначисленияМКД = Новый Структура("Договор,ОбъектРасчета,ТочкаУчета,Услуга", ТекСтрока.Договор, ТекСтрока.ОбъектРасчета, ТекСтрока.ТочкаУчета,ТекСтрока.Услуга);
				
					СтрокиНачисления = ОбъемыДляДоначисленияМКД.НайтиСтроки(ОтборОбъемыДляДоначисленияМКД);
					Если СтрокиНачисления.Количество() > 0 Тогда
						СтрокаНачисленияДляДоначисления = СтрокиНачисления[0];
					Иначе
						Продолжить;
					КонецЕсли;
				
					ЗаписьРаспределения = НаборОбъемНачисленийНП.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьРаспределения, СтрокаНачисленияДляДоначисления,,"ОбъемПоПрибору,ОбъемУслуги,ОбъемУслугиПотребленный,КоличествоЧасовШтатнойРаботыПУ,ОбъемДосчитанный,ОбъемМГВ,КоличествоЧасовРаботыТУ,Сумма,СуммаНДС");
					Если ОбъемУслуги > 0 Тогда
						ТекОбъем	= ОбъемУслуги;
					Иначе	
						ТекОбъем	= -Мин(-ОбъемУслуги,СтрокаНачисленияДляДоначисления.ОбъемУслуги);
					КонецЕсли;	
					
					ЗаписьРаспределения.ОбъемУслуги		= ТекОбъем;
					ЗаписьРаспределения.Распределение	= Истина;
					
					Если ЗаписьРаспределения.НДСВнутри Тогда
						ЗаписьРаспределения.Сумма 	= ТекОбъем * ЗаписьРаспределения.ЗначениеТарифа;
						ЗаписьРаспределения.СуммаНДС = ЗаписьРаспределения.Сумма * ЗаписьРаспределения.СтавкаНДС / (100 + ЗаписьРаспределения.СтавкаНДС);
					Иначе
						ЗаписьРаспределения.Сумма 	= ТекОбъем * ЗаписьРаспределения.ЗначениеТарифа + ТекОбъем * ЗаписьРаспределения.ЗначениеТарифа * ЗаписьРаспределения.СтавкаНДС / 100;
						ЗаписьРаспределения.СуммаНДС = ТекОбъем * ЗаписьРаспределения.ЗначениеТарифа * ЗаписьРаспределения.СтавкаНДС / 100;
					КонецЕсли;

					ОбъемУслуги	= ОбъемУслуги - ТекОбъем;
					
				КонецЦикла;
	
			КонецЕсли;
		КонецЦикла;
		
		НаборОбъемНачисленийНП.Записать(); 
		НаборОбъемНачисленийЭлектроэнергии.Записать();
		НаборОтрицательныйОбъемРаспределения.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

// Отменяет закрытие периода.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  МКД					-	СправочникСсылка.энргСтроения.
//
Процедура ОтменитьЗакрытьПериода(Организация,ПериодНачисления,Район,МКД) Экспорт 
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 	=
	"ВЫБРАТЬ
	|	энргНачисление.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргНачисление КАК энргНачисление
	|ГДЕ
	|	энргНачисление.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачисление.МКД = &МКД
	|	И энргНачисление.Район = &Район
	|	И энргНачисление.Проведен
	|	И энргНачисление.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеМКД.Ссылка
	|ИЗ
	|	Документ.энргНачислениеМКД КАК энргНачислениеМКД
	|ГДЕ
	|	энргНачислениеМКД.Организация = &Организация
	|	И энргНачислениеМКД.Район = &Район
	|	И энргНачислениеМКД.Проведен
	|	И энргНачислениеМКД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Проведен
	|	И энргПерерасчет.Организация = &Организация
	|	И энргПерерасчет.Район = &Район
	|	И энргПерерасчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПерерасчет.МКД = &МКД
	|	И энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаПоказаний)
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	энргЗакрытиеПериода.Проведен
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.Организация = &Район
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	
	Если МКД = Неопределено тогда
		Текст 			= СтрЗаменить(Текст,"И энргНачисление.МКД = &МКД","");
		Текст			= СтрЗаменить(Текст,"И энргПерерасчет.МКД = &МКД","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 		= Текст;
	Результат  			= Запрос.Выполнить();
	Выборка 			= Результат.Выбрать();
	Пока Выборка.Следующий() цикл  		
		ДокОбъект  		= Выборка.ссылка.получитьОбъект();
		ДокОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",истина);
		ДокОбъект.УстановитьПометкуУдаления(Истина);		
	КонецЦикла; 
	
КонецПроцедуры

// Начисляет по рассрочке.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  МКД					-	СправочникСсылка.энргСтроения.
//  Документ			-	ДокументОбъект.
//
Процедура НачислениеПоРассрочке(Организация,ПериодНачисления,Район,МКД,Документ)  Экспорт 
	
	Если НЕ ПолучитьФункциональнуюОпцию("энргИспользоватьРассрочку") Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП-1;
	ДнейВПериоде  									= ГраницыПериода.ДнейВПериоде; 
	ДифференцированныйСпособРасчетаПроцентов(Организация, ПериодНачисления,Район,МКД,Документ,КонецПериодаРасчета);
	
	Если МКД = Неопределено тогда
		
	КонецЕсли;
	
КонецПроцедуры

// Закрывает период для редактирования.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//
Процедура ЗакрытьПериодДляРедактирования(Организация,ПериодНачисления,Район) Экспорт  
			
	ДокуметЗакрытия 				= ДокуметЗакрытияПериода(Организация, ПериодНачисления,Район);
	
	Если не ЗначениеЗаполнено(ДокуметЗакрытия) тогда
		ДокументОбъект 				= Документы.энргЗакрытиеПериода.СоздатьДокумент();
	иначе
		ДокументОбъект 				= ДокуметЗакрытия.ПолучитьОбъект();  
	КонецЕсли;
	
	ДокументОбъект.ДополнительныеСвойства.вставить("ПроведениеРазрешено",Истина);
	ДокументОбъект.Организация 		= Организация;
	ДокументОбъект.Район 			= Район;
	ДокументОбъект.ПериодНачисления = ПериодНачисления;	
	Попытка
		ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОписаниеОшибки 				= ОписаниеОшибки();
		ВызватьИсключение ОписаниеОшибки; 
	КонецПопытки;	
	
КонецПроцедуры

// Начисляет льготы.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Строение			-	СправочникСсылка.энргСтроения.
//  Абонент				-	СправочникСсылка.энргАбоненты.
//  Документ			-	СправочникСсылка.энргДоговорыКонтрагентов.
//
Процедура НачислитьЛьготы(Организация, ПериодНачисления,Район,Строение,Абонент,Документ) Экспорт
	// TODO FIX ME
	Возврат;
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	КолвоМесЗадолженности = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКоличествоМесяцевЗадолженностиДляРасчетаЛьготыСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоМесяцевЗадолженностиДляРасчетаЛьготы.СрезПоследних(
		|			&Конец,
		|			Организация = &Организация
		|				И Район = &Район) КАК энргКоличествоМесяцевЗадолженностиДляРасчетаЛьготыСрезПоследних";
	
	Запрос.УстановитьПараметр("Конец", КонецПериодаРасчета - 1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолвоМесЗадолженности =  ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	Запрос 											= новый Запрос;
	Запрос.Текст 									= ПолучитьТекстЗапросаДляЛьготников();
	Если Строение=Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"энргОбъемНачислений.Строение = &Строение", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Строение", Строение);
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода", 		КонецПериодаРасчета);	
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("МесяцЗадолженности", ДобавитьМесяц(КонецПериодаРасчета - 1, -КолвоМесЗадолженности));

	результатЗапроса 								= Запрос.Выполнить();								
	КонецПериода  									= КонецМесяца(ПериодНачисления);
	
	Выборка  										= результатЗапроса.выбрать();

	ТекЧастныйСектор 								= Ложь;
	ТекСтроение  									= Неопределено;
	ДокументОбъект 									= Неопределено;
	Набор 											= Неопределено;
	
	Пока Выборка.следующий() цикл
		
		Если Документ = Неопределено тогда			
			Если  ТекСтроение <> Выборка.Строение тогда
				Если ТекСтроение<>Неопределено тогда
					НачатьТранзакцию();
					Попытка
						Если НЕ ДокументОбъект = Неопределено Тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
							ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
						Набор.ДополнительныеСвойства.Вставить("Район",				Район);
						Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
						Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор",		ТекЧастныйСектор);
						Набор.ДополнительныеСвойства.Вставить("Строение",			ТекСтроение);
						Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);						
						Набор.Записать(Ложь);						
						ЗафиксироватьТранзакцию();
					Исключение
						ОтменитьТранзакцию();
					КонецПопытки;					
				КонецЕсли;
				
				ДокументСсылка 						= Выборка.СсылкаНаСущДок;
				ПометкаУдаления 					= Выборка.ПометкаУдаления;
				ДокументОбъект  					= Неопределено;
				Если НЕ ЗначениеЗаполнено(ДокументСсылка)  Тогда
					ДокументСсылка 					= Документы.энргНачислениеДляЛьготныхЛиц.ПолучитьСсылку(Новый УникальныйИдентификатор());
					ДокументОбъект  				= Документы.энргНачислениеДляЛьготныхЛиц.СоздатьДокумент();
					ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
					ДокументОбъект.район  			= Район;
					ДокументОбъект.МКД 				= ?(Выборка.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка(), Выборка.Строение);
					ДокументОбъект.Дата				= КонецПериодаРасчета-1;
					ДокументОбъект.Организация 		= Организация;
				ИначеЕсли ПометкаУдаления Тогда
					ДокументОбъект  				= ДокументСсылка.ПолучитьОбъект();
					ДокументОбъект.ПометкаУдаления 	= Ложь;
				КонецЕсли;
				
				Набор 								= РегистрыНакопления.энргОбъемНачисленийДляЛьготныхЛиц.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка);
				
				Если Не Абонент = Неопределено Тогда					
					Набор.ДополнительныеСвойства.Вставить("Абонент",	Абонент);
					Если ДокументОбъект = Неопределено Тогда
						Набор.Прочитать();
						СтрокиНабораДоЗаписи 							= Набор.Выгрузить();
						СтрокиУдалить 									= СтрокиНабораДоЗаписи.НайтиСтроки(Новый Структура("Абонент", Абонент));
						Для Каждого СтрокаУдалить ИЗ СтрокиУдалить Цикл
							СтрокиНабораДоЗаписи.Удалить(СтрокаУдалить);
						КонецЦикла;
						Набор.Очистить();
					КонецЕсли;					
				КонецЕсли;
				
				Если ДокументОбъект = Неопределено Тогда
					Набор.Записать();
				КонецЕсли;				
			КонецЕсли;
		иначе
			Набор 									= Документ.Движения.энргОбъемНачисленийДляЛьготныхЛиц; 
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Выборка.Абонент) Тогда
			СтрокНабора 								= Набор.добавить();
			ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
			СтрокНабора.Период							= КонецПериодаРасчета-1;
			СтрокНабора.Регистратор						= ДокументСсылка;
			СтрокНабора.ПериодРасчета 					= ПериодНачисления;
		КонецЕсли;
		
		ТекЧастныйСектор								= Выборка.ЧастныйСектор;
		ТекСтроение										= Выборка.Строение;
	КонецЦикла;	
	
	Если Документ = Неопределено и НЕ Набор = Неопределено и Набор.Количество() > 0 Тогда
		НачатьТранзакцию();
		Попытка 			
			Если НЕ ДокументОбъект = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			Набор.ДополнительныеСвойства.Вставить("Организация",		Организация);
			Набор.ДополнительныеСвойства.Вставить("Район",				Район);
			Набор.ДополнительныеСвойства.Вставить("ПериодНачисления",	ПериодНачисления);
			Набор.ДополнительныеСвойства.Вставить("ЧастныйСектор",		ТекЧастныйСектор);
			Набор.ДополнительныеСвойства.Вставить("Строение",			ТекСтроение);
			Набор.ДополнительныеСвойства.Вставить("ДатаРегистратора",	КонецПериодаРасчета-1);
			 			
			Если НЕ Абонент = Неопределено и НЕ СтрокиНабораДоЗаписи = Неопределено и СтрокиНабораДоЗаписи.Количество() > 0 Тогда
				Набор.ДополнительныеСвойства.Вставить("Абонент",	Абонент);
				Для Каждого СтрокаДобавить Из СтрокиНабораДоЗаписи Цикл
					ЗаполнитьЗначенияСвойств(Набор.Добавить(), СтрокаДобавить);
				КонецЦикла;				
			КонецЕсли; 			
			
			Набор.Записать(Ложь);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке  						= ИнформацияОбОшибке();
			ВызватьИсключение (ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
		КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

// Пересчитывает распредение объема потребленного МКД.
//
// Параметры:
//  Организация				-	СправочникСсылка.Организации.
//  ПериодНачисления		-	Дата.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  Строение				-	СправочникСсылка.энргСтроения.
//  ПараметрыПерерасчета	-	Структура.
//
Процедура ПересчитатьРаспредениеОбъемаПотребленногоМКД(Организация,ПериодНачисления, Район, Строение, ПараметрыПерерасчета) Экспорт 
	Перем текПериодНачисления, ТекСтроение, ТекУслуга, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма, ТекМКДАбонентов, ТекУслугаАбонентов,
	ДокументОбъект, ДанныеПоУслуге, НаборВыполненные, ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам;
	
	МВТ 											= Новый МенеджерВременныхТаблиц;
	ТекстГраницОтчетногоПериода 					= энргНачисления.ТекстГраницОтчетногоПериода(ПараметрыПерерасчета.Начало,ПараметрыПерерасчета.Окончание,Ложь);
	Запрос 	 										= Новый Запрос("ВЫБРАТЬ * ПОМЕСТИТЬ ГраницыОтчетногоПериода ИЗ (" +ТекстГраницОтчетногоПериода+ ") КАК ВложенныйЗапрос");
	Запрос.МенеджерВременныхТаблиц 					= МВТ;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Выполнить();
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПараметрыПерерасчета.Начало);
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПараметрыПерерасчета.Окончание);
	КонецПериодаРасчета								= ГраницыПериода.ЗавершениеОП;
	
	ПараметрыПерерасчета.Вставить("НачалоПериодаРасчета", 	НачалоПериодаРасчета);
	ПараметрыПерерасчета.Вставить("КонецПериодаРасчета", 	КонецПериодаРасчета);
	
	ПрочитатьНормативныеДанныеРаспределения_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение);
	ПрочитатьДокументыДляРаспределения_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение);
	ПрочитатьСозданныеДокументыИндивидуальныхНачислений_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение);
	ПрочитатьОбъемыНачисленийМКДДляРаспределения_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение,ПараметрыПерерасчета);
	ПрочитатьВспомогательныеДанныеРаспределениеМКД(МВТ,Организация,ПериодНачисления,Район,Строение, ПараметрыПерерасчета);
	
	Запрос 									= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 			= МВТ;
	Запрос.Текст 							= ТекстЗапросаДанныеДляРаспределения(Строение);
	
	Результат  								= Запрос.ВыполнитьПакет();
	ВыборкаЗначенияТарифов 					= Результат[0].Выбрать();
	ВыборкаОбъемМКД							= Результат[1].Выбрать();
	ВыборкаАбоненты							= Результат[2].Выбрать();
	ВыборкаОбъемПоПриборуКорректировать		= Результат[3].Выбрать();
	ВыборкаРазделенныеЛицевыеСчета			= Результат[4].Выбрать();
	ВыборкаОбъемПоПриборуНПКорректировать	= Результат[5].Выбрать();
	ВыборкаОтрицательныйОбъемРаспределения 	= Неопределено;
	РазделенныеЛицевыеСчета 				= Новый Соответствие;
	КлючРазделенныеЛицевыеСчета 			= "Абонент,ЗначениеПлощади,СпособРаспределенияОбъемаПомещения,ФиксированныйОбъемПотребления,
	|ДоляПотребленияЧислитель,ДоляПотребленияЗнаменатель,КоличествоПроживающих,ТарифнаяГруппа,Поставщик,ЗначениеСоциальнойНормы,ДопСоциальнаяНормаПотребления";
	
	НаборЗаписей 							= ПараметрыПерерасчета.ОбъемНачислений;
	НаборЗаписейНП 							= ПараметрыПерерасчета.ОбъемНачисленийНП;
	тзЗначенияСоциальныхНормативов 			= Неопределено;
	ЗначенияТарифов 						= Новый Соответствие;
	Если ВыборкаЗначенияТарифов.Количество() > 0 Тогда
		Пока ВыборкаЗначенияТарифов.Следующий() Цикл
			ХэшСтроки 						= ХэшСтрокиТарифа(ВыборкаЗначенияТарифов.ГруппаПотребителей,ВыборкаЗначенияТарифов.Услуга,ВыборкаЗначенияТарифов.Поставщик,ВыборкаЗначенияТарифов.ТарифнаяЗона);
			ОписаниеЗначения 				= Новый Структура("Значение,ЗначениеТарифаРЭК,ЗначениеСверхНорматива,СтавкаНДС,НДСВнутри,ГруппаПотребителей,Услуга,Поставщик,ТарифнаяЗона");
			ЗаполнитьЗначенияСвойств(ОписаниеЗначения, ВыборкаЗначенияТарифов);			
			ЗначенияТарифов.Вставить(ХэшСтроки,ОписаниеЗначения); 			
		КонецЦикла;		
	КонецЕсли;
	
	ВыборкаАбоненты.следующий();
	ВыборкаОбъемПоПриборуНПКорректировать.Следующий();
	
	ЕстьРазделенныеЛицевыеСчета 				= ВыборкаРазделенныеЛицевыеСчета.Следующий();
	
	Отказ 										= Ложь;
	ТипыНачислений 								= энргНачисления.ТипыРасходовВФормулахРасчета();
	ТекстИсключения		 						= "";
	//ИспользоватьТарифРек 						= Ложь;
		
	РаспределениеОбъемаПоУслугам 				= Новый Соответствие;
	РаспределениеОбъемаПоУслугамПотребленный 	= Новый Соответствие;
	
	Пока ВыборкаОбъемМКД.Следующий() Цикл
		
		//Если МассивМКД_УК.Найти(ВыборкаОбъемМКД.Строение) <> Неопределено Тогда
		//	Продолжить;	
		//КонецЕсли;
		
		Если НЕ текПериодНачисления = ВыборкаОбъемМКД.ПериодНачисления 
			ИЛИ НЕ ТекСтроение = ВыборкаОбъемМКД.Строение 
			ИЛИ НЕ ТекУслуга = ВыборкаОбъемМКД.Услуга Тогда
												
			Если Не ТекУслуга  = Неопределено Тогда
				Если ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда					
					РаспределитьОбъемПотребленныйПоУслугеМКД(текПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугамПотребленный, НаборОтрицательныйОбъемРаспределения,НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма);	
				КонецЕсли;
				ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, ТекУслуга, НачисленияПоУслугам);
			КонецЕсли;
			
			Если НЕ текПериодНачисления = ВыборкаОбъемМКД.ПериодНачисления
				ИЛИ НЕ ТекСтроение = ВыборкаОбъемМКД.Строение Тогда
				Если НЕ ТекСтроение = Неопределено Тогда
					// Рассчитываем норматив
					РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив,НачисленияПоУслугам,ЗначенияТарифов,ГраницыПериода,Отказ,НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП);
				КонецЕсли;
				
				// запоминаем свойства разделенных лицевых счетов по услугам
				РаспределениеОбъемаПоУслугам 	= Новый Соответствие;
				Отказ 							= Ложь;
				РассчитыватьНорматив 			= Новый Массив;
				ПараметрыРасчетаНорматива 		= Новый Соответствие;
				РазделенныеЛицевыеСчета 		= Новый Соответствие;
				НачисленияПоУслугам 			= Новый Соответствие;
				Если ЕстьРазделенныеЛицевыеСчета Тогда
					ЗаполнитьРазделенныеЛицевыеСчета(КлючРазделенныеЛицевыеСчета, РазделенныеЛицевыеСчета, ВыборкаРазделенныеЛицевыеСчета, ВыборкаОбъемМКД, тзЗначенияСоциальныхНормативов);					
				КонецЕсли; 				
			КонецЕсли;			
						
			ДанныеПоУслуге 					= ДанныеПоУслугиДляРаспределения(ВыборкаОбъемМКД, РазделенныеЛицевыеСчета);
			
			ЗаполнитьДанныеАбонентовДляРаспределения(ДанныеПоУслуге, ВыборкаАбоненты, ВыборкаОбъемМКД, ВыборкаОтрицательныйОбъемРаспределения, ВыборкаОбъемПоПриборуКорректировать, ВыборкаОбъемПоПриборуНПКорректировать);					
		КонецЕсли;
		
		ЗаполнитьОбъемыМКДПриРаспределении(ВыборкаОбъемМКД, ДанныеПоУслуге);
		
		текПериодНачисления 				= ВыборкаОбъемМКД.ПериодНачисления;
		ТекСтроение							= ВыборкаОбъемМКД.Строение;
		ТекУслуга 							= ВыборкаОбъемМКД.Услуга;
	КонецЦикла; 	
	
	Если Не ТекСтроение = Неопределено Тогда		
		Если ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда			
			РаспределитьОбъемПотребленныйПоУслугеМКД(текПериодНачисления, Организация, Район, ТекСтроение, ТекУслуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугамПотребленный, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейСверхНорма);
		КонецЕсли;		
		ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, ТекУслуга, НачисленияПоУслугам);
		РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам, ЗначенияТарифов, ГраницыПериода, Отказ, НаборЗаписей, НаборЗаписейПомещений, НаборЗаписейНП);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьСтабильныеПериоды(МВТ,ДокументНачисленияПустаяСсылка)  
	
	Текст 							= ТекстПолучитьСтабильныеПериоды();
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДокументНачисленияПустаяСсылка"				, ДокументНачисленияПустаяСсылка);
	Запрос.УстановитьПараметр("КоличествоНедопусковДляОтклоненияПоказаний"	, энргРаботаСКонстантами.ЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний());
	Запрос.МенеджерВременныхТаблиц	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьДанныеДляРасчета(МВТ,РасчетПоФормуле,ЭтоПерерасчет,ИмяДокумента)
	
	Текст 							= ТекстПолучитьДанныеДляРасчета();
	Запрос  						= Новый Запрос(Текст); 	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция РассчитатьИндивидуальныйОбъемПотребления(МВТ); 
	
	Текст  								= ТекстРассчитатьИндивидуальныйОбъемПотребления();
	Запрос  							= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 		= МВТ;	
	Запрос.Выполнить();
		
	Схема 								= Неопределено;
	ВыбираемыПоля  						= ВыбираемыеПоляРезультатНачисления();
	ВычисляемыеПоля 					= ВычисляемыеПоляРезультатНачисления();
	ВычисляемыеПоляОбъемаПотребленного	= ВычисляемыеПоляРезультатНачисления(Истина);
	
	ДобавитьРасчетОбъемаУслугиПоПриборам(Схема,ВыбираемыПоля,ВычисляемыеПоля,МВТ,"ДанныеДляРасчета");
	ДобавитьРасчетОбъемаПотребленногоПоПриборам(Схема,ВыбираемыПоля,ВычисляемыеПоляОбъемаПотребленного,МВТ,"ДанныеДляРасчета");
	
	ДобавитьРасчетОбъемаУслугиПоНормативу(Схема,ВыбираемыПоля,ВычисляемыеПоля,МВТ,"ДанныеДляРасчета");
	ДобавитьРасчетОбъемаПотребленногоПоНормативу(Схема,ВыбираемыПоля,ВычисляемыеПоляОбъемаПотребленного,МВТ,"ДанныеДляРасчета");
	
	ДобавитьРасчетОбъемаУслугиПоСреднемуНормативуЗаПрошлыйГод(Схема,ВыбираемыПоля,ВычисляемыеПоля,МВТ,"ДанныеДляРасчета");
	ДобавитьРасчетОбъемаУслугиПоСреднемуНормативу(Схема,ВыбираемыПоля,ВычисляемыеПоля,МВТ,"ДанныеДляРасчета");
	ДобавитьРасчетОбъемаПотребленногоПоСреднемуНормативу(Схема,ВыбираемыПоля,ВычисляемыеПоляОбъемаПотребленного,МВТ,"ДанныеДляРасчета");
	
	ДобавитьРасчетОбъемаУслугиПоСреднемуЗаПрошлыйГод(Схема,ВыбираемыПоля,ВычисляемыеПоля,МВТ,"ДанныеДляРасчета");
	ДобавитьРасчетОбъемаУслугиПоСреднему(Схема,ВыбираемыПоля,ВычисляемыеПоля,МВТ,"ДанныеДляРасчета");
	ДобавитьРасчетОбъемаПотребленногоПоСреднему(Схема,ВыбираемыПоля,ВычисляемыеПоляОбъемаПотребленного,МВТ,"ДанныеДляРасчета");
	
	ПоляПорядка = Новый Массив;
	ПоляПорядка.Добавить("ПериодНачисления");
	ПоляПорядка.Добавить("Район");
	ПоляПорядка.Добавить("МКД");
	ПоляПорядка.Добавить("ЧастныйСектор");
	ПоляПорядка.Добавить("Строение");
	ПоляПорядка.Добавить("ПомещениеРодительСекция");
	ПоляПорядка.Добавить("ПорядокПомещения");
	//ПоляПорядка.Добавить("ПомещениеРодитель");
	ПоляПорядка.Добавить("Помещение");
	ПоляПорядка.Добавить("НачалоПериода");
	ПоляПорядка.Добавить("КонецПериода");
	ПоляПорядка.Добавить("ПорядокСпособРаспределенияОбъемаПомещения");
	ПоляПорядка.Добавить("ЗависитОтУслуги");
	ПоляПорядка.Добавить("ЗависимаяТочкаУчета");
	ПоляПорядка.Добавить("ТочкаУчета");
	
	Пакет  							= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество() - 1];
	Для Сч = 0 По ПоляПорядка.ВГраница() Цикл
		Пакет.Порядок.Добавить(ПоляПорядка[Сч]);
	КонецЦикла;
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьОбъемСУчетомОтрицательногоРаспределенияУК(ВыборкаДетальныеЗаписи, ТЗОтрицательныйОбъемРаспределения, НаборОтрицательныйОбъемРаспределения, Период, ВидОбъема)
	
	ОбъемКРаспределению = ВыборкаДетальныеЗаписи[ВидОбъема];
	
	Если ОбъемКРаспределению < 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Отбор = Новый Структура("МКД,Услуга,ТарифнаяЗона", ВыборкаДетальныеЗаписи.МКД, ВыборкаДетальныеЗаписи.Услуга, ВыборкаДетальныеЗаписи.ТарифнаяЗона);
	Строки = ТЗОтрицательныйОбъемРаспределения.НайтиСтроки(Отбор);
	
	Для каждого стр из Строки Цикл
		Если ОбъемКРаспределению = 0 Тогда
			Возврат 0;
		КонецЕсли;
		
		Если стр[ВидОбъема] > 0 Тогда
			Снимаем 									= Мин(ОбъемКРаспределению, стр[ВидОбъема]);
			СтрокаНабораОтрицательный  					= НаборОтрицательныйОбъемРаспределения.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(СтрокаНабораОтрицательный, ВыборкаДетальныеЗаписи,,"ОбъемУслуги,ПериодНачисления");
			СтрокаНабораОтрицательный.Период	 		= Период;
			СтрокаНабораОтрицательный.ОбъемУслуги		= Снимаем;
			СтрокаНабораОтрицательный.ПериодРасчета 	= стр.ПериодНачисленияОбъема;
			СтрокаНабораОтрицательный.ПериодНачисления 	= стр.ПериодНачисленияОбъема;
			ОбъемКРаспределению 						= ОбъемКРаспределению - Снимаем;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбъемКРаспределению; 
КонецФункции

#Область ТекстЗапросов

#Область ИндвидуальныеНачисления

Функция ТекстПолучитьСтабильныеПериоды()
	
	Текст  = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыНачало.Организация КАК Организация,
	|	СтабильныеПериодыНачало.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачало.Район КАК Район,
	|	СтабильныеПериодыНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыНачало.Строение КАК Строение,
	|	СтабильныеПериодыНачало.Помещение КАК Помещение,
	|	СтабильныеПериодыНачало.Услуга КАК Услуга,
	|	СтабильныеПериодыНачало.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериодыНачало.НомерПозиции) КАК НомерПозиции,
	|	МАКСИМУМ(СтабильныеПериодыНачало.КоличествоНедопусков) КАК КоличествоНедопусков,
	|	МИНИМУМ(СтабильныеПериодыНачало.ПериодНачальногоНедопуска) КАК ПериодНачальногоНедопуска,
	|	МАКСИМУМ(РАЗНОСТЬДАТ(СтабильныеПериодыНачало.ПериодНачальногоНедопуска, СтабильныеПериодыНачало.ПериодНачисления, МЕСЯЦ)) КАК КоличествоМесяцевРасчетаСреднего,
	|	НастройкиРасчетовПриРегистрацииАктаНедопуска.КоличествоПериодовНачисленийПоСреднему КАК КоличествоПериодовНачисленийПоСреднему,
	|	НастройкиРасчетовПриРегистрацииАктаНедопуска.ПереходНаНормативПосле КАК ПереходНаНормативПосле,
	|	НастройкиРасчетовПриРегистрацииАктаНедопуска.ПовышающийКоэффициент КАК ПовышающийКоэффициент
	|ПОМЕСТИТЬ ТочкиПереходаНаНормативПриАктахНедопуска
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиРасчетовПриРегистрацииАктаНедопуска КАК НастройкиРасчетовПриРегистрацииАктаНедопуска
	|		ПО СтабильныеПериодыНачало.Организация = НастройкиРасчетовПриРегистрацииАктаНедопуска.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = НастройкиРасчетовПриРегистрацииАктаНедопуска.ПериодНачисления
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыНачало.КоличествоНедопусков > 0
	|					ТОГДА ВЫБОР
	|							КОГДА СтабильныеПериодыНачало.КоличествоНедопусков >= НастройкиРасчетовПриРегистрацииАктаНедопуска.ПереходНаНормативПосле
	|								ТОГДА ИСТИНА
	|							КОГДА РАЗНОСТЬДАТ(СтабильныеПериодыНачало.ПериодНачальногоНедопуска, СтабильныеПериодыНачало.ПериодНачисления, МЕСЯЦ) >= НастройкиРасчетовПриРегистрацииАктаНедопуска.КоличествоПериодовНачисленийПоСреднему
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНачало.Помещение,
	|	СтабильныеПериодыНачало.ЧастныйСектор,
	|	НастройкиРасчетовПриРегистрацииАктаНедопуска.ПереходНаНормативПосле,
	|	СтабильныеПериодыНачало.Район,
	|	СтабильныеПериодыНачало.ТочкаУчета,
	|	НастройкиРасчетовПриРегистрацииАктаНедопуска.КоличествоПериодовНачисленийПоСреднему,
	|	СтабильныеПериодыНачало.Услуга,
	|	НастройкиРасчетовПриРегистрацииАктаНедопуска.ПовышающийКоэффициент,
	|	СтабильныеПериодыНачало.ПериодНачисления,
	|	СтабильныеПериодыНачало.Строение,
	|	СтабильныеПериодыНачало.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыСезонности.Организация КАК Организация,
	|	ПериодыСезонности.ПериодНачисления КАК ПериодНачисления,
	|	ПериодыСезонности.Район КАК Район,
	|	ПериодыСезонности.Сезонность КАК Сезонность,
	|	ПериодыСезонности.НачалоСезонности КАК Период,
	|	1 КАК КоэфициентСезонности
	|ПОМЕСТИТЬ ПериодыИзмененияСезонности
	|ИЗ
	|	ПериодыСезонности КАК ПериодыСезонности
	|ГДЕ
	|	ПериодыСезонности.НачалоСезонности > ПериодыСезонности.НачалоОП
	|	И ПериодыСезонности.НачалоСезонности < ПериодыСезонности.ЗавершениеОП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПериодыСезонности.Организация,
	|	ПериодыСезонности.ПериодНачисления,
	|	ПериодыСезонности.Район,
	|	ПериодыСезонности.Сезонность,
	|	ПериодыСезонности.КонецСезонности,
	|	0
	|ИЗ
	|	ПериодыСезонности КАК ПериодыСезонности
	|ГДЕ
	|	ПериодыСезонности.КонецСезонности > ПериодыСезонности.НачалоОП
	|	И ПериодыСезонности.КонецСезонности < ПериодыСезонности.ЗавершениеОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.Показания КАК Показания,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.Приоритет КАК Приоритет,
	|	ВложенныйЗапрос.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ МаксимальныеПоказанияСрезНабор
	|ИЗ
	|	(ВЫБРАТЬ
	|		МаксимальныеПоказанияСрез.Организация КАК Организация,
	|		ДОБАВИТЬКДАТЕ(МаксимальныеПоказанияСрез.ПериодНачисления, МЕСЯЦ, 1) КАК ПериодНачисления,
	|		МаксимальныеПоказанияСрез.Район КАК Район,
	|		МаксимальныеПоказанияСрез.ЧастныйСектор КАК ЧастныйСектор,
	|		МаксимальныеПоказанияСрез.Строение КАК Строение,
	|		МаксимальныеПоказанияСрез.Помещение КАК Помещение,
	|		МаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|		МаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|		МаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МаксимальныеПоказанияСрез.Показания КАК Показания,
	|		МаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|		МаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора,
	|		0 КАК Приоритет,
	|		ЛОЖЬ КАК ПоказанияТекущегоПериода
	|	ИЗ
	|		МаксимальныеПоказанияСрезПредыдущийПериод КАК МаксимальныеПоказанияСрез
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПредоставленныеПоказания.Организация,
	|		ПредоставленныеПоказания.ПериодНачисления,
	|		ПредоставленныеПоказания.Район,
	|		ПредоставленныеПоказания.ЧастныйСектор,
	|		ПредоставленныеПоказания.Строение,
	|		ПредоставленныеПоказания.Помещение,
	|		ПредоставленныеПоказания.ПриборУчета,
	|		ПредоставленныеПоказания.Шкала,
	|		ПредоставленныеПоказания.ТарифнаяЗона,
	|		ПредоставленныеПоказания.Показания,
	|		ПредоставленныеПоказания.ДокРегистратор,
	|		ПредоставленныеПоказания.ДатаРегистратора,
	|		1,
	|		ПредоставленныеПоказания.ПоказанияТекущегоПериода
	|	ИЗ
	|		ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|	ГДЕ
	|		ПредоставленныеПоказания.НомерПозиции = -1) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПоказанияСрезНабор.Организация КАК Организация,
	|	МаксимальныеПоказанияСрезНабор.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныеПоказанияСрезНабор.Район КАК Район,
	|	МаксимальныеПоказанияСрезНабор.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныеПоказанияСрезНабор.Строение КАК Строение,
	|	МаксимальныеПоказанияСрезНабор.Помещение КАК Помещение,
	|	МаксимальныеПоказанияСрезНабор.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказанияСрезНабор.Шкала КАК Шкала,
	|	МаксимальныеПоказанияСрезНабор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныеПоказанияСрезНабор.Показания КАК Показания,
	|	МаксимальныеПоказанияСрезНабор.ДокРегистратор КАК ДокРегистратор,
	|	МаксимальныеПоказанияСрезНабор.ДатаРегистратора КАК ДатаРегистратора,
	|	МаксимальныеПоказанияСрезНабор.Приоритет КАК Приоритет,
	|	МаксимальныеПоказанияСрезНабор.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ МаксимальныеПоказанияСрез
	|ИЗ
	|	МаксимальныеПоказанияСрезНабор КАК МаксимальныеПоказанияСрезНабор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МаксимальныеПоказанияСрезНабор.Организация КАК Организация,
	|			МаксимальныеПоказанияСрезНабор.ПериодНачисления КАК ПериодНачисления,
	|			МаксимальныеПоказанияСрезНабор.Район КАК Район,
	|			МаксимальныеПоказанияСрезНабор.ЧастныйСектор КАК ЧастныйСектор,
	|			МаксимальныеПоказанияСрезНабор.Строение КАК Строение,
	|			МаксимальныеПоказанияСрезНабор.Помещение КАК Помещение,
	|			МаксимальныеПоказанияСрезНабор.ПриборУчета КАК ПриборУчета,
	|			МаксимальныеПоказанияСрезНабор.Шкала КАК Шкала,
	|			МаксимальныеПоказанияСрезНабор.ТарифнаяЗона КАК ТарифнаяЗона,
	|			МАКСИМУМ(МаксимальныеПоказанияСрезНабор.Приоритет) КАК Приоритет
	|		ИЗ
	|			МаксимальныеПоказанияСрезНабор КАК МаксимальныеПоказанияСрезНабор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			МаксимальныеПоказанияСрезНабор.Организация,
	|			МаксимальныеПоказанияСрезНабор.ПериодНачисления,
	|			МаксимальныеПоказанияСрезНабор.Район,
	|			МаксимальныеПоказанияСрезНабор.ЧастныйСектор,
	|			МаксимальныеПоказанияСрезНабор.Строение,
	|			МаксимальныеПоказанияСрезНабор.Помещение,
	|			МаксимальныеПоказанияСрезНабор.ПриборУчета,
	|			МаксимальныеПоказанияСрезНабор.Шкала,
	|			МаксимальныеПоказанияСрезНабор.ТарифнаяЗона) КАК МаксимальныйПриоритетПоказаний
	|		ПО МаксимальныеПоказанияСрезНабор.Организация = МаксимальныйПриоритетПоказаний.Организация
	|			И МаксимальныеПоказанияСрезНабор.Организация = МаксимальныйПриоритетПоказаний.Организация
	|			И МаксимальныеПоказанияСрезНабор.ПериодНачисления = МаксимальныйПриоритетПоказаний.ПериодНачисления
	|			И МаксимальныеПоказанияСрезНабор.Район = МаксимальныйПриоритетПоказаний.Район
	|			И МаксимальныеПоказанияСрезНабор.ЧастныйСектор = МаксимальныйПриоритетПоказаний.ЧастныйСектор
	|			И МаксимальныеПоказанияСрезНабор.Строение = МаксимальныйПриоритетПоказаний.Строение
	|			И МаксимальныеПоказанияСрезНабор.Помещение = МаксимальныйПриоритетПоказаний.Помещение
	|			И МаксимальныеПоказанияСрезНабор.ПриборУчета = МаксимальныйПриоритетПоказаний.ПриборУчета
	|			И МаксимальныеПоказанияСрезНабор.Шкала = МаксимальныйПриоритетПоказаний.Шкала
	|			И МаксимальныеПоказанияСрезНабор.ТарифнаяЗона = МаксимальныйПриоритетПоказаний.ТарифнаяЗона
	|			И МаксимальныеПоказанияСрезНабор.Приоритет = МаксимальныйПриоритетПоказаний.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	СУММА(ВложенныйЗапрос.ПлощадьМОП) КАК ПлощадьМОП,
	|	СУММА(ВложенныйЗапрос.ПлощадьАбонентов) КАК ПлощадьАбонентов,
	|	СУММА(ВложенныйЗапрос.ПлощадьСобственнаяПоставка) КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ЗначенияПлощадейСтроений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗначениеПлощадейМКД.Организация КАК Организация,
	|		ЗначениеПлощадейМКД.ПериодНачисления КАК ПериодНачисления,
	|		ЗначениеПлощадейМКД.Район КАК Район,
	|		ЗначениеПлощадейМКД.МКД КАК МКД,
	|		ЗначениеПлощадейМКД.Услуга КАК Услуга,
	|		ЗначениеПлощадейМКД.ПлощадьМОП КАК ПлощадьМОП,
	|		0 КАК ПлощадьАбонентов,
	|		0 КАК ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеПлощадейМКД КАК ЗначениеПлощадейМКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗначениеИндивидуальныхПлощадей.Организация,
	|		ЗначениеИндивидуальныхПлощадей.ПериодНачисления,
	|		ЗначениеИндивидуальныхПлощадей.Район,
	|		ЗначениеИндивидуальныхПлощадей.МКД,
	|		ЗначениеИндивидуальныхПлощадей.Услуга,
	|		0,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьАбонентов,
	|		ЗначениеИндивидуальныхПлощадей.ПлощадьСобственнаяПоставка
	|	ИЗ
	|		ЗначениеИндивидуальныхПлощадей КАК ЗначениеИндивидуальныхПлощадей) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение КАК Строение,
	|	ПредоставленныеПоказания.Помещение КАК Помещение,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	ПредоставленныеПоказания.Шкала КАК Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПредоставленныеПоказания.Показания КАК Показания,
	|	ПредоставленныеПоказания.ДатаРегистратора КАК ДатаРегистратора,
	|	ПредоставленныеПоказания.НомерПозиции КАК НомерПозиции,
	|	ПредоставленныеПоказания.ДокРегистратор КАК ДокРегистратор,
	|	ПредоставленныеПоказания.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода,
	|	МаксимальныеПоказанияСрез.Показания КАК ПоказанияМакс
	|ПОМЕСТИТЬ ПредоставленныеПоказанияНов
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|		ПО (ПредоставленныеПоказания.НомерПозиции >= 0)
	|			И ПредоставленныеПоказания.Организация = МаксимальныеПоказанияСрез.Организация
	|			И ПредоставленныеПоказания.ПериодНачисления = МаксимальныеПоказанияСрез.ПериодНачисления
	|			И ПредоставленныеПоказания.Район = МаксимальныеПоказанияСрез.Район
	|			И ПредоставленныеПоказания.ЧастныйСектор = МаксимальныеПоказанияСрез.ЧастныйСектор
	|			И ПредоставленныеПоказания.Строение = МаксимальныеПоказанияСрез.Строение
	|			И ПредоставленныеПоказания.Помещение = МаксимальныеПоказанияСрез.Помещение
	|			И ПредоставленныеПоказания.ПриборУчета = МаксимальныеПоказанияСрез.ПриборУчета
	|			И ПредоставленныеПоказания.Шкала = МаксимальныеПоказанияСрез.Шкала
	|			И ПредоставленныеПоказания.ТарифнаяЗона = МаксимальныеПоказанияСрез.ТарифнаяЗона
	|			И ПредоставленныеПоказания.ДатаРегистратора <= МаксимальныеПоказанияСрез.ДатаРегистратора
	|			И (ПредоставленныеПоказания.ДокРегистратор ССЫЛКА Документ.энргОперацияСЛицевымСчетом)
	|			И (ВЫРАЗИТЬ(ПредоставленныеПоказания.ДокРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеПоказанияСрез.Организация КАК Организация,
	|	МаксимальныеПоказанияСрез.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныеПоказанияСрез.Район КАК Район,
	|	МаксимальныеПоказанияСрез.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныеПоказанияСрез.Строение КАК Строение,
	|	МаксимальныеПоказанияСрез.Помещение КАК Помещение,
	|	МаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	МаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	МаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныеПоказанияСрез.Показания КАК Показания,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	-1 КАК НомерПозиции,
	|	МаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	МаксимальныеПоказанияСрез.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ НаборПоказаний
	|ИЗ
	|	МаксимальныеПоказанияСрез КАК МаксимальныеПоказанияСрез
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение,
	|	ПредоставленныеПоказания.Помещение,
	|	ПредоставленныеПоказания.ПриборУчета,
	|	ПредоставленныеПоказания.Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона,
	|	ПредоставленныеПоказания.Показания,
	|	ПредоставленныеПоказания.ДатаРегистратора,
	|	ПредоставленныеПоказания.НомерПозиции,
	|	ПредоставленныеПоказания.ДокРегистратор,
	|	ПредоставленныеПоказания.ПоказанияТекущегоПериода
	//|ИЗ
	//|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	//|ГДЕ
	//|	ПредоставленныеПоказания.НомерПозиции >= 0
	|ИЗ
	|	ПредоставленныеПоказанияНов КАК ПредоставленныеПоказания
	|ГДЕ
	|	ПредоставленныеПоказания.ПоказанияМакс ЕСТЬ NULL

	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказанияНачало.Организация КАК Организация,
	|	ПоказанияНачало.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияНачало.Район КАК Район,
	|	ПоказанияНачало.ЧастныйСектор КАК ЧастныйСектор,
	|	ПоказанияНачало.Строение КАК Строение,
	|	ПоказанияНачало.Помещение КАК Помещение,
	|	ПоказанияНачало.ПриборУчета КАК ПриборУчета,
	|	ПоказанияНачало.Шкала КАК Шкала,
	|	ПоказанияНачало.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияНачало.Показания КАК Показания,
	|	ПоказанияНачало.Период КАК НачалоПериодДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияКонец.Период ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПоказанияКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК ОкончаниеПериодаДействия,
	|	ВЫБОР
	|		КОГДА ПоказанияНачало.НомерПозиции = -1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакНачалаПериода,
	|	ПоказанияНачало.ДокРегистратор КАК ДокРегистратор,
	|	ПоказанияНачало.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПериодыПоказаний
	|ИЗ
	|	НаборПоказаний КАК ПоказанияНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаборПоказаний КАК ПоказанияКонец
	|		ПО ПоказанияНачало.Организация = ПоказанияКонец.Организация
	|			И ПоказанияНачало.ПериодНачисления = ПоказанияКонец.ПериодНачисления
	|			И ПоказанияНачало.Район = ПоказанияКонец.Район
	|			И ПоказанияНачало.ЧастныйСектор = ПоказанияКонец.ЧастныйСектор
	|			И ПоказанияНачало.Строение = ПоказанияКонец.Строение
	|			И ПоказанияНачало.Помещение = ПоказанияКонец.Помещение
	|			И ПоказанияНачало.ПриборУчета = ПоказанияКонец.ПриборУчета
	|			И ПоказанияНачало.Шкала = ПоказанияКонец.Шкала
	|			И ПоказанияНачало.ТарифнаяЗона = ПоказанияКонец.ТарифнаяЗона
	|			И (ПоказанияНачало.НомерПозиции = ПоказанияКонец.НомерПозиции - 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение КАК Строение,
	|	ПредоставленныеПоказания.Помещение КАК Помещение,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(ПредоставленныеПоказания.ПоказанияТекущегоПериода) КАК ПоказанияТекущегоПериода
	|ПОМЕСТИТЬ ПредоставленныеПоказанияПоАбоненту
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение,
	|	ПредоставленныеПоказания.Помещение,
	|	ПредоставленныеПоказания.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	ПредоставленныеПоказания.ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение КАК Строение,
	|	ПредоставленныеПоказания.Помещение КАК Помещение,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета,
	|	ПредоставленныеПоказания.Шкала КАК Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(ПредоставленныеПоказания.ВСрок) КАК ВСрок
	|ПОМЕСТИТЬ ПредоставленныеПоказанияВСрок
	|ИЗ
	|	ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредоставленныеПоказания.Организация,
	|	ПредоставленныеПоказания.ПериодНачисления,
	|	ПредоставленныеПоказания.Район,
	|	ПредоставленныеПоказания.ЧастныйСектор,
	|	ПредоставленныеПоказания.Строение,
	|	ПредоставленныеПоказания.Помещение,
	|	ПредоставленныеПоказания.ПриборУчета,
	|	ПредоставленныеПоказания.Шкала,
	|	ПредоставленныеПоказания.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Абонент КАК Абонент
	|ПОМЕСТИТЬ ЗакрытиеЛицевыхСчетов
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериоды
	|ГДЕ
	|	СтабильныеПериоды.НомерПозиции > 0
	|	И НЕ СтабильныеПериоды.ЛСОткрыт";	
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	
	Текст = Текст + ТекстЗапросаТочекОграничениеИВозобновлениеПроизошедшееВОдномМесяце();
	
	Текст = Текст + 
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////	
	"ВЫБРАТЬ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыНачало","",Истина,Ложь) + "
	|	СтабильныеПериодыНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачало.ФизЛицо КАК ФизЛицо,
	|	СтабильныеПериодыНачало.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	СтабильныеПериодыНачало.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	СтабильныеПериодыНачало.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	СтабильныеПериодыНачало.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	СтабильныеПериодыНачало.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	СтабильныеПериодыНачало.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	СтабильныеПериодыНачало.РегистрируетОбъем КАК РегистрируетОбъем,
	|	СтабильныеПериодыНачало.ПомещениеРодитель КАК ПомещениеРодитель,
	|	СтабильныеПериодыНачало.КлючПомещения КАК КлючПомещения,
	|	СтабильныеПериодыНачало.СтроениеПредставление КАК СтроениеПредставление,
	|	СтабильныеПериодыНачало.ПомещениеПредставление КАК ПомещениеПредставление,	
	|	ВЫБОР
	|	  	КОГДА СтабильныеПериодыНачало.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ СтабильныеПериодыНачало.Строение
	|	КОНЕЦ КАК МКД,
	|	ЕСТЬNULL(НастройкаСезонностиУслугМКД.Коэффициент, ЕСТЬNULL(НастройкаСезонностиУслуг.Коэффициент, 1)) КАК КоэффициентНорматива,
	|	ЕСТЬNULL(НастройкаСезонностиУслугМКД.КоэффициентНеПрименятьСезонность, ЕСТЬNULL(НастройкаСезонностиУслуг.КоэффициентНеПрименятьСезонность, 1)) КАК КоэффициентНормативаНеПрименятьСезонность, 
	|	ЕСТЬNULL(НастройкаСезонностиУслугМКД.КорректироватьГодовойОбъем, ЕСТЬNULL(НастройкаСезонностиУслуг.КорректироватьГодовойОбъем, ЛОЖЬ)) КАК КорректироватьГодовойОбъем,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(НастройкаСезонностиУслугМКД.КорректироватьГодовойОбъем, ЕСТЬNULL(НастройкаСезонностиУслуг.КорректироватьГодовойОбъем, ЛОЖЬ))
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЕСТЬNULL(НастройкаСезонностиУслугМКД.НеПрименятьСезонность, ЕСТЬNULL(НастройкаСезонностиУслуг.НеПрименятьСезонность, ЛОЖЬ))
	|	КОНЕЦ КАК НеПрименятьСезонность,
	|	ЕСТЬNULL(НастройкаСезонностиУслугМКД.ОбъемЗаПрошлыйГод, ЕСТЬNULL(НастройкаСезонностиУслуг.ОбъемЗаПрошлыйГод, ЛОЖЬ)) КАК ОбъемЗаПрошлыйГод,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(НастройкаСезонностиУслугМКД.КорректироватьГодовойОбъем, ЕСТЬNULL(НастройкаСезонностиУслуг.КорректироватьГодовойОбъем, ЛОЖЬ))
	|				И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ)
	|			ТОГДА СпособыРасчетаПоНаправлениям.Сезонность
	|		ИНАЧЕ СпособыРасчетаПоНаправлениям.Сезонность
	|	КОНЕЦ КАК Сезонность,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.ВидПлощади, СтабильныеПериодыНачало.ВидПлощадиУслуги) КАК ВидПлощади,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.НормативПоДням, ЛОЖЬ) КАК НормативПоДням,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.НормативПоЧасам, ЛОЖЬ) КАК НормативПоЧасам,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.СпособОпределенияСоциальнойНормы, ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)) КАК СпособОпределенияСоциальнойНормы,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.НачислятьЗаПолныйМесяц, ЛОЖЬ) КАК НачислятьЗаПолныйМесяц,	
	|	ВЫБОР
	|		КОГДА СпособыРасчетаПоНаправлениям.СпособРасчетаНорматива ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)
	|		КОГДА СпособыРасчетаПоНаправлениям.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ПустаяСсылка) 
	|			И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.ВидПлощади, СтабильныеПериодыНачало.ВидПлощадиУслуги) = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади)
	|		КОГДА СпособыРасчетаПоНаправлениям.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ПустаяСсылка) 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)
	|		ИНАЧЕ СпособыРасчетаПоНаправлениям.СпособРасчетаНорматива
	|	КОНЕЦ КАК СпособРасчетаНорматива,	
	|	ВЫБОР
	|		КОГДА СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)
	|		КОГДА СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ПустаяСсылка) 
	|			И НЕ ЕСТЬNULL(СпособыРасчетаПоНаправлениям.ВидПлощади, СтабильныеПериодыНачало.ВидПлощадиУслуги) = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади)
	|		КОГДА СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ПустаяСсылка) 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)
	|		ИНАЧЕ СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива
	|	КОНЕЦ КАК СпособРасчетаСоциальногоНорматива,
	|	ЕСТЬNULL(ПредоставленныеПоказанияПоАбоненту.ПоказанияТекущегоПериода, ЛОЖЬ) КАК ЕстьПоказанияАбонента,	
	|	ЕСТЬNULL(ТипСхемыГВС.ТипСхемы, ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка)) КАК ТипСхемы,
	|	ЕСТЬNULL(ВидыТепловыхПунктов.ВидТепловогоПункта, ЗНАЧЕНИЕ(Перечисление.энргВидыТепловыхПунктов.ПустаяСсылка)) КАК ВидТепловогоПункта,	
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьМОП, 0) КАК ПлощадьМОП,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьАбонентов, 0) КАК ПлощадьАбонентов,
	|	ЕСТЬNULL(ЗначенияПлощадейСтроений.ПлощадьСобственнаяПоставка, 0) КАК ПлощадьСобственнаяПоставка,	
	|	ЕСТЬNULL(ДокументыНачислений.ДокументНачисления, &ДокументНачисленияПустаяСсылка) КАК ДокументНачисления,
	|	ЕСТЬNULL(ДокументыНачислений.ПометкаУдаления, ЛОЖЬ) КАК ДокументНачисленияПометкаУдаления,	
	|	ЛОЖЬ КАК ВыводПрибораУчета,	
	|	ЕСТЬNULL(НаличиеПриборовУчетаСНачалаГода.ПриборВведен, ЛОЖЬ) КАК БылУстановленныйПриборВЭтомГоду,
	|	НЕ НаличиеПриборовУчетаСНачалаГода.ПриборВведен ЕСТЬ NULL КАК ЕстьЗаписьПриборВЭтомГоду,	
	|	ВЫБОР 
	|		КОГДА ЗакрытиеЛицевыхСчетов.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК АбонентЗакрытВТекущемПериоде,
	// АктНедопуска
	|	ВЫБОР 
	|		КОГДА ТочкиПереходаНаНормативПриАктахНедопуска.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	ЕСТЬNULL(ТочкиПереходаНаНормативПриАктахНедопуска.ПовышающийКоэффициент, 1) КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	|	ВЫБОР 
	|		КОГДА НЕ ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.Организация ЕСТЬ NULL 
	| 			  И ЕСТЬNULL(НастройкиСниженияСтоимостиУслуг.ПроцентСнижения, 0) > 0 
	|			ТОГДА НастройкиСниженияСтоимостиУслуг.ПроцентСнижения *                         
	|					ВЫБОР 
	|						КОГДА УвеличениеСниженияСтоимостиУслуг.Организация ЕСТЬ NULL
	|							ТОГДА 1
	|						КОГДА (РАЗНОСТЬДАТ(ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.ПериодНачисленияРегистратора, СтабильныеПериодыНачало.ПериодНачисления, МЕСЯЦ)) + 1 > УвеличениеСниженияСтоимостиУслуг.КоличествоМесяцевПосле 
	|							ТОГДА УвеличениеСниженияСтоимостиУслуг.КоэффициентУвеличения
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентСниженияСтоимости,
	|	СтабильныеПериодыНачало.ТипЗначенияДокРегистратора КАК ТипЗначенияДокРегистратора,
	|	СтабильныеПериодыНачало.ВидОперации КАК ВидОперации
		//|	ЕСТЬNULL(ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.ОбязанностиВыполнены, ИСТИНА) КАК ОбязанностиВыполнены,
	//|	ЕСТЬNULL(НастройкиСниженияСтоимостиУслуг.ПроцентСнижения, 0) КАК ПроцентСниженияСтоимости,
	//|	ЕСТЬNULL(УвеличениеСниженияСтоимостиУслуг.КоличествоМесяцевПосле, 9999) КАК КоличествоМесяцевПосле,
	//|	ЕСТЬNULL(УвеличениеСниженияСтоимостиУслуг.КоэффициентУвеличенияСниженияСтоимости, 0) КАК КоэффициентУвеличенияСниженияСтоимости
	|ПОМЕСТИТЬ СтабильныеПериодыСезонность
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериодыНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО СтабильныеПериодыНачало.Организация = СпособыРасчетаПоНаправлениям.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СпособыРасчетаПоНаправлениям.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СпособыРасчетаПоНаправлениям.Район
	|			И СтабильныеПериодыНачало.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И СтабильныеПериодыНачало.НаправлениеИспользованияТУ = СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкаСезонностиУслуг КАК НастройкаСезонностиУслуг
	|		ПО СтабильныеПериодыНачало.Организация = НастройкаСезонностиУслуг.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = НастройкаСезонностиУслуг.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = НастройкаСезонностиУслуг.Район
	|			И СтабильныеПериодыНачало.Услуга = НастройкаСезонностиУслуг.Услуга
	|			И СтабильныеПериодыНачало.НаправлениеИспользованияТУ = НастройкаСезонностиУслуг.НаправлениеИспользованияТУ
	|			И (НастройкаСезонностиУслуг.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкаСезонностиУслуг КАК НастройкаСезонностиУслугМКД
	|		ПО СтабильныеПериодыНачало.Организация = НастройкаСезонностиУслугМКД.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = НастройкаСезонностиУслугМКД.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = НастройкаСезонностиУслугМКД.Район
	|			И СтабильныеПериодыНачало.Услуга = НастройкаСезонностиУслугМКД.Услуга
	|			И СтабильныеПериодыНачало.НаправлениеИспользованияТУ = НастройкаСезонностиУслугМКД.НаправлениеИспользованияТУ
	|			И ВЫБОР
	|	  			КОГДА СтабильныеПериодыНачало.ЧастныйСектор
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				ИНАЧЕ СтабильныеПериодыНачало.Строение
	|			  КОНЕЦ = НастройкаСезонностиУслугМКД.МКД
	|			И (НастройкаСезонностиУслугМКД.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеПриборовУчетаСНачалаГода КАК НаличиеПриборовУчетаСНачалаГода
	|		ПО СтабильныеПериодыНачало.Организация = НаличиеПриборовУчетаСНачалаГода.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = НаличиеПриборовУчетаСНачалаГода.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = НаличиеПриборовУчетаСНачалаГода.Район
	|			И СтабильныеПериодыНачало.ЧастныйСектор = НаличиеПриборовУчетаСНачалаГода.ЧастныйСектор
	|			И СтабильныеПериодыНачало.Строение = НаличиеПриборовУчетаСНачалаГода.Строение
	|			И СтабильныеПериодыНачало.Помещение = НаличиеПриборовУчетаСНачалаГода.Помещение
	|			И СтабильныеПериодыНачало.Услуга = НаличиеПриборовУчетаСНачалаГода.Услуга
	|			И СтабильныеПериодыНачало.НаправлениеИспользованияТУ = НаличиеПриборовУчетаСНачалаГода.НаправлениеИспользованияТУ	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияПоАбоненту КАК ПредоставленныеПоказанияПоАбоненту
	|		ПО СтабильныеПериодыНачало.Организация = ПредоставленныеПоказанияПоАбоненту.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ПредоставленныеПоказанияПоАбоненту.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ПредоставленныеПоказанияПоАбоненту.Район
	|			И СтабильныеПериодыНачало.ЧастныйСектор = ПредоставленныеПоказанияПоАбоненту.ЧастныйСектор
	|			И СтабильныеПериодыНачало.Строение = ПредоставленныеПоказанияПоАбоненту.Строение
	|			И СтабильныеПериодыНачало.Помещение = ПредоставленныеПоказанияПоАбоненту.Помещение
	|			И СтабильныеПериодыНачало.ПриборУчета = ПредоставленныеПоказанияПоАбоненту.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытиеЛицевыхСчетов КАК ЗакрытиеЛицевыхСчетов
	|		ПО СтабильныеПериодыНачало.Организация = ЗакрытиеЛицевыхСчетов.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ЗакрытиеЛицевыхСчетов.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ЗакрытиеЛицевыхСчетов.Район
	|			И СтабильныеПериодыНачало.ЧастныйСектор = ЗакрытиеЛицевыхСчетов.ЧастныйСектор
	|			И СтабильныеПериодыНачало.Строение = ЗакрытиеЛицевыхСчетов.Строение
	|			И СтабильныеПериодыНачало.Помещение = ЗакрытиеЛицевыхСчетов.Помещение
	|			И СтабильныеПериодыНачало.Абонент = ЗакрытиеЛицевыхСчетов.Абонент		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТипСхемыГВС КАК ТипСхемыГВС
	|		ПО СтабильныеПериодыНачало.Организация = ТипСхемыГВС.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ТипСхемыГВС.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ТипСхемыГВС.Район
	|			И ВЫБОР
	|	  			КОГДА СтабильныеПериодыНачало.ЧастныйСектор
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				ИНАЧЕ СтабильныеПериодыНачало.Строение
	|			  КОНЕЦ = ТипСхемыГВС.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыТепловыхПунктов КАК ВидыТепловыхПунктов
	|		ПО СтабильныеПериодыНачало.Организация = ВидыТепловыхПунктов.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ВидыТепловыхПунктов.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ВидыТепловыхПунктов.Район
	|			И ВЫБОР
	|	  			КОГДА СтабильныеПериодыНачало.ЧастныйСектор
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				ИНАЧЕ СтабильныеПериодыНачало.Строение
	|			  КОНЕЦ = ВидыТепловыхПунктов.МКД		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО СтабильныеПериодыНачало.Организация = ДокументыНачислений.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ДокументыНачислений.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ДокументыНачислений.Район
	|			И ВЫБОР
	|	  			КОГДА СтабильныеПериодыНачало.ЧастныйСектор
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				ИНАЧЕ СтабильныеПериодыНачало.Строение
	|			 КОНЕЦ = ДокументыНачислений.МКД	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСтроений КАК ЗначенияПлощадейСтроений
	|		ПО СтабильныеПериодыНачало.Организация = ЗначенияПлощадейСтроений.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ЗначенияПлощадейСтроений.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ЗначенияПлощадейСтроений.Район
	|			И СтабильныеПериодыНачало.Услуга = ЗначенияПлощадейСтроений.Услуга
	|			И (НЕ СтабильныеПериодыНачало.ЧастныйСектор)
	|			И СтабильныеПериодыНачало.Строение = ЗначенияПлощадейСтроений.МКД
	// АктНедопуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиПереходаНаНормативПриАктахНедопуска КАК ТочкиПереходаНаНормативПриАктахНедопуска
	|		ПО СтабильныеПериодыНачало.Организация = ТочкиПереходаНаНормативПриАктахНедопуска.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ТочкиПереходаНаНормативПриАктахНедопуска.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ТочкиПереходаНаНормативПриАктахНедопуска.Район
	|			И СтабильныеПериодыНачало.ЧастныйСектор = ТочкиПереходаНаНормативПриАктахНедопуска.ЧастныйСектор
	|			И СтабильныеПериодыНачало.Строение = ТочкиПереходаНаНормативПриАктахНедопуска.Строение
	|			И СтабильныеПериодыНачало.Помещение = ТочкиПереходаНаНормативПриАктахНедопуска.Помещение
	|			И СтабильныеПериодыНачало.Услуга = ТочкиПереходаНаНормативПриАктахНедопуска.Услуга
	|			И СтабильныеПериодыНачало.ТочкаУчета = ТочкиПереходаНаНормативПриАктахНедопуска.ТочкаУчета
	|			И СтабильныеПериодыНачало.НомерПозиции <= ТочкиПереходаНаНормативПриАктахНедопуска.НомерПозиции
	// АктНедопуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика КАК ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика
	|		ПО СтабильныеПериодыНачало.Организация = ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.Район
	|			И СтабильныеПериодыНачало.ЧастныйСектор = ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.ЧастныйСектор
	|			И СтабильныеПериодыНачало.Строение = ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.Строение
	|			И СтабильныеПериодыНачало.Помещение = ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.Помещение
	|			И СтабильныеПериодыНачало.ТочкаУчета = ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСниженияСтоимостиУслуг КАК НастройкиСниженияСтоимостиУслуг
	|		ПО СтабильныеПериодыНачало.Организация = НастройкиСниженияСтоимостиУслуг.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = НастройкиСниженияСтоимостиУслуг.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = НастройкиСниженияСтоимостиУслуг.Район
	|			И СтабильныеПериодыНачало.Услуга = НастройкиСниженияСтоимостиУслуг.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ УвеличениеСниженияСтоимостиУслуг КАК УвеличениеСниженияСтоимостиУслуг
	|		ПО СтабильныеПериодыНачало.Организация = УвеличениеСниженияСтоимостиУслуг.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = УвеличениеСниженияСтоимостиУслуг.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = УвеличениеСниженияСтоимостиУслуг.Район
	|			И СтабильныеПериодыНачало.Услуга = УвеличениеСниженияСтоимостиУслуг.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыСезонность.Организация КАК Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район КАК Район,
	|	СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыСезонность.Строение КАК Строение,
	|	СтабильныеПериодыСезонность.ПомещениеРодитель КАК Помещение,
	|	СтабильныеПериодыСезонность.ПериодРегистрации КАК ПериодРегистрации,
	|	ЛОЖЬ КАК ЭтоИзменениеТарифа
	|ПОМЕСТИТЬ НомераСтрокИзмененияПоРодительскимПомещениям
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО СтабильныеПериодыСезонность.Помещение = энргПомещения.Ссылка
	|ГДЕ
	|	НЕ СтабильныеПериодыСезонность.ПомещениеРодитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|	И НЕ СтабильныеПериодыСезонность.ПомещениеРодитель = СтабильныеПериодыСезонность.Помещение
	|	И НЕ СтабильныеПериодыСезонность.НомерПозиции = 0
	|	И НЕ (СтабильныеПериодыСезонность.Организация, СтабильныеПериодыСезонность.ПериодНачисления, СтабильныеПериодыСезонность.Район, СтабильныеПериодыСезонность.ЧастныйСектор, СтабильныеПериодыСезонность.Строение, СтабильныеПериодыСезонность.ПомещениеРодитель, СтабильныеПериодыСезонность.ПериодРегистрации) В
	|				(ВЫБРАТЬ
	|					СтабильныеПериодыСезонностьРодители.Организация,
	|					СтабильныеПериодыСезонностьРодители.ПериодНачисления,
	|					СтабильныеПериодыСезонностьРодители.Район,
	|					СтабильныеПериодыСезонностьРодители.ЧастныйСектор,
	|					СтабильныеПериодыСезонностьРодители.Строение,
	|					СтабильныеПериодыСезонностьРодители.Помещение,
	|					СтабильныеПериодыСезонностьРодители.ПериодРегистрации
	|				ИЗ
	|					СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонностьРодители
	|				ГДЕ
	|					НЕ СтабильныеПериодыСезонностьРодители.НомерПозиции = 0
	|					И СтабильныеПериодыСезонностьРодители.ПомещениеРодитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))	
	|	И энргПомещения.ТипПомещения <> ЗНАЧЕНИЕ(Перечисление.энргТипыПомещений.Секция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыСезонность.Организация КАК Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район КАК Район,
	|	СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыСезонность.Строение КАК Строение,
	|	СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.ПериодРегистрации КАК ПериодРегистрации,
	|	ЛОЖЬ КАК ЭтоИзменениеТарифа
	|ПОМЕСТИТЬ НомераСтрокИзмененияПоПодчиненнымПомещениям
	|ИЗ
	|	НомераСтрокИзмененияПоРодительскимПомещениям КАК НомераСтрокИзмененияПоРодительскимПомещениям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ПО НомераСтрокИзмененияПоРодительскимПомещениям.Организация = СтабильныеПериодыСезонность.Организация
	|			И НомераСтрокИзмененияПоРодительскимПомещениям.ПериодНачисления = СтабильныеПериодыСезонность.ПериодНачисления
	|			И НомераСтрокИзмененияПоРодительскимПомещениям.Район = СтабильныеПериодыСезонность.Район
	|			И НомераСтрокИзмененияПоРодительскимПомещениям.ЧастныйСектор = СтабильныеПериодыСезонность.ЧастныйСектор
	|			И НомераСтрокИзмененияПоРодительскимПомещениям.Строение = СтабильныеПериодыСезонность.Строение
	|			И НомераСтрокИзмененияПоРодительскимПомещениям.Помещение = СтабильныеПериодыСезонность.ПомещениеРодитель
	|			И (НЕ СтабильныеПериодыСезонность.ПомещениеРодитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НомераСтрокИзмененияПоРодительскимПомещениям.Организация,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.ПериодНачисления,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.Район,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.ЧастныйСектор,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.Строение,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.Помещение,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.ПериодРегистрации,
	|	НомераСтрокИзмененияПоРодительскимПомещениям.ЭтоИзменениеТарифа
	|ИЗ
	|	НомераСтрокИзмененияПоРодительскимПомещениям КАК НомераСтрокИзмененияПоРодительскимПомещениям 	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа
	|ПОМЕСТИТЬ НомераСтрокИзмененияСезонности
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыСезонность.Организация КАК Организация,
	|		СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыСезонность.Район КАК Район,
	|		СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыСезонность.Строение КАК Строение,
	|		СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|		СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|		ПериодыИзмененияСезонности.Период КАК ПериодРегистрации,
	|		ЛОЖЬ КАК ЭтоИзменениеТарифа
	|	ИЗ
	|		СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыИзмененияСезонности КАК ПериодыИзмененияСезонности
	|			ПО СтабильныеПериодыСезонность.Организация = ПериодыИзмененияСезонности.Организация
	|				И СтабильныеПериодыСезонность.Район = ПериодыИзмененияСезонности.Район
	|				И СтабильныеПериодыСезонность.ПериодНачисления = ПериодыИзмененияСезонности.ПериодНачисления
	|				И СтабильныеПериодыСезонность.Сезонность = ПериодыИзмененияСезонности.Сезонность
	|				И (ВЫБОР
	|					КОГДА СтабильныеПериодыСезонность.НачислятьЗаПолныйМесяц
	|							И (ПериодыИзмененияСезонности.Период МЕЖДУ СтабильныеПериодыСезонность.НачалоОП И СтабильныеПериодыСезонность.ЗавершениеОП)
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтабильныеПериодыСезонность.Организация,
	|		СтабильныеПериодыСезонность.ПериодНачисления,
	|		СтабильныеПериодыСезонность.Район,
	|		СтабильныеПериодыСезонность.ЧастныйСектор,
	|		СтабильныеПериодыСезонность.Строение,
	|		СтабильныеПериодыСезонность.Помещение,
	|		СтабильныеПериодыСезонность.ТочкаУчета,
	|		ИзменениеТарифовВПериоде.ДатаСменыТарифа,
	|		ИСТИНА
	|	ИЗ
	|		СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменениеТарифовВПериоде КАК ИзменениеТарифовВПериоде
	|			ПО СтабильныеПериодыСезонность.Организация = ИзменениеТарифовВПериоде.Организация
	|				И СтабильныеПериодыСезонность.ПериодНачисления = ИзменениеТарифовВПериоде.ПериодНачисления
	|				И СтабильныеПериодыСезонность.Услуга = ИзменениеТарифовВПериоде.Услуга
	|				И СтабильныеПериодыСезонность.Поставщик = ИзменениеТарифовВПериоде.Поставщик
	|				И СтабильныеПериодыСезонность.ТарифнаяГруппа = ИзменениеТарифовВПериоде.ГруппаПотребителей ) КАК ВложенныйЗапрос	
	//|				И (СтабильныеПериодыСезонность.ЕстьПоказанияАбонента)) КАК ВложенныйЗапрос	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа
	|ПОМЕСТИТЬ НомераСтрокИзмененияСезонностиЗависимыхТочекТочки
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыСезонность.Организация КАК Организация,
	|		СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыСезонность.Район КАК Район,
	|		СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыСезонностьЗависимыхТочек.Строение КАК Строение,
	|		СтабильныеПериодыСезонностьЗависимыхТочек.Помещение КАК Помещение,
	|		СтабильныеПериодыСезонностьЗависимыхТочек.ЗависимаяТочкаУчета КАК ТочкаУчета,
	|		СтабильныеПериодыСезонностьЗависимыхТочек.ПериодРегистрации КАК ПериодРегистрации,
	|		ЛОЖЬ КАК ЭтоИзменениеТарифа
	|	ИЗ
	|		СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонностьЗависимыхТочек
	|			ПО СтабильныеПериодыСезонность.Организация = СтабильныеПериодыСезонностьЗависимыхТочек.Организация
	|				И СтабильныеПериодыСезонность.ПериодНачисления = СтабильныеПериодыСезонностьЗависимыхТочек.ПериодНачисления
	|				И СтабильныеПериодыСезонность.Район = СтабильныеПериодыСезонностьЗависимыхТочек.Район
	|				И СтабильныеПериодыСезонность.ЧастныйСектор = СтабильныеПериодыСезонностьЗависимыхТочек.ЧастныйСектор
	//|				И СтабильныеПериодыСезонность.Строение = СтабильныеПериодыСезонностьЗависимыхТочек.Строение
	//|				И СтабильныеПериодыСезонность.Помещение = СтабильныеПериодыСезонностьЗависимыхТочек.Помещение
	|				И СтабильныеПериодыСезонность.ТочкаУчета = СтабильныеПериодыСезонностьЗависимыхТочек.ЗависимаяТочкаУчета
	|				И (НЕ СтабильныеПериодыСезонностьЗависимыхТочек.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	|				И НЕ СтабильныеПериодыСезонностьЗависимыхТочек.ДокРегистратор ССЫЛКА Документ.энргНачисление
	|				И НЕ СтабильныеПериодыСезонностьЗависимыхТочек.ДокРегистратор ССЫЛКА Документ.энргВводНачальныхОстатков
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НомераСтрокИзмененияСезонности.Организация,
	|		НомераСтрокИзмененияСезонности.ПериодНачисления,
	|		НомераСтрокИзмененияСезонности.Район,
	|		НомераСтрокИзмененияСезонности.ЧастныйСектор,
	|		НомераСтрокИзмененияСезонности.Строение,
	|		НомераСтрокИзмененияСезонности.Помещение,
	|		НомераСтрокИзмененияСезонности.ТочкаУчета,
	|		НомераСтрокИзмененияСезонности.ПериодРегистрации,
	|		НомераСтрокИзмененияСезонности.ЭтоИзменениеТарифа
	|	ИЗ
	|		НомераСтрокИзмененияСезонности КАК НомераСтрокИзмененияСезонности
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.Организация,
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.ПериодНачисления,
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.Район,
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.ЧастныйСектор,
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.Строение,
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.Помещение,
	|		NULL,
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.ПериодРегистрации,
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям.ЭтоИзменениеТарифа
	|	ИЗ
	|		НомераСтрокИзмененияПоПодчиненнымПомещениям КАК НомераСтрокИзмененияПоПодчиненнымПомещениям) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа
	|ПОМЕСТИТЬ НомераСтрокИзмененияСезонностиПоЗависимымТочкам
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыСезонность.Организация КАК Организация,
	|		СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыСезонность.Район КАК Район,
	|		СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыСезонность.Строение КАК Строение,
	|		СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|		СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ПериодРегистрации КАК ПериодРегистрации,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа
	|	ИЗ
	|		СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокИзмененияСезонностиЗависимыхТочекТочки КАК НомераСтрокИзмененияСезонностиЗависимыхТочекТочки
	|			ПО СтабильныеПериодыСезонность.Организация = НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Организация
	|				И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ПериодНачисления
	|				И СтабильныеПериодыСезонность.Район = НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Район
	|				И СтабильныеПериодыСезонность.ЧастныйСектор = НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ЧастныйСектор
	|				И СтабильныеПериодыСезонность.Строение = НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Строение
	|				И СтабильныеПериодыСезонность.Помещение = НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Помещение
	|				И СтабильныеПериодыСезонность.ЗависимаяТочкаУчета = НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ТочкаУчета
	|				И (НЕ СтабильныеПериодыСезонность.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Организация,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ПериодНачисления,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Район,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ЧастныйСектор,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Строение,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.Помещение,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ТочкаУчета,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ПериодРегистрации,
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки.ЭтоИзменениеТарифа
	|	ИЗ
	|		НомераСтрокИзмененияСезонностиЗависимыхТочекТочки КАК НомераСтрокИзмененияСезонностиЗависимыхТочекТочки) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа
	|ПОМЕСТИТЬ ИзменениеНомеровСтрокРодитескихТочек
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыСезонность.Организация КАК Организация,
	|		СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыСезонность.Район КАК Район,
	|		СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыСезонность.Строение КАК Строение,
	|		СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|		СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|		СтабильныеПериодыСезонностьРодительскиеТочки.ПериодРегистрации КАК ПериодРегистрации,
	|		ЛОЖЬ КАК ЭтоИзменениеТарифа
	|	ИЗ
	|		СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонностьРодительскиеТочки
	|			ПО СтабильныеПериодыСезонность.Организация = СтабильныеПериодыСезонностьРодительскиеТочки.Организация
	|				И СтабильныеПериодыСезонность.ПериодНачисления = СтабильныеПериодыСезонностьРодительскиеТочки.ПериодНачисления
	|				И СтабильныеПериодыСезонность.Район = СтабильныеПериодыСезонностьРодительскиеТочки.Район
	|				И СтабильныеПериодыСезонность.ЧастныйСектор = СтабильныеПериодыСезонностьРодительскиеТочки.ЧастныйСектор
	|				И СтабильныеПериодыСезонность.Строение = СтабильныеПериодыСезонностьРодительскиеТочки.Строение
	|				И СтабильныеПериодыСезонность.Помещение = СтабильныеПериодыСезонностьРодительскиеТочки.Помещение
	|				И СтабильныеПериодыСезонность.ТочкаУчетаРодитель = СтабильныеПериодыСезонностьРодительскиеТочки.ТочкаУчета
	|				И НЕ СтабильныеПериодыСезонностьРодительскиеТочки.НомерПозиции = 0
	|				И (НЕ СтабильныеПериодыСезонность.ТочкаУчетаРодитель = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|    	
	|	ВЫБРАТЬ
	|		СтабильныеПериодыСезонность.Организация КАК Организация,
	|		СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыСезонность.Район КАК Район,
	|		СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыСезонность.Строение КАК Строение,
	|		СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|		СтабильныеПериодыСезонность.ТочкаУчетаРодитель КАК ТочкаУчета,
	|		НомераСтрокИзмененияСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|		ЛОЖЬ КАК ЭтоИзменениеТарифа
	|	ИЗ
	|		СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокИзмененияСезонности КАК НомераСтрокИзмененияСезонности
	|			ПО СтабильныеПериодыСезонность.Организация = НомераСтрокИзмененияСезонности.Организация
	|				И СтабильныеПериодыСезонность.ПериодНачисления = НомераСтрокИзмененияСезонности.ПериодНачисления
	|				И СтабильныеПериодыСезонность.Район = НомераСтрокИзмененияСезонности.Район
	|				И СтабильныеПериодыСезонность.ЧастныйСектор = НомераСтрокИзмененияСезонности.ЧастныйСектор
	|				И СтабильныеПериодыСезонность.Строение = НомераСтрокИзмененияСезонности.Строение
	|				И СтабильныеПериодыСезонность.Помещение = НомераСтрокИзмененияСезонности.Помещение
	|				И СтабильныеПериодыСезонность.ТочкаУчета = НомераСтрокИзмененияСезонности.ТочкаУчета
	|				И (НЕ СтабильныеПериодыСезонность.ТочкаУчетаРодитель = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))	
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.Организация,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.ПериодНачисления,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.Район,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.ЧастныйСектор,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.Строение,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.Помещение,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.ТочкаУчета,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.ПериодРегистрации,
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам.ЭтоИзменениеТарифа
	|	ИЗ
	|		НомераСтрокИзмененияСезонностиПоЗависимымТочкам КАК НомераСтрокИзмененияСезонностиПоЗависимымТочкам) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа
	|ПОМЕСТИТЬ ИзменениеНомеровСтрокТочекУчетаВПодчинении
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыСезонность.Организация КАК Организация,
	|		СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыСезонность.Район КАК Район,
	|		СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыСезонность.Строение КАК Строение,
	|		СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|		СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|		ИзменениеНомеровСтрокРодитескихТочек.ПериодРегистрации КАК ПериодРегистрации,
	|		ЛОЖЬ КАК ЭтоИзменениеТарифа
	|	ИЗ
	|		СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность 
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменениеНомеровСтрокРодитескихТочек КАК ИзменениеНомеровСтрокРодитескихТочек
	|			ПО СтабильныеПериодыСезонность.Организация = ИзменениеНомеровСтрокРодитескихТочек.Организация
	|				И СтабильныеПериодыСезонность.ПериодНачисления = ИзменениеНомеровСтрокРодитескихТочек.ПериодНачисления
	|				И СтабильныеПериодыСезонность.Район = ИзменениеНомеровСтрокРодитескихТочек.Район
	|				И СтабильныеПериодыСезонность.ЧастныйСектор = ИзменениеНомеровСтрокРодитескихТочек.ЧастныйСектор
	|				И СтабильныеПериодыСезонность.Строение = ИзменениеНомеровСтрокРодитескихТочек.Строение
	|				И СтабильныеПериодыСезонность.Помещение = ИзменениеНомеровСтрокРодитескихТочек.Помещение
	|				И СтабильныеПериодыСезонность.ТочкаУчетаРодитель = ИзменениеНомеровСтрокРодитескихТочек.ТочкаУчета
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИзменениеНомеровСтрокРодитескихТочек.Организация,
	|		ИзменениеНомеровСтрокРодитескихТочек.ПериодНачисления,
	|		ИзменениеНомеровСтрокРодитескихТочек.Район,
	|		ИзменениеНомеровСтрокРодитескихТочек.ЧастныйСектор,
	|		ИзменениеНомеровСтрокРодитескихТочек.Строение,
	|		ИзменениеНомеровСтрокРодитескихТочек.Помещение,
	|		ИзменениеНомеровСтрокРодитескихТочек.ТочкаУчета,
	|		ИзменениеНомеровСтрокРодитескихТочек.ПериодРегистрации,
	|		ИзменениеНомеровСтрокРодитескихТочек.ЭтоИзменениеТарифа
	|	ИЗ
	|		ИзменениеНомеровСтрокРодитескихТочек КАК ИзменениеНомеровСтрокРодитескихТочек) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыСезонность.Организация КАК Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район КАК Район,
	|	СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыСезонность.Строение КАК Строение,
	|	СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|	СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыСезонность.Услуга КАК Услуга,
	|	ИзменениеНомеровСтрокТочекУчетаВПодчинении.ПериодРегистрации КАК ПериодРегистрации,
	|	ИзменениеНомеровСтрокТочекУчетаВПодчинении.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа,
	|	МАКСИМУМ(СтабильныеПериодыСезонность.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ ИзменениеНомеровСтрок
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменениеНомеровСтрокТочекУчетаВПодчинении КАК ИзменениеНомеровСтрокТочекУчетаВПодчинении
	|		ПО СтабильныеПериодыСезонность.Организация = ИзменениеНомеровСтрокТочекУчетаВПодчинении.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = ИзменениеНомеровСтрокТочекУчетаВПодчинении.ПериодНачисления
	|			И СтабильныеПериодыСезонность.Район = ИзменениеНомеровСтрокТочекУчетаВПодчинении.Район
	|			И СтабильныеПериодыСезонность.ЧастныйСектор = ИзменениеНомеровСтрокТочекУчетаВПодчинении.ЧастныйСектор
	|			И СтабильныеПериодыСезонность.Строение = ИзменениеНомеровСтрокТочекУчетаВПодчинении.Строение
	|			И СтабильныеПериодыСезонность.Помещение = ИзменениеНомеровСтрокТочекУчетаВПодчинении.Помещение
	|			И (ВЫБОР
	|				КОГДА ИзменениеНомеровСтрокТочекУчетаВПодчинении.ТочкаУчета ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтабильныеПериодыСезонность.ТочкаУчета = ИзменениеНомеровСтрокТочекУчетаВПодчинении.ТочкаУчета
	|			КОНЕЦ)
	|			И СтабильныеПериодыСезонность.ПериодРегистрации < ИзменениеНомеровСтрокТочекУчетаВПодчинении.ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыСезонность.Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район,
	|	СтабильныеПериодыСезонность.ЧастныйСектор,
	|	СтабильныеПериодыСезонность.Строение,
	|	СтабильныеПериодыСезонность.Помещение,
	|	СтабильныеПериодыСезонность.ТочкаУчета,
	|	СтабильныеПериодыСезонность.Услуга,
	|	ИзменениеНомеровСтрокТочекУчетаВПодчинении.ПериодРегистрации,
	|	ИзменениеНомеровСтрокТочекУчетаВПодчинении.ЭтоИзменениеТарифа	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзменениеНомеровСтрок.Организация КАК Организация,
	|	ИзменениеНомеровСтрок.ПериодНачисления КАК ПериодНачисления,
	|	ИзменениеНомеровСтрок.Район КАК Район,
	|	ИзменениеНомеровСтрок.ЧастныйСектор КАК ЧастныйСектор,
	|	ИзменениеНомеровСтрок.Строение КАК Строение,
	|	ИзменениеНомеровСтрок.Помещение КАК Помещение,
	|	ИзменениеНомеровСтрок.ТочкаУчета КАК ТочкаУчета,
	|	ИзменениеНомеровСтрок.Услуга КАК Услуга,
	|	ИзменениеНомеровСтрок.ПериодРегистрации КАК ПериодРегистрации,
	|	ИзменениеНомеровСтрок.ЭтоИзменениеТарифа КАК ЭтоИзменениеТарифа,
	|	ИзменениеНомеровСтрок.НомерПозиции КАК НомерПозиции,
	|	СУММА(ВЫБОР
	|			КОГДА ИзменениеНомеровСтрокПраво.Организация ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК УвеличениеНомераПозиции
	|ПОМЕСТИТЬ ИзменениеНомеровСтрокУвеличениеПозиций
	|ИЗ
	|	ИзменениеНомеровСтрок КАК ИзменениеНомеровСтрок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИзменениеНомеровСтрок КАК ИзменениеНомеровСтрокПраво
	|		ПО ИзменениеНомеровСтрок.Организация = ИзменениеНомеровСтрокПраво.Организация
	|			И ИзменениеНомеровСтрок.ПериодНачисления = ИзменениеНомеровСтрокПраво.ПериодНачисления
	|			И ИзменениеНомеровСтрок.Район = ИзменениеНомеровСтрокПраво.Район
	|			И ИзменениеНомеровСтрок.ЧастныйСектор = ИзменениеНомеровСтрокПраво.ЧастныйСектор
	|			И ИзменениеНомеровСтрок.Строение = ИзменениеНомеровСтрокПраво.Строение
	|			И ИзменениеНомеровСтрок.Помещение = ИзменениеНомеровСтрокПраво.Помещение
	|			И ИзменениеНомеровСтрок.ТочкаУчета = ИзменениеНомеровСтрокПраво.ТочкаУчета
	|			И ИзменениеНомеровСтрок.Услуга = ИзменениеНомеровСтрокПраво.Услуга
	|			И (ВЫБОР
	|				КОГДА ИзменениеНомеровСтрок.НомерПозиции = ИзменениеНомеровСтрокПраво.НомерПозиции
	|					ТОГДА ИзменениеНомеровСтрок.ПериодРегистрации > ИзменениеНомеровСтрокПраво.ПериодРегистрации
	|				ИНАЧЕ ИзменениеНомеровСтрок.НомерПозиции > ИзменениеНомеровСтрокПраво.НомерПозиции
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзменениеНомеровСтрок.Организация,
	|	ИзменениеНомеровСтрок.ПериодНачисления,
	|	ИзменениеНомеровСтрок.Район,
	|	ИзменениеНомеровСтрок.ЧастныйСектор,
	|	ИзменениеНомеровСтрок.Строение,
	|	ИзменениеНомеровСтрок.Помещение,
	|	ИзменениеНомеровСтрок.ТочкаУчета,
	|	ИзменениеНомеровСтрок.Услуга,
	|	ИзменениеНомеровСтрок.ПериодРегистрации,
	|	ИзменениеНомеровСтрок.ЭтоИзменениеТарифа,
	|	ИзменениеНомеровСтрок.НомерПозиции	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыСезонность.Организация КАК Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район КАК Район,
	|	СтабильныеПериодыСезонность.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыСезонность.Строение КАК Строение,
	|	СтабильныеПериодыСезонность.Помещение КАК Помещение,
	|	СтабильныеПериодыСезонность.Услуга КАК Услуга,
	|	СтабильныеПериодыСезонность.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериодыСезонность.НомерПозиции КАК НомерПозиции,
	|	СУММА(1) КАК КоличествоСтрокПеред
	|ПОМЕСТИТЬ ДобавляемыеСтрокиПередНомеромПозиции
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменениеНомеровСтрок КАК ИзменениеНомеровСтрок
	|		ПО СтабильныеПериодыСезонность.Организация = ИзменениеНомеровСтрок.Организация
	|			И СтабильныеПериодыСезонность.ПериодНачисления = ИзменениеНомеровСтрок.ПериодНачисления
	|			И СтабильныеПериодыСезонность.Район = ИзменениеНомеровСтрок.Район
	|			И СтабильныеПериодыСезонность.ЧастныйСектор = ИзменениеНомеровСтрок.ЧастныйСектор
	|			И СтабильныеПериодыСезонность.Строение = ИзменениеНомеровСтрок.Строение
	|			И СтабильныеПериодыСезонность.Помещение = ИзменениеНомеровСтрок.Помещение
	|			И СтабильныеПериодыСезонность.Услуга = ИзменениеНомеровСтрок.Услуга
	|			И СтабильныеПериодыСезонность.ТочкаУчета = ИзменениеНомеровСтрок.ТочкаУчета
	|			И СтабильныеПериодыСезонность.НомерПозиции > ИзменениеНомеровСтрок.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыСезонность.Организация,
	|	СтабильныеПериодыСезонность.ПериодНачисления,
	|	СтабильныеПериодыСезонность.Район,
	|	СтабильныеПериодыСезонность.ЧастныйСектор,
	|	СтабильныеПериодыСезонность.Строение,
	|	СтабильныеПериодыСезонность.Помещение,
	|	СтабильныеПериодыСезонность.Услуга,
	|	СтабильныеПериодыСезонность.ТочкаУчета,
	|	СтабильныеПериодыСезонность.НомерПозиции	
	|;
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыСезонность","НомерПозиции,ДокРегистратор,ДатаРегистратора,ПериодРегистрации",Истина,Ложь) + "
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	СтабильныеПериодыСезонность.МКД КАК МКД,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.Сезонность КАК Сезонность,
	|	СтабильныеПериодыСезонность.ВидПлощади КАК ВидПлощади,
	|	СтабильныеПериодыСезонность.НормативПоДням КАК НормативПоДням,
	|	СтабильныеПериодыСезонность.НормативПоЧасам КАК НормативПоЧасам,
	|	СтабильныеПериодыСезонность.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СтабильныеПериодыСезонность.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,	
	|	СтабильныеПериодыСезонность.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СтабильныеПериодыСезонность.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,	
	|	СтабильныеПериодыСезонность.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	СтабильныеПериодыСезонность.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	СтабильныеПериодыСезонность.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,		
	|	СтабильныеПериодыСезонность.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	СтабильныеПериодыСезонность.РегистрируетОбъем КАК РегистрируетОбъем,	
	|	СтабильныеПериодыСезонность.ФизЛицо КАК ФизЛицо,
	|	СтабильныеПериодыСезонность.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	СтабильныеПериодыСезонность.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыСезонность.ВидТепловогоПункта КАК ВидТепловогоПункта,	
	|	СтабильныеПериодыСезонность.ПомещениеРодитель КАК ПомещениеРодитель,	
	|	СтабильныеПериодыСезонность.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	СтабильныеПериодыСезонность.ПлощадьМОП КАК ПлощадьМОП,
	|	СтабильныеПериодыСезонность.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	СтабильныеПериодыСезонность.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,	
	|	СтабильныеПериодыСезонность.ДокументНачисления КАК ДокументНачисления,
	|	СтабильныеПериодыСезонность.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,	
	|	СтабильныеПериодыСезонность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	СтабильныеПериодыСезонность.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	СтабильныеПериодыСезонность.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	СтабильныеПериодыСезонность.КлючПомещения,
	|	СтабильныеПериодыСезонность.СтроениеПредставление КАК СтроениеПредставление,
	|	СтабильныеПериодыСезонность.ПомещениеПредставление КАК ПомещениеПредставление,
	|	СтабильныеПериодыСезонность.АбонентЗакрытВТекущемПериоде,
	|	СтабильныеПериодыСезонность.НомерПозиции + ЕСТЬNULL(ДобавляемыеСтрокиПередНомеромПозиции.КоличествоСтрокПеред, 0) КАК НомерПозиции,
	|	ЕСТЬNULL(ДобавляемыеСтрокиПередНомеромПозиции.КоличествоСтрокПеред, 0) КАК УвеличениеПозиции,		
	|	СтабильныеПериодыСезонность.ПериодРегистрации,
	|	СтабильныеПериодыСезонность.ДокРегистратор,
	|	СтабильныеПериодыСезонность.ДатаРегистратора,
	// АктНедопуска
	|	СтабильныеПериодыСезонность.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	СтабильныеПериодыСезонность.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	СтабильныеПериодыСезонность.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	СтабильныеПериодыСезонность.ТипЗначенияДокРегистратора КАК ТипЗначенияДокРегистратора,
	|	СтабильныеПериодыСезонность.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ СтабильныеПериодыПослеИзмененияСезонности
	|ИЗ
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДобавляемыеСтрокиПередНомеромПозиции КАК ДобавляемыеСтрокиПередНомеромПозиции
	|		ПО СтабильныеПериодыСезонность.Организация = ДобавляемыеСтрокиПередНомеромПозиции.Организация 
	|			И СтабильныеПериодыСезонность.ПериодНачисления = ДобавляемыеСтрокиПередНомеромПозиции.ПериодНачисления
	|			И СтабильныеПериодыСезонность.Район = ДобавляемыеСтрокиПередНомеромПозиции.Район
	|			И СтабильныеПериодыСезонность.ЧастныйСектор = ДобавляемыеСтрокиПередНомеромПозиции.ЧастныйСектор
	|			И СтабильныеПериодыСезонность.Строение = ДобавляемыеСтрокиПередНомеромПозиции.Строение
	|			И СтабильныеПериодыСезонность.Помещение = ДобавляемыеСтрокиПередНомеромПозиции.Помещение
	|			И СтабильныеПериодыСезонность.ТочкаУчета = ДобавляемыеСтрокиПередНомеромПозиции.ТочкаУчета
	|			И СтабильныеПериодыСезонность.Услуга = ДобавляемыеСтрокиПередНомеромПозиции.Услуга
	|			И СтабильныеПериодыСезонность.НомерПозиции = ДобавляемыеСтрокиПередНомеромПозиции.НомерПозиции
	|
	|ОБЪЕДИНИТЬ ВСЕ	
	|
	|ВЫБРАТЬ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыСезонность","НомерПозиции,ДокРегистратор,ДатаРегистратора,ПериодРегистрации",Истина,Ложь) + "
	|	СтабильныеПериодыСезонность.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыСезонность.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыСезонность.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыСезонность.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	СтабильныеПериодыСезонность.МКД КАК МКД,
	|	СтабильныеПериодыСезонность.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыСезонность.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	СтабильныеПериодыСезонность.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыСезонность.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыСезонность.Сезонность КАК Сезонность,
	|	СтабильныеПериодыСезонность.ВидПлощади КАК ВидПлощади,
	|	СтабильныеПериодыСезонность.НормативПоДням КАК НормативПоДням,
	|	СтабильныеПериодыСезонность.НормативПоЧасам КАК НормативПоЧасам,
	|	СтабильныеПериодыСезонность.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СтабильныеПериодыСезонность.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,
	|	СтабильныеПериодыСезонность.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СтабильныеПериодыСезонность.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,
	|	СтабильныеПериодыСезонность.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	СтабильныеПериодыСезонность.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	СтабильныеПериодыСезонность.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,		
	|	СтабильныеПериодыСезонность.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	СтабильныеПериодыСезонность.РегистрируетОбъем КАК РегистрируетОбъем,	
	|	СтабильныеПериодыСезонность.ФизЛицо КАК ФизЛицо,
	|	СтабильныеПериодыСезонность.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	СтабильныеПериодыСезонность.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыСезонность.ВидТепловогоПункта КАК ВидТепловогоПункта,	
	|	СтабильныеПериодыСезонность.ПомещениеРодитель КАК ПомещениеРодитель,	
	|	СтабильныеПериодыСезонность.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	СтабильныеПериодыСезонность.ПлощадьМОП КАК ПлощадьМОП,
	|	СтабильныеПериодыСезонность.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	СтабильныеПериодыСезонность.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,	
	|	СтабильныеПериодыСезонность.ДокументНачисления КАК ДокументНачисления,
	|	СтабильныеПериодыСезонность.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,	
	|	СтабильныеПериодыСезонность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	СтабильныеПериодыСезонность.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	СтабильныеПериодыСезонность.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	СтабильныеПериодыСезонность.КлючПомещения,
	|	СтабильныеПериодыСезонность.СтроениеПредставление КАК СтроениеПредставление,
	|	СтабильныеПериодыСезонность.ПомещениеПредставление КАК ПомещениеПредставление,
	|	СтабильныеПериодыСезонность.АбонентЗакрытВТекущемПериоде,
	|	СтабильныеПериодыСезонность.НомерПозиции + 1 + ИзменениеНомеровСтрокУвеличениеПозиций.УвеличениеНомераПозиции КАК НомерПозиции,
	|	1 + ИзменениеНомеровСтрокУвеличениеПозиций.УвеличениеНомераПозиции КАК УвеличениеПозиции,
	|	ИзменениеНомеровСтрокУвеличениеПозиций.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА ИзменениеНомеровСтрокУвеличениеПозиций.ЭтоИзменениеТарифа
	|			ТОГДА ЗНАЧЕНИЕ(Документ.энргУстановитьЗначениеТарифа.ПустаяСсылка)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДокРегистратор,
	|	ДАТАВРЕМЯ(1,1,1) КАК ДатаРегистратора,
	// АктНедопуска
	|	СтабильныеПериодыСезонность.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	СтабильныеПериодыСезонность.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	СтабильныеПериодыСезонность.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	ТИПЗНАЧЕНИЯ(ВЫБОР
	|		КОГДА ИзменениеНомеровСтрокУвеличениеПозиций.ЭтоИзменениеТарифа
	|			ТОГДА ЗНАЧЕНИЕ(Документ.энргУстановитьЗначениеТарифа.ПустаяСсылка)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ) КАК ТипЗначенияДокРегистратора,
	|	СтабильныеПериодыСезонность.ВидОперации КАК ВидОперации
	|ИЗ 
	|	СтабильныеПериодыСезонность КАК СтабильныеПериодыСезонность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзменениеНомеровСтрокУвеличениеПозиций КАК ИзменениеНомеровСтрокУвеличениеПозиций
	|			ПО СтабильныеПериодыСезонность.Организация = ИзменениеНомеровСтрокУвеличениеПозиций.Организация 
	|			И СтабильныеПериодыСезонность.ПериодНачисления = ИзменениеНомеровСтрокУвеличениеПозиций.ПериодНачисления
	|			И СтабильныеПериодыСезонность.Район = ИзменениеНомеровСтрокУвеличениеПозиций.Район
	|			И СтабильныеПериодыСезонность.ЧастныйСектор = ИзменениеНомеровСтрокУвеличениеПозиций.ЧастныйСектор
	|			И СтабильныеПериодыСезонность.Строение = ИзменениеНомеровСтрокУвеличениеПозиций.Строение
	|			И СтабильныеПериодыСезонность.Помещение = ИзменениеНомеровСтрокУвеличениеПозиций.Помещение
	|			И СтабильныеПериодыСезонность.ТочкаУчета = ИзменениеНомеровСтрокУвеличениеПозиций.ТочкаУчета
	|			И СтабильныеПериодыСезонность.Услуга = ИзменениеНомеровСтрокУвеличениеПозиций.Услуга
	|			И СтабильныеПериодыСезонность.НомерПозиции = ИзменениеНомеровСтрокУвеличениеПозиций.НомерПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыНачало","",Истина,Ложь) + "	
	|	СтабильныеПериодыНачало.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыНачало.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыНачало.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыНачало.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	СтабильныеПериодыНачало.МКД КАК МКД,
	|	СтабильныеПериодыНачало.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыНачало.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	СтабильныеПериодыНачало.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	СтабильныеПериодыНачало.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыНачало.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыНачало.Сезонность КАК Сезонность,
	|	СтабильныеПериодыНачало.ВидПлощади КАК ВидПлощади,
	|	СтабильныеПериодыНачало.НормативПоДням КАК НормативПоДням,
	|	СтабильныеПериодыНачало.НормативПоЧасам КАК НормативПоЧасам,
	|	СтабильныеПериодыНачало.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СтабильныеПериодыНачало.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,
	|	СтабильныеПериодыНачало.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СтабильныеПериодыНачало.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,
	|	СтабильныеПериодыНачало.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	СтабильныеПериодыНачало.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	СтабильныеПериодыНачало.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,		
	|	СтабильныеПериодыНачало.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	СтабильныеПериодыНачало.РегистрируетОбъем КАК РегистрируетОбъем,	
	|	СтабильныеПериодыНачало.ФизЛицо КАК ФизЛицо,
	|	СтабильныеПериодыНачало.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	СтабильныеПериодыНачало.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыНачало.ВидТепловогоПункта КАК ВидТепловогоПункта,	
	|	СтабильныеПериодыНачало.ПомещениеРодитель КАК ПомещениеРодитель,	
	|	СтабильныеПериодыНачало.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	СтабильныеПериодыНачало.ПлощадьМОП КАК ПлощадьМОП,
	|	СтабильныеПериодыНачало.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	СтабильныеПериодыНачало.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,	
	|	СтабильныеПериодыНачало.ДокументНачисления КАК ДокументНачисления,
	|	СтабильныеПериодыНачало.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,	
	|	СтабильныеПериодыНачало.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	СтабильныеПериодыНачало.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	СтабильныеПериодыНачало.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	СтабильныеПериодыНачало.КлючПомещения,
	|	СтабильныеПериодыНачало.СтроениеПредставление КАК СтроениеПредставление,
	|	СтабильныеПериодыНачало.ПомещениеПредставление КАК ПомещениеПредставление,
	|	СтабильныеПериодыНачало.АбонентЗакрытВТекущемПериоде,
	|	СтабильныеПериодыНачало.УвеличениеПозиции КАК УвеличениеПозиции,	
		
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачало.ПериодРегистрации < СтабильныеПериодыНачало.НачалоОП
	|			ТОГДА СтабильныеПериодыНачало.НачалоОП
	|		КОГДА СтабильныеПериодыНачало.ПериодРегистрации > СтабильныеПериодыНачало.ЗавершениеОП
	|			ТОГДА СтабильныеПериодыНачало.ЗавершениеОП
	|		ИНАЧЕ СтабильныеПериодыНачало.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыНачалоОкончание.ПериодРегистрации ЕСТЬ NULL
	|			ТОГДА СтабильныеПериодыНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыНачалоОкончание.ПериодРегистрации > СтабильныеПериодыНачало.ЗавершениеОП
	|			ТОГДА СтабильныеПериодыНачало.ЗавершениеОП
	|		КОГДА СтабильныеПериодыНачалоОкончание.ПериодРегистрации < СтабильныеПериодыНачало.НачалоОП
	|			ТОГДА СтабильныеПериодыНачало.НачалоОП
	//+ ОРП
	| 		КОГДА СтабильныеПериодыНачало.ПериодРегистрации > СтабильныеПериодыНачалоОкончание.ПериодРегистрации
	|			ТОГДА СтабильныеПериодыНачало.ЗавершениеОП
	//
	|		ИНАЧЕ СтабильныеПериодыНачалоОкончание.ПериодРегистрации
	|	КОНЕЦ КАК КонецПериода,	
	|	ЕСТЬNULL(СтабильныеПериодыНачалоОкончание.ПериодРегистрации, ДАТАВРЕМЯ(1,1,1)) КАК СледующийПериодРегистрации,	
	|	ЕСТЬNULL(СтабильныеПериодыНачалоОкончание.ДокРегистратор, НЕОПРЕДЕЛЕНО) КАК СледующийРегистратор,
	// АктНедопуска
	|	СтабильныеПериодыНачало.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	СтабильныеПериодыНачало.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	СтабильныеПериодыНачало.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	СтабильныеПериодыНачало.ТипЗначенияДокРегистратора КАК ТипЗначенияДокРегистратора,
	|	СтабильныеПериодыНачало.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ Периоды
	|ИЗ 
	|   СтабильныеПериодыПослеИзмененияСезонности КАК СтабильныеПериодыНачало
	|   ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыПослеИзмененияСезонности КАК СтабильныеПериодыНачалоОкончание
	|   	ПО (СтабильныеПериодыНачало.НомерПозиции = СтабильныеПериодыНачалоОкончание.НомерПозиции - 1)
	|			И СтабильныеПериодыНачало.Организация = СтабильныеПериодыНачалоОкончание.Организация
	|			И СтабильныеПериодыНачало.ПериодНачисления = СтабильныеПериодыНачалоОкончание.ПериодНачисления
	|			И СтабильныеПериодыНачало.Район = СтабильныеПериодыНачалоОкончание.Район
	|			И СтабильныеПериодыНачало.ЧастныйСектор = СтабильныеПериодыНачалоОкончание.ЧастныйСектор
	|			И СтабильныеПериодыНачало.Строение = СтабильныеПериодыНачалоОкончание.Строение
	|			И СтабильныеПериодыНачало.Помещение = СтабильныеПериодыНачалоОкончание.Помещение
	|			И СтабильныеПериодыНачало.ТочкаУчета = СтабильныеПериодыНачалоОкончание.ТочкаУчета
	|			И СтабильныеПериодыНачало.Услуга = СтабильныеПериодыНачалоОкончание.Услуга	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыПослеИзмененияСезонности","Шкала,РасчетТолькоПоПоказаниям,НетВозможностьУстановкиПУ",Истина,Ложь) + "	
	|	СтабильныеПериодыПослеИзмененияСезонности.НачалоОП КАК НачалоОП,
	|	СтабильныеПериодыПослеИзмененияСезонности.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериодыПослеИзмененияСезонности.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериодыПослеИзмененияСезонности.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	СтабильныеПериодыПослеИзмененияСезонности.МКД КАК МКД,
	|	СтабильныеПериодыПослеИзмененияСезонности.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериодыПослеИзмененияСезонности.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	СтабильныеПериодыПослеИзмененияСезонности.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	СтабильныеПериодыПослеИзмененияСезонности.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериодыПослеИзмененияСезонности.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериодыПослеИзмененияСезонности.Сезонность КАК Сезонность,
	|	СтабильныеПериодыПослеИзмененияСезонности.ВидПлощади КАК ВидПлощади,
	|	СтабильныеПериодыПослеИзмененияСезонности.НормативПоДням КАК НормативПоДням,
	|	СтабильныеПериодыПослеИзмененияСезонности.НормативПоЧасам КАК НормативПоЧасам,
	|	СтабильныеПериодыПослеИзмененияСезонности.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СтабильныеПериодыПослеИзмененияСезонности.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц, 	
	|	СтабильныеПериодыПослеИзмененияСезонности.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СтабильныеПериодыПослеИзмененияСезонности.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,	
	|	СтабильныеПериодыПослеИзмененияСезонности.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	СтабильныеПериодыПослеИзмененияСезонности.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	СтабильныеПериодыПослеИзмененияСезонности.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	СтабильныеПериодыПослеИзмененияСезонности.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	СтабильныеПериодыПослеИзмененияСезонности.РегистрируетОбъем КАК РегистрируетОбъем,
	|	СтабильныеПериодыПослеИзмененияСезонности.ФизЛицо КАК ФизЛицо,
	|	СтабильныеПериодыПослеИзмененияСезонности.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	СтабильныеПериодыПослеИзмененияСезонности.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериодыПослеИзмененияСезонности.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериодыПослеИзмененияСезонности.ПомещениеРодитель КАК ПомещениеРодитель,
	|	СтабильныеПериодыПослеИзмененияСезонности.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	СтабильныеПериодыПослеИзмененияСезонности.ПлощадьМОП КАК ПлощадьМОП,
	|	СтабильныеПериодыПослеИзмененияСезонности.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	СтабильныеПериодыПослеИзмененияСезонности.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	СтабильныеПериодыПослеИзмененияСезонности.ДокументНачисления КАК ДокументНачисления,
	|	СтабильныеПериодыПослеИзмененияСезонности.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	СтабильныеПериодыПослеИзмененияСезонности.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	СтабильныеПериодыПослеИзмененияСезонности.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	СтабильныеПериодыПослеИзмененияСезонности.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	СтабильныеПериодыПослеИзмененияСезонности.КлючПомещения КАК КлючПомещения,
	|	СтабильныеПериодыПослеИзмененияСезонности.СтроениеПредставление КАК СтроениеПредставление,
	|	СтабильныеПериодыПослеИзмененияСезонности.ПомещениеПредставление КАК ПомещениеПредставление,
	|	СтабильныеПериодыПослеИзмененияСезонности.АбонентЗакрытВТекущемПериоде КАК АбонентЗакрытВТекущемПериоде,
	|	СтабильныеПериодыПослеИзмененияСезонности.УвеличениеПозиции КАК УвеличениеПозиции, 	
	|	СтабильныеПериодыПослеИзмененияСезонности.НачалоПериода КАК НачалоПериода,
	|	СтабильныеПериодыПослеИзмененияСезонности.КонецПериода КАК КонецПериода,	
	|	СтабильныеПериодыПослеИзмененияСезонности.СледующийПериодРегистрации КАК СледующийПериодРегистрации, 
	|	СтабильныеПериодыПослеИзмененияСезонности.СледующийРегистратор КАК СледующийРегистратор, 
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СтабильныеПериодыШкалы.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)) КАК ВидДифференцированности,
	|	ВЫБОР
	|		КОГДА СтабильныеПериодыПослеИзмененияСезонности.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПривязанаКШкале,
	|	ЕСТЬNULL(ПериодыРодителя.ПриборВведен, ЛОЖЬ) КАК ЕстьПриборУчетаРодителя,
	|	ВЫБОР 
	|		КОГДА НЕ ПериодыРодителя.РасчетТолькоПоПоказаниям ЕСТЬ NULL
	|			И ПериодыРодителя.РасчетТолькоПоПоказаниям
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ СтабильныеПериодыПослеИзмененияСезонности.РасчетТолькоПоПоказаниям
	|	КОНЕЦ КАК РасчетТолькоПоПоказаниям,
	|	ВЫБОР 
	|		КОГДА НЕ ПериодыРодителя.НетВозможностьУстановкиПУ ЕСТЬ NULL
	|			И ПериодыРодителя.НетВозможностьУстановкиПУ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ СтабильныеПериодыПослеИзмененияСезонности.НетВозможностьУстановкиПУ
	|	КОНЕЦ КАК НетВозможностьУстановкиПУ,
	// АктНедопуска
	|	СтабильныеПериодыПослеИзмененияСезонности.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	СтабильныеПериодыПослеИзмененияСезонности.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	СтабильныеПериодыПослеИзмененияСезонности.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	СтабильныеПериодыПослеИзмененияСезонности.ТипЗначенияДокРегистратора КАК ТипЗначенияДокРегистратора,
	|	СтабильныеПериодыПослеИзмененияСезонности.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ ПериодыШкалы
	|ИЗ
	|	Периоды КАК СтабильныеПериодыПослеИзмененияСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО СтабильныеПериодыПослеИзмененияСезонности.Организация = СтабильныеПериодыШкалы.Организация
	|			И СтабильныеПериодыПослеИзмененияСезонности.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И СтабильныеПериодыПослеИзмененияСезонности.Район = СтабильныеПериодыШкалы.Район
	|			И СтабильныеПериодыПослеИзмененияСезонности.ЧастныйСектор = СтабильныеПериодыШкалы.ЧастныйСектор
	|			И СтабильныеПериодыПослеИзмененияСезонности.Строение = СтабильныеПериодыШкалы.Строение
	|			И СтабильныеПериодыПослеИзмененияСезонности.Помещение = СтабильныеПериодыШкалы.Помещение
	|			И СтабильныеПериодыПослеИзмененияСезонности.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета
	|			И (СтабильныеПериодыПослеИзмененияСезонности.НомерПозиции - СтабильныеПериодыПослеИзмененияСезонности.УвеличениеПозиции = СтабильныеПериодыШкалы.НомерПозиции)
	|			И (ВЫБОР
	|				КОГДА СтабильныеПериодыПослеИзмененияСезонности.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СтабильныеПериодыПослеИзмененияСезонности.Шкала = СтабильныеПериодыШкалы.Шкала
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СтабильныеПериодыПослеИзмененияСезонности.Организация КАК Организация,
	|			СтабильныеПериодыПослеИзмененияСезонности.ПериодНачисления КАК ПериодНачисления,
	|			СтабильныеПериодыПослеИзмененияСезонности.Район КАК Район,
	|			СтабильныеПериодыПослеИзмененияСезонности.ЧастныйСектор КАК ЧастныйСектор,
	|			СтабильныеПериодыПослеИзмененияСезонности.Строение КАК Строение,
	|			СтабильныеПериодыПослеИзмененияСезонности.Помещение КАК Помещение,
	|			СтабильныеПериодыПослеИзмененияСезонности.ТочкаУчета КАК ТочкаУчета,
	|			СтабильныеПериодыПослеИзмененияСезонности.Услуга КАК Услуга,
	|			СтабильныеПериодыПослеИзмененияСезонности.ПериодРегистрации КАК ПериодРегистрации,
	|			МАКСИМУМ(СтабильныеПериодыПослеИзмененияСезонности.ПриборВведен) КАК ПриборВведен,
	|			МАКСИМУМ(СтабильныеПериодыПослеИзмененияСезонности.РасчетТолькоПоПоказаниям) КАК РасчетТолькоПоПоказаниям,
	|			МАКСИМУМ(СтабильныеПериодыПослеИзмененияСезонности.НетВозможностьУстановкиПУ) КАК НетВозможностьУстановкиПУ
	|		ИЗ
	|			СтабильныеПериодыПослеИзмененияСезонности КАК СтабильныеПериодыПослеИзмененияСезонности
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтабильныеПериодыПослеИзмененияСезонности.Организация,
	|			СтабильныеПериодыПослеИзмененияСезонности.ПериодНачисления,
	|			СтабильныеПериодыПослеИзмененияСезонности.Район,
	|			СтабильныеПериодыПослеИзмененияСезонности.ЧастныйСектор,
	|			СтабильныеПериодыПослеИзмененияСезонности.Строение,
	|			СтабильныеПериодыПослеИзмененияСезонности.Помещение,
	|			СтабильныеПериодыПослеИзмененияСезонности.ТочкаУчета,
	|			СтабильныеПериодыПослеИзмененияСезонности.Услуга,
	|			СтабильныеПериодыПослеИзмененияСезонности.ПериодРегистрации) КАК ПериодыРодителя
	|		ПО СтабильныеПериодыПослеИзмененияСезонности.Организация = ПериодыРодителя.Организация
	|			И СтабильныеПериодыПослеИзмененияСезонности.ПериодНачисления = ПериодыРодителя.ПериодНачисления
	|			И СтабильныеПериодыПослеИзмененияСезонности.Район = ПериодыРодителя.Район
	|			И СтабильныеПериодыПослеИзмененияСезонности.ЧастныйСектор = ПериодыРодителя.ЧастныйСектор
	|			И СтабильныеПериодыПослеИзмененияСезонности.Строение = ПериодыРодителя.Строение
	|			И СтабильныеПериодыПослеИзмененияСезонности.Помещение = ПериодыРодителя.Помещение
	|			И СтабильныеПериодыПослеИзмененияСезонности.ТочкаУчетаРодитель = ПериодыРодителя.ТочкаУчета
	|			И СтабильныеПериодыПослеИзмененияСезонности.Услуга = ПериодыРодителя.Услуга
	|			И СтабильныеПериодыПослеИзмененияСезонности.ПериодРегистрации = ПериодыРодителя.ПериодРегистрации
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","",Истина,Ложь) + "	
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериоды.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	СтабильныеПериоды.МКД КАК МКД,
	|	СтабильныеПериоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериоды.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	СтабильныеПериоды.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	СтабильныеПериоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериоды.Сезонность КАК Сезонность,
	|	СтабильныеПериоды.ВидПлощади КАК ВидПлощади,
	|	СтабильныеПериоды.НормативПоДням КАК НормативПоДням,
	|	СтабильныеПериоды.НормативПоЧасам КАК НормативПоЧасам,
	|	СтабильныеПериоды.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СтабильныеПериоды.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,	
	|	СтабильныеПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СтабильныеПериоды.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,	
	|	СтабильныеПериоды.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	СтабильныеПериоды.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	СтабильныеПериоды.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,		
	|	СтабильныеПериоды.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	СтабильныеПериоды.РегистрируетОбъем КАК РегистрируетОбъем,	
	|	СтабильныеПериоды.ФизЛицо КАК ФизЛицо,
	|	СтабильныеПериоды.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	СтабильныеПериоды.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериоды.ВидТепловогоПункта КАК ВидТепловогоПункта,	
	|	СтабильныеПериоды.ПомещениеРодитель КАК ПомещениеРодитель,	
	|	СтабильныеПериоды.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	СтабильныеПериоды.ПлощадьМОП КАК ПлощадьМОП,
	|	СтабильныеПериоды.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	СтабильныеПериоды.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,	
	|	СтабильныеПериоды.ДокументНачисления КАК ДокументНачисления,
	|	СтабильныеПериоды.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,	
	|	СтабильныеПериоды.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	СтабильныеПериоды.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	СтабильныеПериоды.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	СтабильныеПериоды.КлючПомещения,
	|	СтабильныеПериоды.СтроениеПредставление КАК СтроениеПредставление,
	|	СтабильныеПериоды.ПомещениеПредставление КАК ПомещениеПредставление,
	|	СтабильныеПериоды.АбонентЗакрытВТекущемПериоде,
	|	СтабильныеПериоды.УвеличениеПозиции КАК УвеличениеПозиции,
	|	СтабильныеПериоды.НачалоПериода КАК НачалоПериода,
	|	СтабильныеПериоды.КонецПериода КАК КонецПериода,	
	|	СтабильныеПериоды.СледующийПериодРегистрации КАК СледующийПериодРегистрации, 
	|	СтабильныеПериоды.СледующийРегистратор КАК СледующийРегистратор,
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериоды.ЕстьПриборУчетаРодителя КАК ЕстьПриборУчетаРодителя,
	|	ВЫБОР
	|		КОГДА ВидыДифференцированностиТарифныеЗоны.ВидДифференцированности ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)
	|		ИНАЧЕ ВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	|	КОНЕЦ КАК ТарифнаяЗона,
	// АктНедопуска
	|	СтабильныеПериоды.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	СтабильныеПериоды.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска	
	| 	СтабильныеПериоды.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	СтабильныеПериоды.ТипЗначенияДокРегистратора КАК ТипЗначенияДокРегистратора,
	|	СтабильныеПериоды.ВидОперации КАК ВидОперации,
	|	ТИПЗНАЧЕНИЯ(СтабильныеПериоды.СледующийРегистратор) КАК ТипЗначенияСледующийРегистратор
	|ПОМЕСТИТЬ ПериодыШкалыТарифнаяЗона
	|ИЗ
	|	ПериодыШкалы КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТарифныеЗоны КАК ВидыДифференцированностиТарифныеЗоны
	|		ПО СтабильныеПериоды.ВидДифференцированности = ВидыДифференцированностиТарифныеЗоны.ВидДифференцированности	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","",Истина,Ложь) + "
	|	СтабильныеПериоды.ВидОперации КАК ВидОперации,
	|	СтабильныеПериоды.НачалоОП КАК НачалоОП,
	|	СтабильныеПериоды.ЗавершениеОП КАК ЗавершениеОП,
	|	СтабильныеПериоды.ДнейВПериоде КАК ДнейВПериоде,
	|	СтабильныеПериоды.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	СтабильныеПериоды.МКД КАК МКД,
	|	СтабильныеПериоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	СтабильныеПериоды.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	СтабильныеПериоды.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	СтабильныеПериоды.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	СтабильныеПериоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	СтабильныеПериоды.Сезонность КАК Сезонность,
	|	СтабильныеПериоды.ВидПлощади КАК ВидПлощади,
	|	СтабильныеПериоды.НормативПоДням КАК НормативПоДням,
	|	СтабильныеПериоды.НормативПоЧасам КАК НормативПоЧасам,
	|	СтабильныеПериоды.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СтабильныеПериоды.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,
	|	СтабильныеПериоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СтабильныеПериоды.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,
	|	СтабильныеПериоды.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	СтабильныеПериоды.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	СтабильныеПериоды.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	СтабильныеПериоды.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	СтабильныеПериоды.РегистрируетОбъем КАК РегистрируетОбъем,
	|	СтабильныеПериоды.ФизЛицо КАК ФизЛицо,
	|	СтабильныеПериоды.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	СтабильныеПериоды.ТипСхемы КАК ТипСхемы,
	|	СтабильныеПериоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	СтабильныеПериоды.ПомещениеРодитель КАК ПомещениеРодитель,
	|	СтабильныеПериоды.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	СтабильныеПериоды.ПлощадьМОП КАК ПлощадьМОП,
	|	СтабильныеПериоды.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	СтабильныеПериоды.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	СтабильныеПериоды.ДокументНачисления КАК ДокументНачисления,
	|	СтабильныеПериоды.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	СтабильныеПериоды.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	СтабильныеПериоды.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	СтабильныеПериоды.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	СтабильныеПериоды.КлючПомещения КАК КлючПомещения,
	|	СтабильныеПериоды.СтроениеПредставление КАК СтроениеПредставление,
	|	СтабильныеПериоды.ПомещениеПредставление КАК ПомещениеПредставление,
	|	СтабильныеПериоды.АбонентЗакрытВТекущемПериоде КАК АбонентЗакрытВТекущемПериоде,
	|	СтабильныеПериоды.УвеличениеПозиции КАК УвеличениеПозиции,
	|	СтабильныеПериоды.НачалоПериода КАК НачалоПериода,
	|	СтабильныеПериоды.КонецПериода КАК КонецПериода,
	|	СтабильныеПериоды.СледующийПериодРегистрации КАК СледующийПериодРегистрации,
	|	СтабильныеПериоды.СледующийРегистратор КАК СледующийРегистратор,
	|	СтабильныеПериоды.ВидДифференцированности КАК ВидДифференцированности,
	|	СтабильныеПериоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	СтабильныеПериоды.ЕстьПриборУчетаРодителя КАК ЕстьПриборУчетаРодителя,
	|	СтабильныеПериоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|					КОГДА СтабильныеПериоды.ПериодРегистрации < СтабильныеПериоды.НачалоОП
	|						ТОГДА СтабильныеПериоды.НачалоОП
	|					КОГДА СтабильныеПериоды.ПериодРегистрации > СтабильныеПериоды.ЗавершениеОП
	|						ТОГДА СтабильныеПериоды.ЗавершениеОП
	|					ИНАЧЕ СтабильныеПериоды.ПериодРегистрации
	|				КОНЕЦ = СтабильныеПериоды.НачалоОП
	|				И СтабильныеПериоды.РегистрируетОбъем
	|			ТОГДА 0
	//// Условие на показания при возобновлении услуги
	////|		КОГДА НЕ ПериодыПоказанийВозобновлениеУслуги.ДокРегистратор ЕСТЬ NULL
	////|			ТОГДА ЕСТЬNULL(ПериодыПоказанийОкончаниеПериодаРегистрации.Показания, 0)
	////
	|		ИНАЧЕ 
	//|			ВЫБОР
	//|				КОГДА ПериодыПоказанийНачалоПериодаАктДопуска.ДокРегистратор ЕСТЬ NULL
	//|					ТОГДА 
	|			ЕСТЬNULL(ПериодыПоказанийНачалоПериодаРегистрации.Показания, 0)
	//|				ИНАЧЕ 0
	//|			КОНЕЦ
	|	КОНЕЦ 
	|	КАК НачальныеПоказания,
	|	ЕСТЬNULL(ПериодыПоказанийОкончаниеПериодаРегистрации.Показания, 0)  КАК КонечныеПоказания,
	|	ВЫБОР
	|		КОГДА СтабильныеПериоды.НеПрименятьСезонность
	|			ТОГДА 1
	|		КОГДА ПериодыСезонности.Организация ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА ПериодыСезонности.НачалоСезонности <= СтабильныеПериоды.ПериодРегистрации
	|				И СтабильныеПериоды.ПериодРегистрации < ПериодыСезонности.КонецСезонности
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА ПериодыСезонности.Организация ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА СтабильныеПериоды.НачислятьЗаПолныйМесяц
	|				И (ПериодыСезонности.НачалоСезонности МЕЖДУ СтабильныеПериоды.НачалоОП И СтабильныеПериоды.ЗавершениеОП)
	|			ТОГДА 1
	|		КОГДА СтабильныеПериоды.НачислятьЗаПолныйМесяц
	|				И (ПериодыСезонности.КонецСезонности МЕЖДУ СтабильныеПериоды.НачалоОП И СтабильныеПериоды.ЗавершениеОП)
	|			ТОГДА 1
	|		КОГДА ПериодыСезонности.НачалоСезонности <= СтабильныеПериоды.ПериодРегистрации
	|				И СтабильныеПериоды.ПериодРегистрации < ПериодыСезонности.КонецСезонности
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентСезоностиОбъемПотребленный,
	|	ЕСТЬNULL(ИзменениеТарифовВПериоде.Значение, 0) КАК ПредыдущееЗначениеТарифа,
	|	ЕСТЬNULL(ИзменениеТарифовВПериоде.ЗначениеСверхНорматива, 0) КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	ЕСТЬNULL(ИзменениеТарифовВПериоде.ЗначениеРЭК, 0) КАК ПредыдущееЗначениеТарифаРЭК,
	|	ВЫБОР
	|		КОГДА ПредоставленныеПоказанияВСрок.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	// АктНедопуска
	|		КОГДА СтабильныеПериоды.ПереходНаНормативПоПричинеАктаНедопуска
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ СтабильныеПериоды.ПереходНаНормативПоПричинеАктаНедопуска И СтабильныеПериоды.ПериодНачисления > СтабильныеПериоды.ПериодНачальногоНедопуска И СтабильныеПериоды.КоличествоНедопусков >= &КоличествоНедопусковДляОтклоненияПоказаний
	|			ТОГДА ЛОЖЬ
	// АктНедопуска
	|		КОГДА СтабильныеПериоды.НачалоПериода >= ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ПериодРегистрацииВозобновление
	|			И ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ДосчитыватьСреднееНормативПослеВозобновления
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ПредоставленныеПоказанияВСрок.ВСрок
	|	КОНЕЦ КАК ПоказанияВСрок,
	|	ВЫБОР
	|		КОГДА ПредоставленныеПоказанияВСрок.ПериодНачисления ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтабильныеПериоды.НачалоПериода >= ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ПериодРегистрацииВозобновление
	|			И ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ДосчитыватьСреднееНормативПослеВозобновления
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПоказанияПредоставлены,
	|	ВЫБОР
	|		КОГДА СтабильныеПериоды.ПереходНаНормативПоПричинеАктаНедопуска
	|			ТОГДА -1
	|		ИНАЧЕ ЕСТЬNULL(СреднееПотреблениеАбонентов.Объем, -1)
	|	КОНЕЦ КАК СреднийОбъем,
	|	ВЫБОР
	|		КОГДА СтабильныеПериоды.ПереходНаНормативПоПричинеАктаНедопуска
	|			ТОГДА -1
	|		ИНАЧЕ ЕСТЬNULL(СреднееПотреблениеАбонентов.ОбъемПотребленный, -1)
	|	КОНЕЦ КАК СреднийОбъемПотребленный,
	|	ВЫБОР
	|		КОГДА НЕ СтабильныеПериоды.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СреднееПотреблениеЗависитОтУслуги.Объем, -1)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК СреднийОбъемЗависитОтУслуги,
	|	ВЫБОР
	|		КОГДА НЕ СтабильныеПериоды.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СреднееПотреблениеЗависитОтУслуги.ОбъемПотребленный, -1)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК СреднийОбъемПотребленныйЗависитОтУслуги,
	// АктНедопуска
	|	СтабильныеПериоды.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	СтабильныеПериоды.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	СтабильныеПериоды.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	ВЫБОР
	|		КОГДА СтабильныеПериоды.ПриборВведен = ЛОЖЬ
	|				И СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|			ТОГДА ИСТИНА
	|		КОГДА СтабильныеПериоды.УслугаПодключена = ЛОЖЬ
	|				И СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|				И НЕ СтабильныеПериоды.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакВыводимогоПрибора
	|ПОМЕСТИТЬ СтабильныеПериодыПоказания
	|ИЗ
	|	ПериодыШкалыТарифнаяЗона КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказанийНачалоПериодаРегистрации
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргНачисление)
	|					ТОГДА ПериодыПоказанийНачалоПериодаРегистрации.ПризнакНачалаПериода
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргВводНачальныхОстатков)
	|					ТОГДА ПериодыПоказанийНачалоПериодаРегистрации.ПризнакНачалаПериода
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСЛицевымСчетом)
	|						И НЕ СтабильныеПериоды.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка) 
	|						И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)
	|						И  ВЫРАЗИТЬ(СтабильныеПериоды.ДокРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ДатаФактическогоСобытия <> ДатаВремя(1,1,1)  
	|				    ТОГДА СтабильныеПериоды.ПериодРегистрации МЕЖДУ ПериодыПоказанийНачалоПериодаРегистрации.НачалоПериодДействия И ПериодыПоказанийНачалоПериодаРегистрации.ОкончаниеПериодаДействия
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСЛицевымСчетом)
	|						И НЕ СтабильныеПериоды.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|					ТОГДА СтабильныеПериоды.ДокРегистратор = ПериодыПоказанийНачалоПериодаРегистрации.ДокРегистратор
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСПриборомУчета)
	|					ТОГДА СтабильныеПериоды.ДокРегистратор = ПериодыПоказанийНачалоПериодаРегистрации.ДокРегистратор
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|						И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	|					ТОГДА СтабильныеПериоды.ПериодРегистрации МЕЖДУ ПериодыПоказанийНачалоПериодаРегистрации.НачалоПериодДействия И ПериодыПоказанийНачалоПериодаРегистрации.ОкончаниеПериодаДействия	
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|						И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления)
	|					ТОГДА СтабильныеПериоды.ПериодРегистрации МЕЖДУ ПериодыПоказанийНачалоПериодаРегистрации.НачалоПериодДействия И ПериодыПоказанийНачалоПериодаРегистрации.ОкончаниеПериодаДействия			
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					ТОГДА СтабильныеПериоды.ДокРегистратор = ПериодыПоказанийНачалоПериодаРегистрации.ДокРегистратор
	|				КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргАктированиеНедопускаДопускаВПомещение)
	|						И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение)
	|					ТОГДА СтабильныеПериоды.ПериодРегистрации МЕЖДУ ПериодыПоказанийНачалоПериодаРегистрации.НачалоПериодДействия И ПериодыПоказанийНачалоПериодаРегистрации.ОкончаниеПериодаДействия	
	|				
	|				ИНАЧЕ СтабильныеПериоды.ПериодРегистрации МЕЖДУ ПериодыПоказанийНачалоПериодаРегистрации.НачалоПериодДействия И ПериодыПоказанийНачалоПериодаРегистрации.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеПериоды.Организация = ПериодыПоказанийНачалоПериодаРегистрации.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ПериодыПоказанийНачалоПериодаРегистрации.ПериодНачисления
	|			И СтабильныеПериоды.Район = ПериодыПоказанийНачалоПериодаРегистрации.Район
	|			И СтабильныеПериоды.ЧастныйСектор = ПериодыПоказанийНачалоПериодаРегистрации.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = ПериодыПоказанийНачалоПериодаРегистрации.Строение
	|			И СтабильныеПериоды.Помещение = ПериодыПоказанийНачалоПериодаРегистрации.Помещение
	|			И СтабильныеПериоды.ПриборУчета = ПериодыПоказанийНачалоПериодаРегистрации.ПриборУчета
	|			И СтабильныеПериоды.Шкала = ПериодыПоказанийНачалоПериодаРегистрации.Шкала
	|			И СтабильныеПериоды.ТарифнаяЗона = ПериодыПоказанийНачалоПериодаРегистрации.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказанийОкончаниеПериодаРегистрации
	|		ПО (ВЫБОР
	|				КОГДА СтабильныеПериоды.РегистрируетОбъем
	|						И ПериодыПоказанийОкончаниеПериодаРегистрации.ПризнакНачалаПериода
	|					ТОГДА ЛОЖЬ
	|				КОГДА СтабильныеПериоды.ТипЗначенияСледующийРегистратор = ТИП(Документ.энргНачисление)
	|					ТОГДА ПериодыПоказанийОкончаниеПериодаРегистрации.ПризнакНачалаПериода
	|				КОГДА СтабильныеПериоды.ТипЗначенияСледующийРегистратор = ТИП(Документ.энргВводНачальныхОстатков)
	|					ТОГДА ПериодыПоказанийОкончаниеПериодаРегистрации.ПризнакНачалаПериода
	|				КОГДА СтабильныеПериоды.ТипЗначенияСледующийРегистратор = ТИП(Документ.энргОперацияСЛицевымСчетом)
	|						И НЕ СтабильныеПериоды.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|					ТОГДА СтабильныеПериоды.СледующийРегистратор = ПериодыПоказанийОкончаниеПериодаРегистрации.ДокРегистратор
	//|				КОГДА СтабильныеПериоды.ТипЗначенияСледующийРегистратор = ТИП(Документ.энргОперацияСПриборомУчета)
	//|					ТОГДА СтабильныеПериоды.СледующийРегистратор = ПериодыПоказанийОкончаниеПериодаРегистрации.ДокРегистратор
	|				ИНАЧЕ СтабильныеПериоды.СледующийПериодРегистрации МЕЖДУ ПериодыПоказанийОкончаниеПериодаРегистрации.НачалоПериодДействия И ПериодыПоказанийОкончаниеПериодаРегистрации.ОкончаниеПериодаДействия
	|			КОНЕЦ)
	|			И СтабильныеПериоды.Организация = ПериодыПоказанийОкончаниеПериодаРегистрации.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ПериодыПоказанийОкончаниеПериодаРегистрации.ПериодНачисления
	|			И СтабильныеПериоды.Район = ПериодыПоказанийОкончаниеПериодаРегистрации.Район
	|			И СтабильныеПериоды.ЧастныйСектор = ПериодыПоказанийОкончаниеПериодаРегистрации.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = ПериодыПоказанийОкончаниеПериодаРегистрации.Строение
	|			И СтабильныеПериоды.Помещение = ПериодыПоказанийОкончаниеПериодаРегистрации.Помещение
	|			И СтабильныеПериоды.ПриборУчета = ПериодыПоказанийОкончаниеПериодаРегистрации.ПриборУчета
	|			И СтабильныеПериоды.Шкала = ПериодыПоказанийОкончаниеПериодаРегистрации.Шкала
	|			И СтабильныеПериоды.ТарифнаяЗона = ПериодыПоказанийОкончаниеПериодаРегистрации.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыСезонности КАК ПериодыСезонности
	|		ПО СтабильныеПериоды.Организация = ПериодыСезонности.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ПериодыСезонности.ПериодНачисления
	|			И СтабильныеПериоды.Район = ПериодыСезонности.Район
	|			И СтабильныеПериоды.Сезонность = ПериодыСезонности.Сезонность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИзменениеТарифовВПериоде КАК ИзменениеТарифовВПериоде
	|		ПО СтабильныеПериоды.Организация = ИзменениеТарифовВПериоде.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ИзменениеТарифовВПериоде.ПериодНачисления
	|			И СтабильныеПериоды.Район = ИзменениеТарифовВПериоде.Район
	|			И СтабильныеПериоды.ТарифнаяГруппа = ИзменениеТарифовВПериоде.ГруппаПотребителей
	|			И СтабильныеПериоды.Услуга = ИзменениеТарифовВПериоде.Услуга
	|			И СтабильныеПериоды.Поставщик = ИзменениеТарифовВПериоде.Поставщик
	|			И СтабильныеПериоды.ТарифнаяЗона = ИзменениеТарифовВПериоде.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказанияВСрок КАК ПредоставленныеПоказанияВСрок
	|		ПО СтабильныеПериоды.Организация = ПредоставленныеПоказанияВСрок.Организация
	|			И СтабильныеПериоды.ПериодНачисления = ПредоставленныеПоказанияВСрок.ПериодНачисления
	|			И СтабильныеПериоды.Район = ПредоставленныеПоказанияВСрок.Район
	|			И СтабильныеПериоды.ЧастныйСектор = ПредоставленныеПоказанияВСрок.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = ПредоставленныеПоказанияВСрок.Строение
	|			И СтабильныеПериоды.Помещение = ПредоставленныеПоказанияВСрок.Помещение
	|			И СтабильныеПериоды.ПриборУчета = ПредоставленныеПоказанияВСрок.ПриборУчета
	|			И СтабильныеПериоды.Шкала = ПредоставленныеПоказанияВСрок.Шкала
	|			И СтабильныеПериоды.ТарифнаяЗона = ПредоставленныеПоказанияВСрок.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеАбонентов КАК СреднееПотреблениеАбонентов
	|		ПО СтабильныеПериоды.Организация = СреднееПотреблениеАбонентов.Организация
	|			И СтабильныеПериоды.ПериодНачисления = СреднееПотреблениеАбонентов.ПериодНачисления
	|			И СтабильныеПериоды.Район = СреднееПотреблениеАбонентов.Район
	|			И СтабильныеПериоды.ЧастныйСектор = СреднееПотреблениеАбонентов.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = СреднееПотреблениеАбонентов.Строение
	|			И СтабильныеПериоды.Помещение = СреднееПотреблениеАбонентов.Помещение
	|			И СтабильныеПериоды.ТочкаУчета = СреднееПотреблениеАбонентов.ТочкаУчета
	|			И СтабильныеПериоды.Услуга = СреднееПотреблениеАбонентов.Услуга
	|			И СтабильныеПериоды.Шкала = СреднееПотреблениеАбонентов.Шкала
	|			И СтабильныеПериоды.ТарифнаяЗона = СреднееПотреблениеАбонентов.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднееПотреблениеАбонентов КАК СреднееПотреблениеЗависитОтУслуги
	|		ПО СтабильныеПериоды.Организация = СреднееПотреблениеЗависитОтУслуги.Организация
	|			И СтабильныеПериоды.ПериодНачисления = СреднееПотреблениеЗависитОтУслуги.ПериодНачисления
	|			И СтабильныеПериоды.Район = СреднееПотреблениеЗависитОтУслуги.Район
	|			И СтабильныеПериоды.ЧастныйСектор = СреднееПотреблениеЗависитОтУслуги.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = СреднееПотреблениеЗависитОтУслуги.Строение
	|			И СтабильныеПериоды.Помещение = СреднееПотреблениеЗависитОтУслуги.Помещение
	|			И СтабильныеПериоды.ТочкаУчета = СреднееПотреблениеЗависитОтУслуги.ТочкаУчета
	|			И СтабильныеПериоды.ЗависитОтУслуги = СреднееПотреблениеЗависитОтУслуги.Услуга
	|			И СтабильныеПериоды.Шкала = СреднееПотреблениеЗависитОтУслуги.Шкала
	|			И СтабильныеПериоды.ТарифнаяЗона = СреднееПотреблениеЗависитОтУслуги.ТарифнаяЗона
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказанийНачалоПериодаАктДопуска
	//|		ПО (ТИПЗНАЧЕНИЯ(ПериодыПоказанийНачалоПериодаАктДопуска.ДокРегистратор) = ТИП(Документ.энргАктированиеНедопускаДопускаВПомещение))
	//|			И СтабильныеПериоды.Организация = ПериодыПоказанийНачалоПериодаАктДопуска.Организация
	//|			И СтабильныеПериоды.ПериодНачисления = ПериодыПоказанийНачалоПериодаАктДопуска.ПериодНачисления
	//|			И СтабильныеПериоды.Район = ПериодыПоказанийНачалоПериодаАктДопуска.Район
	//|			И СтабильныеПериоды.ЧастныйСектор = ПериодыПоказанийНачалоПериодаАктДопуска.ЧастныйСектор
	//|			И СтабильныеПериоды.Строение = ПериодыПоказанийНачалоПериодаАктДопуска.Строение
	//|			И СтабильныеПериоды.Помещение = ПериодыПоказанийНачалоПериодаАктДопуска.Помещение
	//|			И СтабильныеПериоды.ПриборУчета = ПериодыПоказанийНачалоПериодаАктДопуска.ПриборУчета
	//|			И СтабильныеПериоды.Шкала = ПериодыПоказанийНачалоПериодаАктДопуска.Шкала
	//|			И СтабильныеПериоды.ТарифнаяЗона = ПериодыПоказанийНачалоПериодаАктДопуска.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце КАК ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце
	|		ПО СтабильныеПериоды.Организация = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.Организация
	|			И СтабильныеПериоды.Район = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.Район
	|			И СтабильныеПериоды.ПериодНачисления = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ПериодНачисления
	|			И СтабильныеПериоды.ЧастныйСектор = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.Строение
	|			И СтабильныеПериоды.Помещение = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.Помещение
	|			И СтабильныеПериоды.Услуга = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ТочкаУчета
	|			И СтабильныеПериоды.ПриборУчета = ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце.ПриборУчета"
	//// Условие при возобновление услуги
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыШкалыТарифнаяЗона КАК ПериодыПоказанийВозобновлениеУслуги
	//|		ПО СтабильныеПериоды.Организация = ПериодыПоказанийВозобновлениеУслуги.Организация
	//|			И СтабильныеПериоды.Район = ПериодыПоказанийВозобновлениеУслуги.Район
	//|			И СтабильныеПериоды.ПериодНачисления = ПериодыПоказанийВозобновлениеУслуги.ПериодНачисления
	//|			И СтабильныеПериоды.ЧастныйСектор = ПериодыПоказанийВозобновлениеУслуги.ЧастныйСектор
	//|			И СтабильныеПериоды.Строение = ПериодыПоказанийВозобновлениеУслуги.Строение
	//|			И СтабильныеПериоды.Помещение = ПериодыПоказанийВозобновлениеУслуги.Помещение
	//|			И СтабильныеПериоды.ПриборУчета = ПериодыПоказанийВозобновлениеУслуги.ПриборУчета
	//|			И СтабильныеПериоды.Шкала = ПериодыПоказанийВозобновлениеУслуги.Шкала
	//|			И СтабильныеПериоды.ТарифнаяЗона = ПериодыПоказанийВозобновлениеУслуги.ТарифнаяЗона
	//|			И (ВЫБОР
	//|				КОГДА ТИПЗНАЧЕНИЯ(СтабильныеПериоды.ДокРегистратор) = ТИП(Документ.энргОперацияСУслугами)
	//|						И ВЫРАЗИТЬ(СтабильныеПериоды.ДокРегистратор КАК Документ.энргОперацияСУслугами).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	//|					ТОГДА СтабильныеПериоды.ДокРегистратор = ПериодыПоказанийВозобновлениеУслуги.ДокРегистратор
	//|			КОНЕЦ)
	//|			И СтабильныеПериоды.Услуга = ПериодыПоказанийВозобновлениеУслуги.Услуга
	//|			И СтабильныеПериоды.ТочкаУчета = ПериодыПоказанийВозобновлениеУслуги.ТочкаУчета"
	
	+ ТекстЗапросаВыводимыхПриборовУчетаБезУказанияКонечныхПоказаний();
	
	Возврат Текст;
	
КонецФункции

Функция ТекстПолучитьДанныеДляРасчета()
	Текст   = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыПоказания.Организация КАК Организация,
	|	СтабильныеПериодыПоказания.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыПоказания.Район КАК Район,
	|	СтабильныеПериодыПоказания.Услуга КАК Услуга,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтабильныеПериодыПоказания.ПриборУчета) КАК КоличествоПУ,
	|	СтабильныеПериодыПоказания.Строение КАК Строение,
	|	СтабильныеПериодыПоказания.Помещение КАК Помещение
	|ПОМЕСТИТЬ НаличиеНеисправногоПУ
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СтабильныеПериодыПоказания.Организация КАК Организация,
	|			СтабильныеПериодыПоказания.ПериодНачисления КАК ПериодНачисления,
	|			СтабильныеПериодыПоказания.Район КАК Район,
	|			СтабильныеПериодыПоказания.Услуга КАК Услуга,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтабильныеПериодыПоказания.ПриборУчета) КАК ПриборУчета,
	|			СтабильныеПериодыПоказания.НачалоПериода КАК НачалоПериода,
	|			СтабильныеПериодыПоказания.Строение КАК Строение,
	|			СтабильныеПериодыПоказания.Помещение КАК Помещение
	|		ИЗ
	|			СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказания
	|		ГДЕ
	|			СтабильныеПериодыПоказания.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|			И ЛОЖЬ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтабильныеПериодыПоказания.Организация,
	|			СтабильныеПериодыПоказания.ПериодНачисления,
	|			СтабильныеПериодыПоказания.Район,
	|			СтабильныеПериодыПоказания.Услуга,
	|			СтабильныеПериодыПоказания.НачалоПериода,
	|			СтабильныеПериодыПоказания.Строение,
	|			СтабильныеПериодыПоказания.Помещение
	|		
	|		ИМЕЮЩИЕ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтабильныеПериодыПоказания.ПриборУчета) > 1) КАК ВложенныйЗапрос
	|		ПО СтабильныеПериодыПоказания.Организация = ВложенныйЗапрос.Организация
	|			И СтабильныеПериодыПоказания.ПериодНачисления = ВложенныйЗапрос.ПериодНачисления
	|			И СтабильныеПериодыПоказания.Район = ВложенныйЗапрос.Район
	|			И СтабильныеПериодыПоказания.Строение = ВложенныйЗапрос.Строение
	|			И СтабильныеПериодыПоказания.Помещение = ВложенныйЗапрос.Помещение
	|			И СтабильныеПериодыПоказания.Услуга = ВложенныйЗапрос.Услуга
	|ГДЕ
	|	НЕ СтабильныеПериодыПоказания.ПриборВведен
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыПоказания.Услуга,
	|	СтабильныеПериодыПоказания.ПериодНачисления,
	|	СтабильныеПериодыПоказания.Организация,
	|	СтабильныеПериодыПоказания.Район,
	|	СтабильныеПериодыПоказания.Строение,
	|	СтабильныеПериодыПоказания.Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","Периоды","",Истина,Ложь) + "	
	|	Периоды.ВидОперации КАК ВидОперации,
	|	Периоды.НачалоОП КАК НачалоОП,
	|	Периоды.ЗавершениеОП КАК ЗавершениеОП,
	|	Периоды.ДнейВПериоде КАК ДнейВПериоде,
	|	Периоды.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	Периоды.МКД КАК МКД,
	|	Периоды.КоэффициентНорматива КАК КоэффициентНорматива,
	|	Периоды.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	Периоды.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	Периоды.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	Периоды.Сезонность КАК Сезонность,
	|	Периоды.ВидПлощади КАК ВидПлощади,
	|	Периоды.НормативПоДням КАК НормативПоДням,
	|	Периоды.НормативПоЧасам КАК НормативПоЧасам,
	|	Периоды.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы, 	
	|	Периоды.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	Периоды.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,	
	|	Периоды.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	Периоды.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	Периоды.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	Периоды.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	Периоды.РегистрируетОбъем КАК РегистрируетОбъем,
	|	Периоды.ФизЛицо КАК ФизЛицо,
	|	Периоды.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	Периоды.ТипСхемы КАК ТипСхемы,
	|	Периоды.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	Периоды.ПомещениеРодитель КАК ПомещениеРодитель,
	|	Периоды.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	Периоды.ПлощадьМОП КАК ПлощадьМОП,
	|	Периоды.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	Периоды.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	Периоды.ДокументНачисления КАК ДокументНачисления,
	|	Периоды.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	Периоды.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	Периоды.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	Периоды.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	Периоды.КлючПомещения КАК КлючПомещения,
	|	Периоды.СтроениеПредставление КАК СтроениеПредставление,
	|	Периоды.ПомещениеПредставление КАК ПомещениеПредставление,
	|	Периоды.АбонентЗакрытВТекущемПериоде КАК АбонентЗакрытВТекущемПериоде,
	|	Периоды.УвеличениеПозиции КАК УвеличениеПозиции,
	|	Периоды.ВидДифференцированности КАК ВидДифференцированности,
	|	Периоды.ПривязанаКШкале КАК ПривязанаКШкале,
	|	Периоды.ЕстьПриборУчетаРодителя КАК ЕстьПриборУчетаРодителя,
	|	Периоды.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Периоды.КоэффициентСезоности КАК КоэффициентСезоности,
	|	Периоды.КоэффициентСезоностиОбъемПотребленный КАК КоэффициентСезоностиОбъемПотребленный,
	|	Периоды.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	Периоды.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	Периоды.ПредыдущееЗначениеТарифаРЭК КАК ПредыдущееЗначениеТарифаРЭК,
	|	Периоды.ПоказанияВСрок КАК ПоказанияВСрок,
	|	Периоды.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	Периоды.СреднийОбъем КАК СреднийОбъем,
	|	Периоды.СреднийОбъемПотребленный КАК СреднийОбъемПотребленный,
	|	Периоды.СреднийОбъемЗависитОтУслуги КАК СреднийОбъемЗависитОтУслуги,
	|	Периоды.СреднийОбъемПотребленныйЗависитОтУслуги КАК СреднийОбъемПотребленныйЗависитОтУслуги,
	|	ВЫБОР
	|		КОГДА НЕ Периоды.ПриборВведен
	|				И НЕ НаличиеНеисправногоПУ.Услуга ЕСТЬ NULL
	|			ТОГДА Периоды.НачалоОП
	|		ИНАЧЕ Периоды.НачалоПериода
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА НЕ Периоды.ПриборВведен
	|				И НЕ НаличиеНеисправногоПУ.Услуга ЕСТЬ NULL
	|			ТОГДА Периоды.ЗавершениеОП
	|		ИНАЧЕ Периоды.КонецПериода
	|	КОНЕЦ КАК КонецПериода,
	|	Периоды.НачальныеПоказания КАК НачальныеПоказания,
	|	ВЫБОР
	|		КОГДА Периоды.КонецПериода = Периоды.ЗавершениеОП
	|			ТОГДА ЕСТЬNULL(МаксимальныеПоказания.Показания, 0)
	|		ИНАЧЕ Периоды.КонечныеПоказания
	|	КОНЕЦ КАК КонечныеПоказания,
	|	Периоды.СледующийРегистратор КАК СледующийРегистратор,
	|	ВЫБОР
	|		КОГДА НЕ Периоды.КорректироватьГодовойОбъем
	|				И НЕ Периоды.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА НЕ Периоды.ЕстьЗаписьПриборВЭтомГоду
	|						ТОГДА Периоды.ЕстьПриборУчетаРодителя
	|					КОГДА Периоды.БылУстановленныйПриборВЭтомГоду
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Периоды.ЕстьПриборУчетаРодителя
	|				КОНЕЦ
	|			ТОГДА Периоды.КоэффициентСезоностиОбъемПотребленный
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ДополнительныйКоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА НЕ Периоды.КорректироватьГодовойОбъем
	|				И НЕ Периоды.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА НЕ Периоды.ЕстьЗаписьПриборВЭтомГоду
	|						ТОГДА Периоды.ЕстьПриборУчетаРодителя
	|					КОГДА Периоды.БылУстановленныйПриборВЭтомГоду
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Периоды.ЕстьПриборУчетаРодителя
	|				КОНЕЦ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ Периоды.НеПрименятьСезонность
	|	КОНЕЦ КАК НеПрименятьСезонность,
	|	ВЫБОР
	|		КОГДА НаличиеНеисправногоПУ.Услуга ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НаличиеНеисправногоПУ,
	// АктНедопуска
	|	Периоды.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	|	Периоды.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	Периоды.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормой
	|ИЗ
	|	СтабильныеПериодыПоказания КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеПоказания КАК МаксимальныеПоказания
	|		ПО Периоды.Организация = МаксимальныеПоказания.Организация
	|			И Периоды.ПериодНачисления = МаксимальныеПоказания.ПериодНачисления
	|			И Периоды.Район = МаксимальныеПоказания.Район
	|			И Периоды.ЧастныйСектор = МаксимальныеПоказания.ЧастныйСектор
	|			И Периоды.Строение = МаксимальныеПоказания.Строение
	|			И Периоды.Помещение = МаксимальныеПоказания.Помещение
	|			И Периоды.ПриборУчета = МаксимальныеПоказания.ПриборУчета
	|			И Периоды.Шкала = МаксимальныеПоказания.Шкала
	|			И Периоды.ТарифнаяЗона = МаксимальныеПоказания.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеНеисправногоПУ КАК НаличиеНеисправногоПУ
	|		ПО Периоды.Организация = НаличиеНеисправногоПУ.Организация
	|			И Периоды.ПериодНачисления = НаличиеНеисправногоПУ.ПериодНачисления
	|			И Периоды.Район = НаличиеНеисправногоПУ.Район
	|			И Периоды.Строение = НаличиеНеисправногоПУ.Строение
	|			И Периоды.Помещение = НаличиеНеисправногоПУ.Помещение
	|			И Периоды.Услуга = НаличиеНеисправногоПУ.Услуга
	|ГДЕ
	|	Периоды.УслугаПодключена
	|	И НЕ Периоды.БлокировочныйАкт"
	
	+ ТекстЗапросаПереопределениеНачальныхПоказанийПриВозобновленииУслуги() +
	
	"ВЫБРАТЬ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ДанныеДляРасчетаПередНормой","НомерПозиции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор,КлючНорматива",Истина,Ложь) + "
	|	ДанныеДляРасчетаПередНормой.ВидОперации КАК ВидОперации,
	|	ДанныеДляРасчетаПередНормой.НачалоОП КАК НачалоОП,
	|	ДанныеДляРасчетаПередНормой.ЗавершениеОП КАК ЗавершениеОП,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.Сезонность КАК Сезонность,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчетаПередНормой.НормативПоДням КАК НормативПоДням,
	|	ДанныеДляРасчетаПередНормой.НормативПоЧасам КАК НормативПоЧасам,
	|	ДанныеДляРасчетаПередНормой.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы, 	
	|	ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДанныеДляРасчетаПередНормой.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,		
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляРасчетаПередНормой.РегистрируетОбъем КАК РегистрируетОбъем,	
	|	ДанныеДляРасчетаПередНормой.ФизЛицо КАК ФизЛицо,
	|	ДанныеДляРасчетаПередНормой.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	ДанныеДляРасчетаПередНормой.ТипСхемы КАК ТипСхемы,
	|	ДанныеДляРасчетаПередНормой.ВидТепловогоПункта КАК ВидТепловогоПункта,	
	|	ДанныеДляРасчетаПередНормой.ПомещениеРодитель КАК ПомещениеРодитель,	
	|	ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,	
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,	
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	ДанныеДляРасчетаПередНормой.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	ДанныеДляРасчетаПередНормой.КлючПомещения,
	|	ДанныеДляРасчетаПередНормой.СтроениеПредставление КАК СтроениеПредставление,
	|	ДанныеДляРасчетаПередНормой.ПомещениеПредставление КАК ПомещениеПредставление,
	|	ДанныеДляРасчетаПередНормой.АбонентЗакрытВТекущемПериоде,
	|	ДанныеДляРасчетаПередНормой.УвеличениеПозиции КАК УвеличениеПозиции,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.ЕстьПриборУчетаРодителя КАК ЕстьПриборУчетаРодителя,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,	
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоностиОбъемПотребленный КАК КоэффициентСезоностиОбъемПотребленный,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифаРЭК КАК ПредыдущееЗначениеТарифаРЭК,	
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ПоказанияПредоставлены,	
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъемПотребленный КАК СреднийОбъемПотребленный,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъемЗависитОтУслуги КАК СреднийОбъемЗависитОтУслуги,	
	|	ДанныеДляРасчетаПередНормой.СреднийОбъемПотребленныйЗависитОтУслуги  КАК СреднийОбъемПотребленныйЗависитОтУслуги,	
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,	
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ВЫБОР 
	|		КОГДА ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.Организация ЕСТЬ NULL  
	|			ТОГДА ДанныеДляРасчетаПередНормой.НачальныеПоказания 
	|		ИНАЧЕ ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.НачальныеПоказания 
	|	КОНЕЦ КАК НачальныеПоказания,
	|	ДанныеДляРасчетаПередНормой.КонечныеПоказания КАК КонечныеПоказания,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,		
	|	ДанныеДляРасчетаПередНормой.ДополнительныйКоэффициентСезоности КАК ДополнительныйКоэффициентСезоности,	
	|	ЕСТЬNULL(СтабильныеПериодыИзмерителиНаправлений.Измеритель,ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка))  КАК Измеритель,
	|	ЕСТЬNULL(СтабильныеПериодыИзмерителиНаправлений.КлючНорматива,ДанныеДляРасчетаПередНормой.КлючНорматива) КАК КлючНорматива,
	|	ЕСТЬNULL(СтабильныеПериодыИзмерителиНаправлений.Количество,0) КАК КоличествоИзмеретелейНаправления,
	|	НЕ СтабильныеПериодыИзмерителиНаправлений.Количество ЕСТЬ NULL КАК ЕстьИзмерителиНаправления,
	|	выбор когда ДанныеДляРасчетаПередНормой.ДатаПоверки = ДАТАВРЕМЯ(1,1,1) тогда 0 когда ДОБАВИТЬКДАТЕ(ДанныеДляРасчетаПередНормой.ДатаПоверки, МЕСЯЦ, 3) < ДанныеДляРасчетаПередНормой.ЗавершениеОП Тогда 3 когда ДанныеДляРасчетаПередНормой.ДатаПоверки < ДанныеДляРасчетаПередНормой.ЗавершениеОП Тогда 2 Иначе 1 конец как УслНаДатуПоверки,
	|	ДанныеДляРасчетаПередНормой.НаличиеНеисправногоПУ КАК НаличиеНеисправногоПУ,
	// АктНедопуска
	|	ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	|	ДанныеДляРасчетаПередНормой.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	ДанныеДляРасчетаПередНормой.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормойИзмерители
	|	ИЗ ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыИзмерителиНаправлений КАК СтабильныеПериодыИзмерителиНаправлений
	|			ПО ДанныеДляРасчетаПередНормой.Организация = СтабильныеПериодыИзмерителиНаправлений.Организация
	|				И ДанныеДляРасчетаПередНормой.ПериодНачисления = СтабильныеПериодыИзмерителиНаправлений.ПериодНачисления
	|				И ДанныеДляРасчетаПередНормой.Район = СтабильныеПериодыИзмерителиНаправлений.Район
	|				И ДанныеДляРасчетаПередНормой.ЧастныйСектор = СтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор
	|				И ДанныеДляРасчетаПередНормой.Строение = СтабильныеПериодыИзмерителиНаправлений.Строение
	|				И ДанныеДляРасчетаПередНормой.Помещение = СтабильныеПериодыИзмерителиНаправлений.Помещение
	|				И ДанныеДляРасчетаПередНормой.ТочкаУчета = СтабильныеПериодыИзмерителиНаправлений.ТочкаУчета
	|				И ДанныеДляРасчетаПередНормой.НомерПозиции - ДанныеДляРасчетаПередНормой.УвеличениеПозиции = СтабильныеПериодыИзмерителиНаправлений.НомерПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределениеНачальныхПоказанийПриВозобновленииУслуги КАК ПереопределениеНачальныхПоказанийПриВозобновленииУслуги
	|			ПО ДанныеДляРасчетаПередНормой.Организация = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.Организация
	|				И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.ПериодНачисления
	|				И ДанныеДляРасчетаПередНормой.Район = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.Район
	|				И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.ЧастныйСектор
	|				И ДанныеДляРасчетаПередНормой.Строение = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.Строение
	|				И ДанныеДляРасчетаПередНормой.Помещение = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.Помещение
	|				И ДанныеДляРасчетаПередНормой.ДокРегистратор = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.СледующийРегистратор
	|				И ДанныеДляРасчетаПередНормой.ТочкаУчета = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.ТочкаУчета
	|				И ДанныеДляРасчетаПередНормой.ПриборУчета = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.ПриборУчета
	|				И ДанныеДляРасчетаПередНормой.Шкала = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.Шкала
	|				И ДанныеДляРасчетаПередНормой.ТарифнаяЗона = ПереопределениеНачальныхПоказанийПриВозобновленииУслуги.ТарифнаяЗона";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстРассчитатьИндивидуальныйОбъемПотребления()
	Текст  = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|						ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|				ТОГДА 1
	|			КОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|					И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|						ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|				ТОГДА 2
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|					ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок
	|				ТОГДА 3
	|			ИНАЧЕ 4
	|		КОНЕЦ) КАК Приоритет,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) КАК ПриборВведен,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) КАК ПоказанияВСрок,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.УслНаДатуПоверки) КАК УслНаДатуПоверки,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК КоличествоТочекУчета,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска) КАК ПереходНаНормативПоПричинеАктаНедопуска
	|ПОМЕСТИТЬ ПриоритетНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой 
	|ГДЕ
	|	НЕ ДанныеДляРасчетаПередНормой.РасчетПоФормуле И ДанныеДляРасчетаПередНормой.НачалоПериода <> ДанныеДляРасчетаПередНормой.КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода
	|
	|ИМЕЮЩИЕ
	|	(МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод) = ИСТИНА
	|		ИЛИ МАКСИМУМ(ДанныеДляРасчетаПередНормой.УслНаДатуПоверки) = 3
	|		ИЛИ МАКСИМУМ(ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска) = ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|			ТОГДА ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяССылка)
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска
	|					И ДанныеДляРасчетаПередНормой.СреднийОбъем >= 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска
	|					И ДанныеДляРасчетаПередНормой.СреднийОбъемПотребленный >= 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьСреднийПотребленныйПоВсемТочкамУслуги,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска
	|					И ДанныеДляРасчетаПередНормой.СреднийОбъемЗависитОтУслуги >= 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска
	|					И ДанныеДляРасчетаПередНормой.СреднийОбъемПотребленныйЗависитОтУслуги >= 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьСреднийПотребленныйПоВсемТочкамУслугиЗависитОтУслуги,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК КоличествоТочекУчета,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) КАК ПоказанияВСрок,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) КАК ПриборВведен,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска) КАК ПереходНаНормативПоПричинеАктаНедопуска
	|ПОМЕСТИТЬ НаличиеСреднегоОбъемаПоРодительскимТочкам
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	НЕ ДанныеДляРасчетаПередНормой.РасчетПоФормуле
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|			ТОГДА ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяССылка)
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(МИНИМУМ(ДанныеДляРасчетаПередНормой.ПриборВведен) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ПоказанияВСрок) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК КоличествоТочекУчета
	|ПОМЕСТИТЬ УслугиРодительскихТочекБезПоказаний
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормойРодители
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ДанныеДляРасчетаПередНормойРодители.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ДанныеДляРасчетаПередНормойРодители.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ДанныеДляРасчетаПередНормойРодители.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ДанныеДляРасчетаПередНормойРодители.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ДанныеДляРасчетаПередНормойРодители.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ДанныеДляРасчетаПередНормойРодители.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = ДанныеДляРасчетаПередНормойРодители.Услуга
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ДанныеДляРасчетаПередНормойРодители.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = ДанныеДляРасчетаПередНормойРодители.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ДанныеДляРасчетаПередНормойРодители.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.КонецПериода = ДанныеДляРасчетаПередНормойРодители.КонецПериода
	|			И (НЕ ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель
	|
	|ИМЕЮЩИЕ
	|	(МИНИМУМ(ДанныеДляРасчетаПередНормойРодители.ПриборВведен) = ИСТИНА
	|			И МИНИМУМ(ДанныеДляРасчетаПередНормойРодители.ПоказанияВСрок) = ЛОЖЬ
	|		ИЛИ МИНИМУМ(ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод) = ИСТИНА)
	|;
	
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	//|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	//|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	//|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	//|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	//|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	//|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	//|	ДанныеДляРасчетаПередНормойРодители.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУРодитель,
	//|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	//|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	//|	ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель
	//|ПОМЕСТИТЬ НаправленияРодительскихТочек
	//|ИЗ
	//|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормойРодители
	//|		ПО ДанныеДляРасчетаПередНормой.Организация = ДанныеДляРасчетаПередНормойРодители.Организация
	//|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ДанныеДляРасчетаПередНормойРодители.ПериодНачисления
	//|			И ДанныеДляРасчетаПередНормой.Район = ДанныеДляРасчетаПередНормойРодители.Район
	//|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ДанныеДляРасчетаПередНормойРодители.ЧастныйСектор
	//|			И ДанныеДляРасчетаПередНормой.Строение = ДанныеДляРасчетаПередНормойРодители.Строение
	//|			И ДанныеДляРасчетаПередНормой.Помещение = ДанныеДляРасчетаПередНормойРодители.Помещение
	//|			И ДанныеДляРасчетаПередНормой.Услуга = ДанныеДляРасчетаПередНормойРодители.Услуга
	//|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ДанныеДляРасчетаПередНормойРодители.НаправлениеИспользованияТУ
	//|			И ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = ДанныеДляРасчетаПередНормойРодители.ТочкаУчета
	//|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ДанныеДляРасчетаПередНормойРодители.НачалоПериода
	//|			И ДанныеДляРасчетаПередНормой.КонецПериода = ДанныеДляРасчетаПередНормойРодители.КонецПериода
	//|			И (НЕ ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДанныеДляРасчетаПередНормой.Организация,
	//|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	//|	ДанныеДляРасчетаПередНормой.Район,
	//|	ДанныеДляРасчетаПередНормой.ЧастныйСектор,
	//|	ДанныеДляРасчетаПередНормой.Строение,
	//|	ДанныеДляРасчетаПередНормой.Помещение,
	//|	ДанныеДляРасчетаПередНормой.Услуга,
	//|	ДанныеДляРасчетаПередНормойРодители.НаправлениеИспользованияТУ,
	//|	ДанныеДляРасчетаПередНормой.НачалоПериода,
	//|	ДанныеДляРасчетаПередНормой.КонецПериода,
	//|	ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель
	//|
	//|;
	//
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУРодитель
	|ПОМЕСТИТЬ РодительскиеТочкиУчета
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	НЕ ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга КАК Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	МИНИМУМ(ДанныеДляРасчетаПередНормой.ТочкаУчета) КАК ТочкаУчета,
	|	МАКСИМУМ(ДанныеДляРасчетаПередНормой.ТарифнаяЗона) КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.Помещение <> ДанныеДляРасчетаПередНормой.ПомещениеРодитель
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргточкиучета.пустаяссылка)
	|	КОНЕЦ КАК ТУКомнат
	|ПОМЕСТИТЬ ТочкиНачисленияНормы
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ПриоритетНормы.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ПриоритетНормы.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ПриоритетНормы.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ПриоритетНормы.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ПриоритетНормы.НаправлениеИспользованияТУ
	|			И (НЕ ДанныеДляРасчетаПередНормой.РасчетПоФормуле)
	|			И (ВЫБОР
	|				КОГДА ПриоритетНормы.Приоритет = 1
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|							И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|								ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|				КОГДА ПриоритетНормы.Приоритет = 2
	|					ТОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|							И (НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|								ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок)
	|				КОГДА ПриоритетНормы.Приоритет = 3
	|					ТОГДА НЕ ДанныеДляРасчетаПередНормой.ПриборВведен
	|							ИЛИ НЕ ДанныеДляРасчетаПередНормой.ПоказанияВСрок
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДляРасчетаПередНормой.Организация,
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение,
	|	ДанныеДляРасчетаПередНормой.Услуга,
	|	ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.Помещение <> ДанныеДляРасчетаПередНормой.ПомещениеРодитель
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргточкиучета.пустаяссылка)
	|	КОНЕЦ
	//|	ВЫБОР
	//|		КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	//|		ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	//|	КОНЕЦ
	|	;
	
	
	|ВЫБРАТЬ ДанныеДляРасчетаПередНормойИзмерители.*,
	|	РодительскиеТочкиУчета.НаправлениеИспользованияТУРодитель КАК НаправлениеИспользованияТУРодитель
	|ПОМЕСТИТЬ ДанныеДляРасчетаПередНормойИзмерителиДополненная
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерители КАК ДанныеДляРасчетаПередНормойИзмерители
	|		ЛЕВОЕ СОЕДИНЕНИЕ РодительскиеТочкиУчета КАК РодительскиеТочкиУчета
	|		ПО ДанныеДляРасчетаПередНормойИзмерители.Организация = РодительскиеТочкиУчета.Организация
	|			И ДанныеДляРасчетаПередНормойИзмерители.ПериодНачисления = РодительскиеТочкиУчета.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормойИзмерители.Район = РодительскиеТочкиУчета.Район
	|			И ДанныеДляРасчетаПередНормойИзмерители.ЧастныйСектор = РодительскиеТочкиУчета.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормойИзмерители.Строение = РодительскиеТочкиУчета.Строение
	|			И ДанныеДляРасчетаПередНормойИзмерители.Помещение = РодительскиеТочкиУчета.Помещение
	|			И ДанныеДляРасчетаПередНормойИзмерители.ТочкаУчетаРодитель = РодительскиеТочкиУчета.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормойИзмерители.НачалоПериода = РодительскиеТочкиУчета.НачалоПериода
	|			И ДанныеДляРасчетаПередНормойИзмерители.КонецПериода = РодительскиеТочкиУчета.КонецПериода
 
	|;	
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ДанныеДляРасчетаПередНормой","НомерПозиции,ПериодРегистрации,ДатаРегистратора,ДокРегистратор,СоставЖильцов",Истина,Ложь) + "
	|	ДанныеДляРасчетаПередНормой.ВидОперации КАК ВидОперации,
	|	ДанныеДляРасчетаПередНормой.НачалоОП КАК НачалоОП,
	|	ДанныеДляРасчетаПередНормой.ЗавершениеОП КАК ЗавершениеОП,
	|	ДанныеДляРасчетаПередНормой.ДнейВПериоде КАК ДнейВПериоде,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	ДанныеДляРасчетаПередНормой.МКД КАК МКД,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ДанныеДляРасчетаПередНормой.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	ДанныеДляРасчетаПередНормой.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ДанныеДляРасчетаПередНормой.ОбъемЗаПрошлыйГод КАК ОбъемЗаПрошлыйГод,
	|	ДанныеДляРасчетаПередНормой.Сезонность КАК Сезонность,
	|	ДанныеДляРасчетаПередНормой.ВидПлощади КАК ВидПлощади,
	|	ДанныеДляРасчетаПередНормой.НормативПоДням КАК НормативПоДням,
	|	ДанныеДляРасчетаПередНормой.НормативПоЧасам КАК НормативПоЧасам,
	|	ДанныеДляРасчетаПередНормой.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,	
	|	ДанныеДляРасчетаПередНормой.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДанныеДляРасчетаПередНормой.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива,	
	|	ДанныеДляРасчетаПередНормой.ЕстьПоказанияАбонента КАК ЕстьПоказанияАбонента,
	|	ДанныеДляРасчетаПередНормой.УмножатьНаНормуРодительскойУслуги КАК УмножатьНаНормуРодительскойУслуги,
	|	ДанныеДляРасчетаПередНормой.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ДанныеДляРасчетаПередНормой.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ДанныеДляРасчетаПередНормой.ФизЛицо КАК ФизЛицо,
	|	ДанныеДляРасчетаПередНормой.ОрганизацияПлательщика КАК ОрганизацияПлательщика,
	|	ДанныеДляРасчетаПередНормой.ТипСхемы КАК ТипСхемы,
	|	ДанныеДляРасчетаПередНормой.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ДанныеДляРасчетаПередНормой.ПомещениеРодитель КАК ПомещениеРодитель,
	|	ДанныеДляРасчетаПередНормой.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ДанныеДляРасчетаПередНормой.ПлощадьМОП КАК ПлощадьМОП,
	|	ДанныеДляРасчетаПередНормой.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ДанныеДляРасчетаПередНормой.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисления КАК ДокументНачисления,
	|	ДанныеДляРасчетаПередНормой.ДокументНачисленияПометкаУдаления КАК ДокументНачисленияПометкаУдаления,
	|	ДанныеДляРасчетаПередНормой.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДляРасчетаПередНормой.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	ДанныеДляРасчетаПередНормой.ЕстьЗаписьПриборВЭтомГоду КАК ЕстьЗаписьПриборВЭтомГоду,
	|	ДанныеДляРасчетаПередНормой.КлючПомещения КАК КлючПомещения,
	|	ДанныеДляРасчетаПередНормой.СтроениеПредставление КАК СтроениеПредставление,
	|	ДанныеДляРасчетаПередНормой.ПомещениеПредставление КАК ПомещениеПредставление,
	|	ДанныеДляРасчетаПередНормой.АбонентЗакрытВТекущемПериоде КАК АбонентЗакрытВТекущемПериоде,
	|	ДанныеДляРасчетаПередНормой.УвеличениеПозиции КАК УвеличениеПозиции,
	|	ДанныеДляРасчетаПередНормой.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеДляРасчетаПередНормой.ПривязанаКШкале КАК ПривязанаКШкале,
	|	ДанныеДляРасчетаПередНормой.ЕстьПриборУчетаРодителя КАК ЕстьПриборУчетаРодителя,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.КоэффициентСезоности = 1
	|				И ДанныеДляРасчетаПередНормой.ДополнительныйКоэффициентСезоности = 0
	|				И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.КоэффициентСезоности * ДанныеДляРасчетаПередНормой.ДополнительныйКоэффициентСезоности
	|	КОНЕЦ КАК КоэффициентСезоности,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.ДополнительныйКоэффициентСезоности = 0
	|				И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПотребленныйПоВсемТочкамУслуги, ИСТИНА)
	|			ТОГДА 1
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.КоэффициентСезоностиОбъемПотребленный
	|	КОНЕЦ КАК КоэффициентСезоностиОбъемПотребленный,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифа КАК ПредыдущееЗначениеТарифа,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифаСверхНорматива КАК ПредыдущееЗначениеТарифаСверхНорматива,
	|	ДанныеДляРасчетаПередНормой.ПредыдущееЗначениеТарифаРЭК КАК ПредыдущееЗначениеТарифаРЭК,
	|	ДанныеДляРасчетаПередНормой.ПоказанияВСрок КАК ПоказанияВСрок,
	|	ДанныеДляРасчетаПередНормой.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъем КАК СреднийОбъем,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъемПотребленный КАК СреднийОбъемПотребленный,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъемЗависитОтУслуги КАК СреднийОбъемЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.СреднийОбъемПотребленныйЗависитОтУслуги КАК СреднийОбъемПотребленныйЗависитОтУслуги,
	|	ДанныеДляРасчетаПередНормой.НачалоПериода КАК НачалоПериода,
	|	ДанныеДляРасчетаПередНормой.КонецПериода КАК КонецПериода,
	|	ДанныеДляРасчетаПередНормой.НачальныеПоказания КАК НачальныеПоказания,
	|	ДанныеДляРасчетаПередНормой.КонечныеПоказания КАК КонечныеПоказания,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ДополнительныйКоэффициентСезоности КАК ДополнительныйКоэффициентСезоности,
	|	ДанныеДляРасчетаПередНормой.Измеритель КАК Измеритель,
	|	ДанныеДляРасчетаПередНормой.КоличествоИзмеретелейНаправления КАК КоличествоИзмеретелейНаправления,
	|	ДанныеДляРасчетаПередНормой.ЕстьИзмерителиНаправления КАК ЕстьИзмерителиНаправления,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.Значение, 0) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ЗначенияТекущихТарифовБезРазбивки.Значение, 0) КАК ЗначениеТарифаБезРазбивки,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.ЗначениеСверхНорматива, 0) КАК ЗначениеТарифаСверхНорматива,
	|	ЕСТЬNULL(ЗначенияТекущихТарифов.ЗначениеРЭК, 0) КАК ЗначениеТарифаРЭК,
	|	ЕСТЬNULL(НастройкаНачисленияГВСМКД.НеНачислять, ЕСТЬNULL(НастройкаНачисленияГВС.НеНачислять, ЛОЖЬ)) КАК ЗакрытаяСхемаГВС,
	|	ВЫБОР
	// АктНедопуска
	|		КОГДА ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска
	|			ТОГДА ДанныеДляРасчетаПередНормой.ПовышающийКоэффициентПриАктеНедопуска
	// АктНедопуска
	|		КОГДА ДанныеДляРасчетаПередНормой.НетВозможностьУстановкиПУ
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ЗначенияПовышающихКоэффициентов.Коэффициент, -1)
	|	КОНЕЦ КАК ПовышающийКоэффициент,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.РасчетПоФормуле
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ТочкиУчетаРодители.Организация ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ РодительскиеТочкиУчета.Организация ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ВЫБОР
	|					КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|							И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) >= 1
	|							И НЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|							И НЕ ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА)
	|							И НЕ РодительскиеТочкиУчета.Организация ЕСТЬ NULL
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|					КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|							И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) >= 1
	|							И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					КОГДА ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) > 1
	|							И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|							И ДанныеДляРасчетаПередНормой.ПриборВведен
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					КОГДА ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) > 1
	|							И НЕ ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|							И ДанныеДляРасчетаПередНормой.ПриборВведен
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|					КОГДА НЕ ДанныеДляРасчетаПередНормой.ТочкаУчета = ЕСТЬNULL(ТочкиНачисленияНормы.ТочкаУчета,ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|					ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|				КОНЕЦ = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		КОГДА ДанныеДляРасчетаПередНормой.КоэффициентФормула = 1
	|			ТОГДА ИСТИНА
	|		КОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета = ЕСТЬNULL(ТочкиНачисленияНормы.ТочкаУчета,ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьНорму,		
	|	НЕ ПоставщикиНеНачислять.Поставщик ЕСТЬ NULL КАК УдалитьЗапись,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|				И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА)
	|			ТОГДА ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|		КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|				И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) >= 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.КоличествоТочекУчета, 0) = 0
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ПоказанияВСрок, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьПоПрибору,
	|	ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ПриборВведен, ИСТИНА) КАК УслугаПолностьюОприборена,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|				И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПотребленныйПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПотребленныйПоВсемТочкамУслуги, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.КоличествоТочекУчета, 0) = 0
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ПоказанияВСрок, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачислятьПоПриборуПотребленный,
	|	ЕСТЬNULL(НормаСкоростиДвиженияВоды.СкоростьДвижения, 0) КАК СкоростьДвижения,
	|	ЕСТЬNULL(ДеньНачалаНачисленияПоСреднему.МожноНачислятьСреднее, Истина) КАК МожноНачислятьСреднее,
	|	ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА) КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА) КАК ЕстьСреднийПоВсемТочкамУслугиРодителя,
	|	ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПотребленныйПоВсемТочкамУслуги, ИСТИНА) КАК ЕстьСреднийПотребленныйПоВсемТочкамУслуги,
	|	ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.ЕстьСреднийПотребленныйПоВсемТочкамУслуги, ИСТИНА) КАК ЕстьСреднийПотребленныйПоВсемТочкамУслугиРодителя,
	|	ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА) КАК ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги,
	|	ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПотребленныйПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА) КАК ЕстьСреднийПотребленныйПоВсемТочкамУслугиЗависитОтУслуги,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
	|	ЕСТЬNULL(ЗначенияТекущихСоциальныхНормПотребления.ЗначениеНорматива, 0) КАК СоциальнаяНормаПотребления,
	|	ДанныеДляРасчетаПередНормой.КоэффициентСезоности * ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьСезонность
	|			ТОГДА ДанныеДляРасчетаПередНормой.КоэффициентНормативаНеПрименятьСезонность
	|		ИНАЧЕ ДанныеДляРасчетаПередНормой.КоэффициентНорматива
	|	КОНЕЦ * ДанныеДляРасчетаПередНормой.ДополнительныйКоэффициентСезоности КАК КоэффициентНормативаИСезонности,
	|	ДанныеДляРасчетаПередНормой.УслНаДатуПоверки КАК УслНаДатуПоверки,
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|				И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) >= 1
	|				И НЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|				И НЕ ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА)
	|				И НЕ РодительскиеТочкиУчета.Организация ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|				И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) >= 1
	|				И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) > 1
	|				И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|				И ДанныеДляРасчетаПередНормой.ПриборВведен
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) > 1
	|				И НЕ ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслуги, ИСТИНА)
	|				И ДанныеДляРасчетаПередНормой.ПриборВведен
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК УсловиеНачислятьНорму
	|	,ЕСТЬNULL(ДниИспользованияУслугПриОтсутствии.Количество, -1) КАК ДниИспользованияУслугПриОтсутствии
	|	,ВЫБОР
	|		КОГДА ДанныеДляРасчетаПередНормой.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеДляРасчетаПередНормой.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ ДанныеДляРасчетаПередНормой.ЗначениеПлощади = 0
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			 КОНЕЦ		
	|	КОНЕЦ КАК РассчитыватьСоцНормуПоСтроке,
	|	ЕСТЬNULL(ПроцентВетхостиСтроений.Процент, -1) КАК ПроцентВетхости,
	|	УслугиРодительскихТочекБезПоказаний.ТочкаУчетаРодитель КАК ТочкаУчетаРодительБезПоказаний,
	//////////
	|   ЕСТЬNULL(НастройкаПримененияТарифаВРазрезеКомнат.ИпользованиеТарифаКомнат, Ложь) КАК ПрименятьТарифВРазрезеКомнат,
	////////////
	|	ДанныеДляРасчетаПередНормой.НаличиеНеисправногоПУ КАК НаличиеНеисправногоПУ,
	// АктНедопуска
	|	ДанныеДляРасчетаПередНормой.ПереходНаНормативПоПричинеАктаНедопуска КАК ПереходНаНормативПоПричинеАктаНедопуска,
	| 	ДанныеДляРасчетаПередНормой.ПовышающийКоэффициентПриАктеНедопуска КАК ПовышающийКоэффициентПриАктеНедопуска,
	// АктНедопуска
	| 	ДанныеДляРасчетаПередНормой.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	ЕСТЬNULL(ДниИспользованияУслугПриВременномОтключенииУслуги.Количество, -1) КАК КолВоДнейИспользованияУслугиПриВремОтключении,
	|	ВЫБОР
	|		КОГДА ВыводимыеПриборыУчетаБезУказанияПоказаний.Организация ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыводПрибораУчетаБезУказанияПоказаний,
	|	ЕСТЬNULL(НазначенияПриборовУчета.НазначениеПУ, Значение(Перечисление.энргНазначениеПУ.ПустаяСсылка)) КАК НазначениеПУ,
	|	ЕСТЬNULL(энргПомещения.ТипПомещения, Значение(Перечисление.энргТипыПомещений.ПустаяСсылка)) КАК ТипПомещенияРодителя,
	|	ВЫБОР
	|		КОГДА энргПомещения.Родитель ЕСТЬ NULL ИЛИ энргПомещения.Родитель = Значение(Справочник.энргПомещения.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчетаПередНормой.ПомещениеРодитель
	|		ИНАЧЕ энргПомещения.Родитель
	|	КОНЕЦ КАК ПомещениеРодительСекция,
	|	ВЫБОР 
	|		КОГДА ДанныеДляРасчетаПередНормой.Помещение <> ДанныеДляРасчетаПередНормой.ПомещениеРодитель
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		КОГДА ДанныеДляРасчетаПередНормой.Помещение <> 
	|			ВЫБОР
	|				КОГДА энргПомещения.Родитель ЕСТЬ NULL ИЛИ энргПомещения.Родитель = Значение(Справочник.энргПомещения.ПустаяСсылка)
	|					ТОГДА ДанныеДляРасчетаПередНормой.ПомещениеРодитель
	|				ИНАЧЕ энргПомещения.Родитель
	|			КОНЕЦ
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		КОГДА 
	|			ВЫБОР
	|				КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|					И ЕСТЬNULL(НаличиеСреднегоОбъемаПоРодительскимТочкам.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги, ИСТИНА)
	|					ТОГДА ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|				КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|					И ЕСТЬNULL(ПриоритетНормы.КоличествоТочекУчета, 0) >= 1
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|				ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка) 
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		КОГДА ДанныеДляРасчетаПередНормой.РасчетПоФормуле 
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		КОГДА ДанныеДляРасчетаПередНормой.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		КОГДА ДанныеДляРасчетаПередНормой.Техническая
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		КОГДА ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		КОГДА ДанныеДляРасчетаПередНормой.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|			ТОГДА ДанныеДляРасчетаПередНормой.ТочкаУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|	КОНЕЦ КАК СложнаяТочкаУчета
	|ПОМЕСТИТЬ ДанныеДляРасчетаОбщие
	|ИЗ
	|	ДанныеДляРасчетаПередНормойИзмерителиДополненная КАК ДанныеДляРасчетаПередНормой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыводимыеПриборыУчетаБезУказанияПоказаний КАК ВыводимыеПриборыУчетаБезУказанияПоказаний
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ВыводимыеПриборыУчетаБезУказанияПоказаний.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ВыводимыеПриборыУчетаБезУказанияПоказаний.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ВыводимыеПриборыУчетаБезУказанияПоказаний.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ВыводимыеПриборыУчетаБезУказанияПоказаний.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ВыводимыеПриборыУчетаБезУказанияПоказаний.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ВыводимыеПриборыУчетаБезУказанияПоказаний.Помещение
	|			И ДанныеДляРасчетаПередНормой.ПриборУчета = ВыводимыеПриборыУчетаБезУказанияПоказаний.ПриборУчета
	////////
	|       ЛЕВОЕ СОЕДИНЕНИЕ НастройкаПримененияТарифаВРазрезеКомнат КАК НастройкаПримененияТарифаВРазрезеКомнат
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НастройкаПримененияТарифаВРазрезеКомнат.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НастройкаПримененияТарифаВРазрезеКомнат.Район
	|			И ДанныеДляРасчетаПередНормой.Услуга = НастройкаПримененияТарифаВРазрезеКомнат.Услуга
	////////////
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНачисленияНормы КАК ТочкиНачисленияНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиНачисленияНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиНачисленияНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиНачисленияНормы.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ТочкиНачисленияНормы.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ТочкиНачисленияНормы.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ТочкиНачисленияНормы.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = ТочкиНачисленияНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиНачисленияНормы.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.ТарифнаяЗона = ТочкиНачисленияНормы.ТарифнаяЗона
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ТочкиНачисленияНормы.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ТочкиНачисленияНормы.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.КонецПериода = ТочкиНачисленияНормы.КонецПериода
	//|			И	ВЫБОР
	//|					КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	//|						ТОГДА ИСТИНА
	//|					ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги = ТочкиНачисленияНормы.ЗависитОтУслуги
	//|				КОНЕЦ  
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетНормы КАК ПриоритетНормы
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПриоритетНормы.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПриоритетНормы.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПриоритетНормы.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ПриоритетНормы.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ПриоритетНормы.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ПриоритетНормы.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = ПриоритетНормы.Услуга
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ПриоритетНормы.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ПриоритетНормы.НачалоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиРодительскихТочекБезПоказаний КАК УслугиРодительскихТочекБезПоказаний
	|		ПО ДанныеДляРасчетаПередНормой.Организация = УслугиРодительскихТочекБезПоказаний.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = УслугиРодительскихТочекБезПоказаний.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = УслугиРодительскихТочекБезПоказаний.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = УслугиРодительскихТочекБезПоказаний.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = УслугиРодительскихТочекБезПоказаний.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = УслугиРодительскихТочекБезПоказаний.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = УслугиРодительскихТочекБезПоказаний.Услуга
	//|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = УслугиРодительскихТочекБезПоказаний.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = УслугиРодительскихТочекБезПоказаний.ТочкаУчетаРодитель
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = УслугиРодительскихТочекБезПоказаний.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.КонецПериода = УслугиРодительскихТочекБезПоказаний.КонецПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеСреднегоОбъемаПоРодительскимТочкам КАК НаличиеСреднегоОбъемаПоРодительскимТочкам
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НаличиеСреднегоОбъемаПоРодительскимТочкам.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = НаличиеСреднегоОбъемаПоРодительскимТочкам.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = НаличиеСреднегоОбъемаПоРодительскимТочкам.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = НаличиеСреднегоОбъемаПоРодительскимТочкам.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = НаличиеСреднегоОбъемаПоРодительскимТочкам.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = НаличиеСреднегоОбъемаПоРодительскимТочкам.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = НаличиеСреднегоОбъемаПоРодительскимТочкам.Услуга
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = НаличиеСреднегоОбъемаПоРодительскимТочкам.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = НаличиеСреднегоОбъемаПоРодительскимТочкам.ТочкаУчетаРодитель
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = НаличиеСреднегоОбъемаПоРодительскимТочкам.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.КонецПериода = НаличиеСреднегоОбъемаПоРодительскимТочкам.КонецПериода
	|			И	ВЫБОР
	|					КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги = НаличиеСреднегоОбъемаПоРодительскимТочкам.ЗависитОтУслуги
	|				КОНЕЦ  
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеСреднегоОбъемаПоРодительскимТочкам КАК НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.Помещение
	|			И ДанныеДляРасчетаПередНормой.Услуга = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.Услуга
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУРодитель = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.НаправлениеИспользованияТУ
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.ТочкаУчетаРодитель
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.КонецПериода = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.КонецПериода
	|			И	ВЫБОР
	|					КОГДА ДанныеДляРасчетаПередНормой.НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ДанныеДляРасчетаПередНормой.ЗависитОтУслуги = НаличиеСреднегоОбъемаПоРодительскимТочкамДляРодителя.ЗависитОтУслуги
	|				КОНЕЦ  
	
	
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РодительскиеТочкиУчета КАК РодительскиеТочкиУчета
	|		ПО ДанныеДляРасчетаПередНормой.Организация = РодительскиеТочкиУчета.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = РодительскиеТочкиУчета.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = РодительскиеТочкиУчета.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = РодительскиеТочкиУчета.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = РодительскиеТочкиУчета.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = РодительскиеТочкиУчета.Помещение
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчетаРодитель = РодительскиеТочкиУчета.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = РодительскиеТочкиУчета.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.КонецПериода = РодительскиеТочкиУчета.КонецПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РодительскиеТочкиУчета КАК ТочкиУчетаРодители
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ТочкиУчетаРодители.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ТочкиУчетаРодители.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ТочкиУчетаРодители.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ТочкиУчетаРодители.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ТочкиУчетаРодители.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ТочкиУчетаРодители.Помещение
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = ТочкиУчетаРодители.ТочкаУчета
	|			И ДанныеДляРасчетаПередНормой.НачалоПериода = ТочкиУчетаРодители.НачалоПериода
	|			И ДанныеДляРасчетаПередНормой.КонецПериода = ТочкиУчетаРодители.КонецПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихТарифов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихТарифов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихТарифов.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.ТарифнаяГруппа = ЗначенияТекущихТарифов.ГруппаПотребителей
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихТарифов.Услуга
	|			И ДанныеДляРасчетаПередНормой.Поставщик = ЗначенияТекущихТарифов.Поставщик
	|			И ДанныеДляРасчетаПередНормой.ТарифнаяЗона = ЗначенияТекущихТарифов.ТарифнаяЗона 	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифовБезРазбивки
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихТарифовБезРазбивки.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихТарифовБезРазбивки.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихТарифовБезРазбивки.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.ТарифнаяГруппа = ЗначенияТекущихТарифовБезРазбивки.ГруппаПотребителей
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихТарифовБезРазбивки.Услуга
	|			И ДанныеДляРасчетаПередНормой.Поставщик = ЗначенияТекущихТарифовБезРазбивки.Поставщик
	|			И  ЗначенияТекущихТарифовБезРазбивки.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ЗначенияТекущихНормПотребления.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихСоциальныхНормПотребления КАК ЗначенияТекущихСоциальныхНормПотребления
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияТекущихСоциальныхНормПотребления.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияТекущихСоциальныхНормПотребления.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияТекущихСоциальныхНормПотребления.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияТекущихСоциальныхНормПотребления.Услуга
	|			И ДанныеДляРасчетаПередНормой.КлючСоцНорматива = ЗначенияТекущихСоциальныхНормПотребления.КлючНорматива
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ЗначенияТекущихСоциальныхНормПотребления.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ЗначенияПовышающихКоэффициентов.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Услуга = ЗначенияПовышающихКоэффициентов.Услуга
	|			И ДанныеДляРасчетаПередНормой.НаправлениеИспользованияТУ = ЗначенияПовышающихКоэффициентов.НаправлениеИспользованияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкаНачисленияГВСМКД КАК НастройкаНачисленияГВС
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НастройкаНачисленияГВС.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НастройкаНачисленияГВС.Район
	|			И ДанныеДляРасчетаПередНормой.Услуга = НастройкаНачисленияГВС.Услуга
	|			И (ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка) = НастройкаНачисленияГВС.МКД)
	|			И ДанныеДляРасчетаПередНормой.ТипСхемы = НастройкаНачисленияГВС.ТипСхемы
	|			И ДанныеДляРасчетаПередНормой.ВидТепловогоПункта = НастройкаНачисленияГВС.ПринадлежностьКТепловомуПункту
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкаНачисленияГВСМКД КАК НастройкаНачисленияГВСМКД
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НастройкаНачисленияГВСМКД.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НастройкаНачисленияГВСМКД.Район
	|			И ДанныеДляРасчетаПередНормой.Услуга = НастройкаНачисленияГВСМКД.Услуга
	|			И ДанныеДляРасчетаПередНормой.МКД = НастройкаНачисленияГВСМКД.МКД
	|			И ДанныеДляРасчетаПередНормой.ТипСхемы = НастройкаНачисленияГВСМКД.ТипСхемы
	|			И ДанныеДляРасчетаПередНормой.ВидТепловогоПункта = НастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту
	|			И ДанныеДляРасчетаПередНормой.МКД = НастройкаНачисленияГВСМКД.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ НормаСкоростиДвиженияВоды КАК НормаСкоростиДвиженияВоды
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НормаСкоростиДвиженияВоды.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = НормаСкоростиДвиженияВоды.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДеньНачалаНачисленияПоСреднему КАК ДеньНачалаНачисленияПоСреднему
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ДеньНачалаНачисленияПоСреднему.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ДеньНачалаНачисленияПоСреднему.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоставщикиНеНачислять КАК ПоставщикиНеНачислять
	|		ПО ДанныеДляРасчетаПередНормой.Организация = ПоставщикиНеНачислять.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПоставщикиНеНачислять.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПоставщикиНеНачислять.Район
	|			И ДанныеДляРасчетаПередНормой.Поставщик = ПоставщикиНеНачислять.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДниИспользованияУслугПриОтсутствии КАК ДниИспользованияУслугПриОтсутствии
	|		ПО  ДанныеДляРасчетаПередНормой.ПериодНачисления = ДниИспользованияУслугПриОтсутствии.ПериодНачисления	
	|			И ДанныеДляРасчетаПередНормой.Организация = ДниИспользованияУслугПриОтсутствии.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = ДниИспользованияУслугПриОтсутствии.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ДниИспользованияУслугПриОтсутствии.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ДниИспользованияУслугПриОтсутствии.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = ДниИспользованияУслугПриОтсутствии.Помещение	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроцентВетхостиСтроений КАК ПроцентВетхостиСтроений
	|		ПО  ДанныеДляРасчетаПередНормой.Организация = ПроцентВетхостиСтроений.Организация
	|			И ДанныеДляРасчетаПередНормой.ПериодНачисления = ПроцентВетхостиСтроений.ПериодНачисления
	|			И ДанныеДляРасчетаПередНормой.Район = ПроцентВетхостиСтроений.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ПроцентВетхостиСтроений.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = ПроцентВетхостиСтроений.Строение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДниИспользованияУслугПриВременномОтключенииУслуги КАК ДниИспользованияУслугПриВременномОтключенииУслуги
	|		ПО ДанныеДляРасчетаПередНормой.ПериодНачисления = ДниИспользованияУслугПриВременномОтключенииУслуги.ПериодНачисления
	|		И ДанныеДляРасчетаПередНормой.Организация = ДниИспользованияУслугПриВременномОтключенииУслуги.Организация
	|		И ДанныеДляРасчетаПередНормой.Район = ДниИспользованияУслугПриВременномОтключенииУслуги.Район
	|		И ДанныеДляРасчетаПередНормой.ЧастныйСектор = ДниИспользованияУслугПриВременномОтключенииУслуги.ЧастныйСектор
	|		И ДанныеДляРасчетаПередНормой.Строение = ДниИспользованияУслугПриВременномОтключенииУслуги.Строение
	|		И ДанныеДляРасчетаПередНормой.Помещение = ДниИспользованияУслугПриВременномОтключенииУслуги.Помещение
	|		И ДанныеДляРасчетаПередНормой.Услуга = ДниИспользованияУслугПриВременномОтключенииУслуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ НазначенияПриборовУчета КАК НазначенияПриборовУчета
	|		ПО ДанныеДляРасчетаПередНормой.Организация = НазначенияПриборовУчета.Организация
	|			И ДанныеДляРасчетаПередНормой.Район = НазначенияПриборовУчета.Район
	|			И ДанныеДляРасчетаПередНормой.ЧастныйСектор = НазначенияПриборовУчета.ЧастныйСектор
	|			И ДанныеДляРасчетаПередНормой.Строение = НазначенияПриборовУчета.Строение
	|			И ДанныеДляРасчетаПередНормой.Помещение = НазначенияПриборовУчета.Помещение
	|			И ДанныеДляРасчетаПередНормой.ТочкаУчета = НазначенияПриборовУчета.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ДанныеДляРасчетаПередНормой.ПомещениеРодитель = энргПомещения.Ссылка
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаОбщие.ТочкаУчетаРодитель КАК ТочкаУчета
	|ПОМЕСТИТЬ СложныеТочки
	|ИЗ
	|	ДанныеДляРасчетаОбщие КАК ДанныеДляРасчетаОбщие
	|ГДЕ
	|	ДанныеДляРасчетаОбщие.ТочкаУчетаРодитель <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаОбщие.ЗависимаяТочкаУчета
	|ИЗ
	|	ДанныеДляРасчетаОбщие КАК ДанныеДляРасчетаОбщие
	|ГДЕ
	|	ДанныеДляРасчетаОбщие.ЗависимаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеДляРасчетаОбщие.СложнаяТочкаУчета
	|ИЗ
	|	ДанныеДляРасчетаОбщие КАК ДанныеДляРасчетаОбщие
	|ГДЕ
	|	ДанныеДляРасчетаОбщие.СложнаяТочкаУчета <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ *,
	|	ВЫБОР 
	|		КОГДА НЕ СложныеТочки.ТочкаУчета есть NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоПростаяТочкаУчета,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчетаОбщие.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчетаОбщие.КонецПериода, ДЕНЬ), ДЕНЬ) КАК РазностьДатГраницПериода
	|ПОМЕСТИТЬ ДанныеДляРасчета
	|ИЗ
	|	ДанныеДляРасчетаОбщие
	|		ЛЕВОЕ СОЕДИНЕНИЕ СложныеТочки КАК СложныеТочки
	|		ПО ДанныеДляРасчетаОбщие.ТочкаУчета = СложныеТочки.ТочкаУчета";

	Возврат Текст;
КонецФункции

#Область ОпределениеВыводимыхПриборовУчетаБезПоказаний

// Функция - Определяет выводимые приборы учета без указания конечных показаний в документе вывода.
// 		Списание среднего производиться не будет. МИНИМУМ - если по одной тарифной зоне отклонены показания, то весь прибор начисляем по среднему.
//		Поле "ВыводПрибораУчетаБезУказанияПоказаний" переопределяет поле "СниматьНачисленныйСредний" 	
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаВыводимыхПриборовУчетаБезУказанияКонечныхПоказаний()
	
	Текст = ОбщегоНазначения.РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	СтабильныеПериодыПоказания.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыПоказания.Организация КАК Организация,
	|	СтабильныеПериодыПоказания.Район КАК Район,
	|	СтабильныеПериодыПоказания.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыПоказания.Строение КАК Строение,
	|	СтабильныеПериодыПоказания.Помещение КАК Помещение,
	|	СтабильныеПериодыПоказания.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыПоказания.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериодыПоказания.Шкала КАК Шкала,
	|	СтабильныеПериодыПоказания.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ СтабильныеПериодыНачалоВыведенныеПриборы
	|ИЗ
	|	СтабильныеПериодыПоказания КАК СтабильныеПериодыПоказания
	|ГДЕ
	|	СтабильныеПериодыПоказания.ПризнакВыводимогоПрибора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Организация КАК Организация,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Район КАК Район,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Строение КАК Строение,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Помещение КАК Помещение,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВыводимыеПриборыУчетаБезУказанияПоказаний
	|ИЗ
	|	СтабильныеПериодыНачалоВыведенныеПриборы КАК СтабильныеПериодыНачалоВыведенныеПриборы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредоставленныеПоказания КАК ПредоставленныеПоказания
	|		ПО СтабильныеПериодыНачалоВыведенныеПриборы.ПериодНачисления = ПредоставленныеПоказания.ПериодНачисления
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.Организация = ПредоставленныеПоказания.Организация
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.Район = ПредоставленныеПоказания.Район
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.ЧастныйСектор = ПредоставленныеПоказания.ЧастныйСектор
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.Строение = ПредоставленныеПоказания.Строение
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.Помещение = ПредоставленныеПоказания.Помещение
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.ПриборУчета = ПредоставленныеПоказания.ПриборУчета
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.Шкала = ПредоставленныеПоказания.Шкала
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.ТарифнаяЗона = ПредоставленныеПоказания.ТарифнаяЗона
	|			И СтабильныеПериодыНачалоВыведенныеПриборы.ДокРегистратор = ПредоставленныеПоказания.ДокРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Организация,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.ПериодНачисления,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Район,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.ЧастныйСектор,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Строение,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.Помещение,
	|	СтабильныеПериодыНачалоВыведенныеПриборы.ПриборУчета
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ПредоставленныеПоказания.ПериодНачисления ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) = ЛОЖЬ";
	
	Возврат Текст;
	
КонецФункции
	
#КонецОбласти

#Область ПроверкаОграниченияВозобновленияРежимаПотребления

Функция ТекстЗапросаТочекОграничениеИВозобновлениеПроизошедшееВОдномМесяце()
	
	Текст = ОбщегоНазначения.РазделительПакетаЗапросов() +
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления)
	|				ТОГДА СтабильныеПериоды.ДокРегистратор
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ДокРегистраторОграничение,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	|				ТОГДА СтабильныеПериоды.ДокРегистратор
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ДокРегистраторВозобновление,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления)
	|				ТОГДА СтабильныеПериоды.ПериодРегистрации
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ПериодРегистрацииОграничение,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	|				ТОГДА СтабильныеПериоды.ПериодРегистрации
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ПериодРегистрацииВозобновление,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьОграничение,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьВозобновление
	|ПОМЕСТИТЬ ОграничениеИВозобновлениеПроизошедшееВОдномМесяце
	|ИЗ
	|	СтабильныеПериодыНачало КАК СтабильныеПериоды
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.ПериодНачисления,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.ЧастныйСектор,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.ТочкаУчета,
	|	СтабильныеПериоды.Услуга,
	|	СтабильныеПериоды.ПриборУчета
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА И
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.ТипЗначенияДокРегистратора = ТИП(Документ.энргОперацияСУслугами)
	|					И СтабильныеПериоды.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Организация КАК Организация,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодНачисления КАК ПериодНачисления,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Район КАК Район,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ЧастныйСектор КАК ЧастныйСектор,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Строение КАК Строение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Помещение КАК Помещение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ТочкаУчета КАК ТочкаУчета,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Услуга КАК Услуга,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПриборУчета КАК ПриборУчета,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ДокРегистраторОграничение КАК ДокРегистраторОграничение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ДокРегистраторВозобновление КАК ДокРегистраторВозобновление,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодРегистрацииОграничение КАК ПериодРегистрацииОграничение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодРегистрацииВозобновление КАК ПериодРегистрацииВозобновление,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ПериодыПоказаний.НачалоПериодДействия <= ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодРегистрацииОграничение
	|					И ПериодыПоказаний.ПоказанияТекущегоПериода
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ДосчитыватьСреднееНормативДоОграничения,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ПериодыПоказаний.НачалоПериодДействия >= ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодРегистрацииВозобновление
	|					И ПериодыПоказаний.ПоказанияТекущегоПериода
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ДосчитыватьСреднееНормативПослеВозобновления
	|ПОМЕСТИТЬ ПризнакиПредоставленияПоказанийПриборовОРПВОдномМесяце
	|ИЗ
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце КАК ОграничениеИВозобновлениеПроизошедшееВОдномМесяце
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыПоказаний КАК ПериодыПоказаний
	|		ПО ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Организация = ПериодыПоказаний.Организация
	|			И ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодНачисления = ПериодыПоказаний.ПериодНачисления
	|			И ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Район = ПериодыПоказаний.Район
	|			И ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ЧастныйСектор = ПериодыПоказаний.ЧастныйСектор
	|			И ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Строение = ПериодыПоказаний.Строение
	|			И ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Помещение = ПериодыПоказаний.Помещение
	|			И ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПриборУчета = ПериодыПоказаний.ПриборУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ЧастныйСектор,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Район,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодРегистрацииОграничение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Организация,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ДокРегистраторОграничение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ТочкаУчета,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ДокРегистраторВозобновление,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Строение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Помещение,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодНачисления,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.Услуга,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПриборУчета,
	|	ОграничениеИВозобновлениеПроизошедшееВОдномМесяце.ПериодРегистрацииВозобновление";
	
	Текст = Текст + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Возврат Текст;
	
КонецФункции
	
#КонецОбласти

#Область ПереопределениеНачальныхПоказанийПриВозобновленииУслуги

// Функция - Переопределяет начальные показания в момент начисления по возобновлению услуги, 
//				т.к. начальные показания берутся от даты документа до следующего, а надо от 	
//				предыдущих показаний принятых к учету
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ТекстЗапросаПереопределениеНачальныхПоказанийПриВозобновленииУслуги()
	
	Текст = ОбщегоНазначения.РазделительПакетаЗапросов() + 
	
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаПередНормой.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДляРасчетаПередНормой.Организация КАК Организация,
	|	ДанныеДляРасчетаПередНормой.Район КАК Район,
	|	ДанныеДляРасчетаПередНормой.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДляРасчетаПередНормой.Строение КАК Строение,
	|	ДанныеДляРасчетаПередНормой.Помещение КАК Помещение,
	|	ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК СледующийРегистратор,
	|	ДанныеДляРасчетаПередНормой.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДляРасчетаПередНормой.ПриборУчета КАК ПриборУчета,
	|	ДанныеДляРасчетаПередНормой.Шкала КАК Шкала,
	|	ДанныеДляРасчетаПередНормой.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДляРасчетаПередНормой.НачальныеПоказания КАК НачальныеПоказания
	|ПОМЕСТИТЬ ПереопределениеНачальныхПоказанийПриВозобновленииУслуги
	|ИЗ
	|	ДанныеДляРасчетаПередНормой КАК ДанныеДляРасчетаПередНормой
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеДляРасчетаПередНормой.СледующийРегистратор) = ТИП(Документ.энргОперацияСУслугами)
	|	И ВЫРАЗИТЬ(ДанныеДляРасчетаПередНормой.СледующийРегистратор КАК Документ.энргОперацияСУслугами).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)";
	
	Текст = Текст + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область НачисленияПоПриборам

Процедура ДобавитьРасчетОбъемаУслугиПоПриборам(Схема,ВыбираемыеПоля, ВычисляемыеПоля, МВТ, ТаблицаДанныеДляРасчета)
		
	ПереопределяемыеПоля 	= Новый Структура;
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				"__РасходПоПоказаниям__");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	"0");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифа", 			"__ЗначениеТарифаПоПриборам__");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифаРЭК", 			"__ЗначениеТарифаРЭКПоПриборам__");
	ПереопределяемыеПоля.Вставить("Сумма", 						"__РасходПоПоказаниям__ * __ЗначениеТарифаПоПриборам__");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"1");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"НЕ НачислятьПоПрибору");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __РасходПоПоказаниям__ * ( __КоличествоЧеловек__ *  Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ		
	|КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__* ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __РасходПоПоказаниям__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");         	
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"__РасходПоПоказаниям__ * (Псевдоним.ПотериПроцент / 100) + Псевдоним.ПотериОбъем");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
	
	Условия = Новый Массив;
	Условия.Добавить("ПриборВведен");
	Условия.Добавить("ЕстьПоказанияАбонента");
	Условия.Добавить("НЕ ОбъемЗаПрошлыйГод");
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	// лишнее условие: если отключить ТУ с ПУ от 1 числа с расходом = 0, то начисления нет и не снимает среднее!!!
	//Условия.Добавить(
	//"ВЫБОР
	//|	КОГДА АбонентЗакрытВТекущемПериоде 
	//|		ТОГДА ИСТИНА
	//|	КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) = 0					
	//|		ТОГДА __РасходПоПоказаниям__ > 0
	//|	ИНАЧЕ ИСТИНА
	//|КОНЕЦ");
	
	// Условие не лишнее: если происходит смена тарифной категории от 1 числа месяца, то расход по ней 0 и эта строка лишняя,
	// Она мешает распределять объемы на комнаты в коммуналках - берет старый тариф из этой строки
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) = 0					
	|		И Не СледующийРегистратор Ссылка Документ.энргОперацияСЛицевымСчетом И Не СледующийРегистратор Ссылка Документ.энргОперацияСУслугами И Не СледующийРегистратор Ссылка Документ.энргОперацияСПриборомУчета
	|		ТОГДА __РасходПоПоказаниям__ > 0
	|	ИНАЧЕ ИСТИНА
	|КОНЕЦ");
	
	// Условие не лишнее: если происходит смена собственника с датой факта, то при начислении в текущем периоде его начислять не надо
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) = 0					
	|		И СледующийРегистратор Ссылка Документ.энргОперацияСЛицевымСчетом
	|		И ВЫРАЗИТЬ(СледующийРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ДатаФактическогоСобытия <> ДатаВремя(1,1,1)
	|		И ВЫРАЗИТЬ(СледующийРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ДатаФактическогоСобытия < НачалоОП
	|		ТОГДА ЛОЖЬ
	|	ИНАЧЕ ИСТИНА
	|КОНЕЦ");
	
	Условия.Добавить("ПоказанияВСрок");
	Условия.Добавить("НЕ НаличиеНеисправногоПУ");
	Условия.Добавить("НЕ СрокПоверкиИстек");
	
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля, ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

Процедура ДобавитьРасчетОбъемаПотребленногоПоПриборам(Схема,ВыбираемыеПоля, ВычисляемыеПоля,МВТ, ТаблицаДанныеДляРасчета)
		
	ПереопределяемыеПоля = Новый Структура;
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный", 	"__РасходПоПоказаниям__");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифа",				"__ЗначениеТарифаПоПриборам__");
	ПереопределяемыеПоля.Вставить("Сумма", 						"0");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"1");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"НЕ НачислятьПоПриборуПотребленный");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __РасходПоПоказаниям__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __РасходПоПоказаниям__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления  + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"__РасходПоПоказаниям__ * (Псевдоним.ПотериПроцент / 100) + Псевдоним.ПотериОбъем");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
	
	Условия = Новый Массив;
	Условия.Добавить("ПриборВведен");
	Условия.Добавить("ЕстьПоказанияАбонента");
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) = 0					
	|		И Не СледующийРегистратор Ссылка Документ.энргОперацияСЛицевымСчетом И Не СледующийРегистратор Ссылка Документ.энргОперацияСУслугами И Не СледующийРегистратор Ссылка Документ.энргОперацияСПриборомУчета
	|		ТОГДА __РасходПоПоказаниям__ > 0
	|	ИНАЧЕ ИСТИНА
	|КОНЕЦ");
	
	//Условия.Добавить(
	//"ВЫБОР
	//|	КОГДА АбонентЗакрытВТекущемПериоде 
	//|		ТОГДА ИСТИНА
	//|	КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) = 0					
	//|		ТОГДА __РасходПоПоказаниям__ > 0
	//|	ИНАЧЕ ИСТИНА
	//|КОНЕЦ");
	
	// Условие не лишнее: если происходит смена собственника с датой факта, то при начислении в текущем периоде его начислять не надо
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ДанныеДляРасчета.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(ДанныеДляРасчета.КонецПериода, ДЕНЬ), ДЕНЬ) = 0					
	|		И СледующийРегистратор Ссылка Документ.энргОперацияСЛицевымСчетом
	|		И ВЫРАЗИТЬ(СледующийРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ДатаФактическогоСобытия <> ДатаВремя(1,1,1)
	|		И ВЫРАЗИТЬ(СледующийРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ДатаФактическогоСобытия < НачалоОП
	|		ТОГДА ЛОЖЬ
	|	ИНАЧЕ ИСТИНА
	|КОНЕЦ");
	
	Условия.Добавить("ПоказанияВСрок");
	Условия.Добавить("НЕ НаличиеНеисправногоПУ");
	Условия.Добавить("НЕ СрокПоверкиИстек");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля, ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область НачисленияПоНормативу

Процедура ДобавитьРасчетОбъемаУслугиПоНормативу(Схема,ВыбираемыеПоля,ВычисляемыеПоля,МВТ,ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ПриборУчета", 				"ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)");
	ПереопределяемыеПоля.Вставить("Шкала", 						"ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная)");
	ПереопределяемыеПоля.Вставить("ТарифнаяЗона", 				"ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				
	"__ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__* __КоэффициентДляНачисленияСреднегоДляПотомка__");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	"0");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифа", 			"ЗначениеТарифаБезРазбивки");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифаРЭК", 			"__ЗначениеТарифаРЭКПоПриборам__");
	ПереопределяемыеПоля.Вставить("Сумма", 						
	"__ОбъемУслугиПоНорме__ * ЗначениеТарифа * __ДлительностьПериодаПоНормативу__");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"ЛОЖЬ");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ *  __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА  __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
	
	Условия = Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоности = 0");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА Псевдоним.ОбъемЗаПрошлыйГод
	|				И ВЫБОР
	|					КОГДА Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|						ТОГДА Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|					ИНАЧЕ Псевдоним.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги
	|				КОНЕЦ
	|			ТОГДА ЛОЖЬ
	|		КОГДА НЕ Псевдоним.ПриборВведен
	|					И Псевдоним.ТочкаУчетаРодитель <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|				ТОГДА ВЫБОР
	
	|						КОГДА НЕ Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПоВсемТочкамУслугиРодителя
	|							ТОГДА ИСТИНА
	
	|						КОГДА Псевдоним.ТочкаУчетаРодительБезПоказаний ЕСТЬ NULL
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	
	|		КОГДА Псевдоним.ПриборВведен И Не Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|			ТОГДА ИСТИНА
	
	|		КОГДА Псевдоним.ПриборВведен
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ Псевдоним.СреднийОбъем < 0 И НЕ ПоказанияВСрок 
	|	КОНЕЦ");
	Условия.Добавить("НачислятьНорму 
	|ИЛИ НЕ ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)");
	Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	//Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля, ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

Процедура ДобавитьРасчетОбъемаПотребленногоПоНормативу(Схема,ВыбираемыеПоля,ВычисляемыеПоля,МВТ,ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ПриборУчета", 				"ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)");
	ПереопределяемыеПоля.Вставить("Шкала", 						"ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.Основная)");
	ПереопределяемыеПоля.Вставить("ТарифнаяЗона", 				"ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	
	"__ОбъемУслугиПотребленныйПоНорме__ * __ДлительностьПериодаПоНормативуОбъемПотребленный__");
	ПереопределяемыеПоля.Вставить("Сумма", 						"0");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"ЛОЖЬ");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)");
	ПереопределяемыеПоля.Вставить("НормаПотребления", 			"ВЫРАЗИТЬ(Псевдоним.НормаПотребления * Псевдоним.КоэффициентНорматива КАК  ЧИСЛО(15,6))");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифа", 			"ЗначениеТарифаБезРазбивки");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПотребленныйПоНорме__ * __ДлительностьПериодаПоНормативуОбъемПотребленный__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления)/ Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПотребленныйПоНорме__ * __ДлительностьПериодаПоНормативуОбъемПотребленный__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
	
	Условия = Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоностиОбъемПотребленный = 0");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА НЕ Псевдоним.ПриборВведен
	|					И Псевдоним.ТочкаУчетаРодитель <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|				ТОГДА ВЫБОР
	
	|						КОГДА НЕ Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПотребленныйПоВсемТочкамУслугиРодителя
	|							ТОГДА ИСТИНА

	|						КОГДА Псевдоним.ТочкаУчетаРодительБезПоказаний ЕСТЬ NULL
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	
	|		КОГДА Псевдоним.ПриборВведен И Не Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|			ТОГДА ИСТИНА

	|		КОГДА Псевдоним.ПриборВведен
	|			ТОГДА ЛОЖЬ
	|	ИНАЧЕ Псевдоним.СреднийОбъемПотребленный < 0 И НЕ ПоказанияВСрок
	|КОНЕЦ");
	
	
	Условия.Добавить("НачислятьНорму 
	|ИЛИ НЕ ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)");
	Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля, ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

Функция РассчитатьОбъемУслугиСтроктНабораПоНормативу(СтрокаНабора)
	МКД 											= ?(СтрокаНабора.ЧастныйСектор,Истина,Ложь);
	КоэффициентНормативаНеПрименятьСезонность 		= 0;
	
	Если СтрокаНабора.НеПрименятьСезонность Тогда
		КоэффициентНормативаНеПрименятьСезонность 	= СтрокаНабора.КоэффициентНормативаНеПрименятьСезонность;
	Иначе
		КоэффициентНормативаНеПрименятьСезонность 	= СтрокаНабора.КоэффициентНорматива;
	КонецЕсли;
	
	НаЧтоУмножаемНорматив  							= 0;
	Если СтрокаНабора.НаправлениеИспользованияТУ = Справочники.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка()
		и СтрокаНабора.ЕстьИзмерителиНаправления Тогда
		НаЧтоУмножаемНорматив 						= СтрокаНабора.КоличествоИзмеретелейНаправления;
	ИначеЕсли НЕ СтрокаНабора.ВидПлощади = Перечисления.энргВидыПлощадей.ПустаяСсылка() Тогда
		НаЧтоУмножаемНорматив 						= СтрокаНабора.ЗначениеПлощади;
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаНабора.Абонент) Тогда
		НаЧтоУмножаемНорматив 						= СтрокаНабора.КоличествоЖильцов;
	ИначеЕсли НЕ СтрокаНабора.КоличествоПроживающих = 0 Тогда
		НаЧтоУмножаемНорматив 						= СтрокаНабора.КоличествоПроживающих;
	ИначеЕсли НЕ СтрокаНабора.КоличествоПрописанных = 0 Тогда
		НаЧтоУмножаемНорматив 						= СтрокаНабора.КоличествоПрописанных;
	Иначе
		НаЧтоУмножаемНорматив 						= СтрокаНабора.КоличествоСобственников;
	КонецЕсли;
	
	КоэффициентСдерживанияРостаПлаты 				= 0;
	Если СтрокаНабора.ИспользоватьКоэффициентСдерживанияРостаПлаты И МКД Тогда
		Если СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП = 0 Тогда
			КоэффициентСдерживанияРостаПлаты 		= 0;
		Иначе
			КоэффициентСдерживанияРостаПлаты 		= (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП);
		КонецЕсли;
	Иначе
		КоэффициентСдерживанияРостаПлаты 			= 1;
	КонецЕсли;
	
	Возврат СтрокаНабора.КоэффициентСезоности * Окр(СтрокаНабора.НормаПотребления * КоэффициентНормативаНеПрименятьСезонность,6) * НаЧтоУмножаемНорматив * КоэффициентСдерживанияРостаПлаты;
			
КонецФункции

#КонецОбласти

#Область НачисленияПоСреднемуНормативу

Процедура ДобавитьРасчетОбъемаУслугиПоСреднемуНормативуЗаПрошлыйГод(Схема,ВыбираемыеПоля, ВычисляемыеПоля, МВТ, ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				
	"__ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * __КоэффициентДляНачисленияСреднего__");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	"0");
	ПереопределяемыеПоля.Вставить("Сумма", 						
	"__ОбъемУслугиПоНорме__ * ЗначениеТарифа * __ДлительностьПериодаПоНормативу__");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"ЛОЖЬ");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"1");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА  __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
		
	Условия 				= Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоности = 0");
	Условия.Добавить("ОбъемЗаПрошлыйГод");
	Условия.Добавить("НачислятьНорму");
	Условия.Добавить("ПриборВведен");
	//Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|		И ВыводПрибораУчетаБезУказанияПоказаний	
	|		ТОГДА ИСТИНА
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|		И ВыводПрибораУчетаБезУказанияПоказаний
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ДанныеДляРасчета.РазностьДатГраницПериода >= 1
	|КОНЕЦ");
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА НЕ Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|		ИНАЧЕ НЕ Псевдоним.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги
	|	КОНЕЦ");
	//Условия.Добавить(
	//"ВЫБОР
	//|		КОГДА Псевдоним.КорректироватьГодовойОбъем И Псевдоним.НеПрименятьСезонность
	//|			ТОГДА Истина
	//|		ИНАЧЕ МожноНачислятьСреднее
	//|	КОНЕЦ");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля,ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

Процедура ДобавитьРасчетОбъемаУслугиПоСреднемуНормативу(Схема,ВыбираемыеПоля, ВычисляемыеПоля, МВТ, ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				
	"__ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * __КоэффициентДляНачисленияСреднего__");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	"0");
	ПереопределяемыеПоля.Вставить("Сумма", 						
	"__ОбъемУслугиПоНорме__ * ЗначениеТарифаБезРазбивки * __ДлительностьПериодаПоНормативу__");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"__СниматьНачисленныйСреднийСреднееПоНормативу__");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"__ПовышающийКоэффициентСреднееПоНормативу__");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифа", 			"ЗначениеТарифаБезРазбивки");
	ПереопределяемыеПоля.Вставить("ТарифнаяЗона",		 		"ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
	
	Условия 				= Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоности = 0");
	Условия.Добавить("НЕ ОбъемЗаПрошлыйГод");
	//Условия.Добавить("ПриборВведен");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА НЕ Псевдоним.ПриборВведен
	|					И Псевдоним.ТочкаУчетаРодитель <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|				ТОГДА ВЫБОР
	
	|						КОГДА НЕ Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПоВсемТочкамУслугиРодителя
	|							ТОГДА ЛОЖЬ
	
	|						КОГДА Псевдоним.ТочкаУчетаРодительБезПоказаний ЕСТЬ NULL
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	
	|		КОГДА Псевдоним.ПриборВведен И Не Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|			ТОГДА ЛОЖЬ
	
	// если вывели ПУ, то остаток месяца надо считать по ПоСреднемуНормативу
	|			КОГДА НЕ Псевдоним.ПриборВведен  
	|					И ПоказанияВСрок
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Псевдоним.ПриборВведен
	|		КОНЕЦ");
	Условия.Добавить("НачислятьНорму 
	|ИЛИ НЕ ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)");
	Условия.Добавить("Не ПоказанияВСрок ИЛИ СрокПоверкиИстек ИЛИ НЕ ПриборВведен И ПоказанияВСрок");
	//Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|		И ВыводПрибораУчетаБезУказанияПоказаний	
	|		ТОГДА ИСТИНА
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|		И ВыводПрибораУчетаБезУказанияПоказаний
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ДанныеДляРасчета.РазностьДатГраницПериода >= 1
	|КОНЕЦ");
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА НЕ Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|		ИНАЧЕ НЕ Псевдоним.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги
	|	КОНЕЦ");
	//Условия.Добавить(
	//"ВЫБОР
	//|		КОГДА Псевдоним.КорректироватьГодовойОбъем И Псевдоним.НеПрименятьСезонность
	//|			ТОГДА Истина
	//|		ИНАЧЕ МожноНачислятьСреднее
	//|	КОНЕЦ");
	

	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля,ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

Процедура ДобавитьРасчетОбъемаПотребленногоПоСреднемуНормативу(Схема,ВыбираемыеПоля, ВычисляемыеПоля, МВТ, ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	
	"__ОбъемУслугиПотребленныйПоНорме__ * __ДлительностьПериодаПоНормативу__ * __КоэффициентДляНачисленияСреднего__"); 	
	ПереопределяемыеПоля.Вставить("Сумма", 						"0");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"__СниматьНачисленныйСреднийСреднееПоНормативу__");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"__ПовышающийКоэффициентСреднееПоНормативу__");
	ПереопределяемыеПоля.Вставить("ЗначениеТарифа",		 		"ЗначениеТарифаБезРазбивки");
	ПереопределяемыеПоля.Вставить("ТарифнаяЗона",		 		"ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА  __ОбъемУслугиПотребленныйПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА  __ОбъемУслугиПотребленныйПоНорме__ * __ДлительностьПериодаПоНормативу__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
		
	Условия 				= Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоностиОбъемПотребленный = 0");
	//Условия.Добавить("ПриборВведен");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА НЕ Псевдоним.ПриборВведен
	|					И Псевдоним.ТочкаУчетаРодитель <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|				ТОГДА ВЫБОР
	
	|						КОГДА НЕ Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПоВсемТочкамУслугиРодителя
	|							ТОГДА ЛОЖЬ
	
	|						КОГДА Псевдоним.ТочкаУчетаРодительБезПоказаний ЕСТЬ NULL
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	
	|		КОГДА Псевдоним.ПриборВведен И Не Псевдоним.УслугаПолностьюОприборена И Не Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|			ТОГДА ЛОЖЬ

	|			КОГДА НЕ Псевдоним.ПриборВведен
	|					И ПоказанияВСрок
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Псевдоним.ПриборВведен
	|		КОНЕЦ");


	Условия.Добавить("НачислятьНорму 
	|ИЛИ НЕ ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)");
	Условия.Добавить("Не ПоказанияВСрок ИЛИ СрокПоверкиИстек ИЛИ НЕ ПриборВведен И ПоказанияВСрок");
	//Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|		И ВыводПрибораУчетаБезУказанияПоказаний	
	|		ТОГДА ИСТИНА
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|		И ВыводПрибораУчетаБезУказанияПоказаний
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ДанныеДляРасчета.РазностьДатГраницПериода >= 1
	|КОНЕЦ");
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА НЕ Псевдоним.ЕстьСреднийПотребленныйПоВсемТочкамУслуги
	|		ИНАЧЕ НЕ Псевдоним.ЕстьСреднийПотребленныйПоВсемТочкамУслугиЗависитОтУслуги
	|	КОНЕЦ");
	//Условия.Добавить(
	//"ВЫБОР
	//|		КОГДА Псевдоним.КорректироватьГодовойОбъем И Псевдоним.НеПрименятьСезонность
	//|			ТОГДА Истина
	//|		ИНАЧЕ МожноНачислятьСреднее
	//|	КОНЕЦ");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия, ВычисляемыеПоля,ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

#КонецОбласти

#Область НачисленияПоСреднему

Процедура ДобавитьРасчетОбъемаУслугиПоСреднемуЗаПрошлыйГод(Схема,ВыбираемыеПоля, ВычисляемыеПоля, МВТ, ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				"__ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * __КоэффициентДляНачисленияСреднего__");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	"0");
	ПереопределяемыеПоля.Вставить("Сумма", 						"__ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * ЗначениеТарифа");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	"ЛОЖЬ");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"1");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"__ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * (Псевдоним.ПотериПроцент / 100) + Псевдоним.ПотериОбъем");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
		
	Условия 	= Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоности = 0");
	Условия.Добавить("ОбъемЗаПрошлыйГод");
	//Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|		И ВыводПрибораУчетаБезУказанияПоказаний	
	|		ТОГДА ИСТИНА
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|		И ВыводПрибораУчетаБезУказанияПоказаний
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ДанныеДляРасчета.РазностьДатГраницПериода >= 1
	|КОНЕЦ");
	
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|		ИНАЧЕ Псевдоним.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги
	|	КОНЕЦ");
	//Условия.Добавить(
	//"ВЫБОР
	//|		КОГДА Псевдоним.КорректироватьГодовойОбъем И Псевдоним.НеПрименятьСезонность
	//|			ТОГДА Истина
	//|		ИНАЧЕ МожноНачислятьСреднее
	//|	КОНЕЦ");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля,ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

Процедура ДобавитьРасчетОбъемаУслугиПоСреднему(Схема,ВыбираемыеПоля, ВычисляемыеПоля, МВТ, ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				"__ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * __КоэффициентДляНачисленияСреднего__");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	"0");
	ПереопределяемыеПоля.Вставить("Сумма", 						"__ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * ЗначениеТарифа");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	
	"ВЫБОР 
	|		КОГДА НЕ ПриборВведен
	|			ТОГДА ЛОЖЬ
	|		КОГДА ВыводПрибораУчетаБезУказанияПоказаний
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"1");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"__ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * (Псевдоним.ПотериПроцент / 100) + Псевдоним.ПотериОбъем");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"0");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
		
	Условия 				= Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоности = 0");
	Условия.Добавить("НЕ ОбъемЗаПрошлыйГод");
	Условия.Добавить("
	|ВЫБОР
	|	КОГДА ПриборВведен
	|		ТОГДА НЕ ДанныеДляРасчета.ПоказанияВСрок Или ДанныеДляРасчета.СрокПоверкиИстек 
	|	ИНАЧЕ ДанныеДляРасчета.СреднийОбъем >= 0 
	|КОНЕЦ");	
	//Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|		И ВыводПрибораУчетаБезУказанияПоказаний	
	|		ТОГДА ИСТИНА
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|		И ВыводПрибораУчетаБезУказанияПоказаний
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ДанныеДляРасчета.РазностьДатГраницПериода >= 1
	|КОНЕЦ");
	
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА Псевдоним.ЕстьСреднийПоВсемТочкамУслуги
	|		ИНАЧЕ Псевдоним.ЕстьСреднийПоВсемТочкамУслугиЗависитОтУслуги
	|	КОНЕЦ");	
	//Условия.Добавить(
	//"ВЫБОР
	//|		КОГДА Псевдоним.КорректироватьГодовойОбъем И Псевдоним.НеПрименятьСезонность
	//|			ТОГДА Истина
	//|		ИНАЧЕ МожноНачислятьСреднее
	//|	КОНЕЦ");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия,ВычисляемыеПоля,ТаблицаДанныеДляРасчета);
	
КонецПроцедуры

Процедура ДобавитьРасчетОбъемаПотребленногоПоСреднему(Схема,ВыбираемыеПоля, ВычисляемыеПоля, МВТ, ТаблицаДанныеДляРасчета)
	
	ПереопределяемыеПоля 	= Новый Структура;
		
	ПереопределяемыеПоля.Вставить("ОбъемУслуги", 				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленный",	"__ОбъемУслугиПотребленныйПоСреднему__ * __ДлительностьПериода__ * __КоэффициентДляНачисленияСреднего__");
	ПереопределяемыеПоля.Вставить("Сумма", 						"0");
	ПереопределяемыеПоля.Вставить("СниматьНачисленныйСредний", 	
	"ВЫБОР 
	|		КОГДА НЕ ПриборВведен
	|			ТОГДА ЛОЖЬ
	|		КОГДА ВыводПрибораУчетаБезУказанияПоказаний
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ");
	ПереопределяемыеПоля.Вставить("СпособНачисления", 			"ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)");
	ПереопределяемыеПоля.Вставить("НачальныеПоказания", 		"0");
	ПереопределяемыеПоля.Вставить("КонечныеПоказания", 			"0");
	ПереопределяемыеПоля.Вставить("ПовыщающийКоэффициент", 		"1");
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПотребленныйПоСреднему__ * __ДлительностьПериода__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) / Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");	
	ПереопределяемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * __ДлительностьПериодаПоНормативу__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ЗначениеПлощади = 0
	|					ТОГДА __ОбъемУслугиПотребленныйПоСреднему__ * __ДлительностьПериода__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления)/ Псевдоним.ЗначениеПлощади
	|				ИНАЧЕ 0
	|			 КОНЕЦ
	|	КОНЕЦ");
	
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотери",				"0");
	ПереопределяемыеПоля.Вставить("ОбъемУслугиПотребленныйПотери",	"__ОбъемУслугиПоСреднему__ * __ДлительностьПериода__ * (Псевдоним.ПотериПроцент / 100) + Псевдоним.ПотериОбъем");
	
	ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля);
		
	Условия 				= Новый Массив;
	Условия.Добавить("НЕ КоэффициентСезоностиОбъемПотребленный = 0");
	Условия.Добавить("
	|ВЫБОР
	|	КОГДА ПриборВведен
	|		ТОГДА НЕ ДанныеДляРасчета.ПоказанияВСрок Или  ДанныеДляРасчета.СрокПоверкиИстек
	|	ИНАЧЕ ДанныеДляРасчета.СреднийОбъемПотребленный >= 0 
	|КОНЕЦ");
	//Условия.Добавить("РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(КонецПериода, ДЕНЬ), ДЕНЬ) >= 1");
	Условия.Добавить(
	"ВЫБОР
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСУслугами
	|		И ВыводПрибораУчетаБезУказанияПоказаний	
	|		ТОГДА ИСТИНА
	|	КОГДА ДанныеДляРасчета.РазностьДатГраницПериода = 0					
	|		И СледующийРегистратор ССЫЛКА Документ.энргОперацияСПриборомУчета
	|		И ВыводПрибораУчетаБезУказанияПоказаний
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ДанныеДляРасчета.РазностьДатГраницПериода >= 1
	|КОНЕЦ");
	Условия.Добавить("НЕ СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем)");
	Условия.Добавить("НЕ РасчетТолькоПоПоказаниям");
	Условия.Добавить(
	"ВЫБОР
	|		КОГДА Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|			ТОГДА Псевдоним.ЕстьСреднийПотребленныйПоВсемТочкамУслуги
	|		ИНАЧЕ Псевдоним.ЕстьСреднийПотребленныйПоВсемТочкамУслугиЗависитОтУслуги
	|	КОНЕЦ");
	//Условия.Добавить(
	//"ВЫБОР
	//|		КОГДА Псевдоним.КорректироватьГодовойОбъем И Псевдоним.НеПрименятьСезонность
	//|			ТОГДА Истина
	//|		ИНАЧЕ МожноНачислятьСреднее
	//|	КОНЕЦ");
	
	Пакет 		= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 	= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	ДобавитьУсловияОператораЗапроса(Оператор.Отбор,Условия, ВычисляемыеПоля,ТаблицаДанныеДляРасчета);
	
КонецПроцедуры 

#КонецОбласти

Функция ВыбираемыеПоляРезультатНачисления() 
	
	ВыбираемыПоля = Новый Массив;
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Организация","ОрганизацияПлательщика"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПериодНачисления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Район"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","МКД"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЧастныйСектор"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Строение"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Помещение"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПомещениеРодитель"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПорядокПомещения"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПорядокСпособРаспределенияОбъемаПомещения"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Абонент"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ТочкаУчета"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ТочкаУчетаРодитель"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Услуга"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗависитОтУслуги"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПриборУчета"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Шкала"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ТарифнаяЗона"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПриборВведен"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НачалоПериода"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КонецПериода"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ДокументНачисления"));	
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ДокументНачисленияПометкаУдаления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Поставщик"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоэффициентСезоности"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НачальныеПоказания"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КонечныеПоказания"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","РасчетПоФормуле"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗависимаяТочкаУчета"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ВладелецЗависимойТочкиУчета"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоэффициентФормула"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗначениеПлощади"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоличествоПрописанных"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоличествоСобственников"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоличествоПроживающих"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоличествоЖильцов"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ВидПлощади"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПоказанияВСрок"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоэффициентПУ"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ТарифнаяГруппа"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ВидБлагоустройства"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ВидДифференцированности"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоличествоКомнат"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ДатаПоверки"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗакрытаяСхемаГВС"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","СоставнаяУслуга"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","УмножатьНаНормуРодительскойУслуги"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПлощадьМОП"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПлощадьАбонентов"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПлощадьСобственнаяПоставка"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НаправлениеИспользованияТУ"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Измеритель"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","СпособРаспределенияОбъемаПомещения"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ФиксированныйОбъемПотребления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ДоляПотребленияЧислитель"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ДоляПотребленияЗнаменатель"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоэффициентРаспределенияОстатка"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗавершениеОП"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","УдалитьЗапись"));	
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НеПрименятьСезонность"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НачислятьНорму"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НачислятьПоПрибору"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Техническая"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЕстьСреднийПоВсемТочкамУслуги"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КлючПомещения"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НормаПотребления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","СпособНачисления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗначениеТарифа"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗначениеТарифаСверхНорматива"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗначениеТарифаРЭК"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ОбъемУслугиПотребленный"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ОбъемУслуги"));	
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ОбъемУслугиПотери"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ОбъемУслугиПотребленныйПотери"));	
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","Сумма"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПовыщающийКоэффициент"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","СниматьНачисленныйСредний"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗначениеСоциальнойНормы"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЗначениеСоциальнойНормыРасчетныйСпособ"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоличествоИзмеретелейНаправления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КлючНорматива"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КлючСоцНорматива"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","СоциальнаяНормаЗависитОтРасхода"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","БылУстановленныйПриборВЭтомГоду"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПрименятьФормулуВсегда"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","РассчитыватьСоцНормуПоСтроке"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоэффициентНорматива"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоэффициентНормативаНеПрименятьСезонность"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ИспользоватьКоэффициентСдерживанияРостаПлаты"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НеПрименятьЗависимостьЕслиБольшеОднойТочки"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПотериОбъем"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПотериПроцент"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","СтроениеПредставление"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПомещениеПредставление"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","СоциальнаяНормаПотребления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ДопСоциальнаяНормаПотребления"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ФизЛицо"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПроцентСниженияСтоимости"));	
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","УслугаПолностьюОприборена"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","УслугаОграничена"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","НазначениеПУ"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ТипПомещенияРодителя"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПомещениеРодительСекция"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЭтоПростаяТочкаУчета"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ДоговорЗаключенДоТП"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","КоличествоДнейИспользованияУслуги"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ПрименятьТарифВРазрезеКомнат"));
	ВыбираемыПоля.Добавить(Новый Структура("Псевдоним,ВыбираемоеПоле","ЭтоОбъемПотребленный"));

	Возврат ВыбираемыПоля;
	
КонецФункции

Функция ВычисляемыеПоляРезультатНачисления(ЭтоОбъемПотребленный = Ложь)
	КоличествоДней = "(ВЫБОР 
	|		КОГДА Псевдоним.КолВоДнейИспользованияУслугиПриВремОтключении >= 0 и ((Псевдоним.ДниИспользованияУслугПриОтсутствии) < 0 или (Псевдоним.КолВоДнейИспользованияУслугиПриВремОтключении >Псевдоним.ДниИспользованияУслугПриОтсутствии)) 
	|			ТОГДА Псевдоним.КолВоДнейИспользованияУслугиПриВремОтключении 		
	|		КОГДА Псевдоним.ДниИспользованияУслугПриОтсутствии >= 0 
	|			ТОГДА Псевдоним.ДниИспользованияУслугПриОтсутствии 
	|		ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(Псевдоним.НачалоПериода, ДЕНЬ), НАЧАЛОПЕРИОДА(Псевдоним.КонецПериода, ДЕНЬ), ДЕНЬ) 
	|	КОНЕЦ ";
	
	ВычисляемыеПоля = Новый Структура;
	ВычисляемыеПоля.Вставить("КоличествоДнейИспользованияУслуги",
	"ВЫБОР 
	|		КОГДА Псевдоним.КолВоДнейИспользованияУслугиПриВремОтключении >= 0 и ((Псевдоним.ДниИспользованияУслугПриОтсутствии) < 0 или (Псевдоним.КолВоДнейИспользованияУслугиПриВремОтключении >Псевдоним.ДниИспользованияУслугПриОтсутствии)) 
	|			ТОГДА Псевдоним.КолВоДнейИспользованияУслугиПриВремОтключении 		
	|		КОГДА Псевдоним.ДниИспользованияУслугПриОтсутствии >= 0 
	|			ТОГДА Псевдоним.ДниИспользованияУслугПриОтсутствии 
	|		ИНАЧЕ -1 
	|	КОНЕЦ");
	
	ВычисляемыеПоля.Вставить("НачалоПериода",		"НАЧАЛОПЕРИОДА(Псевдоним.НачалоПериода, ДЕНЬ)");
	ВычисляемыеПоля.Вставить("Абонент",
	"ВЫБОР
	|	КОГДА Псевдоним.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|		ТОГДА Псевдоним.Абонент
	|	ИНАЧЕ Псевдоним.Плательщик
	|КОНЕЦ");
		
	#Область ПорядокПомещения
	
	ВычисляемыеПоля.Вставить("НормаПотребления", 	"
	|	ВЫРАЗИТЬ(Псевдоним.НормаПотребления  * ВЫБОР
	|		КОГДА Псевдоним.НеПрименятьСезонность
	|			ТОГДА Псевдоним.КоэффициентНормативаНеПрименятьСезонность
	|		ИНАЧЕ Псевдоним.КоэффициентНорматива
	|	КОНЕЦ КАК ЧИСЛО(15,6))");
	
	#КонецОбласти
	
	#Область ПорядокПомещения
	
	ВычисляемыеПоля.Вставить("ДлительностьПериодаПоНормативу", 
	КоличествоДней + " / ВЫБОР
	|				КОГДА Псевдоним.НормативПоДням
	|						И НЕ Псевдоним.НеПрименятьСезонность
	|					ТОГДА 1
	|				ИНАЧЕ Псевдоним.ДнейВПериоде
	|			КОНЕЦ) * ВЫБОР КОГДА Псевдоним.НормативПоЧасам ТОГДА 24 ИНАЧЕ 1 КОНЕЦ");
	
	ВычисляемыеПоля.Вставить("ДлительностьПериодаПоНормативуОбъемПотребленный", 
	КоличествоДней + " / ВЫБОР
	|		КОГДА Псевдоним.НормативПоДням
	|			ТОГДА 1
	|		ИНАЧЕ Псевдоним.ДнейВПериоде
	|	КОНЕЦ) * ВЫБОР КОГДА Псевдоним.НормативПоЧасам ТОГДА 24 ИНАЧЕ 1 КОНЕЦ");	
	
	ВычисляемыеПоля.Вставить("ДлительностьПериода", 
	КоличествоДней + " / Псевдоним.ДнейВПериоде)");
	
	#КонецОбласти 
	
	#Область ПорядокПомещения
	
	ВычисляемыеПоля.Вставить("ПорядокПомещения", 	"
	|	ВЫБОР
	|		КОГДА ТипПомещенияРодителя = Значение(Перечисление.энргТипыПомещений.Секция)
	|			ТОГДА -1
	|		КОГДА ПомещениеРодитель = Помещение
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ");
	
	#КонецОбласти
	
	#Область ПорядокСпособРаспределенияОбъемаПомещения
	
	ВычисляемыеПоля.Вставить("ПорядокСпособРаспределенияОбъемаПомещения", "
	|	ВЫБОР
	|		КОГДА СпособРаспределенияОбъемаПомещения = ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.Остаток)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ");
	
	#КонецОбласти
	
	#Область РасходПоПоказаниям
	
	ВычисляемыеПоля.Вставить("РасходПоПоказаниям",	"
	|ВЫБОР
	|			КОГДА УслугаОграничена
	|				ТОГДА 0
	|			КОГДА ДоговорЗаключенДоТП
	|				ТОГДА 0
	|			КОГДА РегистрируетОбъем
	|					И НЕ КонечныеПоказания = ДанныеДляРасчета.НачальныеПоказания
	|				ТОГДА КонечныеПоказания
	|			КОГДА РегистрируетОбъем
	|				ТОГДА 0
	|			КОГДА КонечныеПоказания < НачальныеПоказания
	|				ТОГДА МаксимальноВозможныеПоказания - НачальныеПоказания + КонечныеПоказания
	|			ИНАЧЕ КонечныеПоказания - НачальныеПоказания
	|		КОНЕЦ * КоэффициентПУ");
	
	#КонецОбласти
	
	#Область ЗначениеТарифаПоПриборам
	
	ВычисляемыеПоля.Вставить("ЗначениеТарифаПоПриборам","
	|	 ВЫБОР
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифа
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор ЕСТЬ NULL
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифа
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДляРасчета.СледующийРегистратор) = ТИП(Документ.энргУстановитьЗначениеТарифа)
	|			ТОГДА ДанныеДляРасчета.ПредыдущееЗначениеТарифа
	|		ИНАЧЕ ДанныеДляРасчета.ЗначениеТарифа
	|	КОНЕЦ");	
	
	#КонецОбласти
	
	#Область ЗначениеТарифаСверхНормативаПоПриборам
	
	ВычисляемыеПоля.Вставить("ЗначениеТарифаСверхНормативаПоПриборам","
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифаСверхНорматива
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор ЕСТЬ NULL
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифаСверхНорматива
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДляРасчета.СледующийРегистратор) = ТИП(Документ.энргУстановитьЗначениеТарифа)
	|			ТОГДА ДанныеДляРасчета.ПредыдущееЗначениеТарифаСверхНорматива
	|		ИНАЧЕ ДанныеДляРасчета.ЗначениеТарифаСверхНорматива
	|	КОНЕЦ"); 	
	
	#КонецОбласти
	
	#Область ЗначениеТарифаРЭКПоПриборам
	
	ВычисляемыеПоля.Вставить("ЗначениеТарифаРЭКПоПриборам","
	|	ВЫБОР
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифаРЭК
	|		КОГДА ДанныеДляРасчета.СледующийРегистратор ЕСТЬ NULL
	|			ТОГДА ДанныеДляРасчета.ЗначениеТарифаРЭК
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДляРасчета.СледующийРегистратор) = ТИП(Документ.энргУстановитьЗначениеТарифа)
	|			ТОГДА ДанныеДляРасчета.ПредыдущееЗначениеТарифаРЭК
	|		ИНАЧЕ ДанныеДляРасчета.ЗначениеТарифаРЭК
	|	КОНЕЦ");	
	
	#КонецОбласти
	
	#Область ОбъемУслугиПоНорме
	
	ВычисляемыеПоля.Вставить("ОбъемУслугиПоНорме", 
	"ВЫБОР
	|	КОГДА Псевдоним.УслугаОграничена
	|		ТОГДА 0
	|	КОГДА Псевдоним.ДоговорЗаключенДоТП
	|		ТОГДА 0
	|	КОГДА НЕ Псевдоним.Помещение = Псевдоним.ПомещениеРодитель
	|		ТОГДА 0
	|	ИНАЧЕ
	|		Псевдоним.КоэффициентСезоности * ВЫРАЗИТЬ(Псевдоним.НормаПотребления * ВЫБОР
	|			КОГДА Псевдоним.НеПрименятьСезонность
	|				ТОГДА Псевдоним.КоэффициентНормативаНеПрименятьСезонность
	|			ИНАЧЕ Псевдоним.КоэффициентНорматива
	|		КОНЕЦ КАК ЧИСЛО(15,6)) * ВЫБОР
	|			КОГДА НЕ Псевдоним.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|					И Псевдоним.ЕстьИзмерителиНаправления
	|				ТОГДА Псевдоним.КоличествоИзмеретелейНаправления
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади)
	|				ТОГДА Псевдоним.ЗначениеПлощади
	|			КОГДА Псевдоним.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|				ТОГДА Псевдоним.КоличествоЖильцов 	
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоПроживающих)
	|				ТОГДА Псевдоним.КоличествоПроживающих
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоПрописанных)
	|				ТОГДА Псевдоним.КоличествоПрописанных
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоСобственников)
	|				ТОГДА Псевдоним.КоличествоСобственников
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)
	|       	 	ТОГДА ВЫБОР
	|						КОГДА НЕ Псевдоним.КоличествоПроживающих = 0
	|							ТОГДА Псевдоним.КоличествоПроживающих
	|						КОГДА НЕ Псевдоним.КоличествоПрописанных = 0
	|							ТОГДА Псевдоним.КоличествоПрописанных
	|						ИНАЧЕ Псевдоним.КоличествоСобственников
	|					КОНЕЦ
	|		КОНЕЦ * ВЫБОР
	|			КОГДА Псевдоним.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|					И НЕ Псевдоним.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|				ТОГДА ВЫБОР
	|						КОГДА Псевдоним.ПлощадьАбонентов - Псевдоним.ПлощадьСобственнаяПоставка + Псевдоним.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (Псевдоним.ПлощадьАбонентов - Псевдоним.ПлощадьСобственнаяПоставка) / (Псевдоним.ПлощадьАбонентов - Псевдоним.ПлощадьСобственнаяПоставка + Псевдоним.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|КОНЕЦ");
	
	#КонецОбласти
	
	ВычисляемыеПоля.Вставить("КоличествоЧеловек", 
	"ВЫБОР
	|	КОГДА Псевдоним.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|		ТОГДА Псевдоним.КоличествоЖильцов
	|	КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоПроживающих)
	|		ТОГДА Псевдоним.КоличествоПроживающих
	|	КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоПрописанных)
	|		ТОГДА Псевдоним.КоличествоПрописанных
	|	КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоСобственников)
	|		ТОГДА Псевдоним.КоличествоСобственников
	|	ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.КоличествоПроживающих = 0
	|					ТОГДА Псевдоним.КоличествоПроживающих
	|				КОГДА НЕ Псевдоним.КоличествоПрописанных = 0
	|					ТОГДА Псевдоним.КоличествоПрописанных
	|				ИНАЧЕ Псевдоним.КоличествоСобственников
	|			КОНЕЦ
	|КОНЕЦ");
	
	#Область ОбъемУслугиПотребленныйПоНорме
	
	ВычисляемыеПоля.Вставить("ОбъемУслугиПотребленныйПоНорме", 
	"ВЫБОР
	|	КОГДА Псевдоним.УслугаОграничена
	|		ТОГДА 0
	|	КОГДА Псевдоним.ДоговорЗаключенДоТП
	|		ТОГДА 0
	|	КОГДА НЕ Псевдоним.Помещение = Псевдоним.ПомещениеРодитель
	|		ТОГДА 0
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(Псевдоним.НормаПотребления * Псевдоним.КоэффициентНорматива КАК  ЧИСЛО(15,6)) * ВЫБОР
	|			КОГДА НЕ Псевдоним.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)
	|					И Псевдоним.ЕстьИзмерителиНаправления
	|				ТОГДА Псевдоним.КоличествоИзмеретелейНаправления
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ЗначениеПлощади)
	|				ТОГДА Псевдоним.ЗначениеПлощади
	|			КОГДА Псевдоним.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|				ТОГДА Псевдоним.КоличествоЖильцов 	
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоПроживающих)
	|				ТОГДА Псевдоним.КоличествоПроживающих
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоПрописанных)
	|				ТОГДА Псевдоним.КоличествоПрописанных
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоСобственников)
	|				ТОГДА Псевдоним.КоличествоСобственников
	|			КОГДА Псевдоним.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)
	|      		  	ТОГДА ВЫБОР
	|						КОГДА НЕ Псевдоним.КоличествоПроживающих = 0
	|							ТОГДА Псевдоним.КоличествоПроживающих
	|						КОГДА НЕ Псевдоним.КоличествоПрописанных = 0
	|							ТОГДА Псевдоним.КоличествоПрописанных
	|						ИНАЧЕ Псевдоним.КоличествоСобственников
	|					КОНЕЦ
	|		КОНЕЦ * ВЫБОР
	|			КОГДА Псевдоним.ИспользоватьКоэффициентСдерживанияРостаПлаты
	|					И НЕ Псевдоним.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.Пустаяссылка)
	|				ТОГДА ВЫБОР
	|						КОГДА Псевдоним.ПлощадьАбонентов - Псевдоним.ПлощадьСобственнаяПоставка + Псевдоним.ПлощадьМОП = 0
	|							ТОГДА 0
	|						ИНАЧЕ (Псевдоним.ПлощадьАбонентов - Псевдоним.ПлощадьСобственнаяПоставка) / (Псевдоним.ПлощадьАбонентов - Псевдоним.ПлощадьСобственнаяПоставка + Псевдоним.ПлощадьМОП)
	|					КОНЕЦ
	|			ИНАЧЕ 1
	|		КОНЕЦ
	|КОНЕЦ");
	
	#КонецОбласти
	
	#Область ОбъемУслугиПоСреднему
	
	ВычисляемыеПоля.Вставить("ОбъемУслугиПоСреднему", 
	"ВЫБОР
	|	КОГДА Псевдоним.УслугаОграничена
	|			ТОГДА 0
	|	КОГДА Псевдоним.ДоговорЗаключенДоТП
	|		ТОГДА 0
	|	КОГДА НЕ Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ТОГДА Псевдоним.СреднийОбъемЗависитОтУслуги
	|	ИНАЧЕ Псевдоним.СреднийОбъем
	|	КОНЕЦ * КоэффициентПУ");
	
	#КонецОбласти
	
	#Область ОбъемУслугиПотребленныйПоСреднему
	
	ВычисляемыеПоля.Вставить("ОбъемУслугиПотребленныйПоСреднему", 
	"ВЫБОР
	|	КОГДА Псевдоним.УслугаОграничена
	|			ТОГДА 0
	|	КОГДА Псевдоним.ДоговорЗаключенДоТП
	|		ТОГДА 0
	|	КОГДА НЕ Псевдоним.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		ТОГДА Псевдоним.СреднийОбъемПотребленныйЗависитОтУслуги
	|	ИНАЧЕ Псевдоним.СреднийОбъемПотребленный
	|	КОНЕЦ * КоэффициентПУ");
	
	#КонецОбласти
	
	#Область ЗначениеСоциальнойНормы
	
	ВычисляемыеПоля.Вставить("ЗначениеСоциальнойНормы", 
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА -1
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__
	|		ИНАЧЕ __НормаПотребления__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления) 
	|	КОНЕЦ"); 	
	
	#КонецОбласти
	
	#Область ЗначениеСоциальнойНормыРасчетныйСпособ
	
	ВычисляемыеПоля.Вставить("ЗначениеСоциальнойНормыРасчетныйСпособ",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА __ОбъемУслугиПоНорме__ * ВЫБОР
	|					КОГДА Псевдоним.НормативПоДням
	|							И НЕ Псевдоним.НеПрименятьСезонность
	|						ТОГДА Псевдоним.ДнейВПериоде
	|					ИНАЧЕ 1 
	|				КОНЕЦ
	|		ИНАЧЕ __НормаПотребления__ * (__КоличествоЧеловек__ * Псевдоним.СоциальнаяНормаПотребления + Псевдоним.ДопСоциальнаяНормаПотребления)
	|	КОНЕЦ");
	
	#КонецОбласти
	
	#Область СоциальнаяНормаЗависитОтРасхода
	
	ВычисляемыеПоля.Вставить("СоциальнаяНормаЗависитОтРасхода",
	"ВЫБОР
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Псевдоним.СпособОпределенияСоциальнойНормы = ЗНАЧЕНИЕ(Перечисление.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ");
	
	#КонецОбласти
	 
	#Область ПовыщающийКоэффициент
	
	ВычисляемыеПоля.Вставить("ПовыщающийКоэффициент",
	"ВЫБОР 
	|		КОГДА Псевдоним.ПереходНаНормативПоПричинеАктаНедопуска
	|			ТОГДА Псевдоним.ПовышающийКоэффициентПриАктеНедопуска
	|		КОГДА Псевдоним.ПроцентВетхости > 0 
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ Псевдоним.ПовышающийКоэффициент = -1
	|					И НЕ Псевдоним.НетВозможностьУстановкиПУ
	|				ТОГДА Псевдоним.ПовышающийКоэффициент
	|			ИНАЧЕ 1
	|		КОНЕЦ 
	|КОНЕЦ");
	
	#КонецОбласти
	
	#Область ПовышающийКоэффициентСреднееПоНормативу
	
	ВычисляемыеПоля.Вставить("ПовышающийКоэффициентСреднееПоНормативу",
	"ВЫБОР 
	|		КОГДА Псевдоним.ПереходНаНормативПоПричинеАктаНедопуска
	|			ТОГДА Псевдоним.ПовышающийКоэффициентПриАктеНедопуска		
	|		ИНАЧЕ 1 
	|КОНЕЦ");
	
	#КонецОбласти
	
	#Область СниматьНачисленныйСреднийСреднееПоНормативу 	
	
	ВычисляемыеПоля.Вставить("СниматьНачисленныйСреднийСреднееПоНормативу",
	"ВЫБОР 
	|	КОГДА ВыводПрибораУчетаБезУказанияПоказаний
	|		ТОГДА ЛОЖЬ
	|	ИНАЧЕ НЕ Псевдоним.ПереходНаНормативПоПричинеАктаНедопуска 
	|КОНЕЦ");
	
	#КонецОбласти
	
	#Область КоэффициентДляНачисленияСреднего
	
	ВычисляемыеПоля.Вставить("КоэффициентДляНачисленияСреднего", 
	"  ВЫБОР
	|				КОГДА Псевдоним.КорректироватьГодовойОбъем И Псевдоним.НеПрименятьСезонность
	|					ТОГДА 1
	|				КОГДА Псевдоним.МожноНачислятьСреднее
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ");
	
	#КонецОбласти
	
	#Область КоэффициентДляНачисленияСреднегоДляПотомка
	
	ВычисляемыеПоля.Вставить("КоэффициентДляНачисленияСреднегоДляПотомка", 
	"  ВЫБОР
	|				КОГДА Псевдоним.ТочкаУчетаРодитель <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка) И Псевдоним.ЕстьПриборУчетаРодителя
	|						И Не Псевдоним.ТочкаУчетаРодительБезПоказаний есть NULL И Не Псевдоним.МожноНачислятьСреднее 
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ");
	
	#КонецОбласти
	
	Если ЭтоОбъемПотребленный Тогда
		ВычисляемыеПоля.Вставить("ЭтоОбъемПотребленный", "  ИСТИНА");
	Иначе
		ВычисляемыеПоля.Вставить("ЭтоОбъемПотребленный", "  ЛОЖЬ");
	КонецЕсли;
	
	Возврат ВычисляемыеПоля;
	
КонецФункции

Процедура ПодставитьВычисляемыПоля(Схема, МВТ, ТаблицаДанныеДляРасчета, ВыбираемыеПоля, ВычисляемыеПоля, ПереопределяемыеПоля)
	
	НоваяСхема  				= Ложь;
	Если Схема = Неопределено Тогда
		Схема					= Новый СхемаЗапроса;
		НоваяСхема 				= Истина;
	КонецЕсли;
	
	Пакет  						= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество() - 1];
	Если Не НоваяСхема  Тогда
		
		Пакет.Операторы.Добавить();
	КонецЕсли;
	
	Оператор 					= Пакет.Операторы[Пакет.Операторы.Количество()-1];
	Источник 					= Оператор.Источники.Добавить(Тип("ОписаниеВременнойТаблицыСхемыЗапроса"),ТаблицаДанныеДляРасчета,ТаблицаДанныеДляРасчета).Источник;
	
	Для Каждого Колонка Из МВТ.Таблицы[ТаблицаДанныеДляРасчета].Колонки Цикл
		Источник.ДоступныеПоля.Добавить(Колонка.Имя,Колонка.ТипЗначения);
	КонецЦикла;   	
		
	Для Сч = 0 По ВыбираемыеПоля.ВГраница() Цикл
		ИндексКолонки 			= Неопределено;
		Если Не НоваяСхема Тогда
			Колонка 			= Пакет.Колонки[Сч];
			ИндексКолонки 		= Пакет.Колонки.Индекс(Колонка);
		КонецЕсли;
		
		ОписаниеКолонки 		= ВыбираемыеПоля[Сч];
		ИмяКолонки 				= ?(ОписаниеКолонки.ВыбираемоеПоле = Неопределено ИЛИ ПустаяСтрока(ОписаниеКолонки.ВыбираемоеПоле),ОписаниеКолонки.Псевдоним,ОписаниеКолонки.ВыбираемоеПоле );
		
		Если ПереопределяемыеПоля.Свойство(ИмяКолонки) Тогда 			
			ЗначениеПоля 		= ПодставитьПараметрыВФормулу(ПереопределяемыеПоля[ИмяКолонки],ВычисляемыеПоля, ТаблицаДанныеДляРасчета);			
		ИначеЕсли ВычисляемыеПоля.Свойство(ИмяКолонки) Тогда			
			ЗначениеПоля 		= ПодставитьПараметрыВФормулу(ВычисляемыеПоля[ИмяКолонки],ВычисляемыеПоля, ТаблицаДанныеДляРасчета);						
		Иначе 			
			ЗначениеПоля 		=  ИмяКолонки; 			
		КонецЕсли;
				
		Если ИндексКолонки = Неопределено Тогда
			Оператор.ВыбираемыеПоля.Добавить(ЗначениеПоля);	
		Иначе
			Оператор.ВыбираемыеПоля.Добавить(ЗначениеПоля,ИндексКолонки);			
		КонецЕсли; 	
		
		Если НоваяСхема Тогда
			Колонка 			= Пакет.Колонки[Пакет.Колонки.Количество()-1];
			Колонка.Псевдоним 	= ОписаниеКолонки.Псевдоним;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьУсловияОператораЗапроса(Отбор,Условия,ВычисляемыеПоля, ТаблицаДанныеДляРасчета)
	
	Для Сч = 0 По Условия.ВГраница() Цикл		
		Формула	= ПодставитьПараметрыВФормулу(Условия[Сч],ВычисляемыеПоля, ТаблицаДанныеДляРасчета); 		
		Отбор.Добавить(Формула);
	КонецЦикла;	
	
КонецПроцедуры

Функция ПодставитьПараметрыВФормулу(Знач Формула, ВычисляемыеПоля, ТаблицаДанныеДляРасчета)
	
	Результат 						= Формула; 	
	Если НЕ СтрНайти(Формула,"__") = 0  Тогда				
		ТекущаяПозиция 				= 1;
		НачалоПараметра  			= СтрНайти(Результат,"__",,1,1);
		ОкончаниеПараметра 			= СтрНайти(Результат,"__",,1,2);
		Пока НЕ ОкончаниеПараметра = 0 Цикл 										
			КлючВычисляемогоПоля 	= Сред(Результат,НачалоПараметра+2,ОкончаниеПараметра-НачалоПараметра-2);
			врФормула  				= ВычисляемыеПоля[КлючВычисляемогоПоля];
			Результат 				= СтрЗаменить(Результат,"__" + КлючВычисляемогоПоля + "__" , врФормула);
			НачалоПараметра  		= СтрНайти(Результат,"__",,ОкончаниеПараметра+1,1);
			ОкончаниеПараметра 		= СтрНайти(Результат,"__",,ОкончаниеПараметра+1,2);
		КонецЦикла;
						
	КонецЕсли;
	
	Результат 						= СтрЗаменить(Результат,"Псевдоним." , ТаблицаДанныеДляРасчета + ".");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НачислениеЛьгот

Функция ПолучитьТекстЗапросаДляЛьготников()
	Возврат
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВложенныйЗапрос.НачалоПериода КАК НачалоПериода,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.КолвоЖильцов КАК КолвоЖильцов,
	|	ВложенныйЗапрос.НормаПотребления КАК НормаПотребления,
	|	ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	энргВидыУслуг.ВидПлощади <> ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.пустаяссылка) КАК РасчетПоПлощади
	|ПОМЕСТИТЬ энргОбъемНачислений
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Организация КАК Организация,
	|		&Район КАК Район,
	|		энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|		энргОбъемНачислений.Строение КАК Строение,
	|		энргОбъемНачислений.Помещение КАК Помещение,
	|		энргОбъемНачислений.Абонент КАК Абонент,
	|		энргОбъемНачислений.Услуга КАК Услуга,
	|		энргОбъемНачислений.Поставщик КАК Поставщик,
	|		энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|		энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|		энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|		ВЫБОР
	|			КОГДА энргОбъемНачислений.КоличествоПроживающих <> 0
	|				ТОГДА энргОбъемНачислений.КоличествоПроживающих
	|			КОГДА энргОбъемНачислений.КоличествоПрописанных <> 0
	|				ТОГДА энргОбъемНачислений.КоличествоПрописанных
	|			КОГДА энргОбъемНачислений.КоличествоСобственников <> 0
	|				ТОГДА энргОбъемНачислений.КоличествоСобственников
	|		КОНЕЦ КАК КолвоЖильцов,
	|		энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|		ВЫБОР
	|			КОГДА энргОбъемНачислений.Услуга.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.пустаяссылка)
	|				ТОГДА энргОбъемНачислений.ОбъемУслуги
	|			ИНАЧЕ энргОбъемНачислений.ЗначениеПлощади
	|		КОНЕЦ КАК ОбъемУслуги
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргОбъемНачисленийОбороты.Период КАК Период,
	|			энргОбъемНачисленийОбороты.Регистратор КАК Регистратор,
	|			энргОбъемНачисленийОбороты.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			РегистрНакопления.энргОбъемНачислений.Обороты(
	|					&НачалоПериода,
	|					&КонецПериода,
	|					Запись,
	|					Организация = &Организация
	|						И Район = &Район
	|						И ЧастныйСектор = &ЧастныйСектор
	|						И Строение = &Строение) КАК энргОбъемНачисленийОбороты) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|			ПО ВложенныйЗапрос.Период = энргОбъемНачислений.Период
	|				И ВложенныйЗапрос.Регистратор = энргОбъемНачислений.Регистратор
	|				И ВложенныйЗапрос.НомерСтроки = энргОбъемНачислений.НомерСтроки) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
	|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
	|	энргВзаиморасчетыПоМесяцамОстатки.МКД КАК МКД,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ энргВзаиморасчетыПоМесяцамОстатки
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&МесяцЗадолженности,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &Строение
	|				И ПериодНачисления <= &МесяцЗадолженности) КАК энргВзаиморасчетыПоМесяцамОстатки
	|ГДЕ
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Строение КАК Строение,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.КолвоЖильцов КАК КолвоЖильцов,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.РасчетПоПлощади КАК РасчетПоПлощади
	|ПОМЕСТИТЬ ВТ_ТолькоПоОтборам
	|ИЗ
	|	энргОбъемНачислений КАК энргОбъемНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргВзаиморасчетыПоМесяцамОстатки КАК энргВзаиморасчетыПоМесяцамОстатки
	|		ПО энргОбъемНачислений.Организация = энргВзаиморасчетыПоМесяцамОстатки.Организация
	|			И энргОбъемНачислений.Район = энргВзаиморасчетыПоМесяцамОстатки.Район
	|			И энргОбъемНачислений.Строение = энргВзаиморасчетыПоМесяцамОстатки.МКД
	|			И энргОбъемНачислений.Услуга = энргВзаиморасчетыПоМесяцамОстатки.Услуга
	|			И энргОбъемНачислений.Абонент = энргВзаиморасчетыПоМесяцамОстатки.Абонент
	|			И энргОбъемНачислений.Поставщик = энргВзаиморасчетыПоМесяцамОстатки.Поставщик
	|ГДЕ
	|	энргВзаиморасчетыПоМесяцамОстатки.Организация ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Начало КАК Период,
	|	энргПроживаниеЖильцовСрезПоследних.Жилец КАК Жилец,
	|	энргПроживаниеЖильцовСрезПоследних.Состояние КАК Состояние,
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_Жильцы
	|ИЗ
	|	РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(&Начало, ) КАК энргПроживаниеЖильцовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО энргПроживаниеЖильцовСрезПоследних.Организация = ВТ_ТолькоПоОтборам.Организация
	|			И энргПроживаниеЖильцовСрезПоследних.Район = ВТ_ТолькоПоОтборам.Район
	|			И энргПроживаниеЖильцовСрезПоследних.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргПроживаниеЖильцов.Период, ДЕНЬ),
	|	энргПроживаниеЖильцов.Жилец,
	|	энргПроживаниеЖильцов.Состояние,
	|	ВТ_ТолькоПоОтборам.Абонент
	|ИЗ
	|	РегистрСведений.энргПроживаниеЖильцов КАК энргПроживаниеЖильцов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО энргПроживаниеЖильцов.Организация = ВТ_ТолькоПоОтборам.Организация
	|			И энргПроживаниеЖильцов.Район = ВТ_ТолькоПоОтборам.Район
	|			И энргПроживаниеЖильцов.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|ГДЕ
	|	энргПроживаниеЖильцов.Период МЕЖДУ &Начало И &Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Жильцы.Период КАК ПериодС,
	|	Жильцы.Жилец КАК Жилец,
	|	Жильцы.Состояние КАК Состояние,
	|	ЕСТЬNULL(Жильцы1.Период, &Конец) КАК ПериодПо,
	|	Жильцы.Абонент КАК Абонент
	|ПОМЕСТИТЬ СтабильныеТолькоДляЖильцов
	|ИЗ
	|	ВТ_Жильцы КАК Жильцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Жильцы КАК Жильцы1
	|		ПО Жильцы.Период < Жильцы1.Период
	|			И Жильцы.Жилец = Жильцы1.Жилец
	|ГДЕ
	|	Жильцы.Период <> &Конец
	|;
	|
	|ВЫБРАТЬ
	|	энргЖильцыЛьготныхКатегорийСрезПоследних.Жилец КАК Жилец,
	|	ВЫБОР
	|		КОГДА энргЖильцыЛьготныхКатегорийСрезПоследних.Состояние
	|			ТОГДА энргЖильцыЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.пустаяссылка)
	|	КОНЕЦ КАК Льгота,
	|	&Начало КАК Период,
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_Льготы
	|ИЗ
	|	ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(&Начало, ) КАК энргЖильцыЛьготныхКатегорийСрезПоследних
	|		ПО ВТ_ТолькоПоОтборам.Абонент = энргЖильцыЛьготныхКатегорийСрезПоследних.Абонент
	|			И ВТ_ТолькоПоОтборам.Район = энргЖильцыЛьготныхКатегорийСрезПоследних.Район
	|			И ВТ_ТолькоПоОтборам.Организация = энргЖильцыЛьготныхКатегорийСрезПоследних.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЖильцыЛьготныхКатегорий.Жилец,
	|	ВЫБОР
	|		КОГДА энргЖильцыЛьготныхКатегорий.Состояние
	|			ТОГДА энргЖильцыЛьготныхКатегорий.ЛьготнаяКатегория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.пустаяссылка)
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(энргЖильцыЛьготныхКатегорий.Период, ДЕНЬ),
	|	ВТ_ТолькоПоОтборам.Абонент
	|ИЗ
	|	РегистрСведений.энргЖильцыЛьготныхКатегорий КАК энргЖильцыЛьготныхКатегорий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО энргЖильцыЛьготныхКатегорий.Организация = ВТ_ТолькоПоОтборам.Организация
	|			И энргЖильцыЛьготныхКатегорий.Район = ВТ_ТолькоПоОтборам.Район
	|			И энргЖильцыЛьготныхКатегорий.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|ГДЕ
	|	энргЖильцыЛьготныхКатегорий.Период МЕЖДУ &Начало И &Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Жильцы.Период КАК Период,
	|	ВТ_Жильцы.Жилец КАК Жилец
	|ПОМЕСТИТЬ ПериодыЖильцыЛьготы
	|ИЗ
	|	ВТ_Жильцы КАК ВТ_Жильцы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Льготы.Период,
	|	ВТ_Льготы.Жилец
	|ИЗ
	|	ВТ_Льготы КАК ВТ_Льготы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыЖильцыЛьготы.Период КАК Период,
	|	ПериодыЖильцыЛьготы.Жилец КАК Жилец
	|ПОМЕСТИТЬ ПериодЖЛБезПовт
	|ИЗ
	|	ПериодыЖильцыЛьготы КАК ПериодыЖильцыЛьготы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодЖЛБезПовт.Период КАК ПериодС,
	|	ПериодЖЛБезПовт.Жилец КАК Жилец,
	|	МИНИМУМ(ЕСТЬNULL(ПериодЖЛБезПовт1.Период, &Конец)) КАК ПериодПо
	|ПОМЕСТИТЬ СтабильныеПериодыДляВсехБезРесурсов
	|ИЗ
	|	ПериодЖЛБезПовт КАК ПериодЖЛБезПовт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодЖЛБезПовт КАК ПериодЖЛБезПовт1
	|		ПО ПериодЖЛБезПовт.Жилец = ПериодЖЛБезПовт1.Жилец
	|			И ПериодЖЛБезПовт.Период < ПериодЖЛБезПовт1.Период
	|ГДЕ
	|	ПериодЖЛБезПовт.Период <> &Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодЖЛБезПовт.Период,
	|	ПериодЖЛБезПовт.Жилец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Льготы.Жилец КАК Жилец,
	|	ВТ_Льготы.Период КАК ПериодС,
	|	ЕСТЬNULL(ВТ_Льготы1.Период, &Конец) КАК ПериодПо,
	|	ВТ_Льготы.Льгота КАК Льгота
	|ПОМЕСТИТЬ СтабильныеПериодыТолькоДляЛьгот
	|ИЗ
	|	ВТ_Льготы КАК ВТ_Льготы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Льготы КАК ВТ_Льготы1
	|		ПО ВТ_Льготы.Жилец = ВТ_Льготы1.Жилец
	|			И ВТ_Льготы.Период < ВТ_Льготы1.Период
	|ГДЕ
	|	ВТ_Льготы.Период <> &Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДляВсехБезРесурсов.ПериодС КАК ПериодС,
	|	СтабильныеПериодыДляВсехБезРесурсов.ПериодПо КАК ПериодПо,
	|	СтабильныеПериодыДляВсехБезРесурсов.Жилец КАК Жилец,
	|	СтабильныеПериодыТолькоДляЛьгот.Льгота КАК Льгота,
	|	СтабильныеТолькоДляЖильцов.Состояние КАК Состояние,
	|	СтабильныеТолькоДляЖильцов.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОбъединенныеСтабильныеПериоды
	|ИЗ
	|	СтабильныеПериодыДляВсехБезРесурсов КАК СтабильныеПериодыДляВсехБезРесурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеТолькоДляЖильцов КАК СтабильныеТолькоДляЖильцов
	|		ПО СтабильныеПериодыДляВсехБезРесурсов.Жилец = СтабильныеТолькоДляЖильцов.Жилец
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодС >= СтабильныеТолькоДляЖильцов.ПериодС
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодПо <= СтабильныеТолькоДляЖильцов.ПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтабильныеПериодыТолькоДляЛьгот КАК СтабильныеПериодыТолькоДляЛьгот
	|		ПО СтабильныеПериодыДляВсехБезРесурсов.Жилец = СтабильныеПериодыТолькоДляЛьгот.Жилец
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодС >= СтабильныеПериодыТолькоДляЛьгот.ПериодС
	|			И СтабильныеПериодыДляВсехБезРесурсов.ПериодПо <= СтабильныеПериодыТолькоДляЛьгот.ПериодПо
	|ГДЕ
	|	СтабильныеТолькоДляЖильцов.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеЖильцов.регистрация)
	|	И СтабильныеПериодыТолькоДляЛьгот.Льгота <> ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.Пустаяссылка)
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ТолькоПоОтборам.НачалоПериода КАК Период,
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОбъединениеПериодовСНачислениями
	|ИЗ
	|	ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТолькоПоОтборам.КонецПериода,
	|	ВТ_ТолькоПоОтборам.Абонент
	|ИЗ
	|	ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъединенныеСтабильныеПериоды.ПериодС,
	|	ОбъединенныеСтабильныеПериоды.Абонент
	|ИЗ
	|	ОбъединенныеСтабильныеПериоды КАК ОбъединенныеСтабильныеПериоды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъединенныеСтабильныеПериоды.ПериодПо,
	|	ОбъединенныеСтабильныеПериоды.Абонент
	|ИЗ
	|	ОбъединенныеСтабильныеПериоды КАК ОбъединенныеСтабильныеПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъединениеПериодовСНачислениями.Период КАК Период,
	|	ОбъединениеПериодовСНачислениями.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОбъединениеПериодовСНачислениямиБезПовт
	|ИЗ
	|	ОбъединениеПериодовСНачислениями КАК ОбъединениеПериодовСНачислениями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъединениеПериодовСНачислениямиБезПовт.Абонент КАК Абонент,
	|	ОбъединениеПериодовСНачислениямиБезПовт.Период КАК ПериодC,
	|	МИНИМУМ(ЕСТЬNULL(ОбъединениеПериодовСНачислениямиБезПовт1.Период, &Конец)) КАК ПериодПо
	|ПОМЕСТИТЬ СтабльныеПериодыБезРесурсовОбъединение
	|ИЗ
	|	ОбъединениеПериодовСНачислениямиБезПовт КАК ОбъединениеПериодовСНачислениямиБезПовт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъединениеПериодовСНачислениямиБезПовт КАК ОбъединениеПериодовСНачислениямиБезПовт1
	|		ПО ОбъединениеПериодовСНачислениямиБезПовт.Период < ОбъединениеПериодовСНачислениямиБезПовт1.Период
	|			И ОбъединениеПериодовСНачислениямиБезПовт.Абонент = ОбъединениеПериодовСНачислениямиБезПовт1.Абонент
	|ГДЕ
	|	ОбъединениеПериодовСНачислениямиБезПовт.Период <> &Конец
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединениеПериодовСНачислениямиБезПовт.Период,
	|	ОбъединениеПериодовСНачислениямиБезПовт.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТолькоПоОтборам.Абонент КАК Абонент,
	|	ВТ_ТолькоПоОтборам.Район КАК Район,
	|	ВТ_ТолькоПоОтборам.Организация КАК Организация,
	|	ВТ_ТолькоПоОтборам.Строение КАК Строение,
	|	ВТ_ТолькоПоОтборам.ЗначениеТарифа КАК ЗначениеТарифа,
	|	СтабльныеПериодыБезРесурсовОбъединение.ПериодC КАК ПериодC,
	|	СтабльныеПериодыБезРесурсовОбъединение.ПериодПо КАК ПериодПо,
	|	ВТ_ТолькоПоОтборам.КолвоЖильцов КАК КолвоЖильцов,
	|	ВТ_ТолькоПоОтборам.НормаПотребления КАК НормаПотребления,
	|	ВТ_ТолькоПоОтборам.ОбъемУслуги КАК ОбъемУслуги,
	|	ОбъединенныеСтабильныеПериоды.Жилец КАК Жилец,
	|	ОбъединенныеСтабильныеПериоды.Льгота КАК Льгота,
	|	ВТ_ТолькоПоОтборам.Услуга КАК Услуга,
	|	ВТ_ТолькоПоОтборам.РасчетПоПлощади КАК РасчетПоПлощади,
	|	ВТ_ТолькоПоОтборам.Поставщик КАК Поставщик,
	|	РАЗНОСТЬДАТ(ВТ_ТолькоПоОтборам.НачалоПериода, ВТ_ТолькоПоОтборам.КонецПериода, ДЕНЬ) КАК РазностьДатПоНачислениям
	|ПОМЕСТИТЬ ПакетДляРасчетаПодготовка
	|ИЗ
	|	СтабльныеПериодыБезРесурсовОбъединение КАК СтабльныеПериодыБезРесурсовОбъединение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъединенныеСтабильныеПериоды КАК ОбъединенныеСтабильныеПериоды
	|		ПО СтабльныеПериодыБезРесурсовОбъединение.Абонент = ОбъединенныеСтабильныеПериоды.Абонент
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодC >= ОбъединенныеСтабильныеПериоды.ПериодС
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодПо <= ОбъединенныеСтабильныеПериоды.ПериодПо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТолькоПоОтборам КАК ВТ_ТолькоПоОтборам
	|		ПО СтабльныеПериодыБезРесурсовОбъединение.Абонент = ВТ_ТолькоПоОтборам.Абонент
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодC >= ВТ_ТолькоПоОтборам.НачалоПериода
	|			И СтабльныеПериодыБезРесурсовОбъединение.ПериодПо <= ВТ_ТолькоПоОтборам.КонецПериода
	|ГДЕ
	|	ВТ_ТолькоПоОтборам.КолвоЖильцов <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетДляРасчетаПодготовка.Абонент КАК Абонент,
	|	ПакетДляРасчетаПодготовка.Район КАК Район,
	|	ПакетДляРасчетаПодготовка.Организация КАК Организация,
	|	ПакетДляРасчетаПодготовка.Строение КАК Строение,
	|	ПакетДляРасчетаПодготовка.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ПакетДляРасчетаПодготовка.ПериодC КАК ПериодC,
	|	ПакетДляРасчетаПодготовка.ПериодПо КАК ПериодПо,
	|	ПакетДляРасчетаПодготовка.КолвоЖильцов КАК КолвоЖильцов,
	|	ПакетДляРасчетаПодготовка.НормаПотребления КАК НормаПотребления,
	|	ПакетДляРасчетаПодготовка.ОбъемУслуги КАК ОбъемУслуги,
	|	ПакетДляРасчетаПодготовка.Жилец КАК Жилец,
	|	ПакетДляРасчетаПодготовка.Льгота КАК Льгота,
	|	ПакетДляРасчетаПодготовка.Услуга КАК Услуга,
	|	энргЗначенияСоциальныхНормативовДляЛьгот.ЗначениеНорматива КАК ЗначениеНорматива,
	|	ПакетДляРасчетаПодготовка.РасчетПоПлощади КАК РасчетПоПлощади,
	|	ЕСТЬNULL(энргЗначенияЛьготныхКатегорий.ПроцентОтНачислений, 0) КАК ПроцентЛьготы,
	|	ПакетДляРасчетаПодготовка.Поставщик КАК Поставщик,
	|	ПакетДляРасчетаПодготовка.РазностьДатПоНачислениям КАК РазностьДатПоНачислениям
	|ПОМЕСТИТЬ ПакетДляРасчета
	|ИЗ
	|	ПакетДляРасчетаПодготовка КАК ПакетДляРасчетаПодготовка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИспользованиеСоцНормативовВУслугах.СрезПоследних(&Конец, ) КАК энргИспользованиеСоцНормативовВУслугахСрезПоследних
	|		ПО ПакетДляРасчетаПодготовка.Услуга = энргИспользованиеСоцНормативовВУслугахСрезПоследних.Услуга
	|			И ПакетДляРасчетаПодготовка.Район = энргИспользованиеСоцНормативовВУслугахСрезПоследних.Район
	|			И ПакетДляРасчетаПодготовка.Организация = энргИспользованиеСоцНормативовВУслугахСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияСоциальныхНормативовДляЛьгот.СрезПоследних(&Конец, ) КАК энргЗначенияСоциальныхНормативовДляЛьгот
	|		ПО (энргИспользованиеСоцНормативовВУслугахСрезПоследних.Использование)
	|			И ПакетДляРасчетаПодготовка.Организация = энргЗначенияСоциальныхНормативовДляЛьгот.Организация
	|			И ПакетДляРасчетаПодготовка.Район = энргЗначенияСоциальныхНормативовДляЛьгот.Район
	|			И ПакетДляРасчетаПодготовка.КолвоЖильцов = энргЗначенияСоциальныхНормативовДляЛьгот.КоличествоПрописанных
	|			И ПакетДляРасчетаПодготовка.Услуга = энргЗначенияСоциальныхНормативовДляЛьгот.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияЛьготныхКатегорий.СрезПоследних(&Конец, ) КАК энргЗначенияЛьготныхКатегорий
	|		ПО ПакетДляРасчетаПодготовка.Организация = энргЗначенияЛьготныхКатегорий.Организация
	|			И ПакетДляРасчетаПодготовка.Район = энргЗначенияЛьготныхКатегорий.Район
	|			И ПакетДляРасчетаПодготовка.Льгота = энргЗначенияЛьготныхКатегорий.ЛьготнаяКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетДляРасчета.Абонент КАК Абонент,
	|	ПакетДляРасчета.Район КАК Район,
	|	ПакетДляРасчета.Организация КАК Организация,
	|	ПакетДляРасчета.Строение КАК Строение,
	|	ПакетДляРасчета.ЗначениеТарифа КАК ЗначениеТарифа,
	|	МИНИМУМ(ПакетДляРасчета.ПериодC) КАК НачалоПериода,
	|	МАКСИМУМ(ПакетДляРасчета.ПериодПо) КАК КонецПериода,
	|	ПакетДляРасчета.Жилец КАК Жилец,
	|	ПакетДляРасчета.Льгота КАК ЛьготнаяКатегория,
	|	ПакетДляРасчета.ПроцентЛьготы КАК ПроцентЛьготы,
	|	ПакетДляРасчета.Услуга КАК Услуга,
	|	энргНачислениеДляЛьготныхЛиц.Ссылка КАК СсылкаНаСущДок,
	|	энргНачислениеДляЛьготныхЛиц.ПометкаУдаления КАК ПометкаУдаления,
	|	ПакетДляРасчета.Поставщик КАК Поставщик,
	|	СУММА(ВЫБОР
	|			КОГДА ПакетДляРасчета.РасчетПоПлощади
	|				ТОГДА ВЫБОР
	|						КОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов < ПакетДляРасчета.ЗначениеНорматива
	|							ТОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов
	|						ИНАЧЕ ПакетДляРасчета.ЗначениеНорматива
	|					КОНЕЦ * ПакетДляРасчета.ПроцентЛьготы * 0.01 * ПакетДляРасчета.ЗначениеТарифа * ПакетДляРасчета.НормаПотребления * (РАЗНОСТЬДАТ(ПакетДляРасчета.ПериодC, ПакетДляРасчета.ПериодПо, ДЕНЬ) / ПакетДляРасчета.РазностьДатПоНачислениям)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов < ПакетДляРасчета.НормаПотребления
	|						ТОГДА ПакетДляРасчета.ОбъемУслуги / ПакетДляРасчета.КолвоЖильцов
	|					ИНАЧЕ ПакетДляРасчета.НормаПотребления
	|				КОНЕЦ * ПакетДляРасчета.ПроцентЛьготы * 0.01 * ПакетДляРасчета.ЗначениеТарифа * (РАЗНОСТЬДАТ(ПакетДляРасчета.ПериодC, ПакетДляРасчета.ПериодПо, ДЕНЬ) / ПакетДляРасчета.РазностьДатПоНачислениям)
	|		КОНЕЦ) КАК СуммаЛьготы
	|ИЗ
	|	ПакетДляРасчета КАК ПакетДляРасчета
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.энргНачислениеДляЛьготныхЛиц КАК энргНачислениеДляЛьготныхЛиц
	|		ПО ПакетДляРасчета.Район = энргНачислениеДляЛьготныхЛиц.Район
	|			И ПакетДляРасчета.Организация = энргНачислениеДляЛьготныхЛиц.Организация
	|			И ПакетДляРасчета.Строение = энргНачислениеДляЛьготныхЛиц.МКД
	|			И (энргНачислениеДляЛьготныхЛиц.Дата = &КонецМинусСекунда)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПакетДляРасчета.Абонент,
	|	ПакетДляРасчета.Район,
	|	ПакетДляРасчета.Организация,
	|	ПакетДляРасчета.Строение,
	|	ПакетДляРасчета.ЗначениеТарифа,
	|	ПакетДляРасчета.Жилец,
	|	ПакетДляРасчета.Льгота,
	|	ПакетДляРасчета.ПроцентЛьготы,
	|	ПакетДляРасчета.Услуга,
	|	энргНачислениеДляЛьготныхЛиц.Ссылка,
	|	энргНачислениеДляЛьготныхЛиц.ПометкаУдаления,
	|	ПакетДляРасчета.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Строение";
КонецФункции 

#КонецОбласти

#Область РаспределениеМКД

Функция ТекстЗапросаВспомогательныеДанныеРаспределениеМКД(Строение)
	
	Текст 							=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПлощадьМОП КАК ПлощадьМОП,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВложенныйЗапрос.КлючНорматива КАК КлючНорматива,
	|	ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|	ЕСТЬNULL(ТипПринадлежностиМКД.ВидТепловогоПункта, ЗНАЧЕНИЕ(Перечисление.энргВидыТепловыхПунктов.ПустаяСсылка)) КАК ВидТепловогоПункта,
	|	ЕСТЬNULL(ТипСхемыГВС.ТипСхемы, ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка)) КАК ТипСхемы
	|ПОМЕСТИТЬ УслугиМКДРаспределять
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтабильныеПериодыМКД.Организация КАК Организация,
	|		энргСтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		энргСтабильныеПериодыМКД.Район КАК Район,
	|		энргСтабильныеПериодыМКД.МКД КАК МКД,
	|		энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	|		энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		энргСтабильныеПериодыМКД.ЗначениеПлощади КАК ПлощадьМОП,
	|		энргСтабильныеПериодыМКД.СоставнаяУслуга КАК СоставнаяУслуга,
	|		энргСтабильныеПериодыМКД.КлючНорматива КАК КлючНорматива,
	|		ДокументыДляРаспределения.ЗавершениеОП КАК ЗавершениеОП,
	|		ВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|		ЕСТЬNULL(ПризнакРаспределенияОДНПриЛюбойФормеУправления.Распределять, ЛОЖЬ) КАК РаспределятьОДНПриЛюбойФормеУправления
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|			ПО энргСтабильныеПериодыМКД.Организация = ДокументыДляРаспределения.Организация
	|				И энргСтабильныеПериодыМКД.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|				И энргСтабильныеПериодыМКД.Район = ДокументыДляРаспределения.Район
	|				И энргСтабильныеПериодыМКД.МКД = ДокументыДляРаспределения.Строение
	|				И (НЕ энргСтабильныеПериодыМКД.НеРаспределятьНаАбонентов)
	|				И (энргСтабильныеПериодыМКД.Организация = &Организация)
	|				И (энргСтабильныеПериодыМКД.Район = &Район)
	|				И (энргСтабильныеПериодыМКД.МКД = &Строение)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК ВидыУслуг
	|			ПО энргСтабильныеПериодыМКД.Услуга = ВидыУслуг.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПризнакРаспределенияОДНПриЛюбойФормеУправления КАК ПризнакРаспределенияОДНПриЛюбойФормеУправления
	|			ПО энргСтабильныеПериодыМКД.Услуга = ПризнакРаспределенияОДНПриЛюбойФормеУправления.Услуга
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СтабильныеПериодыМКД.Организация КАК Организация,
	|				СтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|				СтабильныеПериодыМКД.Район КАК Район,
	|				СтабильныеПериодыМКД.МКД КАК МКД,
	|				СтабильныеПериодыМКД.Услуга КАК Услуга,
	|				СтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|				МАКСИМУМ(СтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|			ИЗ
	|				РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериодыМКД
	|			ГДЕ
	|				СтабильныеПериодыМКД.Организация = &Организация
	|				И СтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления
	|				И СтабильныеПериодыМКД.Район = &Район
	|				И СтабильныеПериодыМКД.МКД = &Строение
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СтабильныеПериодыМКД.Организация,
	|				СтабильныеПериодыМКД.ПериодНачисления,
	|				СтабильныеПериодыМКД.Район,
	|				СтабильныеПериодыМКД.МКД,
	|				СтабильныеПериодыМКД.Услуга,
	|				СтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|			ПО энргСтабильныеПериодыМКД.Организация = ВложенныйЗапрос.Организация
	|				И энргСтабильныеПериодыМКД.ПериодНачисления = ВложенныйЗапрос.ПериодНачисления
	|				И энргСтабильныеПериодыМКД.Район = ВложенныйЗапрос.Район
	|				И энргСтабильныеПериодыМКД.Услуга = ВложенныйЗапрос.Услуга
	|				И энргСтабильныеПериодыМКД.МКД = ВложенныйЗапрос.МКД
	|				И энргСтабильныеПериодыМКД.ТочкаУчета = ВложенныйЗапрос.ТочкаУчета
	|				И энргСтабильныеПериодыМКД.НомерПозиции = ВложенныйЗапрос.НомерПозиции) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДвУК КАК МКДвУК
	|		ПО ВложенныйЗапрос.Организация = МКДвУК.Организация
	|			И ВложенныйЗапрос.Район = МКДвУК.Район
	|			И ВложенныйЗапрос.МКД = МКДвУК.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргТипПринадлежностиМКД.СрезПоследних(&Период, ) КАК ТипПринадлежностиМКД
	|		ПО ВложенныйЗапрос.Организация = ТипПринадлежностиМКД.Организация
	|			И ВложенныйЗапрос.Район = ТипПринадлежностиМКД.Район
	|			И ВложенныйЗапрос.МКД = ТипПринадлежностиМКД.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргТипСхемыГВС.СрезПоследних(&Период, ) КАК ТипСхемыГВС
	|		ПО ВложенныйЗапрос.Организация = ТипСхемыГВС.Организация
	|			И ВложенныйЗапрос.Район = ТипСхемыГВС.Район
	|			И ВложенныйЗапрос.МКД = ТипСхемыГВС.МКД
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ МКДвУК.Организация ЕСТЬ NULL
	|					И ВложенныйЗапрос.РаспределятьОДНПриЛюбойФормеУправления
	|				ТОГДА ИСТИНА
	|			КОГДА МКДвУК.Организация ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			КОГДА ВложенныйЗапрос.КорректироватьИндивидуальныйОбъемСУчетомОДПУ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УслугиМКДРаспределять.Организация КАК Организация,
	|	УслугиМКДРаспределять.ПериодНачисления КАК ПериодНачисления,
	|	УслугиМКДРаспределять.Район КАК Район,
	|	УслугиМКДРаспределять.МКД КАК МКД,
	|	УслугиМКДРаспределять.Услуга КАК Услуга,
	|	УслугиМКДРаспределять.ПлощадьМОП КАК ПлощадьМОП,
	|	"""" КАК ФормулаРасчетаНормативаПотребления,
	|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК ЗначениеНорматива,
	|	энргВидыУслуг.ВидПлощади КАК ВидПлощади,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ЕСТЬNULL(МКДНеНачислятьТЭ.НеНачислять, ЛОЖЬ) КАК НеНачислятьУслугуАбонентам,
	|	УслугиМКДРаспределять.ЗавершениеОП КАК ЗавершениеОП
	|ПОМЕСТИТЬ УслугиМКДРаспределятьВспомогательныеДанные
	|ИЗ
	|	УслугиМКДРаспределять КАК УслугиМКДРаспределять
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО УслугиМКДРаспределять.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
	|		ПО УслугиМКДРаспределять.Организация = ЗначенияТекущихНормПотребления.Организация
	|			И УслугиМКДРаспределять.ПериодНачисления = ЗначенияТекущихНормПотребления.ПериодНачисления
	|			И УслугиМКДРаспределять.Район = ЗначенияТекущихНормПотребления.Район
	|			И УслугиМКДРаспределять.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
	|			И УслугиМКДРаспределять.Услуга = ЗначенияТекущихНормПотребления.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДНеНачислятьТЭ КАК МКДНеНачислятьТЭ
	|		ПО УслугиМКДРаспределять.Организация = МКДНеНачислятьТЭ.Организация
	|			И УслугиМКДРаспределять.ПериодНачисления = МКДНеНачислятьТЭ.ПериодНачисления
	|			И УслугиМКДРаспределять.Район = МКДНеНачислятьТЭ.Район
	|			И УслугиМКДРаспределять.МКД = МКДНеНачислятьТЭ.МКД
	|			И УслугиМКДРаспределять.Услуга = МКДНеНачислятьТЭ.Услуга
	|			И УслугиМКДРаспределять.ТипСхемы = МКДНеНачислятьТЭ.ТипСхемы
	|			И УслугиМКДРаспределять.ВидТепловогоПункта = МКДНеНачислятьТЭ.ПринадлежностьКТепловомуПункту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	энргВидыУслуг.НачислятьПоСостояниюНаНачалоРасчетногоПериода КАК НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|ПОМЕСТИТЬ ПоследниеНомераСтрока
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляРаспределения.Организация КАК Организация,
	|		ДокументыДляРаспределения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляРаспределения.Район КАК Район,
	|		ДокументыДляРаспределения.Строение КАК Строение,
	|		энргСтабильныеПериоды.Помещение КАК Помещение,
	|		NULL КАК ОбъектРасчета,
	|		энргСтабильныеПериоды.Услуга КАК Услуга,
	|		энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции,
	|		МАКСИМУМ(энргСтабильныеПериоды.ДатаСостоянияЛицевогоСчета) КАК ДатаСостоянияЛицевогоСчета
	|	ИЗ
	|		ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ПО ДокументыДляРаспределения.Организация = энргСтабильныеПериоды.Организация
	|				И ДокументыДляРаспределения.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|				И ДокументыДляРаспределения.Район = энргСтабильныеПериоды.Район
	|				И ДокументыДляРаспределения.Строение = энргСтабильныеПериоды.Строение
	|				И (энргСтабильныеПериоды.Организация = &Организация)
	|				И (энргСтабильныеПериоды.Район = &Район)
	|				И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|				И (энргСтабильныеПериоды.Строение = &Строение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументыДляРаспределения.Организация,
	|		ДокументыДляРаспределения.ПериодНачисления,
	|		ДокументыДляРаспределения.Район,
	|		ДокументыДляРаспределения.Строение,
	|		энргСтабильныеПериоды.Помещение,
	|		энргСтабильныеПериоды.Услуга,
	|		энргСтабильныеПериоды.ТочкаУчета
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ДокументыДляРаспределения.Организация,
	|		ДокументыДляРаспределения.ПериодНачисления,
	|		ДокументыДляРаспределения.Район,
	|		энргНомераСтрокСтабильногоПериода.МКД,
	|		NULL,
	|		энргНомераСтрокСтабильногоПериода.ОбъектРасчета,
	|		энргНомераСтрокСтабильногоПериода.Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета,
	|		МАКСИМУМ(энргНомераСтрокСтабильногоПериода.НомерПозиции),
	|		МАКСИМУМ(ДАТАВРЕМЯ(1, 1, 1))
	|	ИЗ
	|		ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНомераСтрокСтабильногоПериодаНП КАК энргНомераСтрокСтабильногоПериода
	|			ПО ДокументыДляРаспределения.Организация = энргНомераСтрокСтабильногоПериода.Организация
	|				И ДокументыДляРаспределения.ПериодНачисления = энргНомераСтрокСтабильногоПериода.ПериодНачисления
	|				И ДокументыДляРаспределения.Район = энргНомераСтрокСтабильногоПериода.Район
	|				И (энргНомераСтрокСтабильногоПериода.Организация = &Организация)
	|				И (энргНомераСтрокСтабильногоПериода.Район = &Район)
	|				И (энргНомераСтрокСтабильногоПериода.МКД = &Строение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументыДляРаспределения.Организация,
	|		ДокументыДляРаспределения.ПериодНачисления,
	|		ДокументыДляРаспределения.Район,
	|		энргНомераСтрокСтабильногоПериода.ОбъектРасчета,
	|		энргНомераСтрокСтабильногоПериода.Услуга,
	|		энргНомераСтрокСтабильногоПериода.ТочкаУчета,
	|		энргНомераСтрокСтабильногоПериода.МКД) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеНомераСтрока.Организация КАК Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления КАК ПериодНачисления,
	|	ПоследниеНомераСтрока.Район КАК Район,
	|	ПоследниеНомераСтрока.Строение КАК Строение,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА энргСтабильныеПериоды.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|			ТОГДА энргСтабильныеПериоды.Абонент
	|		ИНАЧЕ энргСтабильныеПериоды.Плательщик
	|	КОНЕЦ КАК Абонент,
	|	ПоследниеНомераСтрока.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.ПриборВведен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриборов,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргПомещения.ТипПомещения = ЗНАЧЕНИЕ(Перечисление.энргТипыПомещений.секция)
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(энргЗначенияПлощадейСрезПоследних.Площадь, энргСтабильныеПериоды.ЗначениеПлощади)
	|		КОНЕЦ) КАК ЗначениеПлощади,
	|	МАКСИМУМ(энргСтабильныеПериоды.КоличествоЖильцов) КАК КоличествоЖильцов,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Абонент.ФизЛицо = энргСтабильныеПериоды.Поставщик
	|					ИЛИ энргСтабильныеПериоды.Поставщик = ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьСобственнаяПоставка,
	|	МАКСИМУМ(энргСтабильныеПериоды.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	энргСтабильныеПериоды.Поставщик КАК Поставщик,
	|	МАКСИМУМ(ПоследниеНомераСтрока.ДатаСостоянияЛицевогоСчета) КАК ДатаСостоянияЛицевогоСчета,
	|	МАКСИМУМ(энргСтабильныеПериоды.НаправлениеИспользованияТУ) КАК НаправлениеИспользованияТУ,
	|	NULL КАК Договор,
	|	ЛОЖЬ КАК ЭЭ,
	|	КлючиПомещений.КлючПомещения КАК КлючПомещения,
	|	NULL КАК ПодключениеНеОтОбщейСборки
	|ПОМЕСТИТЬ АбонентыДляРаспределения
	|ИЗ
	|	ПоследниеНомераСтрока КАК ПоследниеНомераСтрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей.СрезПоследних(&Период, ) КАК энргЗначенияПлощадейСрезПоследних
	|				ПО энргАбоненты.Организация = энргЗначенияПлощадейСрезПоследних.Организация
	|					И энргАбоненты.Район = энргЗначенияПлощадейСрезПоследних.Район
	|					И энргАбоненты.КлючПомещения = энргЗначенияПлощадейСрезПоследних.КлючПомещения
	|					И (энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))
	|			ПО энргСтабильныеПериоды.Абонент = энргАбоненты.Ссылка
	|		ПО ПоследниеНомераСтрока.Организация = энргСтабильныеПериоды.Организация
	|			И ПоследниеНомераСтрока.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|			И (энргСтабильныеПериоды.Строение = &Строение)
	|			И ПоследниеНомераСтрока.Район = энргСтабильныеПериоды.Район
	|			И ПоследниеНомераСтрока.Строение = энргСтабильныеПериоды.Строение
	|			И ПоследниеНомераСтрока.Помещение = энргСтабильныеПериоды.Помещение
	|			И ПоследниеНомераСтрока.Услуга = энргСтабильныеПериоды.Услуга
	|			И ПоследниеНомераСтрока.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|						И ПоследниеНомераСтрока.НомерПозиции > 0
	|						И энргСтабильныеПериоды.ЛСОткрыт
	|						И энргСтабильныеПериоды.УслугаПодключена
	|					ТОГДА ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|					ТОГДА энргСтабильныеПериоды.НомерПозиции = 0
	|				ИНАЧЕ ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА энргСтабильныеПериоды.ЛСОткрыт
	|					ТОГДА ИСТИНА
	|				КОГДА НЕ энргСтабильныеПериоды.ЛСОткрыт
	|						И энргСтабильныеПериоды.УслугаПодключена
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ПоследниеНомераСтрока.Помещение = энргПомещения.Ссылка
	|			И (энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|				ИЛИ энргПомещения.ТипПомещения = ЗНАЧЕНИЕ(Перечисление.энргТипыПомещений.секция))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК КлючиПомещений
	|		ПО ПоследниеНомераСтрока.Строение = КлючиПомещений.Строение
	|			И ПоследниеНомераСтрока.Помещение = КлючиПомещений.Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Помещение,
	|	ВЫБОР
	|		КОГДА энргСтабильныеПериоды.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|			ТОГДА энргСтабильныеПериоды.Абонент
	|		ИНАЧЕ энргСтабильныеПериоды.Плательщик
	|	КОНЕЦ,
	|	ПоследниеНомераСтрока.Услуга,
	|	энргСтабильныеПериоды.Поставщик,
	|	КлючиПомещений.КлючПомещения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.ОбъектРасчета,
	|	энргСтабильныеПериоды.ОбъектРасчета,
	|	ПоследниеНомераСтрока.Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.ПриборВведен
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади),
	|	МАКСИМУМ(0),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСтабильныеПериоды.Договор.Контрагент = энргСтабильныеПериоды.Поставщик
	|					ИЛИ энргСтабильныеПериоды.Поставщик = ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
	|				ТОГДА энргСтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(энргСтабильныеПериоды.ТарифнаяГруппа),
	|	&Поставщик,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление),
	|	энргСтабильныеПериоды.Договор,
	|	энргВидыУслуг.бестИспользоватьРасчетЭлектроэнергии,
	|	NULL,
	|	ТУПодключенныеНеОтОбщейСборки.ПодключениеНеОтОбщейСборки
	|ИЗ
	|	ПоследниеНомераСтрока КАК ПоследниеНомераСтрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК энргСтабильныеПериоды
	|		ПО ПоследниеНомераСтрока.Организация = энргСтабильныеПериоды.Организация
	|			И ПоследниеНомераСтрока.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (энргСтабильныеПериоды.МКД = &Строение)
	|			И ПоследниеНомераСтрока.Район = энргСтабильныеПериоды.Район
	|			И ПоследниеНомераСтрока.Строение = энргСтабильныеПериоды.МКД
	|			И ПоследниеНомераСтрока.ОбъектРасчета = энргСтабильныеПериоды.ОбъектРасчета
	|			И ПоследниеНомераСтрока.Услуга = энргСтабильныеПериоды.Услуга
	|			И ПоследниеНомераСтрока.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|					ТОГДА энргСтабильныеПериоды.НомерПозиции = 0
	|				ИНАЧЕ ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			КОНЕЦ)
	|			И (энргСтабильныеПериоды.ОбъектРасчетаПодключен)
	|			И (энргСтабильныеПериоды.УслугаПодключена)
	|			И (энргСтабильныеПериоды.Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ПоследниеНомераСтрока.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТУПодключенныеНеОтОбщейСборки КАК ТУПодключенныеНеОтОбщейСборки
	|		ПО ПоследниеНомераСтрока.Организация = ТУПодключенныеНеОтОбщейСборки.Организация
	|			И ПоследниеНомераСтрока.Район = ТУПодключенныеНеОтОбщейСборки.Район
	|			И ПоследниеНомераСтрока.Строение = ТУПодключенныеНеОтОбщейСборки.МКД
	|			И ПоследниеНомераСтрока.ТочкаУчета = ТУПодключенныеНеОтОбщейСборки.ТочкаУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Договор,
	|	энргСтабильныеПериоды.ОбъектРасчета,
	|	ПоследниеНомераСтрока.Услуга,
	|	энргВидыУслуг.бестИспользоватьРасчетЭлектроэнергии,
	|	ТУПодключенныеНеОтОбщейСборки.ПодключениеНеОтОбщейСборки,
	|	энргСтабильныеПериоды.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеНомераСтрока.Организация КАК Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления КАК ПериодНачисления,
	|	ПоследниеНомераСтрока.Район КАК Район,
	|	ПоследниеНомераСтрока.Строение КАК Строение,
	|	ВЫБОР
	|		КОГДА энргПомещенияРодительСекции.Ссылка ЕСТЬ NULL
	|				ИЛИ энргПомещенияРодительСекции.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.пустаяссылка)
	|			ТОГДА энргПомещения.Родитель
	|		ИНАЧЕ энргПомещенияРодительСекции.Родитель
	|	КОНЕЦ КАК ПомещениеРодитель,
	|	энргСтабильныеПериоды.Помещение КАК Помещение,
	|	энргСтабильныеПериоды.Абонент КАК Абонент,
	|	ПоследниеНомераСтрока.Услуга КАК Услуга,
	|	МАКСИМУМ(энргСтабильныеПериоды.СпособРаспределенияОбъемаПомещения) КАК СпособРаспределенияОбъемаПомещения,
	|	МАКСИМУМ(энргСтабильныеПериоды.ФиксированныйОбъемПотребления) КАК ФиксированныйОбъемПотребления,
	|	МАКСИМУМ(энргСтабильныеПериоды.ДоляПотребленияЧислитель) КАК ДоляПотребленияЧислитель,
	|	МАКСИМУМ(энргСтабильныеПериоды.ДоляПотребленияЗнаменатель) КАК ДоляПотребленияЗнаменатель,
	|	МАКСИМУМ(энргСтабильныеПериоды.ЗначениеПлощади) КАК ЗначениеПлощади,
	|	МАКСИМУМ(энргСтабильныеПериоды.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(энргСтабильныеПериоды.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	МАКСИМУМ(энргСтабильныеПериоды.КоличествоСобственников) КАК КоличествоСобственников,
	|	МАКСИМУМ(энргСтабильныеПериоды.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	МАКСИМУМ(энргСтабильныеПериоды.Поставщик) КАК Поставщик,
	|	МАКСИМУМ(ПоследниеНомераСтрока.ДатаСостоянияЛицевогоСчета) КАК ДатаСостоянияЛицевогоСчета,
	|	МАКСИМУМ(энргСтабильныеПериоды.КлючСоцНорматива) КАК КлючСоцНорматива,
	|	МАКСИМУМ(энргСтабильныеПериоды.НаправлениеИспользованияТУ) КАК НаправлениеИспользованияТУ,
	|	МАКСИМУМ(энргСтабильныеПериоды.ДопСоциальнаяНормаПотребления) КАК ДопСоциальнаяНормаПотребления,
	|	КлючиПомещений.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ АбонентыРазделенныеЛицевыеСчета
	|ИЗ
	|	ПоследниеНомераСтрока КАК ПоследниеНомераСтрока
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО ПоследниеНомераСтрока.Организация = энргСтабильныеПериоды.Организация
	|			И ПоследниеНомераСтрока.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (НЕ энргСтабильныеПериоды.ЧастныйСектор)
	|			И (энргСтабильныеПериоды.Строение = &Строение)
	|			И ПоследниеНомераСтрока.Район = энргСтабильныеПериоды.Район
	|			И ПоследниеНомераСтрока.Строение = энргСтабильныеПериоды.Строение
	|			И ПоследниеНомераСтрока.Помещение = энргСтабильныеПериоды.Помещение
	|			И ПоследниеНомераСтрока.Услуга = энргСтабильныеПериоды.Услуга
	|			И ПоследниеНомераСтрока.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И (ВЫБОР
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|						И ПоследниеНомераСтрока.НомерПозиции > 0
	|						И энргСтабильныеПериоды.ЛСОткрыт
	|						И энргСтабильныеПериоды.УслугаПодключена
	|					ТОГДА ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|				КОГДА ПоследниеНомераСтрока.НачислятьПоСостояниюНаНачалоРасчетногоПериода
	|					ТОГДА энргСтабильныеПериоды.НомерПозиции = 0
	|				ИНАЧЕ ПоследниеНомераСтрока.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			КОНЕЦ)
	|			И (энргСтабильныеПериоды.ЛСОткрыт)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещенияРодительСекции
	|			ПО энргПомещения.Родитель = энргПомещенияРодительСекции.Ссылка
	|		ПО ПоследниеНомераСтрока.Помещение = энргПомещения.Ссылка
	|			И (НЕ энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК КлючиПомещений
	|		ПО ПоследниеНомераСтрока.Строение = КлючиПомещений.Строение
	|			И ПоследниеНомераСтрока.Помещение = КлючиПомещений.Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеНомераСтрока.Организация,
	|	ПоследниеНомераСтрока.ПериодНачисления,
	|	ПоследниеНомераСтрока.Район,
	|	ПоследниеНомераСтрока.Строение,
	|	энргСтабильныеПериоды.Помещение,
	|	энргСтабильныеПериоды.Абонент,
	|	ПоследниеНомераСтрока.Услуга,
	|	ВЫБОР
	|		КОГДА энргПомещенияРодительСекции.Ссылка ЕСТЬ NULL
	|				ИЛИ энргПомещенияРодительСекции.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.пустаяссылка)
	|			ТОГДА энргПомещения.Родитель
	|		ИНАЧЕ энргПомещенияРодительСекции.Родитель
	|	КОНЕЦ,
	|	КлючиПомещений.КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ВсегоАбонентов КАК ВсегоАбонентов,
	|	ВложенныйЗапрос.ВсегоСУстановелннымПриборомУчета КАК ВсегоСУстановелннымПриборомУчета,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|	ЕСТЬNULL(ДокументыРаспределенияМКД.ДокументНачисления, ЗНАЧЕНИЕ(Документ.энргРаспределениеМКД.ПустаяСсылка)) КАК ДокументРаспределения,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.ВидПлощадиМКД = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПлощадьМОПУказана,
	|	энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги
	|ПОМЕСТИТЬ ДанныеМКДПоУслугам
	|ИЗ
	|	(ВЫБРАТЬ
	|		АбонентыДляРаспределения.Организация КАК Организация,
	|		АбонентыДляРаспределения.ПериодНачисления КАК ПериодНачисления,
	|		АбонентыДляРаспределения.Район КАК Район,
	|		АбонентыДляРаспределения.Строение КАК Строение,
	|		АбонентыДляРаспределения.Услуга КАК Услуга,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АбонентыДляРаспределения.Помещение) КАК ВсегоАбонентов,
	|		СУММА(АбонентыДляРаспределения.КоличествоПриборов) КАК ВсегоСУстановелннымПриборомУчета,
	|		СУММА(АбонентыДляРаспределения.ЗначениеПлощади) КАК ВсегоПлощадьАбонентов,
	|		СУММА(АбонентыДляРаспределения.ПлощадьСобственнаяПоставка) КАК ВсегоПлощадьАбонентовСобственнаяПоставка
	|	ИЗ
	|		АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АбонентыДляРаспределения.Организация,
	|		АбонентыДляРаспределения.ПериодНачисления,
	|		АбонентыДляРаспределения.Район,
	|		АбонентыДляРаспределения.Строение,
	|		АбонентыДляРаспределения.Услуга) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРаспределенияМКД КАК ДокументыРаспределенияМКД
	|		ПО ВложенныйЗапрос.Организация = ДокументыРаспределенияМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = ДокументыРаспределенияМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = ДокументыРаспределенияМКД.Район
	|			И ВложенныйЗапрос.Строение = ДокументыРаспределенияМКД.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиМКДРаспределятьВспомогательныеДанные.Район КАК Район,
	|	УслугиМКДРаспределятьВспомогательныеДанные.МКД КАК Строение,
	|	УслугиМКДРаспределятьВспомогательныеДанные.Услуга КАК Услуга,
	|	МАКСИМУМ(УслугиМКДРаспределятьВспомогательныеДанные.ПлощадьМОП) КАК ПлощадьМОП,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ВидПлощади КАК ВидПлощади,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	МАКСИМУМ(УслугиМКДРаспределятьВспомогательныеДанные.ЗначениеНорматива) КАК ЗначениеНорматива,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ФормулаРасчетаНормативаПотребления КАК ФормулаРасчетаНорматива,
	|	УслугиМКДРаспределятьВспомогательныеДанные.НеНачислятьУслугуАбонентам КАК НеНачислятьУслугуАбонентам,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ОбъемУслугиНормативОборот, 0) КАК ОбъемУслугиНормативОборот,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.СпособНачисления, ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка)) КАК СпособНачисления,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ОбъемУслугиОборот, 0) КАК ОбъемУслугиОборот,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ОбъемУслугиПотребленныйОборот, 0) КАК ОбъемУслугиПотребленныйОборот,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ПоказанияПредоставленыОборот, 0) КАК ПоказанияПредоставлены,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ПоказанияПредоставленыПотребленныйОборот, 0) КАК ПоказанияПредоставленыПотребленный,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.НазначениеПрибораУчета, ЗНАЧЕНИЕ(ПЕречисление.энргНазначениеПУ.ПустаяСсылка)) КАК НазначениеПрибораУчета,
	|	ЕСТЬNULL(ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.РаспределятьПолностью, ЛОЖЬ) КАК РаспределятьПолностью,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ЗавершениеОП КАК ЗавершениеОП
	|ПОМЕСТИТЬ ОбъемыДляРаспределения
	|ИЗ
	|	УслугиМКДРаспределятьВспомогательныеДанные КАК УслугиМКДРаспределятьВспомогательныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленныйОбъемМКД КАК НачисленныйОбъемМКД
	|		ПО УслугиМКДРаспределятьВспомогательныеДанные.Организация = НачисленныйОбъемМКД.Организация
	|			И УслугиМКДРаспределятьВспомогательныеДанные.ПериодНачисления = НачисленныйОбъемМКД.ПериодНачисления
	|			И УслугиМКДРаспределятьВспомогательныеДанные.Район = НачисленныйОбъемМКД.Район
	|			И УслугиМКДРаспределятьВспомогательныеДанные.МКД = НачисленныйОбъемМКД.МКД
	|			И УслугиМКДРаспределятьВспомогательныеДанные.Услуга = НачисленныйОбъемМКД.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсторияСоглашенийОРаспределенииСверхнормативногоОДН КАК ИсторияСоглашенийОРаспределенииСверхнормативногоОДН
	|		ПО УслугиМКДРаспределятьВспомогательныеДанные.Организация = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Организация
	|			И УслугиМКДРаспределятьВспомогательныеДанные.ПериодНачисления = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.ПериодНачисления
	|			И УслугиМКДРаспределятьВспомогательныеДанные.Район = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Район
	|			И УслугиМКДРаспределятьВспомогательныеДанные.МКД = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.МКД
	|			И УслугиМКДРаспределятьВспомогательныеДанные.Услуга = ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиМКДРаспределятьВспомогательныеДанные.Район,
	|	УслугиМКДРаспределятьВспомогательныеДанные.МКД,
	|	УслугиМКДРаспределятьВспомогательныеДанные.Услуга,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ВидПлощади,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ЗависитОтУслуги,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ФормулаРасчетаНормативаПотребления,
	|	УслугиМКДРаспределятьВспомогательныеДанные.НеНачислятьУслугуАбонентам,
	|	УслугиМКДРаспределятьВспомогательныеДанные.ЗавершениеОП,
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ОбъемУслугиНормативОборот, 0),
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)),
	|	ЕСТЬNULL(НачисленныйОбъемМКД.СпособНачисления, ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка)),
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ОбъемУслугиОборот, 0),
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ОбъемУслугиПотребленныйОборот, 0),
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ПоказанияПредоставленыОборот, 0),
	|	ЕСТЬNULL(НачисленныйОбъемМКД.ПоказанияПредоставленыПотребленныйОборот, 0),
	|	ЕСТЬNULL(НачисленныйОбъемМКД.НазначениеПрибораУчета, ЗНАЧЕНИЕ(ПЕречисление.энргНазначениеПУ.ПустаяСсылка)),
	|	ЕСТЬNULL(ИсторияСоглашенийОРаспределенииСверхнормативногоОДН.РаспределятьПолностью, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Организация КАК Организация,
	|	энргОбъемНачисленийОбороты.Район КАК Район,
	|	энргОбъемНачисленийОбороты.Распределение КАК Распределение,
	|	энргОбъемНачисленийОбороты.Строение КАК Строение,
	|	энргОбъемНачисленийОбороты.Помещение КАК Помещение,
	|	энргОбъемНачисленийОбороты.Абонент КАК Абонент,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачисленийОбороты.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачисленийОбороты.Измеритель КАК Измеритель,
	|	энргОбъемНачисленийОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала КАК Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачисленийОбороты.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачисленийОбороты.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачисленийОбороты.Сумма КАК Сумма,
	|	энргОбъемНачисленийОбороты.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачисленийОбороты.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	энргОбъемНачисленийОбороты.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачисленийОбороты.КонецПериода КАК КонецПериода,
	|	энргОбъемНачисленийОбороты.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачисленийОбороты.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачисленийОбороты.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачисленийОбороты.КоличествоПрописанных КАК КоличествоПрописанных,
	|	0 КАК КоличествоЖильцов,
	|	энргОбъемНачисленийОбороты.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачисленийОбороты.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачисленийОбороты.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачисленийОбороты.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачисленийОбороты.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачисленийОбороты.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачисленийОбороты.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачисленийОбороты.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачисленийОбороты.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачисленийОбороты.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачисленийОбороты.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачисленийОбороты.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачисленийОбороты.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачисленийОбороты.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачисленийОбороты.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачисленийОбороты.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачисленийОбороты.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачисленийОбороты.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачисленийОбороты.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачисленийОбороты.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачисленийОбороты.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачисленийОбороты.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	энргОбъемНачисленийОбороты.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачисленийОбороты.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачисленийОбороты.ПомещениеРодитель КАК ПомещениеРодитель,
	|	энргОбъемНачисленийОбороты.СоциальнаяНормаПотребления КАК СоциальнаяНормаПотребления,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	энргОбъемНачисленийОбороты.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО (НАЧАЛОПЕРИОДА(энргОбъемНачисленийОбороты.Период, МЕСЯЦ) = ДокументыНачислений.ПериодНачисления)
	|			И энргОбъемНачисленийОбороты.Регистратор = ДокументыНачислений.ДокументНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Организация,
	|	энргОбъемНачисленийОбороты.Район,
	|	энргОбъемНачисленийОбороты.Распределение,
	|	энргОбъемНачисленийОбороты.Строение,
	|	энргОбъемНачисленийОбороты.Помещение,
	|	ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка),
	|	энргОбъемНачисленийОбороты.Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление),
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка),
	|	энргОбъемНачисленийОбороты.ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления,
	|	энргОбъемНачисленийОбороты.ЧастныйСектор,
	|	энргОбъемНачисленийОбороты.СверхНорматива,
	|	0,
	|	энргОбъемНачисленийОбороты.ОбъемУслуги,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный,
	|	0,
	|	0,
	|	энргОбъемНачисленийОбороты.НачалоПериода,
	|	энргОбъемНачисленийОбороты.КонецПериода,
	|	энргОбъемНачисленийОбороты.НачальныеПоказания,
	|	энргОбъемНачисленийОбороты.КонечныеПоказания,
	|	энргОбъемНачисленийОбороты.КоличествоКомнат,
	|	0,
	|	энргОбъемНачисленийОбороты.КоличествоЖильцов,
	|	энргОбъемНачисленийОбороты.ЗначениеПлощади,
	|	энргОбъемНачисленийОбороты.НормаПотребления,
	|	энргОбъемНачисленийОбороты.КоэффициентПУ,
	|	энргОбъемНачисленийОбороты.РасчетПоФормуле,
	|	энргОбъемНачисленийОбороты.ВидБлагоустройства,
	|	энргОбъемНачисленийОбороты.ТарифнаяГруппа,
	|	энргОбъемНачисленийОбороты.ДатаПоверки,
	|	энргОбъемНачисленийОбороты.ОтключатьВНеполивнойСезон,
	|	энргОбъемНачисленийОбороты.ЗависимаяТочкаУчета,
	|	энргОбъемНачисленийОбороты.КоэффициентРасчета,
	|	энргОбъемНачисленийОбороты.ВидДифференцированности,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчета,
	|	энргОбъемНачисленийОбороты.ОснованиеПерерасчетаДата,
	|	энргОбъемНачисленийОбороты.ПриборЗависимой,
	|	энргОбъемНачисленийОбороты.СписатьИзНормы,
	|	энргОбъемНачисленийОбороты.ПовыщающийКоэффициент,
	|	0,
	|	0,
	|	энргОбъемНачисленийОбороты.СниматьНачисленныйСредний,
	|	энргОбъемНачисленийОбороты.ПлощадьМОП,
	|	0,
	|	энргОбъемНачисленийОбороты.ПлощадьСобственнаяПоставка,
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргПомещения.Пустаяссылка),
	|	0,
	|	энргОбъемНачисленийОбороты.ЗначениеТарифаСверхНорматива,
	|	0
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыНачислений КАК ДокументыНачислений
	|		ПО (НАЧАЛОПЕРИОДА(энргОбъемНачисленийОбороты.Период, МЕСЯЦ) = ДокументыНачислений.ПериодНачисления)
	|			И энргОбъемНачисленийОбороты.Регистратор = ДокументыНачислений.ДокументНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПроцентРаспределенияОтрицательногоОДНСрезПоследних.Организация КАК Организация,
	|	энргПроцентРаспределенияОтрицательногоОДНСрезПоследних.Район КАК Район,
	|	энргПроцентРаспределенияОтрицательногоОДНСрезПоследних.МКД КАК МКД,
	|	энргПроцентРаспределенияОтрицательногоОДНСрезПоследних.Услуга КАК Услуга,
	|	энргПроцентРаспределенияОтрицательногоОДНСрезПоследних.Процент КАК Процент
	|ПОМЕСТИТЬ ПроцентРаспределенияОтрицательногоОДН
	|ИЗ
	|	РегистрСведений.энргПроцентРаспределенияОтрицательногоОДН.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, Услуга) В
	|				(ВЫБРАТЬ
	|					ДанныеМКДПоУслугам.Организация КАК Организация,
	|					ДанныеМКДПоУслугам.Район КАК Район,
	|					ДанныеМКДПоУслугам.Строение КАК Строение,
	|					ДанныеМКДПоУслугам.Услуга КАК Услуга
	|				ИЗ
	|					ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам)) КАК энргПроцентРаспределенияОтрицательногоОДНСрезПоследних";
	
	Если Строение = Неопределено Тогда		
		Текст 						= СтрЗаменить(Текст,"И (энргРаспределениеМКД.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.Строение = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.Строение = &Строение)","");		
		Текст 						= СтрЗаменить(Текст,"И Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И (бестОбъектыРасчета.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И МКД = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргНомераСтрокСтабильногоПериода.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыМКД.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргДокументыНачислений.МКД = &Строение)","");
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериодыМКД.МКД = &Строение","");
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеДляРаспределения(Строение)
	Текст 							= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ВсегоАбонентов КАК ВсегоАбонентов,
	|	ВложенныйЗапрос.ПлощадьМОП КАК ПлощадьМОП,
	|	ВложенныйЗапрос.ВсегоСУстановелннымПриборомУчета КАК ВсегоСУстановелннымПриборомУчета,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|	ВложенныйЗапрос.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|	ВложенныйЗапрос.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|	ВложенныйЗапрос.ОбъемУслуги КАК ОбъемУслуги,
	|	ВложенныйЗапрос.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ВложенныйЗапрос.ОбъемУслугиНорматив КАК ОбъемУслугиНорматив,
	|	ВложенныйЗапрос.РаспределятьПолностью КАК РаспределятьПолностью,
	|	ВложенныйЗапрос.НачисленаТолькоНорма КАК НачисленаТолькоНорма,
	|	ВложенныйЗапрос.ДокументРаспределения КАК ДокументРаспределения,
	|	ВложенныйЗапрос.ЕстьНачислениеПоПриборам КАК ЕстьНачислениеПоПриборам,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ПлощадьМОПУказана КАК ПлощадьМОПУказана,
	|	ВложенныйЗапрос.ВидПлощади КАК ВидПлощади,
	|	ВложенныйЗапрос.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ВложенныйЗапрос.ЗначениеНорматива КАК ЗначениеНорматива,
	|	ВложенныйЗапрос.ФормулаРасчетаНорматива КАК ФормулаРасчетаНорматива,
	|	ВложенныйЗапрос.НеРаспределятьСверхнорматив КАК НеРаспределятьСверхнорматив,
	|	ВложенныйЗапрос.НеНачислятьУслугуАбонентам КАК НеНачислятьУслугуАбонентам,
	|	ВложенныйЗапрос.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	ВложенныйЗапрос.ПоказанияПредоставленыПотребленный КАК ПоказанияПредоставленыПотребленный,
	|	ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|	ВложенныйЗапрос.НазначениеПрибораУчета КАК НазначениеПрибораУчета,
	|	ЕСТЬNULL(ПроцентРаспределенияОтрицательногоОДН.Процент, 0) КАК ПроцентРаспределенияОтрицательногоОбъема
	|ПОМЕСТИТЬ ОсновнаяВыборка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеМКДПоУслугам.Организация КАК Организация,
	|		ДанныеМКДПоУслугам.Район КАК Район,
	|		ДанныеМКДПоУслугам.ПериодНачисления КАК ПериодНачисления,
	|		ДанныеМКДПоУслугам.Строение КАК Строение,
	|		ДанныеМКДПоУслугам.Услуга КАК Услуга,
	|		ДанныеМКДПоУслугам.ВсегоАбонентов КАК ВсегоАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоСУстановелннымПриборомУчета КАК ВсегоСУстановелннымПриборомУчета,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|		ДанныеМКДПоУслугам.ПлощадьМОПУказана КАК ПлощадьМОПУказана,
	|		ДанныеМКДПоУслугам.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|		СУММА(ОбъемыДляРаспределения.ОбъемУслугиОборот) КАК ОбъемУслуги,
	|		СУММА(ОбъемыДляРаспределения.ОбъемУслугиПотребленныйОборот) КАК ОбъемУслугиПотребленный,
	|		СУММА(ОбъемыДляРаспределения.ОбъемУслугиНормативОборот) КАК ОбъемУслугиНорматив,
	|		МАКСИМУМ(ОбъемыДляРаспределения.РаспределятьПолностью) КАК РаспределятьПолностью,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ОбъемыДляРаспределения.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК НачисленаТолькоНорма,
	|		МАКСИМУМ(ОбъемыДляРаспределения.ПлощадьМОП) КАК ПлощадьМОП,
	|		ДанныеМКДПоУслугам.ДокументРаспределения КАК ДокументРаспределения,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ОбъемыДляРаспределения.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ЕстьНачислениеПоПриборам,
	|		ОбъемыДляРаспределения.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ОбъемыДляРаспределения.СпособНачисления КАК СпособНачисления,
	|		ОбъемыДляРаспределения.ВидПлощади КАК ВидПлощади,
	|		ОбъемыДляРаспределения.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|		ОбъемыДляРаспределения.НеНачислятьУслугуАбонентам КАК НеНачислятьУслугуАбонентам,
	|		ВЫРАЗИТЬ(ОбъемыДляРаспределения.ФормулаРасчетаНорматива КАК СТРОКА(1000)) КАК ФормулаРасчетаНорматива,
	|		ОбъемыДляРаспределения.ЗначениеНорматива КАК ЗначениеНорматива,
	|		ВЫРАЗИТЬ(ДанныеМКДПоУслугам.Услуга КАК Справочник.энргВидыУслуг).НормативДляИндивидуальных
	|			И ВЫРАЗИТЬ(ДанныеМКДПоУслугам.Услуга КАК Справочник.энргВидыУслуг).КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК НеРаспределятьСверхнорматив,
	|		МАКСИМУМ(ОбъемыДляРаспределения.ПоказанияПредоставлены) КАК ПоказанияПредоставлены,
	|		МАКСИМУМ(ОбъемыДляРаспределения.ПоказанияПредоставленыПотребленный) КАК ПоказанияПредоставленыПотребленный,
	|		ОбъемыДляРаспределения.ЗавершениеОП КАК ЗавершениеОП,
	|		ОбъемыДляРаспределения.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|	ИЗ
	|		ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыДляРаспределения КАК ОбъемыДляРаспределения
	|			ПО ДанныеМКДПоУслугам.Район = ОбъемыДляРаспределения.Район
	|				И ДанныеМКДПоУслугам.Строение = ОбъемыДляРаспределения.Строение
	|				И ДанныеМКДПоУслугам.Услуга = ОбъемыДляРаспределения.Услуга
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеМКДПоУслугам.Организация,
	|		ДанныеМКДПоУслугам.Район,
	|		ДанныеМКДПоУслугам.ПериодНачисления,
	|		ДанныеМКДПоУслугам.Строение,
	|		ДанныеМКДПоУслугам.Услуга,
	|		ДанныеМКДПоУслугам.ВсегоАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоСУстановелннымПриборомУчета,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентов,
	|		ДанныеМКДПоУслугам.ВсегоПлощадьАбонентовСобственнаяПоставка,
	|		ДанныеМКДПоУслугам.КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|		ДанныеМКДПоУслугам.ПлощадьМОПУказана,
	|		ОбъемыДляРаспределения.ТарифнаяЗона,
	|		ОбъемыДляРаспределения.СпособНачисления,
	|		ДанныеМКДПоУслугам.ДокументРаспределения,
	|		ОбъемыДляРаспределения.ВидПлощади,
	|		ОбъемыДляРаспределения.ЗависитОтУслуги,
	|		ВЫРАЗИТЬ(ОбъемыДляРаспределения.ФормулаРасчетаНорматива КАК СТРОКА(1000)),
	|		ОбъемыДляРаспределения.ЗначениеНорматива,
	|		ОбъемыДляРаспределения.НеНачислятьУслугуАбонентам,
	|		ОбъемыДляРаспределения.ЗавершениеОП,
	|		ОбъемыДляРаспределения.НазначениеПрибораУчета) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроцентРаспределенияОтрицательногоОДН КАК ПроцентРаспределенияОтрицательногоОДН
	|		ПО ВложенныйЗапрос.Организация = ПроцентРаспределенияОтрицательногоОДН.Организация
	|			И ВложенныйЗапрос.Район = ПроцентРаспределенияОтрицательногоОДН.Район
	|			И ВложенныйЗапрос.Строение = ПроцентРаспределенияОтрицательногоОДН.МКД
	|			И ВложенныйЗапрос.Услуга = ПроцентРаспределенияОтрицательногоОДН.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияТекущихТарифов.ПериодНачисления КАК ПериодНачисления,
	|	ЗначенияТекущихТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ЗначенияТекущихТарифов.Услуга КАК Услуга,
	|	ЗначенияТекущихТарифов.Поставщик КАК Поставщик,
	|	ЗначенияТекущихТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА НЕ энргИспользованиеТарифовРЭКСрезПоследних.ПрименятьТарифРЭК
	|				ИЛИ энргИспользованиеТарифовРЭКСрезПоследних.ПрименятьТарифРЭК ЕСТЬ NULL
	|			ТОГДА ЗначенияТекущихТарифов.Значение
	|		ИНАЧЕ ЗначенияТекущихТарифов.ЗначениеТарифаРЭК
	|	КОНЕЦ КАК Значение,
	|	ЗначенияТекущихТарифов.ЗначениеТарифаРЭК КАК ЗначениеТарифаРЭК,
	|	ВЫБОР
	|		КОГДА НЕ энргИспользованиеТарифовРЭКСрезПоследних.ПрименятьТарифРЭК
	|				ИЛИ энргИспользованиеТарифовРЭКСрезПоследних.ПрименятьТарифРЭК ЕСТЬ NULL
	|			ТОГДА ЗначенияТекущихТарифов.ЗначениеСверхНорматива
	|		ИНАЧЕ ЗначенияТекущихТарифов.ЗначениеТарифаРЭК
	|	КОНЕЦ КАК ЗначениеСверхНорматива,
	|	ЗначенияТекущихТарифов.СтавкаНДС КАК СтавкаНДС,
	|	ЗначенияТекущихТарифов.НДСВнутри КАК НДСВнутри
	|ИЗ
	|	ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргИспользованиеТарифовРЭК.СрезПоследних(
	|				,
	|				(Контрагенты, Район, Услуга) В
	|					(ВЫБРАТЬ
	|						ЗначенияТекущихТарифов.Поставщик,
	|						ЗначенияТекущихТарифов.Район,
	|						ЗначенияТекущихТарифов.Услуга
	|					ИЗ
	|						ЗначенияТекущихТарифов)) КАК энргИспользованиеТарифовРЭКСрезПоследних
	|		ПО ЗначенияТекущихТарифов.Поставщик = энргИспользованиеТарифовРЭКСрезПоследних.Контрагенты
	|			И ЗначенияТекущихТарифов.Район = энргИспользованиеТарифовРЭКСрезПоследних.Район
	|			И ЗначенияТекущихТарифов.Услуга = энргИспользованиеТарифовРЭКСрезПоследних.Услуга
	|ГДЕ
	|	(ЗначенияТекущихТарифов.ГруппаПотребителей, ЗначенияТекущихТарифов.Услуга, ЗначенияТекущихТарифов.Поставщик) В
	|			(ВЫБРАТЬ
	|				АбонентыДляРаспределения.ТарифнаяГруппа,
	|				АбонентыДляРаспределения.Услуга,
	|				АбонентыДляРаспределения.Поставщик
	|			ИЗ
	|				АбонентыДляРаспределения КАК АбонентыДляРаспределения)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗначенияТекущихТарифов.ПериодНачисления,
	|	ЗначенияТекущихТарифов.ГруппаПотребителей,
	|	ЗначенияТекущихТарифов.Услуга,
	|	ЗначенияТекущихТарифов.Поставщик,
	|	ЗначенияТекущихТарифов.ТарифнаяЗона,
	|	ЗначенияТекущихТарифов.Значение,
	|	ЗначенияТекущихТарифов.ЗначениеТарифаРЭК,
	|	ЗначенияТекущихТарифов.ЗначениеСверхНорматива,
	|	ЗначенияТекущихТарифов.СтавкаНДС,
	|	ЗначенияТекущихТарифов.НДСВнутри
	|ИЗ
	|	ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
	|ГДЕ
	|	(ЗначенияТекущихТарифов.ГруппаПотребителей, ЗначенияТекущихТарифов.Услуга, ЗначенияТекущихТарифов.Поставщик) В
	|			(ВЫБРАТЬ
	|				АбонентыРазделенныеЛицевыеСчета.ТарифнаяГруппа,
	|				АбонентыРазделенныеЛицевыеСчета.Услуга,
	|				АбонентыРазделенныеЛицевыеСчета.Поставщик
	|			ИЗ
	|				АбонентыРазделенныеЛицевыеСчета КАК АбонентыРазделенныеЛицевыеСчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяВыборка.Организация КАК Организация,
	|	ОсновнаяВыборка.Район КАК Район,
	|	ОсновнаяВыборка.ПериодНачисления КАК ПериодНачисления,
	|	ОсновнаяВыборка.Строение КАК Строение,
	|	ОсновнаяВыборка.Услуга КАК Услуга,
	|	ОсновнаяВыборка.ВсегоАбонентов КАК ВсегоАбонентов,
	|	ОсновнаяВыборка.ПлощадьМОП КАК ПлощадьМОП,
	|	ОсновнаяВыборка.ВсегоСУстановелннымПриборомУчета КАК ВсегоСУстановелннымПриборомУчета,
	|	ОсновнаяВыборка.ВсегоПлощадьАбонентов КАК ВсегоПлощадьАбонентов,
	|	ОсновнаяВыборка.ВсегоПлощадьАбонентовСобственнаяПоставка КАК ВсегоПлощадьАбонентовСобственнаяПоставка,
	|	ОсновнаяВыборка.КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК КорректироватьИндивидуальныйОбъемСУчетомОДПУ,
	|	ОсновнаяВыборка.ОбъемУслуги КАК ОбъемУслуги,
	|	ОсновнаяВыборка.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ОсновнаяВыборка.ОбъемУслугиНорматив КАК ОбъемУслугиНорматив,
	|	ОсновнаяВыборка.РаспределятьПолностью КАК РаспределятьПолностью,
	|	ОсновнаяВыборка.НачисленаТолькоНорма КАК НачисленаТолькоНорма,
	|	ОсновнаяВыборка.ДокументРаспределения КАК ДокументРаспределения,
	|	ОсновнаяВыборка.ЕстьНачислениеПоПриборам КАК ЕстьНачислениеПоПриборам,
	|	ОсновнаяВыборка.СпособНачисления КАК СпособНачисления,
	|	ОсновнаяВыборка.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОсновнаяВыборка.ПлощадьМОПУказана КАК ПлощадьМОПУказана,
	|	ОсновнаяВыборка.ВидПлощади КАК ВидПлощади,
	|	ОсновнаяВыборка.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ОсновнаяВыборка.ЗначениеНорматива КАК ЗначениеНорматива,
	|	ОсновнаяВыборка.ФормулаРасчетаНорматива КАК ФормулаРасчетаНорматива,
	|	ОсновнаяВыборка.НеРаспределятьСверхнорматив КАК НеРаспределятьСверхнорматив,
	|	ОсновнаяВыборка.НеНачислятьУслугуАбонентам КАК НеНачислятьУслугуАбонентам,
	|	ОсновнаяВыборка.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	|	ОсновнаяВыборка.ПоказанияПредоставленыПотребленный КАК ПоказанияПредоставленыПотребленный,
	|	ОсновнаяВыборка.ЗавершениеОП КАК ЗавершениеОП,
	|	ОсновнаяВыборка.НазначениеПрибораУчета КАК НазначениеПрибораУчета,
	|	ОсновнаяВыборка.ПроцентРаспределенияОтрицательногоОбъема КАК ПроцентРаспределенияОтрицательногоОбъема
	|ИЗ
	|	ОсновнаяВыборка КАК ОсновнаяВыборка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновнаяВыборка.Организация,
	|	ОсновнаяВыборка.Район,
	|	ОсновнаяВыборка.ПериодНачисления,
	|	ОсновнаяВыборка.Строение,
	|	ОсновнаяВыборка.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АбонентыДляРаспределения.Организация КАК Организация,
	|	АбонентыДляРаспределения.Район КАК Район,
	|	АбонентыДляРаспределения.Строение КАК Строение,
	|	АбонентыДляРаспределения.Помещение КАК Помещение,
	|	АбонентыДляРаспределения.КлючПомещения КАК КлючПомещения,
	|	АбонентыДляРаспределения.Абонент КАК Абонент,
	|	АбонентыДляРаспределения.Услуга КАК Услуга,
	|	АбонентыДляРаспределения.ЗначениеПлощади КАК ЗначениеПлощадиДляРаспределения,
	|	АбонентыДляРаспределения.ТарифнаяГруппа КАК ТарифнаяГруппаДляРаспределения,
	|	АбонентыДляРаспределения.Поставщик КАК ПоставщикДляРаспределения,
	|	АбонентыДляРаспределения.КоличествоЖильцов КАК КоличествоЖильцов,
	|	АбонентыДляРаспределения.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	ОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	ОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ОбъемНачислений.Измеритель КАК Измеритель,
	|	ОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемНачислений.Шкала КАК Шкала,
	|	ОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ОбъемНачислений.ЗначениеТарифа, 0) КАК ЗначениеТарифа,
	|	ОбъемНачислений.Поставщик КАК Поставщик,
	|	ЕСТЬNULL(ОбъемНачислений.ПериодРасчета, АбонентыДляРаспределения.ПериодНачисления) КАК ПериодРасчета,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	ОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	ОбъемНачислений.Сумма КАК Сумма,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслуги, 0) КАК ОбъемУслуги,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслугиПотребленный, 0) КАК ОбъемУслугиПотребленный,
	|	ОбъемНачислений.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслугиСоцНорма, 0) КАК ОбъемУслугиСоцНорма,
	|	ОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	ОбъемНачислений.КонецПериода КАК КонецПериода,
	|	ОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	ОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	ОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	ЕСТЬNULL(ОбъемНачислений.КоличествоПрописанных, 0) КАК КоличествоПрописанных,
	|	АбонентыДляРаспределения.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	ОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	ОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	ОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	ОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	ОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	ОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	ОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	ОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	ОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	ЕСТЬNULL(ОбъемНачислений.КоличествоСобственников, 0) КАК КоличествоСобственников,
	|	ЕСТЬNULL(ОбъемНачислений.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
	|	ОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	ОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ЕСТЬNULL(ОбъемНачислений.ЗначениеСоциальнойНормы, 0) КАК ЗначениеСоциальнойНормы,
	|	ОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ВЫБОР
	|		КОГДА ОбъемНачислений.Абонент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИндивидуальныеНачисления,
	|	ЛОЖЬ КАК НП,
	|	ЛОЖЬ КАК ПомещениеСРазделенными,
	|	АбонентыДляРаспределения.Помещение КАК ПомещениеРодитель,
	|	NULL КАК Договор,
	|	ЕСТЬNULL(ОбъемНачислений.СоциальнаяНормаПотребления, 0) КАК СоциальнаяНормаПотребления,
	|	ЕСТЬNULL(ОбъемНачислений.ДопСоциальнаяНормаПотребления, 0) КАК ДопСоциальнаяНормаПотребления,
	|	ОбъемНачислений.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	ЛОЖЬ КАК РасчетПоФактическомуОбъему,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива, ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)) КАК СпособРасчетаСоциальногоНорматива,
	|	ЛОЖЬ КАК ЭЭ,
	|	0 КАК ТарифНаИныеУслуги,
	|	0 КАК ТарифЗаСбытовуюНадбавку,
	|	0 КАК ТарифЗаСбытовуюНадбавкуПокупатель,
	|	0 КАК ТарифЗаУслугиПоПередачи,
	|	ЛОЖЬ КАК НДСВнутриИныеУслуги,
	|	ЛОЖЬ КАК НДСВнутриСбытоваяНадбавка,
	|	ЛОЖЬ КАК НДСВнутриУслугиПоПередачи,
	|	0 КАК СтавкаНДС,
	|	0 КАК ТарифНаСредневзвешанную,
	|	ЛОЖЬ КАК НДСВнутри,
	|	ЛОЖЬ КАК ПодключениеНеОтОбщейСборки
	|ИЗ
	|	АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачислений КАК ОбъемНачислений
	|		ПО АбонентыДляРаспределения.Район = ОбъемНачислений.Район
	|			И АбонентыДляРаспределения.Строение = ОбъемНачислений.Строение
	|			И АбонентыДляРаспределения.Услуга = ОбъемНачислений.Услуга
	|			И АбонентыДляРаспределения.Помещение = ОбъемНачислений.Помещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО АбонентыДляРаспределения.Организация = СпособыРасчетаПоНаправлениям.Организация
	|			И АбонентыДляРаспределения.Район = СпособыРасчетаПоНаправлениям.Район
	|			И АбонентыДляРаспределения.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И АбонентыДляРаспределения.НаправлениеИспользованияТУ = СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ
	|ГДЕ
	|	АбонентыДляРаспределения.Помещение ССЫЛКА Справочник.энргПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АбонентыДляРаспределения.Организация,
	|	АбонентыДляРаспределения.Район,
	|	АбонентыДляРаспределения.Строение,
	|	АбонентыДляРаспределения.Помещение,
	|	АбонентыДляРаспределения.КлючПомещения,
	|	АбонентыДляРаспределения.Абонент,
	|	АбонентыДляРаспределения.Услуга,
	|	АбонентыДляРаспределения.ЗначениеПлощади,
	|	АбонентыДляРаспределения.ТарифнаяГруппа,
	|	АбонентыДляРаспределения.Поставщик,
	|	0,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ОбъемНачислений.ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления,
	|	ОбъемНачислений.СпособНачисления,
	|	ОбъемНачислений.НаправлениеИспользованияТУ,
	|	ОбъемНачислений.Измеритель,
	|	ОбъемНачислений.ПриборУчета,
	|	ОбъемНачислений.Шкала,
	|	ОбъемНачислений.ТарифнаяЗона,
	|	ЕСТЬNULL(ОбъемНачислений.ЗначениеТарифа, 0),
	|	ОбъемНачислений.Поставщик,
	|	ЕСТЬNULL(ОбъемНачислений.ПериодРасчета, АбонентыДляРаспределения.ПериодНачисления),
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.ЧастныйСектор,
	|	ОбъемНачислений.СверхНорматива,
	|	ОбъемНачислений.Сумма,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслуги, 0),
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслугиПотребленный, 0),
	|	ОбъемНачислений.СуммаПоПовышенномуКоэффициенту,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслугиСоцНорма, 0),
	|	ОбъемНачислений.НачалоПериода,
	|	ОбъемНачислений.КонецПериода,
	|	ОбъемНачислений.НачальныеПоказания,
	|	ОбъемНачислений.КонечныеПоказания,
	|	ОбъемНачислений.КоличествоКомнат,
	|	ЕСТЬNULL(ОбъемНачислений.КоличествоПрописанных, 0),
	|	ОбъемНачислений.ЗначениеПлощади,
	|	ОбъемНачислений.НормаПотребления,
	|	ОбъемНачислений.КоэффициентПУ,
	|	ОбъемНачислений.РасчетПоФормуле,
	|	ОбъемНачислений.ВидБлагоустройства,
	|	ОбъемНачислений.ТарифнаяГруппа,
	|	ОбъемНачислений.ДатаПоверки,
	|	ОбъемНачислений.ОтключатьВНеполивнойСезон,
	|	ОбъемНачислений.ЗависимаяТочкаУчета,
	|	ОбъемНачислений.КоэффициентФормула,
	|	ОбъемНачислений.ВидДифференцированности,
	|	ОбъемНачислений.ОснованиеПерерасчета,
	|	ОбъемНачислений.ОснованиеПерерасчетаДата,
	|	ОбъемНачислений.ПриборЗависимой,
	|	ОбъемНачислений.СписатьИзНормы,
	|	ОбъемНачислений.ПовыщающийКоэффициент,
	|	ЕСТЬNULL(ОбъемНачислений.КоличествоСобственников, 0),
	|	ЕСТЬNULL(ОбъемНачислений.КоличествоПроживающих, 0),
	|	ОбъемНачислений.СниматьНачисленныйСредний,
	|	ОбъемНачислений.ПлощадьМОП,
	|	ОбъемНачислений.ПлощадьАбонентов,
	|	ОбъемНачислений.ПлощадьСобственнаяПоставка,
	|	ОбъемНачислений.КоэффициентРаспределенияОстатка,
	|	0,
	|	ОбъемНачислений.СоставнаяУслуга,
	|	ОбъемНачислений.НеПрименятьСезонность,
	|	ВЫБОР
	|		КОГДА ОбъемНачислений.Абонент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	АбонентыДляРаспределения.Помещение,
	|	ОбъемНачислений.Договор,
	|	0,
	|	0,
	|	ЕСТЬNULL(ОбъемНачислений.ЗначениеТарифа, 0),
	|	ЕСТЬNULL(ОбъемНачислений.РасчетПоФактическомуОбъему, ЛОЖЬ),
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.ПустаяСсылка),
	|	АбонентыДляРаспределения.ЭЭ,
	|	ЕСТЬNULL(ОбъемНачислений.ТарифНаИныеУслуги, 0),
	|	ЕСТЬNULL(ОбъемНачислений.ТарифЗаСбытовуюНадбавку, 0), 
	|	ЕСТЬNULL(ОбъемНачислений.ТарифЗаСбытовуюНадбавкуПокупатель, 0),
	|	ЕСТЬNULL(ОбъемНачислений.ТарифЗаУслугиПоПередачи, 0),
	|	ЕСТЬNULL(ОбъемНачислений.НДСВнутриИныеУслуги, ЛОЖЬ),
	|	ЕСТЬNULL(ОбъемНачислений.НДСВнутриСбытоваяНадбавка, ЛОЖЬ),
	|	ЕСТЬNULL(ОбъемНачислений.НДСВнутриУслугиПоПередачи, ЛОЖЬ),
	|	ЕСТЬNULL(ОбъемНачислений.СтавкаНДС, 0),
	|	ЕСТЬNULL(ОбъемНачислений.ТарифНаСредневзвешанную, 0),
	|	ЕСТЬNULL(ОбъемНачислений.НДСВнутри, ЛОЖЬ),
	|	ЕСТЬNULL(АбонентыДляРаспределения.ПодключениеНеОтОбщейСборки, ЛОЖЬ)
	|ИЗ
	|	АбонентыДляРаспределения КАК АбонентыДляРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийНП КАК ОбъемНачислений
	|		ПО АбонентыДляРаспределения.Район = ОбъемНачислений.Район
	|			И АбонентыДляРаспределения.Строение = ОбъемНачислений.Строение
	|			И АбонентыДляРаспределения.Услуга = ОбъемНачислений.Услуга
	|			И АбонентыДляРаспределения.Абонент = ОбъемНачислений.Абонент
	|			И АбонентыДляРаспределения.Договор = ОбъемНачислений.Договор
	|ГДЕ
	|	АбонентыДляРаспределения.Абонент ССЫЛКА Справочник.бестОбъектыРасчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АбонентыРазделенныеЛицевыеСчета.Организация,
	|	АбонентыРазделенныеЛицевыеСчета.Район,
	|	АбонентыРазделенныеЛицевыеСчета.Строение,
	|	АбонентыРазделенныеЛицевыеСчета.Помещение,
	|	АбонентыРазделенныеЛицевыеСчета.КлючПомещения,
	|	АбонентыРазделенныеЛицевыеСчета.Абонент,
	|	АбонентыРазделенныеЛицевыеСчета.Услуга,
	|	АбонентыРазделенныеЛицевыеСчета.ЗначениеПлощади,
	|	АбонентыРазделенныеЛицевыеСчета.ТарифнаяГруппа,
	|	АбонентыРазделенныеЛицевыеСчета.Поставщик,
	|	0,
	|	АбонентыРазделенныеЛицевыеСчета.ДатаСостоянияЛицевогоСчета,
	|	ОбъемНачислений.ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления,
	|	ОбъемНачислений.СпособНачисления,
	|	ОбъемНачислений.НаправлениеИспользованияТУ,
	|	ОбъемНачислений.Измеритель,
	|	ОбъемНачислений.ПриборУчета,
	|	ОбъемНачислений.Шкала,
	|	ОбъемНачислений.ТарифнаяЗона,
	|	ЕСТЬNULL(ОбъемНачислений.ЗначениеТарифа, 0),
	|	ОбъемНачислений.Поставщик,
	|	ОбъемНачислений.ПериодРасчета,
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.ЧастныйСектор,
	|	ОбъемНачислений.СверхНорматива,
	|	ОбъемНачислений.Сумма,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслуги, 0),
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслугиПотребленный, 0),
	|	ОбъемНачислений.СуммаПоПовышенномуКоэффициенту,
	|	ЕСТЬNULL(ОбъемНачислений.ОбъемУслугиСоцНорма, 0),
	|	ОбъемНачислений.НачалоПериода,
	|	ОбъемНачислений.КонецПериода,
	|	ОбъемНачислений.НачальныеПоказания,
	|	ОбъемНачислений.КонечныеПоказания,
	|	ОбъемНачислений.КоличествоКомнат,
	|	ОбъемНачислений.КоличествоПрописанных,
	|	ОбъемНачислений.ЗначениеПлощади,
	|	ОбъемНачислений.НормаПотребления,
	|	ОбъемНачислений.КоэффициентПУ,
	|	ОбъемНачислений.РасчетПоФормуле,
	|	ОбъемНачислений.ВидБлагоустройства,
	|	ОбъемНачислений.ТарифнаяГруппа,
	|	ОбъемНачислений.ДатаПоверки,
	|	ОбъемНачислений.ОтключатьВНеполивнойСезон,
	|	ОбъемНачислений.ЗависимаяТочкаУчета,
	|	ОбъемНачислений.КоэффициентФормула,
	|	ОбъемНачислений.ВидДифференцированности,
	|	ОбъемНачислений.ОснованиеПерерасчета,
	|	ОбъемНачислений.ОснованиеПерерасчетаДата,
	|	ОбъемНачислений.ПриборЗависимой,
	|	ОбъемНачислений.СписатьИзНормы,
	|	ОбъемНачислений.ПовыщающийКоэффициент,
	|	ОбъемНачислений.КоличествоСобственников,
	|	ОбъемНачислений.КоличествоПроживающих,
	|	ОбъемНачислений.СниматьНачисленныйСредний,
	|	ОбъемНачислений.ПлощадьМОП,
	|	ОбъемНачислений.ПлощадьАбонентов,
	|	ОбъемНачислений.ПлощадьСобственнаяПоставка,
	|	ОбъемНачислений.КоэффициентРаспределенияОстатка,
	|	ОбъемНачислений.ЗначениеСоциальнойНормы,
	|	ОбъемНачислений.СоставнаяУслуга,
	|	ОбъемНачислений.НеПрименятьСезонность,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	АбонентыРазделенныеЛицевыеСчета.ПомещениеРодитель,
	|	NULL,
	|	ЕСТЬNULL(ОбъемНачислений.СоциальнаяНормаПотребления, 0),
	|	ЕСТЬNULL(ОбъемНачислений.ДопСоциальнаяНормаПотребления, 0),
	|	ОбъемНачислений.ЗначениеТарифаСверхНорматива,
	|	ЛОЖЬ,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива, ЗНАЧЕНИЕ(Перечисление.энргСпособРасчетаНорматива.КоличествоЧеловек)),
	|	ЛОЖЬ,
	|	0,
	|	0,
	|	0, 
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	АбонентыРазделенныеЛицевыеСчета КАК АбонентыРазделенныеЛицевыеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемНачислений КАК ОбъемНачислений
	|		ПО АбонентыРазделенныеЛицевыеСчета.Район = ОбъемНачислений.Район
	|			И АбонентыРазделенныеЛицевыеСчета.Строение = ОбъемНачислений.Строение
	|			И АбонентыРазделенныеЛицевыеСчета.Услуга = ОбъемНачислений.Услуга
	|			И АбонентыРазделенныеЛицевыеСчета.Помещение = ОбъемНачислений.Помещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО АбонентыРазделенныеЛицевыеСчета.Организация = СпособыРасчетаПоНаправлениям.Организация
	|			И АбонентыРазделенныеЛицевыеСчета.Район = СпособыРасчетаПоНаправлениям.Район
	|			И АбонентыРазделенныеЛицевыеСчета.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И АбонентыРазделенныеЛицевыеСчета.НаправлениеИспользованияТУ = СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодРасчета,
	|	Район,
	|	Строение,
	|	Услуга,
	|	Помещение,
	|	СверхНорматива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеМКДПоУслугам.Организация КАК Организация,
	|	ДанныеМКДПоУслугам.Район КАК Район,
	|	ДанныеМКДПоУслугам.Строение КАК Строение,
	|	ДанныеМКДПоУслугам.Услуга КАК Услуга,
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачислений.Активность КАК Активность,
	|	энргОбъемНачислений.Распределение КАК Распределение,
	|	энргОбъемНачислений.Помещение КАК Помещение,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачислений.Измеритель КАК Измеритель,
	|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачислений.Шкала КАК Шкала,
	|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачислений.Сумма КАК Сумма,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
	|	энргОбъемНачислений.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления
	|ИЗ
	|	ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийПоПриборуУчетаКорректироватьИндивидуальныйОбъем КАК энргОбъемНачислений
	|		ПО ДанныеМКДПоУслугам.Организация = энргОбъемНачислений.Организация
	|			И ДанныеМКДПоУслугам.ПериодНачисления = энргОбъемНачислений.ПериодНачисления
	|			И ДанныеМКДПоУслугам.Район = энргОбъемНачислений.Район
	|			И ДанныеМКДПоУслугам.Строение = энргОбъемНачислений.Строение
	|			И ДанныеМКДПоУслугам.Услуга = энргОбъемНачислений.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Строение,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазличныеМКД.Организация КАК Организация,
	|	РазличныеМКД.ПериодНачисления КАК ПериодНачисления,
	|	РазличныеМКД.Район КАК Район,
	|	РазличныеМКД.Строение КАК Строение,
	|	АбонентыРазделенныеЛицевыеСчета.ПомещениеРодитель КАК ПомещениеРодитель,
	|	АбонентыРазделенныеЛицевыеСчета.Помещение КАК Помещение,
	|	АбонентыРазделенныеЛицевыеСчета.КлючПомещения КАК КлючПомещения,
	|	АбонентыРазделенныеЛицевыеСчета.Абонент КАК Абонент,
	|	АбонентыРазделенныеЛицевыеСчета.Услуга КАК Услуга,
	|	АбонентыРазделенныеЛицевыеСчета.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.ФиксированныйОбъемПотребления, 0) КАК ФиксированныйОбъемПотребления,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.ДоляПотребленияЧислитель, 0) КАК ДоляПотребленияЧислитель,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.ДоляПотребленияЗнаменатель, 0) КАК ДоляПотребленияЗнаменатель,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.ЗначениеПлощади, 0) КАК ЗначениеПлощади,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.КоличествоПроживающих, 0) КАК КоличествоПроживающих,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.КоличествоПрописанных, 0) КАК КоличествоПрописанных,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.КоличествоСобственников, 0) КАК КоличествоСобственников,
	|	АбонентыРазделенныеЛицевыеСчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	АбонентыРазделенныеЛицевыеСчета.Поставщик КАК Поставщик,
	|	АбонентыРазделенныеЛицевыеСчета.КлючСоцНорматива КАК КлючСоцНорматива,
	|	АбонентыРазделенныеЛицевыеСчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЕСТЬNULL(АбонентыРазделенныеЛицевыеСчета.ДопСоциальнаяНормаПотребления, 0) КАК ДопСоциальнаяНормаПотребления
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОсновнаяВыборка.Организация КАК Организация,
	|		ОсновнаяВыборка.ПериодНачисления КАК ПериодНачисления,
	|		ОсновнаяВыборка.Район КАК Район,
	|		ОсновнаяВыборка.Строение КАК Строение
	|	ИЗ
	|		ОсновнаяВыборка КАК ОсновнаяВыборка) КАК РазличныеМКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ АбонентыРазделенныеЛицевыеСчета КАК АбонентыРазделенныеЛицевыеСчета
	|		ПО РазличныеМКД.Организация = АбонентыРазделенныеЛицевыеСчета.Организация
	|			И РазличныеМКД.ПериодНачисления = АбонентыРазделенныеЛицевыеСчета.ПериодНачисления
	|			И РазличныеМКД.Район = АбонентыРазделенныеЛицевыеСчета.Район
	|			И РазличныеМКД.Строение = АбонентыРазделенныеЛицевыеСчета.Строение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Строение,
	|	ПомещениеРодитель,
	|	Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеМКДПоУслугам.Организация КАК Организация,
	|	ДанныеМКДПоУслугам.Район КАК Район,
	|	ДанныеМКДПоУслугам.Строение КАК Строение,
	|	ДанныеМКДПоУслугам.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.Период КАК Период,
	|	бестОбъемНачисленийНП.Регистратор КАК Регистратор,
	|	бестОбъемНачисленийНП.НомерСтроки КАК НомерСтроки,
	|	бестОбъемНачисленийНП.Активность КАК Активность,
	|	бестОбъемНачисленийНП.Распределение КАК Распределение,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	|	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	|	бестОбъемНачисленийНП.ОбъемУслуги КАК ОбъемУслуги,
	|	бестОбъемНачисленийНП.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	бестОбъемНачисленийНП.НачалоПериода КАК НачалоПериода,
	|	бестОбъемНачисленийНП.КонецПериода КАК КонецПериода,
	|	бестОбъемНачисленийНП.НачальныеПоказания КАК НачальныеПоказания,
	|	бестОбъемНачисленийНП.КонечныеПоказания КАК КонечныеПоказания,
	|	бестОбъемНачисленийНП.ЗначениеПлощади КАК ЗначениеПлощади,
	|	бестОбъемНачисленийНП.НормаПотребления КАК НормаПотребления,
	|	бестОбъемНачисленийНП.РасчетПоФормуле КАК РасчетПоФормуле,
	|	бестОбъемНачисленийНП.ДатаПоверки КАК ДатаПоверки,
	|	бестОбъемНачисленийНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	бестОбъемНачисленийНП.КоэффициентФормула КАК КоэффициентФормула,
	|	бестОбъемНачисленийНП.ВидДифференцированности КАК ВидДифференцированности,
	|	бестОбъемНачисленийНП.СписатьИзНормы КАК СписатьИзНормы,
	|	бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	бестОбъемНачисленийНП.СоставнаяУслуга КАК СоставнаяУслуга,
	|	бестОбъемНачисленийНП.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.ПлощадьМОП КАК ПлощадьМОП,
	|	бестОбъемНачисленийНП.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	бестОбъемНачисленийНП.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	бестОбъемНачисленийНП.ДолевоеРаспределение КАК ДолевоеРаспределение,
	|	бестОбъемНачисленийНП.ОбъемПоПрибору КАК ОбъемПоПрибору,
	|	бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестОбъемНачисленийНП.ОбъемДосчитанный КАК ОбъемДосчитанный,
	|	бестОбъемНачисленийНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	бестОбъемНачисленийНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	бестОбъемНачисленийНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	бестОбъемНачисленийНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	бестОбъемНачисленийНП.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения
	|ИЗ
	|	ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемНачисленийНППоПриборуУчетаКорректироватьИндивидуальныйОбъем КАК бестОбъемНачисленийНП
	|		ПО ДанныеМКДПоУслугам.Организация = бестОбъемНачисленийНП.Организация
	|			И ДанныеМКДПоУслугам.ПериодНачисления = бестОбъемНачисленийНП.ПериодНачисления
	|			И ДанныеМКДПоУслугам.Район = бестОбъемНачисленийНП.Район
	|			И ДанныеМКДПоУслугам.Услуга = бестОбъемНачисленийНП.Услуга
	|			И ДанныеМКДПоУслугам.Строение = бестОбъемНачисленийНП.МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Строение,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ЕСТЬNULL(ОтрицательныйОбъемРаспределения.ПериодНачисленияОбъема, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодНачисленияОбъема,
	|	ЕСТЬNULL(ОтрицательныйОбъемРаспределения.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ОтрицательныйОбъемРаспределения.ОбъемУслуги, 0) КАК ОбъемУслуги,
	|	ЕСТЬNULL(ОтрицательныйОбъемРаспределения.ОбъемУслугиПотребленный, 0) КАК ОбъемУслугиПотребленный
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеМКДПоУслугам.Организация КАК Организация,
	|		ДанныеМКДПоУслугам.ПериодНачисления КАК ПериодНачисления,
	|		ДанныеМКДПоУслугам.Район КАК Район,
	|		ДанныеМКДПоУслугам.Строение КАК Строение,
	|		ДанныеМКДПоУслугам.Услуга КАК Услуга
	|	ИЗ
	|		ДанныеМКДПоУслугам КАК ДанныеМКДПоУслугам) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтрицательныйОбъемРаспределения КАК ОтрицательныйОбъемРаспределения
	|		ПО ВложенныйЗапрос.Организация = ОтрицательныйОбъемРаспределения.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = ОтрицательныйОбъемРаспределения.ПериодНачисления
	|			И ВложенныйЗапрос.Район = ОтрицательныйОбъемРаспределения.Район
	|			И ВложенныйЗапрос.Строение = ОтрицательныйОбъемРаспределения.МКД
	|			И ВложенныйЗапрос.Услуга = ОтрицательныйОбъемРаспределения.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Строение,
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияТекущихСоциальныхНормативов.Организация КАК Организация,
	|	ЗначенияТекущихСоциальныхНормативов.ПериодНачисления КАК ПериодНачисления,
	|	ЗначенияТекущихСоциальныхНормативов.Район КАК Район,
	|	ЗначенияТекущихСоциальныхНормативов.КлючНорматива КАК КлючСоцНорматива,
	|	ЗначенияТекущихСоциальныхНормативов.Услуга КАК Услуга,
	|	ЗначенияТекущихСоциальныхНормативов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЗначенияТекущихСоциальныхНормативов.ЗначениеНорматива КАК ЗначениеНорматива
	|ИЗ
	|	ЗначенияТекущихСоциальныхНормативов КАК ЗначенияТекущихСоциальныхНормативов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыРаспределенияМКД.Организация КАК Организация,
	|	ДокументыРаспределенияМКД.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыРаспределенияМКД.Район КАК Район,
	|	ДокументыРаспределенияМКД.МКД КАК МКД,
	|	ДокументыРаспределенияМКД.ДокументНачисления КАК ДокументНачисления,
	|	ДокументыРаспределенияМКД.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	ДокументыРаспределенияМКД КАК ДокументыРаспределенияМКД";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНормативныеДанныеРаспределения()
	Текст  = 
	"ВЫБРАТЬ
	|	СпособыРасчетаПоНаправлениям.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	СпособыРасчетаПоНаправлениям.Район КАК Район,
	|	СпособыРасчетаПоНаправлениям.Услуга КАК Услуга,
	|	СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	СпособыРасчетаПоНаправлениям.ВидПлощади КАК ВидПлощади,
	|	СпособыРасчетаПоНаправлениям.Сезонность КАК Сезонность,
	|	СпособыРасчетаПоНаправлениям.НормативПоДням КАК НормативПоДням,
	|	СпособыРасчетаПоНаправлениям.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СпособыРасчетаПоНаправлениям.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,
	|	СпособыРасчетаПоНаправлениям.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива
	|ПОМЕСТИТЬ СпособыРасчетаПоНаправлениям
	|ИЗ
	|	РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК СпособыРасчетаПоНаправлениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗначенияНормативовПотребленияСрезПоследних.Организация,
	|	&ПериодНачисления,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Район,
	|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива,
	|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга,
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива
	|ИЗ
	|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)
	|				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО энргЗначенияНормативовПотребленияСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|			И (энргВидыУслуг.НормативДляИндивидуальных)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияТарифовСрезПоследних.Район КАК Район,
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеРЭК КАК ЗначениеТарифаРЭК,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияСоциальныхНормативовСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргЗначенияСоциальныхНормативовСрезПоследних.Район КАК Район,
	|	энргЗначенияСоциальныхНормативовСрезПоследних.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияСоциальныхНормативовСрезПоследних.Услуга КАК Услуга,
	|	энргЗначенияСоциальныхНормативовСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргЗначенияСоциальныхНормативовСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихСоциальныхНормативов
	|ИЗ
	|	РегистрСведений.энргЗначенияСоциальныхНормативов.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)) КАК энргЗначенияСоциальныхНормативовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Район КАК Район,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.МКД КАК МКД,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКДСрезПоследних.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	РегистрСведений.энргНастройкаНачисленияГВСМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкаНачисленияГВСМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПодключениеНеОтОбщейСборкиСрезПоследних.Организация КАК Организация,
	|	бестПодключениеНеОтОбщейСборкиСрезПоследних.Район КАК Район,
	|	бестПодключениеНеОтОбщейСборкиСрезПоследних.МКД КАК МКД,
	|	бестПодключениеНеОтОбщейСборкиСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПодключениеНеОтОбщейСборкиСрезПоследних.ПодключениеНеОтОбщейСборки КАК ПодключениеНеОтОбщейСборки
	|ПОМЕСТИТЬ ТУПодключенныеНеОтОбщейСборки
	|ИЗ
	|	РегистрСведений.бестПодключениеНеОтОбщейСборки.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестПодключениеНеОтОбщейСборкиСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДокументыДляРаспределенияМКД() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	энргФормыУправленияМКДСрезПоследних.Организация КАК Организация,
	|	энргФормыУправленияМКДСрезПоследних.Район КАК Район,
	|	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ МКДвУК
	|ИЗ
	|	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &Строение) КАК энргФормыУправленияМКДСрезПоследних
	|ГДЕ
	|	энргФормыУправленияМКДСрезПоследних.ФормаУправления В (ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.УК), ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.ТСЖ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОтложенныеДвиженияДокументов.Организация КАК Организация,
	|	энргОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	|	энргОтложенныеДвиженияДокументов.Район КАК Район,
	|	энргОтложенныеДвиженияДокументов.Строение КАК Строение,
	|	&ЗавершениеОП КАК ЗавершениеОП
	|ПОМЕСТИТЬ ДокументыДляРаспределения
	|ИЗ
	|	РегистрСведений.энргОтложенныеДвиженияДокументов КАК энргОтложенныеДвиженияДокументов
	|ГДЕ
	|	энргОтложенныеДвиженияДокументов.Организация = &Организация
	|	И энргОтложенныеДвиженияДокументов.ПериодНачисления = &ПериодНачисления
	|	И энргОтложенныеДвиженияДокументов.Район = &Район
	|	И энргОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.РаспределениеМКД)
	|	И НЕ энргОтложенныеДвиженияДокументов.ЧастныйСектор
	|	И энргОтложенныеДвиженияДокументов.Строение = &Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПризнакРаспределенияОДНПриЛюбойФормеУправленияСрезПоследних.Услуга КАК Услуга,
	|	энргПризнакРаспределенияОДНПриЛюбойФормеУправленияСрезПоследних.Распределять КАК Распределять
	|ПОМЕСТИТЬ ПризнакРаспределенияОДНПриЛюбойФормеУправления
	|ИЗ
	|	РегистрСведений.энргПризнакРаспределенияОДНПриЛюбойФормеУправления.СрезПоследних(&Период, ) КАК энргПризнакРаспределенияОДНПриЛюбойФормеУправленияСрезПоследних";
	
	Возврат Текст
	
КонецФункции

Функция ТекстЗапросаСозданныеДокументыРаспределения()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО энргДокументыНачислений.Организация = ДокументыДляРаспределения.Организация
	|			И энргДокументыНачислений.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И энргДокументыНачислений.Район = ДокументыДляРаспределения.Район
	|			И (энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.Индивидуальные))
	|			И энргДокументыНачислений.МКД = ДокументыДляРаспределения.Строение
	|			И (энргДокументыНачислений.Организация = &Организация)
	|			И (энргДокументыНачислений.ПериодНачисления = &ПериодНачисления)
	|			И (энргДокументыНачислений.МКД = &Строение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргДокументыНачислений.ПериодНачисления,
	|	энргДокументыНачислений.ДокументНачисления
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО энргДокументыНачислений.Организация = ДокументыДляРаспределения.Организация
	|			И энргДокументыНачислений.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И энргДокументыНачислений.Район = ДокументыДляРаспределения.Район
	|			И (энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.ПерерасчетСредних))
	|			И энргДокументыНачислений.МКД = ДокументыДляРаспределения.Строение
	|			И (энргДокументыНачислений.Организация = &Организация)
	|			И (энргДокументыНачислений.ПериодНачисления = &ПериодНачисления)
	|			И (энргДокументыНачислений.МКД = &Строение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.ПериодНачисления,
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО энргПерерасчет.КлючПомещения = энргКлючиПомещений.Ссылка
	|		И (энргКлючиПомещений.Строение = &Строение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО энргПерерасчет.Организация = ДокументыДляРаспределения.Организация
	|			И энргПерерасчет.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И энргПерерасчет.Район = ДокументыДляРаспределения.Район
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет))
	|			И (энргКлючиПомещений.Строение = ДокументыДляРаспределения.Строение)
	|			И (энргПерерасчет.Организация = &Организация)
	|			И (энргПерерасчет.ПериодНачисления = &ПериодНачисления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.ПериодНачисления,
	|	энргПерерасчет.Ссылка
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО энргПерерасчет.Организация = ДокументыДляРаспределения.Организация
	|			И энргПерерасчет.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И энргПерерасчет.Район = ДокументыДляРаспределения.Район
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета))
	|			И энргПерерасчет.Строение = ДокументыДляРаспределения.Строение
	|			И (энргПерерасчет.Организация = &Организация)
	|			И (энргПерерасчет.ПериодНачисления = &ПериодНачисления)
	|			И (энргПерерасчет.Строение = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргДокументыНачислений.Организация КАК Организация,
	|	энргДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргДокументыНачислений.Район КАК Район,
	|	энргДокументыНачислений.МКД КАК МКД,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	энргДокументыНачислений.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыРаспределенияМКД
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО энргДокументыНачислений.Организация = ДокументыДляРаспределения.Организация
	|			И энргДокументыНачислений.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И энргДокументыНачислений.Район = ДокументыДляРаспределения.Район
	|			И (энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.РаспределениеМКД))
	|			И энргДокументыНачислений.МКД = ДокументыДляРаспределения.Строение
	|			И (энргДокументыНачислений.Организация = &Организация)
	|			И (энргДокументыНачислений.ПериодНачисления = &ПериодНачисления)
	|			И (энргДокументыНачислений.МКД = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.Район КАК Район,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.МКД КАК МКД,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.Услуга КАК Услуга,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних.РаспределятьПолностью КАК РаспределятьПолностью
	|ПОМЕСТИТЬ ИсторияСоглашенийОРаспределенииСверхнормативногоОДН
	|ИЗ
	|	РегистрСведений.энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.СрезПоследних(
	|			&ЗавершениеОП,
	|			Организация = &Организация
	|				И МКД = &Строение
	|				И Район = &Район) КАК энргИсторияСоглашенийОРаспределенииСверхнормативногоОДНСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъемыНачисленийМКДДляРаспределения()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СУММА(ВложенныйЗапрос.ОбъемУслугиНормативОборот) КАК ОбъемУслугиНормативОборот,
	|	ВложенныйЗапрос.СпособНачисления КАК СпособНачисления,
	|	СУММА(ВложенныйЗапрос.ОбъемУслугиОборот) КАК ОбъемУслугиОборот,
	|	СУММА(ВложенныйЗапрос.ОбъемУслугиПотребленныйОборот) КАК ОбъемУслугиПотребленныйОборот,
	|	СУММА(ВложенныйЗапрос.ПоказанияПредоставленыОборот) КАК ПоказанияПредоставленыОборот,
	|	СУММА(ВложенныйЗапрос.ПоказанияПредоставленыПотребленныйОборот) КАК ПоказанияПредоставленыПотребленныйОборот,
	|	ВложенныйЗапрос.НазначениеПрибораУчета КАК НазначениеПрибораУчета
	|ПОМЕСТИТЬ НачисленныйОбъемМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргОбъемНачисленийМКД.Организация КАК Организация,
	|		энргОбъемНачисленийМКД.Район КАК Район,
	|		энргОбъемНачисленийМКД.МКД КАК МКД,
	|		энргОбъемНачисленийМКД.Услуга КАК Услуга,
	|		СУММА(энргОбъемНачисленийМКД.ОбъемУслугиНорматив) КАК ОбъемУслугиНормативОборот,
	|		энргОбъемНачисленийМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВЫБОР
	|			КОГДА энргОбъемНачисленийМКД.Регистратор ССЫЛКА Документ.энргПерерасчетМКД
	|					И ВЫРАЗИТЬ(энргОбъемНачисленийМКД.Регистратор КАК Документ.энргПерерасчетМКД).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			ИНАЧЕ энргОбъемНачисленийМКД.СпособНачисления
	|		КОНЕЦ КАК СпособНачисления,
	|		СУММА(энргОбъемНачисленийМКД.ОбъемУслуги) КАК ОбъемУслугиОборот,
	|		СУММА(энргОбъемНачисленийМКД.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленныйОборот,
	|		СУММА(энргОбъемНачисленийМКД.ПоказанияПредоставлены) КАК ПоказанияПредоставленыОборот,
	|		СУММА(энргОбъемНачисленийМКД.ПоказанияПредоставленыПотребленный) КАК ПоказанияПредоставленыПотребленныйОборот,
	|		МАКСИМУМ(энргОбъемНачисленийМКД.НазначениеПрибораУчета) КАК НазначениеПрибораУчета,
	|		энргОбъемНачисленийМКД.ПриборУчета КАК ПриборУчета
	|	ИЗ
	|		РегистрНакопления.энргОбъемНачисленийМКД КАК энргОбъемНачисленийМКД
	|	ГДЕ
	|		энргОбъемНачисленийМКД.Период >= &НачалоПериода
	|		И энргОбъемНачисленийМКД.Период <= &КонецПериода
	|		И энргОбъемНачисленийМКД.Организация = &Организация
	|		И энргОбъемНачисленийМКД.Район = &Район
	|		И энргОбъемНачисленийМКД.МКД = &Строение
	|		И НЕ энргОбъемНачисленийМКД.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргОбъемНачисленийМКД.Организация,
	|		энргОбъемНачисленийМКД.Район,
	|		энргОбъемНачисленийМКД.МКД,
	|		энргОбъемНачисленийМКД.Услуга,
	|		энргОбъемНачисленийМКД.ТарифнаяЗона,
	|		ВЫБОР
	|			КОГДА энргОбъемНачисленийМКД.Регистратор ССЫЛКА Документ.энргПерерасчетМКД
	|					И ВЫРАЗИТЬ(энргОбъемНачисленийМКД.Регистратор КАК Документ.энргПерерасчетМКД).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			ИНАЧЕ энргОбъемНачисленийМКД.СпособНачисления
	|		КОНЕЦ,
	|		энргОбъемНачисленийМКД.ПриборУчета) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НазначениеПрибораУчета,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.СпособНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргОбъемНачислений.Период, МЕСЯЦ) КАК ПериодНачисления,
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачислений.Активность КАК Активность,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Распределение КАК Распределение,
	|	энргОбъемНачислений.Строение КАК Строение,
	|	энргОбъемНачислений.Помещение КАК Помещение,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачислений.Измеритель КАК Измеритель,
	|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачислений.Шкала КАК Шкала,
	|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачислений.Сумма КАК Сумма,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачислений.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
	|	энргОбъемНачислений.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления
	|ПОМЕСТИТЬ ОбъемНачисленийПоПриборуУчетаКорректироватьИндивидуальныйОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Запись,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ Распределение
	|				И НЕ ЧастныйСектор
	|				И Строение = &Строение
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	|				И СпособНачисления В (ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам), ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему))
	|				И Услуга В
	|					(ВЫБРАТЬ
	|						энргВидыУслуг.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.энргВидыУслуг КАК энргВидыУслуг
	|					ГДЕ
	|						энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ)) КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		ПО энргОбъемНачисленийОбороты.Период = энргОбъемНачислений.Период
	|			И энргОбъемНачисленийОбороты.Регистратор = энргОбъемНачислений.Регистратор
	|			И энргОбъемНачисленийОбороты.НомерСтроки = энргОбъемНачислений.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бестОбъемНачисленийНП.Период, МЕСЯЦ) КАК ПериодНачисления,
	|	бестОбъемНачисленийНП.Период КАК Период,
	|	бестОбъемНачисленийНП.Регистратор КАК Регистратор,
	|	бестОбъемНачисленийНП.НомерСтроки КАК НомерСтроки,
	|	бестОбъемНачисленийНП.Активность КАК Активность,
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.Распределение КАК Распределение,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	|	бестОбъемНачисленийНП.ДолевоеРаспределение КАК ДолевоеРаспределение,
	|	бестОбъемНачисленийНП.ОбъемПоПрибору КАК ОбъемПоПрибору,
	|	ВЫБОР
	|		КОГДА бестОбъемНачисленийНП.РасчетПоФактическомуПотреблению
	|			ТОГДА бестОбъемНачисленийНП.ОбъемУслугиПотребленный
	|		ИНАЧЕ бестОбъемНачисленийНП.ОбъемУслуги
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА бестОбъемНачисленийНП.РасчетПоФактическомуПотреблению
	|			ТОГДА бестОбъемНачисленийНП.ОбъемУслуги
	|		ИНАЧЕ бестОбъемНачисленийНП.ОбъемУслугиПотребленный
	|	КОНЕЦ КАК ОбъемУслугиПотребленный,
	|	бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестОбъемНачисленийНП.ОбъемДосчитанный КАК ОбъемДосчитанный,
	|	бестОбъемНачисленийНП.НачалоПериода КАК НачалоПериода,
	|	бестОбъемНачисленийНП.КонецПериода КАК КонецПериода,
	|	бестОбъемНачисленийНП.НачальныеПоказания КАК НачальныеПоказания,
	|	бестОбъемНачисленийНП.КонечныеПоказания КАК КонечныеПоказания,
	|	бестОбъемНачисленийНП.ЗначениеПлощади КАК ЗначениеПлощади,
	|	бестОбъемНачисленийНП.НормаПотребления КАК НормаПотребления,
	|	бестОбъемНачисленийНП.РасчетПоФормуле КАК РасчетПоФормуле,
	|	бестОбъемНачисленийНП.ДатаПоверки КАК ДатаПоверки,
	|	бестОбъемНачисленийНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	бестОбъемНачисленийНП.КоэффициентРасчета КАК КоэффициентФормула,
	|	бестОбъемНачисленийНП.ВидДифференцированности КАК ВидДифференцированности,
	|	бестОбъемНачисленийНП.СписатьИзНормы КАК СписатьИзНормы,
	|	бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	бестОбъемНачисленийНП.СоставнаяУслуга КАК СоставнаяУслуга,
	|	бестОбъемНачисленийНП.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	бестОбъемНачисленийНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	бестОбъемНачисленийНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	бестОбъемНачисленийНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	бестОбъемНачисленийНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	бестОбъемНачисленийНП.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	бестОбъемНачисленийНП.ПлощадьМОП КАК ПлощадьМОП,
	|	бестОбъемНачисленийНП.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	бестОбъемНачисленийНП.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ОбъемНачисленийНППоПриборуУчетаКорректироватьИндивидуальныйОбъем
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	|			&НачалоПериодаЮЛ,
	|			&КонецПериодаЮЛ,
	|			Запись,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ Распределение
	|				И МКД = &Строение
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	|				И СпособНачисления В (ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам), ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему))
	|				И Услуга В
	|					(ВЫБРАТЬ
	|						энргВидыУслуг.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.энргВидыУслуг КАК энргВидыУслуг
	|					ГДЕ
	|						энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ)) КАК бестОбъемНачисленийНПОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ПО бестОбъемНачисленийНПОбороты.Период = бестОбъемНачисленийНП.Период
	|			И бестОбъемНачисленийНПОбороты.Регистратор = бестОбъемНачисленийНП.Регистратор
	|			И бестОбъемНачисленийНПОбороты.НомерСтроки = бестОбъемНачисленийНП.НомерСтроки
	|			И (бестОбъемНачисленийНП.ОбъектУчаствуетВРаспределенииМКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргОбъемНачисленийОбороты.Период, МЕСЯЦ) КАК ПериодНачисления,
	|	энргОбъемНачисленийОбороты.Район КАК Район,
	|	энргОбъемНачисленийОбороты.Организация КАК Организация,
	|	энргОбъемНачисленийОбороты.Распределение КАК Распределение,
	|	энргОбъемНачисленийОбороты.МКД КАК Строение,
	|	энргОбъемНачисленийОбороты.ОбъектРасчета КАК Абонент,
	|	энргОбъемНачисленийОбороты.ОбъектРасчета КАК Помещение,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления КАК СпособНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользованияТУ,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.Пустаяссылка) КАК Измеритель,
	|	энргОбъемНачисленийОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала КАК Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	1 КАК ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	ЛОЖЬ КАК ЧастныйСектор,
	|	ЛОЖЬ КАК СверхНорматива,
	|	0 КАК Сумма,
	|	ВЫБОР
	|		КОГДА энргОбъемНачисленийОбороты.РасчетПоФактическомуПотреблению
	|			ТОГДА энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный
	|		ИНАЧЕ энргОбъемНачисленийОбороты.ОбъемУслуги
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА энргОбъемНачисленийОбороты.РасчетПоФактическомуПотреблению
	|			ТОГДА энргОбъемНачисленийОбороты.ОбъемУслуги
	|		ИНАЧЕ энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный
	|	КОНЕЦ КАК ОбъемУслугиПотребленный,
	|	0 КАК СуммаПоПовышенномуКоэффициенту,
	|	энргОбъемНачисленийОбороты.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачисленийОбороты.КонецПериода КАК КонецПериода,
	|	энргОбъемНачисленийОбороты.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачисленийОбороты.КонечныеПоказания КАК КонечныеПоказания,
	|	0 КАК КоличествоКомнат,
	|	0 КАК КоличествоПрописанных,
	|	0 КАК КоличествоЖильцов,
	|	энргОбъемНачисленийОбороты.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачисленийОбороты.НормаПотребления КАК НормаПотребления,
	|	0 КАК КоэффициентПУ,
	|	энргОбъемНачисленийОбороты.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка) КАК ВидБлагоустройства,
	|	ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка) КАК ТарифнаяГруппа,
	|	энргОбъемНачисленийОбороты.ДатаПоверки КАК ДатаПоверки,
	|	ЛОЖЬ КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачисленийОбороты.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачисленийОбороты.КоэффициентРасчета КАК КоэффициентФормула,
	|	энргОбъемНачисленийОбороты.ВидДифференцированности КАК ВидДифференцированности,
	|	"""" КАК ОснованиеПерерасчета,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ОснованиеПерерасчетаДата,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка) КАК ПриборЗависимой,
	|	ЛОЖЬ КАК СписатьИзНормы,
	|	энргОбъемНачисленийОбороты.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	0 КАК КоличествоСобственников,
	|	0 КАК КоличествоПроживающих,
	|	ЛОЖЬ КАК СниматьНачисленныйСредний,
	|	энргОбъемНачисленийОбороты.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачисленийОбороты.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачисленийОбороты.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	0 КАК КоэффициентРаспределенияОстатка,
	|	0 КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачисленийОбороты.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачисленийОбороты.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка) КАК ПомещениеРодитель,
	|	энргОбъемНачисленийОбороты.Договор КАК Договор,
	|	энргОбъемНачисленийОбороты.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуОбъему,
	|	0 КАК ТарифНаИныеУслуги,
	|	0 КАК ТарифЗаСбытовуюНадбавку, 
	|	0 КАК ТарифЗаСбытовуюНадбавкуПокупатель,
	|	0 КАК ТарифЗаУслугиПоПередачи,
	|	ЛОЖЬ КАК НДСВнутриИныеУслуги,
	|	ЛОЖЬ КАК НДСВнутриСбытоваяНадбавка,
	|	ЛОЖЬ КАК НДСВнутриУслугиПоПередачи,
	|	0 КАК СтавкаНДС,
	|	0 КАК ТарифНаСредневзвешанную,
	|	ЛОЖЬ КАК НДСВнутри
	|ПОМЕСТИТЬ ОбъемНачисленийНП
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО энргОбъемНачисленийОбороты.Договор = энргДоговорыКонтрагентов.Ссылка
	|			И (энргДоговорыКонтрагентов.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания))
	|			И (энргОбъемНачисленийОбороты.Период МЕЖДУ &НачалоПериодаЮЛ И &КонецПериодаЮЛ)
	|			И (энргОбъемНачисленийОбороты.Организация = &Организация)
	|			И (энргОбъемНачисленийОбороты.Район = &Район)
	|			И (энргОбъемНачисленийОбороты.МКД = &Строение)
	|			И (НЕ энргОбъемНачисленийОбороты.Распределение)
	|			И (энргОбъемНачисленийОбороты.ОбъектУчаствуетВРаспределенииМКД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бестОбъемНачисленийЭлектроэнергии.Период, МЕСЯЦ),
	|	бестОбъемНачисленийЭлектроэнергии.Район,
	|	бестОбъемНачисленийЭлектроэнергии.Организация,
	|	бестОбъемНачисленийЭлектроэнергии.Распределение,
	|	бестОбъемНачисленийЭлектроэнергии.МКД,
	|	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета,
	|	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета,
	|	бестОбъемНачисленийЭлектроэнергии.Услуга,
	|	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета,
	|	NULL,
	|	бестОбъемНачисленийЭлектроэнергии.СпособНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление),
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.Пустаяссылка),
	|	бестОбъемНачисленийЭлектроэнергии.ПриборУчета,
	|	бестОбъемНачисленийЭлектроэнергии.Шкала,
	|	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона,
	|	бестОбъемНачисленийЭлектроэнергии.Тариф,
	|	бестОбъемНачисленийЭлектроэнергии.Поставщик,
	|	бестОбъемНачисленийЭлектроэнергии.ПериодРасчета,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	0,
	|	бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги,
	|	0,
	|	0,
	|	бестОбъемНачисленийЭлектроэнергии.НачалоПериода,
	|	бестОбъемНачисленийЭлектроэнергии.КонецПериода,
	|	бестОбъемНачисленийЭлектроэнергии.НачальныеПоказания,
	|	бестОбъемНачисленийЭлектроэнергии.КонечныеПоказания,
	|	0,
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка),
	|	NULL,
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка),
	|	ЛОЖЬ,
	|	NULL,
	|	0,
	|	0,
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка),
	|	бестОбъемНачисленийЭлектроэнергии.Договор,
	|	ЛОЖЬ,
	|	бестОбъемНачисленийЭлектроэнергии.ТарифНаИныеУслуги,
	|	бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавку, 
	|	бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавкуПокупатель,
	|	бестОбъемНачисленийЭлектроэнергии.ТарифЗаУслугиПоПередачи,
	|	бестОбъемНачисленийЭлектроэнергии.НДСВнутриИныеУслуги,
	|	бестОбъемНачисленийЭлектроэнергии.НДСВнутриСбытоваяНадбавка,
	|	бестОбъемНачисленийЭлектроэнергии.НДСВнутриУслугиПоПередачи,
	|	бестОбъемНачисленийЭлектроэнергии.СтавкаНДС,
	|	ВложенныйЗапрос.ТарифНаСредневзвешанную,
	|	бестОбъемНачисленийЭлектроэнергии.НДСВнутри
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Организация КАК Организация,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Район КАК Район,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.МКД КАК МКД,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.ПериодНачисления КАК ПериодНачисления,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.ОбъектРасчета КАК ОбъектРасчета,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Договор КАК Договор,
	|			СУММА((бестОбъемНачисленийЭлектроэнергииОбороты.СуммаСредневзвешеннаяОборот - бестОбъемНачисленийЭлектроэнергииОбороты.СуммаСредневзвешеннаяНДСОборот) / бестОбъемНачисленийЭлектроэнергииОбороты.ОбъемУслугиОборот) КАК ТарифНаСредневзвешанную,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Услуга КАК Услуга
	|		ИЗ
	|			РегистрНакопления.бестОбъемНачисленийЭлектроэнергии.Обороты(
	|					&НачалоПериодаЮЛ,
	|					&КонецПериодаЮЛ,
	|					Запись,
	|					Организация = &Организация
	|						И Район = &Район
	|						И МКД = &Строение
	|						И ПериодНачисления = &ПериодНачисления
	|						И НЕ Распределение
	|						И ОтклонениеОтПлана <> ЗНАЧЕНИЕ(Перечисление.бестТипыЦенНаЭЭ.ПревышениеНадФактом)
	|						И ОтклонениеОтПлана <> ЗНАЧЕНИЕ(Перечисление.бестТипыЦенНаЭЭ.ПревышениеНадПланом)) КАК бестОбъемНачисленийЭлектроэнергииОбороты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|				ПО бестОбъемНачисленийЭлектроэнергииОбороты.Договор = энргДоговорыКонтрагентов.Ссылка
	|					И (энргДоговорыКонтрагентов.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.бестТипыДоговоров.УправляющаяКомпания))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Организация,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Район,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.МКД,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.ПериодНачисления,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.ОбъектРасчета,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Договор,
	|			бестОбъемНачисленийЭлектроэнергииОбороты.Услуга) КАК ВложенныйЗапрос
	|		ПО бестОбъемНачисленийЭлектроэнергии.Организация = ВложенныйЗапрос.Организация
	|			И бестОбъемНачисленийЭлектроэнергии.Район = ВложенныйЗапрос.Район
	|			И бестОбъемНачисленийЭлектроэнергии.МКД = ВложенныйЗапрос.МКД
	|			И бестОбъемНачисленийЭлектроэнергии.ПериодНачисления = ВложенныйЗапрос.ПериодНачисления
	|			И бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета = ВложенныйЗапрос.ОбъектРасчета
	|			И бестОбъемНачисленийЭлектроэнергии.Договор = ВложенныйЗапрос.Договор
	|			И (бестОбъемНачисленийЭлектроэнергии.Период МЕЖДУ &НачалоПериодаЮЛ И &КонецПериодаЮЛ)
	|			И (НЕ бестОбъемНачисленийЭлектроэнергии.Распределение)
	|			И бестОбъемНачисленийЭлектроэнергии.Услуга = ВложенныйЗапрос.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.Район КАК Район,
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.МКД КАК МКД,
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.ПериодНачисления КАК ПериодНачисленияОбъема,
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.Услуга КАК Услуга,
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги,
	|	энргОтрицательныйОбъемРаспределенияМКДОстатки.ОбъемУслугиПотребленныйОстаток КАК ОбъемУслугиПотребленный
	|ПОМЕСТИТЬ ОтрицательныйОбъемРаспределения
	|ИЗ
	|	РегистрНакопления.энргОтрицательныйОбъемРаспределенияМКД.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &Строение) КАК энргОтрицательныйОбъемРаспределенияМКДОстатки";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстРаспределениеУК()
	Возврат "ВЫБРАТЬ
	        |	бестПодключениеНеОтОбщейСборкиСрезПоследних.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ ТУПодключенныеНеОтОбщейСборки
	        |ИЗ
	        |	РегистрСведений.бестПодключениеНеОтОбщейСборки.СрезПоследних(
	        |			&КонецПериодаЮЛ,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И МКД = &Строение) КАК бестПодключениеНеОтОбщейСборкиСрезПоследних
	        |ГДЕ
	        |	бестПодключениеНеОтОбщейСборкиСрезПоследних.ПодключениеНеОтОбщейСборки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
	        |	энргЗначенияТарифовСрезПоследних.Район КАК Район,
	        |	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	        |	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	        |	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
	        |	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	        |	энргЗначенияТарифовСрезПоследних.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	        |	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	        |	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри,
	        |	энргЗначенияТарифовСрезПоследних.ЗначениеРЭК КАК ЗначениеРЭК
	        |ПОМЕСТИТЬ ЗначенияТарифов
	        |ИЗ
	        |	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	        |			&КонецПериодаЮЛ,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргПриоритетыВидовДифференцированности.ВидДифференцированности КАК ВидДифференцированности,
	        |	энргПриоритетыВидовДифференцированности.Приоритет КАК Приоритет
	        |ПОМЕСТИТЬ ПриоритетыВидовДифференцированности
	        |ИЗ
	        |	РегистрСведений.энргПриоритетыВидовДифференцированности КАК энргПриоритетыВидовДифференцированности
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД,
	        |	энргФормыУправленияМКДСрезПоследних.УК КАК УК,
	        |	НАЧАЛОПЕРИОДА(энргФормыУправленияМКДСрезПоследних.Период, ДЕНЬ) КАК Период,
	        |	энргФормыУправленияМКДСрезПоследних.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК
	        |ПОМЕСТИТЬ СменаУК
	        |ИЗ
	        |	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(
	        |			&НачалоПериодаЮЛ,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И МКД = &Строение) КАК энргФормыУправленияМКДСрезПоследних
	        |ГДЕ
	        |	энргФормыУправленияМКДСрезПоследних.ФормаУправления В (ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.УК), ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.ТСЖ))
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	энргФормыУправленияМКД.МКД,
	        |	энргФормыУправленияМКД.УК,
	        |	НАЧАЛОПЕРИОДА(энргФормыУправленияМКД.Период, ДЕНЬ),
	        |	энргФормыУправленияМКД.РасчетОбъемовВыполняетУК
	        |ИЗ
	        |	РегистрСведений.энргФормыУправленияМКД КАК энргФормыУправленияМКД
	        |ГДЕ
	        |	энргФормыУправленияМКД.Период МЕЖДУ &НачалоПериодаЮЛ И &КонецПериодаЮЛ
	        |	И энргФормыУправленияМКД.ФормаУправления В (ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.УК), ЗНАЧЕНИЕ(Перечисление.энргФормыУправленияМКД.ТСЖ))
	        |	И энргФормыУправленияМКД.Организация = &Организация
	        |	И энргФормыУправленияМКД.Район = &Район
	        |	И энргФормыУправленияМКД.МКД = &Строение
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СменаУК.МКД КАК МКД,
	        |	СменаУК.УК КАК УК,
	        |	СменаУК.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	СменаУК.Период КАК Период,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СменаУК1.Период) КАК НомерПозиции
	        |ПОМЕСТИТЬ СменаУКНомерПозиции
	        |ИЗ
	        |	СменаУК КАК СменаУК
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СменаУК КАК СменаУК1
	        |		ПО СменаУК.МКД = СменаУК1.МКД
	        |			И СменаУК.Период > СменаУК1.Период
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СменаУК.МКД,
	        |	СменаУК.УК,
	        |	СменаУК.Период,
	        |	СменаУК.РасчетОбъемовВыполняетУК
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СменаУКНомерПозиции.МКД КАК МКД,
	        |	СменаУКНомерПозиции.УК КАК УК,
	        |	СменаУКНомерПозиции.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	СменаУКНомерПозиции.Период КАК Период,
	        |	ВЫБОР
	        |		КОГДА СменаУКНомерПозиции.Период < &НачалоПериодаЮЛ
	        |			ТОГДА &НачалоПериодаЮЛ
	        |		ИНАЧЕ СменаУКНомерПозиции.Период
	        |	КОНЕЦ КАК НачалоУК,
	        |	ВЫБОР
	        |		КОГДА СменаУКНомерПозиции1.Период ЕСТЬ NULL
	        |			ТОГДА &КОНЕЦПериодаЮЛ
	        |		ИНАЧЕ СменаУКНомерПозиции1.Период
	        |	КОНЕЦ КАК КонецУК
	        |ПОМЕСТИТЬ СменаУК_СтабПер
	        |ИЗ
	        |	СменаУКНомерПозиции КАК СменаУКНомерПозиции
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СменаУКНомерПозиции КАК СменаУКНомерПозиции1
	        |		ПО СменаУКНомерПозиции.МКД = СменаУКНомерПозиции1.МКД
	        |			И (СменаУКНомерПозиции1.НомерПозиции = СменаУКНомерПозиции.НомерПозиции + 1)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СменаУК_СтабПер.МКД КАК МКД,
	        |	СменаУК_СтабПер.УК КАК УК,
	        |	СменаУК_СтабПер.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	РАЗНОСТЬДАТ(СменаУК_СтабПер.НачалоУК, СменаУК_СтабПер.КонецУК, ДЕНЬ) / РАЗНОСТЬДАТ(&НачалоПериодаЮЛ, &КонецПериодаЮЛ, ДЕНЬ) КАК Коэф
	        |ПОМЕСТИТЬ СменаУК_Конец
	        |ИЗ
	        |	СменаУК_СтабПер КАК СменаУК_СтабПер
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргСостояниеМКДСрезПоследних.МКД КАК МКД
	        |ПОМЕСТИТЬ АктивныеМКД
	        |ИЗ
	        |	РегистрСведений.энргСостояниеМКД.СрезПоследних(
	        |			&КонецПериодаЮЛ,
	        |			Район = &Район
	        |				И Организация = &Организация
	        |				И МКД В
	        |					(ВЫБРАТЬ
	        |						СменаУК_Конец.МКД КАК МКД
	        |					ИЗ
	        |						СменаУК_Конец КАК СменаУК_Конец)) КАК энргСостояниеМКДСрезПоследних
	        |ГДЕ
	        |	энргСостояниеМКДСрезПоследних.Состояние
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	энргСостояниеМКДСрезПоследних.МКД
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.Услуга КАК Услуга,
	        |	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПоказаний КАК КоличествоПоказаний
	        |ПОМЕСТИТЬ НастройкаСреднего
	        |ИЗ
	        |	РегистрСведений.энргНастройкиРасчетаСреднегоПотребления.СрезПоследних(
	        |			&ПериодНачисления,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргНастройкиРасчетаСреднегоПотребленияСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргОтложенныеДвиженияДокументов.Организация КАК Организация,
	        |	энргОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	        |	энргОтложенныеДвиженияДокументов.Район КАК Район,
	        |	энргОтложенныеДвиженияДокументов.Строение КАК Строение
	        |ПОМЕСТИТЬ ДокументыДляРаспределения
	        |ИЗ
	        |	РегистрСведений.энргОтложенныеДвиженияДокументов КАК энргОтложенныеДвиженияДокументов
	        |ГДЕ
	        |	энргОтложенныеДвиженияДокументов.Организация = &Организация
	        |	И энргОтложенныеДвиженияДокументов.ПериодНачисления = &ПериодНачисления
	        |	И энргОтложенныеДвиженияДокументов.Район = &Район
	        |	И энргОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.РаспределениеМКД)
	        |	И НЕ энргОтложенныеДвиженияДокументов.ЧастныйСектор
	        |	И энргОтложенныеДвиженияДокументов.Строение = &Строение
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргСтабильныеПериодыМКД.Организация КАК Организация,
	        |	энргСтабильныеПериодыМКД.Район КАК Район,
	        |	энргСтабильныеПериодыМКД.МКД КАК МКД,
	        |	энргСтабильныеПериодыМКД.Услуга КАК Услуга,
	        |	энргСтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	        |	энргСтабильныеПериодыМКД.ЗначениеПлощади КАК ПлощадьМОП,
	        |	энргСтабильныеПериодыМКД.СоставнаяУслуга КАК СоставнаяУслуга,
	        |	энргСтабильныеПериодыМКД.КлючНорматива КАК КлючНорматива
	        |ПОМЕСТИТЬ УслугиМКДРаспределять
	        |ИЗ
	        |	ДокументыДляРаспределения КАК ДокументыДляРаспределения
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК энргСтабильныеПериодыМКД
	        |		ПО ДокументыДляРаспределения.Организация = энргСтабильныеПериодыМКД.Организация
	        |			И (энргСтабильныеПериодыМКД.ПериодНачисления = &ПериодНачисления)
	        |			И ДокументыДляРаспределения.Район = энргСтабильныеПериодыМКД.Район
	        |			И ДокументыДляРаспределения.Строение = энргСтабильныеПериодыМКД.МКД
	        |			И (энргСтабильныеПериодыМКД.НомерПозиции = 0)
	        |			И (энргСтабильныеПериодыМКД.НеРаспределятьНаАбонентов)
	        |			И (энргСтабильныеПериодыМКД.Организация = &Организация)
	        |			И (энргСтабильныеПериодыМКД.Район = &Район)
	        |			И (энргСтабильныеПериодыМКД.МКД = &Строение)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор,
	        |	бестДоговорыТочекУчетаСрезПоследних.Организация КАК Организация,
	        |	бестДоговорыТочекУчетаСрезПоследних.Район КАК Район,
	        |	бестОбъектыРасчета.МКД КАК МКД,
	        |	УслугиМКДРаспределять.Услуга КАК Услуга,
	        |	энргДоговорыКонтрагентов.Контрагент КАК Контрагент
	        |ПОМЕСТИТЬ ОбъектыРасчетаТУ
	        |ИЗ
	        |	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	        |			&КонецПериодаЮЛ,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиМКДРаспределять КАК УслугиМКДРаспределять
	        |		ПО бестДоговорыТочекУчетаСрезПоследних.Организация = УслугиМКДРаспределять.Организация
	        |			И бестДоговорыТочекУчетаСрезПоследних.Район = УслугиМКДРаспределять.Район
	        |			И бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета = УслугиМКДРаспределять.ТочкаУчета
	        |			И бестДоговорыТочекУчетаСрезПоследних.Услуга = УслугиМКДРаспределять.Услуга
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	        |		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ПО бестДоговорыТочекУчетаСрезПоследних.Договор = энргДоговорыКонтрагентов.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъектыРасчетаТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ОбъектыРасчетаТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ОбъектыРасчетаТУ.Договор КАК Договор,
	        |	ОбъектыРасчетаТУ.Организация КАК Организация,
	        |	ОбъектыРасчетаТУ.Район КАК Район,
	        |	СменаУК_Конец.Коэф КАК Коэф,
	        |	СменаУК_Конец.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	ОбъектыРасчетаТУ.МКД КАК МКД,
	        |	ОбъектыРасчетаТУ.Услуга КАК Услуга,
	        |	ОбъектыРасчетаТУ.Контрагент КАК Контрагент
	        |ПОМЕСТИТЬ ОбъектыРасчетаКоэф
	        |ИЗ
	        |	ОбъектыРасчетаТУ КАК ОбъектыРасчетаТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СменаУК_Конец КАК СменаУК_Конец
	        |		ПО ОбъектыРасчетаТУ.МКД = СменаУК_Конец.МКД
	        |			И ОбъектыРасчетаТУ.Контрагент = СменаУК_Конец.УК
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргОбъемНачисленийМКД.МКД КАК МКД,
	        |	энргОбъемНачисленийМКД.Услуга КАК Услуга,
	        |	энргОбъемНачисленийМКД.ОбъемУслуги КАК ОбъемУслуги,
	        |	ВЫБОР
	        |		КОГДА энргОбъемНачисленийМКД.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	        |				ИЛИ энргОбъемНачисленийМКД.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.СреднееПоНормативу)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК НачислятьПоНорме,
	        |	энргОбъемНачисленийМКД.НормаПотребления КАК НормаПотребления,
	        |	энргОбъемНачисленийМКД.ОбъемУслугиНорматив КАК ОбъемУслугиНорматив,
	        |	энргОбъемНачисленийМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	энргОбъемНачисленийМКД.Поставщик КАК Поставщик,
	        |	энргОбъемНачисленийМКД.Организация КАК Организация,
	        |	энргОбъемНачисленийМКД.Район КАК Район
	        |ПОМЕСТИТЬ ОбъемыМКД
	        |ИЗ
	        |	РегистрНакопления.энргОбъемНачисленийМКД КАК энргОбъемНачисленийМКД
	        |ГДЕ
	        |	энргОбъемНачисленийМКД.Период МЕЖДУ &НачалоПериодаЮЛ И &КонецПериодаЮЛ
	        |	И энргОбъемНачисленийМКД.Организация = &Организация
	        |	И энргОбъемНачисленийМКД.Район = &Район
	        |	И (энргОбъемНачисленийМКД.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	        |			ИЛИ энргОбъемНачисленийМКД.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)
	        |			ИЛИ энргОбъемНачисленийМКД.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	        |			ИЛИ энргОбъемНачисленийМКД.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет))
	        |	И энргОбъемНачисленийМКД.МКД В
	        |			(ВЫБРАТЬ
	        |				АктивныеМКД.МКД КАК МКД
	        |			ИЗ
	        |				АктивныеМКД КАК АктивныеМКД)
	        |	И энргОбъемНачисленийМКД.ОбъемУслуги <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемыМКД.Услуга КАК Услуга,
	        |	ОбъемыМКД.МКД КАК МКД,
	        |	МАКСИМУМ(ОбъемыМКД.НормаПотребления) КАК НормаПотребления
	        |ПОМЕСТИТЬ УслугиМКД
	        |ИЗ
	        |	ОбъемыМКД КАК ОбъемыМКД
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОбъемыМКД.Услуга,
	        |	ОбъемыМКД.МКД
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргОбъемНачисленийОбороты.Строение КАК МКД,
	        |	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	        |	энргОбъемНачисленийОбороты.ОбъемУслугиОборот КАК ОбъемУслуги,
	        |	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ ОбъемыПотребителей
	        |ИЗ
	        |	РегистрНакопления.энргОбъемНачислений.Обороты(
	        |			&НачалоПериодаФЛ,
	        |			&КонецПериодаФЛ,
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И Строение В
	        |					(ВЫБРАТЬ
	        |						АктивныеМКД.МКД КАК МКД
	        |					ИЗ
	        |						АктивныеМКД КАК АктивныеМКД)
	        |				И НЕ Распределение) КАК энргОбъемНачисленийОбороты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиМКД КАК УслугиМКД
	        |		ПО энргОбъемНачисленийОбороты.Услуга = УслугиМКД.Услуга
	        |			И энргОбъемНачисленийОбороты.Строение = УслугиМКД.МКД
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНПОбороты.МКД,
	        |	бестОбъемНачисленийНПОбороты.Услуга,
	        |	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот,
	        |	бестОбъемНачисленийНПОбороты.ТарифнаяЗона
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	        |			&НачалоПериодаЮЛ,
	        |			&КонецПериодаЮЛ,
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И МКД В
	        |					(ВЫБРАТЬ
	        |						АктивныеМКД.МКД КАК МКД
	        |					ИЗ
	        |						АктивныеМКД КАК АктивныеМКД)
	        |				И НЕ ТочкаУчета В
	        |						(ВЫБРАТЬ
	        |							ТУПодключенныеНеОтОбщейСборки.ТочкаУчета КАК ТочкаУчета
	        |						ИЗ
	        |							ТУПодключенныеНеОтОбщейСборки КАК ТУПодключенныеНеОтОбщейСборки)
	        |				И НЕ Распределение) КАК бестОбъемНачисленийНПОбороты
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	энргОбъемНачисленийОбороты.Строение,
	        |	УслугиМКД1.Услуга,
	        |	энргОбъемНачисленийОбороты.ОбъемУслугиОборот * УслугиМКД1.НормаПотребления,
	        |	энргОбъемНачисленийОбороты.ТарифнаяЗона
	        |ИЗ
	        |	РегистрНакопления.энргОбъемНачислений.Обороты(
	        |			&НачалоПериодаФЛ,
	        |			&КонецПериодаФЛ,
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И Строение В
	        |					(ВЫБРАТЬ
	        |						АктивныеМКД.МКД КАК МКД
	        |					ИЗ
	        |						АктивныеМКД КАК АктивныеМКД)
	        |				И НЕ Распределение) КАК энргОбъемНачисленийОбороты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиМКД КАК УслугиМКД1
	        |		ПО (энргОбъемНачисленийОбороты.Услуга = ВЫРАЗИТЬ(УслугиМКД1.Услуга КАК Справочник.энргВидыУслуг).ЗависитОтУслуги)
	        |			И (НЕ УслугиМКД1.Услуга В
	        |					(ВЫБРАТЬ
	        |						энргОбъемНачисленийОбороты.Услуга
	        |					ИЗ
	        |						РегистрНакопления.энргОбъемНачислений.Обороты(&НачалоПериодаФЛ, &КонецПериодаФЛ, , Организация = &Организация
	        |							И Район = &Район
	        |							И Строение В
	        |								(ВЫБРАТЬ
	        |									АктивныеМКД.МКД КАК МКД
	        |								ИЗ
	        |									АктивныеМКД КАК АктивныеМКД)
	        |							И НЕ Распределение) КАК энргОбъемНачисленийОбороты))
	        |			И энргОбъемНачисленийОбороты.Строение = УслугиМКД1.МКД
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийЭлектроэнергииОбороты.МКД,
	        |	бестОбъемНачисленийЭлектроэнергииОбороты.Услуга,
	        |	бестОбъемНачисленийЭлектроэнергииОбороты.ОбъемУслугиОборот,
	        |	бестОбъемНачисленийЭлектроэнергииОбороты.ТарифнаяЗона
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии.Обороты(
	        |			&НачалоПериодаЮЛ,
	        |			&КонецПериодаЮЛ,
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И МКД В
	        |					(ВЫБРАТЬ
	        |						АктивныеМКД.МКД КАК МКД
	        |					ИЗ
	        |						АктивныеМКД КАК АктивныеМКД)
	        |				И НЕ ТочкаУчета В
	        |						(ВЫБРАТЬ
	        |							ТУПодключенныеНеОтОбщейСборки.ТочкаУчета КАК ТочкаУчета
	        |						ИЗ
	        |							ТУПодключенныеНеОтОбщейСборки КАК ТУПодключенныеНеОтОбщейСборки)
	        |				И НЕ Распределение) КАК бестОбъемНачисленийЭлектроэнергииОбороты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	энргВидыДифференцированностиТарифныеЗоны.Ссылка КАК ВидДифференцированности,
	        |	ПриоритетыВидовДифференцированности.Приоритет КАК Приоритет
	        |ПОМЕСТИТЬ ПриоритетыИспользуемыхВидовДифференцированности
	        |ИЗ
	        |	ОбъемыМКД КАК ОбъемыМКД
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыВидовДифференцированности КАК ПриоритетыВидовДифференцированности
	        |			ПО энргВидыДифференцированностиТарифныеЗоны.Ссылка = ПриоритетыВидовДифференцированности.ВидДифференцированности
	        |		ПО ОбъемыМКД.ТарифнаяЗона = энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	энргВидыДифференцированностиТарифныеЗоны.Ссылка,
	        |	ПриоритетыВидовДифференцированности.Приоритет
	        |ИЗ
	        |	Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыПотребителей КАК ОбъемыПотребителей
	        |		ПО энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона = ОбъемыПотребителей.ТарифнаяЗона
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыВидовДифференцированности КАК ПриоритетыВидовДифференцированности
	        |		ПО энргВидыДифференцированностиТарифныеЗоны.Ссылка = ПриоритетыВидовДифференцированности.ВидДифференцированности
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	МИНИМУМ(ПриоритетыВидовДифференцированности.Приоритет) КАК Приоритет
	        |ПОМЕСТИТЬ МинимальныйПриоритетВидаДиф
	        |ИЗ
	        |	ПриоритетыИспользуемыхВидовДифференцированности КАК ПриоритетыВидовДифференцированности
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	энргСоставляющиеТарифныхЗон.СоставляющаяТарифнаяЗона КАК СоставляющаяТарифнаяЗона
	        |ПОМЕСТИТЬ СоставляющиеПриоритетнойТарифныеЗоны
	        |ИЗ
	        |	МинимальныйПриоритетВидаДиф КАК МинимальныйПриоритетВидаДиф
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыВидовДифференцированности КАК ПриоритетыВидовДифференцированности
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСоставляющиеТарифныхЗон КАК энргСоставляющиеТарифныхЗон
	        |				ПО энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона = энргСоставляющиеТарифныхЗон.ТарифнаяЗона
	        |			ПО ПриоритетыВидовДифференцированности.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	        |		ПО МинимальныйПриоритетВидаДиф.Приоритет = ПриоритетыВидовДифференцированности.Приоритет
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемыМКД.МКД КАК МКД,
	        |	ОбъемыМКД.Услуга КАК Услуга,
	        |	СУММА(ОбъемыМКД.ОбъемУслуги) КАК ОбъемУслуги,
	        |	МАКСИМУМ(ОбъемыМКД.НачислятьПоНорме) КАК НачислятьПоНорме,
	        |	МАКСИМУМ(ОбъемыМКД.НормаПотребления) КАК НормаПотребления,
	        |	МАКСИМУМ(ОбъемыМКД.ОбъемУслугиНорматив) КАК ОбъемУслугиНорматив,
	        |	ЕСТЬNULL(СоставляющиеПриоритетнойТарифныеЗоны.ТарифнаяЗона, ОбъемыМКД.ТарифнаяЗона) КАК ТарифнаяЗона,
	        |	ОбъемыМКД.Поставщик КАК Поставщик,
	        |	ОбъемыМКД.Организация КАК Организация,
	        |	ОбъемыМКД.Район КАК Район
	        |ПОМЕСТИТЬ ОбъемыМКДПереопределениеТЗ
	        |ИЗ
	        |	ОбъемыМКД КАК ОбъемыМКД
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СоставляющиеПриоритетнойТарифныеЗоны КАК СоставляющиеПриоритетнойТарифныеЗоны
	        |		ПО ОбъемыМКД.ТарифнаяЗона = СоставляющиеПриоритетнойТарифныеЗоны.СоставляющаяТарифнаяЗона
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОбъемыМКД.МКД,
	        |	ОбъемыМКД.Услуга,
	        |	ЕСТЬNULL(СоставляющиеПриоритетнойТарифныеЗоны.ТарифнаяЗона, ОбъемыМКД.ТарифнаяЗона),
	        |	ОбъемыМКД.Поставщик,
	        |	ОбъемыМКД.Организация,
	        |	ОбъемыМКД.Район
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемыПотребителей.МКД КАК МКД,
	        |	ОбъемыПотребителей.Услуга КАК Услуга,
	        |	СУММА(ОбъемыПотребителей.ОбъемУслуги) КАК ОбъемУслуги,
	        |	ЕСТЬNULL(СоставляющиеПриоритетнойТарифныеЗоны.ТарифнаяЗона, ОбъемыПотребителей.ТарифнаяЗона) КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ ОбъемыПотребителейПереопределениеТЗ
	        |ИЗ
	        |	ОбъемыПотребителей КАК ОбъемыПотребителей
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СоставляющиеПриоритетнойТарифныеЗоны КАК СоставляющиеПриоритетнойТарифныеЗоны
	        |		ПО ОбъемыПотребителей.ТарифнаяЗона = СоставляющиеПриоритетнойТарифныеЗоны.СоставляющаяТарифнаяЗона
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОбъемыПотребителей.МКД,
	        |	ОбъемыПотребителей.Услуга,
	        |	ЕСТЬNULL(СоставляющиеПриоритетнойТарифныеЗоны.ТарифнаяЗона, ОбъемыПотребителей.ТарифнаяЗона)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНП.Договор КАК Договор,
	        |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	        |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги) КАК ОбъемУслуги,
	        |	МИНИМУМ(бестОбъемНачисленийНП.ПериодНачисления) КАК ПериодНачисленияМин,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.ПериодНачисления) КАК ПериодНачисленияМакс,
	        |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	        |	МАКСИМУМ(ОбъемыМКДПереопределениеТЗ.ОбъемУслугиНорматив) КАК ОбъемУслугиНорматив,
	        |	ОбъемыМКДПереопределениеТЗ.МКД КАК МКД,
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бестОбъемНачисленийНП.ПериодНачисления) КАК ПериодНачисленияКолвоРазличных,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.ЗначениеТарифа) КАК ЗначениеТарифа,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.СтавкаНДС) КАК СтавкаНДС,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.НДСВнутри) КАК НДСВнутри,
	        |	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестОбъемНачисленийНП.ТарифнаяГруппа КАК ТарифнаяГруппа,
	        |	ОбъектыРасчетаКоэф.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК
	        |ПОМЕСТИТЬ ОбъемыУКДляСреднего
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРасчетаКоэф КАК ОбъектыРасчетаКоэф
	        |		ПО бестОбъемНачисленийНП.МКД = ОбъектыРасчетаКоэф.МКД
	        |			И бестОбъемНачисленийНП.ОбъектРасчета = ОбъектыРасчетаКоэф.ОбъектРасчета
	        |			И бестОбъемНачисленийНП.Организация = ОбъектыРасчетаКоэф.Организация
	        |			И бестОбъемНачисленийНП.Район = ОбъектыРасчетаКоэф.Район
	        |			И бестОбъемНачисленийНП.ТочкаУчета = ОбъектыРасчетаКоэф.ТочкаУчета
	        |			И (бестОбъемНачисленийНП.ПериодНачисления < &ПериодНачисления)
	        |			И (бестОбъемНачисленийНП.Распределение)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыМКДПереопределениеТЗ КАК ОбъемыМКДПереопределениеТЗ
	        |		ПО бестОбъемНачисленийНП.Услуга = ОбъемыМКДПереопределениеТЗ.Услуга
	        |			И (бестОбъемНачисленийНП.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам))
	        |			И бестОбъемНачисленийНП.МКД = ОбъемыМКДПереопределениеТЗ.МКД
	        |			И (бестОбъемНачисленийНП.Услуга = ОбъектыРасчетаКоэф.Услуга)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.Договор,
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	ОбъемыМКДПереопределениеТЗ.МКД,
	        |	бестОбъемНачисленийНП.Поставщик,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона,
	        |	бестОбъемНачисленийНП.ТарифнаяГруппа,
	        |	ОбъектыРасчетаКоэф.РасчетОбъемовВыполняетУК
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемыУКДляСреднего.ОбъектРасчета КАК ОбъектРасчета,
	        |	ОбъемыУКДляСреднего.Договор КАК Договор,
	        |	ОбъемыУКДляСреднего.ТочкаУчета КАК ТочкаУчета,
	        |	ВЫБОР
	        |		КОГДА РАЗНОСТЬДАТ(ОбъемыУКДляСреднего.ПериодНачисленияМин, ОбъемыУКДляСреднего.ПериодНачисленияМакс, МЕСЯЦ) + 1 >= ЕСТЬNULL(НастройкаСреднего.КоличествоПоказаний, 1)
	        |			ТОГДА ОбъемыУКДляСреднего.ОбъемУслуги / ОбъемыУКДляСреднего.ПериодНачисленияКолвоРазличных
	        |		ИНАЧЕ ОбъемыУКДляСреднего.ОбъемУслугиНорматив
	        |	КОНЕЦ КАК ИтоговыйОбъемРаспределения,
	        |	ОбъемыУКДляСреднего.Услуга КАК Услуга,
	        |	ОбъемыУКДляСреднего.МКД КАК МКД,
	        |	ОбъемыУКДляСреднего.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	ВЫБОР
	        |		КОГДА РАЗНОСТЬДАТ(ОбъемыУКДляСреднего.ПериодНачисленияМин, ОбъемыУКДляСреднего.ПериодНачисленияМакс, МЕСЯЦ) + 1 >= ЕСТЬNULL(НастройкаСреднего.КоличествоПоказаний, 1)
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)
	        |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	        |	КОНЕЦ КАК СпособНачисления,
	        |	ОбъемыУКДляСреднего.ЗначениеТарифа КАК ЗначениеТарифа,
	        |	ОбъемыУКДляСреднего.СтавкаНДС КАК СтавкаНДС,
	        |	ОбъемыУКДляСреднего.НДСВнутри КАК НДСВнутри,
	        |	ОбъемыУКДляСреднего.Поставщик КАК Поставщик,
	        |	ОбъемыУКДляСреднего.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ОбъемыУКДляСреднего.ТарифнаяГруппа КАК ТарифнаяГруппа
	        |ПОМЕСТИТЬ РасчетОбъемаУКПоСреднему
	        |ИЗ
	        |	ОбъемыУКДляСреднего КАК ОбъемыУКДляСреднего
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаСреднего КАК НастройкаСреднего
	        |		ПО ОбъемыУКДляСреднего.Услуга = НастройкаСреднего.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемыМКДПереопределениеТЗ.МКД КАК МКД,
	        |	ОбъемыМКДПереопределениеТЗ.Услуга КАК Услуга,
	        |	ОбъемыМКДПереопределениеТЗ.НачислятьПоНорме КАК НачислятьПоНорме,
	        |	МАКСИМУМ(ОбъектыРасчетаКоэф.ОбъектРасчета) КАК ОбъектРасчета,
	        |	СУММА(ОбъемыМКДПереопределениеТЗ.ОбъемУслуги) КАК ОбъемУслугиМКД,
	        |	МАКСИМУМ(ЕСТЬNULL(ОбъемыПотребителейПереопределениеТЗ.ОбъемУслуги, 0)) КАК ОбъемУслугиРаспределение,
	        |	МАКСИМУМ(бестНачислениеОбъемовУК.Ссылка) КАК ДокументНачисления,
	        |	ОбъектыРасчетаКоэф.Коэф КАК Коэф,
	        |	ОбъектыРасчетаКоэф.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	ОбъемыМКДПереопределениеТЗ.Поставщик КАК Поставщик,
	        |	ОбъемыМКДПереопределениеТЗ.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ОбъектыРасчетаКоэф.Договор КАК Договор,
	        |	ВЫБОР
	        |		КОГДА ОбъемыМКДПереопределениеТЗ.НачислятьПоНорме
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу)
	        |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	        |	КОНЕЦ КАК СпособНачисления
	        |ПОМЕСТИТЬ ДанныеДляРаспределения
	        |ИЗ
	        |	ОбъектыРасчетаКоэф КАК ОбъектыРасчетаКоэф
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыМКДПереопределениеТЗ КАК ОбъемыМКДПереопределениеТЗ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыПотребителейПереопределениеТЗ КАК ОбъемыПотребителейПереопределениеТЗ
	        |			ПО ОбъемыМКДПереопределениеТЗ.МКД = ОбъемыПотребителейПереопределениеТЗ.МКД
	        |				И ОбъемыМКДПереопределениеТЗ.Услуга = ОбъемыПотребителейПереопределениеТЗ.Услуга
	        |				И ОбъемыМКДПереопределениеТЗ.ТарифнаяЗона = ОбъемыПотребителейПереопределениеТЗ.ТарифнаяЗона
	        |		ПО ОбъектыРасчетаКоэф.Услуга = ОбъемыМКДПереопределениеТЗ.Услуга
	        |			И ОбъектыРасчетаКоэф.МКД = ОбъемыМКДПереопределениеТЗ.МКД
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестНачислениеОбъемовУК КАК бестНачислениеОбъемовУК
	        |		ПО ОбъектыРасчетаКоэф.МКД = бестНачислениеОбъемовУК.МКД
	        |			И (бестНачислениеОбъемовУК.Организация = &Организация)
	        |			И (бестНачислениеОбъемовУК.Район = &Район)
	        |			И (бестНачислениеОбъемовУК.Дата = &Дата)
	        |			И (НЕ бестНачислениеОбъемовУК.ПометкаУдаления)
	        |ГДЕ
	        |	НЕ (ОбъемыМКДПереопределениеТЗ.МКД, ОбъемыМКДПереопределениеТЗ.Услуга) В
	        |				(ВЫБРАТЬ
	        |					РасчетОбъемаУКПоСреднему.МКД КАК МКД,
	        |					РасчетОбъемаУКПоСреднему.Услуга КАК Услуга
	        |				ИЗ
	        |					РасчетОбъемаУКПоСреднему КАК РасчетОбъемаУКПоСреднему)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОбъемыМКДПереопределениеТЗ.НачислятьПоНорме,
	        |	ОбъемыМКДПереопределениеТЗ.Услуга,
	        |	ОбъемыМКДПереопределениеТЗ.МКД,
	        |	ОбъектыРасчетаКоэф.Коэф,
	        |	ОбъектыРасчетаКоэф.РасчетОбъемовВыполняетУК,
	        |	ОбъемыМКДПереопределениеТЗ.Поставщик,
	        |	ОбъемыМКДПереопределениеТЗ.ТарифнаяЗона,
	        |	ОбъектыРасчетаКоэф.Договор
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РасчетОбъемаУКПоСреднему.МКД,
	        |	РасчетОбъемаУКПоСреднему.Услуга,
	        |	ИСТИНА,
	        |	МАКСИМУМ(РасчетОбъемаУКПоСреднему.ОбъектРасчета),
	        |	СУММА(РасчетОбъемаУКПоСреднему.ИтоговыйОбъемРаспределения),
	        |	МАКСИМУМ(0),
	        |	МАКСИМУМ(бестНачислениеОбъемовУК.Ссылка),
	        |	1,
	        |	РасчетОбъемаУКПоСреднему.РасчетОбъемовВыполняетУК,
	        |	РасчетОбъемаУКПоСреднему.Поставщик,
	        |	РасчетОбъемаУКПоСреднему.ТарифнаяЗона,
	        |	РасчетОбъемаУКПоСреднему.Договор,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)
	        |ИЗ
	        |	Документ.бестНачислениеОбъемовУК КАК бестНачислениеОбъемовУК
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасчетОбъемаУКПоСреднему КАК РасчетОбъемаУКПоСреднему
	        |		ПО (бестНачислениеОбъемовУК.Организация = &Организация)
	        |			И (бестНачислениеОбъемовУК.Район = &Район)
	        |			И (бестНачислениеОбъемовУК.Дата = &Дата)
	        |			И (НЕ бестНачислениеОбъемовУК.ПометкаУдаления)
	        |			И бестНачислениеОбъемовУК.МКД = РасчетОбъемаУКПоСреднему.МКД
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	РасчетОбъемаУКПоСреднему.МКД,
	        |	РасчетОбъемаУКПоСреднему.Услуга,
	        |	РасчетОбъемаУКПоСреднему.Поставщик,
	        |	РасчетОбъемаУКПоСреднему.ТарифнаяЗона,
	        |	РасчетОбъемаУКПоСреднему.Договор,
	        |	РасчетОбъемаУКПоСреднему.РасчетОбъемовВыполняетУК
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляРаспределения.МКД КАК МКД,
	        |	ДанныеДляРаспределения.Услуга КАК Услуга,
	        |	ДанныеДляРаспределения.НачислятьПоНорме КАК НачислятьПоНорме,
	        |	ДанныеДляРаспределения.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВЫБОР
	        |		КОГДА ДанныеДляРаспределения.НачислятьПоНорме
	        |			ТОГДА ДанныеДляРаспределения.ОбъемУслугиМКД
	        |		ИНАЧЕ ДанныеДляРаспределения.ОбъемУслугиМКД - ДанныеДляРаспределения.ОбъемУслугиРаспределение
	        |	КОНЕЦ КАК ОбъемУслуги,
	        |	ДанныеДляРаспределения.ОбъемУслугиРаспределение КАК ОбъемУслугиРаспределение,
	        |	ДанныеДляРаспределения.ОбъемУслугиМКД КАК ОбъемУслугиМКД,
	        |	ДанныеДляРаспределения.ДокументНачисления КАК ДокументНачисления,
	        |	ДанныеДляРаспределения.Коэф КАК Коэф,
	        |	ДанныеДляРаспределения.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	ДанныеДляРаспределения.Поставщик КАК Поставщик,
	        |	ДанныеДляРаспределения.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ЕСТЬNULL(бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.пустаяссылка)) КАК ТарифнаяГруппа,
	        |	ДанныеДляРаспределения.Договор КАК Договор,
	        |	ДанныеДляРаспределения.СпособНачисления КАК СпособНачисления
	        |ПОМЕСТИТЬ Итог
	        |ИЗ
	        |	ДанныеДляРаспределения КАК ДанныеДляРаспределения
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	        |				&КонецПериодаЮЛ,
	        |				Организация = &Организация
	        |					И Район = &Район) КАК бестТарифныеКатегорииНПСрезПоследних
	        |		ПО ДанныеДляРаспределения.МКД = бестТарифныеКатегорииНПСрезПоследних.МКД
	        |			И ДанныеДляРаспределения.ОбъектРасчета = бестТарифныеКатегорииНПСрезПоследних.ОбъектРасчета
	        |			И ДанныеДляРаспределения.Услуга = бестТарифныеКатегорииНПСрезПоследних.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНПОбороты.МКД КАК МКД,
	        |	бестОбъемНачисленийНПОбороты.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	        |	бестОбъемНачисленийНПОбороты.Договор КАК Договор,
	        |	бестОбъемНачисленийНПОбороты.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНПОбороты.Поставщик КАК Поставщик,
	        |	бестОбъемНачисленийНПОбороты.ТарифнаяЗона КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ ОтрицательныеОбъемы
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	        |			ДОБАВИТЬКДАТЕ(&НачалоПериодаЮЛ, МЕСЯЦ, -1),
	        |			ДОБАВИТЬКДАТЕ(&КонецПериодаЮЛ, МЕСЯЦ, -1),
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И МКД В
	        |					(ВЫБРАТЬ
	        |						АктивныеМКД.МКД КАК МКД
	        |					ИЗ
	        |						АктивныеМКД КАК АктивныеМКД)) КАК бестОбъемНачисленийНПОбороты
	        |ГДЕ
	        |	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот < 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.Организация КАК Организация,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.Район КАК Район,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.МКД КАК МКД,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.ДоговорВладелец КАК ДоговорВладелец,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.ОбъектРасчетаВладелец КАК ОбъектРасчетаВладелец,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.Услуга КАК Услуга,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.Договор КАК Договор,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.НомерПП КАК НомерПП
	        |ПОМЕСТИТЬ СхемыДораспределенияОбъемовУК
	        |ИЗ
	        |	РегистрСведений.бестСхемыДораспределенияОбъемовУК.СрезПоследних(
	        |			&КонецПериодаЮЛ,
	        |			(ДоговорВладелец, ОбъектРасчетаВладелец) В
	        |				(ВЫБРАТЬ
	        |					ВТ.Договор,
	        |					ВТ.ОбъектРасчета
	        |				ИЗ
	        |					Итог КАК ВТ)) КАК бестСхемыДораспределенияОбъемовУКСрезПоследних
	        |ГДЕ
	        |	бестСхемыДораспределенияОбъемовУКСрезПоследних.НомерПП <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СхемыДораспределенияОбъемовУК.Организация КАК Организация,
	        |	СхемыДораспределенияОбъемовУК.Район КАК Район,
	        |	СхемыДораспределенияОбъемовУК.МКД КАК МКД,
	        |	СхемыДораспределенияОбъемовУК.ДоговорВладелец КАК ДоговорВладелец,
	        |	СхемыДораспределенияОбъемовУК.ОбъектРасчетаВладелец КАК ОбъектРасчетаВладелец,
	        |	СхемыДораспределенияОбъемовУК.Услуга КАК Услуга,
	        |	СхемыДораспределенияОбъемовУК.Договор КАК Договор,
	        |	СхемыДораспределенияОбъемовУК.ОбъектРасчета КАК ОбъектРасчета,
	        |	СхемыДораспределенияОбъемовУК.ТочкаУчета КАК ТочкаУчета,
	        |	СхемыДораспределенияОбъемовУК.НомерПП КАК НомерПП
	        |ИЗ
	        |	СхемыДораспределенияОбъемовУК КАК СхемыДораспределенияОбъемовУК
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.Период КАК Период,
	        |	бестОбъемНачисленийНП.Регистратор КАК Регистратор,
	        |	бестОбъемНачисленийНП.НомерСтроки КАК НомерСтроки,
	        |	бестОбъемНачисленийНП.Активность КАК Активность,
	        |	бестОбъемНачисленийНП.Организация КАК Организация,
	        |	бестОбъемНачисленийНП.Район КАК Район,
	        |	бестОбъемНачисленийНП.Договор КАК Договор,
	        |	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийНП.Услуга КАК Услуга,
	        |	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	        |	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	        |	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	        |	бестОбъемНачисленийНП.Шкала КАК Шкала,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	        |	бестОбъемНачисленийНП.ПериодНачисления КАК ПериодНачисления,
	        |	бестОбъемНачисленийНП.Распределение КАК Распределение,
	        |	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	        |	бестОбъемНачисленийНП.МКД КАК МКД,
	        |	бестОбъемНачисленийНП.ДолевоеРаспределение КАК ДолевоеРаспределение,
	        |	бестОбъемНачисленийНП.ЗначениеТарифа КАК ЗначениеТарифа,
	        |	бестОбъемНачисленийНП.ОбъемПоПрибору КАК ОбъемПоПрибору,
	        |	бестОбъемНачисленийНП.ОбъемУслуги КАК ОбъемУслуги,
	        |	бестОбъемНачисленийНП.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	        |	бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	        |	бестОбъемНачисленийНП.ОбъемДосчитанный КАК ОбъемДосчитанный,
	        |	бестОбъемНачисленийНП.ОбъемМГВ КАК ОбъемМГВ,
	        |	бестОбъемНачисленийНП.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	        |	бестОбъемНачисленийНП.Сумма КАК Сумма,
	        |	бестОбъемНачисленийНП.СуммаНДС КАК СуммаНДС,
	        |	бестОбъемНачисленийНП.НачалоПериода КАК НачалоПериода,
	        |	бестОбъемНачисленийНП.КонецПериода КАК КонецПериода,
	        |	бестОбъемНачисленийНП.НачальныеПоказания КАК НачальныеПоказания,
	        |	бестОбъемНачисленийНП.КонечныеПоказания КАК КонечныеПоказания,
	        |	бестОбъемНачисленийНП.ЗначениеПлощади КАК ЗначениеПлощади,
	        |	бестОбъемНачисленийНП.НормаПотребления КАК НормаПотребления,
	        |	бестОбъемНачисленийНП.РасчетПоФормуле КАК РасчетПоФормуле,
	        |	бестОбъемНачисленийНП.ДатаПоверки КАК ДатаПоверки,
	        |	бестОбъемНачисленийНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	        |	бестОбъемНачисленийНП.КоэффициентРасчета КАК КоэффициентРасчета,
	        |	бестОбъемНачисленийНП.ВидДифференцированности КАК ВидДифференцированности,
	        |	бестОбъемНачисленийНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	        |	бестОбъемНачисленийНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	        |	бестОбъемНачисленийНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	        |	бестОбъемНачисленийНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	        |	бестОбъемНачисленийНП.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	        |	бестОбъемНачисленийНП.СписатьИзНормы КАК СписатьИзНормы,
	        |	бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	        |	бестОбъемНачисленийНП.СоставнаяУслуга КАК СоставнаяУслуга,
	        |	бестОбъемНачисленийНП.НеПрименятьСезонность КАК НеПрименятьСезонность,
	        |	бестОбъемНачисленийНП.ПлощадьМОП КАК ПлощадьМОП,
	        |	бестОбъемНачисленийНП.ПлощадьАбонентов КАК ПлощадьАбонентов,
	        |	бестОбъемНачисленийНП.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	        |	бестОбъемНачисленийНП.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	        |	бестОбъемНачисленийНП.НедопускПУККоммерческомуУчету КАК НедопускПУККоммерческомуУчету,
	        |	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема,
	        |	бестОбъемНачисленийНП.ДиаметрСечения КАК ДиаметрСечения,
	        |	бестОбъемНачисленийНП.ТарифнаяГруппа КАК ТарифнаяГруппа,
	        |	бестОбъемНачисленийНП.СтавкаНДС КАК СтавкаНДС,
	        |	бестОбъемНачисленийНП.НДСВнутри КАК НДСВнутри,
	        |	бестОбъемНачисленийНП.ВидДопНачисления КАК ВидДопНачисления,
	        |	бестОбъемНачисленийНП.ТипДопНачисления КАК ТипДопНачисления
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |ГДЕ
	        |	бестОбъемНачисленийНП.Период >= &НачалоПериодаЮЛ
	        |	И бестОбъемНачисленийНП.Период <= &КонецПериодаЮЛ
	        |	И (бестОбъемНачисленийНП.Организация, бестОбъемНачисленийНП.Район, бестОбъемНачисленийНП.Договор, бестОбъемНачисленийНП.ОбъектРасчета, бестОбъемНачисленийНП.ТочкаУчета, бестОбъемНачисленийНП.Услуга) В
	        |			(ВЫБРАТЬ
	        |				вт.Организация,
	        |				вт.Район,
	        |				вт.Договор,
	        |				вт.ОбъектРасчета,
	        |				вт.ТочкаУчета,
	        |				вт.Услуга
	        |			ИЗ
	        |				СхемыДораспределенияОбъемовУК КАК вт)
	        |	И бестОбъемНачисленийНП.Регистратор ССЫЛКА Документ.бестПерерасчетНП
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Итог.МКД КАК МКД,
	        |	Итог.Услуга КАК Услуга,
	        |	Итог.ОбъектРасчета КАК ОбъектРасчета,
	        |	Итог.СпособНачисления КАК СпособНачисления,
	        |	Итог.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК,
	        |	(Итог.ОбъемУслуги + ЕСТЬNULL(ОтрицательныеОбъемы.ОбъемУслугиОборот, 0)) * Итог.Коэф КАК ОбъемУслуги,
	        |	Итог.ДокументНачисления КАК ДокументНачисления,
	        |	ЕСТЬNULL(ЗначенияТарифов.СтавкаНДС, 0) КАК СтавкаНДС,
	        |	ЕСТЬNULL(ЗначенияТарифов.НДСВнутри, ЛОЖЬ) КАК НДСВнутри,
	        |	ЕСТЬNULL(ЗначенияТарифов.Значение, 0) КАК ЗначениеТарифа,
	        |	Итог.Договор КАК Договор,
	        |	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ВЫРАЗИТЬ(Итог.Услуга КАК Справочник.энргВидыУслуг).бестИспользоватьРасчетЭлектроэнергии КАК ИспользоватьРасчетЭлектроэнергии,
	        |	Итог.ТарифнаяГруппа КАК ТарифнаяГруппа,
	        |	ЕСТЬNULL(ЗначенияТарифов.Значение, 0) КАК Тариф
	        |ИЗ
	        |	Итог КАК Итог
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОтрицательныеОбъемы КАК ОтрицательныеОбъемы
	        |		ПО Итог.МКД = ОтрицательныеОбъемы.МКД
	        |			И Итог.Услуга = ОтрицательныеОбъемы.Услуга
	        |			И Итог.ОбъектРасчета = ОтрицательныеОбъемы.ОбъектРасчета
	        |			И (НЕ Итог.НачислятьПоНорме)
	        |			И Итог.Поставщик = ОтрицательныеОбъемы.Поставщик
	        |			И Итог.ТарифнаяЗона = ОтрицательныеОбъемы.ТарифнаяЗона
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТарифов КАК ЗначенияТарифов
	        |		ПО Итог.ТарифнаяГруппа = ЗначенияТарифов.ГруппаПотребителей
	        |			И Итог.Услуга = ЗначенияТарифов.Услуга
	        |			И Итог.Поставщик = ЗначенияТарифов.Поставщик
	        |			И Итог.ТарифнаяЗона = ЗначенияТарифов.ТарифнаяЗона
	        |ИТОГИ
	        |	МАКСИМУМ(ДокументНачисления)
	        |ПО
	        |	МКД
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.Организация КАК Организация,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.Район КАК Район,
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.МКД КАК МКД,
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.ПериодНачисления КАК ПериодНачисленияОбъема,
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.Услуга КАК Услуга,
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги,
	        |	энргОтрицательныйОбъемРаспределенияМКДОстатки.ОбъемУслугиПотребленныйОстаток КАК ОбъемУслугиПотребленный
	        |ИЗ
	        |	РегистрНакопления.энргОтрицательныйОбъемРаспределенияМКД.Остатки(
	        |			&НачалоПериодаЮЛ,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И МКД В
	        |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |						Итог.МКД КАК МКД
	        |					ИЗ
	        |						Итог КАК Итог)) КАК энргОтрицательныйОбъемРаспределенияМКДОстатки";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Начислить_ВспомогательныеПроцедурыИФункции

Функция РезультатЗапросаИндивидуальныеНачисления(МВТ,ДокументНачисленияПустаяСсылка) 			
	ПолучитьСтабильныеПериоды(МВТ,ДокументНачисленияПустаяСсылка);
	ПолучитьДанныеДляРасчета(МВТ,ЛОЖЬ,Ложь,"энргНачисление");
	Возврат РассчитатьИндивидуальныйОбъемПотребления(МВТ);
КонецФункции

Процедура ОбработатьРезультатЗапросаНачислений(РезультатЗапроса, Делегат)
	
	Перем ТекПериодНачисления, ТекОрганизация, ТекРайон, ТекСтроение,ТекМКД,ТекПомещениеРодитель,ТекПомещение,ТекТочкаУчета, ТекНачалоПериода,
	ТекКонецПериода, ГраницыПериодаНачисления, АктуальныеЗначенияПотерь, ТекИндексСтрокиНабора, ТекИндексСтрокиНабораПомещений;
	
	Ошибки 										= "";
	ИнформацияДляОшибки							= "";
	Выборка  									= РезультатЗапроса.выбрать();
	
	ТекЧастныйСектор							= Ложь;
	ТекИндексСтрокиНабора						= -1;
	ТекИндексСтрокиНабораПомещений				= -1;
	НачисленияПоУслугам 						= Новый Соответствие;
	НачисленияПоУслугамПомещения 				= Новый Соответствие;
	ПлощадиПомещенийПоУслугам 					= Новый Соответствие;
		
	ПараметрыРаспределенияОбъемаПомещения 		= Новый Соответствие;
	ПересчитатьСтрокиПоФормуле 					= Новый Соответствие;
	ДеревоТочекУчета 							= Новый Соответствие;
	ОстатокСоциальнойНормы 						= Новый Соответствие;
	ОбъемыПомещенийССоглашением 				= Новый Соответствие;
	ЗаписиСтороннихПоставщиков					= Новый Массив;
		
	Набор 										= Неопределено;
	НаборОбъемПомещений 						= Неопределено;
	КлючиЗаписиРезультатаЗапроса				= КлючиЗаписиРезультатаЗапроса(РезультатЗапроса);
	
	РазделенныеЛицевыеСчета 				= Новый Соответствие;

	НачисленияПоУслугамПомещенияРазделенныеЛС 			= Новый Соответствие;
	ПлощадиПомещенийПоУслугамРазделенныеЛС 				= Новый Соответствие;

	Всего = Выборка.Количество();
	Если Всего = 0 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Делегат, "МассивПомещений") И ЗначениеЗаполнено(Делегат.МассивПомещений) Тогда
		// только индивидуальные, которые в результате дали нулевое начисление
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(энргОбъемНачислений.Регистратор) КАК Регистратор
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.Помещение В(&Помещения)
		|	И энргОбъемНачислений.Строение = &Строение
		|	И энргОбъемНачислений.Организация = &Организация
		|	И энргОбъемНачислений.Район = &Район
		|	И энргОбъемНачислений.ПериодРасчета = &ПериодРасчета
		|	И энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргНачисление";
		
		Запрос.УстановитьПараметр("Организация",	Делегат.Организация);
		Запрос.УстановитьПараметр("Район",			Делегат.Район);
		Запрос.УстановитьПараметр("Помещения",		Делегат.МассивПомещений);
		Запрос.УстановитьПараметр("Строение",		Делегат.Строение);
		Запрос.УстановитьПараметр("ПериодРасчета",	Делегат.ПериодНачисления);
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать();
		Если ВыборкаДокументов.Следующий() и ЗначениеЗаполнено(ВыборкаДокументов.Регистратор) Тогда 
			НаборОбъемНачислений = РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписейСОтборомПоРегистратору(ВыборкаДокументов.Регистратор);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("Организация",						Делегат.Организация);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("Район",							Делегат.Район);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("ПериодНачисления",				Делегат.ПериодНачисления);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("ЧастныйСектор",					Делегат.ЧастныйСектор);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("МКД",								?(Делегат.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка(), Делегат.Строение));
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("ДатаРегистратора",				Делегат.ПериодНачисления);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("ДокРегистратор",					ВыборкаДокументов.Регистратор);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("Строение",						Делегат.Строение);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("Помещение",						Делегат.МассивПомещений);
			НаборОбъемНачислений.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых",	Истина);
			
			РегистрыНакопления.энргОбъемНачислений.ПрочитатьЗаписиПоПомещениюДоЗаписи(НаборОбъемНачислений);
			
			НаборОбъемНачислений.Записать(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ПриоритетыВидовДифференцированности = РегистрыСведений.энргПриоритетыВидовДифференцированности.ПолучитьПриоритетыВидовДифференцированности();
	СоставляющиеТарифныхЗон 			= РегистрыСведений.энргСоставляющиеТарифныхЗон.ПолучитьСоставляющиеТарифныхЗон();
	
	Итерация			= 0;
	КоличествоИтераций 	= Итерация;
	КолвоСообщений		= Цел(Всего / 10);
	Постфикс 			= " из " + Всего;
	РайонПредставление	= Делегат.Район.Наименование;
 	Пока Выборка.следующий() цикл
		// Потомки помещения
		Если НЕ ТекПериодНачисления = Выборка.ПериодНачисления
			ИЛИ НЕ ТекПомещениеРодитель = Выборка.ПомещениеРодитель Тогда
			Если Не ТекПомещениеРодитель = Неопределено Тогда
				ПереопределитьТарифныеЗоныПоПриоритетуДифференцированности(НачисленияПоУслугамПомещения, ПараметрыРаспределенияОбъемаПомещения, ПриоритетыВидовДифференцированности, СоставляющиеТарифныхЗон);
				РассчитатьДельтуРаспределения(НачисленияПоУслугамПомещения, ПараметрыРаспределенияОбъемаПомещения);
				ПересчитатьСтрокиНачисление(Набор, НаборОбъемПомещений, НачисленияПоУслугамПомещения, ПлощадиПомещенийПоУслугам, ПараметрыРаспределенияОбъемаПомещения, ОстатокСоциальнойНормы, Ошибки, ИнформацияДляОшибки, РазделенныеЛицевыеСчета, НачисленияПоУслугамПомещенияРазделенныеЛС, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора);
			КонецЕсли;
			ПараметрыРаспределенияОбъемаПомещения 	= Новый Соответствие;
			ПлощадиПомещенийПоУслугам 				= Новый Соответствие;
			НачисленияПоУслугамПомещения 			= Новый Соответствие;			
		КонецЕсли;
		
			// Помещение
		Если НЕ ТекПериодНачисления = Выборка.ПериодНачисления
			ИЛИ НЕ ТекЧастныйСектор = Выборка.ЧастныйСектор
			ИЛИ НЕ ТекСтроение = Выборка.Строение
			ИЛИ НЕ ТекПомещение = Выборка.Помещение Тогда
			Если НЕ ТекПериодНачисления = Неопределено Тогда
				РассчитатьДеревоТочекУчета(ДеревоТочекУчета, Набор, НаборОбъемПомещений, ОстатокСоциальнойНормы, Ошибки, ИнформацияДляОшибки);									
			КонецЕсли;			
			ДеревоТочекУчета 					= Новый Соответствие;			
		КонецЕсли;		
		
		// Помещение в рамках периода
		Если НЕ ТекПериодНачисления = Выборка.ПериодНачисления
			ИЛИ НЕ ТекЧастныйСектор = Выборка.ЧастныйСектор
			ИЛИ НЕ ТекСтроение = Выборка.Строение
			ИЛИ НЕ ТекПомещение = Выборка.Помещение
			ИЛИ НЕ ТекНачалоПериода = Выборка.НачалоПериода
			ИЛИ НЕ ТекКонецПериода = Выборка.КонецПериода Тогда			
			НачисленияПоУслугам 				= Новый Соответствие;	
			
		КонецЕсли;		
		 		
		Если НЕ ТекПериодНачисления = Выборка.ПериодНачисления			
			ИЛИ НЕ ТекМКД = Выборка.МКД Тогда			
			Если НЕ ТекМКД = Неопределено Тогда				
				ПересчитатьСтрокиПоФормуле(Набор, НаборОбъемПомещений, ПересчитатьСтрокиПоФормуле);				
				ПересчитатьСоциальнуюНорму(Набор, НаборОбъемПомещений, ОстатокСоциальнойНормы, ТекИндексСтрокиНабора, ТекИндексСтрокиНабораПомещений);				
				//ЗаписатьНаборыЗаписейНачисление(ДокументОбъект, Набор, НаборВыполненные, НаборОбъемПомещений, Ошибки);
				УдалитьЗаписиСторонихПоставщиков(ЗаписиСтороннихПоставщиков, Набор, ТекИндексСтрокиНабора);				
				Делегат.ПослеПроведенияМКД(Ошибки);
			КонецЕсли;
			ЗаписиСтороннихПоставщиков			= Новый Массив;
			ДокументОбъект  					= Неопределено;			
			Делегат.ПередПроведениемМКД(Выборка.МКД,Выборка.ДокументНачисления, Выборка.ДокументНачисленияПометкаУдаления, ТекИндексСтрокиНабора, ТекИндексСтрокиНабораПомещений);
			Набор 								= Делегат.НаборОбъемНачислений;
			НаборОбъемПомещений 				= Делегат.НаборОбъемНачисленийПомещений;
			ТекИндексСтрокиНабора				= Набор.Количество() - 1;
			ТекИндексСтрокиНабораПомещений		= НаборОбъемПомещений.Количество() - 1;
			Набор.ДополнительныеСвойства.Вставить("ТекИндексСтрокиНабора",							ТекИндексСтрокиНабора + 1);
			НаборОбъемПомещений.ДополнительныеСвойства.Вставить("ТекИндексСтрокиНабораПомещений",	ТекИндексСтрокиНабораПомещений + 1);

			
			//ПрочитатьНаборыЗаписейНачисление(Выборка, ДокументОбъект, Помещение, Набор, НаборОбъемПомещений, НаборВыполненные, Перечисления.энргВидыОперацийНачисления.Индивидуальные);
			ПересчитатьТехническиеТочки			= Новый Массив;
			ПересчитатьТехническиеТочкиПомещ	= Новый Массив;
			ПересчитатьСтрокиПоФормуле 			= Новый Соответствие;
			ОстатокСоциальнойНормы 				= Новый Соответствие;
			РазделенныеЛицевыеСчета 			= Новый Соответствие;			

		КонецЕсли; 				
		
		ДанныеВыборки 								= Новый Структура(КлючиЗаписиРезультатаЗапроса);
		ЗаполнитьЗначенияСвойств(ДанныеВыборки, Выборка);
		
		Если ЗначениеЗаполнено(Выборка.ПомещениеРодитель) И Выборка.ПомещениеРодитель <> Выборка.Помещение Тогда
			ЗаполнитьНачисленияПоУслугамПомещенияРазделенныеЛС(ДанныеВыборки, НачисленияПоУслугамПомещенияРазделенныеЛС);
			ЗаполнитьРазделенныеЛицевыеСчетаПомещения(ДанныеВыборки, РазделенныеЛицевыеСчета);
		КонецЕсли;

		ЗаполнитьНачисленияПоУслугамПомещения(ДанныеВыборки, НачисленияПоУслугамПомещения);
		ЗаполнитьНаборыЗаписейНачисление(Выборка, Набор, НаборОбъемПомещений, НачисленияПоУслугам, НачисленияПоУслугамПомещения, ПлощадиПомещенийПоУслугам, ПересчитатьСтрокиПоФормуле, ПересчитатьТехническиеТочки, ПересчитатьТехническиеТочкиПомещ, ДеревоТочекУчета, ОстатокСоциальнойНормы, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора, ТекИндексСтрокиНабораПомещений);
		ЗаполнитьПараметрыРаспределенияОбъемаПомещения(ДанныеВыборки, ПараметрыРаспределенияОбъемаПомещения, ПриоритетыВидовДифференцированности);
		ИзменитьОстатокОбъемаКРаспределениюВПомещении(ДанныеВыборки, НачисленияПоУслугамПомещения);

		ТекОрганизация 							= Выборка.Организация;
		ТекПериодНачисления 					= Выборка.ПериодНачисления;
		ТекРайон 								= Выборка.Район;
		ТекМКД 									= Выборка.МКД;
		ТекЧастныйСектор						= Выборка.ЧастныйСектор;
		ТекСтроение								= Выборка.Строение;
		ТекПомещениеРодитель 					= Выборка.ПомещениеРодитель;
		ТекПомещение							= Выборка.Помещение;
		ТекТочкаУчета							= Выборка.ТочкаУчета;
		ТекНачалоПериода						= Выборка.НачалоПериода;
		ТекКонецПериода 						= Выборка.КонецПериода;
		ТекЗавершениеОП 						= Выборка.ЗавершениеОП;
		ИнформацияДляОшибки = "Остановились на строении '" + Выборка.СтроениеПредставление + "'" + ?(ЗначениеЗаполнено(Выборка.Помещение)," и помещении '" + Выборка.ПомещениеПредставление + "'", "");		
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Итерация / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Расчет начислений на физ.лиц по району " + РайонПредставление + " : " + Итерация + Постфикс);			
			КоличествоИтераций = 0;
		КонецЕсли;
		
		Итерация = Итерация + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;	
	
	Если НЕ ТекПериодНачисления = Неопределено Тогда 
		РассчитатьДеревоТочекУчета(ДеревоТочекУчета, Набор, НаборОбъемПомещений, ОстатокСоциальнойНормы, Ошибки, ИнформацияДляОшибки);
		ПереопределитьТарифныеЗоныПоПриоритетуДифференцированности(НачисленияПоУслугамПомещения, ПараметрыРаспределенияОбъемаПомещения, ПриоритетыВидовДифференцированности, СоставляющиеТарифныхЗон);
		РассчитатьДельтуРаспределения(НачисленияПоУслугамПомещения, ПараметрыРаспределенияОбъемаПомещения);
		ПересчитатьСтрокиНачисление(Набор, НаборОбъемПомещений, НачисленияПоУслугамПомещения, ПлощадиПомещенийПоУслугам, ПараметрыРаспределенияОбъемаПомещения, ОстатокСоциальнойНормы, Ошибки, ИнформацияДляОшибки, РазделенныеЛицевыеСчета, НачисленияПоУслугамПомещенияРазделенныеЛС, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора);
		ПересчитатьСтрокиПоФормуле(Набор, НаборОбъемПомещений, ПересчитатьСтрокиПоФормуле);
		ПересчитатьСоциальнуюНорму(Набор, НаборОбъемПомещений, ОстатокСоциальнойНормы, ТекИндексСтрокиНабора, ТекИндексСтрокиНабораПомещений);			
		УдалитьЗаписиСторонихПоставщиков(ЗаписиСтороннихПоставщиков, Набор, ТекИндексСтрокиНабора);
	КонецЕсли; 	

	Если Не ТекМКД = Неопределено Тогда
		Делегат.ПослеПроведенияМКД(Ошибки);
	КонецЕсли;
		
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЗаписиСторонихПоставщиков(Знач ЗаписиСтороннихПоставщиков, Набор, ТекИндексСтрокиНабора)
	
	Перем СтрокаНабора, Сч;
	
	Для Сч = 0 По ЗаписиСтороннихПоставщиков.ВГраница() Цикл
		СтрокаНабора 				 	= Набор.Получить(ЗаписиСтороннихПоставщиков[Сч]);
 		Набор.Удалить(СтрокаНабора);
		ТекИндексСтрокиНабора			= ТекИндексСтрокиНабора - 1;
	КонецЦикла;

КонецПроцедуры

Процедура ПересчитатьСтрокиНачисление(Набор, НаборОбъемПомещений, НачисленияПоУслугамПомещения, ПлощадиПомещенийПоУслугам, ПараметрыРаспределенияОбъемаПомещения, ОстатокСоциальнойНормы, Ошибки, ИнформацияДляОшибки, РазделенныеЛицевыеСчета, НачисленияПоУслугамПомещенияРазделенныеЛС, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора)
	
	Попытка
		Для Каждого КлючЗначениеСоставнаяУслуга Из НачисленияПоУслугамПомещения Цикл			
			Для Каждого КлючЗначениеУслуга Из КлючЗначениеСоставнаяУслуга.Значение Цикл			
				Для Каждого КлючЗначениеНачалоПериода Из КлючЗначениеУслуга.Значение Цикл
					Для Каждого КлючЗначениеТарифнаяЗона Из КлючЗначениеНачалоПериода.Значение Цикл
						ЗначениеСтруктуры 									= КлючЗначениеТарифнаяЗона.Значение;						
						ЗначениеСтруктуры.Вставить("РаспределилиОбъемУслугиОстаток",				ЗначениеСтруктуры.ОбъемУслугиОстаток);
						ЗначениеСтруктуры.Вставить("РаспределилиОбъемУслугиПотребленныйОстаток", 	ЗначениеСтруктуры.ОбъемУслугиПотребленныйОстаток);
						ЗначениеСтруктуры.Вставить("СоставнаяУслуга",								КлючЗначениеСоставнаяУслуга.Ключ);
						ЗначениеСтруктуры.Вставить("Услуга",										КлючЗначениеУслуга.Ключ);
						ЗначениеСтруктуры.Вставить("ТарифнаяЗона",									КлючЗначениеТарифнаяЗона.Ключ);
						ЗначениеСтруктуры.Вставить("НачалоПериода",									КлючЗначениеНачалоПериода.Ключ);
						ЗначениеСтруктуры.Вставить("ПлощадиПомещенийПоУслугам",						ПлощадиПомещенийПоУслугам);
						
						ПомещенияСОстаткомРаспределения 					= Новый Массив;
						
						РаспредеделитьОбъемПомещенияПоУслугеНаПотомков(Набор, ЗначениеСтруктуры, ПараметрыРаспределенияОбъемаПомещения,  ПомещенияСОстаткомРаспределения, ПлощадиПомещенийПоУслугам, РазделенныеЛицевыеСчета, НачисленияПоУслугамПомещенияРазделенныеЛС, ЗаписиСтороннихПоставщиков, Ложь, ТекИндексСтрокиНабора);
						РаспредеделитьОбъемПомещенияПоУслугеНаПотомков(Набор, ЗначениеСтруктуры, ПараметрыРаспределенияОбъемаПомещения,  ПомещенияСОстаткомРаспределения, ПлощадиПомещенийПоУслугам, РазделенныеЛицевыеСчета, НачисленияПоУслугамПомещенияРазделенныеЛС, ЗаписиСтороннихПоставщиков, Истина, ТекИндексСтрокиНабора);
						
						РаспределитьОстатокНаПомещенияСоСпособомРаспределенияОстаток(Набор, ЗначениеСтруктуры,ПомещенияСОстаткомРаспределения,ПараметрыРаспределенияОбъемаПомещения, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора);
					КонецЦикла;					
				КонецЦикла;
			КонецЦикла;	
		КонецЦикла;
	Исключение
		ИнформацияОбОшибке  													= ИнформацияОбОшибке();
		Ошибки 																	=
		Ошибки + Символы.ПС + ИнформацияДляОшибки + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
КонецПроцедуры

Процедура ПересчитатьСтрокиПоФормуле(Набор, НаборОбъемПомещений, ПересчитатьСтрокиПоФормуле)
	
	СпособПоФормуле 												= Перечисления.энргСпособНачислений.ПоФормуламРасчета;
	СпособПоПриборам 												= Перечисления.энргСпособНачислений.ПоПриборам;
	СпособПоСреднему 												= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	СпособПоНормативу	 											= Перечисления.энргСпособНачислений.ПоНормативу;
	
	Для Каждого СтрокаПоФормуле Из ПересчитатьСтрокиПоФормуле Цикл 																			 
		Для Каждого СтрокаПериод Из СтрокаПоФормуле.Значение Цикл
			ОбъемУслуги 											= 0;
			ОбъемУслугиПотребленный 								= 0;
			ПараметрыФормулы 										= СтрокаПериод.Значение.ПараметрыФормулы;
			ПрименятьФормулуВсегда 									= СтрокаПериод.Значение.ПрименятьФормулуВсегда;
			НачисленияПоУслугам 									= Новый Соответствие;			
			ВсеНачисленияПоПрибору 									= Истина;
			ЕстьРасходПоПриборуПоВсемТочкам 						= Истина;
			
			Для Каждого ПараметрФормулы Из ПараметрыФормулы Цикл
				//Если НЕ мТочкиУчета.Найти(ПараметрФормулы.ТочкаУчета) = Неопределено Тогда
				//	Продолжить;
				//КонецЕсли;
				Если Не ПрименятьФормулуВсегда И НЕ ПараметрФормулы.СпособНачисления  = СпособПоПриборам
					И НЕ ПараметрФормулы.СпособНачисления  = СпособПоСреднему Тогда
					ЕстьРасходПоПриборуПоВсемТочкам 				= Ложь;
				КонецЕсли;
				
				Если НЕ ПараметрФормулы.СпособНачисления  = СпособПоПриборам Тогда
					// чтобы снять этот объем когда придут все показания
					ВсеНачисленияПоПрибору 							= Ложь;
					яСтрокаНабора 									= Набор.Получить(ПараметрФормулы.ИндексСтроки);
					яСтрокаНабора.СниматьНачисленныйСредний 		= Истина;
				КонецЕсли;
				
				Если НачисленияПоУслугам[ПараметрФормулы.Услуга] = Неопределено Тогда
					НачисленияПоУслугам.Вставить(ПараметрФормулы.Услуга, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный,ВсеНачисленияПоПрибору,ЕстьРасходПоПриборуПоВсемТочкам",0,0,Ложь,Ложь));
				КонецЕсли;  				
				НачисленияПоУслугам[ПараметрФормулы.Услуга].ЕстьРасходПоПриборуПоВсемТочкам = ЕстьРасходПоПриборуПоВсемТочкам;
				НачисленияПоУслугам[ПараметрФормулы.Услуга].ВсеНачисленияПоПрибору 			= ВсеНачисленияПоПрибору;
				НачисленияПоУслугам[ПараметрФормулы.Услуга].ОбъемУслуги 					= НачисленияПоУслугам[ПараметрФормулы.Услуга].ОбъемУслуги + ПараметрФормулы.ОбъемУслуги * ПараметрФормулы.КоэффициентФормула;
				НачисленияПоУслугам[ПараметрФормулы.Услуга].ОбъемУслугиПотребленный			= НачисленияПоУслугам[ПараметрФормулы.Услуга].ОбъемУслугиПотребленный + ПараметрФормулы.ОбъемУслугиПотребленный * ПараметрФормулы.КоэффициентФормула;
				///мТочкиУчета.Добавить(ПараметрФормулы.ТочкаУчета);
			КонецЦикла;
			
			Если НЕ ВсеНачисленияПоПрибору Тогда				
				Для Каждого ПараметрФормулы Из ПараметрыФормулы Цикл					
					яСтрокаНабора 										= Набор.Получить(ПараметрФормулы.ИндексСтроки);
					яСтрокаНабора.СниматьНачисленныйСреднийПоФормулам	= Истина;
				КонецЦикла;				
			КонецЕсли; 			
			
			ИндексыСтрок 											= СтрокаПериод.Значение.ИндексыСтрок;
			
			Для Сч = 0 По ИндексыСтрок.ВГраница() Цикл
				СтрокаНабора 										= Набор.Получить(ИндексыСтрок[Сч]);
				Если НачисленияПоУслугам[СтрокаНабора.Услуга] = Неопределено И НЕ ПрименятьФормулуВсегда Тогда
					Продолжить;
				КонецЕсли;

				ОбъемУслугиБыло 									= СтрокаНабора.ОбъемУслуги;
				ОбъемУслугиПотребленныйБыло 						= СтрокаНабора.ОбъемУслугиПотребленный;
				СтрокаНабора.ОбъемУслуги							= 0;				
				СтрокаНабора.ОбъемУслугиПотребленный				= 0;
				Если НЕ ПрименятьФормулуВсегда И НЕ ЕстьРасходПоПриборуПоВсемТочкам И ЗначениеЗаполнено(СтрокаНабора.ЗависитОтУслуги) Тогда
					СтрокаНабора.СпособНачисления 					= СпособПоФормуле;
					ОбъемУслуги 									= 0;
					ОбъемУслугиПотребленный 						= 0;
				    ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ВсеНачисленияПоПрибору;					
				ИначеЕсли НЕ ПрименятьФормулуВсегда И НЕ ЕстьРасходПоПриборуПоВсемТочкам Тогда
					СтрокаНабора.СпособНачисления 					= СпособПоНормативу;
					ОбъемУслуги 									= РассчитатьОбъемУслугиСтроктНабораПоНормативу(СтрокаНабора);
					ОбъемУслугиПотребленный 						= 0;
				    ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.Услуга].ВсеНачисленияПоПрибору;					
				ИначеЕсли ЗначениеЗаполнено(СтрокаНабора.ЗависитОтУслуги) и ЗначениеЗаполнено(НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги]) Тогда
					ОбъемУслуги 									= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ОбъемУслуги;
					ОбъемУслугиПотребленный 						= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ОбъемУслугиПотребленный;
					ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ВсеНачисленияПоПрибору;
					СтрокаНабора.СпособНачисления 					= СпособПоФормуле;
				ИначеЕсли ЗначениеЗаполнено(НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги]) Тогда 	
					ОбъемУслуги 									= НачисленияПоУслугам[СтрокаНабора.Услуга].ОбъемУслуги;
					ОбъемУслугиПотребленный 						= НачисленияПоУслугам[СтрокаНабора.Услуга].ОбъемУслугиПотребленный;
					ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.Услуга].ВсеНачисленияПоПрибору;
					СтрокаНабора.СпособНачисления 					= СпособПоФормуле;
				ИначеЕсли ЕстьРасходПоПриборуПоВсемТочкам И НЕ НачисленияПоУслугам[СтрокаНабора.Услуга] = Неопределено Тогда					
					ОбъемУслуги 									= НачисленияПоУслугам[СтрокаНабора.Услуга].ОбъемУслуги;
					ОбъемУслугиПотребленный 						= НачисленияПоУслугам[СтрокаНабора.Услуга].ОбъемУслугиПотребленный;
					ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.Услуга].ВсеНачисленияПоПрибору;
					СтрокаНабора.СпособНачисления 					= СпособПоФормуле;	
				Иначе
					ОбъемУслуги 									= 0;
					ОбъемУслугиПотребленный 						= 0;
					ВсеНачисленияПоПрибору 							= Ложь;
					СтрокаНабора.СпособНачисления 					= СпособПоФормуле;
				КонецЕсли;
				
				Если НЕ ОбъемУслугиБыло = 0 Тогда
					СтрокаНабора.ОбъемУслуги						= ОбъемУслуги;
				КонецЕсли;
				Если Не ОбъемУслугиПотребленныйБыло = 0 Тогда
					СтрокаНабора.ОбъемУслугиПотребленный			= ОбъемУслугиПотребленный;
				КонецЕсли;				
				СтрокаНабора.СуммаПоПовышенномуКоэффициенту			= 0;
				СтрокаНабора.ПовыщающийКоэффициент					= 0;
				СтрокаНабора.СниматьНачисленныйСредний 				= НЕ ВсеНачисленияПоПрибору;
				СтрокаНабора.СниматьНачисленныйСреднийЗависимыхТочек= НЕ ВсеНачисленияПоПрибору;
				СтрокаНабора.КоэффициентФормула 					= 1;
			КонецЦикла;
			
 			ИндексыСтрок 											= СтрокаПериод.Значение.ИндексыСтрокПомещений;
			
			Для Сч = 0 По ИндексыСтрок.ВГраница() Цикл
				СтрокаНабора 										= НаборОбъемПомещений.Получить(ИндексыСтрок[Сч]);
				ОбъемУслугиБыло 									= СтрокаНабора.ОбъемУслуги;
				ОбъемУслугиПотребленныйБыло 						= СтрокаНабора.ОбъемУслугиПотребленный;
				СтрокаНабора.ОбъемУслуги							= 0;				
				СтрокаНабора.ОбъемУслугиПотребленный				= 0;
				Если НЕ ПрименятьФормулуВсегда И НЕ ЕстьРасходПоПриборуПоВсемТочкам И ЗначениеЗаполнено(СтрокаНабора.ЗависитОтУслуги) Тогда
					ОбъемУслуги 									= 0;
					ОбъемУслугиПотребленный 						= 0;
				    ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ВсеНачисленияПоПрибору;
				ИначеЕсли НЕ ПрименятьФормулуВсегда И НЕ ЕстьРасходПоПриборуПоВсемТочкам Тогда
					ОбъемУслуги 									= 0;
					ОбъемУслугиПотребленный 						= 0;
				    ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.Услуга].ВсеНачисленияПоПрибору;
				ИначеЕсли ЗначениеЗаполнено(СтрокаНабора.ЗависитОтУслуги) и ЗначениеЗаполнено(НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги]) Тогда
					ОбъемУслуги 									= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ОбъемУслуги;
					ОбъемУслугиПотребленный 						= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ОбъемУслугиПотребленный;
					ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги].ВсеНачисленияПоПрибору;
				ИначеЕсли ЗначениеЗаполнено(НачисленияПоУслугам[СтрокаНабора.ЗависитОтУслуги]) Тогда					
					ОбъемУслуги 									= НачисленияПоУслугам[СтрокаНабора.Услуга].ОбъемУслуги;
					ОбъемУслугиПотребленный 						= НачисленияПоУслугам[СтрокаНабора.Услуга].ОбъемУслугиПотребленный;
					ВсеНачисленияПоПрибору 							= НачисленияПоУслугам[СтрокаНабора.Услуга].ВсеНачисленияПоПрибору;
				Иначе
					ОбъемУслуги 									= 0;
					ОбъемУслугиПотребленный 						= 0;
					ВсеНачисленияПоПрибору 							= Ложь;
				КонецЕсли;
				СтрокаНабора.СпособНачисления 						= СпособПоФормуле;
				Если НЕ ОбъемУслугиБыло = 0 Тогда
					СтрокаНабора.ОбъемУслуги						= ОбъемУслуги;
				КонецЕсли;
				Если Не ОбъемУслугиПотребленныйБыло = 0 Тогда
					СтрокаНабора.ОбъемУслугиПотребленный			= ОбъемУслугиПотребленный;
				КонецЕсли;
				СтрокаНабора.СуммаПоПовышенномуКоэффициенту			= 0;
				СтрокаНабора.ПовыщающийКоэффициент					= 0;			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаборыЗаписейНачисление(Выборка, Набор, НаборОбъемПомещений, НачисленияПоУслугам, НачисленияПоУслугамПомещения, ПлощадиПомещенийПоУслугам, ПересчитатьСтрокиПоФормуле, ПересчитатьТехническиеТочки, ПересчитатьТехническиеТочкиПомещения,ДеревоТочекУчета, ОстатокСоциальнойНормы, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора, ТекИндексСтрокиНабораПомещений)
	
	ВидНачисления 											= Перечисления.энргВидыНачислений.Начисление;	
	ЕстьСумма 												= Истина;
	ЕстьНачисления 											= Истина;
	КлючФормулы 											= "ИндексыСтрок,ИндексыСтрокПомещений,ПараметрыФормулы, ПрименятьФормулуВсегда";
	КлючиПараметровФормулы 									= "ТочкаУчета,Услуга,КоэффициентФормула,ИндексСтроки,СпособНачисления,ОбъемУслуги,ОбъемУслугиПотребленный";
	ЕстьАбонент 											= Ложь;
	
	Если ЗначениеЗаполнено(Выборка.Абонент) И Выборка.ПомещениеРодитель = Выборка.Помещение Тогда		 
		СтрокНабора 										= Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
		СтрокНабора.ОбъемУслуги 							= Выборка.ОбъемУслуги;
		ЕстьАбонент 										= Истина;
		ТекИндексСтрокиНабора								= ТекИндексСтрокиНабора + 1;
		ИндексСтрокиНабора									= ТекИндексСтрокиНабора;
	ИначеЕсли  ЗначениеЗаполнено(Выборка.Абонент) Тогда
		СтрокНабора 										= Набор.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
		ЕстьАбонент 										= Истина;	
		ТекИндексСтрокиНабора								= ТекИндексСтрокиНабора + 1;
		ИндексСтрокиНабора									= ТекИндексСтрокиНабора;
	Иначе
		СтрокНабора 										= НаборОбъемПомещений.добавить();
		ЗаполнитьЗначенияСвойств(СтрокНабора,Выборка);
		СтрокНабора.Период									= Выборка.ЗавершениеОП-1;
		СтрокНабора.ВидНачисления 							= ВидНачисления;
		СтрокНабора.ПериодРасчета 							= Выборка.ПериодНачисления;
		ЕстьСумма 											= Ложь;	
		ТекИндексСтрокиНабораПомещений						= ТекИндексСтрокиНабораПомещений + 1;
		ИндексСтрокиНабора									= ТекИндексСтрокиНабораПомещений;
	КонецЕсли;	
	
	ИзменитьОстатокСоциальнойНормы(Выборка, ОстатокСоциальнойНормы, Набор, НаборОбъемПомещений, СтрокНабора, ИндексСтрокиНабора, ЕстьАбонент, НачисленияПоУслугам);
	
	// Начисления поставщиков из РС "Поставщики не начислять"
	Если ЕстьАбонент И Выборка.УдалитьЗапись Тогда
		ЗаписиСтороннихПоставщиков.Вставить(0, ИндексСтрокиНабора);
		СтрокНабора.ПоставщикиНеНачислять = Выборка.УдалитьЗапись;
	КонецЕсли;
	
	Если Выборка.ЭтоПростаяТочкаУчета Тогда		
		// закрытая схема
		Если Выборка.ЗакрытаяСхемаГВС Тогда
			СтрокНабора.ОбъемУслуги 							= 0;
			СтрокНабора.Сумма 									= 0;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;

			
	Если Выборка.ПомещениеРодитель = Выборка.Помещение И ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) И НЕ Выборка.РасчетПоФормуле И НЕ ЗначениеЗаполнено(Выборка.ЗависимаяТочкаУчета) Тогда
		ОбъемУслуги 										= 0;
		ОбъемУслугиПотребленный								= 0;
		СниматьНачисленныйСредний							= Выборка.СниматьНачисленныйСредний;
		
		Если НЕ НачисленияПоУслугам.Получить(Выборка.ТочкаУчета) = Неопределено 
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги] = Неопределено
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона] = Неопределено
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления] = Неопределено Тогда 
			Если НЕ СтрокНабора.ОбъемУслуги = 0 Тогда
				ОбъемУслуги 								= НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслуги;
			КонецЕсли;
			
			Если НЕ СтрокНабора.ОбъемУслугиПотребленный = 0 Тогда
				ОбъемУслугиПотребленный 					= НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслугиПотребленный;
			КонецЕсли;
			
			Если Не Выборка.НеПрименятьЗависимостьЕслиБольшеОднойТочки Тогда
				СниматьНачисленныйСредний						= НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].СниматьНачисленныйСредний;
			КонецЕсли;
		КонецЕсли;	
		    
		ОбъемУслуги 										= ОбъемУслуги * ?(Выборка.УмножатьНаНормуРодительскойУслуги,Выборка.НормаПотребления,1);
		ОбъемУслугиПотребленный 							= ОбъемУслугиПотребленный * ?(Выборка.УмножатьНаНормуРодительскойУслуги,Выборка.НормаПотребления,1);
				
		СтрокНабора.ОбъемУслуги 							= ОбъемУслуги;
		СтрокНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный;                 
		СтрокНабора.СниматьНачисленныйСредний 				= СниматьНачисленныйСредний;
						
		ОбъемУслугиПоПриборуПоСтроке 						= 0;
		ОбъемУслугиПотребленныйПоПриборуПоСтроке 			= 0;
		ОбъемУслугиБезПрибораПоСтроке 						= 0;
		ОбъемУслугиПотребленныйБезПрибораПоСтроке 			= 0;
				
		Если СтрокНабора.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам 
			ИЛИ СтрокНабора.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
			ОбъемУслугиПоПриборуПоСтроке 					= СтрокНабора.ОбъемУслуги;
			ОбъемУслугиПотребленныйПоПриборуПоСтроке		= СтрокНабора.ОбъемУслугиПотребленный;
		Иначе
			ОбъемУслугиБезПрибораПоСтроке 					= СтрокНабора.ОбъемУслуги;
			ОбъемУслугиПотребленныйБезПрибораПоСтроке 		= СтрокНабора.ОбъемУслугиПотребленный;
		КонецЕсли;
		
		ОбъемУслугиПоПрибору 								= 0;
		ОбъемУслугиПотребленныйПоПрибору 					= 0;
		ОбъемУслугиБезПрибора 								= 0;
		ОбъемУслугиПотребленныйБезПрибора 					= 0;
		
		Если Выборка.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам 
			ИЛИ Выборка.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
			ОбъемУслугиПоПрибору 							= Выборка.ОбъемУслуги;
			ОбъемУслугиПотребленныйПоПрибору 				= Выборка.ОбъемУслугиПотребленный;
		Иначе
			ОбъемУслугиБезПрибора 							= Выборка.ОбъемУслуги;
			ОбъемУслугиПотребленныйБезПрибора 				= Выборка.ОбъемУслугиПотребленный;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.Абонент) Тогда				
			НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслуги 							= НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслуги + СтрокНабора.ОбъемУслуги - Выборка.ОбъемУслуги;
			НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный 				= НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленный + СтрокНабора.ОбъемУслугиПотребленный - Выборка.ОбъемУслугиПотребленный;
			
			НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПоПрибору 				= НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПоПрибору + ОбъемУслугиПоПриборуПоСтроке - ОбъемУслугиПоПрибору;
			НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйПоПрибору 	= НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйПоПрибору + ОбъемУслугиПотребленныйПоПриборуПоСтроке - ОбъемУслугиПотребленныйПоПрибору;
			НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиБезПрибора 				= НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиБезПрибора + ОбъемУслугиБезПрибораПоСтроке - ОбъемУслугиБезПрибора;
			НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйБезПрибора 	= НачисленияПоУслугамПомещения[Выборка.СоставнаяУслуга][Выборка.Услуга][Выборка.НачалоПериода][Выборка.ТарифнаяЗона].ОбъемУслугиПотребленныйБезПрибора + ОбъемУслугиПотребленныйБезПрибораПоСтроке - ОбъемУслугиПотребленныйБезПрибора;			
		КонецЕсли;	  
	КонецЕсли; 
			
	Если Выборка.РасчетПоФормуле Тогда
		Если НЕ ПересчитатьСтрокиПоФормуле[Выборка.ТочкаУчета] = Неопределено И НЕ ПересчитатьСтрокиПоФормуле[Выборка.ТочкаУчета][Выборка.НачалоПериода] = Неопределено Тогда
			Если ЕстьАбонент Тогда
				ПересчитатьСтрокиПоФормуле[Выборка.ТочкаУчета][Выборка.НачалоПериода].ИндексыСтрок.Добавить(ИндексСтрокиНабора);
			Иначе
				ПересчитатьСтрокиПоФормуле[Выборка.ТочкаУчета][Выборка.НачалоПериода].ИндексыСтрокПомещений.Добавить(ТекИндексСтрокиНабораПомещений);				
			КонецЕсли;			
		ИначеЕсли НЕ ПересчитатьСтрокиПоФормуле[Выборка.ТочкаУчета] = Неопределено Тогда
			ИндексыСтрок 									= Новый Массив;
			ИндексыСтрокПомещения 							= Новый Массив;
			Если ЕстьАбонент Тогда
				ИндексыСтрок.Добавить(ИндексСтрокиНабора);
			Иначе
				ИндексыСтрокПомещения.Добавить(ТекИндексСтрокиНабораПомещений);
			КонецЕсли;
			ПересчитатьСтрокиПоФормуле[Выборка.ТочкаУчета].Вставить(Выборка.НачалоПериода, Новый Структура(КлючФормулы, ИндексыСтрок,ИндексыСтрокПомещения,Новый Массив, Выборка.ПрименятьФормулуВсегда));
		Иначе			
			ИндексыСтрок 									= Новый Массив;
			ИндексыСтрокПомещения 							= Новый Массив;			
			Если ЕстьАбонент Тогда
				ИндексыСтрок.Добавить(ИндексСтрокиНабора);
			Иначе
				ИндексыСтрокПомещения.Добавить(ТекИндексСтрокиНабораПомещений);
			КонецЕсли;			
			СоотвествиеПериод 								= Новый Соответствие;
			СоотвествиеПериод.Вставить(Выборка.НачалоПериода, Новый Структура(КлючФормулы, ИндексыСтрок,ИндексыСтрокПомещения,Новый Массив, Выборка.ПрименятьФормулуВсегда));
			ПересчитатьСтрокиПоФормуле.Вставить(Выборка.ТочкаУчета, СоотвествиеПериод);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ЗависимаяТочкаУчета) Тогда
		Если ПересчитатьСтрокиПоФормуле[Выборка.ЗависимаяТочкаУчета] = Неопределено Тогда
		    ИндексыСтрок 									= Новый Массив;
			ИндексыСтрокПомещения 							= Новый Массив;
			СоотвествиеПериод 								= Новый Соответствие;
			СоотвествиеПериод.Вставить(Выборка.НачалоПериода, Новый Структура(КлючФормулы, ИндексыСтрок,ИндексыСтрокПомещения,Новый Массив, Выборка.ПрименятьФормулуВсегда));
			ПересчитатьСтрокиПоФормуле.Вставить(Выборка.ЗависимаяТочкаУчета,СоотвествиеПериод);
		ИначеЕсли ПересчитатьСтрокиПоФормуле[Выборка.ЗависимаяТочкаУчета][Выборка.НачалоПериода] = Неопределено Тогда 				
			ИндексыСтрок 									= Новый Массив;
			ИндексыСтрокПомещения 							= Новый Массив; 			
			ПересчитатьСтрокиПоФормуле[Выборка.ЗависимаяТочкаУчета].Вставить(Выборка.НачалоПериода, Новый Структура(КлючФормулы, ИндексыСтрок,ИндексыСтрокПомещения,Новый Массив, Выборка.ПрименятьФормулуВсегда));				
		КонецЕсли;
		
		ПараметрФормулы 									= Новый Структура(КлючиПараметровФормулы);
		ПараметрФормулы.ТочкаУчета 							= Выборка.ТочкаУчета;
		ПараметрФормулы.Услуга 								= Выборка.Услуга;
		ПараметрФормулы.КоэффициентФормула					= Выборка.КоэффициентФормула;
		ПараметрФормулы.СпособНачисления					= Выборка.СпособНачисления;
		ПараметрФормулы.ОбъемУслуги 						= СтрокНабора.ОбъемУслуги;
		ПараметрФормулы.ОбъемУслугиПотребленный 			= СтрокНабора.ОбъемУслугиПотребленный;
		ПараметрФормулы.ИндексСтроки 						= ИндексСтрокиНабора;
		ПересчитатьСтрокиПоФормуле[Выборка.ЗависимаяТочкаУчета][Выборка.НачалоПериода].ПараметрыФормулы.Добавить(ПараметрФормулы);			
	КонецЕсли;
	
	Если НачисленияПоУслугам[Выборка.ТочкаУчета] = Неопределено Тогда
		СоотвествиеПоУслугам 								= Новый Соответствие;
		СоотвествиеПоШкалам 								= Новый Соответствие;
		СоотвествиеПоТарифнамЗонам 							= Новый Соответствие;
		СоотвествиеПоСпособам 								= Новый Соответствие;
		СоотвествиеПоСпособам.Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный,СниматьНачисленныйСредний,ЗначениеСоциальнойНормы", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный, Выборка.СниматьНачисленныйСредний, Выборка.ЗначениеСоциальнойНормы));
		СоотвествиеПоТарифнамЗонам.Вставить(Выборка.ТарифнаяЗона, СоотвествиеПоСпособам);
		СоотвествиеПоШкалам.Вставить(Выборка.Шкала, СоотвествиеПоТарифнамЗонам);
		СоотвествиеПоУслугам.Вставить(Выборка.Услуга, СоотвествиеПоШкалам);
		НачисленияПоУслугам.Вставить(Выборка.ТочкаУчета,СоотвествиеПоУслугам)
	ИначеЕсли НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга] = Неопределено Тогда
		СоотвествиеПоШкалам 								= Новый Соответствие;
		СоотвествиеПоТарифнамЗонам 							= Новый Соответствие;
		СоотвествиеПоСпособам 								= Новый Соответствие;
		СоотвествиеПоСпособам.Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный,СниматьНачисленныйСредний,ЗначениеСоциальнойНормы", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный, Выборка.СниматьНачисленныйСредний, Выборка.ЗначениеСоциальнойНормы));
		СоотвествиеПоТарифнамЗонам.Вставить(Выборка.ТарифнаяЗона, СоотвествиеПоСпособам);
		СоотвествиеПоШкалам.Вставить(Выборка.Шкала, СоотвествиеПоТарифнамЗонам);
		НачисленияПоУслугам[Выборка.ТочкаУчета].Вставить(Выборка.Услуга,СоотвествиеПоШкалам)
	ИначеЕсли НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала] = Неопределено Тогда
		СоотвествиеПоТарифнамЗонам 							= Новый Соответствие;
		СоотвествиеПоСпособам 								= Новый Соответствие;
		СоотвествиеПоСпособам.Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный,СниматьНачисленныйСредний,ЗначениеСоциальнойНормы", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный, Выборка.СниматьНачисленныйСредний, Выборка.ЗначениеСоциальнойНормы));
		СоотвествиеПоТарифнамЗонам.Вставить(Выборка.ТарифнаяЗона, СоотвествиеПоСпособам);
		НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга].Вставить(Выборка.Шкала, СоотвествиеПоТарифнамЗонам);
	ИначеЕсли НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона] = Неопределено Тогда
		СоотвествиеПоСпособам 								= Новый Соответствие;
		СоотвествиеПоСпособам.Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный,СниматьНачисленныйСредний,ЗначениеСоциальнойНормы", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный, Выборка.СниматьНачисленныйСредний, Выборка.ЗначениеСоциальнойНормы));
		НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала].Вставить(Выборка.ТарифнаяЗона, СоотвествиеПоСпособам);
	ИначеЕсли НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления] = Неопределено Тогда
		НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона].Вставить(Выборка.СпособНачисления, Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный,СниматьНачисленныйСредний,ЗначениеСоциальнойНормы", Выборка.ОбъемУслуги, Выборка.ОбъемУслугиПотребленный, Выборка.СниматьНачисленныйСредний, Выборка.ЗначениеСоциальнойНормы));
	Иначе	
		НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслуги = НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслуги + Выборка.ОбъемУслуги;
		НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслугиПотребленный = НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.Услуга][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ОбъемУслугиПотребленный + Выборка.ОбъемУслугиПотребленный;
	КонецЕсли; 		   		                                                 
	
	// Запоминаем значения площадей для того чтобы пересчитать объем коммунальных квартир		
	Если Выборка.ПорядокПомещения  = 0 Тогда
		// Если будут возникать ошибки суммарной площади (изменений в один день) исправить соотвествие на хранение площадей для каждого помещения
		НачалоПериода 			= НачалоДня(Выборка.НачалоПериода);
		Если ПлощадиПомещенийПоУслугам[Выборка.Услуга] = Неопределено Тогда
			ПлощадиПоПериодам  = Новый Соответствие;
			ПлощадиПоПериодам.Вставить(НачалоПериода, Новый Структура("Площадь,Помещения",Выборка.ЗначениеПлощади, Новый Массив));
			ПлощадиПоПериодам[НачалоПериода].Помещения.добавить(Выборка.Помещение);
			ПлощадиПомещенийПоУслугам.Вставить(Выборка.Услуга, ПлощадиПоПериодам);
		ИначеЕсли ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода] = Неопределено Тогда
			ПлощадиПомещенийПоУслугам[Выборка.Услуга].Вставить(НачалоПериода, Новый Структура("Площадь,Помещения",Выборка.ЗначениеПлощади, Новый Массив));
			ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Помещения.добавить(Выборка.Помещение);
		ИначеЕсли ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Помещения.Найти(Выборка.Помещение) = Неопределено Тогда 
			ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Площадь = ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Площадь + Выборка.ЗначениеПлощади;
			ПлощадиПомещенийПоУслугам[Выборка.Услуга][НачалоПериода].Помещения.добавить(Выборка.Помещение);
		КонецЕсли;
	КонецЕсли;		
	
	Если Выборка.Техническая и ЕстьАбонент Тогда
		ПересчитатьТехническиеТочки.Добавить(ИндексСтрокиНабора);
	ИначеЕсли Выборка.Техническая Тогда
		//ПересчитатьТехническиеТочкиПомещения.Добавить(НаборОбъемПомещений.Индекс(СтрокНабора));	
		ПересчитатьТехническиеТочкиПомещения.Добавить(ТекИндексСтрокиНабораПомещений);
	КонецЕсли;		
		
	Если ДеревоТочекУчета[Выборка.КонецПериода] = Неопределено Тогда
		СтрокиНабора  									= Новый Массив;
		СтрокиНабора.Добавить(ИндексСтрокиНабора);
		
		СоотвествиеУслуги 								= Новый Соответствие;
		СоотвествиеУслуги.Вставить(Выборка.Услуга, СтрокиНабора);
		
		СоотвествиеТочки 								= Новый Соответствие;
		СоотвествиеТочки.Вставить(Выборка.ТочкаУчета, СоотвествиеУслуги);
		
		ДанныеТочкиУчета 								= Новый Соответствие;
		ДанныеТочкиУчета.Вставить(Выборка.ТочкаУчетаРодитель, СоотвествиеТочки);		
		
		ДеревоТочекУчета.Вставить(Выборка.КонецПериода, ДанныеТочкиУчета);
	ИначеЕсли ДеревоТочекУчета[Выборка.КонецПериода][Выборка.ТочкаУчетаРодитель] = Неопределено Тогда		
		
		СтрокиНабора  									= Новый Массив;
		СтрокиНабора.Добавить(ИндексСтрокиНабора);
		
		СоотвествиеУслуги 								= Новый Соответствие;
		СоотвествиеУслуги.Вставить(Выборка.Услуга, СтрокиНабора);
		
		СоотвествиеТочки 								= Новый Соответствие;
		СоотвествиеТочки.Вставить(Выборка.ТочкаУчета, СоотвествиеУслуги);
				
		ДеревоТочекУчета[Выборка.КонецПериода].Вставить(Выборка.ТочкаУчетаРодитель, СоотвествиеТочки);
		
	ИначеЕсли ДеревоТочекУчета[Выборка.КонецПериода][Выборка.ТочкаУчетаРодитель][Выборка.ТочкаУчета] = Неопределено Тогда
		СтрокиНабора  									= Новый Массив;
		СтрокиНабора.Добавить(ИндексСтрокиНабора);
		
		СоотвествиеУслуги 								= Новый Соответствие;
		СоотвествиеУслуги.Вставить(Выборка.Услуга, СтрокиНабора);
				
		ДеревоТочекУчета[Выборка.КонецПериода][Выборка.ТочкаУчетаРодитель].Вставить(Выборка.ТочкаУчета, СоотвествиеУслуги);
		
	ИначеЕсли ДеревоТочекУчета[Выборка.КонецПериода][Выборка.ТочкаУчетаРодитель][Выборка.ТочкаУчета][Выборка.Услуга] = Неопределено Тогда
		СтрокиНабора  									= Новый Массив;
		СтрокиНабора.Добавить(ИндексСтрокиНабора);		
				
		ДеревоТочекУчета[Выборка.КонецПериода][Выборка.ТочкаУчетаРодитель][Выборка.ТочкаУчета].Вставить(Выборка.Услуга, СтрокиНабора);
	Иначе
		
		ДеревоТочекУчета[Выборка.КонецПериода][Выборка.ТочкаУчетаРодитель][Выборка.ТочкаУчета][Выборка.Услуга].Добавить(ИндексСтрокиНабора); 	
	КонецЕсли;
	
	// закрытая схема
	Если Выборка.ЗакрытаяСхемаГВС Тогда
		СтрокНабора.ОбъемУслуги 							= 0;
		СтрокНабора.Сумма 									= 0;
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьДеревоТочекУчета(ДеревоТочекУчета,Набор, НаборОбъемПомещений,ОстатокСоциальнойНормы, Ошибки, ИнформацияДляОшибки)
	
	Попытка
		Для Каждого КлючЗначениеПериод Из ДеревоТочекУчета Цикл
			Дерево  								= Новый Массив;
			
			Если КлючЗначениеПериод.Значение.Количество() = 1 Тогда
				Продолжить;
			КонецЕсли;	
			
			Для Каждого Вершины Из КлючЗначениеПериод.Значение Цикл
				Если ЗначениеЗаполнено(Вершины.Ключ) Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого КлючЗначение ИЗ Вершины.Значение Цикл 				
					Дерево.Добавить(Новый Структура("ТочкаУчета, Услуги, Потомки", КлючЗначение.Ключ, КлючЗначение.Значение, Новый Массив));					
				КонецЦикла;			
			КонецЦикла;
			
			Для Каждого Вершина Из Дерево Цикл 			
				ЗаполнитьДеревоТочекУчетаРекурсивно(КлючЗначениеПериод.Значение, Вершина.ТочкаУчета, Вершина.Потомки, Вершина.Услуги);		
			КонецЦикла;	
			
			Для Каждого Вершина Из Дерево Цикл
				
				Если Вершина.Потомки.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Для Каждого УслугаВершины из Вершина.Услуги Цикл 
					
					СтрокиНабора 													= УслугаВершины.Значение;
					ДанныеСтрокиНачислений 											= Набор.Получить(СтрокиНабора[0]);
					
					ОбщаяСуммаЗначениеСоциальнойНормы 								= 0; //"ЗначениеСоциальнойНормы" необходимо будет определять если у всей ветки "ОбщаяСуммаЗначениеСоциальнойНормы" больше 0
					ОбщееЗначениеСоциальнойНормыОбъемПотребленный 					= 0;
					ДанныеИспользованияСоцНормы										= ОпределитьОбщуюСуммуЗначениеСоциальнойНормыРекурсия(Набор, Вершина.Потомки, ОбщаяСуммаЗначениеСоциальнойНормы, ОбщееЗначениеСоциальнойНормыОбъемПотребленный, УслугаВершины.Ключ);		
					ПриборУчетаГоловнойТочкиВведен 									= ЗначениеЗаполнено(ДанныеСтрокиНачислений.ПриборУчета);
					Если (ДанныеСтрокиНачислений.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам
						ИЛИ ДанныеСтрокиНачислений.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему) Тогда
						
						ОчиститьОбъемУслугиТочекУчетаДереревоРекурсия(Набор, Вершина.Потомки, УслугаВершины.Ключ, ДанныеСтрокиНачислений);
						
						Для Сч = 0 По СтрокиНабора.ВГраница() Цикл
							ДанныеСтрокиНачислений 									= Набор.Получить(СтрокиНабора[Сч]);
							
							Если НЕ ДанныеСтрокиНачислений.ОбъемУслуги = 0 И НЕ ДанныеИспользованияСоцНормы.СоциальнаяНормаИспользуется Тогда 
								 ОстатокСоциальнойНормы[ДанныеСтрокиНачислений.КлючПомещения]
								[ДанныеСтрокиНачислений.Услуга]
								[ДанныеСтрокиНачислений.ЗависитОтУслуги]
								[ДанныеСтрокиНачислений.НаправлениеИспользованияТУ]
								.Остаток 											= -1;
							ИначеЕсли НЕ ДанныеСтрокиНачислений.ОбъемУслуги = 0 Тогда 
								ОстатокСоциальнойНормы[ДанныеСтрокиНачислений.КлючПомещения]
								[ДанныеСтрокиНачислений.Услуга]
								[ДанныеСтрокиНачислений.ЗависитОтУслуги]
								[ДанныеСтрокиНачислений.НаправлениеИспользованияТУ]
								.Остаток 											= ОбщаяСуммаЗначениеСоциальнойНормы;
							КонецЕсли;
							
							Если НЕ ДанныеСтрокиНачислений.ОбъемУслугиПотребленный = 0 И НЕ ДанныеИспользованияСоцНормы.СоциальнаяНормаПотребленныйИспользуется Тогда	
								ОстатокСоциальнойНормы[ДанныеСтрокиНачислений.КлючПомещения]
								[ДанныеСтрокиНачислений.Услуга]
								[ДанныеСтрокиНачислений.ЗависитОтУслуги]
								[ДанныеСтрокиНачислений.НаправлениеИспользованияТУ]
								.ОстатокПотребленный 								= -1;
							ИначеЕсли НЕ ДанныеСтрокиНачислений.ОбъемУслугиПотребленный = 0 Тогда
								ОстатокСоциальнойНормы[ДанныеСтрокиНачислений.КлючПомещения]
								[ДанныеСтрокиНачислений.Услуга]
								[ДанныеСтрокиНачислений.ЗависитОтУслуги]
								[ДанныеСтрокиНачислений.НаправлениеИспользованияТУ]
								.ОстатокПотребленный 								= ОбщееЗначениеСоциальнойНормыОбъемПотребленный;
							КонецЕсли; 
							
							Если НЕ ДанныеСтрокиНачислений.ОбъемУслуги  = 0 И НЕ ДанныеИспользованияСоцНормы.СоциальнаяНормаПотребленныйИспользуется Тогда
								ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы 		= 0;
							ИначеЕсли НЕ ДанныеСтрокиНачислений.ОбъемУслуги  = 0  Тогда
								ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы 		= ОбщаяСуммаЗначениеСоциальнойНормы;	
							КонецЕсли;
							
							Если НЕ ДанныеСтрокиНачислений.ОбъемУслугиПотребленный  = 0 И НЕ ДанныеИспользованияСоцНормы.СоциальнаяНормаПотребленныйИспользуется Тогда
								ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы 		= 0;
							ИначеЕсли НЕ ДанныеСтрокиНачислений.ОбъемУслугиПотребленный  = 0 Тогда
								ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы 		= ОбщееЗначениеСоциальнойНормыОбъемПотребленный;	
							КонецЕсли;
							
							Если ДанныеСтрокиНачислений.ОбъемУслуги  = 0 и ДанныеСтрокиНачислений.ОбъемУслугиПотребленный  = 0 Тогда
								ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы 		= 0;
							КонецЕсли;												
						КонецЦикла;
						
					Иначе
						
						Если ЗначениеЗаполнено(ДанныеСтрокиНачислений.ПриборУчета) Тогда
							УстановитьСниматьНачисленныйСреднийПотомковРекурсия(Набор, Вершина.Потомки, УслугаВершины.Ключ, ПриборУчетаГоловнойТочкиВведен);
						КонецЕсли;

						Для Сч  = 0 По СтрокиНабора.ВГраница() Цикл
							ДанныеСтрокиНачислений 									= Набор.Получить(СтрокиНабора[Сч]);
							ДанныеСтрокиНачислений.СпособНачисления 				= Перечисления.энргСпособНачислений.Расчетный; 					
							ДанныеСтрокиНачислений.ОбъемУслуги 						= 0;
							ДанныеСтрокиНачислений.СуммаПоПовышенномуКоэффициенту 	= 0;
							ДанныеСтрокиНачислений.Сумма 							= 0;
							
							ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы 			= 0;
							ДанныеСтрокиНачислений.ОбъемУслугиПотребленный			= 0;										
						КонецЦикла;
					КонецЕсли; 				
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	Исключение
		ИнформацияОбОшибке  					= ИнформацияОбОшибке();
		Ошибки 									= Ошибки +  
		Символы.ПС + ИнформацияДляОшибки + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
КонецПроцедуры

Процедура ПересчитатьСоциальнуюНорму(Набор, НаборОбъемПомещений, ОстатокСоциальнойНормы, ТекИндексСтрокиНабора, ТекИндексСтрокиНабораПомещений)
	  	
	Для Каждого КлючЗначениеПомещение Из ОстатокСоциальнойНормы Цикл		
		Для Каждого КлючЗначениеУслуга Из КлючЗначениеПомещение.Значение Цикл
			Для Каждого КлючЗначениеЗависитОтУслуги Из КлючЗначениеУслуга.Значение Цикл
				Для Каждого КлючЗначениеНаправление Из КлючЗначениеЗависитОтУслуги.Значение Цикл
					СтруктураСоциальнойНормы 							= КлючЗначениеНаправление.Значение;
					Если СтруктураСоциальнойНормы.Остаток < 0 Тогда
						Продолжить;
					КонецЕсли;			
					
					ИндексыСтрок 															= СтруктураСоциальнойНормы.ИндексыСтрок;
					ИндексыСтрокПомещения													= СтруктураСоциальнойНормы.ИндексыСтрокПомещения; 				
					
					СтрокиНабораОбъемСверхНормы 											= Новый Массив;
					СтрокиНабораОбъемПотребленныйСверхНормы 								= Новый Массив;
					ОписаниеСтрокиСверхНормы 												= "Индекс,ОбъемСверхНормы,НоваяСтрока";
					Для Сч = 0 По ИндексыСтрок.ВГраница() Цикл
						СтрокаНабора  														= Набор.Получить(ИндексыСтрок[Сч]);
						Если СтрокаНабора.ПоставщикиНеНачислять Тогда 
							Продолжить;
						КонецЕсли;
						
						Если СтрокаНабора.СпособНачисления = Перечисления.энргСпособНачислений.СреднееПоНормативу и НЕ СтруктураСоциальнойНормы.РассчитыватьСоцНормуПоСтроке Тогда
							Продолжить;
						КонецЕсли;
						
						Если СтрокаНабора.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам И СтрокаНабора.СниматьНачисленныйСредний Тогда
							Продолжить;
						КонецЕсли;
						
						Если СтруктураСоциальнойНормы.РассчитыватьСоцНормуПоСтроке Тогда
							ИспользуемОбъем 												= Мин(СтрокаНабора.ЗначениеСоциальнойНормы, СтрокаНабора.ОбъемУслуги);
							ИспользуемОбъемПотребленный										= Мин(СтрокаНабора.ЗначениеСоциальнойНормы, СтрокаНабора.ОбъемУслугиПотребленный);
						Иначе
							ИспользуемОбъем 												= Мин(СтруктураСоциальнойНормы.Остаток, СтрокаНабора.ОбъемУслуги);
							ИспользуемОбъемПотребленный										= Мин(СтруктураСоциальнойНормы.ОстатокПотребленный, СтрокаНабора.ОбъемУслугиПотребленный);
						КонецЕсли;
						
						Если ИспользуемОбъем < СтрокаНабора.ОбъемУслуги и СтруктураСоциальнойНормы.Остаток > 0 Тогда						
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрок[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслуги - ИспользуемОбъем;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Истина;
							
							СтрокаНабора.ОбъемУслуги 										= ИспользуемОбъем;
							СтрокаНабора.ОбъемУслугиСоцНорма 								= ИспользуемОбъем;
							СтрокиНабораОбъемСверхНормы.Добавить(ДанныеСтрокиОбъем); 						
						ИначеЕсли ИспользуемОбъем < СтрокаНабора.ОбъемУслуги и НЕ СтрокаНабора.ОбъемУслуги = 0 Тогда
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрок[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслуги - ИспользуемОбъем;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Ложь;				
							СтрокиНабораОбъемСверхНормы.Добавить(ДанныеСтрокиОбъем);
						КонецЕсли; 
						
						Если ИспользуемОбъемПотребленный < СтрокаНабора.ОбъемУслугиПотребленный и СтруктураСоциальнойНормы.ОстатокПотребленный > 0 Тогда						
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрок[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслугиПотребленный - ИспользуемОбъемПотребленный;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Истина;
							
							СтрокаНабора.ОбъемУслугиПотребленный 							= ИспользуемОбъемПотребленный;
							СтрокаНабора.ОбъемУслугиПотребленныйСоцНорма 					= ИспользуемОбъемПотребленный;
							СтрокиНабораОбъемПотребленныйСверхНормы.Добавить(ДанныеСтрокиОбъем); 						
						ИначеЕсли ИспользуемОбъемПотребленный < СтрокаНабора.ОбъемУслугиПотребленный и НЕ СтрокаНабора.ОбъемУслугиПотребленный = 0 Тогда
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрок[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслугиПотребленный - ИспользуемОбъемПотребленный;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Ложь;
							СтрокиНабораОбъемПотребленныйСверхНормы.Добавить(ДанныеСтрокиОбъем);
						КонецЕсли;
						
						СтруктураСоциальнойНормы.Остаток 					= СтруктураСоциальнойНормы.Остаток - ИспользуемОбъем;  
						СтруктураСоциальнойНормы.ОстатокПотребленный 		= СтруктураСоциальнойНормы.ОстатокПотребленный - ИспользуемОбъемПотребленный;					
					КонецЦикла;
					
					Для Сч  = 0 По СтрокиНабораОбъемСверхНормы.ВГраница() Цикл
						ДанныеСтроки 										= СтрокиНабораОбъемСверхНормы[Сч];
						Если ДанныеСтроки.НоваяСтрока Тогда
							НоваяСтрока 									= Набор.Добавить();
							ТекИндексСтрокиНабора							= ТекИндексСтрокиНабора + 1;
							СтрокаНабора 									= Набор.Получить(СтрокиНабораОбъемСверхНормы[Сч].Индекс);
							ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНабора);
						Иначе
							НоваяСтрока 									= Набор.Получить(СтрокиНабораОбъемСверхНормы[Сч].Индекс);
						КонецЕсли;
						
						НоваяСтрока.ОбъемУслуги 							= ДанныеСтроки.ОбъемСверхНормы;
						НоваяСтрока.ОбъемУслугиПотребленный 				= 0;
						НоваяСтрока.ОбъемУслугиСоцНорма 					= 0;
						НоваяСтрока.ОбъемУслугиПотребленныйСоцНорма 		= 0;
						НоваяСтрока.СверхНорматива 							= Истина;
						НоваяСтрока.ЗначениеТарифа 							= НоваяСтрока.ЗначениеТарифаСверхНорматива;
					КонецЦикла;
					
					Для Сч  = 0 По СтрокиНабораОбъемПотребленныйСверхНормы.ВГраница() Цикл
						ДанныеСтроки 										= СтрокиНабораОбъемПотребленныйСверхНормы[Сч];
						Если ДанныеСтроки.НоваяСтрока Тогда
							НоваяСтрока 									= Набор.Добавить();
							ТекИндексСтрокиНабора							= ТекИндексСтрокиНабора + 1;
							СтрокаНабора 									= Набор.Получить(ДанныеСтроки.Индекс);
							ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНабора); 						
						Иначе
							НоваяСтрока 									= Набор.Получить(ДанныеСтроки.Индекс);						
						КонецЕсли;
						
						НоваяСтрока.ОбъемУслуги 							= 0;
						НоваяСтрока.ОбъемУслугиСоцНорма 					= 0;
						НоваяСтрока.СверхНорматива 							= Истина;
						НоваяСтрока.ЗначениеТарифа 							= НоваяСтрока.ЗначениеТарифаСверхНорматива;					
						НоваяСтрока.ОбъемУслугиПотребленныйСоцНорма 		= 0;
						НоваяСтрока.ОбъемУслугиПотребленный 				= ДанныеСтроки.ОбъемСверхНормы;				
					КонецЦикла;
					
					СтрокиНабораОбъемСверхНормы 											= Новый Массив;
					СтрокиНабораОбъемПотребленныйСверхНормы 								= Новый Массив;
					ОписаниеСтрокиСверхНормы 												= "Индекс,ОбъемСверхНормы,НоваяСтрока";
					
					Для Сч = 0 По ИндексыСтрокПомещения.ВГраница() Цикл
						СтрокаНабора  														= НаборОбъемПомещений.Получить(ИндексыСтрокПомещения[Сч]);
						
						Если СтрокаНабора.СпособНачисления = Перечисления.энргСпособНачислений.СреднееПоНормативу Тогда
							Продолжить;
						КонецЕсли;
						
						ИспользуемОбъем 													= Мин(СтруктураСоциальнойНормы.Остаток, СтрокаНабора.ОбъемУслуги);
						ИспользуемОбъемПотребленный											= Мин(СтруктураСоциальнойНормы.ОстатокПотребленный, СтрокаНабора.ОбъемУслугиПотребленный);
						
						Если ИспользуемОбъем < СтрокаНабора.ОбъемУслуги и СтруктураСоциальнойНормы.Остаток > 0 Тогда						
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрокПомещения[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслуги - ИспользуемОбъем;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Истина;
							
							СтрокаНабора.ОбъемУслуги 										= ИспользуемОбъем;
							СтрокаНабора.ОбъемУслугиСоцНорма 								= ИспользуемОбъем;
							СтрокиНабораОбъемСверхНормы.Добавить(ДанныеСтрокиОбъем); 						
						ИначеЕсли ИспользуемОбъем < СтрокаНабора.ОбъемУслуги и НЕ СтрокаНабора.ОбъемУслуги = 0 Тогда
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрокПомещения[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслуги - ИспользуемОбъем;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Ложь;				
							СтрокиНабораОбъемСверхНормы.Добавить(ДанныеСтрокиОбъем);
						КонецЕсли; 
						
						Если ИспользуемОбъемПотребленный < СтрокаНабора.ОбъемУслугиПотребленный и СтруктураСоциальнойНормы.ОстатокПотребленный > 0 Тогда						
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрокПомещения[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслугиПотребленный - ИспользуемОбъемПотребленный;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Истина;
							
							СтрокаНабора.ОбъемУслугиПотребленный 							= ИспользуемОбъемПотребленный;
							СтрокаНабора.ОбъемУслугиПотребленныйСоцНорма 					= ИспользуемОбъемПотребленный;
							СтрокиНабораОбъемПотребленныйСверхНормы.Добавить(ДанныеСтрокиОбъем); 						
						ИначеЕсли ИспользуемОбъемПотребленный < СтрокаНабора.ОбъемУслугиПотребленный и НЕ СтрокаНабора.ОбъемУслугиПотребленный = 0 Тогда
							ДанныеСтрокиОбъем 												= Новый Структура(ОписаниеСтрокиСверхНормы);
							ДанныеСтрокиОбъем.Индекс 										= ИндексыСтрокПомещения[Сч];
							ДанныеСтрокиОбъем.ОбъемСверхНормы 								= СтрокаНабора.ОбъемУслугиПотребленный - ИспользуемОбъемПотребленный;
							ДанныеСтрокиОбъем.НоваяСтрока 									= Ложь;
							СтрокиНабораОбъемПотребленныйСверхНормы.Добавить(ДанныеСтрокиОбъем);
						КонецЕсли;
						
						СтруктураСоциальнойНормы.Остаток 					= СтруктураСоциальнойНормы.Остаток - ИспользуемОбъем;  
						СтруктураСоциальнойНормы.ОстатокПотребленный 		= СтруктураСоциальнойНормы.ОстатокПотребленный - ИспользуемОбъемПотребленный;					
					КонецЦикла;
					
					Для Сч  = 0 По СтрокиНабораОбъемСверхНормы.ВГраница() Цикл
						ДанныеСтроки 										= СтрокиНабораОбъемСверхНормы[Сч];
						Если ДанныеСтроки.НоваяСтрока Тогда
							НоваяСтрока 									= НаборОбъемПомещений.Добавить();
							ТекИндексСтрокиНабораПомещений					= ТекИндексСтрокиНабораПомещений + 1;
							СтрокаНабора 									= НаборОбъемПомещений.Получить(СтрокиНабораОбъемСверхНормы[Сч].Индекс);
							ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНабора);
						Иначе
							НоваяСтрока 									= НаборОбъемПомещений.Получить(СтрокиНабораОбъемСверхНормы[Сч].Индекс);
						КонецЕсли;
						
						НоваяСтрока.ОбъемУслуги 							= ДанныеСтроки.ОбъемСверхНормы;
						НоваяСтрока.ОбъемУслугиПотребленный 				= 0;
						НоваяСтрока.ОбъемУслугиСоцНорма 					= 0;
						НоваяСтрока.СверхНорматива 							= Истина;
						НоваяСтрока.ЗначениеТарифа 							= НоваяСтрока.ЗначениеТарифаСверхНорматива;
					КонецЦикла;
					
					Для Сч  = 0 По СтрокиНабораОбъемПотребленныйСверхНормы.ВГраница() Цикл
						ДанныеСтроки 										= СтрокиНабораОбъемПотребленныйСверхНормы[Сч];
						Если ДанныеСтроки.НоваяСтрока Тогда
							НоваяСтрока 									= НаборОбъемПомещений.Добавить();
							ТекИндексСтрокиНабораПомещений					= ТекИндексСтрокиНабораПомещений + 1;
							СтрокаНабора 									= НаборОбъемПомещений.Получить(ДанныеСтроки.Индекс);
							ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНабора); 						
						Иначе
							НоваяСтрока 									= НаборОбъемПомещений.Получить(ДанныеСтроки.Индекс);						
						КонецЕсли;
						
						НоваяСтрока.ОбъемУслуги 							= 0;
						НоваяСтрока.ОбъемУслугиСоцНорма 					= 0;
						НоваяСтрока.СверхНорматива 							= Истина;
						НоваяСтрока.ЗначениеТарифа 							= НоваяСтрока.ЗначениеТарифаСверхНорматива;					
						
						НоваяСтрока.ОбъемУслугиПотребленный 				= ДанныеСтроки.ОбъемСверхНормы;				
					КонецЦикла;					
				КонецЦикла;		
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоТочекУчетаРекурсивно(ДеревоТочекУчета,Родитель,Потомки,Услуги)
	Коллекция  			= ДеревоТочекУчета[Родитель];
	
	Если Коллекция = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Коллекция Цикл
		врПотомки  		= Новый Массив;
		ЗаполнитьДеревоТочекУчетаРекурсивно(ДеревоТочекУчета, КлючЗначение.Ключ, врПотомки, КлючЗначение.Значение);
		Потомки.Добавить(Новый Структура("ТочкаУчета, Потомки, Услуги", КлючЗначение.Ключ, врПотомки, КлючЗначение.Значение)); 		
	КонецЦикла;
КонецПроцедуры

Процедура ОчиститьОбъемУслугиТочекУчетаДереревоРекурсия(Набор, Потомки, Услуга, ДанныеСтрокиРодителя)
	
	Для Каждого СтрокаПотомка Из Потомки Цикл
		СтрокиНабора 										= СтрокаПотомка.Услуги[Услуга];
		Если СтрокиНабора = Неопределено Тогда
			Продолжить;
		КонецЕсли; 	
		
		Для Сч = 0 По СтрокиНабора.ВГраница() Цикл
			ДанныеСтрокиНачислений 							=  Набор.Получить(СтрокиНабора[Сч]);			
			ДанныеСтрокиНачислений.ОбъемУслуги  			= 0;
			ДанныеСтрокиНачислений.ОбъемУслугиПотребленный  = 0;
			ДанныеСтрокиНачислений.Сумма  					= 0;
			ДанныеСтрокиНачислений.СверхНорматива 			= Ложь; 			
		КонецЦикла;
		ОчиститьОбъемУслугиТочекУчетаДереревоРекурсия(Набор, СтрокаПотомка.Потомки, Услуга, ДанныеСтрокиРодителя);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСниматьНачисленныйСреднийПотомковРекурсия(Набор, Потомки, Услуга, ПриборУчетаГоловнойТочкиВведен)
	
	Для Каждого СтрокаПотомка Из Потомки Цикл
		СтрокиНабора 											= СтрокаПотомка.Услуги[Услуга];
		Если СтрокиНабора = Неопределено Тогда
			Продолжить;
		КонецЕсли; 	
		
		Для Сч = 0 По СтрокиНабора.ВГраница() Цикл
			ДанныеСтрокиНачислений 								= Набор.Получить(СтрокиНабора[Сч]);			
			ДанныеСтрокиНачислений.СниматьНачисленныйСредний	= Истина;
			ДанныеСтрокиНачислений.СпособНачисления 			= ?(ПриборУчетаГоловнойТочкиВведен, Перечисления.энргСпособНачислений.СреднееПоНормативу, Перечисления.энргСпособНачислений.ПоНормативу); 
			ДанныеСтрокиНачислений.ПовыщающийКоэффициент 		= ?(ПриборУчетаГоловнойТочкиВведен,1,ДанныеСтрокиНачислений.ПовыщающийКоэффициент);  
		КонецЦикла;
		УстановитьСниматьНачисленныйСреднийПотомковРекурсия(Набор, СтрокаПотомка.Потомки, Услуга, ПриборУчетаГоловнойТочкиВведен);
	КонецЦикла;
	
КонецПроцедуры

Функция СуммаНормативовПотомковРекурсия(Набор, Потомки, Услуга, ПриборУчетаГоловнойТочкиВведен) 
	
	врНорматив 												= Новый Структура("ОбъемУслуги,Сумма,СуммаПоПовышенномуКоэффициенту", 0, 0, 0);
	Для Каждого СтрокаПотомка Из Потомки Цикл
		Если СтрокаПотомка.Потомки.Количество()  = 0 Тогда
			СтрокиНабора 									= СтрокаПотомка.Услуги[Услуга];
			Если СтрокиНабора = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Сч = 0 По СтрокиНабора.ВГраница() Цикл
				СтрокаНабора 								= Набор.Получить(СтрокиНабора[Сч]);
				Если НЕ Услуга = СтрокаНабора.Услуга Тогда
					Продолжить;
				КонецЕсли;
				СтрокаНабора.ПовыщающийКоэффициент 			= ?(ПриборУчетаГоловнойТочкиВведен,1,СтрокаНабора.ПовыщающийКоэффициент);
				РегистрыНакопления.энргОбъемНачислений.РассчитатьСуммуПоПотребленномуОбъему(СтрокаНабора);
				
				врНорматив.ОбъемУслуги 						= врНорматив.ОбъемУслуги + СтрокаНабора.ОбъемУслугиПотребленный;
				врНорматив.Сумма 							= врНорматив.Сумма + СтрокаНабора.Сумма;
				врНорматив.СуммаПоПовышенномуКоэффициенту 	= врНорматив.СуммаПоПовышенномуКоэффициенту + СтрокаНабора.СуммаПоПовышенномуКоэффициенту;
			КонецЦикла;			
		Иначе
			яНорматив 										= СуммаНормативовПотомковРекурсия(Набор, СтрокаПотомка.Потомки, Услуга, ПриборУчетаГоловнойТочкиВведен);
			врНорматив.ОбъемУслуги 							= врНорматив.ОбъемУслуги + яНорматив.ОбъемУслугиПотребленный;
			врНорматив.Сумма 								= врНорматив.Сумма + яНорматив.Сумма;
			врНорматив.СуммаПоПовышенномуКоэффициенту 		= врНорматив.СуммаПоПовышенномуКоэффициенту + яНорматив.СуммаПоПовышенномуКоэффициенту;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат врНорматив;
	
КонецФункции

Функция ОпределитьОбщуюСуммуЗначениеСоциальнойНормыРекурсия(Набор, Потомки, ОбщаяСуммаЗначениеСоциальнойНормы, ОбщееЗначениеСоциальнойНормыОбъемПотребленный, Услуга);
	
	СоциальнаяНормаИспользуется 								= Ложь;
	СоциальнаяНормаПотребленныйИспользуется 					= Ложь;
	
	Для Каждого СтрокаПотомка Из Потомки Цикл
		
		СтрокиНабора 											= СтрокаПотомка.Услуги[Услуга];
		Если СтрокиНабора = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Для Сч = 0 По СтрокиНабора.ВГраница() Цикл  			
			ДанныеСтрокиНачислений 								= Набор.Получить(СтрокиНабора[Сч]);			 
			Если НЕ ДанныеСтрокиНачислений.ОбъемУслуги = 0 Тогда
				ОбщаяСуммаЗначениеСоциальнойНормы 				= ОбщаяСуммаЗначениеСоциальнойНормы + ?(ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы = -1,ДанныеСтрокиНачислений.ЗначениеСоциальнойНормыРасчетныйСпособ,ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы);
				Если НЕ ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы = -1 Тогда
					СоциальнаяНормаИспользуется 				= Истина;
				КонецЕсли;				
			КонецЕсли;
			Если НЕ ДанныеСтрокиНачислений.ОбъемУслугиПотребленный = 0 Тогда
				ОбщееЗначениеСоциальнойНормыОбъемПотребленный 	= ОбщееЗначениеСоциальнойНормыОбъемПотребленный + ?(ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы = -1,ДанныеСтрокиНачислений.ЗначениеСоциальнойНормыРасчетныйСпособ,ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы);
				Если НЕ ДанныеСтрокиНачислений.ЗначениеСоциальнойНормы = -1 Тогда
					СоциальнаяНормаПотребленныйИспользуется 	= Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ДанныеИспользования		 								= ОпределитьОбщуюСуммуЗначениеСоциальнойНормыРекурсия(Набор, СтрокаПотомка.Потомки, ОбщаяСуммаЗначениеСоциальнойНормы, ОбщееЗначениеСоциальнойНормыОбъемПотребленный, Услуга);
		
		СоциальнаяНормаИспользуется 							= Макс(СоциальнаяНормаИспользуется, ДанныеИспользования.СоциальнаяНормаИспользуется);
		СоциальнаяНормаПотребленныйИспользуется					= Макс(СоциальнаяНормаПотребленныйИспользуется, ДанныеИспользования.СоциальнаяНормаПотребленныйИспользуется);		
	КонецЦикла;	
	
	Возврат Новый Структура("СоциальнаяНормаИспользуется,СоциальнаяНормаПотребленныйИспользуется", СоциальнаяНормаПотребленныйИспользуется, СоциальнаяНормаПотребленныйИспользуется);
	
КонецФункции

Функция КлючиЗаписиРезультатаЗапроса(РезультатЗапроса)
	
	мКлючЗаписи  = Новый Массив;
	Для Каждого КолонкаРезультат Из РезультатЗапроса.Колонки Цикл
		мКлючЗаписи.Добавить(КолонкаРезультат.Имя);
	КонецЦикла;
	
	Возврат СтрСоединить(мКлючЗаписи,",");	   
		
КонецФункции

Процедура ИзменитьОстатокСоциальнойНормы(Выборка, ОстатокСоциальнойНормы,  Набор, НаборОбъемПомещений, СтрокНабора,  ИндексСтрокиНабора, ЕстьАбонент, НачисленияПоУслугам);
	
	//ТочностьОбъема											= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.ОбъемУслуги.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	СтрокНабораКалендарныхДней = День(КонецМесяца(СтрокНабора.НачалоПериода));
	СтрокНабораДнейВПериоде = (НачалоДня(СтрокНабора.КонецПериода) - НачалоДня(СтрокНабора.НачалоПериода)) / (24 * 3600);
	Если Выборка.ПомещениеРодитель = Выборка.Помещение И ЗначениеЗаполнено(Выборка.ЗависитОтУслуги) И НЕ Выборка.РасчетПоФормуле И НЕ ЗначениеЗаполнено(Выборка.ЗависимаяТочкаУчета) Тогда
		// соцнорма зависимой ТУ
		Если НЕ НачисленияПоУслугам.Получить(Выборка.ТочкаУчета) = Неопределено 
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги] = Неопределено
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала] = Неопределено
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона] = Неопределено
			И НЕ НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления] = Неопределено
			И Выборка.ЗначениеСоциальнойНормы > 0 Тогда 
			 
			// времЗначениеСоциальнойНормы	= Выборка.НормаПотребления * НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ЗначениеСоциальнойНормы;
			времЗначениеСоциальнойНормы	= НачисленияПоУслугам[Выборка.ТочкаУчета][Выборка.ЗависитОтУслуги][Выборка.Шкала][Выборка.ТарифнаяЗона][Выборка.СпособНачисления].ЗначениеСоциальнойНормы;
		Иначе 
			времЗначениеСоциальнойНормы	= Выборка.ЗначениеСоциальнойНормы;
		КонецЕсли;
		
	Иначе
		времЗначениеСоциальнойНормы	= Выборка.ЗначениеСоциальнойНормы;
	КонецЕсли;
	
	Если времЗначениеСоциальнойНормы < 0 Или Выборка.СоциальнаяНормаЗависитОтРасхода Тогда
		// если СоциальнаяНормаЗависитОтРасхода то мы же учли дни в запросе

		окрЗначениеСоциальнойНормы = времЗначениеСоциальнойНормы;
	Иначе
		окрЗначениеСоциальнойНормы = Окр(времЗначениеСоциальнойНормы / СтрокНабораКалендарныхДней * СтрокНабораДнейВПериоде ,8);
	КонецЕсли;
	//ЕстьАбонент 											= ИндексСтрокиНабора >= 0;
	
	КлючиОписанияСоциальнойНормы 							= "КонецПериода,Остаток,ОстатокПотребленный,ИндексыСтрок,ИндексыСтрокПомещения, РассчитыватьСоцНормуПоСтроке";
	яЗначениеСоциальнойНормы 								= 0;
	яЗначениеСоциальнойНормыОбъемПотребленный 				= 0;
	
	Если Выборка.ЗначениеСоциальнойНормы < 0 Тогда
		яЗначениеСоциальнойНормы 					= Выборка.ЗначениеСоциальнойНормы;
		яЗначениеСоциальнойНормыОбъемПотребленный 	= Выборка.ЗначениеСоциальнойНормы;
	КонецЕсли; 
	
	Если НЕ СтрокНабора.ОбъемУслуги = 0 Или (яЗначениеСоциальнойНормы < 0 И времЗначениеСоциальнойНормы >= 0) Тогда
		яЗначениеСоциальнойНормы 							= окрЗначениеСоциальнойНормы;
	КонецЕсли;
	
	Если НЕ СтрокНабора.ОбъемУслугиПотребленный = 0 Или (яЗначениеСоциальнойНормыОбъемПотребленный < 0 И времЗначениеСоциальнойНормы >= 0) Тогда
		яЗначениеСоциальнойНормыОбъемПотребленный 			= окрЗначениеСоциальнойНормы;
	КонецЕсли;
		
	Если ОстатокСоциальнойНормы[Выборка.КлючПомещения] = Неопределено Тогда
		ИндексыСтрок 										= Новый Массив;
		ИндексыСтрокПомещения 								= Новый Массив;
		Если ЕстьАбонент Тогда
			ИндексыСтрок.Добавить(ИндексСтрокиНабора);
		Иначе
			ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
		КонецЕсли;
		ОписаниеСоциальнойНормы  							= Новый Структура(КлючиОписанияСоциальнойНормы, СтрокНабора.КонецПериода,яЗначениеСоциальнойНормы,яЗначениеСоциальнойНормыОбъемПотребленный,ИндексыСтрок,ИндексыСтрокПомещения, Выборка.РассчитыватьСоцНормуПоСтроке);
		
		СоотвествиеНаправление  							= Новый Соответствие;
		СоотвествиеНаправление.Вставить(Выборка.НаправлениеИспользованияТУ, ОписаниеСоциальнойНормы);
		
		СоотвествиеЗависитОтУслуги 							= Новый Соответствие;
		СоотвествиеЗависитОтУслуги.Вставить(Выборка.ЗависитОтУслуги, СоотвествиеНаправление);
		
		СоотвествиеУслуга		  							= Новый Соответствие;
		СоотвествиеУслуга.Вставить(Выборка.Услуга, СоотвествиеЗависитОтУслуги);
		
		ОстатокСоциальнойНормы.Вставить(Выборка.КлючПомещения, СоотвествиеУслуга);
	ИначеЕсли ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга] = Неопределено   Тогда		
		ИндексыСтрок 										= Новый Массив;
		ИндексыСтрокПомещения 								= Новый Массив;
		Если ЕстьАбонент Тогда
			ИндексыСтрок.Добавить(ИндексСтрокиНабора);
		Иначе
			ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
		КонецЕсли;
		ОписаниеСоциальнойНормы  							= Новый Структура(КлючиОписанияСоциальнойНормы, СтрокНабора.КонецПериода,яЗначениеСоциальнойНормы,яЗначениеСоциальнойНормыОбъемПотребленный,ИндексыСтрок,ИндексыСтрокПомещения, Выборка.РассчитыватьСоцНормуПоСтроке);
		
		СоотвествиеНаправление  							= Новый Соответствие;
		СоотвествиеНаправление.Вставить(Выборка.НаправлениеИспользованияТУ, ОписаниеСоциальнойНормы);
		
		СоотвествиеЗависитОтУслуги 							= Новый Соответствие;
		СоотвествиеЗависитОтУслуги.Вставить(Выборка.ЗависитОтУслуги, СоотвествиеНаправление);
		
		ОстатокСоциальнойНормы[Выборка.КлючПомещения].Вставить(Выборка.Услуга, СоотвествиеЗависитОтУслуги);	
		
	ИначеЕсли ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги] = Неопределено   Тогда		
		ИндексыСтрок 										= Новый Массив;
		ИндексыСтрокПомещения 								= Новый Массив;
		Если ЕстьАбонент Тогда
			ИндексыСтрок.Добавить(ИндексСтрокиНабора);
		Иначе
			ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
		КонецЕсли;
		ОписаниеСоциальнойНормы  							= Новый Структура(КлючиОписанияСоциальнойНормы, СтрокНабора.КонецПериода,яЗначениеСоциальнойНормы,яЗначениеСоциальнойНормыОбъемПотребленный,ИндексыСтрок,ИндексыСтрокПомещения, Выборка.РассчитыватьСоцНормуПоСтроке);
		
		СоотвествиеНаправление  							= Новый Соответствие;
		СоотвествиеНаправление.Вставить(Выборка.НаправлениеИспользованияТУ, ОписаниеСоциальнойНормы);
		
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга].Вставить(Выборка.ЗависитОтУслуги, СоотвествиеНаправление);	

	ИначеЕсли ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ] = Неопределено Тогда
		ИндексыСтрок 										= Новый Массив;
		ИндексыСтрокПомещения 								= Новый Массив;
		Если ЕстьАбонент Тогда
			ИндексыСтрок.Добавить(ИндексСтрокиНабора);
		Иначе
			ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
		КонецЕсли;
		ОписаниеСоциальнойНормы  							= Новый Структура(КлючиОписанияСоциальнойНормы, СтрокНабора.КонецПериода,яЗначениеСоциальнойНормы,яЗначениеСоциальнойНормыОбъемПотребленный,ИндексыСтрок,ИндексыСтрокПомещения, Выборка.РассчитыватьСоцНормуПоСтроке);
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги].Вставить(Выборка.НаправлениеИспользованияТУ, ОписаниеСоциальнойНормы);
		
	//ИначеЕсли ОстатокСоциальнойНормы[КлючПомещения][Услуга][НаправлениеИспользованияТУ].КонецПериода = СтрокНабора.НачалоПериода и НЕ СоциальнаяНормаЗависитОтРасхода   Тогда		
	//	ИндексыСтрок 										= Новый Массив;
	//	ИндексыСтрокПомещения 								= Новый Массив;
	//	Если ЕстьАбонент Тогда
	//		ИндексыСтрок.Добавить(ИндексСтрокиНабора);
	//	Иначе
	//		ИндексыСтрокПомещения.Добавить(НаборОбъемПомещений.Индекс(СтрокНабора));
	//	КонецЕсли;
	//	ОписаниеСоциальнойНормы  							= Новый Структура(КлючиОписанияСоциальнойНормы, СтрокНабора.КонецПериода,яЗначениеСоциальнойНормы,яЗначениеСоциальнойНормыОбъемПотребленный,ИндексыСтрок,ИндексыСтрокПомещения, РассчитыватьСоцНормуПоСтроке);
	//	СоотвествиеНаправление  							= Новый Соответствие;
	//	СоотвествиеНаправление.Вставить(НаправлениеИспользованияТУ, ОписаниеСоциальнойНормы);																																 
	//	ОстатокСоциальнойНормы[КлючПомещения].Вставить(Услуга, СоотвествиеНаправление);		
		
	ИначеЕсли ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].КонецПериода = СтрокНабора.КонецПериода и НЕ Выборка.СоциальнаяНормаЗависитОтРасхода Тогда
		
		Если НЕ СтрокНабора.ОбъемУслуги = 0 Тогда
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].Остаток 				= окрЗначениеСоциальнойНормы;
		КонецЕсли;
		
		Если НЕ СтрокНабора.ОбъемУслугиПотребленный = 0 Тогда
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ОстатокПотребленный 	= окрЗначениеСоциальнойНормы;
		КонецЕсли;   		
		
		Если ЕстьАбонент Тогда
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрок.Добавить(ИндексСтрокиНабора);
		Иначе
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
		КонецЕсли;	
	ИначеЕсли ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].КонецПериода < СтрокНабора.КонецПериода и НЕ Выборка.СоциальнаяНормаЗависитОтРасхода Тогда
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].Остаток 				= ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].Остаток + яЗначениеСоциальнойНормы;
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ОстатокПотребленный 	= ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ОстатокПотребленный + яЗначениеСоциальнойНормыОбъемПотребленный;
		
		Если ЕстьАбонент Тогда
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрок.Добавить(ИндексСтрокиНабора);
		Иначе
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
		КонецЕсли;
	//ИначеЕсли ОстатокСоциальнойНормы[КлючПомещения][Услуга][НаправлениеИспользованияТУ].КонецПериода < СтрокНабора.КонецПериода и НЕ СоциальнаяНормаЗависитОтРасхода Тогда
	//	ОстатокСоциальнойНормы[КлючПомещения][Услуга][НаправлениеИспользованияТУ].Остаток 				= окрЗначениеСоциальнойНормы;
	//	ОстатокСоциальнойНормы[КлючПомещения][Услуга][НаправлениеИспользованияТУ].ОстатокПотребленный 	= окрЗначениеСоциальнойНормы;
	//	Если ЕстьАбонент Тогда
	//		ОстатокСоциальнойНормы[КлючПомещения][Услуга][НаправлениеИспользованияТУ].ИндексыСтрок.Добавить(ИндексСтрокиНабора);
	//	Иначе
	//		ОстатокСоциальнойНормы[КлючПомещения][Услуга][НаправлениеИспользованияТУ].ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
	//	КонецЕсли;
	ИначеЕсли Выборка.СоциальнаяНормаЗависитОтРасхода Тогда
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].Остаток = ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].Остаток + яЗначениеСоциальнойНормы;
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ОстатокПотребленный = ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ОстатокПотребленный + яЗначениеСоциальнойНормыОбъемПотребленный;
		Если ЕстьАбонент Тогда
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрок.Добавить(ИндексСтрокиНабора);
		Иначе
			ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
		КонецЕсли;		
	ИначеЕсли ЕстьАбонент Тогда		
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрок.Добавить(ИндексСтрокиНабора);
	Иначе		
		ОстатокСоциальнойНормы[Выборка.КлючПомещения][Выборка.Услуга][Выборка.ЗависитОтУслуги][Выборка.НаправлениеИспользованияТУ].ИндексыСтрокПомещения.Добавить(ИндексСтрокиНабора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНачисленияПоУслугамПомещения(ДанныеВыборки, НачисленияПоУслугамПомещения)
		
	Если НЕ ДанныеВыборки.Помещение  = ДанныеВыборки.ПомещениеРодитель Тогда
		Возврат;
	КонецЕсли; 
	             	
	ДанныеСтрокиРезультата 							= Новый ФиксированнаяСтруктура(ДанныеВыборки);
	
	ЗначениеСоотвествия 							= Новый Структура("
	|КоличествоЧеловек,ОбъемУслуги,ОбъемУслугиПотребленный,ВидПлощади,
	|ОбъемУслугиОстаток,ОбъемУслугиПотребленныйОстаток,ЗначениеСоциальнойНормы,
	|ОбъемУслугиПоПрибору,ОбъемУслугиПотребленныйПоПрибору,ОбъемУслугиБезПрибора,ОбъемУслугиПотребленныйБезПрибора,
	|ПовыщающийКоэффициент,СниматьНачисленныйСредний,УслугаПолностьюОприборена,СпособНачисления,
	|СтрокиРезультатаЗапроса,ОбъемУслугиСписать,ОбъемУслугиПотребленныйСписать,НазначениеПУ,
	|ВидДифференцированности,ЗначениеТарифа, ЗначениеТарифаСверхНорматива");
	
	ОбъемУслугиПоПрибору 									= 0;
	ОбъемУслугиПотребленныйПоПрибору 						= 0;
	ОбъемУслугиБезПрибора 									= 0;
	ОбъемУслугиПотребленныйБезПрибора 						= 0;
	
	Если ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам 
		ИЛИ ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
		ОбъемУслугиПоПрибору 								= ДанныеВыборки.ОбъемУслуги;
		ОбъемУслугиПотребленныйПоПрибору 					= ДанныеВыборки.ОбъемУслугиПотребленный;
	Иначе
		ОбъемУслугиБезПрибора 								= ДанныеВыборки.ОбъемУслуги;
		ОбъемУслугиПотребленныйБезПрибора 					= ДанныеВыборки.ОбъемУслугиПотребленный;
	КонецЕсли; 
	
	ЗначениеСоотвествия.КоличествоЧеловек 					= ДанныеВыборки.КоличествоЖильцов;
	ЗначениеСоотвествия.ВидПлощади 							= ДанныеВыборки.ВидПлощади;
	ЗначениеСоотвествия.ОбъемУслугиОстаток 					= ДанныеВыборки.ОбъемУслуги;
	ЗначениеСоотвествия.ОбъемУслугиПотребленныйОстаток 		= ДанныеВыборки.ОбъемУслугиПотребленный;
	ЗначениеСоотвествия.ЗначениеСоциальнойНормы 			= ДанныеВыборки.ЗначениеСоциальнойНормы;
	ЗначениеСоотвествия.ПовыщающийКоэффициент 				= ДанныеВыборки.ПовыщающийКоэффициент;
	ЗначениеСоотвествия.СниматьНачисленныйСредний 			= ДанныеВыборки.СниматьНачисленныйСредний;
	ЗначениеСоотвествия.УслугаПолностьюОприборена 			= ДанныеВыборки.УслугаПолностьюОприборена;
	ЗначениеСоотвествия.СпособНачисления 					= ДанныеВыборки.СпособНачисления;
	ЗначениеСоотвествия.НазначениеПУ 						= ДанныеВыборки.НазначениеПУ;
	ЗначениеСоотвествия.ВидДифференцированности 			= ДанныеВыборки.ВидДифференцированности;
	ЗначениеСоотвествия.ЗначениеТарифа 						= ДанныеВыборки.ЗначениеТарифа;
	ЗначениеСоотвествия.ЗначениеТарифаСверхНорматива 		= ДанныеВыборки.ЗначениеТарифаСверхНорматива;

	Если ДанныеВыборки.СниматьНачисленныйСредний И ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
		ЗначениеСоотвествия.ОбъемУслуги 						= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленный 			= 0;
		ЗначениеСоотвествия.ОбъемУслугиПоПрибору 				= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйПоПрибору 	= 0;
		ЗначениеСоотвествия.ОбъемУслугиБезПрибора 				= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйБезПрибора 	= 0;
		ЗначениеСоотвествия.ОбъемУслугиСписать 					= ДанныеВыборки.ОбъемУслуги;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйСписать 		= ДанныеВыборки.ОбъемУслугиПотребленный;
	Иначе
		ЗначениеСоотвествия.ОбъемУслуги 						= ДанныеВыборки.ОбъемУслуги;
		ЗначениеСоотвествия.ОбъемУслугиПотребленный 			= ДанныеВыборки.ОбъемУслугиПотребленный;
		ЗначениеСоотвествия.ОбъемУслугиПоПрибору 				= ОбъемУслугиПоПрибору;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйПоПрибору 	= ОбъемУслугиПотребленныйПоПрибору;
		ЗначениеСоотвествия.ОбъемУслугиБезПрибора 				= ОбъемУслугиБезПрибора;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйБезПрибора 	= ОбъемУслугиПотребленныйБезПрибора;
		ЗначениеСоотвествия.ОбъемУслугиСписать 					= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйСписать 		= 0;
	КонецЕсли;
	ЗначениеСоотвествия.СтрокиРезультатаЗапроса				= Новый Массив;
	ЗначениеСоотвествия.СтрокиРезультатаЗапроса.Добавить(ДанныеСтрокиРезультата);
	
	Если НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга] = Неопределено Тогда
		
		СоотвествиеТарифнаяЗона 						= Новый Соответствие;
		СоотвествиеТарифнаяЗона.Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);	
		
		СоотвествиеНачалоПериода 						= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, СоотвествиеТарифнаяЗона);
		
		СоотвествиеУслуга 								= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);
		
		НачисленияПоУслугамПомещения.Вставить(ДанныеВыборки.СоставнаяУслуга,СоотвествиеУслуга);
		
	ИначеЕсли НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга] = Неопределено Тогда
		
		СоотвествиеТарифнаяЗона 						= Новый Соответствие;
		СоотвествиеТарифнаяЗона.Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);	
		
		СоотвествиеНачалоПериода 						= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, СоотвествиеТарифнаяЗона);
				
		НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга].Вставить(ДанныеВыборки.Услуга,СоотвествиеНачалоПериода);			
		
	ИначеЕсли НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода] = Неопределено Тогда
		
		СоотвествиеТарифнаяЗона 						= Новый Соответствие;
		СоотвествиеТарифнаяЗона.Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);
								
		НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга].Вставить(ДанныеВыборки.НачалоПериода, СоотвествиеТарифнаяЗона);
				
	ИначеЕсли НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона] = Неопределено Тогда
		
		НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода].Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);
		
	Иначе		
		НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].КоличествоЧеловек 						= ДанныеВыборки.КоличествоЖильцов;
		НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ЗначениеСоциальнойНормы 					= ДанныеВыборки.ЗначениеСоциальнойНормы;
		НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ВидПлощади 								= ДанныеВыборки.ВидПлощади;
		
		Если ДанныеВыборки.СниматьНачисленныйСредний И ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиСписать 					= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиСписать + ДанныеВыборки.ОбъемУслуги;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйСписать 		= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйСписать + ДанныеВыборки.ОбъемУслугиПотребленный;
		Иначе
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслуги 							= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслуги + ДанныеВыборки.ОбъемУслуги;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиОстаток 					= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиОстаток + ДанныеВыборки.ОбъемУслуги;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток 		= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток + ДанныеВыборки.ОбъемУслугиПотребленный;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленный				= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленный + ДанныеВыборки.ОбъемУслугиПотребленный;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПоПрибору					= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПоПрибору + ОбъемУслугиПоПрибору;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйПоПрибору		= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйПоПрибору + ОбъемУслугиПотребленныйПоПрибору;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиБезПрибора				= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиБезПрибора + ОбъемУслугиБезПрибора;
			НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйБезПрибора	= НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйБезПрибора + ОбъемУслугиПотребленныйБезПрибора;
		КонецЕсли;
		
		НачисленияПоУслугамПомещения[ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].СтрокиРезультатаЗапроса.Добавить(ДанныеСтрокиРезультата);

	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьНачисленияПоУслугамПомещенияРазделенныеЛС(ДанныеВыборки, НачисленияПоУслугамПомещенияРазделенныеЛС)
		
	ДанныеСтрокиРезультата 							= Новый ФиксированнаяСтруктура(ДанныеВыборки);
	
	ЗначениеСоотвествия 							= Новый Структура("
	|КоличествоЧеловек,ОбъемУслуги,ОбъемУслугиПотребленный,ВидПлощади,
	|ОбъемУслугиОстаток,ОбъемУслугиПотребленныйОстаток,ЗначениеСоциальнойНормы,
	|ОбъемУслугиПоПрибору,ОбъемУслугиПотребленныйПоПрибору,ОбъемУслугиБезПрибора,ОбъемУслугиПотребленныйБезПрибора,
	|ПовыщающийКоэффициент,СниматьНачисленныйСредний,УслугаПолностьюОприборена,СпособНачисления,
	|СтрокиРезультатаЗапроса,ОбъемУслугиСписать,ОбъемУслугиПотребленныйСписать,НазначениеПУ,
	|ВидДифференцированности,ЗначениеТарифа, ЗначениеТарифаСверхНорматива");
	
	ОбъемУслугиПоПрибору 									= 0;
	ОбъемУслугиПотребленныйПоПрибору 						= 0;
	ОбъемУслугиБезПрибора 									= 0;
	ОбъемУслугиПотребленныйБезПрибора 						= 0;
	
	Если ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам 
		ИЛИ ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
		ОбъемУслугиПоПрибору 								= ДанныеВыборки.ОбъемУслуги;
		ОбъемУслугиПотребленныйПоПрибору 					= ДанныеВыборки.ОбъемУслугиПотребленный;
	Иначе
		ОбъемУслугиБезПрибора 								= ДанныеВыборки.ОбъемУслуги;
		ОбъемУслугиПотребленныйБезПрибора 					= ДанныеВыборки.ОбъемУслугиПотребленный;
	КонецЕсли; 
	
	ЗначениеСоотвествия.КоличествоЧеловек 					= ДанныеВыборки.КоличествоЖильцов;
	ЗначениеСоотвествия.ВидПлощади 							= ДанныеВыборки.ВидПлощади;
	ЗначениеСоотвествия.ОбъемУслугиОстаток 					= ДанныеВыборки.ОбъемУслуги;
	ЗначениеСоотвествия.ОбъемУслугиПотребленныйОстаток 		= ДанныеВыборки.ОбъемУслугиПотребленный;
	ЗначениеСоотвествия.ЗначениеСоциальнойНормы 			= ДанныеВыборки.ЗначениеСоциальнойНормы;
	ЗначениеСоотвествия.ПовыщающийКоэффициент 				= ДанныеВыборки.ПовыщающийКоэффициент;
	ЗначениеСоотвествия.СниматьНачисленныйСредний 			= ДанныеВыборки.СниматьНачисленныйСредний;
	ЗначениеСоотвествия.УслугаПолностьюОприборена 			= ДанныеВыборки.УслугаПолностьюОприборена;
	ЗначениеСоотвествия.СпособНачисления 					= ДанныеВыборки.СпособНачисления;
	ЗначениеСоотвествия.НазначениеПУ 						= ДанныеВыборки.НазначениеПУ;
	ЗначениеСоотвествия.ВидДифференцированности 			= ДанныеВыборки.ВидДифференцированности;
	ЗначениеСоотвествия.ЗначениеТарифа 						= ДанныеВыборки.ЗначениеТарифа;
	ЗначениеСоотвествия.ЗначениеТарифаСверхНорматива 		= ДанныеВыборки.ЗначениеТарифаСверхНорматива;

	Если ДанныеВыборки.СниматьНачисленныйСредний И ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
		ЗначениеСоотвествия.ОбъемУслуги 						= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленный 			= 0;
		ЗначениеСоотвествия.ОбъемУслугиПоПрибору 				= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйПоПрибору 	= 0;
		ЗначениеСоотвествия.ОбъемУслугиБезПрибора 				= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйБезПрибора 	= 0;
		ЗначениеСоотвествия.ОбъемУслугиСписать 					= ДанныеВыборки.ОбъемУслуги;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйСписать 		= ДанныеВыборки.ОбъемУслугиПотребленный;
	Иначе
		ЗначениеСоотвествия.ОбъемУслуги 						= ДанныеВыборки.ОбъемУслуги;
		ЗначениеСоотвествия.ОбъемУслугиПотребленный 			= ДанныеВыборки.ОбъемУслугиПотребленный;
		ЗначениеСоотвествия.ОбъемУслугиПоПрибору 				= ОбъемУслугиПоПрибору;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйПоПрибору 	= ОбъемУслугиПотребленныйПоПрибору;
		ЗначениеСоотвествия.ОбъемУслугиБезПрибора 				= ОбъемУслугиБезПрибора;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйБезПрибора 	= ОбъемУслугиПотребленныйБезПрибора;
		ЗначениеСоотвествия.ОбъемУслугиСписать 					= 0;
		ЗначениеСоотвествия.ОбъемУслугиПотребленныйСписать 		= 0;
	КонецЕсли;
	ЗначениеСоотвествия.СтрокиРезультатаЗапроса				= Новый Массив;
	ЗначениеСоотвествия.СтрокиРезультатаЗапроса.Добавить(ДанныеСтрокиРезультата);
	
	Если НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение] = Неопределено Тогда
		
		СоотвествиеТарифнаяЗона 						= Новый Соответствие;
		СоотвествиеТарифнаяЗона.Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);	
		
		СоотвествиеНачалоПериода 						= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, СоотвествиеТарифнаяЗона);
		
		СоотвествиеУслуга 								= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);
		
		СоотвествиеСоставнаяУслуга 								= Новый Соответствие;
		СоотвествиеСоставнаяУслуга.Вставить(ДанныеВыборки.СоставнаяУслуга, СоотвествиеУслуга);
				
		НачисленияПоУслугамПомещенияРазделенныеЛС.Вставить(ДанныеВыборки.Помещение,СоотвествиеСоставнаяУслуга);
		
	ИначеЕсли НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга] = Неопределено Тогда

		СоотвествиеТарифнаяЗона 						= Новый Соответствие;
		СоотвествиеТарифнаяЗона.Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);
		
		СоотвествиеНачалоПериода 						= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, СоотвествиеТарифнаяЗона);
		
		СоотвествиеУслуга 								= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);
		
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение].Вставить(ДанныеВыборки.СоставнаяУслуга,СоотвествиеУслуга);
		
	ИначеЕсли НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга] = Неопределено Тогда
		
		СоотвествиеТарифнаяЗона 						= Новый Соответствие;
		СоотвествиеТарифнаяЗона.Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);
		
		СоотвествиеНачалоПериода 						= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, СоотвествиеТарифнаяЗона);
				
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга].Вставить(ДанныеВыборки.Услуга,СоотвествиеНачалоПериода);			
						
	ИначеЕсли НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода] = Неопределено Тогда
		
		СоотвествиеТарифнаяЗона 						= Новый Соответствие;
		СоотвествиеТарифнаяЗона.Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);
		
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга].Вставить(ДанныеВыборки.НачалоПериода, СоотвествиеТарифнаяЗона);
		
	ИначеЕсли НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона] = Неопределено Тогда
		
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода].Вставить(ДанныеВыборки.ТарифнаяЗона, ЗначениеСоотвествия);

	Иначе		
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].КоличествоЧеловек 						= ДанныеВыборки.КоличествоЖильцов;
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ЗначениеСоциальнойНормы 				= ДанныеВыборки.ЗначениеСоциальнойНормы;
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ВидПлощади 							= ДанныеВыборки.ВидПлощади;
		
		Если ДанныеВыборки.СниматьНачисленныйСредний И ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиСписать 				= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиСписать + ДанныеВыборки.ОбъемУслуги;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйСписать 	= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйСписать + ДанныеВыборки.ОбъемУслугиПотребленный;
		Иначе
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслуги 						= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслуги + ДанныеВыборки.ОбъемУслуги;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиОстаток 				= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиОстаток + ДанныеВыборки.ОбъемУслуги;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток 	= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйОстаток + ДанныеВыборки.ОбъемУслугиПотребленный;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленный			= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленный + ДанныеВыборки.ОбъемУслугиПотребленный;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПоПрибору				= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПоПрибору + ОбъемУслугиПоПрибору;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйПоПрибору	= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйПоПрибору + ОбъемУслугиПотребленныйПоПрибору;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиБезПрибора				= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиБезПрибора + ОбъемУслугиБезПрибора;
			НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйБезПрибора	= НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].ОбъемУслугиПотребленныйБезПрибора + ОбъемУслугиПотребленныйБезПрибора;
		КонецЕсли;
		
		НачисленияПоУслугамПомещенияРазделенныеЛС[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода][ДанныеВыборки.ТарифнаяЗона].СтрокиРезультатаЗапроса.Добавить(ДанныеСтрокиРезультата);

	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПараметрыРаспределенияОбъемаПомещения(ДанныеВыборки, ПараметрыРаспределенияОбъемаПомещения, ПриоритетыВидовДифференцированности)
	
	Если ДанныеВыборки.Помещение  = ДанныеВыборки.ПомещениеРодитель Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтрокиОбъема 							= Новый ФиксированнаяСтруктура(ДанныеВыборки);
	
	СоответствиеТЗ 		= Новый Соответствие;
	СтруктураОбъемов 	= Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный, ЗначениеТарифа,ЗначениеТарифаСверхНорматива", 
	ДанныеВыборки.ОбъемУслуги, ДанныеВыборки.ОбъемУслугиПотребленный, ДанныеВыборки.ЗначениеТарифа, ДанныеВыборки.ЗначениеТарифаСверхНорматива);
	СоответствиеТЗ.Вставить(ДанныеВыборки.ТарифнаяЗона,СтруктураОбъемов);
	
	ЗначениеСоотвествия 						= Новый Структура(
	"ДанныеСтроки, ДоляПотребленияЧислитель,ДоляПотребленияЗнаменатель,КоэффициентРаспределенияОстатка,СпособРаспределенияОстатка, КоличествоЖильцов, 
	|ФиксированныйОбъемПотребления, КомнатыРассчитаныПоПриборам, ВидДифференцированности, СоответствиеТЗ",
	ДанныеСтрокиОбъема, ДанныеВыборки.ДоляПотребленияЧислитель, ДанныеВыборки.ДоляПотребленияЗнаменатель, ДанныеВыборки.КоэффициентРаспределенияОстатка
	, ДанныеВыборки.СпособРаспределенияОбъемаПомещения, ДанныеВыборки.КоличествоЖильцов, ДанныеВыборки.ФиксированныйОбъемПотребления, 
	?(ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам, Истина, Ложь), ДанныеВыборки.ВидДифференцированности, СоответствиеТЗ);
	
	Если ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение] = Неопределено Тогда
	
		СоотвествиеНачалоПериода 				= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
				
		СоотвествиеУслуга 						= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);		
		
		СоотвествиеСоставнаяУслуга 						= Новый Соответствие;
		СоотвествиеСоставнаяУслуга.Вставить(ДанныеВыборки.СоставнаяУслуга, СоотвествиеУслуга);
		
		ПараметрыРаспределенияОбъемаПомещения.Вставить(ДанныеВыборки.Помещение, СоотвествиеСоставнаяУслуга);
		
	ИначеЕсли ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга] = Неопределено Тогда
				
		СоотвествиеНачалоПериода 				= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
		
		СоотвествиеУслуга 						= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);
		
		ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение].Вставить(ДанныеВыборки.СоставнаяУслуга, СоотвествиеУслуга);

	ИначеЕсли ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга] = Неопределено Тогда
				
		СоотвествиеНачалоПериода 				= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
				
		ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга].Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);
		
		
	ИначеЕсли ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода] = Неопределено Тогда
		
		ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга].Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
		
	Иначе
		
		ЗначениеСоотвествия = ПараметрыРаспределенияОбъемаПомещения[ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода];
		
		Если ЗначениеСоотвествия.КомнатыРассчитаныПоПриборам И ДанныеВыборки.СпособНачисления <> Перечисления.энргСпособНачислений.ПоПриборам Тогда
			ЗначениеСоотвествия.КомнатыРассчитаныПоПриборам = Ложь;
		КонецЕсли;
		
		ЗначениеСоотвествия.КоличествоЖильцов = ДанныеВыборки.КоличествоЖильцов;
		
		Если ПриоритетыВидовДифференцированности[ДанныеВыборки.ВидДифференцированности] <> Неопределено 
			И ПриоритетыВидовДифференцированности[ЗначениеСоотвествия.ВидДифференцированности] <> Неопределено 
			И ПриоритетыВидовДифференцированности[ДанныеВыборки.ВидДифференцированности] < ПриоритетыВидовДифференцированности[ЗначениеСоотвествия.ВидДифференцированности] Тогда
			
			ЗначениеСоотвествия.ВидДифференцированности = ДанныеВыборки.ВидДифференцированности;
		КонецЕсли;
		
		Если ЗначениеСоотвествия.СоответствиеТЗ[ДанныеВыборки.ТарифнаяЗона] = Неопределено Тогда
			ЗначениеСоотвествия.СоответствиеТЗ.Вставить(ДанныеВыборки.ТарифнаяЗона,СтруктураОбъемов);
		Иначе
			СтруктураОбъемов 							= ЗначениеСоотвествия.СоответствиеТЗ[ДанныеВыборки.ТарифнаяЗона];
			СтруктураОбъемов.ОбъемУслуги 				= СтруктураОбъемов.ОбъемУслуги + ДанныеВыборки.ОбъемУслуги;
			СтруктураОбъемов.ОбъемУслугиПотребленный 	= СтруктураОбъемов.ОбъемУслугиПотребленный + ДанныеВыборки.ОбъемУслугиПотребленный;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьРазделенныеЛицевыеСчетаПомещения(ДанныеВыборки, РазделенныеЛицевыеСчета)
	
	Если ДанныеВыборки.Помещение  = ДанныеВыборки.ПомещениеРодитель Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтрокиОбъема 							= Новый ФиксированнаяСтруктура(ДанныеВыборки);
	
	СоответствиеТЗ 		= Новый Соответствие;
	СтруктураОбъемов 	= Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный, ЗначениеТарифа,ЗначениеТарифаСверхНорматива", 
	ДанныеВыборки.ОбъемУслуги, ДанныеВыборки.ОбъемУслугиПотребленный, ДанныеВыборки.ЗначениеТарифа, ДанныеВыборки.ЗначениеТарифаСверхНорматива);
	СоответствиеТЗ.Вставить(ДанныеВыборки.ТарифнаяЗона,СтруктураОбъемов);
	
	ЗначениеСоотвествия 						= Новый Структура(
	"ДанныеСтроки, ДоляПотребленияЧислитель,ДоляПотребленияЗнаменатель,КоэффициентРаспределенияОстатка,СпособРаспределенияОстатка, КоличествоЖильцов, 
	|ФиксированныйОбъемПотребления, КомнатыРассчитаныПоПриборам, ВидДифференцированности, СоответствиеТЗ",
	ДанныеСтрокиОбъема, ДанныеВыборки.ДоляПотребленияЧислитель, ДанныеВыборки.ДоляПотребленияЗнаменатель, ДанныеВыборки.КоэффициентРаспределенияОстатка
	, ДанныеВыборки.СпособРаспределенияОбъемаПомещения, ДанныеВыборки.КоличествоЖильцов, ДанныеВыборки.ФиксированныйОбъемПотребления, 
	?(ДанныеВыборки.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам, Истина, Ложь), ДанныеВыборки.ВидДифференцированности, СоответствиеТЗ);
	
	
	Если РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель] = Неопределено Тогда													
			
		СоотвествиеНачалоПериода 				= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
				
		СоотвествиеУслуга 						= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);		
		
		СоотвествиеСоставнаяУслуга 						= Новый Соответствие;
		СоотвествиеСоставнаяУслуга.Вставить(ДанныеВыборки.СоставнаяУслуга, СоотвествиеУслуга);
		
		СоотвествиеПомещение 						= Новый Соответствие;
		СоотвествиеПомещение.Вставить(ДанныеВыборки.Помещение,СоотвествиеСоставнаяУслуга);
		
		РазделенныеЛицевыеСчета.Вставить(ДанныеВыборки.ПомещениеРодитель, СоотвествиеПомещение);

	ИначеЕсли РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение] = Неопределено Тогда
	
		СоотвествиеНачалоПериода 				= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
				
		СоотвествиеУслуга 						= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);		
		
		СоотвествиеСоставнаяУслуга 						= Новый Соответствие;
		СоотвествиеСоставнаяУслуга.Вставить(ДанныеВыборки.СоставнаяУслуга, СоотвествиеУслуга);
		
		РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель].Вставить(ДанныеВыборки.Помещение, СоотвествиеСоставнаяУслуга);
		
	ИначеЕсли РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга] = Неопределено Тогда
				
		СоотвествиеНачалоПериода 				= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
		
		СоотвествиеУслуга 						= Новый Соответствие;
		СоотвествиеУслуга.Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);
		
		РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение].Вставить(ДанныеВыборки.СоставнаяУслуга, СоотвествиеУслуга);

	ИначеЕсли РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга] = Неопределено Тогда
				
		СоотвествиеНачалоПериода 				= Новый Соответствие;
		СоотвествиеНачалоПериода.Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
				
		РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга].Вставить(ДанныеВыборки.Услуга, СоотвествиеНачалоПериода);
		
		
	ИначеЕсли РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода] = Неопределено Тогда
		
		РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга].Вставить(ДанныеВыборки.НачалоПериода, ЗначениеСоотвествия);
		
	Иначе
		
		ЗначениеСоотвествия = РазделенныеЛицевыеСчета[ДанныеВыборки.ПомещениеРодитель][ДанныеВыборки.Помещение][ДанныеВыборки.СоставнаяУслуга][ДанныеВыборки.Услуга][ДанныеВыборки.НачалоПериода];
		
		ЗначениеСоотвествия.КоличествоЖильцов = ДанныеВыборки.КоличествоЖильцов;
		
		Если ЗначениеСоотвествия.КомнатыРассчитаныПоПриборам И ДанныеВыборки.СпособНачисления <> Перечисления.энргСпособНачислений.ПоПриборам Тогда
			ЗначениеСоотвествия.КомнатыРассчитаныПоПриборам = Ложь;
		КонецЕсли;
		
		//Если ПриоритетыВидовДифференцированности[ДанныеВыборки.ВидДифференцированности] <> Неопределено 
		//	И ПриоритетыВидовДифференцированности[ЗначениеСоотвествия.ВидДифференцированности] <> Неопределено 
		//	И ПриоритетыВидовДифференцированности[ДанныеВыборки.ВидДифференцированности] < ПриоритетыВидовДифференцированности[ЗначениеСоотвествия.ВидДифференцированности] Тогда
		//	
		//	ЗначениеСоотвествия.ВидДифференцированности = ДанныеВыборки.ВидДифференцированности;
		//КонецЕсли;
		
		Если ЗначениеСоотвествия.СоответствиеТЗ[ДанныеВыборки.ТарифнаяЗона] = Неопределено Тогда
			ЗначениеСоотвествия.СоответствиеТЗ.Вставить(ДанныеВыборки.ТарифнаяЗона,СтруктураОбъемов);
		Иначе
			СтруктураОбъемов 							= ЗначениеСоотвествия.СоответствиеТЗ[ДанныеВыборки.ТарифнаяЗона];
			СтруктураОбъемов.ОбъемУслуги 				= СтруктураОбъемов.ОбъемУслуги + ДанныеВыборки.ОбъемУслуги;
			СтруктураОбъемов.ОбъемУслугиПотребленный 	= СтруктураОбъемов.ОбъемУслугиПотребленный + ДанныеВыборки.ОбъемУслугиПотребленный;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Процедура ИзменитьОстатокОбъемаКРаспределениюВПомещении(ДанныеВыборки, НачисленияПоУслугамПомещения) 
	
	Если ДанныеВыборки.Помещение = ДанныеВыборки.ПомещениеРодитель Тогда
		Возврат;
	КонецЕсли;
	
	Если НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга] = Неопределено
		ИЛИ НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга][ДанныеВыборки.ТарифнаяЗона] = Неопределено
		ИЛИ НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга][ДанныеВыборки.ТарифнаяЗона][ДанныеВыборки.НачалоПериода] = Неопределено
		ИЛИ НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга][ДанныеВыборки.ТарифнаяЗона][ДанныеВыборки.НачалоПериода][ДанныеВыборки.СоставнаяУслуга] = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга][ДанныеВыборки.ТарифнаяЗона][ДанныеВыборки.НачалоПериода][ДанныеВыборки.СоставнаяУслуга].ОбъемУслугиОстаток = НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга][ДанныеВыборки.ТарифнаяЗона][ДанныеВыборки.НачалоПериода][ДанныеВыборки.СоставнаяУслуга].ОбъемУслугиОстаток - ДанныеВыборки.ОбъемУслуги;
	НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга][ДанныеВыборки.ТарифнаяЗона][ДанныеВыборки.НачалоПериода][ДанныеВыборки.СоставнаяУслуга].ОбъемУслугиПотребленныйОстаток = НачисленияПоУслугамПомещения[ДанныеВыборки.Услуга][ДанныеВыборки.ТарифнаяЗона][ДанныеВыборки.НачалоПериода][ДанныеВыборки.СоставнаяУслуга].ОбъемУслугиПотребленныйОстаток - ДанныеВыборки.ОбъемУслугиПотребленный;
		
КонецПроцедуры

Процедура РаспредеделитьОбъемПомещенияПоУслугеНаПотомков(Набор, ДанныеДляРаспределения, ПараметрыРаспределенияОбъемаПомещения, ПомещенияСОстаткомРаспределения, ПлощадиПомещенийПоУслугам, ПараметрыВсехПомещенийСРазделеннымиЛС, ДанныеДляРаспределенияВсехПомещенийСРазделеннымиЛС, ЗаписиСтороннихПоставщиков, ЭтоОбъемПотребленный, ТекИндексСтрокиНабора)

	РазрядностьДробнойЧасти 														= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.ОбъемУслуги.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	
	СоставнаяУслуга = ДанныеДляРаспределения.СоставнаяУслуга;
	Услуга 			= ДанныеДляРаспределения.Услуга;
	ТарифнаяЗона 	= ДанныеДляРаспределения.ТарифнаяЗона;
	НачалоПериода 	= ДанныеДляРаспределения.НачалоПериода;
	
	Если ЭтоОбъемПотребленный Тогда
		ОбъемСписать 	= ДанныеДляРаспределения.ОбъемУслугиПотребленныйСписать;
		Объем  			= ДанныеДляРаспределения.ОбъемУслугиПотребленный;
		ОбъемОстаток  	= ДанныеДляРаспределения.ОбъемУслугиПотребленныйОстаток;
	Иначе
		ОбъемСписать 	= ДанныеДляРаспределения.ОбъемУслугиСписать;
		Объем  			= ДанныеДляРаспределения.ОбъемУслуги;
		ОбъемОстаток  	= ДанныеДляРаспределения.ОбъемУслугиОстаток;
	КонецЕсли;
	
	Для Каждого КлючЗначениеПомещение Из ПараметрыРаспределенияОбъемаПомещения Цикл
		
		Если КлючЗначениеПомещение.Значение[СоставнаяУслуга] = Неопределено
			ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга] = Неопределено
			ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыРаспределения 														= КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода];
		ПлощадиПомещений	 														= ПлощадиПомещенийПоУслугам[Услуга][НачалоПериода];
				
		Если НЕ ОбъемСписать = 0 Тогда
			Если НЕ ПараметрыРаспределения.СпособРаспределенияОстатка = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда
				Если ПараметрыРаспределения.СпособРаспределенияОстатка = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
					ОбъемУслугиПотомкаСписать = ПараметрыРаспределения.ФиксированныйОбъемПотребления;
				ИначеЕсли НЕ ПараметрыРаспределения.ДоляПотребленияЧислитель = 0 И НЕ ПараметрыРаспределения.ДоляПотребленияЗнаменатель = 0 Тогда
					ОбъемУслугиПотомкаСписать 												= Окр(ОбъемСписать * ПараметрыРаспределения.ДоляПотребленияЧислитель / ПараметрыРаспределения.ДоляПотребленияЗнаменатель, РазрядностьДробнойЧасти);					
				ИначеЕсли ЗначениеЗаполнено(ДанныеДляРаспределения.ВидПлощади) Тогда
					ОбъемУслугиПотомкаСписать 												= Окр(ОбъемСписать * ПараметрыРаспределения.ДанныеСтроки.ЗначениеПлощади / ПлощадиПомещений.Площадь, РазрядностьДробнойЧасти);
				Иначе
					КоличествоЧеловек 														= ?(ПараметрыРаспределения.КоличествоЖильцов = 0, энргРаботаСПараметрамиРасчетаАбонентаСервер.КоличествоЧеловек(ПараметрыРаспределения.ДанныеСтроки), ПараметрыРаспределения.КоличествоЖильцов);
					ОбъемУслугиПотомкаСписать 												= Окр(ОбъемСписать * КоличествоЧеловек / ДанныеДляРаспределения.КоличествоЧеловек, РазрядностьДробнойЧасти);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ПараметрыРаспределения.ДанныеСтроки.Абонент) Тогда
					ЗаполнитьСтрокуНабораНачисленияПотомка(Набор, ДанныеДляРаспределения, ПараметрыРаспределения,  ?(ЭтоОбъемПотребленный, -1, ОбъемУслугиПотомкаСписать), ?(ЭтоОбъемПотребленный, ОбъемУслугиПотомкаСписать, -1), ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора, Истина);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		
		
		Если НЕ ПараметрыРаспределения.СпособРаспределенияОстатка = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда
			Если ПараметрыРаспределения.СпособРаспределенияОстатка = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
				ОбъемУслугиПотомка = ПараметрыРаспределения.ФиксированныйОбъемПотребления;
			ИначеЕсли НЕ ПараметрыРаспределения.ДоляПотребленияЧислитель = 0 И НЕ ПараметрыРаспределения.ДоляПотребленияЗнаменатель = 0 Тогда
				ОбъемУслугиПотомка 												= Окр(Объем * ПараметрыРаспределения.ДоляПотребленияЧислитель / ПараметрыРаспределения.ДоляПотребленияЗнаменатель, РазрядностьДробнойЧасти);					
			ИначеЕсли ЗначениеЗаполнено(ДанныеДляРаспределения.ВидПлощади) Тогда
				ОбъемУслугиПотомка 												= Окр(Объем * ПараметрыРаспределения.ДанныеСтроки.ЗначениеПлощади / ПлощадиПомещений.Площадь, РазрядностьДробнойЧасти);
			Иначе
				КоличествоЧеловек 												= ?(ПараметрыРаспределения.КоличествоЖильцов = 0, энргРаботаСПараметрамиРасчетаАбонентаСервер.КоличествоЧеловек(ПараметрыРаспределения.ДанныеСтроки), ПараметрыРаспределения.КоличествоЖильцов);
				ОбъемУслугиПотомка 												= Окр(Объем * КоличествоЧеловек / ДанныеДляРаспределения.КоличествоЧеловек, РазрядностьДробнойЧасти);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПараметрыРаспределения.ДанныеСтроки.Абонент) Тогда
				Если НЕ Объем = 0 Тогда
					ЗаполнитьСтрокуНабораНачисленияПотомка(Набор, ДанныеДляРаспределения, ПараметрыРаспределения, ?(ЭтоОбъемПотребленный, -1, ОбъемУслугиПотомка), ?(ЭтоОбъемПотребленный, ОбъемУслугиПотомка, -1), ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора);
				КонецЕсли;
			Иначе
				Если Не ПараметрыВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ] = Неопределено Тогда 
					ПараметрыРаспределенияОбъемаПомещенияПотомков = ПараметрыВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ];
					Если Не ДанныеДляРаспределенияВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ][СоставнаяУслуга][Услуга][НачалоПериода] = Неопределено Тогда
						
						ДанныеДляРаспределенияПотомков = ДанныеДляРаспределенияВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ][СоставнаяУслуга][Услуга][НачалоПериода][ТарифнаяЗона];
						
						ДанныеДляРаспределенияПотомков.Вставить("СоставнаяУслуга",								СоставнаяУслуга);
						ДанныеДляРаспределенияПотомков.Вставить("Услуга",										Услуга);
						ДанныеДляРаспределенияПотомков.Вставить("ТарифнаяЗона",									ТарифнаяЗона);
						ДанныеДляРаспределенияПотомков.Вставить("НачалоПериода",								НачалоПериода);
						ДанныеДляРаспределенияПотомков.Вставить("ПлощадиПомещенийПоУслугам",					ПлощадиПомещенийПоУслугам);
						ДанныеДляРаспределенияПотомков.Вставить("РаспределилиОбъемУслугиОстаток",				ДанныеДляРаспределенияПотомков.ОбъемУслугиОстаток);
						ДанныеДляРаспределенияПотомков.Вставить("РаспределилиОбъемУслугиПотребленныйОстаток",	ДанныеДляРаспределенияПотомков.ОбъемУслугиПотребленныйОстаток);
						Если ЭтоОбъемПотребленный Тогда
							ДанныеДляРаспределенияПотомков.ОбъемУслугиПотребленный = ДанныеДляРаспределенияПотомков.ОбъемУслугиПотребленный + ОбъемУслугиПотомка;
						Иначе
							ДанныеДляРаспределенияПотомков.ОбъемУслуги = ДанныеДляРаспределенияПотомков.ОбъемУслуги + ОбъемУслугиПотомка;
						КонецЕсли;
						
						РаспредеделитьОбъемПомещенияПоУслугеНаПотомков(Набор, ДанныеДляРаспределенияПотомков, ПараметрыРаспределенияОбъемаПомещенияПотомков, ПомещенияСОстаткомРаспределения, ПлощадиПомещенийПоУслугам, ПараметрыВсехПомещенийСРазделеннымиЛС, ДанныеДляРаспределенияВсехПомещенийСРазделеннымиЛС, ЗаписиСтороннихПоставщиков, ЭтоОбъемПотребленный, ТекИндексСтрокиНабора);
					КонецЕсли;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли; 
		
					
		
		
		
		Если НЕ ПараметрыРаспределения.СпособРаспределенияОстатка = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда
			ОбъемУслугиПотомка 													= ОбъемОстаток * ПараметрыРаспределения.КоэффициентРаспределенияОстатка;
			Если ОбъемУслугиПотомка > 0 Тогда
				ДанныеДляРаспределения.РаспределилиОбъемУслугиОстаток 				= ДанныеДляРаспределения.РаспределилиОбъемУслугиОстаток - ОбъемУслугиПотомка;				
				Если ЗначениеЗаполнено(ПараметрыРаспределения.ДанныеСтроки.Абонент) Тогда
					Если НЕ ОбъемОстаток = 0 Тогда
						ЗаполнитьСтрокуНабораНачисленияПотомка(Набор, ДанныеДляРаспределения, ПараметрыРаспределения, ?(ЭтоОбъемПотребленный, -1, ОбъемУслугиПотомка), ?(ЭтоОбъемПотребленный, ОбъемУслугиПотомка, -1), ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора);
					КонецЕсли;	
				Иначе
					Если Не ПараметрыВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ] = Неопределено Тогда 
						ПараметрыРаспределенияОбъемаПомещенияПотомков = ПараметрыВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ];
						Если Не ДанныеДляРаспределенияВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ][СоставнаяУслуга][Услуга][НачалоПериода] = Неопределено Тогда
							ДанныеДляРаспределенияПотомков = ДанныеДляРаспределенияВсехПомещенийСРазделеннымиЛС[КлючЗначениеПомещение.Ключ][СоставнаяУслуга][Услуга][НачалоПериода];
							
							ДанныеДляРаспределенияПотомков.Вставить("СоставнаяУслуга",								СоставнаяУслуга);
							ДанныеДляРаспределенияПотомков.Вставить("Услуга",										Услуга);
							ДанныеДляРаспределенияПотомков.Вставить("ТарифнаяЗона",									ТарифнаяЗона);
							ДанныеДляРаспределенияПотомков.Вставить("НачалоПериода",								НачалоПериода);
							ДанныеДляРаспределенияПотомков.Вставить("ПлощадиПомещенийПоУслугам",					ПлощадиПомещенийПоУслугам);
							ДанныеДляРаспределенияПотомков.Вставить("РаспределилиОбъемУслугиОстаток",				ДанныеДляРаспределенияПотомков.ОбъемУслугиОстаток);
							ДанныеДляРаспределенияПотомков.Вставить("РаспределилиОбъемУслугиПотребленныйОстаток",	ДанныеДляРаспределенияПотомков.ОбъемУслугиПотребленныйОстаток);
							
							Если ЭтоОбъемПотребленный Тогда
								ДанныеДляРаспределенияПотомков.ОбъемУслугиПотребленный = ОбъемУслугиПотомка;
							Иначе
								ДанныеДляРаспределенияПотомков.ОбъемУслуги = ОбъемУслугиПотомка;
							КонецЕсли;
							
							РаспредеделитьОбъемПомещенияПоУслугеНаПотомков(Набор, ДанныеДляРаспределенияПотомков, ПараметрыРаспределенияОбъемаПомещенияПотомков, ПомещенияСОстаткомРаспределения, ПлощадиПомещенийПоУслугам, ПараметрыВсехПомещенийСРазделеннымиЛС, ДанныеДляРаспределенияВсехПомещенийСРазделеннымиЛС, ЗаписиСтороннихПоставщиков, ЭтоОбъемПотребленный, ТекИндексСтрокиНабора);
						Иначе
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
			
					                              
				
				
		Если ПараметрыРаспределения.СпособРаспределенияОстатка = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда
			ПомещенияСОстаткомРаспределения.Добавить(КлючЗначениеПомещение.Ключ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура РаспределитьОстатокНаПомещенияСоСпособомРаспределенияОстаток(Набор, ДанныеДляРаспределения,ПомещенияСОстаткомРаспределения, ПараметрыРаспределенияОбъемаПомещения, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора)
	
	Услуга 			= ДанныеДляРаспределения.Услуга;
	ТарифнаяЗона 	= ДанныеДляРаспределения.ТарифнаяЗона;
	НачалоПериода 	= ДанныеДляРаспределения.НачалоПериода;
	
	Для Индекс  = 0 По ПомещенияСОстаткомРаспределения.ВГраница() Цикл
		ПараметрыРаспределения 								= ПараметрыРаспределенияОбъемаПомещения[ПомещенияСОстаткомРаспределения[Индекс]][Услуга][ТарифнаяЗона][НачалоПериода];
		Если Индекс = ПомещенияСОстаткомРаспределения.ВГраница() Тогда
			ОбъемУслугиПотомка 												= ДанныеДляРаспределения.РаспределилиОбъемУслугиОстаток;
			ОбъемУслугиПотребленныйПотомка 									= ДанныеДляРаспределения.РаспределилиОбъемУслугиПотребленныйОстаток;
		Иначе
			ОбъемУслугиПотомка 												= ДанныеДляРаспределения.ОбъемУслугиОстаток * ПараметрыРаспределения.КоэффициентРаспределенияОстатка;
			ОбъемУслугиПотребленныйПотомка 									= ДанныеДляРаспределения.ОбъемУслугиПотребленныйОстаток * ПараметрыРаспределения.КоэффициентРаспределенияОстатка;
		КонецЕсли;
		
		ЗаполнитьСтрокуНабораНачисленияПотомка(Набор, ДанныеДляРаспределения, ПараметрыРаспределения, ОбъемУслугиПотомка, ОбъемУслугиПотребленныйПотомка, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора);
		
		ДанныеДляРаспределения.РаспределилиОбъемУслугиОстаток 				= ДанныеДляРаспределения.РаспределилиОбъемУслугиОстаток - ОбъемУслугиПотомка;
		ДанныеДляРаспределения.РаспределилиОбъемУслугиПотребленныйОстаток 	= ДанныеДляРаспределения.РаспределилиОбъемУслугиПотребленныйОстаток - ОбъемУслугиПотребленныйПотомка; 							
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуНабораНачисленияПотомка(Набор, ДанныеДляРаспределения, ПараметрыРаспределения, ОбъемУслуги, ОбъемУслугиПотребленный, ЗаписиСтороннихПоставщиков, ТекИндексСтрокиНабора, СписатьОбъем = Ложь)
	
	СтрокиРезультатаЗапросаРодитель				= ДанныеДляРаспределения.СтрокиРезультатаЗапроса;
	ДанныеСтрокиРезультатаЗапросаПомещения		= ПараметрыРаспределения.ДанныеСтроки;
	СтрокаРезультатаЗапросаПомещения 			= СтрокиРезультатаЗапросаРодитель[0];
	
	Если СписатьОбъем и СтрокаРезультатаЗапросаПомещения.СпособНачисления <> Перечисления.энргСпособНачислений.ПоПриборам Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбъемУслуги >= 0 Тогда
		СтрокаНабора = ДобавитьСтрокуНабораНачисленияПотомка(Набор, СтрокаРезультатаЗапросаПомещения, ДанныеСтрокиРезультатаЗапросаПомещения, ПараметрыРаспределения, ЗаписиСтороннихПоставщиков, СписатьОбъем, ДанныеДляРаспределения, ТекИндексСтрокиНабора);
		СтрокаНабора.ОбъемУслуги 				= ОбъемУслуги;
		СтрокаНабора.ОбъемУслугиПотребленный 	= 0;
	КонецЕсли;
	
	Если ОбъемУслугиПотребленный >= 0 Тогда
		СтрокаНабора = ДобавитьСтрокуНабораНачисленияПотомка(Набор, СтрокаРезультатаЗапросаПомещения, ДанныеСтрокиРезультатаЗапросаПомещения, ПараметрыРаспределения, ЗаписиСтороннихПоставщиков, СписатьОбъем, ДанныеДляРаспределения, ТекИндексСтрокиНабора);
		СтрокаНабора.ОбъемУслуги 				= 0;
		СтрокаНабора.ОбъемУслугиПотребленный 	= ОбъемУслугиПотребленный;
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьСтрокуНабораНачисленияПотомка(Набор, СтрокаРезультатаЗапросаПомещения, ДанныеСтрокиРезультатаЗапросаПомещения, ПараметрыРаспределения, ЗаписиСтороннихПоставщиков, СписатьОбъем, ДанныеДляРаспределения, ТекИндексСтрокиНабора)
	СтрокаНабора 							= Набор.Добавить();	
	ТекИндексСтрокиНабора					= ТекИндексСтрокиНабора + 1;
	ЗаполнитьЗначенияСвойств(СтрокаНабора,ДанныеСтрокиРезультатаЗапросаПомещения);		
	СтрокаНабора.Период						= ДанныеСтрокиРезультатаЗапросаПомещения.ЗавершениеОП-1;
	СтрокаНабора.ВидНачисления 				= Перечисления.энргВидыНачислений.Начисление;
	СтрокаНабора.ПериодРасчета 				= ДанныеСтрокиРезультатаЗапросаПомещения.ПериодНачисления;
	ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаРезультатаЗапросаПомещения, "СниматьНачисленныйСредний, УслугаПолностьюОприборена, СпособНачисления, ПриборУчета, ТочкаУчета");
	Если Не ДанныеСтрокиРезультатаЗапросаПомещения.ПрименятьТарифВРазрезеКомнат = Неопределено И ДанныеСтрокиРезультатаЗапросаПомещения.ПрименятьТарифВРазрезеКомнат Тогда
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ДанныеДляРаспределения, "ТарифнаяЗона, ЗначениеТарифаСверхНорматива");
	Иначе
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ДанныеДляРаспределения, "ТарифнаяЗона, ЗначениеТарифа, ЗначениеТарифаСверхНорматива");
	КонецЕсли;
	
	Если СтрокаРезультатаЗапросаПомещения.ПриборВведен Тогда
		СтрокаНабора.ПовыщающийКоэффициент = 1;		
	КонецЕсли;
	
	Если ПараметрыРаспределения.СпособРаспределенияОстатка = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
		СтрокаНабора.СпособНачисления  = Перечисления.энргСпособНачислений.ФиксированныйОбъем;
	КонецЕсли;
		
	Если ДанныеСтрокиРезультатаЗапросаПомещения.УдалитьЗапись Тогда
		ЗаписиСтороннихПоставщиков.Вставить(0, ТекИндексСтрокиНабора);
		СтрокаНабора.ПоставщикиНеНачислять = ДанныеСтрокиРезультатаЗапросаПомещения.УдалитьЗапись;
	КонецЕсли;
	
	Возврат СтрокаНабора;
КонецФункции

Процедура РассчитатьДельтуРаспределения(НачисленияПоУслугамПомещения, ПараметрыРаспределенияОбъемаПомещения)
	Для Каждого КлючЗначениеСоставнаяУслуга Из НачисленияПоУслугамПомещения Цикл
		Для Каждого КлючЗначениеУслуга Из КлючЗначениеСоставнаяУслуга.Значение Цикл			
			Для Каждого КлючЗначениеНачалоПериода Из КлючЗначениеУслуга.Значение Цикл
				Для Каждого КлючЗначениеТарифнаяЗона Из КлючЗначениеНачалоПериода.Значение Цикл
					ЗначениеСтруктуры 								= КлючЗначениеТарифнаяЗона.Значение;
					СоставнаяУслуга									= КлючЗначениеСоставнаяУслуга.Ключ;
					Услуга											= КлючЗначениеУслуга.Ключ;
					ТарифнаяЗона									= КлючЗначениеТарифнаяЗона.Ключ;
					НачалоПериода									= КлючЗначениеНачалоПериода.Ключ;
					Если ЗначениеСтруктуры.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
						Для Каждого КлючЗначениеПомещение Из ПараметрыРаспределенияОбъемаПомещения Цикл
							Если КлючЗначениеПомещение.Значение[СоставнаяУслуга] = Неопределено
								ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга] = Неопределено
								ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода] = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							
							ПараметрыРаспределения 					= КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода];
							
							Если ПараметрыРаспределения.КомнатыРассчитаныПоПриборам И ЗначениеСтруктуры.НазначениеПУ = Перечисления.энргНазначениеПУ.ОПУ Тогда
								СоответствиеТЗ = КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода].СоответствиеТЗ;
								Если СоответствиеТЗ[ТарифнаяЗона] <> Неопределено Тогда
									ЗначениеСтруктуры.ОбъемУслуги 				= ЗначениеСтруктуры.ОбъемУслуги - ?(СоответствиеТЗ[ТарифнаяЗона].ОбъемУслуги > ЗначениеСтруктуры.ОбъемУслуги, ЗначениеСтруктуры.ОбъемУслуги, СоответствиеТЗ[ТарифнаяЗона].ОбъемУслуги); 
									ЗначениеСтруктуры.ОбъемУслугиПотребленный 	= ЗначениеСтруктуры.ОбъемУслугиПотребленный - ?(СоответствиеТЗ[ТарифнаяЗона].ОбъемУслугиПотребленный > ЗначениеСтруктуры.ОбъемУслугиПотребленный, ЗначениеСтруктуры.ОбъемУслугиПотребленный, СоответствиеТЗ[ТарифнаяЗона].ОбъемУслугиПотребленный);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;
				КонецЦикла;					
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ПереопределитьТарифныеЗоныПоПриоритетуДифференцированности(НачисленияПоУслугамПомещения, ПараметрыРаспределенияОбъемаПомещения, ПриоритетыВидовДифференцированности, СоставляющиеТарифныхЗон)
	Для Каждого КлючЗначениеСоставнаяУслуга Из НачисленияПоУслугамПомещения Цикл	
		Для Каждого КлючЗначениеУслуга Из КлючЗначениеСоставнаяУслуга.Значение Цикл			
			Для Каждого КлючЗначениеНачалоПериода Из КлючЗначениеУслуга.Значение Цикл
				
				СоставнаяУслуга									= КлючЗначениеСоставнаяУслуга.Ключ;
				Услуга											= КлючЗначениеУслуга.Ключ;
				НачалоПериода									= КлючЗначениеНачалоПериода.Ключ;
				ВидДифференцированностиПриоритет 				= Неопределено;
				СпособНачисления                                = Неопределено;
				
				Для Каждого КлючЗначениеТарифнаяЗона Из КлючЗначениеНачалоПериода.Значение Цикл
					
					ЗначениеСтруктуры 								= КлючЗначениеТарифнаяЗона.Значение;	
					ТарифнаяЗона									= КлючЗначениеТарифнаяЗона.Ключ;
					СпособНачисления								= ЗначениеСтруктуры.СпособНачисления;
					
					Если ВидДифференцированностиПриоритет = Неопределено Тогда
						
						ВидДифференцированностиПриоритет = ЗначениеСтруктуры.ВидДифференцированности;
					ИначеЕсли ПриоритетыВидовДифференцированности[ЗначениеСтруктуры.ВидДифференцированности] <> Неопределено 
						И ПриоритетыВидовДифференцированности[ВидДифференцированностиПриоритет] <> Неопределено 
						И ПриоритетыВидовДифференцированности[ЗначениеСтруктуры.ВидДифференцированности] < ПриоритетыВидовДифференцированности[ВидДифференцированностиПриоритет] Тогда
						
						ВидДифференцированностиПриоритет = ЗначениеСтруктуры.ВидДифференцированности;
					КонецЕсли;
					
				КонецЦикла;	
				
				Если СпособНачисления <> Перечисления.энргСпособНачислений.ПоПриборам ИЛИ ВидДифференцированностиПриоритет = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ВсеКомнатыРассчитаныПоПриборам  = Истина;
				СоответствиеТЗПриоритет			= Неопределено;
				
				Для Каждого КлючЗначениеПомещение Из ПараметрыРаспределенияОбъемаПомещения Цикл
					Если КлючЗначениеПомещение.Значение[СоставнаяУслуга] = Неопределено
						ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга] = Неопределено
						ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода] = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ПараметрыРаспределения 														= КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода];
					
					Если НЕ ПараметрыРаспределения.КомнатыРассчитаныПоПриборам Тогда
						ВсеКомнатыРассчитаныПоПриборам = Ложь;
						Прервать;
					КонецЕсли;
					
					Если ПриоритетыВидовДифференцированности[ПараметрыРаспределения.ВидДифференцированности] <> Неопределено 
						И ПриоритетыВидовДифференцированности[ВидДифференцированностиПриоритет] <> Неопределено 
						И ПриоритетыВидовДифференцированности[ПараметрыРаспределения.ВидДифференцированности] < ПриоритетыВидовДифференцированности[ВидДифференцированностиПриоритет] Тогда
						
						
						ВидДифференцированностиПриоритет 	= ПараметрыРаспределения.ВидДифференцированности;
						СоответствиеТЗПриоритет 			= ПараметрыРаспределения.СоответствиеТЗ;
					КонецЕсли;
					
				КонецЦикла;
				
				Если НЕ ВсеКомнатыРассчитаныПоПриборам Тогда
					Продолжить;
				КонецЕсли;
				
				мТарифныхЗонПриоритет = ВидДифференцированностиПриоритет.ТарифныеЗоны.ВыгрузитьКолонку("ТарифнаяЗона");
				
				Для Каждого КлючЗначениеПомещение Из ПараметрыРаспределенияОбъемаПомещения Цикл
					Если КлючЗначениеПомещение.Значение[СоставнаяУслуга] = Неопределено
						ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга] = Неопределено
						ИЛИ КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода] = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ПараметрыРаспределения 														= КлючЗначениеПомещение.Значение[СоставнаяУслуга][Услуга][НачалоПериода];
					
					Если ВидДифференцированностиПриоритет = ПараметрыРаспределения.ВидДифференцированности Тогда
						Продолжить;
					КонецЕсли;
					
					СоответствиеТЗ = ПараметрыРаспределения.СоответствиеТЗ;
					
					Для каждого ТЗ из мТарифныхЗонПриоритет Цикл 
						Если СоответствиеТЗ[ТЗ] = Неопределено И СоставляющиеТарифныхЗон[ТЗ] <> Неопределено Тогда
							Для каждого СоставляющаяТЗ из СоставляющиеТарифныхЗон[ТЗ] Цикл
								Если СоответствиеТЗ[СоставляющаяТЗ] <> Неопределено Тогда
									Если СоответствиеТЗ[ТЗ] = Неопределено Тогда
										СоответствиеТЗ.Вставить(ТЗ, Новый Структура("ОбъемУслуги, ОбъемУслугиПотребленный", СоответствиеТЗ[СоставляющаяТЗ].ОбъемУслуги, СоответствиеТЗ[СоставляющаяТЗ].ОбъемУслугиПотребленный));
									Иначе
										СоответствиеТЗ[ТЗ].ОбъемУслуги 				= СоответствиеТЗ[ТЗ].ОбъемУслуги + СоответствиеТЗ[СоставляющаяТЗ].ОбъемУслуги;
										СоответствиеТЗ[ТЗ].ОбъемУслугиПотребленный 	= СоответствиеТЗ[ТЗ].ОбъемУслугиПотребленный + СоответствиеТЗ[СоставляющаяТЗ].ОбъемУслугиПотребленный;
									КонецЕсли;
									СоответствиеТЗ.Удалить(СоставляющаяТЗ);
								КонецЕсли;
							КонецЦикла;	
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				ЗначениеНачалоПериода = КлючЗначениеНачалоПериода.Значение;
				
				Для каждого ТЗ из мТарифныхЗонПриоритет Цикл 
					Если ЗначениеНачалоПериода[ТЗ] = Неопределено И СоставляющиеТарифныхЗон[ТЗ] <> Неопределено Тогда
						Для каждого СоставляющаяТЗ из СоставляющиеТарифныхЗон[ТЗ] Цикл
							Если ЗначениеНачалоПериода[СоставляющаяТЗ] <> Неопределено Тогда
								Если ЗначениеНачалоПериода[ТЗ] = Неопределено Тогда
									НовоеЗначениеСоотвествия = Новый Структура;
									ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НовоеЗначениеСоотвествия, ЗначениеНачалоПериода[СоставляющаяТЗ]);
									Если СоответствиеТЗПриоритет <> Неопределено И СоответствиеТЗПриоритет[ТЗ] <> Неопределено Тогда
										НовоеЗначениеСоотвествия.ЗначениеТарифа 				= СоответствиеТЗПриоритет[ТЗ].ЗначениеТарифа;
										НовоеЗначениеСоотвествия.ЗначениеТарифаСверхНорматива 	= СоответствиеТЗПриоритет[ТЗ].ЗначениеТарифаСверхНорматива;
									КонецЕсли;
									ЗначениеНачалоПериода.Вставить(ТЗ, НовоеЗначениеСоотвествия);
								Иначе
									ЗначениеНачалоПериода[ТЗ].ОбъемУслуги 				= ЗначениеНачалоПериода[ТЗ].ОбъемУслуги + ЗначениеНачалоПериода[СоставляющаяТЗ].ОбъемУслуги;
									ЗначениеНачалоПериода[ТЗ].ОбъемУслугиПотребленный 	= ЗначениеНачалоПериода[ТЗ].ОбъемУслугиПотребленный + ЗначениеНачалоПериода[СоставляющаяТЗ].ОбъемУслугиПотребленный;
								КонецЕсли;
								ЗначениеНачалоПериода.Удалить(СоставляющаяТЗ);
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область НачислениеПоРассрочке_ВспомогательныеФункции

// Рассчет процентов происходит на остаток суммы
Процедура ДифференцированныйСпособРасчетаПроцентов(Организация, ПериодНачисления,Район,МКД,Документ,КонецПериодаРасчета)
	
	Запрос  								= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("КонецПериодаРасчета",КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Текст  									= ТекстЗапросаДифференцированныйСпособРасчетаПроцентов();
	
	Если МКД = Неопределено тогда
		Текст 								= СтрЗаменить(Текст,"И энргСтабильныеПериоды.МКД = &МКД","");
		Текст 								= СтрЗаменить(Текст,"И (энргСтабильныеПериоды.МКД = &МКД)","");
		Текст 								= СтрЗаменить(Текст,"И МКД = &МКД","");
		Текст 								= СтрЗаменить(Текст,"И (энргНачислениеПоРассрочке.МКД = &МКД)","");
	иначе
		Запрос.УстановитьПараметр("МКД",МКД);
	КонецЕсли;
	
	Запрос.Текст 							= Текст;
	РезЗадолженность						= Запрос.Выполнить();
	
	// читаем ставку рефинансирования
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериодаРасчета",КонецПериодаРасчета);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргСтавкиРефинансированияСрезПоследних.Коэффициент
	|ИЗ
	|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&КонецПериодаРасчета, ) КАК энргСтавкиРефинансированияСрезПоследних";
	Результат 								= Запрос.Выполнить();
	
	Если Результат.Пустой() тогда
		Возврат;
	иначе
		Выборка  							= Результат.Выбрать();
		Выборка.Следующий();
		СтРеф  								= Выборка.Коэффициент;
	КонецЕсли;
	
	Выборка  								= РезЗадолженность.Выбрать();
	ТекДом 									= Неопределено;
	ДокументОбъект 							= Неопределено;
	Пока Выборка.Следующий() цикл
		Если Документ = Неопределено тогда
			ТабЧасть 						= Документ.НачисленияАбонентам;			 
		иначеЕсли ТекДом <>  Выборка.МКД тогда // первая строка выборки
			
			Если ТекДом<>Неопределено тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 		
			
			Если ЗначениеЗаполнено(Выборка.ДокументНачисления) тогда
				ДокументОбъект  			= Выборка.ДокументНачисления.получитьОбъект();
			иначе
				ДокументОбъект  			= Документы.энргНачислениеПоРассрочке.СоздатьДокумент();
				ДокументОбъект.Дата 		= КонецПериодаРасчета;
			КонецЕсли;
			
			ДокументОбъект.ПометкаУдаления = ложь;
			ДокументОбъект.Район 			= Район;
			ДокументОбъект.МКД 			= Выборка.МКД;
			ТабЧасть 						= ДокументОбъект.НачисленияАбонентам
		КонецЕсли; 		
		СтрокаТЧ  							= ТабЧасть.Добавить();
		СтрокаТЧ.Абонент 					= Выборка.Абонент;
		СтрокаТЧ.СуммаНачисленныхПроцентов	= Выборка.Задолженность * СтРеф /(12* 100);
		ТекДом 								= Выборка.МКД;
	КонецЦикла;
	
	Если Документ = Неопределено и ДокументОбъект<>Неопределено тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	
КонецПроцедуры

Функция ТекстЗапросаДифференцированныйСпособРасчетаПроцентов()
	Текст 	=
	"ВЫБРАТЬ
	|	энргСтабильныеПериоды.Организация КАК Организация,
	|	энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериоды.Район КАК Район,
	|	энргСтабильныеПериоды.МКД КАК МКД,
	|	энргСтабильныеПериоды.Абонент КАК Абонент,
	|	энргСтабильныеПериоды.Услуга КАК Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(энргСтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомерПозиций
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|ГДЕ
	|	энргСтабильныеПериоды.Организация = &Организация
	|	И энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления
	|	И энргСтабильныеПериоды.Район = &Район
	|	И энргСтабильныеПериоды.МКД = &МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Организация,
	|	энргСтабильныеПериоды.ПериодНачисления,
	|	энргСтабильныеПериоды.МКД,
	|	энргСтабильныеПериоды.Район,
	|	энргСтабильныеПериоды.Услуга,
	|	энргСтабильныеПериоды.ТочкаУчета,
	|	энргСтабильныеПериоды.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргСтабильныеПериоды.МКД КАК МКД,
	|	энргСтабильныеПериоды.Абонент КАК Абонент
	|ПОМЕСТИТЬ ОткрытыеЛС
	|ИЗ
	|	НомерПозиций КАК НомерПозиций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ПО НомерПозиций.Организация = энргСтабильныеПериоды.Организация
	|			И НомерПозиций.ПериодНачисления = энргСтабильныеПериоды.ПериодНачисления
	|			И НомерПозиций.Район = энргСтабильныеПериоды.Район
	|			И НомерПозиций.МКД = энргСтабильныеПериоды.МКД
	|			И НомерПозиций.Абонент = энргСтабильныеПериоды.Абонент
	|			И НомерПозиций.Услуга = энргСтабильныеПериоды.Услуга
	|			И НомерПозиций.ТочкаУчета = энргСтабильныеПериоды.ТочкаУчета
	|			И НомерПозиций.НомерПозиции = энргСтабильныеПериоды.НомерПозиции
	|			И (энргСтабильныеПериоды.УслугаПодключена)
	|			И (энргСтабильныеПериоды.Организация = &Организация)
	|			И (энргСтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|			И (энргСтабильныеПериоды.Район = &Район)
	|			И (энргСтабильныеПериоды.МКД = &МКД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗадолженностьПоРассрочкеОстатки.МКД КАК МКД,
	|	энргЗадолженностьПоРассрочкеОстатки.Абонент КАК Абонент,
	|	энргЗадолженностьПоРассрочкеОстатки.СуммаЗадолженностиОстаток КАК СуммаЗадолженностиОстаток
	|ПОМЕСТИТЬ ЗадолженностьПоРассрочке
	|ИЗ
	|	РегистрНакопления.энргЗадолженностьПоРассрочке.Остатки(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргЗадолженностьПоРассрочкеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьПоРассрочке.МКД КАК МКД,
	|	ЗадолженностьПоРассрочке.Абонент КАК Абонент,
	|	ЗадолженностьПоРассрочке.СуммаЗадолженностиОстаток КАК СуммаЗадолженностиОстаток
	|ПОМЕСТИТЬ ДанныеДляНачислений
	|ИЗ
	|	ОткрытыеЛС КАК ОткрытыеЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадолженностьПоРассрочке КАК ЗадолженностьПоРассрочке
	|		ПО ОткрытыеЛС.МКД = ЗадолженностьПоРассрочке.МКД
	|			И ОткрытыеЛС.Абонент = ЗадолженностьПоРассрочке.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляНачислений.МКД КАК МКД,
	|	ДанныеДляНачислений.Абонент КАК Абонент,
	|	ДанныеДляНачислений.СуммаЗадолженностиОстаток КАК Задолженность,
	|	ЕСТЬNULL(энргНачислениеПоРассрочке.Ссылка, ЗНАЧЕНИЕ(Документ.энргНачислениеПоРассрочке.ПустаяСсылка)) КАК ДокументНачисления
	|ИЗ
	|	ДанныеДляНачислений КАК ДанныеДляНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргНачислениеПоРассрочке КАК энргНачислениеПоРассрочке
	|		ПО ДанныеДляНачислений.МКД = энргНачислениеПоРассрочке.МКД
	|			И (энргНачислениеПоРассрочке.Организация = &Организация)
	|			И (энргНачислениеПоРассрочке.Район = &Район)
	|			И (энргНачислениеПоРассрочке.Дата = &КонецПериодаРасчета)
	|			И (энргНачислениеПоРассрочке.МКД = &МКД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКД
	|ИТОГИ
	|	МАКСИМУМ(ДокументНачисления)
	|ПО
	|	МКД";
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область ЗакрытьПериодДляРедактирования_ВспомогательныеФункции

Функция ДокуметЗакрытияПериода(Организация,ПериодНачисления,Район)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргЗакрытиеПериода.Ссылка
	|ИЗ
	|	Документ.энргЗакрытиеПериода КАК энргЗакрытиеПериода
	|ГДЕ
	|	НЕ энргЗакрытиеПериода.ПометкаУдаления
	|	И энргЗакрытиеПериода.Район = &Район
	|	И энргЗакрытиеПериода.Организация = &Организация
	|	И энргЗакрытиеПериода.ПериодНачисления = &ПериодНачисления";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат  Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.энргЗакрытиеПериода.ПустаяСсылка();	
КонецФункции

#КонецОбласти

#Область РаспредениеОбъемаМКД_ВспомогательныеПроцедуры

#Область ОперацииПоРаспределениюОбъемаУслуги

Процедура РаспределитьОбъемПоУслугеМКД(ПериодНачисления, Организация, Район, МКД, Услуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугам, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещение,НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейСверхНорма)
			
	РаспределениеПоАбонентам 						= Новый Соответствие;
		
	ОбщийОбъемНачислений 							= ДанныеПоУслуге.ОбщийОбъемНачислений;
	ОбщийОбъемНачисленийПомещений 					= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений;
	ТочностьОбъемаНачислений 						= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.ОбъемУслуги.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	ДанныеОбъемаКРаспределению 						= ДанныеОбъемаКРаспределению(ДанныеПоУслуге, Услуга, ГраницыПериода, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, НаборЗаписейНПЭЭ, ОбщийОбъемНачислений, ОбщийОбъемНачисленийПомещений);
	
	ВидНачисления 									= Перечисления.энргВидыНачислений.НачислениеОДН;	
	СпособНачисленияОДН 							= ДанныеОбъемаКРаспределению.СпособНачисленияОДН;//Перечисления.энргСпособНачислений.ПустаяСсылка();
		
	Для Каждого КлючЗначениеТарифнаяЗона Из ДанныеОбъемаКРаспределению.ОсталосьРаспределить Цикл 		
		ОсталосьРаспределить 						= КлючЗначениеТарифнаяЗона.Значение; 		
		СписываемИзОтрицательного 					= Мин(Макс(ОсталосьРаспределить,0), ДанныеПоУслуге.ОтрицательныйОбъемРаспределения.ОбъемУслуги); 

		ПроцентОтОбъема 							= ДанныеПоУслуге.ПроцентРаспределенияОтрицательногоОбъема;
		Если СписываемИзОтрицательного > 0 и ПроцентОтОбъема > 0 Тогда 		
			ОбъемПроцентаКРаспределению 			= Макс(ОсталосьРаспределить,0) * (ПроцентОтОбъема / 100);
			ОсталосьРаспределить					= ?(ОбъемПроцентаКРаспределению > СписываемИзОтрицательного, Макс(ОсталосьРаспределить,0) - СписываемИзОтрицательного, ОбъемПроцентаКРаспределению);
			СписываемИзОтрицательного				= ОсталосьРаспределить;  		
		Иначе 
			ОсталосьРаспределить 					= ОсталосьРаспределить - СписываемИзОтрицательного;
		КонецЕсли;
		          	
		ЗаполнитьНаборОтрицательногоОбъемаРаспределения(ОсталосьРаспределить, СписываемИзОтрицательного, НаборОтрицательныйОбъемРаспределения, Организация, ПериодНачисления, Район, МКД, Услуга, КлючЗначениеТарифнаяЗона.Ключ, ГраницыПериода.ЗавершениеОП - 1, ДанныеПоУслуге);
						
		Если ОсталосьРаспределить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		АбонентыДляРаспределения 					= ДанныеПоУслуге.АбонентыДляРаспределения;
		Распределили 								= 0; 	
		Для Сч = 0 По АбонентыДляРаспределения.ВГраница() Цикл
			ДанныеАбонента 							= АбонентыДляРаспределения[Сч];		
			Если ЗначениеЗаполнено(ДанныеПоУслуге.ЗависитОтУслуги) Тогда
				ОбъемУслуги 						= 0;			
				Если РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги] = Неопределено Тогда
					ОбъемУслуги 					= 0; 
				ИначеЕсли РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги][ДанныеАбонента.Абонент] = Неопределено Тогда
					ОбъемУслуги 					= 0;
				Иначе
					ОбъемУслуги 					= РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги][ДанныеАбонента.Абонент] * ДанныеПоУслуге.ЗначениеНорматива;
				КонецЕсли;  			
				
			ИначеЕсли Сч = АбонентыДляРаспределения.ВГраница() Тогда
				ОбъемУслуги 						= ОсталосьРаспределить - Распределили;
				
			ИначеЕсли ДанныеПоУслуге.ВсегоПлощадьАбонентов = 0 Тогда
				ВызватьИсключение "Для МКД " + СокрЛП(МКД) + " не задана площадь помещений. ЛС " + ДанныеАбонента.Абонент.ЛицевойСчет;	
			Иначе			
				кПлощади 							= ДанныеАбонента.ЗначениеПлощади / ДанныеПоУслуге.ВсегоПлощадьАбонентов;
				ОбъемУслуги 						= ОсталосьРаспределить * кПлощади;				
			КонецЕсли; 				
			ОбъемУслуги 							= Окр(ОбъемУслуги, ТочностьОбъемаНачислений);
			Распределили 							= Распределили + ОбъемУслуги;
			ЗаполнитьСтрокуНачисленийПриРаспределении(КлючЗначениеТарифнаяЗона.Ключ, ОбъемУслуги, СпособНачисленияОДН, ГраницыПериода, Организация, ПериодНачисления, Район, МКД, Услуга, ДанныеПоУслуге, ДанныеАбонента, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, НаборЗаписейНПЭЭ, ОбщийОбъемНачисленийПомещений, ОбщийОбъемНачислений, ТочностьОбъемаНачислений);
			РаспределениеПоАбонентам.Вставить(ДанныеАбонента.Абонент, ОбъемУслуги);
		КонецЦикла;		
	КонецЦикла;
			
	Если РаспределениеОбъемаПоУслугам[Услуга] = Неопределено Тогда
		РаспределениеОбъемаПоУслугам.Вставить(Услуга, РаспределениеПоАбонентам);
	КонецЕсли;	
	
	ДанныеПоУслуге.ОбщийОбъемНачислений				= ОбщийОбъемНачислений;
	ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений 	= ОбщийОбъемНачисленийПомещений;	
КонецПроцедуры

Функция ДанныеОбъемаКРаспределению(ДанныеПоУслуге, Услуга, ГраницыПериода, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, НаборЗаписейНПЭЭ, ОбщийОбъемНачислений, ОбщийОбъемНачисленийПомещений)
	
	Если ДанныеПоУслуге.НеНачислятьУслугуАбонентам Тогда
		НадоРаспределить = ДанныеПоУслуге.ОбъемПотребленныйПоПрибору + ДанныеПоУслуге.ОбъемПотребленныйБезПрибора - ДанныеПоУслуге.ОбъемУслугиПотребленныйПерерасчет;
	Иначе
		
		НадоРаспределить = ДанныеПоУслуге.ОбъемПоПрибору + ДанныеПоУслуге.ОбъемБезПрибора;
		Если НЕ ДанныеПоУслуге.НазначениеПрибораУчета = Перечисления.энргНазначениеПУ.МОП Тогда
			НадоРаспределить = НадоРаспределить - ?(ДанныеПоУслуге.НеУчитыватьПерерасчетыАбонентов, 0, ДанныеПоУслуге.ОбъемУслугиПерерасчет); // от сюда вычесть величину перерасчета
		КонецЕсли;
		
	КонецЕсли;
	
	ТочностьОбъемаНачислений 								= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.ОбъемУслуги.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	НазначениеПрибораУчета 									= ДанныеПоУслуге.НазначениеПрибораУчета;
	ЕстьПотреблениеПоПрибору 								= ДанныеПоУслуге.ПоказанияПредоставлены <> 0 или НЕ ДанныеПоУслуге.ОбъемПоПрибору = 0;
	ЕстьФактическоеПотреблениеПоПрибору 					= ДанныеПоУслуге.ПоказанияПредоставленыПотребленный <> 0 ИЛИ НЕ ДанныеПоУслуге.ОбъемПотребленныйПоПрибору = 0;;	
	ОсталосьРаспределить 									= Новый Соответствие;
	СпособНачисленияОДН 									= Перечисления.энргСпособНачислений.ПустаяСсылка();
	ТарифныеЗоныИдентичны 									= ОбщегоНазначения.КоллекцииИдентичны(ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны, ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны, "Ключ");
	
	Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору И ДанныеПоУслуге.ВсеПоПрибору Тогда
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентов);		 		
		СпособНачисленияОДН 								= ДанныеПоУслуге.СпособНачисленияМКД;
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и НЕ ЕстьПотреблениеПоПрибору Тогда
		// Списываем начисленный индивидуальный объем по прибору учета, при условии что нет фактического потребления по ПУ
		Если Не ЕстьФактическоеПотреблениеПоПрибору Тогда
			Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.ОбъемПоПриборуКорректировать Цикл 
				Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
					яНабор 										= НаборЗаписей;
					яНаборОбщий 								= ОбщийОбъемНачислений;
				Иначе
					яНабор 										= НаборЗаписейПомещение;
					яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
				КонецЕсли;			
				
				Если СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам 
					ИЛИ СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
					Если НЕ СтрокаНачисленийАбонента.ОбъемУслуги = 0 ИЛИ НЕ СтрокаНачисленийАбонента.Сумма = 0 Тогда
						СтрокаНабора  							= яНабор.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслугиПотребленный");
						СтрокаНабора.Распределение 				= Истина;
						
						СтрокаНабора.ОбъемУслуги 				= -СтрокаНабора.ОбъемУслуги;
						СтрокаНабора.Сумма 						= -СтрокаНабора.Сумма;
						СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
						ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
					КонецЕсли;
					
					Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
						// добавляем новую строку начислений
						СтрокаНабора  							= яНабор.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслугиПотребленный");
						СтрокаНабора.Распределение 				= Истина;
						СтрокаНабора.СпособНачисления 			= Перечисления.энргСпособНачислений.ПоНормативу;
						ОбъемУслуги 							= СтрокаНабора.НормаПотребления * СтрокаНабора.ЗначениеПлощади * ((СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП)) * (СтрокаНабора.КонецПериода - СтрокаНабора.НачалоПериода) / (ГраницыПериода.ДнейВПериоде * 86400);
						СтрокаНабора.ОбъемУслуги 				= ОбъемУслуги;
						СтрокаНабора.Сумма 						= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
						СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
						ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
						РазделенныеЛицевыеСчета 				= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
						
						Если НЕ РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
							ОсталосьВнутриПомещения 			= ОбъемУслуги;
							ПомещенияПотомки					= РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение];
							СуммаПлощадейПомещения 				= 0;
							Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
								ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];
								СуммаПлощадейПомещения 			= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
							КонецЦикла;		
							
							ПереасчитатьСтроки 					= Новый Массив;
							
							Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
								ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];				                 		
								
								ХэшСтрокиТарифа 				= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
								ЗначениеТарифа 					= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
								СтрокаНабора  					= НаборЗаписей.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслугиПотребленный");
								СтрокаНабора.Распределение 		= Истина;
								СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
								СтрокаНабора.Помещение			= ПомещениеПотомок.Ключ;
								СтрокаНабора.Абонент			= ДанныеПомещения.Абонент;						
								
								Если ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
									СтрокаНабора.ОбъемУслуги 	= ДанныеПомещения.ФиксированныйОбъемПотребления;
									ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
								ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
									СтрокаНабора.ОбъемУслуги = ОбъемУслуги * ДанныеПомещения.ДоляПотребленияЧислитель / ДанныеПомещения.ДоляПотребленияЗнаменатель;
									ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
								ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда	
									ПереасчитатьСтроки.Добавить(НаборЗаписей.Индекс(СтрокаНабора));
								Иначе
									Если ЗначениеЗаполнено(ДанныеПоУслуге.ВидПлощади) Тогда
										СтрокаНабора.ОбъемУслуги = ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслуги * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);
									Иначе
										СтрокаНабора.ОбъемУслуги = ?(НЕ СтрокаНачисленийАбонента.КоличествоЖильцов = 0, ОбъемУслуги * ДанныеПомещения.КоличествоПроживающих / СтрокаНачисленийАбонента.КоличествоЖильцов, 0);
									КонецЕсли;
									ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслуги;
								КонецЕсли;											
								
								СтрокаНабора.Сумма				= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;				
							КонецЦикла;
							
							Если ПереасчитатьСтроки.Количество() > 0 Тогда
								Для Сч = 0 По ПереасчитатьСтроки.ВГраница() Цикл
									СтрокаНабора 				= НаборЗаписей.Получить(ПереасчитатьСтроки[Сч]);
									СтрокаНабора.ОбъемУслуги 	= ОсталосьВнутриПомещения;
									СтрокаНабора.Сумма			= СтрокаНабора.ОбъемУслуги * ЗначениеТарифа.Значение;
								КонецЦикла;						
							КонецЕсли;					
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;
			
			Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.ОбъемПоПриборуНПКорректировать Цикл 
				Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
					яНабор 										= НаборЗаписейНП;
					яНаборОбщий 								= ОбщийОбъемНачислений;
				Иначе
					яНабор 										= НаборЗаписейПомещение;
					яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
				КонецЕсли;			
				
				Если СтрокаНачисленийНП.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам 
					ИЛИ СтрокаНачисленийНП.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
					Если НЕ СтрокаНачисленийНП.ОбъемУслуги = 0 Тогда
						СтрокаНабора  				= яНабор.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслугиПотребленный");
						СтрокаНабора.Распределение 				= Истина;
						СтрокаНабора.ОбъемПоПрибору 			= -СтрокаНабора.ОбъемПоПрибору;
						СтрокаНабора.ОбъемУслуги 				= -СтрокаНабора.ОбъемУслуги;
						СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
						ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
					КонецЕсли;
					
					
					// добавляем новую строку начислений
					СтрокаНабора  							= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслугиПотребленный");
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.СпособНачисления 			= Перечисления.энргСпособНачислений.ПоНормативу;
					ОбъемУслуги 							= СтрокаНабора.НормаПотребления * СтрокаНабора.ЗначениеПлощади * ((СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП)) * (СтрокаНабора.КонецПериода - СтрокаНабора.НачалоПериода) / (ГраницыПериода.ДнейВПериоде * 86400);
					
					СтрокаНабора.ОбъемУслуги 				= ОбъемУслуги;
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
					
				КонецЕсли;			
			КонецЦикла;
		КонецЕсли;
		// просто распределяем объем по нормативу       	
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить);  		
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоНормативу;
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору > 0 Тогда
		// Высчитываем потребление приборников на 1м2
		ОбъемНаКвМ 											= 0; 		
		
		Если  ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору <> 0 Тогда
			ОбъемНаКвМ 										= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору / ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору;			
		КонецЕсли;
		// Высчитываем "виртуальный" расход абонентов без прибора и корректируем объем потребления абонентов без прибора
		ПотреблениеАбонентов								= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору;
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибора Цикл
			// снимаем начисленный ранее объем
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
			ЕстьСуммаНачислений 							= Ложь;
			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
				яНабор 										= НаборЗаписей;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;
			
			ИндексАбонента 									= Неопределено;
			
			// ищем строку в массиве
			Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
				Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
					ИндексАбонента 							= Сч;
					Прервать;
				КонецЕсли;					
			КонецЦикла;

			СоцПлощадь = 0;	
			
			Если НЕ СтрокаНачисленийАбонента.ОбъемУслуги = 0 ИЛИ НЕ СтрокаНачисленийАбонента.Сумма = 0 Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслугиПотребленный");
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.ОбъемУслуги 					= -СтрокаНабора.ОбъемУслуги;
				СтрокаНабора.ОбъемУслугиСоцНорма 			= -СтрокаНабора.ОбъемУслугиСоцНорма;
				СтрокаНабора.ОбъемУслугиПотребленный 		= 0;
				
				Если ЕстьСуммаНачислений Тогда
					СтрокаНабора.Сумма 						= -СтрокаНабора.Сумма;
				КонецЕсли;
				
				ДанныеАбонента 								= ДанныеПоУслуге.АбонентыДляРаспределения[ИндексАбонента];
				ДанныеАбонента.ОбъемУслуги 					= ДанныеАбонента.ОбъемУслуги + СтрокаНабора.ОбъемУслуги;
				ДанныеАбонента.ОбъемУслугиСоцНорма 			= ДанныеАбонента.ОбъемУслугиСоцНорма + СтрокаНабора.ОбъемУслугиСоцНорма;
				СоцПлощадь 									= ДанныеАбонента.СоцПлощадь;
				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
			КонецЕсли;
			
			Если СтрокаНачисленийАбонента.СверхНорматива Тогда
				Продолжить;
			КонецЕсли;
				
			Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение и ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
				
				КоэфДлительностиПериода 					= (СтрокаНачисленийАбонента.КонецПериода - СтрокаНачисленийАбонента.НачалоПериода)/(ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
				ОбъемУслуги 								= Окр(ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода,ТочностьОбъемаНачислений);
				ПотреблениеАбонентов 						= ПотреблениеАбонентов + ОбъемУслуги;		
				
				СуммаПлощадейПомещения 						= 0;
				
				РазбитьПоСоцНорме(яНабор,яНаборОбщий,НаборЗаписей,СтрокаНачисленийАбонента,ОбъемУслуги,СоцПлощадь,СпособНачисленияОДН,ГраницыПериода,ДанныеПоУслуге,ЕстьСуммаНачислений,ЗначенияТарифов,Услуга,ПотреблениеАбонентов,СуммаПлощадейПомещения,Ложь,ТочностьОбъемаНачислений);
			КонецЕсли;			
		КонецЦикла;
		
		// объем потребления НП без прибора
		Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.НачисленияНПБезПрибора Цикл
			// снимаем начисленный ранее объем
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийНП.ОбъектРасчета];
			ЕстьСуммаНачислений 							= Ложь;
			Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
				яНабор 										= НаборЗаписейНП;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;		
			
			Если НЕ СтрокаНачисленийНП.ОбъемУслуги = 0 Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслугиПотребленный");
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.ОбъемУслуги 					= -СтрокаНабора.ОбъемУслуги;				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
				
				
				СтрокаНабора  									= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслугиПотребленный");
				СтрокаНабора.Распределение 						= Истина;
				СтрокаНабора.СпособНачисления					= СпособНачисленияОДН;
				КоэфДлительностиПериода 						= (СтрокаНачисленийНП.КонецПериода - СтрокаНачисленийНП.НачалоПериода)/(ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
				ОбъемУслуги 									= ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода; 			
				СтрокаНабора.ОбъемУслуги 						= ОбъемУслуги;			
				СтрокаНабора.ОбъемУслугиПотребленный 			= 0;			
				СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;			
				ПотреблениеАбонентов 							= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслуги;
				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный"); 		
			КонецЕсли;
			
			
				
		КонецЦикла;   		
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ПотреблениеАбонентов);
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору Тогда
		СпособНачисленияОДН									= Перечисления.энргСпособНачислений.ПоПриборам; 
		ОтапливаемаяПлощадь									= ДанныеПоУслуге.ВсегоПлощадьАбонентов - ДанныеПоУслуге.ВсегоПлощадьАбонентовСобственнаяПоставка + ДанныеПоУслуге.ПлощадьМОП;
		Если ДанныеПоУслуге.НеНачислятьУслугуАбонентам Тогда
			ОбъемНаКвМ 										= ?(ОтапливаемаяПлощадь = 0, 0, ДанныеПоУслуге.ОбъемПотребленныйПоПрибору / ОтапливаемаяПлощадь);
		Иначе
			ОбъемНаКвМ 										= ?(ОтапливаемаяПлощадь = 0, 0, ДанныеПоУслуге.ОбъемПоПрибору / ОтапливаемаяПлощадь);
		КонецЕсли; 	
		
		
		ПотреблениеАбонентов								= 0; 		
		
		ПомещениеНачислили 									= Новый Соответствие;
		
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибора Цикл
			
				ЕстьСуммаНачислений 						= Ложь;
				Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
					яНабор 									= НаборЗаписей;
					яНаборОбщий 							= ОбщийОбъемНачислений;
					ЕстьСуммаНачислений 					= Истина;
				Иначе
					яНабор 									= НаборЗаписейПомещение;
					яНаборОбщий 							= ОбщийОбъемНачисленийПомещений;
				КонецЕсли;
				
				ЗначениеПлощади 							= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
				
				// снимаем начисленный ранее объем
				Если НЕ СтрокаНачисленийАбонента.ОбъемУслуги = 0 ИЛИ НЕ СтрокаНачисленийАбонента.Сумма = 0 Тогда
					СтрокаНабора  							= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслугиПотребленный");
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.ОбъемУслуги 				= -СтрокаНабора.ОбъемУслуги;
					// Снятие объема потребленного при сторнировании объема услуги
					СтрокаНабора.ОбъемУслугиПотребленный 	= 0;
					// Снятие объема потребленного при сторнировании объема услуги
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					Если ЕстьСуммаНачислений Тогда
						СтрокаНабора.Сумма 					= -СтрокаНабора.Сумма;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
				КонецЕсли;
				  				
				//Если СтрокаНачисленийАбонента.СверхНорматива Тогда
				//	Продолжить;
				//КонецЕсли;
				
				Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
					
					Если Не ПомещениеНачислили[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ИндексАбонента 							= Неопределено;
					
					// ищем строку в массиве
					Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
						Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
							ИндексАбонента 					= Сч;
							Прервать;
						КонецЕсли;					
					КонецЦикла; 					
					
					КоэфДлительностиПериода 				= 1;
					СоцПлощадь								= 0;
					Если НЕ ИндексАбонента = Неопределено Тогда
						ДатаСостоянияЛицевогоСчета 			= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].ДатаСостоянияЛицевогоСчета;
						СоцПлощадь 							= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].СоцПлощадь;
						Если ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) и ДатаСостоянияЛицевогоСчета <= ГраницыПериода.НачалоОП Тогда
							КоэфДлительностиПериода 		= 1;
						ИначеЕсли ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) Тогда 
							КоэфДлительностиПериода 		= (ДатаСостоянияЛицевогоСчета - ГраницыПериода.НачалоОП) / (ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
						КонецЕсли;						
					КонецЕсли;					
					
					ОбъемУслуги 							= Окр(ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода,ТочностьОбъемаНачислений);
					ПотреблениеАбонентов 					= ПотреблениеАбонентов + ОбъемУслуги;		
					
					СуммаПлощадейПомещения 					= 0; 					
					
					РазбитьПоСоцНорме(яНабор,яНаборОбщий,НаборЗаписей,СтрокаНачисленийАбонента,ОбъемУслуги,СоцПлощадь,СпособНачисленияОДН,ГраницыПериода,ДанныеПоУслуге,ЕстьСуммаНачислений,ЗначенияТарифов,Услуга,ПотреблениеАбонентов,СуммаПлощадейПомещения,Ложь,ТочностьОбъемаНачислений, Истина);
					
					ПомещениеНачислили.Вставить(СтрокаНачисленийАбонента.Помещение, Истина);					
				КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.НачисленияНПБезПрибора Цикл
			ЕстьСуммаНачислений 							= Ложь;
					
			Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
				яНабор 										= НаборЗаписейНП;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;	
			
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийНП.ОбъектРасчета];
			
			// снимаем начисленный ранее объем
			Если НЕ СтрокаНачисленийНП.ОбъемУслуги = 0  Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслугиПотребленный");
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.ОбъемУслуги 					= -СтрокаНабора.ОбъемУслуги;				
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
			КонецЕсли;
			
			СтрокаНабора  								= яНабор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслугиПотребленный");
			СтрокаНабора.Распределение 					= Истина;
			СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
			ОбъемУслуги 								= ЗначениеПлощади * ОбъемНаКвМ;			
			КоэфДлительностиПериода 					= (СтрокаНачисленийНП.КонецПериода - СтрокаНачисленийНП.НачалоПериода)/(ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
			СтрокаНабора.ОбъемУслуги 					= ОбъемУслуги * КоэфДлительностиПериода;			
			СтрокаНабора.ОбъемУслугиПотребленный 		= 0;			
			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;			
			ПотреблениеАбонентов 						= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслуги;			
			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслугиПотребленный");
			
		КонецЦикла;
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ПотреблениеАбонентов);		
	ИначеЕсли ЕстьПотреблениеПоПрибору и НазначениеПрибораУчета = Перечисления.энргНазначениеПУ.МОП Тогда		
		//ОсталосьРаспределить 								= НадоРаспределить;
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить);
		СпособНачисленияОДН 								= ДанныеПоУслуге.СпособНачисленияМКД;
	//ИначеЕсли ЕстьПотреблениеПоПрибору и ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны.Количество() = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны.Количество() Тогда	
	ИначеЕсли ЕстьПотреблениеПоПрибору И ТарифныеЗоныИдентичны Тогда
		Для Каждого КлючЗначениеТарифнаяЗона Из ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны Цикл
			ОсталосьРаспределить.Вставить(КлючЗначениеТарифнаяЗона.Ключ, КлючЗначениеТарифнаяЗона.Значение - ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[КлючЗначениеТарифнаяЗона.Ключ] - ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет[КлючЗначениеТарифнаяЗона.Ключ]);
		КонецЦикла;
		СпособНачисленияОДН 								= ДанныеПоУслуге.СпособНачисленияМКД;
	ИначеЕсли ЕстьПотреблениеПоПрибору Тогда		
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентов);
		СпособНачисленияОДН 								= ДанныеПоУслуге.СпособНачисленияМКД;
	Иначе
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить);				
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоНормативу;
	КонецЕсли;
	
	Если Не ДанныеПоУслуге.РаспределятьПолностью И Не ДанныеПоУслуге.НеРаспределятьСверхнорматив Тогда
		Если ОсталосьРаспределить[Справочники.энргТарифныеЗоны.БезРазбивки] > ДанныеПоУслуге.ОбъемУслугиНорматив  Тогда
			СверхнормативМКД 								= ОсталосьРаспределить[Справочники.энргТарифныеЗоны.БезРазбивки] - ДанныеПоУслуге.ОбъемУслугиНорматив;
			СпособНачисленияОДН 							= Перечисления.энргСпособНачислений.ПоНормативу;
			ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, ДанныеПоУслуге.ОбъемУслугиНорматив);			
			
			//СтрокаНабора  									= НаборЗаписейСверхНорма.Добавить();
			//СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			//СтрокаНабора.Район 								= Район;
			//СтрокаНабора.Организация						= Организация;
			//СтрокаНабора.МКД								= МКД;
			//СтрокаНабора.Услуга								= Услуга;
			//СтрокаНабора.ОбъемУслуги						= СверхнормативМКД;			
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура("СпособНачисленияОДН,ОсталосьРаспределить",СпособНачисленияОДН,ОсталосьРаспределить);
	
КонецФункции

Процедура ЗаполнитьНаборОтрицательногоОбъемаРаспределения(ОсталосьРаспределить, СписываемИзОтрицательного, НаборОтрицательныйОбъемРаспределения, Организация, ПериодНачисления, Район, МКД, Услуга, ТарифнаяЗона, Период, ДанныеПоУслуге)
	
	Если ОсталосьРаспределить < 0 Тогда
		СтрокаНабораОтрицательный  						= НаборОтрицательныйОбъемРаспределения.ДобавитьПриход();
		СтрокаНабораОтрицательный.Период	 			= Период;
		СтрокаНабораОтрицательный.Организация 			= Организация;
		СтрокаНабораОтрицательный.Район 				= Район;
		СтрокаНабораОтрицательный.МКД 					= МКД;
		СтрокаНабораОтрицательный.Услуга 				= Услуга;
		СтрокаНабораОтрицательный.ТарифнаяЗона 			= ТарифнаяЗона;
		СтрокаНабораОтрицательный.ПериодНачисления		= ПериодНачисления;
		СтрокаНабораОтрицательный.ОбъемУслуги			= -ОсталосьРаспределить;
		СтрокаНабораОтрицательный.ПериодРасчета 		= ПериодНачисления;
	КонецЕсли;	
	
	Если СписываемИзОтрицательного > 0 Тогда
		ОтрицательныйОбъемРасшифровка 					= ДанныеПоУслуге.ОтрицательныйОбъемРаспределения.Расшифровка;
		ИндексРасшифровки 								= 0;
		ОсталосьСписатьИзОтрицательного 				= СписываемИзОтрицательного;
		Пока ОсталосьСписатьИзОтрицательного > 0 и ИндексРасшифровки < ОтрицательныйОбъемРасшифровка.Количество() Цикл
			Снимаем 									= Мин(ОсталосьСписатьИзОтрицательного,ОтрицательныйОбъемРасшифровка[ИндексРасшифровки].ОбъемУслуги);

			СтрокаНабораОтрицательный  					= НаборОтрицательныйОбъемРаспределения.ДобавитьРасход();
			СтрокаНабораОтрицательный.Период	 		= Период;
			СтрокаНабораОтрицательный.Организация 		= Организация;
			СтрокаНабораОтрицательный.Район 			= Район;
			СтрокаНабораОтрицательный.МКД 				= МКД;
			СтрокаНабораОтрицательный.Услуга 			= Услуга;
			СтрокаНабораОтрицательный.ТарифнаяЗона 		= ТарифнаяЗона;
			СтрокаНабораОтрицательный.ПериодНачисления	= ОтрицательныйОбъемРасшифровка[ИндексРасшифровки].ПериодНачисленияОбъема;
			СтрокаНабораОтрицательный.ОбъемУслуги		= Снимаем;
			СтрокаНабораОтрицательный.ПериодРасчета 	= ПериодНачисления;			
			ИндексРасшифровки 							= ИндексРасшифровки + 1;
			ОсталосьСписатьИзОтрицательного 			= ОсталосьСписатьИзОтрицательного - Снимаем;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуНачисленийПриРаспределении(ТарифнаяЗона, ОбъемУслуги, СпособНачисленияОДН, ГраницыПериода, Организация, ПериодНачисления, Район, МКД, Услуга, ДанныеПоУслуге, ДанныеАбонента, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, НаборЗаписейНПЭЭ, ОбщийОбъемНачисленийПомещений, ОбщийОбъемНачислений, ТочностьОбъемаНачислений)
	
	ПустаяТочкаУчета 									= Справочники.энргТочкиУчета.ПустаяСсылка();
	ВидНачисления 										= Перечисления.энргВидыНачислений.НачислениеОДН;
	
	Если ДанныеАбонента.НП Тогда  
		
		Если ДанныеАбонента.ЭЭ Тогда 
			СтрокаНабора  									= НаборЗаписейНПЭЭ.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.МКД 								= МКД;
			СтрокаНабора.Договор							= ДанныеАбонента.Договор;
			СтрокаНабора.ОбъектРасчета						= ДанныеАбонента.Абонент;
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;			
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			СтрокаНабора.ОбъемУслуги						= ОбъемУслуги;
			
			ДанныеЭЭ = ДанныеАбонента.ДанныеЭЭ;
			
			СтрокаНабора.СуммаЗаИныеУслуги 				= ОбъемУслуги * ДанныеЭЭ.ТарифНаИныеУслуги;
			СтрокаНабора.СуммаЗаСбытовуюНадбавку 		= ОбъемУслуги * ДанныеЭЭ.ТарифЗаСбытовуюНадбавку;
			СтрокаНабора.СуммаЗаУслугиПоПередачи 		= ОбъемУслуги * ДанныеЭЭ.ТарифЗаУслугиПоПередачи;
			СтрокаНабора.СуммаЗаСбытовуюНадбавкуПокупатель = ОбъемУслуги * ДанныеЭЭ.ТарифЗаСбытовуюНадбавкуПокупатель;
			СтрокаНабора.Сумма 							= ОбъемУслуги * ДанныеЭЭ.ЗначениеТарифа;
			
			СтрокаНабора.СуммаСредневзвешенная 		= ОбъемУслуги * ДанныеЭЭ.ТарифНаСредневзвешанную * ДанныеЭЭ.СтавкаНДС / (100 + ДанныеЭЭ.СтавкаНДС); 
			СтрокаНабора.СуммаСредневзвешеннаяНДС 	= СтрокаНабора.СуммаСредневзвешенная * ДанныеЭЭ.СтавкаНДС / 100;

			
			Если ДанныеЭЭ.НДСВнутриИныеУслуги Тогда	 
				СтрокаНабора.СуммаЗаИныеУслугиНДС 	= СтрокаНабора.СуммаЗаИныеУслуги * ДанныеЭЭ.СтавкаНДС / (100 + ДанныеЭЭ.СтавкаНДС);
			Иначе
				СтрокаНабора.СуммаЗаИныеУслугиНДС 	= СтрокаНабора.СуммаЗаИныеУслуги * ДанныеЭЭ.СтавкаНДС / 100;
			КонецЕсли;
			
			Если ДанныеЭЭ.НДСВнутриСбытоваяНадбавка Тогда		 
				СтрокаНабора.СуммаЗаСбытовуюНадбавкуНДС 	= СтрокаНабора.СуммаЗаСбытовуюНадбавку * ДанныеЭЭ.СтавкаНДС / (100 + ДанныеЭЭ.СтавкаНДС);
			Иначе
				СтрокаНабора.СуммаЗаСбытовуюНадбавкуНДС 	= СтрокаНабора.СуммаЗаСбытовуюНадбавку * ДанныеЭЭ.СтавкаНДС / 100;
			КонецЕсли;

			Если ДанныеЭЭ.НДСВнутриУслугиПоПередачи Тогда		 
				СтрокаНабора.СуммаЗаУслугиПоПередачиНДС 	= СтрокаНабора.СуммаЗаУслугиПоПередачи * ДанныеЭЭ.СтавкаНДС / (100 + ДанныеЭЭ.СтавкаНДС);
			Иначе
				СтрокаНабора.СуммаЗаУслугиПоПередачиНДС 	= СтрокаНабора.СуммаЗаУслугиПоПередачи * ДанныеЭЭ.СтавкаНДС / 100;
			КонецЕсли;
			
			Если ДанныеЭЭ.НДСВнутри Тогда		 
				СтрокаНабора.СуммаНДС 	= СтрокаНабора.Сумма * ДанныеЭЭ.СтавкаНДС / (100 + ДанныеЭЭ.СтавкаНДС);
			Иначе
				СтрокаНабора.СуммаНДС 	= СтрокаНабора.Сумма * ДанныеЭЭ.СтавкаНДС / 100;
			КонецЕсли; 
		

		Иначе
			СтрокаНабора  									= НаборЗаписейНП.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.МКД 								= МКД;
			СтрокаНабора.Договор							= ДанныеАбонента.Договор;
			СтрокаНабора.ОбъектРасчета						= ДанныеАбонента.Абонент;
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.ВидНачисления 						= ВидНачисления;
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;			
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			
			Если ДанныеАбонента.РасчетПоФактическомуОбъему Тогда
				СтрокаНабора.ОбъемУслуги					= 0;
				СтрокаНабора.ОбъемУслугиПотребленный		= ОбъемУслуги;
			Иначе
				СтрокаНабора.ОбъемУслуги					= ОбъемУслуги;
				СтрокаНабора.ОбъемУслугиПотребленный		= 0;
			КонецЕсли;
			
			СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеАбонента.Абонент) Тогда			
		ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа,Услуга,ДанныеАбонента.Поставщик,ТарифнаяЗона); 
		ОписаниеЗначениеТарифа 							= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК, ЗначениеСверхНорматива", 0,0,0), ЗначенияТарифов[ХэшСтрокиТарифа]);
		СтрокаНабора  									= НаборЗаписей.Добавить();
		СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 								= Район;
		СтрокаНабора.Распределение 						= Истина;
		СтрокаНабора.Организация						= Организация;
		СтрокаНабора.ЧастныйСектор 						= Ложь;
		СтрокаНабора.Строение							= МКД;
		СтрокаНабора.Помещение							= ДанныеАбонента.Помещение;
		СтрокаНабора.Абонент							= ДанныеАбонента.Абонент;
		СтрокаНабора.Услуга								= Услуга;
		СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
		СтрокаНабора.ВидНачисления 						= ВидНачисления;
		СтрокаНабора.НаправлениеИспользованияТУ 		= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
		СтрокаНабора.Измеритель 						= Справочники.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка();
		СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
		СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
		СтрокаНабора.ПериодРасчета						= ПериодНачисления;
		СтрокаНабора.ПериодНачисления					= ПериодНачисления;
		СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
		СтрокаНабора.ТарифнаяГруппа                     = ДанныеАбонента.ТарифнаяГруппа;
		СтрокаНабора.ТарифнаяЗона                     	= ТарифнаяЗона;
		
		ЗначениеТарифа 									=  ОписаниеЗначениеТарифа.Значение;
		ЗначениеТарифаСверхНормы						=  ОписаниеЗначениеТарифа.ЗначениеСверхНорматива;
		
		ОбъемУслугиСверхНормы 							= 0;
		Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ Тогда
			ЗначениеСоциальнойНормыРаспределение 		= Окр(ОбъемУслуги / ДанныеАбонента.ЗначениеПлощади * ДанныеАбонента.СоцПлощадь, ТочностьОбъемаНачислений);
			
			Если ДанныеАбонента.ОбъемУслуги  + ОбъемУслуги > ЗначениеСоциальнойНормыРаспределение И ДанныеАбонента.ЗначениеСоциальнойНормы >= 0 Тогда
				ОстатокСоцНорма 						= ОбъемУслуги - ЗначениеСоциальнойНормыРаспределение;
				ОбъемРаспределяем 						= ОбъемУслуги;
				Если ОстатокСоцНорма > 0 Тогда 
					ОбъемУслугиСверхНормы				= Мин(ОстатокСоцНорма,ОбъемРаспределяем);
				Иначе
					ОбъемУслугиСверхНормы 				= 0;	
				КонецЕсли;
				ОбъемУслуги 							= ОбъемРаспределяем - Макс(ОстатокСоцНорма, 0);
			КонецЕсли; 			
		КонецЕсли;		
		
		Если НЕ ОбъемУслуги = 0 Тогда 				
			СтрокаНабора.ЗначениеТарифа 				= ЗначениеТарифа;			
			СтрокаНабора.ОбъемУслугиПотребленный		= 0;//ОбъемУслуги;
			Если ДанныеПоУслуге.НеНачислятьУслугуАбонентам Тогда
				СтрокаНабора.ОбъемУслуги 				= 0;
			Иначе
				СтрокаНабора.ОбъемУслуги 				= ОбъемУслуги;
			КонецЕсли;
			СтрокаНабора.Сумма							= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
		ИначеЕсли ОбъемУслугиСверхНормы > 0 Тогда
			СтрокаНабора.СверхНорматива 				= Истина;
			СтрокаНабора.ЗначениеТарифа 				= ЗначениеТарифаСверхНормы;			
			СтрокаНабора.ОбъемУслуги					= ОбъемУслугиСверхНормы;
			СтрокаНабора.ОбъемУслугиПотребленный		= 0;
			СтрокаНабора.Сумма							= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
		КонецЕсли;
		
		Если НЕ ОбъемУслуги = 0 и НЕ ОбъемУслугиСверхНормы = 0 Тогда
			СтрокаСверхНормы 							= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСверхНормы,СтрокаНабора);
			СтрокаСверхНормы.СверхНорматива 			= Истина;
			СтрокаСверхНормы.ЗначениеТарифа 			= ЗначениеТарифаСверхНормы;			
			СтрокаСверхНормы.ОбъемУслуги				= ОбъемУслугиСверхНормы;
			СтрокаСверхНормы.ОбъемУслугиПотребленный	= 0;
			СтрокаСверхНормы.Сумма						= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
		КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(ОбщийОбъемНачислений.Добавить(), СтрокаНабора);			
	Иначе
		СтрокаНабора  									= НаборЗаписейПомещение.Добавить();
		СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
		СтрокаНабора.Район 								= Район;
		СтрокаНабора.Распределение 						= Истина;
		СтрокаНабора.Организация						= Организация;
		СтрокаНабора.ЧастныйСектор 						= Ложь;
		СтрокаНабора.Строение							= МКД;
		СтрокаНабора.Помещение							= ДанныеАбонента.Помещение; // TODO FIX ME
		СтрокаНабора.Услуга								= Услуга;
		СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
		СтрокаНабора.ВидНачисления 						= ВидНачисления;
		СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
		СтрокаНабора.ПериодРасчета						= ПериодНачисления;
		СтрокаНабора.ПериодНачисления					= ПериодНачисления;
		СтрокаНабора.ОбъемУслуги						= ОбъемУслуги;
		СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
		СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
		ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПомещений.Добавить(), СтрокаНабора);
		
		РазделенныеЛицевыеСчета 						= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
		ПомещенияПотомки								= РазделенныеЛицевыеСчета[ДанныеАбонента.Помещение];
		
		// проверить, есть ли помещения 3-его уровня вложенности

		ПомещенияПотомкиПотомков                        = Новый Соответствие();
		
		Если ПомещенияПотомки <> Неопределено Тогда
			Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
				Если Не РазделенныеЛицевыеСчета[ПомещениеПотомок.Ключ] = Неопределено Тогда
					Для Каждого ЭлементПотомок Из РазделенныеЛицевыеСчета[ПомещениеПотомок.Ключ] Цикл
						ПомещенияПотомкиПотомков.Вставить(ЭлементПотомок.КЛюч, ЭлементПотомок.Значение);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			
			Если ПомещенияПотомкиПотомков.Количество() > 0 Тогда
				ПомещенияПотомки = ПомещенияПотомкиПотомков;
			Иначе
				ПомещенияПотомки =  РазделенныеЛицевыеСчета[ДанныеАбонента.Помещение];
			КонецЕсли;
			
			// проверить, есть ли помещения 3-его уровня вложенности - конец
			
			СуммаПлощадейПомещения 							= 0;
			
			Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
				ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];
				СуммаПлощадейПомещения 						= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
			КонецЦикла;		
			
			ВсегоРаспределилиНаПотомков = 0;
			СчПотомков					= 0;
			Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
				СчПотомков									= СчПотомков + 1;
				ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];
				Если СчПотомков = ПомещенияПотомки.количество() Тогда
					ОбъемУслугиПотомка = ОбъемУслуги - ВсегоРаспределилиНаПотомков;
				Иначе
					ОбъемУслугиПотомка							= ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслуги * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);
				КонецЕсли;
				ОбъемУслугиПотомка							= Окр(ОбъемУслугиПотомка, ТочностьОбъемаНачислений);
				ВсегоРаспределилиНаПотомков					= ВсегоРаспределилиНаПотомков + ОбъемУслугиПотомка;
					
				ЗначениеСоциальнойНормы 					= -1;
				Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ Тогда
					ЗначениеСоциальнойНормы 				= 0;
					Если ДанныеПомещения.ЗначениеПлощади > (ДанныеПомещения.ЗначениеСоциальнойНормы * ДанныеПомещения.КоличествоЧеловек +  ДанныеПомещения.ДопСоциальнаяНормаПотребления)  Тогда 
						ЗначениеСоциальнойНормы 			= ОбъемУслугиПотомка * (ДанныеПомещения.ЗначениеСоциальнойНормы * ДанныеПомещения.КоличествоЧеловек +  ДанныеПомещения.ДопСоциальнаяНормаПотребления)  / ДанныеПомещения.ЗначениеПлощади;  
						ЗначениеСоциальнойНормы				= Окр(ЗначениеСоциальнойНормы, ТочностьОбъемаНачислений);
					Иначе	
						ЗначениеСоциальнойНормы 			= ОбъемУслугиПотомка;
					КонецЕсли;
				КонецЕсли;
				
				
				
				ХэшСтрокиТарифа 							= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,ТарифнаяЗона); 
				ЗначениеТарифа 								= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК", 0, 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
				СтрокаНабора  								= НаборЗаписей.Добавить();
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				СтрокаНабора.Район 							= Район;
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.Организация					= Организация;
				СтрокаНабора.ЧастныйСектор 					= Ложь;
				СтрокаНабора.Строение						= МКД;
				СтрокаНабора.Помещение						= ПомещениеПотомок.Ключ;
				СтрокаНабора.Абонент						= ДанныеПомещения.Абонент;
				СтрокаНабора.Услуга							= Услуга;
				СтрокаНабора.ТочкаУчета						= ПустаяТочкаУчета;
				СтрокаНабора.ВидНачисления 					= ВидНачисления;
				СтрокаНабора.НаправлениеИспользованияТУ 	= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
				СтрокаНабора.СпособНачисления 				= СпособНачисленияОДН;
				СтрокаНабора.ТарифнаяГруппа                 = ЗначениеТарифа.ГруппаПотребителей;
				СтрокаНабора.ТарифнаяЗона                   = ТарифнаяЗона;
				
				СтрокаНабора.Поставщик 						= ДанныеПомещения.Поставщик;
				СтрокаНабора.ПериодРасчета					= ПериодНачисления;
				СтрокаНабора.ПериодНачисления				= ПериодНачисления;
				СтрокаНабора.ЗначениеПлощади 				= ДанныеПомещения.ЗначениеПлощади;
				
				Если ОбъемУслугиПотомка > ЗначениеСоциальнойНормы  и ЗначениеСоциальнойНормы >= 0 Тогда									
					СтрокаНабора.ОбъемУслуги 				= ЗначениеСоциальнойНормы;
					СтрокаНабора.ЗначениеТарифа 			= ЗначениеТарифа.Значение;
					
					СтрокаСверхНормы 						= НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСверхНормы, СтрокаНабора);
					СтрокаСверхНормы.ЗначениеТарифа 		= ЗначениеТарифа.ЗначениеСверхНорматива;
					СтрокаСверхНормы.ОбъемУслуги 			= ОбъемУслугиПотомка - ЗначениеСоциальнойНормы;
					СтрокаСверхНормы.СверхНорматива 		= Истина;
					СтрокаСверхНормы.Сумма					= СтрокаСверхНормы.ОбъемУслуги * СтрокаСверхНормы.ЗначениеТарифа;
				Иначе
					СтрокаНабора.ОбъемУслуги 				= ОбъемУслугиПотомка;
					СтрокаНабора.ЗначениеТарифа 			= ЗначениеТарифа.Значение;
				КонецЕсли;
				
				СтрокаНабора.Сумма							= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;  
			КонецЦикла;			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#Область ОперацииПоРаспределениюОбъемаУслугиПотребленный

Процедура РаспределитьОбъемПотребленныйПоУслугеМКД(ПериодНачисления, Организация, Район, МКД, Услуга, ГраницыПериода, ЗначенияТарифов, ДанныеПоУслуге, ДокументОбъект, РаспределениеОбъемаПоУслугам, НаборОтрицательныйОбъемРаспределения, НаборЗаписей, НаборЗаписейПомещение,НаборЗаписейНП, НаборЗаписейСверхНорма)
	
	РаспределениеПоАбонентам 						= Новый Соответствие;
		
	ОбщийОбъемНачислений 							= ДанныеПоУслуге.ОбщийОбъемНачислений;
	ОбщийОбъемНачисленийПомещений 					= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений;
	ТочностьОбъемаНачислений 						= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.ОбъемУслугиПотребленный.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	ДанныеОбъемаКРаспределению 						= ДанныеОбъемаКРаспределениюПотребленный(ДанныеПоУслуге, Услуга, ГраницыПериода, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, ОбщийОбъемНачислений, ОбщийОбъемНачисленийПомещений);
	
	ВидНачисления 									= Перечисления.энргВидыНачислений.НачислениеОДН;	
	СпособНачисленияОДН 							= ДанныеОбъемаКРаспределению.СпособНачисленияОДН;//Перечисления.энргСпособНачислений.ПустаяСсылка();
	
	Для Каждого КлючЗначениеТарифнаяЗона Из ДанныеОбъемаКРаспределению.ОсталосьРаспределить Цикл 		
		ОсталосьРаспределить 		= КлючЗначениеТарифнаяЗона.Значение; 		
		СписываемИзОтрицательного 	= Мин(Макс(ОсталосьРаспределить,0), ДанныеПоУслуге.ОтрицательныйОбъемРаспределения.ОбъемУслугиПотребленный);
		ПроцентОтОбъема 			= ДанныеПоУслуге.ПроцентРаспределенияОтрицательногоОбъема;
				
		Если СписываемИзОтрицательного > 0 и ПроцентОтОбъема > 0 Тогда 		
			ОбъемПроцентаКРаспределению = Макс(ОсталосьРаспределить,0) * (ПроцентОтОбъема / 100);
			ОсталосьРаспределить		= ?(ОбъемПроцентаКРаспределению > СписываемИзОтрицательного, Макс(ОсталосьРаспределить,0) - СписываемИзОтрицательного, ОбъемПроцентаКРаспределению);
			СписываемИзОтрицательного	= ОсталосьРаспределить;		
		Иначе 
			ОсталосьРаспределить 		= ОсталосьРаспределить - СписываемИзОтрицательного;
		КонецЕсли; 
		
		ЗаполнитьНаборОтрицательногоОбъемаРаспределенияПотребленный(ОсталосьРаспределить, СписываемИзОтрицательного, НаборОтрицательныйОбъемРаспределения, Организация, ПериодНачисления, Район, МКД, Услуга, КлючЗначениеТарифнаяЗона.Ключ, ГраницыПериода.ЗавершениеОП - 1, ДанныеПоУслуге);
				
		Если ОсталосьРаспределить <= 0 Тогда
			Продолжить;
		КонецЕсли;
			
		АбонентыДляРаспределения 					= ДанныеПоУслуге.АбонентыДляРаспределения;
		Распределили 								= 0; 	
		Для Сч = 0 По АбонентыДляРаспределения.ВГраница() Цикл
			ДанныеАбонента 							= АбонентыДляРаспределения[Сч];						
			Если ЗначениеЗаполнено(ДанныеПоУслуге.ЗависитОтУслуги) Тогда
				ОбъемУслугиПотребленный 		= 0;			
				Если РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги] = Неопределено Тогда
					ОбъемУслугиПотребленный 	= 0; 
				ИначеЕсли РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги][ДанныеАбонента.Абонент] = Неопределено Тогда
					ОбъемУслугиПотребленный 	= 0;
				Иначе
					ОбъемУслугиПотребленный 	= РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги][ДанныеАбонента.Абонент] * ДанныеПоУслуге.ЗначениеНорматива;
				КонецЕсли;					
				
			ИначеЕсли Сч = АбонентыДляРаспределения.ВГраница() Тогда
				ОбъемУслугиПотребленный 		= ОсталосьРаспределить - Распределили;
				
			ИначеЕсли ДанныеПоУслуге.ВсегоПлощадьАбонентов = 0 Тогда
				ВызватьИсключение "Для МКД " + СокрЛП(МКД) + " не задана площадь помещений";	
			Иначе			
				кПлощади 						= ДанныеАбонента.ЗначениеПлощади / ДанныеПоУслуге.ВсегоПлощадьАбонентов;
				ОбъемУслугиПотребленный 		= ОсталосьРаспределить * кПлощади;				
			КонецЕсли;
			
			
			ОбъемУслуги 	= Окр(ОбъемУслугиПотребленный, ТочностьОбъемаНачислений);
			Распределили 	= Распределили + ОбъемУслуги;
			ЗаполнитьСтрокуНачисленийПриРаспределенииПотребленный(КлючЗначениеТарифнаяЗона.Ключ, ОбъемУслуги, СпособНачисленияОДН, ГраницыПериода, Организация, ПериодНачисления, Район, МКД, Услуга, ДанныеПоУслуге, ДанныеАбонента, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, ОбщийОбъемНачисленийПомещений, ОбщийОбъемНачислений);
			РаспределениеПоАбонентам.Вставить(ДанныеАбонента.Абонент, ОбъемУслуги);
		КонецЦикла;		
	КонецЦикла;
	
	Если РаспределениеОбъемаПоУслугам[Услуга] = Неопределено Тогда
		РаспределениеОбъемаПоУслугам.Вставить(Услуга, РаспределениеПоАбонентам);
	КонецЕсли;	
	
	ДанныеПоУслуге.ОбщийОбъемНачисленийПотребленный						= ОбщийОбъемНачислений;
	ДанныеПоУслуге.ОбщийОбъемНачисленийПомещенийПотребленный			= ОбщийОбъемНачисленийПомещений;
	
	
	
	
	//// УсловиеОтопления - если есть начисления по прибору
	//// и всего абонентов = всего с прибором
	//ПустаяТочкаУчета 										= Справочники.энргТочкиУчета.ПустаяСсылка();
	//ВидНачисления 											= Перечисления.энргВидыНачислений.Начисление;
	//
	//РаспределениеПоАбонентам 								= Новый Соответствие;
	//
	//ТочностьОбъемаНачислений 								= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.ОбъемУслуги.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	//ЕстьПотреблениеПоПрибору 								= ДанныеПоУслуге.ПоказанияПредоставленыПотребленный <> 0 ИЛИ НЕ ДанныеПоУслуге.ОбъемПотребленныйПоПрибору = 0;;	
	//НазначениеПрибораУчета 									= ДанныеПоУслуге.НазначениеПрибораУчета;
	//// TODO
	//// FIX ME
	//// Добавить распределение в разбивки тарифных зон
	////НадоРаспределитьПоФакту									= ДанныеПоУслуге.ОбъемПотребленныйПоПрибору + ДанныеПоУслуге.ОбъемПотребленныйБезПрибора;
	//
	//НадоРаспределить										= ДанныеПоУслуге.ОбъемПотребленныйПоПрибору + ДанныеПоУслуге.ОбъемПотребленныйБезПрибора;
	//
	//ВидНачисления 											= Перечисления.энргВидыНачислений.НачислениеОДН;	
	//СпособНачисленияОДН 									= Перечисления.энргСпособНачислений.ПустаяСсылка();
	//ОбщийОбъемНачислений 									= ДанныеПоУслуге.ОбщийОбъемНачисленийПотребленный;
	//ОбщийОбъемНачисленийПомещений 							= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещенийПотребленный;
	//
	//Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору И ДанныеПоУслуге.ВсеПоПриборуПотребленный Тогда
	//	ОсталосьРаспределить 								= НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентовПотребленный; 		
	//	СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
	//ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и НЕ ЕстьПотреблениеПоПрибору Тогда
	//	// Списываем начисленный индивидуальный объем по прибору учета
	//	Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.ОбъемПоПриборуКорректироватьПотребленный Цикл 
	//		Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
	//			яНабор 										= НаборЗаписей;
	//			яНаборОбщий 								= ОбщийОбъемНачислений;
	//		Иначе
	//			яНабор 										= НаборЗаписейПомещение;
	//			яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
	//		КонецЕсли;			
	//		
	//		Если СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам 
	//			ИЛИ СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
	//			Если НЕ СтрокаНачисленийАбонента.ОбъемУслугиПотребленный = 0 Тогда
	//				СтрокаНабора  				= яНабор.Добавить();
	//				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
	//				СтрокаНабора.Распределение 				= Истина;
	//				СтрокаНабора.ОбъемУслугиПотребленный	= -СтрокаНабора.ОбъемУслугиПотребленный;
	//				СтрокаНабора.Сумма 						= 0;
	//				СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
	//				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
	//			КонецЕсли;
	//			
	//			Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
	//				// добавляем новую строку начислений
	//				СтрокаНабора  							= яНабор.Добавить();
	//				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
	//				СтрокаНабора.Распределение 				= Истина;
	//				СтрокаНабора.СпособНачисления 			= Перечисления.энргСпособНачислений.ПоНормативу;
	//				ОбъемУслугиПотребленный 				= СтрокаНабора.НормаПотребления * СтрокаНабора.ЗначениеПлощади * ((СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП)) * (СтрокаНабора.КонецПериода - СтрокаНабора.НачалоПериода) / (ГраницыПериода.ДнейВПериоде * 86400);
	//				СтрокаНабора.ОбъемУслугиПотребленный 	= ОбъемУслугиПотребленный;
	//				СтрокаНабора.Сумма 						= 0;
	//				СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
	//				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
	//				РазделенныеЛицевыеСчета 				= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
	//				
	//				Если НЕ РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
	//					ОсталосьВнутриПомещения 			= ОбъемУслугиПотребленный;
	//					ПомещенияПотомки					= РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение];
	//					СуммаПлощадейПомещения 				= 0;
	//					Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
	//						ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];
	//						СуммаПлощадейПомещения 			= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
	//					КонецЦикла;		
	//					
	//					ПереасчитатьСтроки 					= Новый Массив;
	//					
	//					Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
	//						ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];       		
	//						
	//						
	//						СтрокаНабора  					= НаборЗаписей.Добавить();
	//						ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
	//						СтрокаНабора.Распределение 		= Истина;
	//						СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
	//						СтрокаНабора.Помещение			= ПомещениеПотомок.Ключ;
	//						СтрокаНабора.Абонент			= ДанныеПомещения.Абонент;						
	//						
	//						Если ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
	//							СтрокаНабора.ОбъемУслугиПотребленный 	= ДанныеПомещения.ФиксированныйОбъемПотребления;
	//							ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслугиПотребленный;
	//						ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
	//							СтрокаНабора.ОбъемУслугиПотребленный = ОбъемУслугиПотребленный * ДанныеПомещения.ДоляПотребленияЧислитель / ДанныеПомещения.ДоляПотребленияЗнаменатель;
	//							ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслугиПотребленный;
	//						ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда	
	//							ПереасчитатьСтроки.Добавить(НаборЗаписей.Индекс(СтрокаНабора));
	//						Иначе
	//							Если ЗначениеЗаполнено(ДанныеПоУслуге.ВидПлощади) Тогда
	//								СтрокаНабора.ОбъемУслугиПотребленный = ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслугиПотребленный * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);
	//							Иначе
	//								СтрокаНабора.ОбъемУслугиПотребленный = ?(НЕ СтрокаНачисленийАбонента.КоличествоЖильцов = 0, ОбъемУслугиПотребленный * ДанныеПомещения.КоличествоПроживающих / СтрокаНачисленийАбонента.КоличествоЖильцов, 0);
	//							КонецЕсли;
	//							ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслугиПотребленный;
	//						КонецЕсли;											
	//						
	//						СтрокаНабора.Сумма				= 0;				
	//					КонецЦикла;
	//					
	//					Если ПереасчитатьСтроки.Количество() > 0 Тогда
	//						Для Сч = 0 По ПереасчитатьСтроки.ВГраница() Цикл
	//							СтрокаНабора 							= НаборЗаписей.Получить(ПереасчитатьСтроки[Сч]);
	//							СтрокаНабора.ОбъемУслугиПотребленный 	= ОсталосьВнутриПомещения;
	//							СтрокаНабора.Сумма						= 0;
	//						КонецЦикла;						
	//					КонецЕсли;					
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;			
	//	КонецЦикла;
	//	
	//	Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.ОбъемПоПриборуНПКорректироватьПотребленный Цикл 
	//		Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
	//			яНабор 										= НаборЗаписейНП;
	//			яНаборОбщий 								= ОбщийОбъемНачислений;
	//		Иначе
	//			яНабор 										= НаборЗаписейПомещение;
	//			яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
	//		КонецЕсли;			
	//		
	//		Если СтрокаНачисленийНП.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам 
	//			ИЛИ СтрокаНачисленийНП.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
	//			Если НЕ СтрокаНачисленийНП.ОбъемУслугиПотребленный = 0 Тогда
	//				СтрокаНабора  				= яНабор.Добавить();
	//				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
	//				СтрокаНабора.Распределение 				= Истина;
	//				СтрокаНабора.ОбъемУслугиПотребленный 	= -СтрокаНабора.ОбъемУслугиПотребленный;
	//				СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
	//				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
	//			КонецЕсли;
	//			
	//			
	//			// добавляем новую строку начислений
	//			СтрокаНабора  							= яНабор.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
	//			СтрокаНабора.Распределение 				= Истина;
	//			СтрокаНабора.СпособНачисления 			= Перечисления.энргСпособНачислений.ПоНормативу;
	//			ОбъемУслугиПотребленный 				= СтрокаНабора.НормаПотребления * СтрокаНабора.ЗначениеПлощади * ((СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП)) * (СтрокаНабора.КонецПериода - СтрокаНабора.НачалоПериода) / (ГраницыПериода.ДнейВПериоде * 86400);

	//			СтрокаНабора.ОбъемУслугиПотребленный 	= ОбъемУслугиПотребленный;
	//			СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
	//			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
	//			
	//		КонецЕсли;			
	//	КонецЦикла;
	//	
	//	// просто распределяем объем по нормативу
	//	ОсталосьРаспределить 								= НадоРаспределить;
	//	
	//ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный > 0 Тогда
	//	// Высчитываем потребление приборников на 1м2
	//	ОбъемНаКвМ 											= 0; 		
	//	СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
	//	Если  ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный <> 0 Тогда
	//		ОбъемНаКвМ 										= ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный / ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный;			
	//	КонецЕсли;
	//	// Высчитываем "виртуальный" расход абонентов без прибора и корректируем объем потребления абонентов без прибора
	//	ПотреблениеАбонентов								= ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный;
	//	Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибораПотребленный Цикл
	//		// снимаем начисленный ранее объем
	//		ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
	//		ЕстьСуммаНачислений 							= Ложь;
	//		Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
	//			яНабор 										= НаборЗаписей;
	//			яНаборОбщий 								= ОбщийОбъемНачислений;
	//			ЕстьСуммаНачислений 						= Истина;
	//		Иначе
	//			яНабор 										= НаборЗаписейПомещение;
	//			яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
	//		КонецЕсли;
	//		
	//		ИндексАбонента 									= Неопределено;
	//		
	//		// ищем строку в массиве
	//		Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
	//			Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
	//				ИндексАбонента 							= Сч;
	//				Прервать;
	//			КонецЕсли;					
	//		КонецЦикла;
	//					
	//		Если НЕ СтрокаНачисленийАбонента.ОбъемУслугиПотребленный = 0 Тогда
	//			СтрокаНабора  								= яНабор.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
	//			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
	//			СтрокаНабора.Распределение 					= Истина;
	//			СтрокаНабора.ОбъемУслуги 					= 0;
	//			СтрокаНабора.ОбъемУслугиСоцНорма 			= 0;
	//			СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;	
	//			
	//			
	//			ДанныеАбонента 								= ДанныеПоУслуге.АбонентыДляРаспределения[ИндексАбонента];
	//			ДанныеАбонента.ОбъемУслугиПотребленный 		= ДанныеАбонента.ОбъемУслугиПотребленный + СтрокаНабора.ОбъемУслугиПотребленный;
	//			
	//			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
	//		КонецЕсли;
	//		
	//		Если СтрокаНачисленийАбонента.СверхНорматива Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда

	//				
	//				ИндексАбонента 							= Неопределено;
	//				
	//				// ищем строку в массиве
	//				Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
	//					Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
	//						ИндексАбонента 					= Сч;
	//						Прервать;
	//					КонецЕсли;					
	//				КонецЦикла; 					
	//				
	//				КоэфДлительностиПериода 				= 1;
	//				СоцПлощадь								= 0;
	//				Если НЕ ИндексАбонента = Неопределено Тогда
	//					ДатаСостоянияЛицевогоСчета 			= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].ДатаСостоянияЛицевогоСчета;
	//					СоцПлощадь 							= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].СоцПлощадь;
	//					Если ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) и ДатаСостоянияЛицевогоСчета <= ГраницыПериода.НачалоОП Тогда
	//						КоэфДлительностиПериода 		= 1;
	//					ИначеЕсли ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) Тогда 
	//						КоэфДлительностиПериода 		= (ГраницыПериода.НачалоОП - ДатаСостоянияЛицевогоСчета) / (ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
	//					КонецЕсли;						
	//				КонецЕсли;					
	//				
	//				ОбъемУслугиПотребленный 				= Окр(ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода,ТочностьОбъемаНачислений);
	//				ПотреблениеАбонентов 					= ПотреблениеАбонентов + ОбъемУслугиПотребленный;		
	//				
	//				СуммаПлощадейПомещения 					= 0;
	//									
	//				РазбитьПоСоцНорме(яНабор,яНаборОбщий,НаборЗаписей,СтрокаНачисленийАбонента,ОбъемУслугиПотребленный,СоцПлощадь,СпособНачисленияОДН,ГраницыПериода,ДанныеПоУслуге,ЕстьСуммаНачислений,ЗначенияТарифов,Услуга,ПотреблениеАбонентов,СуммаПлощадейПомещения,Истина);
	//			КонецЕсли;			
	//	КонецЦикла;
	//	
	//	// объем потребления НП без прибора
	//	Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.НачисленияНПБезПрибораПотребленный Цикл
	//		// снимаем начисленный ранее объем
	//		ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийНП.ОбъектРасчета];
	//		ЕстьСуммаНачислений 							= Ложь;
	//		Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
	//			яНабор 										= НаборЗаписейНП;
	//			яНаборОбщий 								= ОбщийОбъемНачислений;
	//			ЕстьСуммаНачислений 						= Истина;
	//		Иначе
	//			яНабор 										= НаборЗаписейПомещение;
	//			яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
	//		КонецЕсли;		
	//		
	//		Если НЕ СтрокаНачисленийНП.ОбъемУслуги = 0 Тогда
	//			СтрокаНабора  								= яНабор.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
	//			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
	//			СтрокаНабора.Распределение 					= Истина;
	//			СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;
	//			СтрокаНабора.ОбъемУслуги 					= 0;				
	//			//СтрокаНабора.Сумма 							= 0;				
	//			
	//			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
	//		КонецЕсли;
	//		
	//		
	//		СтрокаНабора  								= яНабор.Добавить();
	//		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
	//		СтрокаНабора.Распределение 					= Истина;
	//		СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
	//		КоэфДлительностиПериода 					= (СтрокаНачисленийНП.КонецПериода - СтрокаНачисленийНП.НачалоПериода)/(ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
	//		ОбъемУслугиПотребленный 					= ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода; 			
	//		СтрокаНабора.ОбъемУслуги 					= 0;			
	//		СтрокаНабора.ОбъемУслугиПотребленный 		= ОбъемУслугиПотребленный;			
	//		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;			
	//		ПотреблениеАбонентов 						= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслугиПотребленный;
	//					
	//		ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
	//		
	//	КонецЦикла;

	//	
	//	ОсталосьРаспределить 								= НадоРаспределить - ПотреблениеАбонентов;
	//ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору Тогда
	//	ОтапливаемаяПлощадь									= ДанныеПоУслуге.ВсегоПлощадьАбонентов - ДанныеПоУслуге.ВсегоПлощадьАбонентовСобственнаяПоставка + ДанныеПоУслуге.ПлощадьМОП;
	//	ОбъемНаКвМ 											= ?(ОтапливаемаяПлощадь = 0, 0, ДанныеПоУслуге.ОбъемПотребленныйПоПрибору / ОтапливаемаяПлощадь);	
	//	
	//	СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
	//	ПотреблениеАбонентов								= 0; 		
	//	ПомещенияНачислили 									= Новый Соответствие;
	//	Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибораПотребленный Цикл
	//		
	//			ЕстьСуммаНачислений 							= Ложь;
	//			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
	//				яНабор 										= НаборЗаписей;
	//				яНаборОбщий 								= ОбщийОбъемНачислений;
	//				ЕстьСуммаНачислений 						= Истина;
	//			Иначе
	//				яНабор 										= НаборЗаписейПомещение;
	//				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
	//			КонецЕсли;
	//			
	//			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
	//			
	//			// снимаем начисленный ранее объем
	//			
	//			СтрокаНабора  								= яНабор.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
	//			СтрокаНабора.Распределение 					= Истина;
	//			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда					
	//				СтрокаНабора.Сумма		 			= 0;
	//				СтрокаНабора.ЗначениеТарифа		 	= СтрокаНачисленийАбонента.ЗначениеТарифа;					  
	//			КонецЕсли;
	//			СтрокаНабора.ОбъемУслуги 					= 0;
	//			// Снятие объема потребленного при сторнировании объема услуги
	//			СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;
	//			// Снятие объема потребленного при сторнировании объема услуги
	//			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
	//			
	//			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
	//			
	//			Если СтрокаНачисленийАбонента.СверхНорматива Тогда
	//				Продолжить;
	//			КонецЕсли;
	//						
	//			Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
	//				
	//				Если НЕ ПомещенияНачислили[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
	//					Продолжить;
	//				КонецЕсли;
	//									
	//				ИндексАбонента 									= Неопределено;
	//				
	//				// ищем строку в массиве
	//				Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
	//					Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
	//						ИндексАбонента 							= Сч;
	//						Прервать;
	//					КонецЕсли;					
	//				КонецЦикла;
	//				
	//				КоэфДлительностиПериода 				= 1;
	//				СоцПлощадь								= 0;
	//				Если НЕ ИндексАбонента = Неопределено Тогда
	//					ДатаСостоянияЛицевогоСчета 			= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].ДатаСостоянияЛицевогоСчета;
	//					СоцПлощадь 							= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].СоцПлощадь;
	//					Если ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) и ДатаСостоянияЛицевогоСчета <= ГраницыПериода.НачалоОП Тогда
	//						КоэфДлительностиПериода 		= 1;
	//					ИначеЕсли ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) Тогда 
	//						КоэфДлительностиПериода 		= (ГраницыПериода.НачалоОП - ДатаСостоянияЛицевогоСчета) / (ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
	//					КонецЕсли;						
	//				КонецЕсли;					
	//				
	//				ОбъемУслугиПотребленный 				= Окр(ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода,ТочностьОбъемаНачислений);
	//				ПотреблениеАбонентов 					= ПотреблениеАбонентов + ОбъемУслугиПотребленный;		
	//				
	//				СуммаПлощадейПомещения 					= 0;
	//				
	//				РазбитьПоСоцНорме(яНабор,яНаборОбщий,НаборЗаписей,СтрокаНачисленийАбонента,ОбъемУслугиПотребленный,СоцПлощадь,СпособНачисленияОДН,ГраницыПериода,ДанныеПоУслуге,ЕстьСуммаНачислений,ЗначенияТарифов,Услуга,ПотреблениеАбонентов,СуммаПлощадейПомещения,Истина);
	//				
	//				ПомещенияНачислили.Вставить(СтрокаНачисленийАбонента.Помещение, Истина);					
	//			КонецЕсли; 	
	//			
	//	КонецЦикла;
	//	
	//	Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.НачисленияНПБезПрибораПотребленный Цикл
	//		ЕстьСуммаНачислений 							= Ложь;
	//				
	//		Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
	//			яНабор 										= НаборЗаписейНП;
	//			яНаборОбщий 								= ОбщийОбъемНачислений;
	//			ЕстьСуммаНачислений 						= Истина;
	//		Иначе
	//			яНабор 										= НаборЗаписейПомещение;
	//			яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
	//		КонецЕсли;	
	//		
	//		ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийНП.ОбъектРасчета];
	//		
	//		// снимаем начисленный ранее объем
	//		Если НЕ СтрокаНачисленийНП.ОбъемУслугиПотребленный = 0 Тогда
	//			СтрокаНабора  								= яНабор.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
	//			СтрокаНабора.Распределение 					= Истина;
	//			//СтрокаНабора.Сумма		 				= 0;
	//			СтрокаНабора.ОбъемУслуги 					= 0;				
	//			СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;				
	//			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
	//			
	//			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
	//		КонецЕсли;
	//		
	//		СтрокаНабора  								= яНабор.Добавить();
	//		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
	//		СтрокаНабора.Распределение 					= Истина;
	//		СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
	//		ОбъемУслугиПотребленный 					= ЗначениеПлощади * ОбъемНаКвМ;			
	//		КоэфДлительностиПериода 					= (СтрокаНачисленийНП.КонецПериода - СтрокаНачисленийНП.НачалоПериода)/(ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
	//		СтрокаНабора.ОбъемУслуги 					= 0;			
	//		СтрокаНабора.ОбъемУслугиПотребленный 		= ОбъемУслугиПотребленный * КоэфДлительностиПериода;			
	//		СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;			
	//		ПотреблениеАбонентов 						= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслугиПотребленный;			
	//		ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
	//		
	//	КонецЦикла;
	//	
	//	ОсталосьРаспределить 									= НадоРаспределить - ПотреблениеАбонентов;				
	//ИначеЕсли ЕстьПотреблениеПоПрибору и НазначениеПрибораУчета = Перечисления.энргНазначениеПУ.МОП Тогда
	//	ОсталосьРаспределить 									= НадоРаспределить;		
	//	СпособНачисленияОДН 									= ДанныеПоУслуге.СпособНачисленияМКД;
	//ИначеЕсли ЕстьПотреблениеПоПрибору Тогда
	//	ОсталосьРаспределить 									= НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентовПотребленный;		
	//	СпособНачисленияОДН 									= ДанныеПоУслуге.СпособНачисленияМКД;	
	//Иначе
	//	ОсталосьРаспределить 									= НадоРаспределить; 		
	//	СпособНачисленияОДН 									= Перечисления.энргСпособНачислений.ПоНормативу;
	//КонецЕсли;
	//	
	//СписываемИзОтрицательного 	= Мин(Макс(ОсталосьРаспределить,0), ДанныеПоУслуге.ОтрицательныйОбъемРаспределения.ОбъемУслугиПотребленный);
	//ПроцентОтОбъема 			= ДанныеПоУслуге.ПроцентРаспределенияОтрицательногоОбъема;
	//Если СписываемИзОтрицательного > 0 и ПроцентОтОбъема > 0 Тогда 		
	//	ОбъемПроцентаКРаспределению = Макс(ОсталосьРаспределить,0) * (ПроцентОтОбъема / 100);
	//	ОсталосьРаспределить		= ?(ОбъемПроцентаКРаспределению > СписываемИзОтрицательного, Макс(ОсталосьРаспределить,0) - СписываемИзОтрицательного, ОбъемПроцентаКРаспределению);
	//	СписываемИзОтрицательного	= ОсталосьРаспределить;		
	//Иначе 
	//	ОсталосьРаспределить 		= ОсталосьРаспределить - СписываемИзОтрицательного;
	//КонецЕсли;	
	//
	//Если Не ДанныеПоУслуге.РаспределятьПолностью И Не ДанныеПоУслуге.НеРаспределятьСверхнорматив Тогда
	//	Если ОсталосьРаспределить > ДанныеПоУслуге.ОбъемУслугиНорматив  Тогда
	//		СверхнормативМКД 									= ОсталосьРаспределить - ДанныеПоУслуге.ОбъемУслугиНорматив;
	//		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоНормативу;
	//		ОсталосьРаспределить 								= ДанныеПоУслуге.ОбъемУслугиНорматив;
	//		//добавить сверх в регистр
	//		
	//		СтрокаНабора  										= НаборЗаписейСверхНорма.Добавить();
	//		СтрокаНабора.Период 								= ГраницыПериода.ЗавершениеОП-1;
	//		СтрокаНабора.Район 									= Район;
	//		СтрокаНабора.Организация							= Организация;
	//		СтрокаНабора.МКД									= МКД;
	//		СтрокаНабора.Услуга									= Услуга;
	//		СтрокаНабора.ОбъемУслугиПотребленный				= СверхнормативМКД;			
	//	КонецЕсли;		
	//КонецЕсли;	
	//
	//Если ОсталосьРаспределить < 0 Тогда
	//	СтрокаНабораОтрицательный  								= НаборОтрицательныйОбъемРаспределения.ДобавитьПриход();
	//	СтрокаНабораОтрицательный.Период	 					= ГраницыПериода.ЗавершениеОП-1;
	//	СтрокаНабораОтрицательный.Организация 					= Организация;
	//	СтрокаНабораОтрицательный.Район 						= Район;
	//	СтрокаНабораОтрицательный.МКД 							= МКД;
	//	СтрокаНабораОтрицательный.Услуга 						= Услуга;
	//	СтрокаНабораОтрицательный.ПериодНачисления				= ПериодНачисления;
	//	СтрокаНабораОтрицательный.ОбъемУслугиПотребленный		= -ОсталосьРаспределить;
	//	СтрокаНабораОтрицательный.ПериодРасчета 				= ПериодНачисления;
	//КонецЕсли;	
	//
	//Если СписываемИзОтрицательного > 0 Тогда
	//	ОтрицательныйОбъемРасшифровка 							= ДанныеПоУслуге.ОтрицательныйОбъемРаспределения.Расшифровка;
	//	ИндексРасшифровки 										= 0;
	//	ОсталосьСписатьИзОтрицательного 						= СписываемИзОтрицательного;
	//	Пока ОсталосьСписатьИзОтрицательного > 0 и ИндексРасшифровки < ОтрицательныйОбъемРасшифровка.Количество() Цикл
	//		Снимаем 											= Мин(ОсталосьСписатьИзОтрицательного,ОтрицательныйОбъемРасшифровка[ИндексРасшифровки].ОбъемУслугиПотребленный);
	//		СтрокаНабораОтрицательный  							= НаборОтрицательныйОбъемРаспределения.ДобавитьРасход();
	//		СтрокаНабораОтрицательный.Период	 				= ГраницыПериода.ЗавершениеОП-1;
	//		СтрокаНабораОтрицательный.Организация 				= Организация;
	//		СтрокаНабораОтрицательный.Район 					= Район;
	//		СтрокаНабораОтрицательный.МКД 						= МКД;
	//		СтрокаНабораОтрицательный.Услуга 					= Услуга;
	//		СтрокаНабораОтрицательный.ПериодНачисления			= ОтрицательныйОбъемРасшифровка[ИндексРасшифровки].ПериодНачисленияОбъема;
	//		СтрокаНабораОтрицательный.ОбъемУслугиПотребленный	= Снимаем;
	//		СтрокаНабораОтрицательный.ПериодРасчета 			= ПериодНачисления;			
	//		ИндексРасшифровки 									= ИндексРасшифровки + 1;
	//		ОсталосьСписатьИзОтрицательного 					= ОсталосьСписатьИзОтрицательного - Снимаем;
	//	КонецЦикла;		
	//КонецЕсли;	
	//
	//Если ОсталосьРаспределить <= 0 Тогда
	//	Возврат;
	//КонецЕсли;	
	//		
	//АбонентыДляРаспределения 									= ДанныеПоУслуге.АбонентыДляРаспределения;
	//Распределили 												= 0; 	
	//Для Сч = 0 По АбонентыДляРаспределения.ВГраница() Цикл
	//	ДанныеАбонента 											= АбонентыДляРаспределения[Сч];		
	//		
	//	Если ЗначениеЗаполнено(ДанныеПоУслуге.ЗависитОтУслуги) Тогда
	//		ОбъемУслугиПотребленный 							= 0;			
	//		Если РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги] = Неопределено Тогда
	//			ОбъемУслугиПотребленный 						= 0; 
	//		ИначеЕсли РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги][ДанныеАбонента.Абонент] = Неопределено Тогда
	//			ОбъемУслугиПотребленный 						= 0;
	//		Иначе
	//			ОбъемУслугиПотребленный 						= РаспределениеОбъемаПоУслугам[ДанныеПоУслуге.ЗависитОтУслуги][ДанныеАбонента.Абонент] * ДанныеПоУслуге.ЗначениеНорматива;
	//		КонецЕсли;
	//		
	//		
	//	ИначеЕсли Сч = АбонентыДляРаспределения.ВГраница() Тогда
	//		ОбъемУслугиПотребленный 							= ОсталосьРаспределить - Распределили;
	//		
	//	ИначеЕсли ДанныеПоУслуге.ВсегоПлощадьАбонентов = 0 Тогда
	//		ВызватьИсключение "Для МКД " + СокрЛП(МКД) + " не задана площадь помещений";	
	//	Иначе			
	//		кПлощади 										= ДанныеАбонента.ЗначениеПлощади / ДанныеПоУслуге.ВсегоПлощадьАбонентов;
	//		ОбъемУслугиПотребленный 						= ОсталосьРаспределить * кПлощади;
	//		
	//	КонецЕсли; 				
	//	
	//	РаспределениеПоАбонентам.Вставить(ДанныеАбонента.Абонент, ОбъемУслугиПотребленный);
	//	
	//	
	//	Если ДанныеАбонента.НП Тогда
	//		
	//		СтрокаНабора  									= НаборЗаписейНП.Добавить();
	//		СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
	//		СтрокаНабора.Район 								= Район;
	//		СтрокаНабора.Распределение 						= Истина;
	//		СтрокаНабора.Организация						= Организация;
	//		СтрокаНабора.МКД 								= МКД;
	//		СтрокаНабора.Договор							= ДанныеАбонента.Договор;
	//		СтрокаНабора.ОбъектРасчета						= ДанныеАбонента.Абонент;
	//		СтрокаНабора.Услуга								= Услуга;
	//		СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
	//		СтрокаНабора.ВидНачисления 						= ВидНачисления;
	//		СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;			
	//		СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
	//		СтрокаНабора.ПериодРасчета						= ПериодНачисления;
	//		СтрокаНабора.ПериодНачисления					= ПериодНачисления;
	//		
	//		Если ДанныеАбонента.РасчетПоФактическомуОбъему Тогда
	//			СтрокаНабора.ОбъемУслуги					= ОбъемУслугиПотребленный;
	//			СтрокаНабора.ОбъемУслугиПотребленный		= 0;				
	//		Иначе
	//			СтрокаНабора.ОбъемУслуги					= 0;
	//			СтрокаНабора.ОбъемУслугиПотребленный		= ОбъемУслугиПотребленный;
	//		КонецЕсли;
	//					
	//		СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
	//		Распределили 									= Распределили + СтрокаНабора.ОбъемУслугиПотребленный;
	//		
	//					
	//	ИначеЕсли ЗначениеЗаполнено(ДанныеАбонента.Абонент) Тогда
	//		ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа,Услуга,ДанныеАбонента.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
	//		ОписаниеЗначениеТарифа 							= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК, ЗначениеСверхНорматива", 0,0,0), ЗначенияТарифов[ХэшСтрокиТарифа]);
	//		
	//		СтрокаНабора  									= НаборЗаписей.Добавить();
	//		СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
	//		СтрокаНабора.Район 								= Район;
	//		СтрокаНабора.Распределение 						= Истина;
	//		СтрокаНабора.Организация						= Организация;
	//		СтрокаНабора.ЧастныйСектор 						= Ложь;
	//		СтрокаНабора.Строение							= МКД;
	//		СтрокаНабора.Помещение							= ДанныеАбонента.Помещение;
	//		СтрокаНабора.Абонент							= ДанныеАбонента.Абонент;
	//		СтрокаНабора.Услуга								= Услуга;
	//		СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
	//		СтрокаНабора.ВидНачисления 						= ВидНачисления;
	//		СтрокаНабора.НаправлениеИспользованияТУ 		= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
	//		СтрокаНабора.Измеритель 						= Справочники.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка();
	//		СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
	//		СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
	//		СтрокаНабора.ПериодРасчета						= ПериодНачисления;
	//		СтрокаНабора.ПериодНачисления					= ПериодНачисления;
	//		СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
	//		СтрокаНабора.ОбъемУслуги						= 0;
	//		СтрокаНабора.ОбъемУслугиПотребленный			= ОбъемУслугиПотребленный;
	//		СтрокаНабора.ТарифнаяГруппа                     = ДанныеАбонента.ТарифнаяГруппа;
	//		СтрокаНабора.ТарифнаяЗона                     	= ДанныеАбонента.ТарифнаяЗона;
	//	
	//		Распределили 									= Распределили + СтрокаНабора.ОбъемУслугиПотребленный;
	//		ЗначениеТарифаСверхНормы						= ?(НЕ ИспользоватьТарифРек, ОписаниеЗначениеТарифа.ЗначениеСверхНорматива, ОписаниеЗначениеТарифа.ЗначениеТарифаРЭК);
	//		ЗначениеТарифа 									= ?(НЕ ИспользоватьТарифРек, ОписаниеЗначениеТарифа.Значение, ОписаниеЗначениеТарифа.ЗначениеТарифаРЭК);
	//		СтрокаНабора.ЗначениеТарифа						= ЗначениеТарифа;
	//		
	//		ОбъемУслугиСверхНормы 							= 0;
	//		Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ Тогда
	//			ЗначениеСоциальнойНормыРаспределение 	= ОбъемУслугиПотребленный / ДанныеАбонента.ЗначениеПлощади * ДанныеАбонента.СоцПлощадь;
	//			
	//			Если ДанныеАбонента.ОбъемУслугиПотребленный  + ОбъемУслугиПотребленный > ЗначениеСоциальнойНормыРаспределение И ДанныеАбонента.ЗначениеСоциальнойНормы >= 0 Тогда
	//				ОстатокСоцНорма 						= ОбъемУслугиПотребленный - ЗначениеСоциальнойНормыРаспределение;
	//				ОбъемРаспределяем 						= ОбъемУслугиПотребленный;
	//				Если ОстатокСоцНорма > 0 Тогда 
	//					ОбъемУслугиСверхНормы						= Мин(ОстатокСоцНорма,ОбъемРаспределяем);
	//				Иначе
	//					ОбъемУслугиСверхНормы 						= 0;	
	//				КонецЕсли;
	//				ОбъемУслугиПотребленный 					= ОбъемРаспределяем - Макс(ОстатокСоцНорма, 0);
	//			КонецЕсли; 			
	//		КонецЕсли;		
	//		
	//		Если НЕ ОбъемУслугиПотребленный = 0 Тогда 						
	//			СтрокаНабора.ОбъемУслуги		= 0;
	//			Если ДанныеПоУслуге.НеНачислятьУслугуАбонентам Тогда
	//				СтрокаНабора.ОбъемУслугиПотребленный 				= 0;
	//			Иначе
	//				СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный;
	//			КонецЕсли;
	//		ИначеЕсли ОбъемУслугиСверхНормы > 0 Тогда
	//			СтрокаНабора.СверхНорматива 				= Истина;
	//			СтрокаНабора.ЗначениеТарифа 				= ЗначениеТарифаСверхНормы;			
	//			СтрокаНабора.ОбъемУслуги					= 0;
	//			СтрокаНабора.ОбъемУслугиПотребленный		= ОбъемУслугиСверхНормы;
	//			СтрокаНабора.Сумма							= 0;
	//		КонецЕсли;
	//		
	//		Если НЕ ОбъемУслугиПотребленный = 0 и НЕ ОбъемУслугиСверхНормы = 0 Тогда
	//			СтрокаСверхНормы 							= НаборЗаписей.Добавить();
	//			ЗаполнитьЗначенияСвойств(СтрокаСверхНормы,СтрокаНабора);
	//			СтрокаСверхНормы.СверхНорматива 			= Истина;
	//			СтрокаСверхНормы.ЗначениеТарифа 			= ЗначениеТарифаСверхНормы;			
	//			СтрокаСверхНормы.ОбъемУслуги				= 0;
	//			СтрокаСверхНормы.ОбъемУслугиПотребленный	= ОбъемУслугиСверхНормы;
	//		КонецЕсли;
	//		
	//		ЗаполнитьЗначенияСвойств(ОбщийОбъемНачислений.Добавить(), СтрокаНабора);			
	//	Иначе
	//		
	//		//ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа,Услуга,ДанныеАбонента.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
	//		//ОписаниеЗначениеТарифа 							= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК, ЗначениеСверхНорматива", 0,0,0), ЗначенияТарифов[ХэшСтрокиТарифа]); 			
	//		
	//		СтрокаНабора  									= НаборЗаписейПомещение.Добавить();
	//		СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
	//		СтрокаНабора.Район 								= Район;
	//		СтрокаНабора.Распределение 						= Истина;
	//		СтрокаНабора.Организация						= Организация;
	//		СтрокаНабора.ЧастныйСектор 						= Ложь;
	//		СтрокаНабора.Строение							= МКД;
	//		СтрокаНабора.Помещение							= ДанныеАбонента.Помещение; // TODO FIX ME
	//		СтрокаНабора.Услуга								= Услуга;
	//		СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
	//		СтрокаНабора.ВидНачисления 						= ВидНачисления;
	//		СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
	//		СтрокаНабора.ПериодРасчета						= ПериодНачисления;
	//		СтрокаНабора.ПериодНачисления					= ПериодНачисления;
	//		СтрокаНабора.ОбъемУслуги						= 0;
	//		СтрокаНабора.ОбъемУслугиПотребленный			= ОбъемУслугиПотребленный;
	//		СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
	//		СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
	//		//СтрокаНабора.ЗначениеТарифа 					= ?(НЕ ИспользоватьТарифРек, ОписаниеЗначениеТарифа.Значение, ОписаниеЗначениеТарифа.ЗначениеТарифаРЭК);
	//		
	//		ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПомещений.Добавить(), СтрокаНабора);
	//		
	//		Распределили 									= Распределили + СтрокаНабора.ОбъемУслугиПотребленный;
	//		
	//		
	//		РазделенныеЛицевыеСчета 						= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
	//		ПомещенияПотомки								= РазделенныеЛицевыеСчета[ДанныеАбонента.Помещение];
	//		СуммаПлощадейПомещения 							= 0;
	//		Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
	//			ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];
	//			СуммаПлощадейПомещения 						= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
	//		КонецЦикла;		
	//		
	//		Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
	//			ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];
	//			ОбъемУслугиПотомка							= ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслугиПотребленный * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);;
	//			ЗначениеСоциальнойНормы 					= -1;
	//			Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ Тогда
	//				ЗначениеСоциальнойНормы 				= ОбъемУслугиПотомка * (ДанныеПомещения.ЗначениеСоциальнойНормы * ДанныеПомещения.КоличествоЧеловек)  / ДанныеПомещения.ЗначениеПлощади 
	//			КонецЕсли;
	//			ХэшСтрокиТарифа 							= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
	//			ЗначениеТарифа 								= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК", 0, 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
	//							
	//			ХэшСтрокиТарифа 							= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
	//			ЗначениеТарифа 								= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК", 0, 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
	//			СтрокаНабора  								= НаборЗаписей.Добавить();
	//			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
	//			СтрокаНабора.Район 							= Район;
	//			СтрокаНабора.Распределение 					= Истина;
	//			СтрокаНабора.Организация					= Организация;
	//			СтрокаНабора.ЧастныйСектор 					= Ложь;
	//			СтрокаНабора.Строение						= МКД;
	//			СтрокаНабора.Помещение						= ПомещениеПотомок.Ключ;
	//			СтрокаНабора.Абонент						= ДанныеПомещения.Абонент;
	//			СтрокаНабора.Услуга							= Услуга;
	//			СтрокаНабора.ТочкаУчета						= ПустаяТочкаУчета;
	//			СтрокаНабора.ВидНачисления 					= ВидНачисления;
	//			СтрокаНабора.НаправлениеИспользованияТУ 	= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
	//			СтрокаНабора.СпособНачисления 				= СпособНачисленияОДН;
	//			СтрокаНабора.ЗначениеТарифа 				= ?(НЕ ИспользоватьТарифРек, ЗначениеТарифа.Значение, ЗначениеТарифа.ЗначениеТарифаРЭК);
	//			СтрокаНабора.Поставщик 						= ДанныеПомещения.Поставщик;
	//			СтрокаНабора.ПериодРасчета					= ПериодНачисления;
	//			СтрокаНабора.ПериодНачисления				= ПериодНачисления;
	//			СтрокаНабора.ЗначениеПлощади 				= ДанныеПомещения.ЗначениеПлощади;
	//			СтрокаНабора.ТарифнаяЗона                   = ДанныеАбонента.ТарифнаяЗона;
	//			СтрокаНабора.ТарифнаяГруппа                 = ДанныеАбонента.ТарифнаяГруппа;
	//			СтрокаНабора.ОбъемУслуги					= 0;				 									
	//			СтрокаНабора.Сумма							= 0;
	//			
	//			Если ОбъемУслугиПотомка > ЗначениеСоциальнойНормы И ЗначениеСоциальнойНормы >= 0 Тогда									
	//				СтрокаНабора.ОбъемУслугиПотребленный 				= ЗначениеСоциальнойНормы;					
	//				СтрокаНабора.ЗначениеТарифа 			= ?(НЕ ИспользоватьТарифРек, ЗначениеТарифа.Значение, ЗначениеТарифа.ЗначениеТарифаРЭК);
	//				
	//				СтрокаСверхНормы 						= НаборЗаписей.Добавить();
	//				ЗаполнитьЗначенияСвойств(СтрокаСверхНормы, СтрокаНабора);
	//				СтрокаСверхНормы.ЗначениеТарифа 		= ?(НЕ ИспользоватьТарифРек, ЗначениеТарифа.ЗначениеСверхНорматива, ЗначениеТарифа.ЗначениеТарифаРЭК);
	//				СтрокаСверхНормы.ОбъемУслугиПотребленный= ОбъемУслугиПотомка - ЗначениеСоциальнойНормы;
	//				СтрокаСверхНормы.СверхНорматива 		= Истина;
	//				СтрокаСверхНормы.Сумма					= 0;
	//			Иначе
	//				СтрокаНабора.ОбъемУслугиПотребленный 	= ОбъемУслугиПотомка;
	//				СтрокаНабора.ЗначениеТарифа 			= ?(НЕ ИспользоватьТарифРек, ЗначениеТарифа.Значение, ЗначениеТарифа.ЗначениеТарифаРЭК);
	//			КонецЕсли;								
	//		КонецЦикла;			
	//	КонецЕсли;
	//КонецЦикла;	  
	//
	//Если РаспределениеОбъемаПоУслугам[Услуга] = Неопределено Тогда
	//	РаспределениеОбъемаПоУслугам.Вставить(Услуга, РаспределениеПоАбонентам);
	//КонецЕсли;	
	//
	//ДанныеПоУслуге.ОбщийОбъемНачисленийПотребленный						= ОбщийОбъемНачислений;
	//ДанныеПоУслуге.ОбщийОбъемНачисленийПомещенийПотребленный			= ОбщийОбъемНачисленийПомещений;
	
КонецПроцедуры

Функция ДанныеОбъемаКРаспределениюПотребленный(ДанныеПоУслуге, Услуга, ГраницыПериода, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, ОбщийОбъемНачислений, ОбщийОбъемНачисленийПомещений)
	
	// УсловиеОтопления - если есть начисления по прибору
	// и всего абонентов = всего с прибором
	//ПустаяТочкаУчета 										= Справочники.энргТочкиУчета.ПустаяСсылка();
	//ВидНачисления 											= Перечисления.энргВидыНачислений.Начисление;
	
	РаспределениеПоАбонентам 								= Новый Соответствие;
	
	ОсталосьРаспределить 									= Новый Соответствие;
	ТочностьОбъемаНачислений 								= Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.ОбъемУслуги.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	ЕстьПотреблениеПоПрибору 								= ДанныеПоУслуге.ПоказанияПредоставленыПотребленный <> 0 ИЛИ НЕ ДанныеПоУслуге.ОбъемПотребленныйПоПрибору = 0;;	
	НазначениеПрибораУчета 									= ДанныеПоУслуге.НазначениеПрибораУчета;
	ЕстьФактическоеПотреблениеАбонентовПоПрибору 			= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору <> 0 ИЛИ ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный <> 0;
	// TODO
	// FIX ME
	// Добавить распределение в разбивки тарифных зон	
	
	НадоРаспределить										= ДанныеПоУслуге.ОбъемПотребленныйПоПрибору + ДанныеПоУслуге.ОбъемПотребленныйБезПрибора;
	
	ВидНачисления 											= Перечисления.энргВидыНачислений.НачислениеОДН;	
	СпособНачисленияОДН 									= Перечисления.энргСпособНачислений.ПустаяСсылка();
	ОбщийОбъемНачислений 									= ДанныеПоУслуге.ОбщийОбъемНачисленийПотребленный;
	ОбщийОбъемНачисленийПомещений 							= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещенийПотребленный;
	ТарифныеЗоныИдентичны 									= ОбщегоНазначения.КоллекцииИдентичны(ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоныПотребленный, ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный, "Ключ");

	Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору И ДанныеПоУслуге.ВсеПоПриборуПотребленный Тогда
		//ОсталосьРаспределить 								= НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентовПотребленный; 		
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентовПотребленный);		
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и НЕ ЕстьПотреблениеПоПрибору Тогда
		// Списываем начисленный индивидуальный объем по прибору учета
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.ОбъемПоПриборуКорректироватьПотребленный Цикл 
			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
				яНабор 										= НаборЗаписей;
				яНаборОбщий 								= ОбщийОбъемНачислений;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;			
			
			Если СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам 
				ИЛИ СтрокаНачисленийАбонента.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
				Если НЕ СтрокаНачисленийАбонента.ОбъемУслугиПотребленный = 0 Тогда
					СтрокаНабора  				= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.ОбъемУслугиПотребленный	= -СтрокаНабора.ОбъемУслугиПотребленный;
					СтрокаНабора.Сумма 						= 0;
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
				КонецЕсли;
				
				Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
					// добавляем новую строку начислений
					СтрокаНабора  							= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.СпособНачисления 			= Перечисления.энргСпособНачислений.ПоНормативу;
					ОбъемУслугиПотребленный 				= СтрокаНабора.НормаПотребления * СтрокаНабора.ЗначениеПлощади * ((СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП)) * (СтрокаНабора.КонецПериода - СтрокаНабора.НачалоПериода) / (ГраницыПериода.ДнейВПериоде * 86400);
					СтрокаНабора.ОбъемУслугиПотребленный 	= ОбъемУслугиПотребленный;
					СтрокаНабора.Сумма 						= 0;
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
					РазделенныеЛицевыеСчета 				= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
					
					Если НЕ РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
						ОсталосьВнутриПомещения 			= ОбъемУслугиПотребленный;
						ПомещенияПотомки					= РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение];
						СуммаПлощадейПомещения 				= 0;
						Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
							ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];
							СуммаПлощадейПомещения 			= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
						КонецЦикла;		
						
						ПереасчитатьСтроки 					= Новый Массив;
						
						Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
							ДанныеПомещения  				= ПомещениеПотомок.Значение[Услуга];       		
							
							
							СтрокаНабора  					= НаборЗаписей.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
							СтрокаНабора.Распределение 		= Истина;
							СтрокаНабора.Период 			= ГраницыПериода.ЗавершениеОП-1;
							СтрокаНабора.Помещение			= ПомещениеПотомок.Ключ;
							СтрокаНабора.Абонент			= ДанныеПомещения.Абонент;						
							
							Если ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
								СтрокаНабора.ОбъемУслугиПотребленный 	= ДанныеПомещения.ФиксированныйОбъемПотребления;
								ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслугиПотребленный;
							ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
								СтрокаНабора.ОбъемУслугиПотребленный = ОбъемУслугиПотребленный * ДанныеПомещения.ДоляПотребленияЧислитель / ДанныеПомещения.ДоляПотребленияЗнаменатель;
								ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслугиПотребленный;
							ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда	
								ПереасчитатьСтроки.Добавить(НаборЗаписей.Индекс(СтрокаНабора));
							Иначе
								Если ЗначениеЗаполнено(ДанныеПоУслуге.ВидПлощади) Тогда
									СтрокаНабора.ОбъемУслугиПотребленный = ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслугиПотребленный * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);
								Иначе
									СтрокаНабора.ОбъемУслугиПотребленный = ?(НЕ СтрокаНачисленийАбонента.КоличествоЖильцов = 0, ОбъемУслугиПотребленный * ДанныеПомещения.КоличествоПроживающих / СтрокаНачисленийАбонента.КоличествоЖильцов, 0);
								КонецЕсли;
								ОсталосьВнутриПомещения 	= ОсталосьВнутриПомещения - СтрокаНабора.ОбъемУслугиПотребленный;
							КонецЕсли;											
							
							СтрокаНабора.Сумма				= 0;				
						КонецЦикла;
						
						Если ПереасчитатьСтроки.Количество() > 0 Тогда
							Для Сч = 0 По ПереасчитатьСтроки.ВГраница() Цикл
								СтрокаНабора 							= НаборЗаписей.Получить(ПереасчитатьСтроки[Сч]);
								СтрокаНабора.ОбъемУслугиПотребленный 	= ОсталосьВнутриПомещения;
								СтрокаНабора.Сумма						= 0;
							КонецЦикла;						
						КонецЕсли;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.ОбъемПоПриборуНПКорректироватьПотребленный Цикл 
			Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
				яНабор 										= НаборЗаписейНП;
				яНаборОбщий 								= ОбщийОбъемНачислений;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;			
			
			Если СтрокаНачисленийНП.СпособНачисления  = Перечисления.энргСпособНачислений.ПоПриборам 
				ИЛИ СтрокаНачисленийНП.СпособНачисления  = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
				Если НЕ СтрокаНачисленийНП.ОбъемУслугиПотребленный = 0 Тогда
					СтрокаНабора  				= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.ОбъемУслугиПотребленный 	= -СтрокаНабора.ОбъемУслугиПотребленный;
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
				КонецЕсли;
				
				
				Если НЕ СтрокаНачисленийНП.ОбъемУслугиПотребленный = 0 Тогда
					// добавляем новую строку начислений
					СтрокаНабора  							= яНабор.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
					СтрокаНабора.Распределение 				= Истина;
					СтрокаНабора.СпособНачисления 			= Перечисления.энргСпособНачислений.ПоНормативу;
					ОбъемУслугиПотребленный 				= СтрокаНабора.НормаПотребления * СтрокаНабора.ЗначениеПлощади * ((СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка) / (СтрокаНабора.ПлощадьАбонентов - СтрокаНабора.ПлощадьСобственнаяПоставка + СтрокаНабора.ПлощадьМОП)) * (СтрокаНабора.КонецПериода - СтрокаНабора.НачалоПериода) / (ГраницыПериода.ДнейВПериоде * 86400);
					
					СтрокаНабора.ОбъемУслугиПотребленный 	= ОбъемУслугиПотребленный;
					СтрокаНабора.Период 					= ГраницыПериода.ЗавершениеОП-1;
					ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
				КонецЕсли;

			КонецЕсли;			
		КонецЦикла;
		
		// просто распределяем объем по нормативу
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить);
		//ОсталосьРаспределить 								= НадоРаспределить;
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоНормативу;

	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный > 0 Тогда
		// Высчитываем потребление приборников на 1м2
		ОбъемНаКвМ 											= 0; 		
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
		Если  ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный <> 0 Тогда
			ОбъемНаКвМ 										= ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный / ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный;			
		КонецЕсли;
		// Высчитываем "виртуальный" расход абонентов без прибора и корректируем объем потребления абонентов без прибора
		ПотреблениеАбонентов								= ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный;
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибораПотребленный Цикл
			// снимаем начисленный ранее объем
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
			ЕстьСуммаНачислений 							= Ложь;
			Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
				яНабор 										= НаборЗаписей;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;
			
			ИндексАбонента 									= Неопределено;
			
			// ищем строку в массиве
			Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
				Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
					ИндексАбонента 							= Сч;
					Прервать;
				КонецЕсли;					
			КонецЦикла;
						
			Если НЕ СтрокаНачисленийАбонента.ОбъемУслугиПотребленный = 0 Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.ОбъемУслуги 					= 0;
				СтрокаНабора.ОбъемУслугиСоцНорма 			= 0;
				СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;	
				
				
				ДанныеАбонента 								= ДанныеПоУслуге.АбонентыДляРаспределения[ИндексАбонента];
				ДанныеАбонента.ОбъемУслугиПотребленный 		= ДанныеАбонента.ОбъемУслугиПотребленный + СтрокаНабора.ОбъемУслугиПотребленный;
				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
			КонецЕсли;
			
			Если СтрокаНачисленийАбонента.СверхНорматива Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда

					
					ИндексАбонента 							= Неопределено;
					
					// ищем строку в массиве
					Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
						Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
							ИндексАбонента 					= Сч;
							Прервать;
						КонецЕсли;					
					КонецЦикла; 					
					
					КоэфДлительностиПериода 				= 1;
					СоцПлощадь								= 0;
					Если НЕ ИндексАбонента = Неопределено Тогда
						ДатаСостоянияЛицевогоСчета 			= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].ДатаСостоянияЛицевогоСчета;
						СоцПлощадь 							= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].СоцПлощадь;
						Если ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) и ДатаСостоянияЛицевогоСчета <= ГраницыПериода.НачалоОП Тогда
							КоэфДлительностиПериода 		= 1;
						ИначеЕсли ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) Тогда 
							КоэфДлительностиПериода 		= (ГраницыПериода.НачалоОП - ДатаСостоянияЛицевогоСчета) / (ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
						КонецЕсли;						
					КонецЕсли;					
					
					ОбъемУслугиПотребленный 				= Окр(ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода,ТочностьОбъемаНачислений);
					ПотреблениеАбонентов 					= ПотреблениеАбонентов + ОбъемУслугиПотребленный;		
					
					СуммаПлощадейПомещения 					= 0;
										
					РазбитьПоСоцНорме(яНабор,яНаборОбщий,НаборЗаписей,СтрокаНачисленийАбонента,ОбъемУслугиПотребленный,СоцПлощадь,СпособНачисленияОДН,ГраницыПериода,ДанныеПоУслуге,ЕстьСуммаНачислений,ЗначенияТарифов,Услуга,ПотреблениеАбонентов,СуммаПлощадейПомещения,Истина,ТочностьОбъемаНачислений);
				КонецЕсли;			
		КонецЦикла;
		
		// объем потребления НП без прибора
		Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.НачисленияНПБезПрибораПотребленный Цикл
			// снимаем начисленный ранее объем
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийНП.ОбъектРасчета];
			ЕстьСуммаНачислений 							= Ложь;
			Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
				яНабор 										= НаборЗаписейНП;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;		
			
			Если НЕ СтрокаНачисленийНП.ОбъемУслуги = 0 Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				СтрокаНабора.Распределение 					= Истина;
				СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;
				СтрокаНабора.ОбъемУслуги 					= 0;				
				//СтрокаНабора.Сумма 							= 0;				
				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
			КонецЕсли;
			
			
			СтрокаНабора  								= яНабор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
			СтрокаНабора.Распределение 					= Истина;
			СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
			КоэфДлительностиПериода 					= (СтрокаНачисленийНП.КонецПериода - СтрокаНачисленийНП.НачалоПериода)/(ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
			ОбъемУслугиПотребленный 					= ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода; 			
			СтрокаНабора.ОбъемУслуги 					= 0;			
			СтрокаНабора.ОбъемУслугиПотребленный 		= ОбъемУслугиПотребленный;			
			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;			
			ПотреблениеАбонентов 						= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслугиПотребленный;
						
			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
			
		КонецЦикла;

		
		//ОсталосьРаспределить 								= НадоРаспределить - ПотреблениеАбонентов;
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ПотреблениеАбонентов);
	ИначеЕсли ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ и ЕстьПотреблениеПоПрибору Тогда
		Если ЕстьФактическоеПотреблениеАбонентовПоПрибору Тогда
			ОтапливаемаяПлощадь								= ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору;
			ОбъемНаКвМ 										= ?(ОтапливаемаяПлощадь = 0, 0, ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору / ОтапливаемаяПлощадь);	
			ПотреблениеАбонентов							= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору + ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный;
		Иначе
			ОтапливаемаяПлощадь								= ДанныеПоУслуге.ВсегоПлощадьАбонентов - ДанныеПоУслуге.ВсегоПлощадьАбонентовСобственнаяПоставка + ДанныеПоУслуге.ПлощадьМОП;
			ОбъемНаКвМ 										= ?(ОтапливаемаяПлощадь = 0, 0, ДанныеПоУслуге.ОбъемПотребленныйПоПрибору / ОтапливаемаяПлощадь);
			ПотреблениеАбонентов							= 0;
		КонецЕсли;
		
		СпособНачисленияОДН 								= Перечисления.энргСпособНачислений.ПоПриборам;
		//ПотреблениеАбонентов								= 0; 		
		ПомещенияНачислили 									= Новый Соответствие;
		Для Каждого СтрокаНачисленийАбонента ИЗ ДанныеПоУслуге.НачисленияАбонентовБезПрибораПотребленный Цикл
			
				ЕстьСуммаНачислений 							= Ложь;
				Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда
					яНабор 										= НаборЗаписей;
					яНаборОбщий 								= ОбщийОбъемНачислений;
					ЕстьСуммаНачислений 						= Истина;
				Иначе
					яНабор 										= НаборЗаписейПомещение;
					яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
				КонецЕсли;
				
				ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийАбонента.Помещение];
				
				// снимаем начисленный ранее объем
				
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,"ОбъемУслуги,Сумма");
				СтрокаНабора.Распределение 					= Истина;
				Если ЗначениеЗаполнено(СтрокаНачисленийАбонента.Абонент) Тогда					
					СтрокаНабора.Сумма		 			= 0;
					СтрокаНабора.ЗначениеТарифа		 	= СтрокаНачисленийАбонента.ЗначениеТарифа;					  
				КонецЕсли;
				СтрокаНабора.ОбъемУслуги 					= 0;
				// Снятие объема потребленного при сторнировании объема услуги
				СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;
				// Снятие объема потребленного при сторнировании объема услуги
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги,Сумма");
				
				//Если СтрокаНачисленийАбонента.СверхНорматива Тогда
				//	Продолжить;
				//КонецЕсли;
							
				Если СтрокаНачисленийАбонента.ПомещениеРодитель = СтрокаНачисленийАбонента.Помещение Тогда
					
					Если НЕ ПомещенияНачислили[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
						Продолжить;
					КонецЕсли;
										
					ИндексАбонента 									= Неопределено;
					
					// ищем строку в массиве
					Для Сч = 0 По ДанныеПоУслуге.АбонентыДляРаспределения.ВГраница() Цикл
						Если ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Абонент = СтрокаНачисленийАбонента.Абонент или (ЗначениеЗаполнено(СтрокаНачисленийАбонента.ПомещениеРодитель) и ДанныеПоУслуге.АбонентыДляРаспределения[Сч].Помещение = СтрокаНачисленийАбонента.ПомещениеРодитель) Тогда
							ИндексАбонента 							= Сч;
							Прервать;
						КонецЕсли;					
					КонецЦикла;
					
					КоэфДлительностиПериода 				= 1;
					СоцПлощадь								= 0;
					Если НЕ ИндексАбонента = Неопределено Тогда
						ДатаСостоянияЛицевогоСчета 			= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].ДатаСостоянияЛицевогоСчета;
						СоцПлощадь 							= ДанныеПоУслуге.АбонентыДляРаспределения[Сч].СоцПлощадь;
						Если ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) и ДатаСостоянияЛицевогоСчета <= ГраницыПериода.НачалоОП Тогда
							КоэфДлительностиПериода 		= 1;
						ИначеЕсли ЗначениеЗаполнено(ДатаСостоянияЛицевогоСчета) Тогда 
							КоэфДлительностиПериода 		= (ДатаСостоянияЛицевогоСчета - ГраницыПериода.НачалоОП) / (ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
						КонецЕсли;						
					КонецЕсли;					
					
					ОбъемУслугиПотребленный 				= Окр(ЗначениеПлощади * ОбъемНаКвМ * КоэфДлительностиПериода,ТочностьОбъемаНачислений);
					ПотреблениеАбонентов 					= ПотреблениеАбонентов + ОбъемУслугиПотребленный;		
					
					СуммаПлощадейПомещения 					= 0;
					
					РазбитьПоСоцНорме(яНабор,яНаборОбщий,НаборЗаписей,СтрокаНачисленийАбонента,ОбъемУслугиПотребленный,СоцПлощадь,СпособНачисленияОДН,ГраницыПериода,ДанныеПоУслуге,ЕстьСуммаНачислений,ЗначенияТарифов,Услуга,ПотреблениеАбонентов,СуммаПлощадейПомещения,Истина,ТочностьОбъемаНачислений, Истина);
					
					ПомещенияНачислили.Вставить(СтрокаНачисленийАбонента.Помещение, Истина);					
				КонецЕсли; 	
				
		КонецЦикла;
		
		Для Каждого СтрокаНачисленийНП ИЗ ДанныеПоУслуге.НачисленияНПБезПрибораПотребленный Цикл
			ЕстьСуммаНачислений 							= Ложь;
					
			Если ЗначениеЗаполнено(СтрокаНачисленийНП.ОбъектРасчета) Тогда
				яНабор 										= НаборЗаписейНП;
				яНаборОбщий 								= ОбщийОбъемНачислений;
				ЕстьСуммаНачислений 						= Истина;
			Иначе
				яНабор 										= НаборЗаписейПомещение;
				яНаборОбщий 								= ОбщийОбъемНачисленийПомещений;
			КонецЕсли;	
			
			ЗначениеПлощади 								= ДанныеПоУслуге.ПлощадиАбонентов[СтрокаНачисленийНП.ОбъектРасчета];
			
			// снимаем начисленный ранее объем
			Если НЕ СтрокаНачисленийНП.ОбъемУслугиПотребленный = 0 Тогда
				СтрокаНабора  								= яНабор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
				СтрокаНабора.Распределение 					= Истина;
				//СтрокаНабора.Сумма		 				= 0;
				СтрокаНабора.ОбъемУслуги 					= 0;				
				СтрокаНабора.ОбъемУслугиПотребленный 		= -СтрокаНабора.ОбъемУслугиПотребленный;				
				СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
				
				ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
			КонецЕсли;
			
			СтрокаНабора  								= яНабор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийНП,,"ОбъемУслуги");
			СтрокаНабора.Распределение 					= Истина;
			СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
			ОбъемУслугиПотребленный 					= ЗначениеПлощади * ОбъемНаКвМ;			
			КоэфДлительностиПериода 					= (СтрокаНачисленийНП.КонецПериода - СтрокаНачисленийНП.НачалоПериода)/(ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП);
			СтрокаНабора.ОбъемУслуги 					= 0;			
			СтрокаНабора.ОбъемУслугиПотребленный 		= ОбъемУслугиПотребленный * КоэфДлительностиПериода;			
			СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;			
			ПотреблениеАбонентов 						= ПотреблениеАбонентов + СтрокаНабора.ОбъемУслугиПотребленный;			
			ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,"ОбъемУслуги");
			
		КонецЦикла;

		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ПотреблениеАбонентов);
		//ОсталосьРаспределить 									= НадоРаспределить - ПотреблениеАбонентов;				
	ИначеЕсли ЕстьПотреблениеПоПрибору и НазначениеПрибораУчета = Перечисления.энргНазначениеПУ.МОП Тогда
		//ОсталосьРаспределить 									= НадоРаспределить;		
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить);
		СпособНачисленияОДН 									= ДанныеПоУслуге.СпособНачисленияМКД;
	//ИначеЕсли ЕстьПотреблениеПоПрибору и ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоныПотребленный.Количество() = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный.Количество() Тогда
	ИначеЕсли ЕстьПотреблениеПоПрибору и ТарифныеЗоныИдентичны Тогда
		Для Каждого КлючЗначениеТарифнаяЗона Из ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоныПотребленный Цикл
			ОсталосьРаспределить.Вставить(КлючЗначениеТарифнаяЗона.Ключ, КлючЗначениеТарифнаяЗона.Значение - ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный[КлючЗначениеТарифнаяЗона.Ключ] - ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет[КлючЗначениеТарифнаяЗона.Ключ]);
		КонецЦикла;
		СпособНачисленияОДН 									= ДанныеПоУслуге.СпособНачисленияМКД;
	ИначеЕсли ЕстьПотреблениеПоПрибору Тогда
		//ОсталосьРаспределить 									= НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентовПотребленный;
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить - ДанныеПоУслуге.ПотреблениеАбонентовПотребленный);
		СпособНачисленияОДН 									= ДанныеПоУслуге.СпособНачисленияМКД;	
	Иначе
		//ОсталосьРаспределить 									= НадоРаспределить; 
		ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, НадоРаспределить);
		СпособНачисленияОДН 									= Перечисления.энргСпособНачислений.ПоНормативу;
	КонецЕсли;
	
	Если Не ДанныеПоУслуге.РаспределятьПолностью И Не ДанныеПоУслуге.НеРаспределятьСверхнорматив Тогда
		Если ОсталосьРаспределить[Справочники.энргТарифныеЗоны.БезРазбивки] > ДанныеПоУслуге.ОбъемУслугиНорматив  Тогда
			СверхнормативМКД 								= ОсталосьРаспределить[Справочники.энргТарифныеЗоны.БезРазбивки] - ДанныеПоУслуге.ОбъемУслугиНорматив;
			СпособНачисленияОДН 							= Перечисления.энргСпособНачислений.ПоНормативу;
			ОсталосьРаспределить.Вставить(Справочники.энргТарифныеЗоны.БезРазбивки, ДанныеПоУслуге.ОбъемУслугиНорматив);			
			
			//СтрокаНабора  									= НаборЗаписейСверхНорма.Добавить();
			//СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			//СтрокаНабора.Район 								= Район;
			//СтрокаНабора.Организация						= Организация;
			//СтрокаНабора.МКД								= МКД;
			//СтрокаНабора.Услуга								= Услуга;
			//СтрокаНабора.ОбъемУслуги						= СверхнормативМКД;			
		КонецЕсли;		
	КонецЕсли; 
	
	Возврат Новый ФиксированнаяСтруктура("СпособНачисленияОДН, ОсталосьРаспределить", СпособНачисленияОДН, ОсталосьРаспределить);
	
КонецФункции

Процедура ЗаполнитьНаборОтрицательногоОбъемаРаспределенияПотребленный(ОсталосьРаспределить, СписываемИзОтрицательного, НаборОтрицательныйОбъемРаспределения, Организация, ПериодНачисления, Район, МКД, Услуга, ТарифнаяЗона, Период, ДанныеПоУслуге)
	
	Если ОсталосьРаспределить < 0 Тогда
		СтрокаНабораОтрицательный  								= НаборОтрицательныйОбъемРаспределения.ДобавитьПриход();
		СтрокаНабораОтрицательный.Период	 					= Период;
		СтрокаНабораОтрицательный.Организация 					= Организация;
		СтрокаНабораОтрицательный.Район 						= Район;
		СтрокаНабораОтрицательный.МКД 							= МКД;
		СтрокаНабораОтрицательный.Услуга 						= Услуга;
		СтрокаНабораОтрицательный.ТарифнаяЗона 					= ТарифнаяЗона;
		СтрокаНабораОтрицательный.ПериодНачисления				= ПериодНачисления;
		СтрокаНабораОтрицательный.ОбъемУслугиПотребленный		= -ОсталосьРаспределить;
		СтрокаНабораОтрицательный.ПериодРасчета 				= ПериодНачисления;
	КонецЕсли;	
	
	Если СписываемИзОтрицательного > 0 Тогда
		ОтрицательныйОбъемРасшифровка 							= ДанныеПоУслуге.ОтрицательныйОбъемРаспределения.Расшифровка;
		ИндексРасшифровки 										= 0;
		ОсталосьСписатьИзОтрицательного 						= СписываемИзОтрицательного;
		Пока ОсталосьСписатьИзОтрицательного > 0 и ИндексРасшифровки < ОтрицательныйОбъемРасшифровка.Количество() Цикл
			Снимаем 											= Мин(ОсталосьСписатьИзОтрицательного,ОтрицательныйОбъемРасшифровка[ИндексРасшифровки].ОбъемУслугиПотребленный);

			СтрокаНабораОтрицательный  							= НаборОтрицательныйОбъемРаспределения.ДобавитьРасход();
			СтрокаНабораОтрицательный.Период	 				= Период;
			СтрокаНабораОтрицательный.Организация 				= Организация;
			СтрокаНабораОтрицательный.Район 					= Район;
			СтрокаНабораОтрицательный.МКД 						= МКД;
			СтрокаНабораОтрицательный.Услуга 					= Услуга;
			СтрокаНабораОтрицательный.ТарифнаяЗона 				= ТарифнаяЗона;
			СтрокаНабораОтрицательный.ПериодНачисления			= ОтрицательныйОбъемРасшифровка[ИндексРасшифровки].ПериодНачисленияОбъема;
			СтрокаНабораОтрицательный.ОбъемУслугиПотребленный	= Снимаем;
			СтрокаНабораОтрицательный.ПериодРасчета 			= ПериодНачисления;			
			ИндексРасшифровки 									= ИндексРасшифровки + 1;
			ОсталосьСписатьИзОтрицательного 					= ОсталосьСписатьИзОтрицательного - Снимаем;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуНачисленийПриРаспределенииПотребленный(ТарифнаяЗона, ОбъемУслугиПотребленный, СпособНачисленияОДН, ГраницыПериода, Организация, ПериодНачисления, Район, МКД, Услуга, ДанныеПоУслуге, ДанныеАбонента, ЗначенияТарифов, НаборЗаписей, НаборЗаписейПомещение, НаборЗаписейНП, ОбщийОбъемНачисленийПомещений, ОбщийОбъемНачислений)
	
	ПустаяТочкаУчета 									= Справочники.энргТочкиУчета.ПустаяСсылка();
	ВидНачисления 										= Перечисления.энргВидыНачислений.НачислениеОДН;
	
	Если ДанныеАбонента.НП Тогда
			
			СтрокаНабора  									= НаборЗаписейНП.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.МКД 								= МКД;
			СтрокаНабора.Договор							= ДанныеАбонента.Договор;
			СтрокаНабора.ОбъектРасчета						= ДанныеАбонента.Абонент;
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.ВидНачисления 						= ВидНачисления;
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;			
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			
			Если ДанныеАбонента.РасчетПоФактическомуОбъему Тогда
				СтрокаНабора.ОбъемУслуги					= ОбъемУслугиПотребленный;
				СтрокаНабора.ОбъемУслугиПотребленный		= 0;				
			Иначе
				СтрокаНабора.ОбъемУслуги					= 0;
				СтрокаНабора.ОбъемУслугиПотребленный		= ОбъемУслугиПотребленный;
			КонецЕсли;
						
			СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
			//Распределили 									= Распределили + СтрокаНабора.ОбъемУслугиПотребленный;
			
						
		ИначеЕсли ЗначениеЗаполнено(ДанныеАбонента.Абонент) Тогда
			//ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа,Услуга,ДанныеАбонента.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
			ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа, Услуга, ДанныеАбонента.Поставщик, ТарифнаяЗона); 			
			ОписаниеЗначениеТарифа 							= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК, ЗначениеСверхНорматива", 0,0,0), ЗначенияТарифов[ХэшСтрокиТарифа]);
			
			СтрокаНабора  									= НаборЗаписей.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.ЧастныйСектор 						= Ложь;
			СтрокаНабора.Строение							= МКД;
			СтрокаНабора.Помещение							= ДанныеАбонента.Помещение;
			СтрокаНабора.Абонент							= ДанныеАбонента.Абонент;
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.ВидНачисления 						= ВидНачисления;
			СтрокаНабора.НаправлениеИспользованияТУ 		= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
			СтрокаНабора.Измеритель 						= Справочники.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка();
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
			СтрокаНабора.ОбъемУслуги						= 0;
			СтрокаНабора.ОбъемУслугиПотребленный			= ОбъемУслугиПотребленный;
			СтрокаНабора.ТарифнаяГруппа                     = ДанныеАбонента.ТарифнаяГруппа;
			СтрокаНабора.ТарифнаяЗона                     	= ТарифнаяЗона;
		    СтрокаНабора.ЭтоОбъемПотребленный				= Истина;
			//Распределили 									= Распределили + СтрокаНабора.ОбъемУслугиПотребленный;
			ЗначениеТарифаСверхНормы						= ОписаниеЗначениеТарифа.ЗначениеСверхНорматива;
			ЗначениеТарифа 									= ОписаниеЗначениеТарифа.Значение;
			СтрокаНабора.ЗначениеТарифа						= ЗначениеТарифа;
			
			ОбъемУслугиСверхНормы 							= 0;
			Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ Тогда
				ЗначениеСоциальнойНормыРаспределение 	= ОбъемУслугиПотребленный / ДанныеАбонента.ЗначениеПлощади * ДанныеАбонента.СоцПлощадь;
				
				Если ДанныеАбонента.ОбъемУслугиПотребленный  + ОбъемУслугиПотребленный > ЗначениеСоциальнойНормыРаспределение И ДанныеАбонента.ЗначениеСоциальнойНормы >= 0 Тогда
					ОстатокСоцНорма 						= ОбъемУслугиПотребленный - ЗначениеСоциальнойНормыРаспределение;
					ОбъемРаспределяем 						= ОбъемУслугиПотребленный;
					Если ОстатокСоцНорма > 0 Тогда 
						ОбъемУслугиСверхНормы						= Мин(ОстатокСоцНорма,ОбъемРаспределяем);
					Иначе
						ОбъемУслугиСверхНормы 						= 0;	
					КонецЕсли;
					ОбъемУслугиПотребленный 					= ОбъемРаспределяем - Макс(ОстатокСоцНорма, 0);
				КонецЕсли; 			
			КонецЕсли;		
			
			Если НЕ ОбъемУслугиПотребленный = 0 Тогда 						
				СтрокаНабора.ОбъемУслуги		= 0;
				Если ДанныеПоУслуге.НеНачислятьУслугуАбонентам Тогда
					СтрокаНабора.ОбъемУслугиПотребленный 				= 0;
				Иначе
					СтрокаНабора.ОбъемУслугиПотребленный 				= ОбъемУслугиПотребленный;
				КонецЕсли;
				
			ИначеЕсли ОбъемУслугиСверхНормы > 0 Тогда
				СтрокаНабора.СверхНорматива 				= Истина;
				СтрокаНабора.ЗначениеТарифа 				= ЗначениеТарифаСверхНормы;			
				СтрокаНабора.ОбъемУслуги					= 0;
				СтрокаНабора.ОбъемУслугиПотребленный		= ОбъемУслугиСверхНормы;
				СтрокаНабора.Сумма							= 0;
			КонецЕсли;
			
			Если НЕ ОбъемУслугиПотребленный = 0 и НЕ ОбъемУслугиСверхНормы = 0 Тогда
				СтрокаСверхНормы 							= НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСверхНормы,СтрокаНабора);
				СтрокаСверхНормы.СверхНорматива 			= Истина;
				СтрокаСверхНормы.ЗначениеТарифа 			= ЗначениеТарифаСверхНормы;			
				СтрокаСверхНормы.ОбъемУслуги				= 0;
				СтрокаСверхНормы.ОбъемУслугиПотребленный	= ОбъемУслугиСверхНормы;
				СтрокаСверхНормы.ЭтоОбъемПотребленный		= Истина;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОбщийОбъемНачислений.Добавить(), СтрокаНабора);			
		Иначе
			
			//ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(ДанныеАбонента.ТарифнаяГруппа,Услуга,ДанныеАбонента.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
			//ОписаниеЗначениеТарифа 							= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК, ЗначениеСверхНорматива", 0,0,0), ЗначенияТарифов[ХэшСтрокиТарифа]); 			
			
			СтрокаНабора  									= НаборЗаписейПомещение.Добавить();
			СтрокаНабора.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Район 								= Район;
			СтрокаНабора.Распределение 						= Истина;
			СтрокаНабора.Организация						= Организация;
			СтрокаНабора.ЧастныйСектор 						= Ложь;
			СтрокаНабора.Строение							= МКД;
			СтрокаНабора.Помещение							= ДанныеАбонента.Помещение; // TODO FIX ME
			СтрокаНабора.Услуга								= Услуга;
			СтрокаНабора.ТочкаУчета							= ПустаяТочкаУчета;
			СтрокаНабора.ВидНачисления 						= ВидНачисления;
			СтрокаНабора.Поставщик 							= ДанныеАбонента.Поставщик;
			СтрокаНабора.ПериодРасчета						= ПериодНачисления;
			СтрокаНабора.ПериодНачисления					= ПериодНачисления;
			СтрокаНабора.ОбъемУслуги						= 0;
			СтрокаНабора.ОбъемУслугиПотребленный			= ОбъемУслугиПотребленный;
			СтрокаНабора.ЗначениеПлощади 					= ДанныеАбонента.ЗначениеПлощади;
			СтрокаНабора.СпособНачисления 					= СпособНачисленияОДН;
			//СтрокаНабора.ЗначениеТарифа 					= ?(НЕ ИспользоватьТарифРек, ОписаниеЗначениеТарифа.Значение, ОписаниеЗначениеТарифа.ЗначениеТарифаРЭК);
			
			ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПомещений.Добавить(), СтрокаНабора);
			
			//Распределили 									= Распределили + СтрокаНабора.ОбъемУслугиПотребленный;
			
			
			РазделенныеЛицевыеСчета 						= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
			ПомещенияПотомки								= РазделенныеЛицевыеСчета[ДанныеАбонента.Помещение];
			                                                
			ПомещенияПотомкиПотомков                        = Новый Соответствие();
			// проверить, есть ли помещения 3-его уровня вложенности
			
			Если ПомещенияПотомки <> Неопределено Тогда
				
				Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
					Если Не РазделенныеЛицевыеСчета[ПомещениеПотомок.Ключ] = Неопределено Тогда
						Для Каждого ЭлементПотомок Из РазделенныеЛицевыеСчета[ПомещениеПотомок.Ключ] Цикл
							ПомещенияПотомкиПотомков.Вставить(ЭлементПотомок.КЛюч, ЭлементПотомок.Значение);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				Если ПомещенияПотомкиПотомков.Количество() > 0 Тогда
					ПомещенияПотомки = ПомещенияПотомкиПотомков;
				Иначе
					ПомещенияПотомки =  РазделенныеЛицевыеСчета[ДанныеАбонента.Помещение];
				КонецЕсли;
				
				СуммаПлощадейПомещения 							= 0;
				Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
					ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];
					СуммаПлощадейПомещения 						= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
				КонецЦикла;		
				
				Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
					ДанныеПомещения  							= ПомещениеПотомок.Значение[Услуга];
					ОбъемУслугиПотомка							= ?(НЕ СуммаПлощадейПомещения = 0, ОбъемУслугиПотребленный * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, 0);;
					ЗначениеСоциальнойНормы 					= -1;
					Если ДанныеПоУслуге.КорректироватьИндивидуальныйОбъемСУчетомОДПУ Тогда
						ЗначениеСоциальнойНормы 				= ОбъемУслугиПотомка * (ДанныеПомещения.ЗначениеСоциальнойНормы * ДанныеПомещения.КоличествоЧеловек)  / ДанныеПомещения.ЗначениеПлощади 
					КонецЕсли;
					//ХэшСтрокиТарифа 							= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
					//ЗначениеТарифа 								= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК", 0, 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
					
					//ХэшСтрокиТарифа 							= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
					ХэшСтрокиТарифа 							= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа, Услуга, ДанныеАбонента.Поставщик, ТарифнаяЗона);
					ЗначениеТарифа 								= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение,ЗначениеТарифаРЭК", 0, 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
					СтрокаНабора  								= НаборЗаписей.Добавить();
					СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
					СтрокаНабора.Район 							= Район;
					СтрокаНабора.Распределение 					= Истина;
					СтрокаНабора.Организация					= Организация;
					СтрокаНабора.ЧастныйСектор 					= Ложь;
					СтрокаНабора.Строение						= МКД;
					СтрокаНабора.Помещение						= ПомещениеПотомок.Ключ;
					СтрокаНабора.Абонент						= ДанныеПомещения.Абонент;
					СтрокаНабора.Услуга							= Услуга;
					СтрокаНабора.ТочкаУчета						= ПустаяТочкаУчета;
					СтрокаНабора.ВидНачисления 					= ВидНачисления;
					СтрокаНабора.НаправлениеИспользованияТУ 	= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
					СтрокаНабора.СпособНачисления 				= СпособНачисленияОДН;
					СтрокаНабора.ЗначениеТарифа 				= ЗначениеТарифа.Значение;
					СтрокаНабора.Поставщик 						= ДанныеПомещения.Поставщик;
					СтрокаНабора.ПериодРасчета					= ПериодНачисления;
					СтрокаНабора.ПериодНачисления				= ПериодНачисления;
					СтрокаНабора.ЗначениеПлощади 				= ДанныеПомещения.ЗначениеПлощади;
					СтрокаНабора.ТарифнаяЗона                   = ТарифнаяЗона;
					СтрокаНабора.ТарифнаяГруппа                 = ЗначениеТарифа.ГруппаПотребителей;
					СтрокаНабора.ОбъемУслуги					= 0;				 									
					СтрокаНабора.Сумма							= 0;
					СтрокаНабора.ЭтоОбъемПотребленный			= Истина;
					
					Если ОбъемУслугиПотомка > ЗначениеСоциальнойНормы И ЗначениеСоциальнойНормы >= 0 Тогда									
						СтрокаНабора.ОбъемУслугиПотребленный 		= ЗначениеСоциальнойНормы;					
						СтрокаНабора.ЗначениеТарифа 				= ЗначениеТарифа.Значение;
						
						СтрокаСверхНормы 							= НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСверхНормы, СтрокаНабора);
						СтрокаСверхНормы.ЗначениеТарифа 			= ЗначениеТарифа.ЗначениеСверхНорматива;
						СтрокаСверхНормы.ОбъемУслугиПотребленный	= ОбъемУслугиПотомка - ЗначениеСоциальнойНормы;
						СтрокаСверхНормы.СверхНорматива 			= Истина;
						СтрокаСверхНормы.Сумма						= 0;
						СтрокаСверхНормы.ЭтоОбъемПотребленный		= Истина;
					Иначе
						СтрокаНабора.ОбъемУслугиПотребленный 	= ОбъемУслугиПотомка;
						СтрокаНабора.ЗначениеТарифа 			= ЗначениеТарифа.Значение;
					КонецЕсли;								
				КонецЦикла;			
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область ИнициализацияДанныхРаспределенияОДН

Процедура ПрочитатьВспомогательныеДанныеРаспределениеМКД(МВТ, Организация, ПериодНачисления, Район, Строение, ГраницыПериода)	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Строение",			Строение);
	Запрос.УстановитьПараметр("Поставщик",			Константы.энргПоставщикПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Период",				ГраницыПериода.КонецПериодаРасчета - 1); 
	Запрос.Текст 					= ТекстЗапросаВспомогательныеДанныеРаспределениеМКД(Строение);
	Запрос.Выполнить();
КонецПроцедуры  

Процедура ПрочитатьДокументыДляРаспределения(МВТ,Организация, ПериодНачисления, Район, МКД, ГраницаПериода)
	
	Запрос  						= Новый Запрос(ТекстЗапросаДокументыДляРаспределенияМКД());
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			МКД); 	
	Запрос.УстановитьПараметр("ЗавершениеОП",		ГраницаПериода.ЗавершениеОП); 	
	Запрос.УстановитьПараметр("Период",				ГраницаПериода.ЗавершениеОП-1); 	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Если МКД = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргОтложенныеДвиженияДокументов.Строение = &Строение","");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И МКД = &Строение","");	
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПрочитатьСозданныеДокументыИндивидуальныхНачислений(МВТ,Организация, ПериодНачисления, Район, МКД, ЗавершениеОП)

	Запрос  						= Новый Запрос(ТекстЗапросаСозданныеДокументыРаспределения());
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ЗавершениеОП", 		ЗавершениеОП);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			МКД);	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Если МКД = Неопределено Тогда
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И (энргДокументыНачислений.МКД = &Строение)","");
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И энргДокументыНачислений.МКД = &Строение","");
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И МКД = &Строение","");
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И (энргПерерасчет.Строение = &Строение)","");
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПрочитатьОбъемыНачисленийМКДДляРаспределения(МВТ, Организация,ПериодНачисления,Район, МКД, ГраницыПериода, ГраницыПериодаЮЛ)
	
	Запрос  						= Новый Запрос(ТекстЗапросаОбъемыНачисленийМКДДляРаспределения());
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			МКД);
	Запрос.УстановитьПараметр("НачалоПериода",		ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериода",		ГраницыПериода.ЗавершениеОП);
	Запрос.УстановитьПараметр("НачалоПериодаЮЛ",	ГраницыПериодаЮЛ.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериодаЮЛ",		ГраницыПериодаЮЛ.ЗавершениеОП);
	Запрос.УстановитьПараметр("Период",				ГраницыПериода.ЗавершениеОП-1);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	
	Если МКД = Неопределено Тогда
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И МКД = &Строение","");
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И (бестОбъектыРасчета.МКД = &Строение)","");
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И Строение = &Строение","");	
		Запрос.Текст 				= СтрЗаменить(Запрос.Текст,"И энргОбъемНачисленийМКД.МКД = &Строение","");
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПрочитатьНормативныеДанныеРаспределения(МВТ,Организация, ПериодНачисления, Район, ГраницыПериода)
	
	Запрос  						= Новый Запрос(ТекстЗапросаНормативныеДанныеРаспределения());
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Период",				ГраницыПериода.ЗавершениеОП-1);
	Запрос.Выполнить();
	
КонецПроцедуры
	
#КонецОбласти

Функция ХэшТаблицаЗначенийТарифа(ВыборкаЗначенияТарифов)
	
	ЗначенияТарифов 						= Новый Соответствие;
	
	Если ВыборкаЗначенияТарифов.Количество() > 0 Тогда
		Пока ВыборкаЗначенияТарифов.Следующий() Цикл
			ХэшСтроки 						= ХэшСтрокиТарифа(ВыборкаЗначенияТарифов.ГруппаПотребителей,ВыборкаЗначенияТарифов.Услуга,ВыборкаЗначенияТарифов.Поставщик,ВыборкаЗначенияТарифов.ТарифнаяЗона);
			ОписаниеЗначения 				= Новый Структура("Значение,ЗначениеТарифаРЭК,ЗначениеСверхНорматива,СтавкаНДС,НДСВнутри,ГруппаПотребителей,Услуга,Поставщик,ТарифнаяЗона");
			ЗаполнитьЗначенияСвойств(ОписаниеЗначения, ВыборкаЗначенияТарифов);			
			ЗначенияТарифов.Вставить(ХэшСтроки,ОписаниеЗначения); 			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ЗначенияТарифов;
	
КонецФункции

Функция ХэшСтрокиТарифа(ТарифнаяГруппа, Услуга, Поставщик, ТарифнаяЗона)
	
	СтрокаХэш 				= "";
	СтрокаХэш 				= СтрокаХэш + ТарифнаяГруппа.УникальныйИдентификатор();
	СтрокаХэш 				= СтрокаХэш + Услуга.УникальныйИдентификатор();
	СтрокаХэш 				= СтрокаХэш + Поставщик.УникальныйИдентификатор();
	СтрокаХэш 				= СтрокаХэш + ТарифнаяЗона.УникальныйИдентификатор();
	
	Хэш 					= Новый ХешированиеДанных(ХешФункция.CRC32);
	Хэш.Добавить(СтрокаХэш);
	
	Возврат Хэш.ХешСумма;	
	
КонецФункции

Процедура ЗаполнитьРазделенныеЛицевыеСчета(КлючРазделенныеЛицевыеСчета, РазделенныеЛицевыеСчета, ВыборкаРазделенныеЛицевыеСчета, ВыборкаОбъемМКД, тзЗначенияСоциальныхНормативов)
	КлючПоискаСоциальногоНорматива 			= "КлючСоцНорматива,НаправлениеИспользованияТУ,Услуга";
	Пока ВыборкаРазделенныеЛицевыеСчета.Строение  = ВыборкаОбъемМКД.Строение Цикл
		
		Если ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель = null Тогда
			Если НЕ ВыборкаРазделенныеЛицевыеСчета.Следующий() Тогда
				Прервать;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель] = Неопределено Тогда													
			ЗначениеСоотвествия 						= Новый Структура(КлючРазделенныеЛицевыеСчета);
			ЗаполнитьЗначенияСвойств(ЗначениеСоотвествия,ВыборкаРазделенныеЛицевыеСчета);
			ЗначениеСоотвествия.КоличествоЧеловек 		= энргРаботаСПараметрамиРасчетаАбонентаСервер.КоличествоЧеловек(ЗначениеСоотвествия);
			СтруктураПоиска 							= Новый Структура(КлючПоискаСоциальногоНорматива);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ВыборкаРазделенныеЛицевыеСчета);  			
			СтрокиСоциальнойНормы 						= тзЗначенияСоциальныхНормативов.НайтиСтроки(СтруктураПоиска);
			ЗначениеСоциальнойНормы 					= 0;
			Если СтрокиСоциальнойНормы.Количество() > 0 Тогда
				ЗначениеСоциальнойНормы 				= СтрокиСоциальнойНормы[0].ЗначениеНорматива;
			КонецЕсли;
			ЗначениеСоотвествия.ЗначениеСоциальнойНормы = ЗначениеСоциальнойНормы;
			СоотвествиеУслуга  							= Новый Соответствие;
			СоотвествиеУслуга.Вставить(ВыборкаРазделенныеЛицевыеСчета.Услуга,ЗначениеСоотвествия);
			СоотвествиеПомещение 						= Новый Соответствие;
			СоотвествиеПомещение.Вставить(ВыборкаРазделенныеЛицевыеСчета.Помещение,СоотвествиеУслуга);
			РазделенныеЛицевыеСчета.Вставить(ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель, СоотвествиеПомещение); 			  
		ИначеЕсли РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель][ВыборкаРазделенныеЛицевыеСчета.Помещение] = Неопределено Тогда
			ЗначениеСоотвествия 						= Новый Структура(КлючРазделенныеЛицевыеСчета);
			ЗаполнитьЗначенияСвойств(ЗначениеСоотвествия,ВыборкаРазделенныеЛицевыеСчета);
			ЗначениеСоотвествия.КоличествоЧеловек 		= энргРаботаСПараметрамиРасчетаАбонентаСервер.КоличествоЧеловек(ЗначениеСоотвествия);
			СтруктураПоиска 							= Новый Структура(КлючПоискаСоциальногоНорматива);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ВыборкаРазделенныеЛицевыеСчета);  			
			СтрокиСоциальнойНормы 						= тзЗначенияСоциальныхНормативов.НайтиСтроки(СтруктураПоиска);
			ЗначениеСоциальнойНормы 					= 0;
			Если СтрокиСоциальнойНормы.Количество() > 0 Тогда
				ЗначениеСоциальнойНормы 				= СтрокиСоциальнойНормы[0].ЗначениеНорматива;
			КонецЕсли;
			ЗначениеСоотвествия.ЗначениеСоциальнойНормы = ЗначениеСоциальнойНормы;
			СоотвествиеУслуга  							= Новый Соответствие;
			СоотвествиеУслуга.Вставить(ВыборкаРазделенныеЛицевыеСчета.Услуга,ЗначениеСоотвествия);
			РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель].Вставить(ВыборкаРазделенныеЛицевыеСчета.Помещение,СоотвествиеУслуга);
		Иначе 	
			ЗначениеСоотвествия 						= Новый Структура(КлючРазделенныеЛицевыеСчета);
			ЗаполнитьЗначенияСвойств(ЗначениеСоотвествия,ВыборкаРазделенныеЛицевыеСчета);
			ЗначениеСоотвествия.КоличествоЧеловек 		= энргРаботаСПараметрамиРасчетаАбонентаСервер.КоличествоЧеловек(ЗначениеСоотвествия);
			СтруктураПоиска 							= Новый Структура(КлючПоискаСоциальногоНорматива);
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ВыборкаРазделенныеЛицевыеСчета);  			
			СтрокиСоциальнойНормы 						= тзЗначенияСоциальныхНормативов.НайтиСтроки(СтруктураПоиска);
			ЗначениеСоциальнойНормы 					= 0;
			Если СтрокиСоциальнойНормы.Количество() > 0 Тогда
				ЗначениеСоциальнойНормы 				= СтрокиСоциальнойНормы[0].ЗначениеНорматива;
			КонецЕсли;
			ЗначениеСоотвествия.ЗначениеСоциальнойНормы = ЗначениеСоциальнойНормы;
			РазделенныеЛицевыеСчета[ВыборкаРазделенныеЛицевыеСчета.ПомещениеРодитель][ВыборкаРазделенныеЛицевыеСчета.Помещение].Вставить(ВыборкаРазделенныеЛицевыеСчета.Услуга, ЗначениеСоотвествия);
		КонецЕсли;					
		
		Если НЕ ВыборкаРазделенныеЛицевыеСчета.Следующий() Тогда
			Прервать;
		КонецЕсли;						
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьНаборыЗаписейПриРаспределении(Отказ, ДокументОбъект, ТекстИсключения, НаборВыполненные, НаборОтрицательныйОбъемРаспределения,НаборЗаписей, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейПомещений, НаборЗаписейСверхНорма)
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат
	КонецЕсли;
	
	Если (Не НаборЗаписей = Неопределено и НаборЗаписей.Количество() > 0)  
		ИЛИ (Не НаборЗаписейНП = Неопределено и НаборЗаписейНП.Количество() > 0)  
		ИЛИ (Не НаборЗаписейНПЭЭ = Неопределено и НаборЗаписейНПЭЭ.Количество() > 0) 
		ИЛИ (НЕ НаборЗаписейПомещений = Неопределено И НаборЗаписейПомещений.Количество() > 0)
		ИЛИ (НЕ НаборЗаписейСверхНорма = Неопределено И НаборЗаписейСверхНорма.Количество() > 0)
		ИЛИ (НЕ НаборОтрицательныйОбъемРаспределения = Неопределено И НаборОтрицательныйОбъемРаспределения.Количество() > 0) Тогда
		
		НаборОтложенныхДвижений	= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
		НаборОтложенныхДвижений.Отбор.Организация.Установить(НаборЗаписей.ДополнительныеСвойства.Организация);
		НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(НаборЗаписей.ДополнительныеСвойства.ПериодНачисления);
		НаборОтложенныхДвижений.Отбор.Район.Установить(НаборЗаписей.ДополнительныеСвойства.Район);
		НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.энргРазделыЗаписи.РаспределениеМКД);
		НаборОтложенныхДвижений.Отбор.ЧастныйСектор.Установить(Ложь);
		НаборОтложенныхДвижений.Отбор.Строение.Установить(НаборЗаписей.ДополнительныеСвойства.Строение);
		НаборОтложенныхДвижений.Записать();					
		
		Попытка 					
			Если Не ДокументОбъект = Неопределено Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеРазрешено",Истина);
				ДокументОбъект.записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;  			
			НаборОтрицательныйОбъемРаспределения.Записать();
			НаборЗаписей.Записать(); 			
			НаборЗаписейПомещений.Записать();		
			НаборЗаписейНП.Записать(); 	
			НаборЗаписейНПЭЭ.Записать();
			НаборЗаписейСверхНорма.Записать();			
			
			Если НЕ НаборВыполненные = Неопределено Тогда
				НаборВыполненные.Записать(НаборВыполненные.ДополнительныеСвойства.Замещать);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			Отказ 									= Истина;
			ИнформацияОбОшибке 						= ИнформацияОбОшибке();
			ТекстИсключения 						= ТекстИсключения + ?(ПустаяСтрока(ТекстИсключения),"",Символы.ПС) + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ОтменитьТранзакцию();
		КонецПопытки;
	Иначе
		Попытка
			НаборОтложенныхДвижений					= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
			НаборОтложенныхДвижений.Отбор.Организация.Установить(НаборЗаписей.ДополнительныеСвойства.Организация);
			НаборОтложенныхДвижений.Отбор.ПериодНачисления.Установить(НаборЗаписей.ДополнительныеСвойства.ПериодНачисления);
			НаборОтложенныхДвижений.Отбор.Район.Установить(НаборЗаписей.ДополнительныеСвойства.Район);
			НаборОтложенныхДвижений.Отбор.РазделЗаписи.Установить(Перечисления.энргРазделыЗаписи.РаспределениеМКД);
			НаборОтложенныхДвижений.Отбор.ЧастныйСектор.Установить(Ложь);
			НаборОтложенныхДвижений.Отбор.Строение.Установить(НаборЗаписей.ДополнительныеСвойства.Строение);
			НаборОтложенныхДвижений.Записать();
			ЗафиксироватьТранзакцию();			
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеАбонентовДляРаспределения(ДанныеПоУслуге, ВыборкаАбоненты, ВыборкаОбъемМКД, ТЗОтрицательныйОбъемРаспределения, ВыборкаОбъемПоПриборуКорректировать, ВыборкаОбъемПоПриборуНПКорректировать)
	перем ТекПомещение,ДанныеАбонента;
	
	мАбонентыДляРаспределения 								= ДанныеПоУслуге.АбонентыДляРаспределения;
	ПотреблениеАбонентов 									= ДанныеПоУслуге.ПотреблениеАбонентов;
	ПотреблениеАбонентовПоПрибору 							= ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору;
	ПотреблениеАбонентовПоФакту 							= ДанныеПоУслуге.ПотреблениеАбонентовПотребленный;
	ПотреблениеАбонентовПоПриборуПоФакту 					= ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный;
	ВсегоПлощадьАбонентовПоПрибору 							= ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору;
	ОбъемУслугиПерерасчет									= ДанныеПоУслуге.ОбъемУслугиПерерасчет;
	ОбъемУслугиПотребленныйПерерасчет						= ДанныеПоУслуге.ОбъемУслугиПотребленныйПерерасчет;
	
	ДанныеПоУслуге.ПоказанияПредоставлены 					= ВыборкаОбъемМКД.ПоказанияПредоставлены;
	ДанныеПоУслуге.СпособНачисленияМКД 						= ВыборкаОбъемМКД.СпособНачисления;
	ДанныеПоУслуге.НазначениеПрибораУчета 					= ВыборкаОбъемМКД.НазначениеПрибораУчета;
	
	// Двигаем выборку абонентов
	Пока НЕ ВыборкаАбоненты.Строение = ВыборкаОбъемМКД.Строение ИЛИ НЕ ВыборкаАбоненты.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		Если НЕ ВыборкаАбоненты.Следующий() Тогда
			Прервать;
			ВыборкаАбоненты.сбросить();
		КонецЕсли;				
	КонецЦикла;
	
	ОбщийОбъемНачислений 									= ДанныеПоУслуге.ОбщийОбъемНачислений;
	ОбщийОбъемНачисленийПомещений							= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений;
	ОбщийОбъемНачисленийПотребленный 						= ДанныеПоУслуге.ОбщийОбъемНачисленийПотребленный;
	ОбщийОбъемНачисленийПомещенийПотребленный				= ДанныеПоУслуге.ОбщийОбъемНачисленийПомещенийПотребленный;
	ВсеПоПрибору 											= ДанныеПоУслуге.УВсехАбонентовПоПрибору;
	ВсеПоПриборуПотребленный 								= ДанныеПоУслуге.УВсехАбонентовПоПриборуПотребленный;
	ВсегоПлощадьАбонентовПоПрибору 							= ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору;
	ВсегоПлощадьАбонентовПоПриборуПотребленный 				= ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный;
	ЕстьРасходПоПрибору 									= Ложь;
	ЕстьРасходПоПриборуПотребленный 						= Ложь;	
	
	Пока ВыборкаАбоненты.Строение = ВыборкаОбъемМКД.Строение и ВыборкаАбоненты.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		Если ЗначениеЗаполнено(ВыборкаАбоненты.Абонент) Тогда
			Если ВыборкаАбоненты.ОбъемУслуги <> 0 И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
				ЗаполнитьЗначенияСвойств(ОбщийОбъемНачислений.Добавить(), ВыборкаАбоненты,,"ОбъемУслугиПотребленный");

			КонецЕсли;
			Если ВыборкаАбоненты.ОбъемУслугиПотребленный <> 0 И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
				ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПотребленный.Добавить(), ВыборкаАбоненты,,"ОбъемУслуги");
			КонецЕсли;
		Иначе
			Если ВыборкаАбоненты.ОбъемУслуги <> 0 И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
				ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПомещений.Добавить(), ВыборкаАбоненты,,"ОбъемУслугиПотребленный");
			КонецЕсли;
			Если ВыборкаАбоненты.ОбъемУслугиПотребленный <> 0 И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
				ЗаполнитьЗначенияСвойств(ОбщийОбъемНачисленийПомещенийПотребленный.Добавить(), ВыборкаАбоненты,,"ОбъемУслуги");
			КонецЕсли;			
		КонецЕсли;
		
		Если НЕ ТекПомещение = ВыборкаАбоненты.Помещение Тогда
			Если Не ТекПомещение = Неопределено Тогда
				Если НЕ ДанныеАбонента.ПомещениеСРазделенными Тогда
					мАбонентыДляРаспределения.Добавить(ДанныеАбонента);
					ДанныеПоУслуге.ПлощадиАбонентов.Вставить(ТекПомещение,ДанныеАбонента.ЗначениеПлощади); 					
					
					Если ЕстьРасходПоПрибору Тогда
						ВсегоПлощадьАбонентовПоПрибору 		= ВсегоПлощадьАбонентовПоПрибору + ДанныеАбонента.ЗначениеПлощади; 
					КонецЕсли;
					
					Если ЕстьРасходПоПриборуПотребленный Тогда
						ВсегоПлощадьАбонентовПоПриборуПотребленный 		= ВсегоПлощадьАбонентовПоПриборуПотребленный + ДанныеАбонента.ЗначениеПлощади; 
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			//КолвоЧеловек 									= 0;
			//
			//Если ВыборкаАбоненты.СпособРасчетаСоциальногоНорматива = Перечисления.энргСпособРасчетаНорматива.КоличествоПроживающих Тогда																													
			//	КолвоЧеловек = ВыборкаАбоненты.КоличествоПроживающих;
			//ИначеЕсли ВыборкаАбоненты.СпособРасчетаСоциальногоНорматива = Перечисления.энргСпособРасчетаНорматива.КоличествоПрописанных Тогда	 
			//	КолвоЧеловек = ВыборкаАбоненты.КоличествоПрописанных;
			//ИначеЕсли ВыборкаАбоненты.СпособРасчетаСоциальногоНорматива = Перечисления.энргСпособРасчетаНорматива.КоличествоСобственников Тогда	
			//	КолвоЧеловек = ВыборкаАбоненты.КоличествоСобственников;
			//Иначе				
			//	Если ВыборкаАбоненты.Абонент = Справочники.энргАбоненты.ПустаяСсылка() Тогда
			//		КолвоЧеловек = ВыборкаАбоненты.КоличествоЖильцов;
			//	ИначеЕсли НЕ ВыборкаАбоненты.КоличествоПроживающих = 0 Тогда 
			//		КолвоЧеловек = ВыборкаАбоненты.КоличествоПроживающих;
			//	ИначеЕсли НЕ ВыборкаАбоненты.КоличествоПрописанных = 0 Тогда 
			//		КолвоЧеловек = ВыборкаАбоненты.КоличествоПрописанных;
			//	Иначе 
			//		КолвоЧеловек = ВыборкаАбоненты.КоличествоСобственников;
			//	КонецЕсли;
			//КонецЕсли;
			
			//ДанныеЭЭ                                        = Новый Структура("
			//|ТарифНаИныеУслуги, ТарифЗаСбытовуюНадбавку, ТарифЗаУслугиПоПередачи, ТарифНаСредневзвешанную, НДСВнутриИныеУслуги, НДСВнутриСбытоваяНадбавка,
			//|НДСВнутриУслугиПоПередачи, СтавкаНДС",
			// ВыборкаАбоненты.ТарифНаИныеУслуги, ВыборкаАбоненты.ТарифЗаСбытовуюНадбавку, ВыборкаАбоненты.ТарифЗаУслугиПоПередачи, ВыборкаАбоненты.ТарифНаСредневзвешанную, 
			//ВыборкаАбоненты.НДСВнутриИныеУслуги, ВыборкаАбоненты.НДСВнутриСбытоваяНадбавка, ВыборкаАбоненты.НДСВнутриУслугиПоПередачи, ВыборкаАбоненты.СтавкаНДС);
			//
			//ДанныеАбонента 									= Новый Структура("
			//|Договор, Абонент, КлючПомещения, Помещение,ЗначениеПлощади,ДатаСостоянияЛицевогоСчета,
			//|ТарифнаяГруппа, Поставщик, ОбъемУслуги, ОбъемУслугиСоцНорма, 
			//|ЗначениеСоциальнойНормы, КоличествоЖильцов, НП, ПомещениеСРазделенными, ОбъемУслугиПотребленный, СоцПлощадь,ТарифнаяЗона, РасчетПоФактическомуОбъему, ЭЭ, ДанныеЭЭ",
			// ВыборкаАбоненты.Договор, ВыборкаАбоненты.Абонент,ВыборкаАбоненты.КлючПомещения, ВыборкаАбоненты.Помещение,ВыборкаАбоненты.ЗначениеПлощадиДляРаспределения,ВыборкаАбоненты.ДатаСостоянияЛицевогоСчета,
			// ВыборкаАбоненты.ТарифнаяГруппаДляРаспределения,	ВыборкаАбоненты.ПоставщикДляРаспределения, 0, ВыборкаАбоненты.ОбъемУслугиСоцНорма, 
			// ВыборкаАбоненты.ЗначениеСоциальнойНормы,ВыборкаАбоненты.КоличествоЖильцов, ВыборкаАбоненты.НП, ВыборкаАбоненты.ПомещениеСРазделенными,0, 
			//КолвоЧеловек * ВыборкаАбоненты.СоциальнаяНормаПотребления + ВыборкаАбоненты.ДопСоциальнаяНормаПотребления,ВыборкаАбоненты.ТарифнаяЗона, 
			//ВыборкаАбоненты.РасчетПоФактическомуОбъему, ВыборкаАбоненты.ЭЭ, ДанныеЭЭ);
			
			ДанныеАбонентаЗаполненны						= Ложь;
			
			ЕстьРасходПоПрибору 							= Ложь;					
			ЕстьРасходПоПриборуПотребленный					= Ложь;					
		КонецЕсли;
		
		Если Не ДанныеАбонентаЗаполненны И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
			
			КолвоЧеловек 									= 0;
			
			Если ВыборкаАбоненты.СпособРасчетаСоциальногоНорматива = Перечисления.энргСпособРасчетаНорматива.КоличествоПроживающих Тогда																													
				КолвоЧеловек = ВыборкаАбоненты.КоличествоПроживающих;
			ИначеЕсли ВыборкаАбоненты.СпособРасчетаСоциальногоНорматива = Перечисления.энргСпособРасчетаНорматива.КоличествоПрописанных Тогда	 
				КолвоЧеловек = ВыборкаАбоненты.КоличествоПрописанных;
			ИначеЕсли ВыборкаАбоненты.СпособРасчетаСоциальногоНорматива = Перечисления.энргСпособРасчетаНорматива.КоличествоСобственников Тогда	
				КолвоЧеловек = ВыборкаАбоненты.КоличествоСобственников;
			Иначе				
				Если ВыборкаАбоненты.Абонент = Справочники.энргАбоненты.ПустаяСсылка() Тогда
					КолвоЧеловек = ВыборкаАбоненты.КоличествоЖильцов;
				ИначеЕсли НЕ ВыборкаАбоненты.КоличествоПроживающих = 0 Тогда 
					КолвоЧеловек = ВыборкаАбоненты.КоличествоПроживающих;
				ИначеЕсли НЕ ВыборкаАбоненты.КоличествоПрописанных = 0 Тогда 
					КолвоЧеловек = ВыборкаАбоненты.КоличествоПрописанных;
				Иначе 
					КолвоЧеловек = ВыборкаАбоненты.КоличествоСобственников;
				КонецЕсли;
			КонецЕсли;

			ДанныеЭЭ                                        = Новый Структура("
			|ТарифНаИныеУслуги, ТарифЗаСбытовуюНадбавку, ТарифЗаСбытовуюНадбавкуПокупатель, ТарифЗаУслугиПоПередачи, ТарифНаСредневзвешанную, НДСВнутриИныеУслуги, НДСВнутриСбытоваяНадбавка,
			|НДСВнутриУслугиПоПередачи, СтавкаНДС, ЗначениеТарифа, НДСВнутри",
			ВыборкаАбоненты.ТарифНаИныеУслуги, ВыборкаАбоненты.ТарифЗаСбытовуюНадбавку, ВыборкаАбоненты.ТарифЗаСбытовуюНадбавкуПокупатель, ВыборкаАбоненты.ТарифЗаУслугиПоПередачи, ВыборкаАбоненты.ТарифНаСредневзвешанную, 
			ВыборкаАбоненты.НДСВнутриИныеУслуги, ВыборкаАбоненты.НДСВнутриСбытоваяНадбавка, ВыборкаАбоненты.НДСВнутриУслугиПоПередачи, ВыборкаАбоненты.СтавкаНДС,
			ВыборкаАбоненты.ЗначениеТарифа, ВыборкаАбоненты.НДСВнутри);
			
			ДанныеАбонента 									= Новый Структура("
			|Договор, Абонент, КлючПомещения, Помещение,ЗначениеПлощади,ДатаСостоянияЛицевогоСчета,
			|ТарифнаяГруппа, Поставщик, ОбъемУслуги, ОбъемУслугиСоцНорма, 
			|ЗначениеСоциальнойНормы, КоличествоЖильцов, НП, ПомещениеСРазделенными, ОбъемУслугиПотребленный, СоцПлощадь,ТарифнаяЗона, РасчетПоФактическомуОбъему, ЭЭ, ДанныеЭЭ",
			ВыборкаАбоненты.Договор, ВыборкаАбоненты.Абонент,ВыборкаАбоненты.КлючПомещения, ВыборкаАбоненты.Помещение,ВыборкаАбоненты.ЗначениеПлощадиДляРаспределения,ВыборкаАбоненты.ДатаСостоянияЛицевогоСчета,
			ВыборкаАбоненты.ТарифнаяГруппаДляРаспределения,	ВыборкаАбоненты.ПоставщикДляРаспределения, 0, ВыборкаАбоненты.ОбъемУслугиСоцНорма, 
			ВыборкаАбоненты.ЗначениеСоциальнойНормы,ВыборкаАбоненты.КоличествоЖильцов, ВыборкаАбоненты.НП, ВыборкаАбоненты.ПомещениеСРазделенными,0, 
			КолвоЧеловек * ВыборкаАбоненты.СоциальнаяНормаПотребления + ВыборкаАбоненты.ДопСоциальнаяНормаПотребления,ВыборкаАбоненты.ТарифнаяЗона, 
			ВыборкаАбоненты.РасчетПоФактическомуОбъему, ВыборкаАбоненты.ЭЭ, ДанныеЭЭ);
			
			ДанныеАбонентаЗаполненны = Истина;
		КонецЕсли;
		
		
		Если ВыборкаАбоненты.ЕстьИндивидуальныеНачисления Тогда 
			Если ВыборкаАбоненты.НП Тогда
				Если ВыборкаАбоненты.Договор.Контрагент <> ВыборкаАбоненты.Поставщик Тогда
					Если ВыборкаАбоненты.ОбъемУслуги <> 0 И Не ВыборкаАбоненты.ПодключениеНеОтОбщейСборки Тогда 
						СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийДоговоров.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаАбоненты,,"ОбъемУслугиПотребленный");						
						СтрокаСписатьИндивидуальные.ОбъектРасчета	= ВыборкаАбоненты.Абонент;
						
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны.Вставить(ВыборкаАбоненты.ТарифнаяЗона, ВыборкаАбоненты.ОбъемУслуги);
						Иначе
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[ВыборкаАбоненты.ТарифнаяЗона] = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[ВыборкаАбоненты.ТарифнаяЗона] + ВыборкаАбоненты.ОбъемУслуги; 
						КонецЕсли; 
						
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет.Вставить(ВыборкаАбоненты.ТарифнаяЗона, 0);
						КонецЕсли;
					КонецЕсли;
					
					Если ВыборкаАбоненты.ОбъемУслугиПотребленный <> 0 И Не ВыборкаАбоненты.ПодключениеНеОтОбщейСборки Тогда 
						СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийДоговоровПотребленный.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаАбоненты,,"ОбъемУслуги");						
						СтрокаСписатьИндивидуальные.ОбъектРасчета	= ВыборкаАбоненты.Абонент;
						
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный.Вставить(ВыборкаАбоненты.ТарифнаяЗона, ВыборкаАбоненты.ОбъемУслугиПотребленный);
							Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
								ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет.Вставить(ВыборкаАбоненты.ТарифнаяЗона, 0);
							КонецЕсли;
						Иначе
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный[ВыборкаАбоненты.ТарифнаяЗона] = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный[ВыборкаАбоненты.ТарифнаяЗона] + ВыборкаАбоненты.ОбъемУслугиПотребленный; 
						КонецЕсли;
						
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет.Вставить(ВыборкаАбоненты.ТарифнаяЗона, 0);
						КонецЕсли;
							
					КонецЕсли;
					
					
					Если НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
						И НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда							
						
						СтрокаНачисленияБезПрибора 				= ДанныеПоУслуге.НачисленияНПБезПрибора.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты);	
						СтрокаНачисленияБезПрибора.ОбъектРасчета 	= ВыборкаАбоненты.Абонент;
						СтрокаНачисленияБезПрибора.МКД 				= ВыборкаАбоненты.Строение;
						
					КонецЕсли;
					
					Если НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
						И НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему и ВыборкаАбоненты.ОбъемУслугиПотребленный <> 0 Тогда							
						
						СтрокаНачисленияБезПрибора 					= ДанныеПоУслуге.НачисленияНПБезПрибораПотребленный.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты);	
						СтрокаНачисленияБезПрибора.ОбъектРасчета 	= ВыборкаАбоненты.Абонент;
						СтрокаНачисленияБезПрибора.МКД 				= ВыборкаАбоненты.Строение;
						
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если ВыборкаАбоненты.ОбъемУслуги <> 0 Тогда
					Если ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
						СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийАбонентов.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаАбоненты,,"ОбъемУслугиПотребленный");
						СтрокаСписатьИндивидуальные.ОбъемУслуги		= ВыборкаАбоненты.ОбъемУслуги;
						СтрокаСписатьИндивидуальные.Сумма			= ВыборкаАбоненты.Сумма; 
						
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны.Вставить(ВыборкаАбоненты.ТарифнаяЗона, ВыборкаАбоненты.ОбъемУслуги);
							Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
								ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет.Вставить(ВыборкаАбоненты.ТарифнаяЗона, 0);
							КонецЕсли;
						Иначе
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[ВыборкаАбоненты.ТарифнаяЗона] = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[ВыборкаАбоненты.ТарифнаяЗона] + ВыборкаАбоненты.ОбъемУслуги; 
						КонецЕсли;					
					Иначе
						
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет.Вставить(ВыборкаАбоненты.ТарифнаяЗона, ВыборкаАбоненты.ОбъемУслуги);
						Иначе
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] + ВыборкаАбоненты.ОбъемУслуги; 
						КонецЕсли;					
					КонецЕсли;
				КонецЕсли;
				
				Если ВыборкаАбоненты.ОбъемУслугиПотребленный <> 0 Тогда
					Если ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
						СтрокаСписатьИндивидуальные  				= ДанныеПоУслуге.ДанныеНачисленийАбонентовПотребленный.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСписатьИндивидуальные, ВыборкаАбоненты,, "ОбъемУслуги");
						СтрокаСписатьИндивидуальные.ОбъемУслугиПотребленный		= ВыборкаАбоненты.ОбъемУслугиПотребленный;
						СтрокаСписатьИндивидуальные.Сумма						= 0;
						
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный.Вставить(ВыборкаАбоненты.ТарифнаяЗона, ВыборкаАбоненты.ОбъемУслугиПотребленный);
							Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
								ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет.Вставить(ВыборкаАбоненты.ТарифнаяЗона, 0);
							КонецЕсли;
						Иначе
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный[ВыборкаАбоненты.ТарифнаяЗона] = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленный[ВыборкаАбоненты.ТарифнаяЗона] + ВыборкаАбоненты.ОбъемУслугиПотребленный; 
						КонецЕсли;
					Иначе 
						Если ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = Неопределено Тогда
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет.Вставить(ВыборкаАбоненты.ТарифнаяЗона, ВыборкаАбоненты.ОбъемУслугиПотребленный);
						Иначе
							ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет[ВыборкаАбоненты.ТарифнаяЗона] + ВыборкаАбоненты.ОбъемУслугиПотребленный; 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;

				
				Если НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
					И НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему 
					И ВыборкаАбоненты.ОбъемУслуги <> 0 
					И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда	
					
					СтрокаНачисленияБезПрибора 				= ДанныеПоУслуге.НачисленияАбонентовБезПрибора.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты);							
				КонецЕсли;
				
				
				Если НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
					И НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему 
					И ВыборкаАбоненты.ОбъемУслугиПотребленный <> 0 
					И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда							
					
					СтрокаНачисленияБезПрибора 				= ДанныеПоУслуге.НачисленияАбонентовБезПрибораПотребленный.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты);							
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			
			Если ВыборкаАбоненты.ОбъемУслуги <> 0 И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
				СтрокаНачисленияБезПрибора 						= ДанныеПоУслуге.НачисленияАбонентовБезПрибора.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты,,"ОбъемУслугиПотребленный");
			КонецЕсли;
			
			Если ВыборкаАбоненты.ОбъемУслугиПотребленный <> 0 И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
				СтрокаНачисленияБезПрибора 						= ДанныеПоУслуге.НачисленияАбонентовБезПрибораПотребленный.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисленияБезПрибора,ВыборкаАбоненты,,"ОбъемУслуги");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
			ДанныеАбонента.ОбъемУслуги 							= ДанныеАбонента.ОбъемУслуги + ВыборкаАбоненты.ОбъемУслуги; 
			ДанныеАбонента.ОбъемУслугиПотребленный 				= ДанныеАбонента.ОбъемУслугиПотребленный + ВыборкаАбоненты.ОбъемУслугиПотребленный; 
		КонецЕсли;

		
		Если НЕ ВыборкаАбоненты.ПомещениеСРазделенными И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет И Не ВыборкаАбоненты.ПодключениеНеОтОбщейСборки Тогда
			ПотреблениеАбонентов 							= ПотреблениеАбонентов + ВыборкаАбоненты.ОбъемУслуги;
			ПотреблениеАбонентовПоФакту						= ПотреблениеАбонентовПоФакту + ВыборкаАбоненты.ОбъемУслугиПотребленный;
		КонецЕсли;
		
		Если ВыборкаАбоненты.ВидНачисления = Перечисления.энргВидыНачислений.Перерасчет Тогда
			ОбъемУслугиПерерасчет							= ОбъемУслугиПерерасчет + ВыборкаАбоненты.ОбъемУслуги;
			ОбъемУслугиПотребленныйПерерасчет				= ОбъемУслугиПотребленныйПерерасчет + ВыборкаАбоненты.ОбъемУслугиПотребленный;
		КонецЕсли;
		
		Если НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам
			И НЕ ВыборкаАбоненты.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему
			И НЕ ВыборкаАбоненты.ПомещениеСРазделенными
			И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет Тогда
			
			Если НЕ ВыборкаАбоненты.ОбъемУслуги = 0 Тогда
				ВсеПоПрибору 									= Ложь;
			КонецЕсли;
			
			Если НЕ ВыборкаАбоненты.ОбъемУслугиПотребленный = 0 Тогда
				ВсеПоПриборуПотребленный						= Ложь;
			КонецЕсли;
			
		ИначеЕсли НЕ ВыборкаАбоненты.ПомещениеСРазделенными И ВыборкаАбоненты.ВидНачисления <> Перечисления.энргВидыНачислений.Перерасчет И Не ВыборкаАбоненты.ПодключениеНеОтОбщейСборки Тогда
			ПотреблениеАбонентовПоПрибору 					= ПотреблениеАбонентовПоПрибору + ВыборкаАбоненты.ОбъемУслуги;
			ПотреблениеАбонентовПоПриборуПоФакту			= ПотреблениеАбонентовПоПриборуПоФакту + ВыборкаАбоненты.ОбъемУслугиПотребленный;
			Если НЕ ВыборкаАбоненты.ОбъемУслуги = 0 Тогда
				ЕстьРасходПоПрибору 						= Истина;
			КонецЕсли;
			Если НЕ ВыборкаАбоненты.ОбъемУслугиПотребленный = 0 Тогда
				ЕстьРасходПоПриборуПотребленный				= Истина;
			КонецЕсли;
		КонецЕсли;
		
		ТекПомещение 										= ВыборкаАбоненты.Помещение;
		
		Если НЕ ВыборкаАбоненты.Следующий() Тогда
			Прервать;
			ВыборкаАбоненты.сбросить();
		КонецЕсли; 				
	КонецЦикла;  			
	
	Если Не ТекПомещение = Неопределено Тогда
		Если НЕ ДанныеАбонента.ПомещениеСРазделенными Тогда
			мАбонентыДляРаспределения.Добавить(ДанныеАбонента);
			ДанныеПоУслуге.ПлощадиАбонентов.Вставить(ТекПомещение,ДанныеАбонента.ЗначениеПлощади);
			
			Если ЕстьРасходПоПрибору Тогда
				ВсегоПлощадьАбонентовПоПрибору 				= ВсегоПлощадьАбонентовПоПрибору + ДанныеАбонента.ЗначениеПлощади; 
			КонецЕсли;
			
			Если ЕстьРасходПоПриборуПотребленный Тогда
				ВсегоПлощадьАбонентовПоПриборуПотребленный	= ВсегоПлощадьАбонентовПоПриборуПотребленный + ДанныеАбонента.ЗначениеПлощади; 
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Пока ВыборкаОбъемПоПриборуКорректировать.Строение = ВыборкаОбъемМКД.Строение и ВыборкаОбъемПоПриборуКорректировать.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		Если НЕ ВыборкаОбъемПоПриборуКорректировать.Помещение = null Тогда		
			
			Если ВыборкаОбъемПоПриборуКорректировать.ОбъемУслуги <> 0 Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоУслуге.ОбъемПоПриборуКорректировать.Добавить(), ВыборкаОбъемПоПриборуКорректировать);
			КонецЕсли;
			
			Если ВыборкаОбъемПоПриборуКорректировать.ОбъемУслугиПотребленный <> 0 Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоУслуге.ОбъемПоПриборуКорректироватьПотребленный.Добавить(), ВыборкаОбъемПоПриборуКорректировать);
			КонецЕсли;
			
		КонецЕсли; 				
		Если НЕ ВыборкаОбъемПоПриборуКорректировать.Следующий() Тогда
			Прервать;
			ВыборкаОбъемПоПриборуКорректировать.сбросить();
		КонецЕсли; 				
	КонецЦикла;
	
	Пока ВыборкаОбъемПоПриборуНПКорректировать.Строение = ВыборкаОбъемМКД.Строение и ВыборкаОбъемПоПриборуНПКорректировать.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		Если НЕ ВыборкаОбъемПоПриборуНПКорректировать.ОбъектРасчета = null Тогда		
			
			Если ВыборкаОбъемПоПриборуКорректировать.ОбъемУслуги <> 0 Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоУслуге.ОбъемПоПриборуНПКорректировать.Добавить(), ВыборкаОбъемПоПриборуНПКорректировать);				
			КонецЕсли;
			
			Если ВыборкаОбъемПоПриборуКорректировать.ОбъемУслугиПотребленный <> 0 Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоУслуге.ОбъемПоПриборуНПКорректироватьПотребленный.Добавить(), ВыборкаОбъемПоПриборуНПКорректировать);				
			КонецЕсли; 		
			
		КонецЕсли; 				
		Если НЕ ВыборкаОбъемПоПриборуНПКорректировать.Следующий() Тогда
			Прервать;
			ВыборкаОбъемПоПриборуНПКорректировать.сбросить();
		КонецЕсли; 				
	КонецЦикла;
	
	ОтрицательноеРаспределениеОбъем 							= 0;
	ОтрицательноеРаспределениеОбъемПотребленный 				= 0;
	
	ОписаниеСтрокиОтрицальногоОбъема 							= "ПериодНачисленияОбъема,ТарифнаяЗона,ОбъемУслуги,ОбъемУслугиПотребленный";
	
	ТарифныеЗоныИдентичны = ДанныеПоУслуге.ПотреблениеАбонентовТарифныеЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] <> Неопределено;
	Отбор = Новый Структура("Строение,Услуга,ТарифнаяЗона", ВыборкаОбъемМКД.Строение, ВыборкаОбъемМКД.Услуга, 
		?(ТарифныеЗоныИдентичны, ВыборкаОбъемМКД.ТарифнаяЗона, Справочники.энргТарифныеЗоны.БезРазбивки)); 
	Строки = ТЗОтрицательныйОбъемРаспределения.НайтиСтроки(Отбор);
	Для Каждого ТекСтрока Из Строки Цикл
	//Пока ВыборкаОтрицательныйОбъемРаспределения.Строение = ВыборкаОбъемМКД.Строение и ВыборкаОтрицательныйОбъемРаспределения.Услуга = ВыборкаОбъемМКД.Услуга Цикл
		
		ОтрицательноеРаспределениеОбъем 						= ОтрицательноеРаспределениеОбъем + ТекСтрока.ОбъемУслуги;
		ОтрицательноеРаспределениеОбъемПотребленный 			= ОтрицательноеРаспределениеОбъемПотребленный + ТекСтрока.ОбъемУслугиПотребленный;
		
		яДанныеСтрокиОтрицательныйОбъем 						= Новый Структура(ОписаниеСтрокиОтрицальногоОбъема);
		ЗаполнитьЗначенияСвойств(яДанныеСтрокиОтрицательныйОбъем,ТекСтрока);
		ДанныеПоУслуге.ОтрицательныйОбъемРаспределения.Расшифровка.Добавить(яДанныеСтрокиОтрицательныйОбъем);
		
		//Если НЕ ВыборкаОтрицательныйОбъемРаспределения.Следующий() Тогда
		//	Прервать;
		//	ВыборкаОтрицательныйОбъемРаспределения.сбросить();
		//КонецЕсли; 				
	КонецЦикла;  
	
	ДанныеПоУслуге.Вставить("ВсеПоПрибору", 				ВсеПоПрибору);
	ДанныеПоУслуге.Вставить("ВсеПоПриборуПотребленный", 	ВсеПоПриборуПотребленный);
	
	
	ОтрицательныйОбъемРаспределения 							= ДанныеПоУслуге.ОтрицательныйОбъемРаспределения;
	ОтрицательныйОбъемРаспределения.ОбъемУслуги 				= ОтрицательноеРаспределениеОбъем;
	ОтрицательныйОбъемРаспределения.ОбъемУслугиПотребленный 	= ОтрицательноеРаспределениеОбъемПотребленный;

	ДанныеПоУслуге.ПотреблениеАбонентов 						= ПотреблениеАбонентов;
	ДанныеПоУслуге.ПотреблениеАбонентовПотребленный				= ПотреблениеАбонентовПоФакту;
	ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПрибору 				= ВсегоПлощадьАбонентовПоПрибору;
	ДанныеПоУслуге.ВсегоПлощадьАбонентовПоПриборуПотребленный 	= ВсегоПлощадьАбонентовПоПриборуПотребленный;
	ДанныеПоУслуге.ПотреблениеАбонентовПоПрибору 				= ПотреблениеАбонентовПоПрибору;
	ДанныеПоУслуге.ПотреблениеАбонентовПоПриборуПотребленный	= ПотреблениеАбонентовПоПриборуПоФакту;
	ДанныеПоУслуге.ОбщийОбъемНачислений							= ОбщийОбъемНачислений;
	ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений				= ОбщийОбъемНачисленийПомещений;
	ДанныеПоУслуге.ОбъемУслугиПерерасчет						= ОбъемУслугиПерерасчет;
	ДанныеПоУслуге.ОбъемУслугиПотребленныйПерерасчет			= ОбъемУслугиПотребленныйПерерасчет;
	
	ДанныеПоУслуге.ОбщийОбъемНачисленийПотребленный				= ОбщийОбъемНачисленийПотребленный;
	ДанныеПоУслуге.ОбщийОбъемНачисленийПомещенийПотребленный	= ОбщийОбъемНачисленийПомещенийПотребленный;
КонецПроцедуры

Процедура ПрочитатьНаборыДляЗаписиПриРаспределении(ВыборкаОбъемМКД, ДокументОбъект, НаборВыполненные, НаборЗаписей, НаборОтрицательныйОбъемРаспределения, НаборЗаписейПомещений, НаборЗаписейНП, НаборЗаписейНПЭЭ, НаборЗаписейСверхНорма, ГраницыПериода)
	
	ДокументСсылка 								= ВыборкаОбъемМКД.ДокументРаспределения;
	ДокументОбъект 								= Неопределено;
	НаборВыполненные 							= Неопределено;
	НаборЗаписей 								= Неопределено;
	НаборЗаписейПомещений 						= Неопределено;
	НаборЗаписейНП 								= Неопределено;
	НаборЗаписейСверхНорма 						= Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
		ДокументСсылка 							= Документы.энргРаспределениеМКД.ПолучитьСсылку(Новый УникальныйИдентификатор());
		ДокументОбъект 							= Документы.энргРаспределениеМКД.СоздатьДокумент();
		ДокументОбъект.Организация				= ВыборкаОбъемМКД.Организация;
		ДокументОбъект.Район 					= ВыборкаОбъемМКД.Район;
		ДокументОбъект.МКД 						= ВыборкаОбъемМКД.Строение;
		ДокументОбъект.Дата 					= ГраницыПериода.ЗавершениеОП - 1;		
																				  
		ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
		
		НаборВыполненные 						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненныеДопСвойства 			= НаборВыполненные.ДополнительныеСвойства;
		НаборВыполненныеДопСвойства.Вставить("Замещать", Ложь);
			
		ЗаписьВыполненные						= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 			= ВыборкаОбъемМКД.Организация;
		ЗаписьВыполненные.Район		 			= ВыборкаОбъемМКД.Район;
		ЗаписьВыполненные.ПериодНачисления 		= ВыборкаОбъемМКД.ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления	= Перечисления.энргВидыОперацийНачисления.РаспределениеМКД;
		ЗаписьВыполненные.МКД 					= ВыборкаОбъемМКД.Строение;
		ЗаписьВыполненные.ДокументНачисления 	= ДокументСсылка;
							
	Иначе
		ДокументОбъект 							= ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления 			= Ложь;
		
		НаборВыполненные 						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
		НаборВыполненныеДопСвойства 			= НаборВыполненные.ДополнительныеСвойства;
		НаборВыполненныеДопСвойства.Вставить("Замещать", Истина);
		
		НаборВыполненные.Отбор.Организация.Установить(ВыборкаОбъемМКД.Организация);
		НаборВыполненные.Отбор.ПериодНачисления.Установить(ВыборкаОбъемМКД.ПериодНачисления);
		НаборВыполненные.Отбор.Район.Установить(ВыборкаОбъемМКД.Район);					
		НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.РаспределениеМКД);
		НаборВыполненные.Отбор.МКД.Установить(ВыборкаОбъемМКД.Строение);
				
  
		ЗаписьВыполненные						= НаборВыполненные.Добавить();
		ЗаписьВыполненные.Организация 			= ВыборкаОбъемМКД.Организация;
		ЗаписьВыполненные.Район		 			= ВыборкаОбъемМКД.Район;
		ЗаписьВыполненные.ПериодНачисления 		= ВыборкаОбъемМКД.ПериодНачисления;
		ЗаписьВыполненные.ВидОперацийНачисления = Перечисления.энргВидыОперацийНачисления.РаспределениеМКД;
		ЗаписьВыполненные.МКД 					= ВыборкаОбъемМКД.Строение;
		ЗаписьВыполненные.ДокументНачисления 	= ДокументСсылка;
		ЗаписьВыполненные.ПометкаУдаления	 	= Ложь;
		
		НаборОтрицательныйОбъем					= РегистрыНакопления.энргОтрицательныйОбъемРаспределенияМКД.СоздатьНаборЗаписей();
		НаборОтрицательныйОбъем.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборОтрицательныйОбъем.Записать(); // очищаем набор записей
		
		НаборЗаписей 							= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Записать(); // очищаем набор записей
		
		НаборЗаписейПомещений					= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
		НаборЗаписейПомещений.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейПомещений.Записать(); // очищаем набор записей
		
		НаборЗаписейНП 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
		НаборЗаписейНП.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейНП.Записать(); // очищаем набор записей
				
		НаборЗаписейНПЭЭ 							= РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.СоздатьНаборЗаписей();
		НаборЗаписейНПЭЭ.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейНПЭЭ.Записать(); // очищаем набор записей

		НаборЗаписейСверхНорма 					= РегистрыНакопления.энргОбъемНачисленийСверхнормативаМКД.СоздатьНаборЗаписей();
		НаборЗаписейСверхНорма.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейСверхНорма.Записать(); // очищаем набор записей
	КонецЕсли;
	
	НаборЗаписей 								= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПериодНачисления",	ВыборкаОбъемМКД.ПериодНачисления);
	НаборЗаписей.ДополнительныеСвойства.Вставить("Организация", 		ВыборкаОбъемМКД.Организация);
	НаборЗаписей.ДополнительныеСвойства.Вставить("Район",  				ВыборкаОбъемМКД.Район);
	НаборЗаписей.ДополнительныеСвойства.Вставить("Строение",    		ВыборкаОбъемМКД.Строение);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЧастныйСектор",  		Ложь);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
	
	НаборЗаписейПомещений						= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
	НаборЗаписейПомещений.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("ПериодНачисления",	ВыборкаОбъемМКД.ПериодНачисления);
	НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("Организация", 		ВыборкаОбъемМКД.Организация);
	НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("Район",  			ВыборкаОбъемМКД.Район);
	НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("Строение",    		ВыборкаОбъемМКД.Строение);
	НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("ЧастныйСектор",  	Ложь);
	НаборЗаписейПомещений.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
			
	НаборЗаписейНП 								= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();	
	НаборЗаписейНП.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписейНП.ДополнительныеСвойства.Вставить("ПериодНачисления",	ВыборкаОбъемМКД.ПериодНачисления);
	НаборЗаписейНП.ДополнительныеСвойства.Вставить("Организация", 		ВыборкаОбъемМКД.Организация);
	НаборЗаписейНП.ДополнительныеСвойства.Вставить("Район",  			ВыборкаОбъемМКД.Район);
	НаборЗаписейНП.ДополнительныеСвойства.Вставить("Строение",    		ВыборкаОбъемМКД.Строение);
	НаборЗаписейНП.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
	
	НаборЗаписейНПЭЭ 								= РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.СоздатьНаборЗаписей();	
	НаборЗаписейНПЭЭ.Отбор.Регистратор.Установить(ДокументСсылка);

			
	НаборЗаписейСверхНорма 						= РегистрыНакопления.энргОбъемНачисленийСверхнормативаМКД.СоздатьНаборЗаписей();
	НаборЗаписейСверхНорма.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("ПериодНачисления",	ВыборкаОбъемМКД.ПериодНачисления);
	НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("Организация", 		ВыборкаОбъемМКД.Организация);
	НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("Район",  			ВыборкаОбъемМКД.Район);
	НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("Строение",    		ВыборкаОбъемМКД.Строение);
	НаборЗаписейСверхНорма.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
	
	НаборОтрицательныйОбъемРаспределения 		= РегистрыНакопления.энргОтрицательныйОбъемРаспределенияМКД.СоздатьНаборЗаписей();
	НаборОтрицательныйОбъемРаспределения.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборОтрицательныйОбъемРаспределения.ДополнительныеСвойства.Вставить("ПериодНачисления",	ВыборкаОбъемМКД.ПериодНачисления);
	НаборОтрицательныйОбъемРаспределения.ДополнительныеСвойства.Вставить("Организация", 		ВыборкаОбъемМКД.Организация);
	НаборОтрицательныйОбъемРаспределения.ДополнительныеСвойства.Вставить("Район",  				ВыборкаОбъемМКД.Район);
	НаборОтрицательныйОбъемРаспределения.ДополнительныеСвойства.Вставить("Строение",    		ВыборкаОбъемМКД.Строение);
	НаборОтрицательныйОбъемРаспределения.ДополнительныеСвойства.Вставить("ДатаРегистратора",	ГраницыПериода.ЗавершениеОП-1);
	
КонецПроцедуры

Процедура ЗаполнитьОбъемыМКДПриРаспределении(ВыборкаОбъемМКД, ДанныеПоУслуге)
	Если НЕ ВыборкаОбъемМКД.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам 
		И НЕ ВыборкаОбъемМКД.СпособНачисления = Перечисления.энргСпособНачислений.НачислениеПоСреднему Тогда
		
		ОбъемБезПрибора 								= ВыборкаОбъемМКД.ОбъемУслуги * ?(ВыборкаОбъемМКД.ПлощадьМОПУказана , 1 , ВыборкаОбъемМКД.ВсегоПлощадьАбонентов);
		ОбъемПотребленныйБезПрибора 					= ВыборкаОбъемМКД.ОбъемУслугиПотребленный * ?(ВыборкаОбъемМКД.ПлощадьМОПУказана , 1 , ВыборкаОбъемМКД.ВсегоПлощадьАбонентов);		
		
		ДанныеПоУслуге.ОбъемБезПрибора					= ДанныеПоУслуге.ОбъемБезПрибора + ОбъемБезПрибора;
		ДанныеПоУслуге.ОбъемПотребленныйБезПрибора 		= ДанныеПоУслуге.ОбъемПотребленныйБезПрибора + ОбъемПотребленныйБезПрибора;		
		ДанныеПоУслуге.НеУчитыватьПерерасчетыАбонентов	= Истина;

		ДополнитьСоответствиеОбъемовПоТарифнойЗоне(ДанныеПоУслуге, "ОбъемБезПрибораТарифныЗоны", ВыборкаОбъемМКД, ОбъемБезПрибора);
		ДополнитьСоответствиеОбъемовПоТарифнойЗоне(ДанныеПоУслуге, "ОбъемБезПрибораТарифныЗоныПотребленный", ВыборкаОбъемМКД, ОбъемПотребленныйБезПрибора);
		
		//Если ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = Неопределено Тогда
		//	ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны.Вставить(ВыборкаОбъемМКД.ТарифнаяЗона, ОбъемБезПрибора);
		//Иначе
		//	ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] +  ОбъемБезПрибора;
		//КонецЕсли;
		//
		//Если ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоныПотребленный[ВыборкаОбъемМКД.ТарифнаяЗона] = Неопределено Тогда
		//	ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоныПотребленный.Вставить(ВыборкаОбъемМКД.ТарифнаяЗона, ОбъемПотребленныйБезПрибора);
		//Иначе
		//	ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоныПотребленный[ВыборкаОбъемМКД.ТарифнаяЗона] = ДанныеПоУслуге.ОбъемБезПрибораТарифныЗоныПотребленный[ВыборкаОбъемМКД.ТарифнаяЗона] + ОбъемПотребленныйБезПрибора;
		//КонецЕсли;	
		
	Иначе
		
		ДанныеПоУслуге.ОбъемПоПрибору 				= ДанныеПоУслуге.ОбъемПоПрибору + ВыборкаОбъемМКД.ОбъемУслуги;
		ДанныеПоУслуге.ОбъемПотребленныйПоПрибору 	= ДанныеПоУслуге.ОбъемПотребленныйПоПрибору + ВыборкаОбъемМКД.ОбъемУслугиПотребленный;
		
		ДополнитьСоответствиеОбъемовПоТарифнойЗоне(ДанныеПоУслуге, "ОбъемПоПриборуТарифныЗоны", ВыборкаОбъемМКД, ВыборкаОбъемМКД.ОбъемУслуги);
		ДополнитьСоответствиеОбъемовПоТарифнойЗоне(ДанныеПоУслуге, "ОбъемПоПриборуТарифныЗоныПотребленный", ВыборкаОбъемМКД, ВыборкаОбъемМКД.ОбъемУслугиПотребленный);	
		
		//Если ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = Неопределено Тогда
		//	ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны.Вставить(ВыборкаОбъемМКД.ТарифнаяЗона, ВыборкаОбъемМКД.ОбъемУслуги);
		//Иначе
		//	ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] = ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоны[ВыборкаОбъемМКД.ТарифнаяЗона] +  ВыборкаОбъемМКД.ОбъемУслуги;
		//КонецЕсли;
		//
		//Если ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоныПотребленный[ВыборкаОбъемМКД.ТарифнаяЗона] = Неопределено Тогда
		//	ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоныПотребленный.Вставить(ВыборкаОбъемМКД.ТарифнаяЗона, ВыборкаОбъемМКД.ОбъемУслугиПотребленный);
		//Иначе
		//	ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоныПотребленный[ВыборкаОбъемМКД.ТарифнаяЗона] = ДанныеПоУслуге.ОбъемПоПриборуТарифныЗоныПотребленный[ВыборкаОбъемМКД.ТарифнаяЗона] +  ВыборкаОбъемМКД.ОбъемУслугиПотребленный;
		//КонецЕсли;  
		
	КонецЕсли;	
	
	ДанныеПоУслуге.ОбъемУслугиНорматив 					= ДанныеПоУслуге.ОбъемУслугиНорматив + ВыборкаОбъемМКД.ОбъемУслугиНорматив;	
	ДанныеПоУслуге.ПоказанияПредоставлены 				= ВыборкаОбъемМКД.ПоказанияПредоставлены;
	ДанныеПоУслуге.ПоказанияПредоставленыПотребленный 	= ВыборкаОбъемМКД.ПоказанияПредоставленыПотребленный;
КонецПроцедуры

Процедура ДополнитьСоответствиеОбъемовПоТарифнойЗоне(ДанныеПоУслуге, ИмяСоответствия, ВыборкаОбъемМКД, ОбъемДополнения)
	Если ДанныеПоУслуге[ИмяСоответствия][ВыборкаОбъемМКД.ТарифнаяЗона] = Неопределено Тогда
		ДанныеПоУслуге[ИмяСоответствия].Вставить(ВыборкаОбъемМКД.ТарифнаяЗона, ОбъемДополнения);
	Иначе
		ДанныеПоУслуге[ИмяСоответствия][ВыборкаОбъемМКД.ТарифнаяЗона] = ДанныеПоУслуге[ИмяСоответствия][ВыборкаОбъемМКД.ТарифнаяЗона] + ОбъемДополнения;
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьНаборыЗаписейПриРаспределении(ВыборкаДокументыРаспредления)
	
	ДокументСсылка 								= ВыборкаДокументыРаспредления.ДокументНачисления;
	ДокументОбъект 								= Неопределено;
	НаборВыполненные 							= Неопределено;
	НаборЗаписей 								= Неопределено;
	НаборЗаписейПомещений 						= Неопределено;
	НаборЗаписейНП 								= Неопределено;
	НаборЗаписейСверхНорма 						= Неопределено;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда			
		ДокументОбъект 							= ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления 			= ВыборкаДокументыРаспредления.ПометкаУдаления;
		
		НаборОтрицательныйОбъем					= РегистрыНакопления.энргОтрицательныйОбъемРаспределенияМКД.СоздатьНаборЗаписей();
		НаборОтрицательныйОбъем.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборОтрицательныйОбъем.Записать(); // очищаем набор записей
		
		НаборЗаписей 							= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Записать(); // очищаем набор записей
		
		НаборЗаписейПомещений					= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
		НаборЗаписейПомещений.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейПомещений.Записать(); // очищаем набор записей
		
		НаборЗаписейНП 							= РегистрыНакопления.бестОбъемНачисленийНП.СоздатьНаборЗаписей();
		НаборЗаписейНП.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейНП.Записать(); // очищаем набор записей
				
		НаборЗаписейНПЭЭ 							= РегистрыНакопления.бестОбъемНачисленийЭлектроэнергии.СоздатьНаборЗаписей();
		НаборЗаписейНПЭЭ.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейНПЭЭ.Записать(); // очищаем набор записей

		НаборЗаписейСверхНорма 					= РегистрыНакопления.энргОбъемНачисленийСверхнормативаМКД.СоздатьНаборЗаписей();
		НаборЗаписейСверхНорма.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписейСверхНорма.Записать(); // очищаем набор записей
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПараметрыРасчетаНорматива(ДанныеПоУслуге, ПараметрыРасчетаНорматива, РассчитыватьНорматив, ТипыНачислений, Услуга, НачисленияПоУслугам) 
	СуммаРасходовПоУслуге  	= 0;
	
	Для Каждого СтрокаОбъема ИЗ ДанныеПоУслуге.ОбщийОбъемНачислений Цикл
		Если ДанныеПоУслуге.НеНачислятьУслугуАбонентам Тогда
			СуммаРасходовПоУслуге = СтрокаОбъема.ОбъемУслугиПотребленный + СуммаРасходовПоУслуге
		Иначе
			СуммаРасходовПоУслуге = СтрокаОбъема.ОбъемУслуги + СуммаРасходовПоУслуге
		КонецЕсли;;
	КонецЦикла;
	Для Каждого СтрокаОбъема ИЗ ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений Цикл
		Если ДанныеПоУслуге.НеНачислятьУслугуАбонентам Тогда
			СуммаРасходовПоУслуге = СтрокаОбъема.ОбъемУслугиПотребленный + СуммаРасходовПоУслуге;
		Иначе
			СуммаРасходовПоУслуге = СтрокаОбъема.ОбъемУслуги + СуммаРасходовПоУслуге;
		КонецЕсли;
	КонецЦикла;
		
	ДанныеНачисленийПоУслуге 	= Новый Структура("НеНачислятьУслугуАбонентам, ПотреблениеАбонентов,ПотреблениеПомещений",ДанныеПоУслуге.НеНачислятьУслугуАбонентам, ДанныеПоУслуге.ОбщийОбъемНачислений,ДанныеПоУслуге.ОбщийОбъемНачисленийПомещений);
	НачисленияПоУслугам.Вставить(Услуга, ДанныеНачисленийПоУслуге);
	
	Если ПараметрыРасчетаНорматива[Услуга] = Неопределено Тогда
		ОписаниеРасхода			= Новый Соответствие;
		ОписаниеРасхода.Вставить(ТипыНачислений["СуммаРасходовВсехПомещенийПоУслуге"], СуммаРасходовПоУслуге);
		ПараметрыРасчетаНорматива.Вставить(Услуга,ОписаниеРасхода);
	Иначе
		ПараметрыРасчетаНорматива[Услуга].Вставить(ТипыНачислений["СуммаРасходовВсехПомещенийПоУслуге"], СуммаРасходовПоУслуге);
	КонецЕсли;
	
	Если ПараметрыРасчетаНорматива[Услуга] = Неопределено Тогда
		ОписаниеРасхода			= Новый Соответствие;
		ОписаниеРасхода.Вставить(ТипыНачислений["РасходМКДПоУслуге"], ДанныеПоУслуге.ОбъемПоПрибору + ДанныеПоУслуге.ОбъемБезПрибора);
		ПараметрыРасчетаНорматива.Вставить(Услуга,ОписаниеРасхода);
	Иначе
		ПараметрыРасчетаНорматива[Услуга].Вставить(ТипыНачислений["РасходМКДПоУслуге"], ДанныеПоУслуге.ОбъемПоПрибору + ДанныеПоУслуге.ОбъемБезПрибора);
	КонецЕсли;
	
	Если ПараметрыРасчетаНорматива[Услуга] = Неопределено Тогда
		ОписаниеРасхода			= Новый Соответствие;
		ОписаниеРасхода.Вставить(ТипыНачислений["ЗначениеНормативаПоУслуге"], ДанныеПоУслуге.ЗначениеНорматива);
		ПараметрыРасчетаНорматива.Вставить(Услуга,ОписаниеРасхода);
	Иначе
		ПараметрыРасчетаНорматива[Услуга].Вставить(ТипыНачислений["ЗначениеНормативаПоУслуге"], ДанныеПоУслуге.ЗначениеНорматива);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ДанныеПоУслуге.ФормулаРасчетаНорматива) Тогда
		ФормулаРасчета 			= Новый Структура("Услуга, ФормулаРасчета, ЗависитОтУслуги", Услуга, ДанныеПоУслуге.ФормулаРасчетаНорматива, ДанныеПоУслуге.ЗависитОтУслуги);
		РассчитыватьНорматив.Добавить(ФормулаРасчета);
	КонецЕсли;
				
КонецПроцедуры

Процедура РассчитатьНормативПоФормуле(ПараметрыРасчетаНорматива, РассчитыватьНорматив, НачисленияПоУслугам, ЗначенияТарифов, ГраницыПериода,Отказ, НаборЗаписей, НаборЗаписейНП, НаборЗаписейПомещений)
	
	ВидНачисленияОДН 										= Перечисления.энргВидыНачислений.НачислениеОДН;
	
	Для Сч = 0 По РассчитыватьНорматив.ВГраница() Цикл
		ЗначениеНорматива  									= Неопределено;
		ФормулаРасчета  									= РассчитыватьНорматив[Сч].ФормулаРасчета;
		Услуга 												= РассчитыватьНорматив[Сч].Услуга;
		ЗависитОтУслуги 									= РассчитыватьНорматив[Сч].ЗависитОтУслуги;
		Для Каждого КлючЗначение ИЗ ПараметрыРасчетаНорматива Цикл
			УслугаВФормуле									= КлючЗначение.Ключ;
			КлючУслуги 										= XMLСтрока(УслугаВФормуле);
			Для Каждого ТипыНачислений Из КлючЗначение.Значение Цикл
				ДанныеРасхода 								= "[" + ЗначениеВСтрокуВнутр(Новый Структура("ТипРасхода, Услуга", ТипыНачислений.Ключ, КлючУслуги)) + "]";
				ФормулаРасчета 								= СтрЗаменить(ФормулаРасчета,ДанныеРасхода,XMLСтрока(ТипыНачислений.Значение));
			КонецЦикла;			
		КонецЦикла;
		ФормулаРасчета 										= СтрЗаменить(ФормулаРасчета,"[Результат]","ЗначениеНорматива");
		Попытка
			Выполнить ФормулаРасчета;
		Исключение
			Отказ 											= Истина;			   
		КонецПопытки;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
		// Снимаем начисленные объемы потребления по услуге
		НачисленияПоУслуге	 								= НачисленияПоУслугам[Услуга].ПотреблениеАбонентов;
		Для Каждого СтрокаНачислений ИЗ НачисленияПоУслуге Цикл
			СтрокаСнимаем 									= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСнимаем, СтрокаНачислений);
			СтрокаСнимаем.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаСнимаем.Распределение 					= Истина;
			СтрокаСнимаем.Сумма 							= -СтрокаСнимаем.Сумма;
			СтрокаСнимаем.ОбъемУслуги 						= -СтрокаСнимаем.ОбъемУслуги;
			СтрокаСнимаем.ОбъемУслугиПотребленный 			= -СтрокаСнимаем.ОбъемУслугиПотребленный;
			СтрокаСнимаем.СуммаПоПовышенномуКоэффициенту 	= -СтрокаСнимаем.СуммаПоПовышенномуКоэффициенту;
		КонецЦикла;
		
		НеНачислятьУслугуАбонентам 							= НачисленияПоУслугам[ЗависитОтУслуги].НеНачислятьУслугуАбонентам;
		НачисленияПоУслуге	 								= НачисленияПоУслугам[ЗависитОтУслуги].ПотреблениеАбонентов;
		Для Каждого СтрокаНачислений ИЗ НачисленияПоУслуге Цикл
			Если СтрокаНачислений.ВидНачисления  = ВидНачисленияОДН Тогда
				Продолжить;
			КонецЕсли;
			
			ХэшСтрокиТарифа 								= ХэшСтрокиТарифа(СтрокаНачислений.ТарифнаяГруппа,ЗависитОтУслуги,СтрокаНачислений.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки);
			ЗначениеТарифа 									= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
			
			СтрокаНачисляем									= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНачисляем, СтрокаНачислений);
			СтрокаНачисляем.Период 							= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНачисляем.Распределение 					= Истина;
			СтрокаНачисляем.Услуга 							= Услуга;
			СтрокаНачисляем.НормаПотребления 				= ЗначениеНорматива;
			СтрокаНачисляем.ЗначениеТарифа 					= ?(ЗначениеТарифа.Значение = 0, СтрокаНачислений.ЗначениеТарифа, ЗначениеТарифа.Значение);
			Если НеНачислятьУслугуАбонентам Тогда
				СтрокаНачисляем.ОбъемУслуги 				= СтрокаНачислений.ОбъемУслугиПотребленный * СтрокаНачисляем.НормаПотребления;
			Иначе
				СтрокаНачисляем.ОбъемУслуги 				= СтрокаНачислений.ОбъемУслуги * СтрокаНачисляем.НормаПотребления;
			КонецЕсли;
			СтрокаНачисляем.ОбъемУслугиПотребленный 		= СтрокаНачислений.ОбъемУслугиПотребленный* СтрокаНачисляем.НормаПотребления;
			СтрокаНачисляем.СуммаПоПовышенномуКоэффициенту 	= 0;
			СтрокаНачисляем.Сумма 							= СтрокаНачисляем.ЗначениеТарифа * СтрокаНачисляем.ОбъемУслуги;			
		КонецЦикла;		
	КонецЦикла;
		
КонецПроцедуры

Функция ДанныеПоУслугиДляРаспределения(ВыборкаОбъемМКД, РазделенныеЛицевыеСчета)
	ДанныеПоУслуге  									= Новый Структура;
	ДанныеПоУслуге.Вставить("СпособНачисленияМКД",							Неопределено);
	ДанныеПоУслуге.Вставить("ОбъемПоПрибору",								0);
	ДанныеПоУслуге.Вставить("ОбъемБезПрибора", 								0);
	ДанныеПоУслуге.Вставить("ОбъемПотребленныйПоПрибору", 					0);
	ДанныеПоУслуге.Вставить("ОбъемПотребленныйБезПрибора", 					0);
	ДанныеПоУслуге.Вставить("ОбъемУслугиНорматив", 							0);	
	ДанныеПоУслуге.Вставить("ОбъемУслугиНормативПотребленный", 				0);	
	ДанныеПоУслуге.Вставить("РаспределятьПолностью", 						ВыборкаОбъемМКД.РаспределятьПолностью);
	ДанныеПоУслуге.Вставить("ЗначениеНорматива", 							ВыборкаОбъемМКД.ЗначениеНорматива);
	ДанныеПоУслуге.Вставить("ОбъемБезПрибораТарифныЗоны",					Новый Соответствие);
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуТарифныЗоны",					Новый Соответствие);	
	ДанныеПоУслуге.Вставить("ОбъемБезПрибораТарифныЗоныПотребленный",		Новый Соответствие);
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуТарифныЗоныПотребленный",		Новый Соответствие);	
	ДанныеПоУслуге.Вставить("РаспределениеПоУслугам",						Новый Соответствие);
	ДанныеПоУслуге.Вставить("РаспределениеПоУслугамПотребленный",			Новый Соответствие);
	ДанныеПоУслуге.Вставить("ПлощадиАбонентов",								Новый Соответствие);
	ДанныеПоУслуге.Вставить("ЗависитОтУслуги",								ВыборкаОбъемМКД.ЗависитОтУслуги);
	ДанныеПоУслуге.Вставить("ВидПлощади",									ВыборкаОбъемМКД.ВидПлощади);
	ДанныеПоУслуге.Вставить("РазделенныеЛицевыеСчета",						РазделенныеЛицевыеСчета);
	ДанныеПоУслуге.Вставить("АбонентыДляРаспределения", 					Новый Массив);
	ДанныеПоУслуге.Вставить("КорректироватьИндивидуальныйОбъемСУчетомОДПУ",	ВыборкаОбъемМКД.КорректироватьИндивидуальныйОбъемСУчетомОДПУ); 
	ДанныеПоУслуге.Вставить("ВсегоАбонентов", 								ВыборкаОбъемМКД.ВсегоАбонентов);
	ДанныеПоУслуге.Вставить("ВсегоСУстановелннымПриборомУчета", 			ВыборкаОбъемМКД.ВсегоСУстановелннымПриборомУчета);
	ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентов", 						ВыборкаОбъемМКД.ВсегоПлощадьАбонентов);
	ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентовПоПрибору", 				0);			
	ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентовПоПриборуПотребленный", 	0);			
	ДанныеПоУслуге.Вставить("ПлощадьМОП", 									ВыборкаОбъемМКД.ПлощадьМОП);
	ДанныеПоУслуге.Вставить("ВсегоПлощадьАбонентовСобственнаяПоставка", 	ВыборкаОбъемМКД.ВсегоПлощадьАбонентовСобственнаяПоставка);
	ДанныеПоУслуге.Вставить("ДанныеНачисленийАбонентов", 					энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ДанныеНачисленийАбонентовПотребленный", 		энргНачисления.ОписаниеТаблицыОбъемов()); 	
	ДанныеПоУслуге.Вставить("ОбщийОбъемНачислений", 						энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбщийОбъемНачисленийПотребленный", 			энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбщийОбъемНачисленийПомещений", 				энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбщийОбъемНачисленийПомещенийПотребленный", 	энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("НачисленияАбонентовБезПрибора", 				энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("НачисленияАбонентовБезПрибораПотребленный", 	энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуКорректировать", 				энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуКорректироватьПотребленный", 	энргНачисления.ОписаниеТаблицыОбъемов());
	ДанныеПоУслуге.Вставить("ДанныеНачисленийДоговоров", 					энргНачисления.ОписаниеТаблицыОбъемов("бестОбъемНачисленийНП"));
	ДанныеПоУслуге.Вставить("ДанныеНачисленийДоговоровПотребленный", 		энргНачисления.ОписаниеТаблицыОбъемов("бестОбъемНачисленийНП"));
	ДанныеПоУслуге.Вставить("НачисленияНПБезПрибора", 						энргНачисления.ОписаниеТаблицыОбъемов("бестОбъемНачисленийНП"));
	ДанныеПоУслуге.Вставить("НачисленияНПБезПрибораПотребленный", 			энргНачисления.ОписаниеТаблицыОбъемов("бестОбъемНачисленийНП"));
	ДанныеПоУслуге.Вставить("УВсехАбонентовПоПрибору", 						Истина);
	ДанныеПоУслуге.Вставить("УВсехАбонентовПоПриборуПотребленный", 			Истина);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентов", 						0);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовПоПрибору", 				0);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовПотребленный", 			0);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовПоПриборуПотребленный", 	0);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовТарифныеЗоны", 			Новый Соответствие);	
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовТарифныеЗоныПотребленный", Новый Соответствие);	
	ДанныеПоУслуге.Вставить("НеРаспределятьСверхнорматив", 					ВыборкаОбъемМКД.НеРаспределятьСверхнорматив);
	ДанныеПоУслуге.Вставить("ФормулаРасчетаНорматива",	 					ВыборкаОбъемМКД.ФормулаРасчетаНорматива);
	ДанныеПоУслуге.Вставить("НеНачислятьУслугуАбонентам",	 				ВыборкаОбъемМКД.НеНачислятьУслугуАбонентам);
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуНПКорректировать", 				энргНачисления.ОписаниеТаблицыОбъемов("бестОбъемНачисленийНП"));	
	ДанныеПоУслуге.Вставить("ОбъемПоПриборуНПКорректироватьПотребленный", 	энргНачисления.ОписаниеТаблицыОбъемов("бестОбъемНачисленийНП"));
	ДанныеПоУслуге.Вставить("ПоказанияПредоставлены", 						0);	
	ДанныеПоУслуге.Вставить("ПоказанияПредоставленыПотребленный", 			0);
	ДанныеПоУслуге.Вставить("НазначениеПрибораУчета", 						Неопределено);
	ДанныеПоУслуге.Вставить("ОтрицательныйОбъемРаспределения", 				Новый Структура("ОбъемУслуги,ОбъемУслугиПотребленный,Расшифровка",0,0,Новый Массив));
	ДанныеПоУслуге.Вставить("ПроцентРаспределенияОтрицательногоОбъема", 	ВыборкаОбъемМКД.ПроцентРаспределенияОтрицательногоОбъема);	
	ДанныеПоУслуге.Вставить("ОбъемУслугиПерерасчет",						0);
	ДанныеПоУслуге.Вставить("ОбъемУслугиПотребленныйПерерасчет",			0);
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовТарифныеЗоныПерерасчет", 				Новый Соответствие);	
	ДанныеПоУслуге.Вставить("ПотреблениеАбонентовТарифныеЗоныПотребленныйПерерасчет",	Новый Соответствие);
	ДанныеПоУслуге.Вставить("НеУчитыватьПерерасчетыАбонентов",				Ложь);

	Возврат ДанныеПоУслуге;
КонецФункции

Процедура РазбитьПоСоцНорме(яНабор,яНаборОбщий,НаборЗаписей,СтрокаНачисленийАбонента,ОбъемУслуги,СоцПлощадь,СпособНачисленияОДН,ГраницыПериода,ДанныеПоУслуге,ЕстьСуммаНачислений,ЗначенияТарифов,Услуга,ПотреблениеАбонентов,СуммаПлощадейПомещения,ЭтоОбъемПотребленный,ТочностьОбъемаНачислений, ЗаполнитьКонецПериода = Неопределено)
	Если ЭтоОбъемПотребленный Тогда
		НеЗаполняем = "ОбъемУслуги";
		Заполняем 	= "ОбъемУслугиПотребленный";		
	Иначе
		НеЗаполняем = "ОбъемУслугиПотребленный";
		Заполняем 	= "ОбъемУслуги";		
	КонецЕсли;
	Объем 										= ОбъемУслуги;
	ОбъемСоцНорма 								= 0;
	Если СоцПлощадь < СтрокаНачисленийАбонента.ЗначениеПлощади Тогда 
		ОбъемСоцНорма 							= Окр(Объем * СоцПлощадь / СтрокаНачисленийАбонента.ЗначениеПлощади, ТочностьОбъемаНачислений);
	Иначе
		ОбъемСоцНорма 							= Объем;
	КонецЕсли;
	СтрокаНабора  								= яНабор.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,НеЗаполняем);
	СтрокаНабора.Распределение 					= Истина;
	СтрокаНабора.СпособНачисления				= СпособНачисленияОДН;
	СтрокаНабора.Период 						= ГраницыПериода.ЗавершениеОП-1;
	Если ЗначениеЗаполнено(ЗаполнитьКонецПериода) Тогда
		СтрокаНабора.КонецПериода 						= ГраницыПериода.ЗавершениеОП; 
	КонецЕсли;
	
	Если СпособНачисленияОДН = Перечисления.энргСпособНачислений.ПоПриборам Тогда
		СтрокаНабора.СниматьНачисленныйСредний = Ложь;		
	КонецЕсли;
	
	Если Объем > ОбъемСоцНорма Тогда
		СтрокаНабора.СверхНорматива				= Ложь;
		СтрокаНабора[Заполняем] 				= ОбъемСоцНорма;
		Если ЕстьСуммаНачислений Тогда
			СтрокаНабора.Сумма 					= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,НеЗаполняем);

		СтрокаСверхНорматива 					= яНабор.Добавить();
		Если ЗначениеЗаполнено(ЗаполнитьКонецПериода) Тогда
			СтрокаСверхНорматива.КонецПериода 						= ГраницыПериода.ЗавершениеОП; 
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаСверхНорматива,СтрокаНабора);
		СтрокаСверхНорматива.СверхНорматива 	= Истина;
		СтрокаСверхНорматива[Заполняем] 		= Объем - ОбъемСоцНорма;
		СтрокаСверхНорматива.ЗначениеТарифа 	= СтрокаНачисленийАбонента.ЗначениеТарифаСверхНорматива;
		Если ЕстьСуммаНачислений Тогда
			СтрокаНабора.Сумма 					= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаСверхНорматива,,НеЗаполняем);
	Иначе
		СтрокаНабора.СверхНорматива				= Ложь;
		СтрокаНабора[Заполняем] 				= Объем;
		Если ЕстьСуммаНачислений Тогда
			СтрокаНабора.Сумма 					= СтрокаНабора.ОбъемУслуги * СтрокаНабора.ЗначениеТарифа;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(яНаборОбщий.Добавить(),СтрокаНабора,,НеЗаполняем);
	КонецЕсли; 		
		
	РазделенныеЛицевыеСчета 					= ДанныеПоУслуге.РазделенныеЛицевыеСчета;
	
	Если НЕ РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение] = Неопределено Тогда
		ОсталосьВнутриПомещения 				= Объем;
		ПомещенияПотомки						= РазделенныеЛицевыеСчета[СтрокаНачисленийАбонента.Помещение];
		
		Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
			ДанныеПомещения  					= ПомещениеПотомок.Значение[Услуга];
			СуммаПлощадейПомещения 				= СуммаПлощадейПомещения + ДанныеПомещения.Значениеплощади; 
		КонецЦикла;		
		
		ПереасчитатьСтроки 						= Новый Массив;
		
		ВсегоРаспределилиНаПотомков = 0;
		СчПотомков					= 0;
			
		Для Каждого ПомещениеПотомок Из ПомещенияПотомки Цикл
			СчПотомков							= СчПотомков + 1;
			
			ДанныеПомещения  					= ПомещениеПотомок.Значение[Услуга];				                 		
			
			ХэшСтрокиТарифа 					= ХэшСтрокиТарифа(ДанныеПомещения.ТарифнаяГруппа,Услуга,ДанныеПомещения.Поставщик,Справочники.энргТарифныеЗоны.БезРазбивки); 
			ЗначениеТарифа 						= ?(ЗначенияТарифов[ХэшСтрокиТарифа] = Неопределено, Новый Структура("Значение", 0), ЗначенияТарифов[ХэшСтрокиТарифа]);
			СтрокаНабора  						= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНачисленийАбонента,,НеЗаполняем); 
			СтрокаНабора.СверхНорматива			= Ложь;
			СтрокаНабора.Распределение 			= Истина;
			СтрокаНабора.СпособНачисления		= СпособНачисленияОДН;
			СтрокаНабора.Период 				= ГраницыПериода.ЗавершениеОП-1;
			СтрокаНабора.Помещение				= ПомещениеПотомок.Ключ;
			СтрокаНабора.ТарифнаяГруппа			= ДанныеПомещения.ТарифнаяГруппа;
			СтрокаНабора.ЗначениеТарифа			= ЗначениеТарифа.Значение;
			СтрокаНабора.Абонент				= ДанныеПомещения.Абонент;						
			ОбъемПотомка 						= 0;
			Если СчПотомков = ПомещенияПотомки.количество() Тогда
				ОбъемПотомка = Объем - ВсегоРаспределилиНаПотомков;
			ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ФиксированныйОбъем Тогда
				ОбъемПотомка 					= ДанныеПомещения.ФиксированныйОбъемПотребления;;
			ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.ДолевоеРаспределение Тогда
				ОбъемПотомка 					= Окр(Объем * ДанныеПомещения.ДоляПотребленияЧислитель / ДанныеПомещения.ДоляПотребленияЗнаменатель, ТочностьОбъемаНачислений); 
			ИначеЕсли ДанныеПомещения.СпособРаспределенияОбъемаПомещения = Перечисления.энргСпособыРаспределенияОбъема.Остаток Тогда	
				ПереасчитатьСтроки.Добавить(НаборЗаписей.Индекс(СтрокаНабора));
			Иначе
				Если ЗначениеЗаполнено(ДанныеПоУслуге.ВидПлощади) Тогда
					ОбъемПотомка 				= ?(НЕ СуммаПлощадейПомещения = 0, Окр(Объем * ДанныеПомещения.ЗначениеПлощади / СуммаПлощадейПомещения, ТочностьОбъемаНачислений), 0);					 
				Иначе
					ОбъемПотомка 				= ?(НЕ СтрокаНачисленийАбонента.КоличествоЖильцов = 0, Окр(Объем * ДанныеПомещения.КоличествоПроживающих / СтрокаНачисленийАбонента.КоличествоЖильцов, ТочностьОбъемаНачислений), 0); 
				КонецЕсли;
			КонецЕсли;
			
			ОсталосьВнутриПомещения 			= ОсталосьВнутриПомещения - ОбъемПотомка;
			ВсегоРаспределилиНаПотомков			= ВсегоРаспределилиНаПотомков + ОбъемПотомка;
			
			ОбъемСоциальнойНормы 				= 0;
			Если (ДанныеПомещения.ЗначениеСоциальнойНормы * ДанныеПомещения.КоличествоЧеловек + ДанныеПомещения.ДопСоциальнаяНормаПотребления) < ДанныеПомещения.ЗначениеПлощади Тогда 
				ОбъемСоциальнойНормы 			= Окр(ОбъемПотомка * (ДанныеПомещения.ЗначениеСоциальнойНормы * ДанныеПомещения.КоличествоЧеловек + ДанныеПомещения.ДопСоциальнаяНормаПотребления) / ДанныеПомещения.ЗначениеПлощади, ТочностьОбъемаНачислений);
			Иначе
				ОбъемСоциальнойНормы 			= ОбъемПотомка;
			КонецЕсли;			
			
			Если ОбъемПотомка > ОбъемСоциальнойНормы Тогда
				СтрокаНабора[Заполняем] 		= ОбъемСоциальнойНормы;
				СтрокаНабора.Сумма				= СтрокаНабора[Заполняем] * ЗначениеТарифа.Значение;
				
				НоваяСтрока 					= НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНабора);
				НоваяСтрока[Заполняем] 			= ОбъемПотомка - СтрокаНабора[Заполняем];
				НоваяСтрока.СверхНорматива 		= Истина;
				НоваяСтрока.ЗначениеТарифа 		= ЗначениеТарифа.ЗначениеСверхНорматива;
			Иначе
				СтрокаНабора[Заполняем] 		= ОбъемПотомка;
				СтрокаНабора.Сумма				= СтрокаНабора[Заполняем] * ЗначениеТарифа.Значение;
			КонецЕсли;							
		КонецЦикла;
		
		Если ПереасчитатьСтроки.Количество() > 0 Тогда
			Для Сч = 0 По ПереасчитатьСтроки.ВГраница() Цикл
				СтрокаНабора 					= НаборЗаписей.Получить(ПереасчитатьСтроки[Сч]);
				СтрокаНабора[Заполняем] 		= ОсталосьВнутриПомещения;
				СтрокаНабора.Сумма				= СтрокаНабора[Заполняем] * ЗначениеТарифа.Значение;
			КонецЦикла;						
		КонецЕсли;					
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РаспределениеМКД_Перерасчет

Функция ТекстЗапросаНормативныеДанныеРаспределения_Перерасчет()
	
	Текст  = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	энргЗначенияНормативовПотребления.КлючНорматива КАК КлючНорматива,
	|	энргЗначенияНормативовПотребления.Услуга КАК Услуга,
	|	энргЗначенияНормативовПотребления.ЗначениеНорматива КАК ЗначениеНорматива
	|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргЗначенияНормативовПотребления.КлючНорматива КАК КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга КАК Услуга,
	|		МАКСИМУМ(энргЗначенияНормативовПотребления.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|			ПО ГраницыОтчетногоПериода.Организация = энргЗначенияНормативовПотребления.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначенияНормативовПотребления.Период
	|				И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|				И (энргЗначенияНормативовПотребления.Район = &Район)
	|				И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления))
	|				И (энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргЗначенияНормативовПотребления.КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|		ПО ВложенныйЗапрос.КлючНорматива = энргЗначенияНормативовПотребления.КлючНорматива
	|			И ВложенныйЗапрос.Услуга = энргЗначенияНормативовПотребления.Услуга
	|			И ВложенныйЗапрос.Период = энргЗначенияНормативовПотребления.Период
	|			И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|			И (энргЗначенияНормативовПотребления.Район = &Район)
	|			И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ОбщедомовыеНачисления))
	|			И (энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	&Район,
	|	энргЗначенияНормативовПотребления.КлючНорматива,
	|	энргЗначенияНормативовПотребления.Услуга,
	|	энргЗначенияНормативовПотребления.ЗначениеНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргЗначенияНормативовПотребления.КлючНорматива КАК КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга КАК Услуга,
	|		МАКСИМУМ(энргЗначенияНормативовПотребления.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|			ПО ГраницыОтчетногоПериода.Организация = энргЗначенияНормативовПотребления.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначенияНормативовПотребления.Период
	|				И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|				И (энргЗначенияНормативовПотребления.Район = &Район)
	|				И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|				И (энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО (энргЗначенияНормативовПотребления.Услуга = энргВидыУслуг.Ссылка)
	|				И (энргВидыУслуг.НормативДляИндивидуальных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргЗначенияНормативовПотребления.КлючНорматива,
	|		энргЗначенияНормативовПотребления.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления КАК энргЗначенияНормативовПотребления
	|		ПО ВложенныйЗапрос.КлючНорматива = энргЗначенияНормативовПотребления.КлючНорматива
	|			И ВложенныйЗапрос.Услуга = энргЗначенияНормативовПотребления.Услуга
	|			И ВложенныйЗапрос.Период = энргЗначенияНормативовПотребления.Период
	|			И (энргЗначенияНормативовПотребления.Организация = &Организация)
	|			И (энргЗначенияНормативовПотребления.Район = &Район)
	|			И (энргЗначенияНормативовПотребления.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|			И (энргЗначенияНормативовПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&РАйон КАК Район,
	|	энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифов.Услуга КАК Услуга,
	|	энргЗначенияТарифов.Поставщик КАК Поставщик,
	|	энргЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифов.Значение КАК Значение,
	|	энргЗначенияТарифов.ЗначениеСверхНорматива КАК ЗначениеСверхНорматива,
	|	энргЗначенияТарифов.ЗначениеРЭК КАК ЗначениеТарифаРЭК,
	|	энргЗначенияТарифов.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифов.НДСВнутри КАК НДСВнутри
	|ПОМЕСТИТЬ ЗначенияТекущихТарифов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|		энргЗначенияТарифов.Услуга КАК Услуга,
	|		энргЗначенияТарифов.Поставщик КАК Поставщик,
	|		энргЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МАКСИМУМ(энргЗначенияТарифов.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|			ПО ГраницыОтчетногоПериода.Организация = энргЗначенияТарифов.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргЗначенияТарифов.Период
	|				И (энргЗначенияТарифов.Организация = &Организация)
	|				И (энргЗначенияТарифов.Район = &Район)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргЗначенияТарифов.ГруппаПотребителей,
	|		энргЗначенияТарифов.Услуга,
	|		энргЗначенияТарифов.Поставщик,
	|		энргЗначенияТарифов.ТарифнаяЗона) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ПО ВложенныйЗапрос.ГруппаПотребителей = энргЗначенияТарифов.ГруппаПотребителей
	|			И ВложенныйЗапрос.Услуга = энргЗначенияТарифов.Услуга
	|			И ВложенныйЗапрос.Поставщик = энргЗначенияТарифов.Поставщик
	|			И ВложенныйЗапрос.ТарифнаяЗона = энргЗначенияТарифов.ТарифнаяЗона
	|			И ВложенныйЗапрос.Период = энргЗначенияТарифов.Период
	|			И (энргЗначенияТарифов.Организация = &Организация)
	|			И (энргЗначенияТарифов.Район = &Район)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&Строение КАК МКД,
	|	энргНастройкаНачисленияГВСМКД.Услуга КАК Услуга,
	|	энргНастройкаНачисленияГВСМКД.ТипСхемы КАК ТипСхемы,
	|	энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|	энргНастройкаНачисленияГВСМКД.НеНачислять КАК НеНачислять
	|ПОМЕСТИТЬ МКДНеНачислятьТЭ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргНастройкаНачисленияГВСМКД.Услуга КАК Услуга,
	|		энргНастройкаНачисленияГВСМКД.ТипСхемы КАК ТипСхемы,
	|		энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту КАК ПринадлежностьКТепловомуПункту,
	|		МАКСИМУМ(энргНастройкаНачисленияГВСМКД.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаНачисленияГВСМКД КАК энргНастройкаНачисленияГВСМКД
	|			ПО ГраницыОтчетногоПериода.Организация = энргНастройкаНачисленияГВСМКД.Организация
	|				И ГраницыОтчетногоПериода.ЗавершениеОП > энргНастройкаНачисленияГВСМКД.Период
	|				И (энргНастройкаНачисленияГВСМКД.Организация = &Организация)
	|				И (энргНастройкаНачисленияГВСМКД.Район = &Район)
	|				И (энргНастройкаНачисленияГВСМКД.МКД = &Строение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргНастройкаНачисленияГВСМКД.Услуга,
	|		энргНастройкаНачисленияГВСМКД.ТипСхемы,
	|		энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаНачисленияГВСМКД КАК энргНастройкаНачисленияГВСМКД
	|		ПО ВложенныйЗапрос.Услуга = энргНастройкаНачисленияГВСМКД.Услуга
	|			И ВложенныйЗапрос.ТипСхемы = энргНастройкаНачисленияГВСМКД.ТипСхемы
	|			И ВложенныйЗапрос.ПринадлежностьКТепловомуПункту = энргНастройкаНачисленияГВСМКД.ПринадлежностьКТепловомуПункту
	|			И ВложенныйЗапрос.Период = энргНастройкаНачисленияГВСМКД.Период
	|			И (энргНастройкаНачисленияГВСМКД.Организация = &Организация)
	|			И (энргНастройкаНачисленияГВСМКД.Район = &Район)
	|			И (энргНастройкаНачисленияГВСМКД.МКД = &Строение)";
	
	Возврат Текст;

КонецФункции

Функция ТекстЗапросаДокументыДляРаспределенияМКД_Перерасчет() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&Строение КАК Строение,
	|	ГраницыОтчетногоПериода.ЗавершениеОП
	|ПОМЕСТИТЬ ДокументыДляРаспределения
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода";
	
	Возврат Текст
	
КонецФункции

Функция ТекстЗапросаСозданныеДокументыРаспределения_Перерасчет()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления
	|ПОМЕСТИТЬ ДокументыНачислений
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляРаспределения КАК ДокументыДляРаспределения
	|		ПО энргДокументыНачислений.Организация = ДокументыДляРаспределения.Организация
	|			И энргДокументыНачислений.ПериодНачисления = ДокументыДляРаспределения.ПериодНачисления
	|			И энргДокументыНачислений.Район = ДокументыДляРаспределения.Район
	|			И (энргДокументыНачислений.ВидОперацийНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыОперацийНачисления.Индивидуальные))
	|			И энргДокументыНачислений.МКД = ДокументыДляРаспределения.Строение
	|			И (энргДокументыНачислений.Организация = &Организация)
	|			И (энргДокументыНачислений.МКД = &Строение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&Строение КАК МКД,
	|	ЗНАЧЕНИЕ(Документ.энргРаспределениеМКД.ПустаяСсылка) КАК ДокументНачисления
	|ПОМЕСТИТЬ ДокументыРаспределенияМКД
	|ИЗ
	|	ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&Строение КАК МКД,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Услуга КАК Услуга,
	|	энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.РаспределятьПолностью КАК РаспределятьПолностью
	|ПОМЕСТИТЬ ИсторияСоглашенийОРаспределенииСверхнормативногоОДН
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Услуга КАК Услуга,
	|		МАКСИМУМ(энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Период) КАК Период
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН КАК энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН
	|			ПО ГраницыОтчетногоПериода.Организация = энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Организация
	|				И ГраницыОтчетногоПериода.ЗАвершениеОП > энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Период
	|				И (энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Организация = &Организация)
	|				И (энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Район = &Район)
	|				И (энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.МКД = &Строение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН КАК энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН
	|		ПО ВложенныйЗапрос.Услуга = энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Услуга
	|			И ВложенныйЗапрос.Период = энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Период
	|			И (энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Организация = &Организация)
	|			И (энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.Район = &Район)
	|			И (энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН.МКД = &Строение)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъемыНачисленийМКДДляРаспределения_Перерасчет()
	Текст  = 
	"ВЫБРАТЬ
	|	энргОбъемНачисленийМКДОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачисленийМКДОбороты.Организация КАК Организация,
	|	энргОбъемНачисленийМКДОбороты.Район КАК Район,
	|	энргОбъемНачисленийМКДОбороты.МКД КАК МКД,
	|	энргОбъемНачисленийМКДОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийМКДОбороты.ОбъемУслугиНорматив КАК ОбъемУслугиНормативОборот,
	|	энргОбъемНачисленийМКДОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачисленийМКДОбороты.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачисленийМКДОбороты.ОбъемУслуги КАК ОбъемУслугиОборот,
	|	энргОбъемНачисленийМКДОбороты.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленныйОборот,
	|	энргОбъемНачисленийМКДОбороты.ПоказанияПредоставлены КАК ПоказанияПредоставленыОборот,
	|	ВЫБОР
	|		КОГДА энргОбъемНачисленийМКДОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|			ТОГДА 1
	|		КОГДА энргОбъемНачисленийМКДОбороты.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПоказанияПредоставленыПотребленныйОборот
	|ПОМЕСТИТЬ НачисленныйОбъемМКД
	|ИЗ
	|	&энргОбъемНачисленийМКД КАК энргОбъемНачисленийМКДОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргОбъемНачислений.Период, МЕСЯЦ) КАК ПериодНачисления,
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачислений.Активность КАК Активность,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Распределение КАК Распределение,
	|	энргОбъемНачислений.Строение КАК Строение,
	|	энргОбъемНачислений.Помещение КАК Помещение,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОбъемНачислений.Измеритель КАК Измеритель,
	|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачислений.Шкала КАК Шкала,
	|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.Поставщик КАК Поставщик,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	энргОбъемНачислений.Сумма КАК Сумма,
	|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	энргОбъемНачислений.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
	|	энргОбъемНачислений.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления
	|ПОМЕСТИТЬ ОбъемНачисленийПоПриборуУчетаКорректироватьИндивидуальныйОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериодаПерерасчета,
	|			&КонецПериодаПерерасчета,
	|			Запись,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ Распределение
	|				И НЕ ЧастныйСектор
	|				И Строение = &Строение
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	|				И СпособНачисления В (ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам), ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему))
	|				И Услуга В
	|					(ВЫБРАТЬ
	|						энргВидыУслуг.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.энргВидыУслуг КАК энргВидыУслуг
	|					ГДЕ
	|						энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ)) КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		ПО энргОбъемНачисленийОбороты.Период = энргОбъемНачислений.Период
	|			И энргОбъемНачисленийОбороты.Регистратор = энргОбъемНачислений.Регистратор
	|			И энргОбъемНачисленийОбороты.НомерСтроки = энргОбъемНачислений.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бестОбъемНачисленийНП.Период, МЕСЯЦ) КАК ПериодНачисления,
	|	бестОбъемНачисленийНП.Период КАК Период,
	|	бестОбъемНачисленийНП.Регистратор КАК Регистратор,
	|	бестОбъемНачисленийНП.НомерСтроки КАК НомерСтроки,
	|	бестОбъемНачисленийНП.Активность КАК Активность,
	|	бестОбъемНачисленийНП.Организация КАК Организация,
	|	бестОбъемНачисленийНП.Район КАК Район,
	|	бестОбъемНачисленийНП.Распределение КАК Распределение,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	бестОбъемНачисленийНП.МКД КАК МКД,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.ВидНачисления КАК ВидНачисления,
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.ПериодРасчета КАК ПериодРасчета,
	|	бестОбъемНачисленийНП.ДолевоеРаспределение КАК ДолевоеРаспределение,
	|	бестОбъемНачисленийНП.ОбъемПоПрибору КАК ОбъемПоПрибору,
	|	бестОбъемНачисленийНП.ОбъемУслуги КАК ОбъемУслуги,
	|	бестОбъемНачисленийНП.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестОбъемНачисленийНП.ОбъемДосчитанный КАК ОбъемДосчитанный,
	|	бестОбъемНачисленийНП.НачалоПериода КАК НачалоПериода,
	|	бестОбъемНачисленийНП.КонецПериода КАК КонецПериода,
	|	бестОбъемНачисленийНП.НачальныеПоказания КАК НачальныеПоказания,
	|	бестОбъемНачисленийНП.КонечныеПоказания КАК КонечныеПоказания,
	|	бестОбъемНачисленийНП.ЗначениеПлощади КАК ЗначениеПлощади,
	|	бестОбъемНачисленийНП.НормаПотребления КАК НормаПотребления,
	|	бестОбъемНачисленийНП.РасчетПоФормуле КАК РасчетПоФормуле,
	|	бестОбъемНачисленийНП.ДатаПоверки КАК ДатаПоверки,
	|	бестОбъемНачисленийНП.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	бестОбъемНачисленийНП.КоэффициентРасчета КАК КоэффициентФормула,
	|	бестОбъемНачисленийНП.ВидДифференцированности КАК ВидДифференцированности,
	|	бестОбъемНачисленийНП.СписатьИзНормы КАК СписатьИзНормы,
	|	бестОбъемНачисленийНП.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	бестОбъемНачисленийНП.СоставнаяУслуга КАК СоставнаяУслуга,
	|	бестОбъемНачисленийНП.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	бестОбъемНачисленийНП.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	бестОбъемНачисленийНП.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	бестОбъемНачисленийНП.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	бестОбъемНачисленийНП.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	бестОбъемНачисленийНП.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	бестОбъемНачисленийНП.ПлощадьМОП КАК ПлощадьМОП,
	|	бестОбъемНачисленийНП.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	бестОбъемНачисленийНП.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка
	|ПОМЕСТИТЬ ОбъемНачисленийНППоПриборуУчетаКорректироватьИндивидуальныйОбъем
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	|			&НачалоПериодаПерерасчета,
	|			&КонецПериодаПерерасчета,
	|			Запись,
	|			Организация = &Организация
	|				И Район = &Район
	|				И НЕ Распределение
	|				И МКД = &Строение
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	|				И СпособНачисления В (ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам), ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.НачислениеПоСреднему))
	|				И Услуга В
	|					(ВЫБРАТЬ
	|						энргВидыУслуг.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.энргВидыУслуг КАК энргВидыУслуг
	|					ГДЕ
	|						энргВидыУслуг.КорректироватьИндивидуальныйОбъемСУчетомОДПУ)) КАК бестОбъемНачисленийНПОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ПО бестОбъемНачисленийНПОбороты.Период = бестОбъемНачисленийНП.Период
	|			И бестОбъемНачисленийНПОбороты.Регистратор = бестОбъемНачисленийНП.Регистратор
	|			И бестОбъемНачисленийНПОбороты.НомерСтроки = бестОбъемНачисленийНП.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Район КАК Район,
	|	энргОбъемНачисленийОбороты.Организация КАК Организация,
	|	энргОбъемНачисленийОбороты.Распределение КАК Распределение,
	|	бестОбъектыРасчета.МКД КАК Строение,
	|	энргОбъемНачисленийОбороты.ОбъектРасчета КАК Абонент,
	|	энргОбъемНачисленийОбороты.ОбъектРасчета КАК Помещение,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийОбороты.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийОбороты.СпособНачисления КАК СпособНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользованияТУ,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.Пустаяссылка) КАК Измеритель,
	|	энргОбъемНачисленийОбороты.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийОбороты.Шкала КАК Шкала,
	|	энргОбъемНачисленийОбороты.ТарифнаяЗона КАК ТарифнаяЗона,
	|	1 КАК ЗначениеТарифа,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ЛОЖЬ КАК ЧастныйСектор,
	|	ЛОЖЬ КАК СверхНорматива,
	|	0 КАК Сумма,
	|	энргОбъемНачисленийОбороты.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	0 КАК СуммаПоПовышенномуКоэффициенту,
	|	энргОбъемНачисленийОбороты.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачисленийОбороты.КонецПериода КАК КонецПериода,
	|	энргОбъемНачисленийОбороты.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачисленийОбороты.КонечныеПоказания КАК КонечныеПоказания,
	|	0 КАК КоличествоКомнат,
	|	0 КАК КоличествоПрописанных,
	|	0 КАК КоличествоЖильцов,
	|	энргОбъемНачисленийОбороты.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачисленийОбороты.НормаПотребления КАК НормаПотребления,
	|	0 КАК КоэффициентПУ,
	|	энргОбъемНачисленийОбороты.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка) КАК ВидБлагоустройства,
	|	ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка) КАК ТарифнаяГруппа,
	|	энргОбъемНачисленийОбороты.ДатаПоверки КАК ДатаПоверки,
	|	ЛОЖЬ КАК ОтключатьВНеполивнойСезон,
	|	энргОбъемНачисленийОбороты.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргОбъемНачисленийОбороты.КоэффициентРасчета КАК КоэффициентФормула,
	|	энргОбъемНачисленийОбороты.ВидДифференцированности КАК ВидДифференцированности,
	|	"""" КАК ОснованиеПерерасчета,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ОснованиеПерерасчетаДата,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка) КАК ПриборЗависимой,
	|	ЛОЖЬ КАК СписатьИзНормы,
	|	энргОбъемНачисленийОбороты.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	0 КАК КоличествоСобственников,
	|	0 КАК КоличествоПроживающих,
	|	ЛОЖЬ КАК СниматьНачисленныйСредний,
	|	энргОбъемНачисленийОбороты.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачисленийОбороты.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачисленийОбороты.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	0 КАК КоэффициентРаспределенияОстатка,
	|	0 КАК ОбъемУслугиСоцНорма,
	|	энргОбъемНачисленийОбороты.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачисленийОбороты.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка) КАК ПомещениеРодитель,
	|	энргОбъемНачисленийОбороты.Договор КАК Договор,
	|	энргОбъемНачисленийОбороты.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуОбъему
	|ПОМЕСТИТЬ ОбъемНачисленийНП
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК энргОбъемНачисленийОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО энргОбъемНачисленийОбороты.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|			И (бестОбъектыРасчета.МКД = &Строение)
	|			И (энргОбъемНачисленийОбороты.Период МЕЖДУ &НачалоПериодаПерерасчета И &КонецПериодаПерерасчета)
	|			И (энргОбъемНачисленийОбороты.Организация = &Организация)
	|			И (энргОбъемНачисленийОбороты.Район = &Район)
	|			И (НЕ энргОбъемНачисленийОбороты.Распределение)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ПересчитатьРаспредениеОбъемаПотребленногоМКД
	
Процедура ПрочитатьНормативныеДанныеРаспределения_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение)
	
	Запрос  						= Новый Запрос(ТекстЗапросаНормативныеДанныеРаспределения_Перерасчет());
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			Строение);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПрочитатьДокументыДляРаспределения_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение)
	
	Запрос  						= Новый Запрос(ТекстЗапросаДокументыДляРаспределенияМКД_Перерасчет());
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			Строение); 	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПрочитатьСозданныеДокументыИндивидуальныхНачислений_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение)
	
	Запрос  						= Новый Запрос(ТекстЗапросаСозданныеДокументыРаспределения_Перерасчет());
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			Строение);	
	Запрос.МенеджерВременныхТаблиц 	= МВТ;		
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПрочитатьОбъемыНачисленийМКДДляРаспределения_Перерасчет(МВТ,Организация,ПериодНачисления,Район,Строение,ПараметрыПерерасчета)
	
	Запрос  						= Новый Запрос(ТекстЗапросаОбъемыНачисленийМКДДляРаспределения_Перерасчет());
	Запрос.УстановитьПараметр("ПериодНачисления", 				ПериодНачисления);
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("Район", 							Район);
	Запрос.УстановитьПараметр("Строение", 						Строение);
	Запрос.УстановитьПараметр("энргОбъемНачисленийМКД", 		ПараметрыПерерасчета.ОбъемНачисленийМКД);
	Запрос.УстановитьПараметр("НачалоПериодаПерерасчета",		ПараметрыПерерасчета.НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериодаПерерасчета",		ПараметрыПерерасчета.КонецПериодаРасчета);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Выполнить();

КонецПроцедуры

#КонецОбласти

Функция ПроверитьДатуЗапретаИзменения(Организация, Район, ПериодНачисления)
	Отказ = Ложь;
	
	ДокДляПроверки = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ДокДляПроверки.Организация	= Организация;
	ДокДляПроверки.Дата			= ПериодНачисления;
	ДокДляПроверки.Район		= Район;	
	Попытка
		ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ДокДляПроверки, Отказ, Истина, Истина);
	Исключение
		Отказ	= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для пользователя " + Пользователи.ТекущийПользователь() + " район " + Район + " период " + ПериодНачисления + " закрыт для редактирования");
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти