#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
		
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("ОбъектРасчета"), Метаданные.Документы.бестИзменениеСобственникаОбъектаРасчета);
		
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаСервере
Процедура ОбъектРасчетаПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 			Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("ОбъектРасчета", 	Объект.ОбъектРасчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Период КАК Период,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Организация КАК Организация,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Район КАК Район,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Собственник КАК Собственник
	               |ИЗ
	               |	РегистрСведений.бестСобственникиОбъектовРасчета.СрезПоследних(
	               |			&Дата,
	               |			ОбъектРасчета = &ОбъектРасчета
	               |				И Организация = &Организация
	               |				И Район = &Район) КАК бестСобственникиОбъектовРасчетаСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Период,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Район,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Организация,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.ОбъектРасчета,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Собственник";
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекСобственник	= Выборка.Собственник;
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ОбъектРасчетаПриИзмененииНаСервере();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Район)Тогда
		 РайонПриИзмененииНаСервере();
	 КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;	
КонецПроцедуры


&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Договор) Тогда
		ДоговорПриИзмененииНаСервере();
	Иначе 	
		Объект.ОбъектРасчета = Неопределено;
	КонецЕсли;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Объект.Организация 		= Договор.Организация;
	Объект.Район 			= Договор.Район;
КонецПроцедуры


&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация,Неопределено,СтандартнаяОбработка);
КонецПроцедуры


&НаКлиенте
Процедура ОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Объект.Организация) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Организация не выбрана");
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Район) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Район не выбран");
	Иначе 	
		бестПользовательскийВводКлиент.НачалоВыбораОбъекта(Элемент,Объект.Дата, Объект.Организация, Объект.Район, Договор,СтандартнаяОбработка, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти