#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойства массив помещений.
// 
Функция МассивПриборов() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	ТаблицаТочекУчета.Ссылка КАК Регистратор,
	|	ТаблицаТочекУчета.Ссылка.ПериодНачисления КАК ПериодНачисления
	//|ПОМЕСТИТЬ ПриборыУчета
	|ИЗ
	|	Документ.энргРегистрацияПоказанийАбонента.ТочкиУчета КАК ТаблицаТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ШкалыПриборовУчета КАК энргРегистрацияПоказанийАбонентаШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ПоказанияПриборовУчета КАК энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета
	|			ПО энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтроки = энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.IDСтроки
	|				И (НЕ энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.ПоказанияПредоставлены)
	|				И (энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.Ссылка = &ссылка)
	|				И (энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка = &ссылка)
	|		ПО (ТаблицаТочекУчета.Ссылка = &ссылка)
	|			И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И ТаблицаТочекУчета.IDСтроки = энргРегистрацияПоказанийАбонентаШкалыПриборовУчета.IDСтрокиТочкиУчета
	|ГДЕ
	|	энргРегистрацияПоказанийАбонентаПоказанияПриборовУчета.Ссылка ЕСТЬ NULL
	|	И ТаблицаТочекУчета.Ссылка = &Ссылка
	|";
	
	ДополнительныеСвойства.Вставить("МассивПриборов", Запрос.Выполнить());

	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
		
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОтветПроверки = энргРаботаСПоказаниямиПриборовУчетаСервер.ПроверитьПоказанияПоВсемЗонамСуток(ЭтотОбъект);
	Если НЕ ОтветПроверки.Успешно Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОтветПроверки.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Документы.энргРегистрацияПоказанийАбонента.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
				
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргПриходныйКассовыйОрдер") Тогда
		КлючПомещения 		= ДанныеЗаполнения.КлючПомещения;
		Абонент 			= ДанныеЗаполнения.Абонент;
		Организация 		= ДанныеЗаполнения.Организация;
		Район		 		= ДанныеЗаполнения.Район;
		ДокументОснование 	= ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Абонент", 		ЭтотОбъект.Абонент);
		ДанныеЗаполнения.Свойство("КлючПомещения", 	ЭтотОбъект.КлючПомещения);
		ДанныеЗаполнения.Свойство("Организация", 	ЭтотОбъект.Организация);
		ДанныеЗаполнения.Свойство("Район", 			ЭтотОбъект.Район);
	Иначе	
		энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
	ДокументОснование = Документы.энргЗагрузкаДанныхИзВнешнихИсточников.ПустаяСсылка();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли