#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"ДокументОснование",
		Параметры.ДокументОснование);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДокументСсылка = Элемент.ТекущиеДанные.Ссылка; 	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ДокументСсылка);
	
	ИмяФормыОткрытия = "Документ.энргРегистрацияПоказанийАбонента.Форма.ФормаДокумента";
	Если Тип("ДокументСсылка.энргОбходнойЛист") = ТипЗнч(ДокументСсылка) Тогда
		ИмяФормыОткрытия = "Документ.энргОбходнойЛист.Форма.ФормаДокументаЗагрузкаПоказанийИзВнешнихИсточников";
	ИначеЕсли Тип("ДокументСсылка.энргРегистрацияПоказанийМКД") = ТипЗнч(ДокументСсылка) Тогда
		ИмяФормыОткрытия = "Документ.энргРегистрацияПоказанийМКД.Форма.ФормаДокумента";	
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыОткрытия, ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти