#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерфейса_ПолучениеДанных

// Заполняет просуженную пени за период.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПросуженнаяПениЗаПериод(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПросуженнаяЗадолженностьЗаПериод());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("Период") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["Период"].ИмяПараметра));
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,Услуга,ПериодНачисления,ПериодРасчета";
		ПараметрИсточника 	= ПараметрыИсточника[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Операторы[0].Отбор, "энргПросуженнаяПениСрезПоследних", ПараметрыСхемы.ПараметрыВТ, "Просуженная");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросовПолученияДанных

Функция ТекстЗапросаПросуженнаяЗадолженностьЗаПериод()
	Текст  = 
	"ВЫБРАТЬ
	|	энргПросуженнаяПениСрезПоследних.Организация КАК Организация,
	|	энргПросуженнаяПениСрезПоследних.Район КАК Район,
	|	энргПросуженнаяПениСрезПоследних.МКД КАК МКД,
	|	энргПросуженнаяПениСрезПоследних.Абонент КАК Абонент,
	|	энргПросуженнаяПениСрезПоследних.Услуга КАК Услуга,
	|	энргПросуженнаяПениСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|	энргПросуженнаяПениСрезПоследних.ПериодРасчета КАК ПериодРасчета,
	|	энргПросуженнаяПениСрезПоследних.Просуженная КАК Просуженная,
	|	энргПросуженнаяПениСрезПоследних.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.энргПросуженнаяПени.СрезПоследних(, ) КАК энргПросуженнаяПениСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти
	
#КонецОбласти

#КонецЕсли