
#Область КомандыФормы

&НаКлиенте
Процедура Записать(Команда)  	
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ДлительностиПериодов.Очистить();
	ЗаполнитьНаСервере();
	ДлительностиПериодов.Сортировать("Район,Сезонность");
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	СтрокиДляУдаления 				= Новый Массив;
	Набор  							= РегистрыСведений.энргДлительностиПериодов.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Прочитать();
	Для Каждого СтрокаНабора Из Набор Цикл
		Если СтрокаНабора.Период 	= Дата(Год,1,1) Тогда
			СтрокиДляУдаления.Добавить(СтрокаНабора);
		КонецЕсли;		
	КонецЦикла;
	
	Для Сч = 0 По СтрокиДляУдаления.ВГраница() Цикл
		Набор.Удалить(СтрокаНабора);
	КонецЦикла;
	Набор.Записать();
		
	Набор  							= РегистрыСведений.энргДлительностиПериодов.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТЧ Из ДлительностиПериодов Цикл
		СтрокаНабора 				= Набор.Добавить();
		СтрокаНабора.Период 		= Дата(Год,1,1);
		СтрокаНабора.Организация 	= Организация;
		СтрокаНабора.Район 			= СтрокаТЧ.Район;
		СтрокаНабора.Сезонность 	= СтрокаТЧ.Сезонность;
		СтрокаНабора.НачалоПериода 	= СтрокаТЧ.НачалоПериода;
		СтрокаНабора.КонецПериода 	= СтрокаТЧ.КонецПериода;
	КонецЦикла;
	
	Попытка
		Набор.Записать(Ложь);
	Исключение
		ИнформацияОбОшибке 			= ИнформацияОбОшибке();
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке); 
	КонецПопытки;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Набор  							= РегистрыСведений.энргДлительностиПериодов.СрезПоследних(Дата(Макс(Год,1),1,1),Новый Структура("Организация",Организация));
	Для Каждого СтрокаНабора Из Набор Цикл
		СтрокаТаблицы 				= ДлительностиПериодов.Добавить();
		СтрокаТаблицы.Район		 	= СтрокаНабора.Район;
		СтрокаТаблицы.Сезонность 	= СтрокаНабора.Сезонность;
		СтрокаТаблицы.НачалоПериода = СтрокаНабора.НачалоПериода;
		СтрокаТаблицы.КонецПериода 	= СтрокаНабора.КонецПериода;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти