#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	РезультатЗапроса = ПолучитьДанныеДляПроведения();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса,				Движения.бестПлановыеЧасыПиковойНагрузки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьПлановыеЧасыПиковойНагрузки.Организация КАК Организация,
	      		  |	бестИзменитьПлановыеЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Поставщик КАК Поставщик,
	      		  |	бестИзменитьПлановыеЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Услуга КАК Услуга,
	      		  |	бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы.ЧасОт КАК ЧасОт,
	      		  |	бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы.ЧасДо КАК ЧасДо
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПлановыеЧасыПиковойНагрузки КАК бестИзменитьПлановыеЧасыПиковойНагрузки
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьПлановыеЧасыПиковойНагрузки.РазрезыПиковыхЧасов КАК бестИзменитьПлановыеЧасыПиковойНагрузкиРазрезыПиковыхЧасов
	      		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьПлановыеЧасыПиковойНагрузки.ПиковыеЧасы КАК бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы
	      		  |			ПО бестИзменитьПлановыеЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Ссылка = бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы.Ссылка
	      		  |				И бестИзменитьПлановыеЧасыПиковойНагрузкиРазрезыПиковыхЧасов.IDСтроки = бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы.IDСтроки
	      		  |		ПО бестИзменитьПлановыеЧасыПиковойНагрузки.Ссылка = бестИзменитьПлановыеЧасыПиковойНагрузкиРазрезыПиковыхЧасов.Ссылка
	      		  |ГДЕ
	      		  |	(бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы.ЧасОт <> 0
	      		  |			ИЛИ бестИзменитьПлановыеЧасыПиковойНагрузкиПиковыеЧасы.ЧасДо <> 0)
	      		  |	И бестИзменитьПлановыеЧасыПиковойНагрузки.Ссылка = &Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли