#Область ОсновныеПроцедуры

Процедура ПриЧтенииНаСервере(Форма, ИмяКоллекции) Экспорт 
		
	Коллекция 				= Форма.Объект[ИмяКоллекции];
	Запрос 					= Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеТабЧасти",Коллекция.Выгрузить()); 
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|	ДанныеТабЧасти.Абонент КАК Абонент
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|ГДЕ
	|	НЕ ДанныеТабЧасти.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.ФизЛицо КАК ФизическоеЛицо,
	|	ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет,
	|	энргАбонентыКонтактнаяИнформация.Представление КАК АдресОбъекта,
	|	энргАбонентыКонтактнаяИнформация.ЗначенияПолей КАК АдресОбъектаПредставлениеПолей,
	|	ВложенныйЗапрос.ВидОбъекта КАК ВидОбъекта,
	|	энргАбонентыКонтактнаяИнформация.Значение КАК АдресОбъектаЗначение,
	|	ЕСТЬNULL(энргФилиалыАбонентов.Филиал, ЗНАЧЕНИЕ(Справочник.энргФилиалы.ПустаяСсылка)) КАК Филиал,
	|	ВложенныйЗапрос.СлужебныеОтметки КАК СлужебныеОтметки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|		ДанныеТабЧасти.Абонент КАК Абонент,
	|		энргАбоненты.ФизЛицо КАК ФизЛицо,
	|		энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|		энргАбоненты.ВидОбъекта КАК ВидОбъекта,
	|		энргАбоненты.СлужебныеОтметки КАК СлужебныеОтметки
	|	ИЗ
	|		ДанныеТабЧасти КАК ДанныеТабЧасти
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО ДанныеТабЧасти.Абонент = энргАбоненты.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|		ПО ВложенныйЗапрос.Абонент = энргАбонентыКонтактнаяИнформация.Ссылка
	|			И (энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних(
	|				,
	|				Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент
	|					ИЗ
	|						ДанныеТабЧасти КАК ВТ)) КАК энргФилиалыАбонентов
	|		ПО ВложенныйЗапрос.Абонент = энргФилиалыАбонентов.Абонент";
	
	Результат  									= Запрос.Выполнить();
	Выборка 									= Результат.Выбрать();
	                       	
	Пока Выборка.Следующий() Цикл
		СтрокаДляЗаполнения 					= Коллекция[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка,,"НомерСтроки");
	КонецЦикла;
	
	Для Каждого СтрокаТочки Из Коллекция Цикл
		Если ЗначениеЗаполнено(СтрокаТочки.Абонент) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТочки.ОписаниеАбонента) Тогда
			Продолжить;
		КонецЕсли;
		
		Чтение 									= Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(СтрокаТочки.ОписаниеАбонента);
		ОписаниеАбонента						= ПрочитатьJSON(Чтение);
		Для Каждого КлючЗначение Из ОписаниеАбонента Цикл
			Если КлючЗначение.Ключ = "ФизическоеЛицо" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "ВидОбъекта" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "Филиал" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргФилиалы.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "КлючПомещения" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			Иначе
				СтрокаТочки[КлючЗначение.Ключ] 	= КлючЗначение.Значение;
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриЧтенииНаСервереМКД(Форма, ИмяКоллекции) Экспорт 
		
	Коллекция 				= Форма.Объект[ИмяКоллекции];
	Запрос 					= Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеТабЧасти",Коллекция.Выгрузить()); 
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|	ДанныеТабЧасти.МКД КАК МКД
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|ГДЕ
	|	НЕ ДанныеТабЧасти.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.ГодПостройки КАК ГодПостройки,
	|	ВложенныйЗапрос.Бойлер КАК Бойлер,
	|	энргСтроенияКонтактнаяИнформация.Представление КАК АдресОбъекта,
	|	энргСтроенияКонтактнаяИнформация.ЗначенияПолей КАК АдресОбъектаПредставлениеПолей,
	|	ВложенныйЗапрос.ВидОбъектаАбонентов КАК ВидОбъектаАбонентов,
	|	ВложенныйЗапрос.ГруппаПотребителейПоУмолчанию КАК ГруппаПотребителейПоУмолчанию
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|		ДанныеТабЧасти.МКД КАК МКД,
	|		энргСтроения.ГодПостройки КАК ГодПостройки,
	|		энргСтроения.Бойлер КАК Бойлер,
	|		энргСтроения.ВидОбъектаАбонентов КАК ВидОбъектаАбонентов,
	|		энргСтроения.ГруппаПотребителейПоУмолчанию КАК ГруппаПотребителейПоУмолчанию
	|	ИЗ
	|		ДанныеТабЧасти КАК ДанныеТабЧасти
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|			ПО ДанныеТабЧасти.МКД = энргСтроения.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|		ПО ВложенныйЗапрос.МКД = энргСтроенияКонтактнаяИнформация.Ссылка
	|			И (энргСтроенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (энргСтроенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))";
	
	Результат  									= Запрос.Выполнить();
	Выборка 									= Результат.Выбрать();
	                       	
	Пока Выборка.Следующий() Цикл
		СтрокаДляЗаполнения 					= Коллекция[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка,,"НомерСтроки");
	КонецЦикла;
	
	Для Каждого СтрокаТочки Из Коллекция Цикл
		Если ЗначениеЗаполнено(СтрокаТочки.МКД) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТочки.ОписаниеМКД) Тогда
			Продолжить;
		КонецЕсли;
		
		Чтение 									= Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(СтрокаТочки.ОписаниеМКД);
		ОписаниеМКД						= ПрочитатьJSON(Чтение);
		Для Каждого КлючЗначение Из ОписаниеМКД Цикл
			Если КлючЗначение.Ключ = "ВидОбъектаАбонентов" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "ГруппаПотребителейПоУмолчанию" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			Иначе
				СтрокаТочки[КлючЗначение.Ключ] 	= КлючЗначение.Значение;        
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриЧтенииНаСервереДанныеПомещенияКоллекция(ОбъектыФормы, ИмяКоллекции) Экспорт 
	
	ДанныеТабЧасти 					= Новый ТаблицаЗначений;
	ДанныеТабЧасти.Колонки.Добавить("ИдентификаторСтроки",Новый ОписаниеТипов("Число"));
	ДанныеТабЧасти.Колонки.Добавить("КлючПомещения",Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	
	Для Каждого СтрокаТабЧасти Из ОбъектыФормы[ИмяКоллекции] Цикл
		Строка 						= ДанныеТабЧасти.Добавить();
		Строка.КлючПомещения 		= СтрокаТабЧасти.КлючПомещения;
		Строка.ИдентификаторСтроки  = СтрокаТабЧасти.ПолучитьИдентификатор();		
	КонецЦикла;
	
	Текст 							=
	"ВЫБРАТЬ
	|	ДанныеТабЧасти.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДанныеТабЧасти.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТабЧасти.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение
	|ИЗ
	|	ДанныеТабЧасти КАК ДанныеТабЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ДанныеТабЧасти.КлючПомещения = энргКлючиПомещений.КлючПомещения";
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДанныеТабЧасти",ДанныеТабЧасти);
	Результат 						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		 Строка  					= ОбъектыФормы[ИмяКоллекции].НайтиПоИдентификатору(Выборка.ИдентификаторСтроки);
		 Строка.Строение 			= Выборка.Строение;
		 Строка.Помещение 			= Выборка.Помещение;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьДанныеАбонента(ОбъектыФормы, ТекущийОбъект) Экспорт 
	
	Абонент = ?(ТекущийОбъект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника, ТекущийОбъект.АбонентСмена, ТекущийОбъект.Абонент);
	
	//Если ЗначениеЗаполнено(ТекущийОбъект.Абонент) Тогда
	Если ЗначениеЗаполнено(Абонент) Тогда
		
		Запрос  									= Новый Запрос;
		//Запрос.УстановитьПараметр("Абонент",ТекущийОбъект.Абонент); 
		Запрос.УстановитьПараметр("Абонент",Абонент); 
		Запрос.Текст 								=
		"ВЫБРАТЬ
		|	энргАбоненты.ВидОбъекта КАК ВидОбъекта,
		|	энргАбоненты.МуниципальноеОбразование КАК МуниципальноеОбразование,
		|	энргАбоненты.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	энргАбоненты.Ссылка = &Абонент";
		Результат 									= Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка  									= Результат.Выбрать();
		Выборка.Следующий();
		
		ОбъектыФормы.ФизЛицо 						= Выборка.ФизЛицо;
		ОбъектыФормы.ВидОбъекта 					= Выборка.ВидОбъекта;
		ОбъектыФормы.МуниципальноеОбразование 		= Выборка.МуниципальноеОбразование;
		
		Запрос.Текст 								=
		"ВЫБРАТЬ
		|	энргАбонентыКонтактнаяИнформация.Представление КАК Представление,
		|	энргАбонентыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	энргАбонентыКонтактнаяИнформация.Значение КАК Значение
		|ИЗ
		|	Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|ГДЕ
		|	энргАбонентыКонтактнаяИнформация.Ссылка = &Абонент";
		Результат 									= Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка  								= Результат.Выбрать();
			Выборка.Следующий();
			ОбъектыФормы.АдресОбъекта 				= Выборка.Представление;
			ОбъектыФормы.АдресОбъектаЗначение 		= ?(НЕ ПустаяСтрока(Выборка.Значение),Выборка.Значение,Выборка.ЗначенияПолей);
		КонецЕсли; 	
		
		
		Запрос.Текст 							=
		"ВЫБРАТЬ
		|	энргИдентификаторыАбонентаГИСЖКХ.ОКТМО КАК ОКТМО
		|ИЗ
		|	РегистрСведений.энргИдентификаторыАбонентаГИСЖКХ КАК энргИдентификаторыАбонентаГИСЖКХ
		|ГДЕ
		|	энргИдентификаторыАбонентаГИСЖКХ.Абонент = &Абонент";
		Результат 									= Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка  								= Результат.Выбрать();
			Выборка.Следующий();
			ОбъектыФормы.ОКТМО 						= Выборка.ОКТМО;
		КонецЕсли;
		
	ИначеЕсли Не ПустаяСтрока(ТекущийОбъект.ОписаниеАбонента) Тогда
		
		ДанныеАбонента 							= ДанныеАбонентаИзСтрокиJSON(ТекущийОбъект.ОписаниеАбонента);
		ЗаполнитьЗначенияСвойств(ОбъектыФормы, ДанныеАбонента);   
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДанныеПомещения(ОбъектыФормы, РезультатДанныеПомещения) Экспорт 
	 	
	Если Не РезультатДанныеПомещения.Пустой() ТОгда
		Выборка 						= РезультатДанныеПомещения.Выбрать();
		Выборка.Следующий();
		ОбъектыФормы.Строение 			= Выборка.Строение;
		ОбъектыФормы.Помещение 			= Выборка.Помещение;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектыФормы,"ЧастныйСектор") Тогда
			ОбъектыФормы.ЧастныйСектор 	= Выборка.ЧастныйСектор;
		КонецЕсли;			
	КонецЕсли;
			
КонецПроцедуры

Процедура ПроверитьИСоздатьМКД(ТекущийОбъект,Отказ) Экспорт 
	
	ДанныеМКД 			= ДанныеМКДИзСтрокиJSON(ТекущийОбъект.ОписаниеМКД);
	
	//ДанныеМКД.Вставить("ТерриториальныйОрган",ТекущийОбъект.ТерриториальныйОрган);
	//ДанныеМКД.Вставить("Филиал",ТекущийОбъект.ТерриториальныйОрган);
	
	//// проверяем адрес						
	Отказ 					= Истина;
	
	Если ДанныеМКД.Свойство("АдресОбъектаЗначение") И ЗначениеЗаполнено(ДанныеМКД.АдресОбъектаЗначение) Тогда
		Чтение  			= Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(ДанныеМКД.АдресОбъектаЗначение);
		ДанныеАдреса		= ПрочитатьJSON(Чтение);
		Если НЕ ДанныеАдреса.Свойство("apartments") ИЛИ ДанныеАдреса.apartments.Количество() = 0 Тогда 			
			Отказ 			= Ложь; 			
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("АдресОбъектаСтроительныйЗначение") И ЗначениеЗаполнено(ДанныеМКД.АдресОбъектаСтроительныйЗначение) Тогда
		Чтение  			= Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(ДанныеМКД.АдресОбъектаСтроительныйЗначение);
		ДанныеАдреса		= ПрочитатьJSON(Чтение);
		Если НЕ ДанныеАдреса.Свойство("apartments") ИЛИ ДанныеАдреса.apartments.Количество() = 0 Тогда
			Отказ 			= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭтоНовыйМКД") И ТекущийОбъект.ДополнительныеСвойства.ЭтоНовыйМКД Тогда
		МКДОбъект				= Справочники.энргСтроения.СоздатьЭлемент();
		МКДОбъект.УстановитьСсылкуНового(ТекущийОбъект.МКД);
	Иначе
		МКДОбъект 				= ТекущийОбъект.МКД.получитьОбъект();
	КонецЕсли;
	
	МКДОбъект.УлицаНедобавленнаяВФИАС = ТекущийОбъект.УлицаНедобавленнаяВФИАС;	
	ЗаполнитьРеквизитыМКД(ДанныеМКД,МКДОбъект); 	
	
КонецПроцедуры

Процедура ПроверитьИСоздатьМКДИзКоллекции(Объект, ТекущийОбъект, ИмяКоллекции, Отказ) Экспорт 
	
	//Дома			= Объект[ИмяКоллекции].Выгрузить();
	//Дома.Свернуть("НомерСтроки, АдресОбъекта");
	//
	//Запрос 			= Новый Запрос;
	//Запрос.УстановитьПараметр("Дома", Дома);
	//Запрос.Текст 										= 
	//"ВЫБРАТЬ
	//|	Дома.НомерСтроки КАК НомерСтроки,
	//|	Дома.АдресОбъекта КАК АдресОбъекта
	//|ПОМЕСТИТЬ Дома
	//|ИЗ
	//|	&Дома КАК Дома
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Дома.НомерСтроки КАК НомерСтроки,
	//|	энргСтроения.Ссылка КАК МКД
	//|ИЗ
	//|	Дома КАК Дома
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	//|		ПО Дома.АдресОбъекта = энргСтроения.Наименование";
	//
	//РезультатПоискДомов	= Запрос.Выполнить().Выгрузить();
	//
	//Сч	= 0;
	//Для Каждого СтрокаДома Из  Объект[ИмяКоллекции] Цикл
	//		
	//	СтрокаДомаСуществует 						= РезультатПоискДомов.Найти(СтрокаДома.НомерСтроки,"НомерСтроки");
	//	
	//	Если ЗначениеЗаполнено(СтрокаДома.МКД) Тогда
	//		МКДОбъект	= СтрокаДома.МКД.ПолучитьОбъект();
	//	ИначеЕсли НЕ СтрокаДомаСуществует = Неопределено Тогда
	//		МКДОбъект	= СтрокаДомаСуществует.МКД.ПолучитьОбъект();
	//	Иначе	
	//		МКДОбъект	= Справочники.энргСтроения.СоздатьЭлемент();
	//	КонецЕсли;
	//	
	//	ДанныеМКД	= Новый Структура;
	//	ДанныеМКД.Вставить("АдресОбъекта",						СтрокаДома.АдресОбъекта);
	//	ДанныеМКД.Вставить("Район",								Объект.Район);
	//	ДанныеМКД.Вставить("Организация",						Объект.Организация);
	//	ДанныеМКД.Вставить("ВидБлагоустройства",				СтрокаДома.ВидБлагоустройства);
	//	ДанныеМКД.Вставить("КоличествоЭтажей",					СтрокаДома.Этажность);
	//	ДанныеМКД.Вставить("ГодПостройки",						СтрокаДома.ГодПостройки);
	//	ДанныеМКД.Вставить("ТипПлиты",							Перечисления.энргТипыПлит.ПустаяСсылка());
	//	ДанныеМКД.Вставить("ВидОбъектаАбонентов",				СтрокаДома.ВидОбъектаАбонентов);
	//	ДанныеМКД.Вставить("ГруппаПотребителейПоУмолчанию",		СтрокаДома.ГруппаПотребителейПоУмолчанию);
	//	ДанныеМКД.Вставить("Бойлер",							СтрокаДома.Бойлер);
	//	ДанныеМКД.Вставить("МаршрутКонтроллера",				Справочники.энргМаршрутыКонтроллеров.ПустаяСсылка());
	//	ДанныеМКД.Вставить("АдресОбъектаПредставлениеПолей",	СтрокаДома.АдресОбъектаПредставлениеПолей);
	//    ДанныеМКД.Вставить("ОКТМО",								"");
	//	ДанныеМКД.Вставить("АдресОбъектаСтроительный",			"");
	//	
	//	ЗаполнитьРеквизитыМКД(ДанныеМКД, МКДОбъект);
	//	
	//	Если НЕ ЗначениеЗаполнено(СтрокаДома.МКД) Тогда
	//		ТекущийОбъект[ИмяКоллекции][Сч]["МКД"]	= МкдСсылка;
	//	КонецЕсли;
	//	Сч												= Сч + 1;
	//КонецЦикла;
КонецПроцедуры

Процедура ПроверитьИСоздатьАбонента(ТекущийОбъект,Отказ) Экспорт 
	
	ДанныеАбонента 							= ДанныеАбонентаИзСтрокиJSON(ТекущийОбъект.ОписаниеАбонента);
	
	стрОписаниеАбонента 							= ТекущийОбъект.ОписаниеАбонента;
	Чтение  										= Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(стрОписаниеАбонента);
	ОписаниеАбонента 								= ПрочитатьJSON(Чтение);
	
	ДанныеАбонента.Вставить("ВидОбъекта",		Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(ОписаниеАбонента["ВидОбъекта"])));
	ДанныеАбонента.Вставить("КлючПомещения",	ТекущийОбъект.КлючПомещения);
	ДанныеАбонента.Вставить("Район", 			ТекущийОбъект.Район);
	ДанныеАбонента.Вставить("Организация", 		ТекущийОбъект.Организация);
	ДанныеАбонента.Вставить("Поставщик", 		ТекущийОбъект.Поставщик);
	

	Абонент 								= Справочники.энргАбоненты.ПустаяСсылка();
	
	// ищем с таким же адресом	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо",			ДанныеАбонента.ФизЛицо);
	Запрос.УстановитьПараметр("КлючПомещения",		ТекущийОбъект.КлючПомещения);
	Запрос.УстановитьПараметр("Район",				ТекущийОбъект.Район);
	Запрос.УстановитьПараметр("Организация",		ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Поставщик",			ТекущийОбъект.Поставщик);	
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргАбоненты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргАбоненты КАК энргАбоненты
	|ГДЕ
	|	энргАбоненты.ФизЛицо = &ФизЛицо
	|	И энргАбоненты.КлючПомещения = &КлючПомещения
	|	И энргАбоненты.Район = &Район
	|	И энргАбоненты.Организация = &Организация
	|	И энргАбоненты.Поставщик = &Поставщик";
	Результат  					= Запрос.Выполнить();
	Выборка 					= Результат.Выбрать(); 
	Если Выборка.Следующий() тогда
		Абонент 				= Выборка.ссылка; 
	КонецЕсли;
	
	ФормироватьЛС 				= истина;
	
	Если ЗначениеЗаполнено(Абонент) И ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭтоНовыйАбонент") И Не ТекущийОбъект.ДополнительныеСвойства.ЭтоНовыйАбонент  тогда
		// обновляем реквизиты мкд
		АбонентОбъект  			= Абонент.получитьОбъект();
		ФормироватьЛС 			= Ложь;
	иначе
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭтоНовыйАбонент") и ТекущийОбъект.ДополнительныеСвойства.ЭтоНовыйАбонент тогда
			АбонентОбъект  		= Справочники.энргАбоненты.СоздатьЭлемент();			
			//АбонентОбъект.УстановитьСсылкуНового(ТекущийОбъект.Абонент);
			АбонентОбъект.УстановитьСсылкуНового(?(ТекущийОбъект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника, ТекущийОбъект.АбонентСмена, ТекущийОбъект.Абонент));
		иначе
			//АбонентОбъект 		= ТекущийОбъект.Абонент.получитьОбъект();
			АбонентОбъект 		= ?(ТекущийОбъект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника, ТекущийОбъект.АбонентСмена, ТекущийОбъект.Абонент).получитьОбъект();
			ФормироватьЛС 		= Ложь;
		КонецЕсли;
	КонецЕсли; 	
	
		
	новДанныеАбонента			= ЗаполнитьРеквизитыАбонента(ТекущийОбъект,ДанныеАбонента,АбонентОбъект,ФормироватьЛС, ТекущийОбъект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника);
	
КонецПроцедуры

Процедура ПроверитьИСоздатьАбонентаИзКоллекции(ТекущийОбъект, ИмяКоллекции, Отказ) Экспорт 
	
	МКД 												= ТекущийОбъект.МКД;
	Район 												= ТекущийОбъект.Район;
	Организация 										= ТекущийОбъект.Организация;
	ФормироватьЛС 										= Ложь;
	Сч 													= 0;
	
	НовыеАбоненты 										= ТекущийОбъект.ДополнительныеСвойства.НовыеАбоненты;
	ИзмененныеАбоненты									= ТекущийОбъект.ДополнительныеСвойства.ИзмененныеАбоненты;
	
	Для Каждого СтрокаАбонента Из ТекущийОбъект[ИмяКоллекции] Цикл
		Если Не ЗначениеЗаполнено(СтрокаАбонента.Абонент) Тогда
			// это коммунальная квартира
			Продолжить;
		КонецЕсли;
		
		ЭтоНовыйАбонент 								= НЕ НовыеАбоненты.Найти(СтрокаАбонента.НомерСтроки) = Неопределено;
		
		Если Не ЭтоНовыйАбонент И ИзмененныеАбоненты.Найти(СтрокаАбонента.Абонент) = Неопределено Тогда
			// этого абонента не изменяли, перезаписывать не надо
			Продолжить;
		КонецЕсли;
		
		АбонентОбъект 									= СтрокаАбонента.Абонент.получитьОбъект();
		Если АбонентОбъект = Неопределено и ЗначениеЗаполнено(СтрокаАбонента.Абонент) Тогда
			АбонентОбъект 								= Справочники.энргАбоненты.СоздатьЭлемент();
			АбонентОбъект.УстановитьСсылкуНового(СтрокаАбонента.Абонент);
		КонецЕсли;
		
		стрОписаниеАбонента 							= СтрокаАбонента.ОписаниеАбонента;
		
		Чтение  										= Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(стрОписаниеАбонента);
		ОписаниеАбонента 								= ПрочитатьJSON(Чтение);
		
		ДанныеАбонента 									= Новый Структура("Дата,Филиал,ГруппаАбонента,Район,Организация,МКД,ФизЛицо,ВидОбъекта,ЛицевойСчет,СтарыйЛС,АдресОбъектаЗначение,КлючПомещения,Филиал,СлужебныеОтметки");
		
		Для Каждого КлючЗначение Из ОписаниеАбонента Цикл
			Если КлючЗначение.Ключ = "ФизическоеЛицо" Тогда
				ДанныеАбонента.ФизЛицо					= Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "ВидОбъекта" Тогда
				ДанныеАбонента.ВидОбъекта			 	= Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "Филиал" Тогда
				ДанныеАбонента.Филиал 					= Справочники.энргФилиалы.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));	
			Иначе
				ДанныеАбонента[КлючЗначение.Ключ] 		= КлючЗначение.Значение;
			КонецЕсли;
		КонецЦикла;	
		ДанныеАбонента.КлючПомещения					= СтрокаАбонента.КлючПомещения;		
		ДанныеАбонента.ГруппаАбонента					= СтрокаАбонента.ГруппаАбонентов;
		ДанныеАбонента.Район							= Район;
		ДанныеАбонента.Организация						= Организация;
		ДанныеАбонента.МКД								= МКД;
										
		ДанныеАбонента.Дата                             = ТекущийОбъект.Дата;
		ДанныеАбонента 									= ЗаполнитьРеквизитыАбонента(ДанныеАбонента, ДанныеАбонента,АбонентОбъект,ФормироватьЛС);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,Период,ПолучаемыеСвойства) Экспорт 
	
	
	Если ТипЗнч(КлючПомещения) = Тип("Структура")  Тогда
		ЕстьРазделитель 	= НЕ Метаданные.ОбщиеРеквизиты.Найти("слжРазделительДляТестов") = Неопределено;
		Если ЕстьРазделитель Тогда
			КлючПомещения.Вставить("слжРазделительДляТестов", ПараметрыСеанса["слжРазделительДляТестовЗначение"]); 			
		КонецЕсли;		
		яКлючПомещения 		= РегистрыСведений.энргКлючиПомещений.Получить(КлючПомещения).КлючПомещения;
		яСтроение 			= КлючПомещения.Строение;
	Иначе
		яКлючПомещения 		= КлючПомещения;
		яСтроение 			= КлючПомещения.Строение;
	КонецЕсли;
		
	ТекстыЗапросов			= Новый Структура;
	
	Если ПолучаемыеСвойства.Свойство("КлючПомещения") Тогда
		ПолучаемыеСвойства.КлючПомещения = яКлючПомещения;	
	КонецЕсли;
	 	
	#Область КоличествоКомнат
	Если ПолучаемыеСвойства.свойство("КоличествоКомнат") тогда 				
		ТекстыЗапросов.Вставить("КоличествоКомнат",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоКомнат", 
		"ВЫБРАТЬ
		|	энргКоличествоКомнатСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоКомнат.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения
		|				И Организация = &Организация) КАК энргКоличествоКомнатСрезПоследних"));				
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоПрописанных
	Если ПолучаемыеСвойства.свойство("КоличествоПрописанных") тогда 		
		ТекстыЗапросов.Вставить("КоличествоПрописанных",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоПрописанных",
		"ВЫБРАТЬ
		|	энргКоличествоПрописанныхСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПрописанныхСрезПоследних"));		 		
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоПроживающих
	Если ПолучаемыеСвойства.свойство("КоличествоПроживающих") тогда		
		ТекстыЗапросов.Вставить("КоличествоПроживающих",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоПроживающих",
		"ВЫБРАТЬ
		|	энргКоличествоПроживающихСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПроживающихСрезПоследних"));		 		
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоСобственников
	Если ПолучаемыеСвойства.свойство("КоличествоСобственников") тогда		
		ТекстыЗапросов.Вставить("КоличествоСобственников",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоСобственников",
		"ВЫБРАТЬ
		|	энргКоличествоСобственниковСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоСобственников.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоСобственниковСрезПоследних")); 		 		
	КонецЕсли;
	#КонецОбласти
	
	#Область ВидБлагоустройства
	Если ПолучаемыеСвойства.свойство("ВидБлагоустройства") тогда
		ТекстыЗапросов.Вставить("ВидБлагоустройства",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоВидБлагоустройства",
		"ВЫБРАТЬ
		|	энргВидБлагоустройствАбонента.ВидБлагоустройства КАК ВидБлагоустройства,
		|	энргВидБлагоустройствАбонента.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргВидБлагоустройствАбонента"));		 		
	КонецЕсли;  
	#КонецОбласти
	
	#Область ЗначенияПлощадей
	Если ПолучаемыеСвойства.свойство("ЗначенияПлощадей") тогда
		ТекстыЗапросов.Вставить("ЗначенияПлощадей",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЗначенияПлощадей",
		"ВЫБРАТЬ
		|	энргЗначенияПлощадейСрезПоследних.ВидПлощади КАК ВидПлощади,
		|	энргЗначенияПлощадейСрезПоследних.Площадь КАК Значение
		|ИЗ
		|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргЗначенияПлощадейСрезПоследних"));		
	КонецЕсли; 
	#КонецОбласти
	
	#Область ГруппаПотребителей
	Если ПолучаемыеСвойства.свойство("ГруппаПотребителей") тогда
		ТекстыЗапросов.Вставить("ГруппаПотребителей",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоГруппаПотребителей",
		"ВЫБРАТЬ
		|	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей
		|ИЗ
		|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргГруппыПотребителейАбонентовСрезПоследних"));		 		
	КонецЕсли;
	#КонецОбласти	  	
	
	#Область ДанныеСостоянияЛС
	Если ПолучаемыеСвойства.свойство("ДанныеСостоянияЛС") тогда
		ТекстыЗапросов.Вставить("ДанныеСостоянияЛС",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоДанныеСостоянияЛС",
		"ВЫБРАТЬ
		|	энргСостояниеЛССрезПоследних.Период КАК ДатаСостоянияЛС,
		|	энргСостояниеЛССрезПоследних.Состояние КАК СостояниеЛС
		|ИЗ
		|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргСостояниеЛССрезПоследних"));		
	КонецЕсли; 
	#КонецОбласти 	
	
	#Область ДанныеКонтроллера
	Если ПолучаемыеСвойства.свойство("ДанныеКонтроллера") тогда
		ТекстыЗапросов.Вставить("ДанныеКонтроллера",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоДанныеКонтроллера",
		"ВЫБРАТЬ
		|	энргМаршрутыКонтроллеров.Владелец КАК Контроллер,
		|	Маршруты.Маршрут КАК Маршрут
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка КАК Маршрут
		|	ИЗ
		|		Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				энргАбонентыКонтактнаяИнформация.Представление КАК Представление
		|			ИЗ
		|				Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|			ГДЕ
		|				энргАбонентыКонтактнаяИнформация.Ссылка = &Абонент
		|				И энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|				И энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.видыКонтактнойИнформации.АдресОбъекта)) КАК ПредставлениеАдрес
		|			ПО (ПредставлениеАдрес.Представление ПОДОБНО ""%"" + энргМаршрутыКонтроллеровАдресаМаршрута.Представление + ""%"")) КАК Маршруты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров КАК энргМаршрутыКонтроллеров
		|		ПО Маршруты.Маршрут = энргМаршрутыКонтроллеров.Ссылка"));		 	
	КонецЕсли; 
	#КонецОбласти
	
	#Область ДанныеДоговора
	Если ПолучаемыеСвойства.свойство("ДанныеДоговора") тогда
		ТекстыЗапросов.Вставить("ДанныеДоговора",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоДанныеДоговора",
		"ВЫБРАТЬ
		|	энргИсторияДоговоровАбонентаСрезПоследних.ДатаДоговора КАК ДатаПодписания,
		|	энргИсторияДоговоровАбонентаСрезПоследних.НомерДоговора КАК НомерДоговора
		|ИЗ
		|	РегистрСведений.энргИсторияДоговоровАбонента.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргИсторияДоговоровАбонентаСрезПоследних
		|ГДЕ
		|	энргИсторияДоговоровАбонентаСрезПоследних.Действующий"));		 		
	КонецЕсли;
	#КонецОбласти 
	
	#Область Жильцы
	Если ПолучаемыеСвойства.свойство("Жильцы") тогда
		ТекстыЗапросов.Вставить("Жильцы",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЖильцы",
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(энргПроживаниеЖильцовСрезПоследних.Жилец) КАК Жилец,
		|	энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель
		|ИЗ
		|	РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргПроживаниеЖильцовСрезПоследних
		|ГДЕ
		|	энргПроживаниеЖильцовСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеЖильцов.Регистрация)"));		 		
	КонецЕсли;
	#КонецОбласти 
	
	#Область ОтключатьВНеполивнойСезон
	Если ПолучаемыеСвойства.свойство("ОтключатьВНеполивнойСезон") тогда
		ТекстыЗапросов.Вставить("ОтключатьВНеполивнойСезон",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЖильцыОтключатьВНеполивнойСезон",
		"ВЫБРАТЬ
		|	ЕСТЬNULL(энргАбонентыОтключаемыеВНеполивнойСезонСрезПоследних.ОтключатьВНеполивнойСезон, ЛОЖЬ) КАК ОтключатьВНеполивнойСезон
		|ИЗ
		|	РегистрСведений.энргАбонентыОтключаемыеВНеполивнойСезон.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргАбонентыОтключаемыеВНеполивнойСезонСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(энргАбонентыОтключаемыеВНеполивнойСезонСрезПоследних.ОтключатьВНеполивнойСезон, ЛОЖЬ)")); 		
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоЭтажей
	Если ПолучаемыеСвойства.свойство("КоличествоЭтажей") Или ПолучаемыеСвойства.свойство("ГодПостройки") тогда
		ТекстыЗапросов.Вставить("ЭтажностьГодПостройки",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЭтажностьГодПостройки",
		"ВЫБРАТЬ
		|	энргСтроения.КоличествоЭтажей КАК КоличествоЭтажей,
		|	энргСтроения.ГодПостройки КАК ГодПостройки
		|ИЗ
		|	Справочник.энргСтроения КАК энргСтроения
		|ГДЕ
		|	энргСтроения.Ссылка = &Строение"));				
	КонецЕсли;
	#КонецОбласти
	
	#Область ТипПомещения
	Если ПолучаемыеСвойства.свойство("ТипПомещения")  тогда
		ТекстыЗапросов.Вставить("ТипПомещения",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоТипПомещения",
		"ВЫБРАТЬ
		|	энргПомещения.ТипПомещения КАК ТипПомещения
		|ИЗ
		|	Справочник.энргПомещения КАК энргПомещения
		|ГДЕ
		|	энргПомещения.Ссылка = &Помещение"));				
	КонецЕсли;
	#КонецОбласти
	
	#Область КлючПомещенияРодителя
	Если ПолучаемыеСвойства.свойство("КлючПомещенияРодителя")  тогда
		ТекстыЗапросов.Вставить("КлючПомещенияРодителя",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКлючПомещенияРодителя",
		"ВЫБРАТЬ
		|	энргКлючиПомещений.КлючПомещения КАК КлючПомещенияРодителя
		|ИЗ
		|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
		|		ПО энргКлючиПомещений.Помещение = энргПомещения.Родитель
		|			И энргКлючиПомещений.Строение = энргПомещения.Строение
		|ГДЕ
		|	энргПомещения.Ссылка = &Помещение"));				
	КонецЕсли;
	#КонецОбласти

	
	энргРаботаСЛицевымСчетомПереопределяемый.ПараметрыРасчетаПомещения(Организация,Район,КлючПомещения,Период,ПолучаемыеСвойства,ТекстыЗапросов);
	
	
	ИтоговыйТекст 				= ""; 
	ТекстРазделитель 			= "
	|;
	|////////////////////////////////////////
	|";

	Для Каждого КлючЗначение Из ТекстыЗапросов Цикл
		ИтоговыйТекст 			= ИтоговыйТекст + ?(НЕ ПустаяСтрока(ИтоговыйТекст),ТекстРазделитель,"") + КлючЗначение.Значение.Текст;		
	КонецЦикла;
	
	Запрос  					= Новый Запрос(ИтоговыйТекст);
	Запрос.УстановитьПараметр("Период",			Период);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("КлючПомещения",	яКлючПомещения);
	Запрос.УстановитьПараметр("Строение",		яСтроение);
	Запрос.УстановитьПараметр("Помещение",		КлючПомещения.Помещение); 
	Запрос.УстановитьПараметр("Организация",	Организация); 
	Результат  					= Запрос.ВыполнитьПакет(); 	
	
	Индекс 						= 0;
	Для Каждого КлючЗначение Из ТекстыЗапросов Цикл
		ОбработчикЗаполнения 	= КлючЗначение.Значение.ОбработчикЗаполнения;
		Параметры  				= Новый Массив;
		Параметры.Добавить(ПолучаемыеСвойства);
		Параметры.Добавить(Результат[Индекс]);
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(ОбработчикЗаполнения,Параметры);		
		Индекс 					= Индекс + 1;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПараметрыРасчетаАбонента(Организация,Район,Абонент,Период,ПолучаемыеСвойства) Экспорт 
	
	ТекстДанныеАбонента	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ВидОбъекта КАК ВидОбъекта,
	|	ВложенныйЗапрос.МуниципальноеОбразование КАК МуниципальноеОбразование,
	|	ВложенныйЗапрос.ГруппаАбонента КАК ГруппаАбонента,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет,
	|	ВложенныйЗапрос.СтарыйЛС КАК СтарыйЛС,
	|	ВложенныйЗапрос.ПредставлениеАбонента КАК ПредставлениеАбонента,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(энргСтроенияКонтактнаяИнформация.Представление, """") КАК СТРОКА(250)) КАК АдресСтроения,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(энргПомещенияКонтактнаяИнформация.Представление, ЕСТЬNULL(энргСтроенияКонтактнаяИнформация.Представление, """")) КАК СТРОКА(250)) КАК АдресОбъекта,
	|	энргСтроения.ТипПлиты КАК ТипПлиты
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргАбоненты.Ссылка КАК Ссылка,
	|		энргКлючиПомещений.Строение КАК Строение,
	|		энргКлючиПомещений.Помещение КАК Помещение,
	|		энргАбоненты.ВидОбъекта КАК ВидОбъекта,
	|		энргАбоненты.МуниципальноеОбразование КАК МуниципальноеОбразование,
	|		энргАбоненты.Родитель КАК ГруппаАбонента,
	|		энргАбоненты.Район КАК Район,
	|		энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|		энргАбоненты.СтарыйЛС КАК СтарыйЛС,
	|		энргАбоненты.Наименование КАК ПредставлениеАбонента,
	|		энргАбоненты.Организация КАК Организация,
	|		энргАбоненты.КлючПомещения КАК КлючПомещения,
	|		энргАбоненты.ФизЛицо КАК ФизЛицо
	|	ИЗ
	|		Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|				И (энргАбоненты.Ссылка = &Абонент)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	|		ПО (энргПомещенияКонтактнаяИнформация.Ссылка = ВложенныйЗапрос.Помещение)
	|			И (энргПомещенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (энргПомещенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПомещения))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|		ПО (энргСтроенияКонтактнаяИнформация.Ссылка = ВложенныйЗапрос.Строение)
	|			И (энргСтроенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (энргСтроенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|		ПО ВложенныйЗапрос.Строение = энргСтроения.Ссылка";
	Запрос  				= Новый Запрос(ТекстДанныеАбонента);
	Запрос.УстановитьПараметр("Абонент",Абонент);
	Результат 				= Запрос.Выполнить();
	ДанныеАбонента 			= Результат.Выбрать();
	ДанныеАбонента.Следующий();
	
	Если ПолучаемыеСвойства.Свойство("ДанныеАбонента") Тогда
		ЗаполнитьЗначенияСвойств(ПолучаемыеСвойства.ДанныеАбонента,ДанныеАбонента);
	КонецЕсли;
	
	ТекстыЗапросов			= Новый Структура;
	
	#Область ДанныеФизЛица	
	Если  ПолучаемыеСвойства.свойство("ДанныеФизЛица") тогда
		
		ФизЛицо  	= ДанныеАбонента.ФизЛицо;
				
		Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("ДомашнийТелефон") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.ДомашнийТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо,Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
		КонецЕсли;
		
		Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("РабочийТелефон") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.РабочийТелефон 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо,Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		КонецЕсли;
		
		Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("АдресЮридический") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.АдресЮридический 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		КонецЕсли;
		
		Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("АдресФактический") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.АдресФактический 	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо,Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		КонецЕсли;
		
		Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("ЭлектроннаяПочта") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.ЭлектроннаяПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо,Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
		КонецЕсли;
		
		Если НЕ ФизЛицо = Неопределено и ПолучаемыеСвойства.ДанныеФизЛица.свойство("МестоРождения") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.МестоРождения = энргПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(ФизЛицо.МестоРождения);
		КонецЕсли;
		
		Если НЕ ФизЛицо = Неопределено и ПолучаемыеСвойства.ДанныеФизЛица.свойство("ДатаРождения") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.ДатаРождения = Формат(ФизЛицо.бестДатаРождения, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если НЕ ФизЛицо = Неопределено и ПолучаемыеСвойства.ДанныеФизЛица.свойство("ИНН") тогда
			ПолучаемыеСвойства.ДанныеФизЛица.ИНН = ФизЛицо.ИНН;
		КонецЕсли;
		
		Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("СНИЛС") тогда
			энргРаботаСЛицевымСчетомСервер.ПолучитьДанныеОДокументеФизЛица(Период, ФизЛицо, Справочники.ВидыДокументовФизическихЛиц.СНИЛС, "СНИЛС", ПолучаемыеСвойства.ДанныеФизЛица);
		КонецЕсли;
		
		Если ПолучаемыеСвойства.ДанныеФизЛица.свойство("ПаспортРФ") тогда
			энргРаботаСЛицевымСчетомСервер.ПолучитьДанныеОДокументеФизЛица(Период, ФизЛицо, Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ, "ПаспортРФ", ПолучаемыеСвойства.ДанныеФизЛица);
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти	
	
	#Область КоличествоКомнат
	Если ПолучаемыеСвойства.свойство("КоличествоКомнат") тогда 				
		ТекстыЗапросов.Вставить("КоличествоКомнат",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоКомнат", 
		"ВЫБРАТЬ
		|	энргКоличествоКомнатСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоКомнат.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения
		|				И Организация = &Организация) КАК энргКоличествоКомнатСрезПоследних"));				
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоПрописанных
	Если ПолучаемыеСвойства.свойство("КоличествоПрописанных") тогда 		
		ТекстыЗапросов.Вставить("КоличествоПрописанных",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоПрописанных",
		"ВЫБРАТЬ
		|	энргКоличествоПрописанныхСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПрописанныхСрезПоследних"));		 		
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоПроживающих
	Если ПолучаемыеСвойства.свойство("КоличествоПроживающих") тогда		
		ТекстыЗапросов.Вставить("КоличествоПроживающих",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоПроживающих",
		"ВЫБРАТЬ
		|	энргКоличествоПроживающихСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПроживающихСрезПоследних"));		 		
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоСобственников
	Если ПолучаемыеСвойства.свойство("КоличествоСобственников") тогда		
		ТекстыЗапросов.Вставить("КоличествоСобственников",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоКоличествоСобственников",
		"ВЫБРАТЬ
		|	энргКоличествоСобственниковСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.энргКоличествоСобственников.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоСобственниковСрезПоследних")); 		 		
	КонецЕсли;
	#КонецОбласти
	
	#Область ВидБлагоустройства
	Если ПолучаемыеСвойства.свойство("ВидБлагоустройства") тогда
		ТекстыЗапросов.Вставить("ВидБлагоустройства",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоВидБлагоустройства",
		"ВЫБРАТЬ
		|	энргВидБлагоустройствАбонента.Услуга КАК Услуга,
		|	энргВидБлагоустройствАбонента.ВидБлагоустройства КАК ВидБлагоустройства
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргВидБлагоустройствАбонента"));		 		
	КонецЕсли;  
	#КонецОбласти
	
	#Область ЗначенияПлощадей
	Если ПолучаемыеСвойства.свойство("ЗначенияПлощадей") тогда
		ТекстыЗапросов.Вставить("ЗначенияПлощадей",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЗначенияПлощадей",
		"ВЫБРАТЬ
		|	энргЗначенияПлощадейСрезПоследних.ВидПлощади КАК ВидПлощади,
		|	энргЗначенияПлощадейСрезПоследних.Площадь КАК Значение
		|ИЗ
		|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргЗначенияПлощадейСрезПоследних"));		
	КонецЕсли; 
	#КонецОбласти
	
	#Область ГруппаПотребителей
	Если ПолучаемыеСвойства.свойство("ГруппаПотребителей") тогда
		ТекстыЗапросов.Вставить("ГруппаПотребителей",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоГруппаПотребителей",
		"ВЫБРАТЬ
		|	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей
		|ИЗ
		|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргГруппыПотребителейАбонентовСрезПоследних"));		 		
	КонецЕсли;
	#КонецОбласти	  	
	
	#Область ДанныеСостоянияЛС
	Если ПолучаемыеСвойства.свойство("ДанныеСостоянияЛС") тогда
		ТекстыЗапросов.Вставить("ДанныеСостоянияЛС",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоДанныеСостоянияЛС",
		"ВЫБРАТЬ
		|	энргСостояниеЛССрезПоследних.Период КАК ДатаСостоянияЛС,
		|	энргСостояниеЛССрезПоследних.Состояние КАК СостояниеЛС
		|ИЗ
		|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргСостояниеЛССрезПоследних"));		
	КонецЕсли; 
	#КонецОбласти 	
	
	#Область ДанныеКонтроллера
	Если ПолучаемыеСвойства.свойство("ДанныеКонтролера") тогда
		ТекстыЗапросов.Вставить("ДанныеКонтролера",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоДанныеКонтроллера",
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	энргМаршрутыКонтроллеров.Ссылка.Владелец КАК Контроллер,
		|	энргМаршрутыКонтроллеров.Ссылка КАК Маршрут
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров.КлючПомещений КАК энргМаршрутыКонтроллеров
		|		ПО энргАбоненты.КлючПомещения = энргМаршрутыКонтроллеров.КлючПомещения
		|			И (энргАбоненты.Ссылка = &Абонент)"));		 	
	КонецЕсли; 
	#КонецОбласти
	
	#Область ДанныеДоговора
	Если ПолучаемыеСвойства.свойство("ДанныеДоговора") тогда
		ТекстыЗапросов.Вставить("ДанныеДоговора",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоДанныеДоговора",
		"ВЫБРАТЬ
		|	энргИсторияДоговоровАбонентаСрезПоследних.ДатаДоговора КАК ДатаПодписания,
		|	энргИсторияДоговоровАбонентаСрезПоследних.НомерДоговора КАК НомерДоговора
		|ИЗ
		|	РегистрСведений.энргИсторияДоговоровАбонента.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргИсторияДоговоровАбонентаСрезПоследних
		|ГДЕ
		|	энргИсторияДоговоровАбонентаСрезПоследних.Действующий"));		 		
	КонецЕсли;
	#КонецОбласти 
	
	#Область Жильцы
	Если ПолучаемыеСвойства.свойство("Жильцы") тогда
		ТекстыЗапросов.Вставить("Жильцы",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЖильцы",
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(энргПроживаниеЖильцовСрезПоследних.Жилец) КАК Жилец,
		|	энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель
		|ИЗ
		|	РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргПроживаниеЖильцовСрезПоследних
		|ГДЕ
		|	энргПроживаниеЖильцовСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеЖильцов.Регистрация)"));		 		
	КонецЕсли;
	#КонецОбласти 
	
	#Область ОтключатьВНеполивнойСезон
	Если ПолучаемыеСвойства.свойство("ОтключатьВНеполивнойСезон") тогда
		ТекстыЗапросов.Вставить("ОтключатьВНеполивнойСезон",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЖильцыОтключатьВНеполивнойСезон",
		"ВЫБРАТЬ
		|	ЕСТЬNULL(энргАбонентыОтключаемыеВНеполивнойСезонСрезПоследних.ОтключатьВНеполивнойСезон, ЛОЖЬ) КАК ОтключатьВНеполивнойСезон
		|ИЗ
		|	РегистрСведений.энргАбонентыОтключаемыеВНеполивнойСезон.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргАбонентыОтключаемыеВНеполивнойСезонСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(энргАбонентыОтключаемыеВНеполивнойСезонСрезПоследних.ОтключатьВНеполивнойСезон, ЛОЖЬ)")); 		
	КонецЕсли;
	#КонецОбласти
	
	#Область КоличествоЭтажей
	Если ПолучаемыеСвойства.свойство("КоличествоЭтажей") Или ПолучаемыеСвойства.свойство("ГодПостройки") тогда
		ТекстыЗапросов.Вставить("ЭтажностьГодПостройки",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЭтажностьГодПостройки",
		"ВЫБРАТЬ
		|	энргСтроения.КоличествоЭтажей КАК КоличествоЭтажей,
		|	энргСтроения.ГодПостройки КАК ГодПостройки
		|ИЗ
		|	Справочник.энргСтроения КАК энргСтроения
		|ГДЕ
		|	энргСтроения.Ссылка = &Строение"));				
	КонецЕсли;
	#КонецОбласти
	
	#Область ДанныеОЛьготниках
	Если ПолучаемыеСвойства.свойство("ДанныеОЛьготниках") тогда
		ТекстыЗапросов.Вставить("ДанныеОЛьготниках",Новый Структура("ОбработчикЗаполнения,Текст","энргРаботаСЛицевымСчетомСервер.ЗаполнитьСвойствоЖильцыЛьготныхКатегорий",
		"ВЫБРАТЬ
		|	энргЖильцыЛьготныхКатегорий.Период КАК ДатаСостояния,
		|	энргЖильцыЛьготныхКатегорий.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент) КАК энргЖильцыЛьготныхКатегорий"));		
	КонецЕсли; 
	#КонецОбласти 	
	
	энргРаботаСЛицевымСчетомПереопределяемый.ПараметрыРасчетаАбонента(Организация,Район,Абонент,Период,ПолучаемыеСвойства,ДанныеАбонента,ТекстыЗапросов);
	
	
	ИтоговыйТекст 		= ""; 
	ТекстРазделитель 	= "
	|;
	|////////////////////////////////////////
	|";

	Для Каждого КлючЗначение Из ТекстыЗапросов Цикл
		ИтоговыйТекст 	= ИтоговыйТекст + ?(НЕ ПустаяСтрока(ИтоговыйТекст),ТекстРазделитель,"") + КлючЗначение.Значение.Текст;		
	КонецЦикла;

	Если ЗначениеЗаполнено(ИтоговыйТекст) Тогда
		Запрос  			= Новый Запрос(ИтоговыйТекст);
		Запрос.УстановитьПараметр("Период",			Период);
		Запрос.УстановитьПараметр("Район",			Район);
		Запрос.УстановитьПараметр("КлючПомещения",	ДанныеАбонента.КлючПомещения);
		Запрос.УстановитьПараметр("Строение",		ДанныеАбонента.Строение);
		Запрос.УстановитьПараметр("Организация",	Организация); 
		Запрос.УстановитьПараметр("Абонент",		Абонент); 
		Результат  			= Запрос.ВыполнитьПакет(); 	
		
		Индекс 				= 0;
		Для Каждого КлючЗначение Из ТекстыЗапросов Цикл
			ОбработчикЗаполнения 	= КлючЗначение.Значение.ОбработчикЗаполнения;
			Параметры  				= Новый Массив;
			Параметры.Добавить(ПолучаемыеСвойства);
			Параметры.Добавить(Результат[Индекс]);
			ОбщегоНазначения.ВыполнитьМетодКонфигурации(ОбработчикЗаполнения,Параметры);		
			Индекс 					= Индекс + 1;		
		КонецЦикла;
	КонецЕсли;
	
	#Область КоличествоЧеловек
	
	Если ПолучаемыеСвойства.Свойство("КоличествоЧеловек") Тогда
		 ПолучаемыеСвойства.КоличествоЧеловек 		= энргРаботаСПараметрамиРасчетаАбонентаСервер.КоличествоЧеловек(ПолучаемыеСвойства);
	КонецЕсли; 	
	
	#КонецОбласти
	
КонецПроцедуры

Процедура ПараметрыРасчетаМКД(Организация,Район,Строение,Период,ПолучаемыеСвойства) Экспорт 
		
	ТекДата				= ТекущаяДата();
		
	#Область ВидБлагоустройства
	Если ПолучаемыеСвойства.свойство("ВидБлагоустройства") тогда
		Запрос  		= Новый Запрос;
		Запрос.УстановитьПараметр("Период",		Период);
		Запрос.УстановитьПараметр("Район",		Район);
		Запрос.УстановитьПараметр("МКД",		Строение);
		Запрос.УстановитьПараметр("Организация",Организация);		
		Запрос.Текст 	=
		"ВЫБРАТЬ
		|	энргВидБлагоустройствМКД.ВидБлагоустройства КАК ВидБлагоустройства
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД) КАК энргВидБлагоустройствМКД";
		Результат  		= Запрос.Выполнить();
		Выборка 		= Результат.Выбрать();
		Если Выборка.Следующий() тогда
			ПолучаемыеСвойства.ВидБлагоустройства = Выборка.ВидБлагоустройства;
		КонецЕсли; 		
	КонецЕсли;  
	#КонецОбласти
	
	#Область ТипСхемыГВС
	Если ПолучаемыеСвойства.свойство("ТипСхемыГВС") тогда
		Запрос  		= Новый Запрос;
		Запрос.УстановитьПараметр("Период",		Период);
		Запрос.УстановитьПараметр("Район",		Район);
		Запрос.УстановитьПараметр("МКД",		Строение);
		Запрос.УстановитьПараметр("Организация",Организация);		
		Запрос.Текст 	=
		"ВЫБРАТЬ
		|	энргТипСхемыГВССрезПоследних.ТипСхемы КАК ТипСхемы
		|ИЗ
		|	РегистрСведений.энргТипСхемыГВС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И МКД = &МКД
		|				И Район = &Район) КАК энргТипСхемыГВССрезПоследних";
		Результат  		= Запрос.Выполнить();
		Выборка 		= Результат.Выбрать();
		Если Выборка.Следующий() тогда
			ПолучаемыеСвойства.ТипСхемыГВС = Выборка.ТипСхемы;
		КонецЕсли; 		
	КонецЕсли;  
	#КонецОбласти
	
	#Область ВидТепловогоПункта
	Если ПолучаемыеСвойства.свойство("ВидТепловогоПункта") тогда
		Запрос  		= Новый Запрос;
		Запрос.УстановитьПараметр("Период",		Период);
		Запрос.УстановитьПараметр("Район",		Район);
		Запрос.УстановитьПараметр("МКД",		Строение);
		Запрос.УстановитьПараметр("Организация",Организация);		
		Запрос.Текст 	=
		"ВЫБРАТЬ
		|	энргТипПринадлежностиМКДСрезПоследних.ВидТепловогоПункта КАК ВидТепловогоПункта
		|ИЗ
		|	РегистрСведений.энргТипПринадлежностиМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И МКД = &МКД
		|				И Район = &Район) КАК энргТипПринадлежностиМКДСрезПоследних";
		Результат  		= Запрос.Выполнить();
		Выборка 		= Результат.Выбрать();
		Если Выборка.Следующий() тогда
			ПолучаемыеСвойства.ВидТепловогоПункта = Выборка.ВидТепловогоПункта;
		КонецЕсли; 		
	КонецЕсли;  
	#КонецОбласти

	#Область КоличествоЭтажей
	Если ПолучаемыеСвойства.свойство("КоличествоЭтажей") Или ПолучаемыеСвойства.свойство("ГодПостройки") тогда
		Запрос  		= Новый Запрос;
		Запрос.УстановитьПараметр("Строение",Строение);
		Запрос.Текст 	=
		"ВЫБРАТЬ
		|	энргСтроения.КоличествоЭтажей КАК КоличествоЭтажей,
		|	энргСтроения.ГодПостройки КАК ГодПостройки
		|ИЗ
		|	Справочник.энргСтроения КАК энргСтроения
		|ГДЕ
		|	энргСтроения.Ссылка = &Строение";
		Результат  		= Запрос.Выполнить();
		Выборка  		= Результат.Выбрать();
		Если Выборка.Следующий() тогда
			//Если ПолучаемыеСвойства.свойство("Этажность") Тогда
			//	ПолучаемыеСвойства.Этажность = Выборка.Этажность;
			//КонецЕсли;
			//Если ПолучаемыеСвойства.свойство("ГодПостройки") Тогда 
			//	ПолучаемыеСвойства.ГодПостройки = Выборка.ГодПостройки;
			//КонецЕсли;	
			ЗаполнитьЗначенияСвойств(ПолучаемыеСвойства, Выборка);
		Иначе 
			Если ПолучаемыеСвойства.свойство("КоличествоЭтажей") Тогда
				ПолучаемыеСвойства.КоличествоЭтажей = 0;
			КонецЕсли;
			Если ПолучаемыеСвойства.свойство("ГодПостройки") Тогда 
				ПолучаемыеСвойства.ГодПостройки = 0;
			КонецЕсли;
		КонецЕсли; 		
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыМКД(ДанныеМКД,ЭлементМКД)
	
	Если ДанныеМКД.Свойство("Организация") Тогда 
		ЭлементМКД.Организация						= ДанныеМКД.Организация;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("Район") Тогда 
		ЭлементМКД.Район							= ДанныеМКД.Район;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ВидБлагоустройства") Тогда 
		ЭлементМКД.ВидБлагоустройства				= ДанныеМКД.ВидБлагоустройства;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("КоличествоЭтажей") Тогда 
		ЭлементМКД.КоличествоЭтажей					= ДанныеМКД.КоличествоЭтажей;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ГодПостройки") Тогда 
		ЭлементМКД.ГодПостройки						= ДанныеМКД.ГодПостройки;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ТипПлиты") Тогда 
		ЭлементМКД.ТипПлиты							= ДанныеМКД.ТипПлиты;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ВидОбъектаАбонентов") Тогда 
		ЭлементМКД.ВидОбъектаАбонентов				= ДанныеМКД.ВидОбъектаАбонентов;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ГруппаПотребителейПоУмолчанию") Тогда 
		ЭлементМКД.ГруппаПотребителейПоУмолчанию	= ДанныеМКД.ГруппаПотребителейПоУмолчанию;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("Бойлер") Тогда 
		ЭлементМКД.Бойлер							= ДанныеМКД.Бойлер;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("МаршрутКонтроллера") Тогда 
		ЭлементМКД.МаршрутКонтроллера				= ДанныеМКД.МаршрутКонтроллера;
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ВидыБлагоустройстваТарифныеКатегории") Тогда 
		ЭлементМКД.ВидыБлагоустройстваТарифныеКатегории.Очистить();
		Для Каждого Строка Из ДанныеМКД.ВидыБлагоустройстваТарифныеКатегории Цикл
			НовСтр = ЭлементМКД.ВидыБлагоустройстваТарифныеКатегории.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Строка);
		КонецЦикла; 
	КонецЕсли;
	
	ЭлементМКД.ТипСтроения 							= Перечисления.энргТипыСтроений.МКД;
	
	СтрокиКИ										= ЭлементМКД.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресДома));
	Для Каждого СтрокаКИ Из СтрокиКИ Цикл
		ЭлементМКД.КонтактнаяИнформация.Удалить(СтрокаКИ); 
	КонецЦикла;
	
	СтрокиКИ 										= ЭлементМКД.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.СтроительныйАдресДома));
	Для Каждого СтрокаКИ Из СтрокиКИ Цикл
		ЭлементМКД.КонтактнаяИнформация.Удалить(СтрокаКИ); 
	КонецЦикла;
	
	Если ДанныеМКД.Свойство("АдресОбъектаЗначение") Тогда
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭлементМКД, ДанныеМКД.АдресОбъектаЗначение,Справочники.ВидыКонтактнойИнформации.АдресДома,Перечисления.ТипыКонтактнойИнформации.Адрес);
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("АдресОбъектаСтроительныйЗначение") Тогда
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ЭлементМКД, ДанныеМКД.АдресОбъектаСтроительныйЗначение,Справочники.ВидыКонтактнойИнформации.СтроительныйАдресДома,Перечисления.ТипыКонтактнойИнформации.Адрес);
	КонецЕсли;

	Попытка	
		ЭлементМКД.Записать();
	Исключение
		ВызватьИсключение "Не удалось создать мкд";
	КонецПопытки;
	
	Если ДанныеМКД.Свойство("ОКТМО") Тогда
		НоваяЗапись 								= РегистрыСведений.энргИдентификаторыМКДГИСЖКХ.СоздатьМенеджерЗаписи();
		НоваяЗапись.МКД								= ЭлементМКД.Ссылка;	
		НоваяЗапись.ОКТМО							= ДанныеМКД.ОКТМО;
		Если СтрНачинаетсяС(СокрЛ(ДанныеМКД.АдресОбъектаЗначение), "{") Тогда 
			ЧтениеJSON 								= Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ДанныеМКД.АдресОбъектаЗначение);
			КонтактнаяИнформация 					= ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если КонтактнаяИнформация.Свойство("houseId") И ЗначениеЗаполнено(КонтактнаяИнформация.houseId) Тогда 
				НоваяЗапись.ИдентификаторДомаФИАС	= КонтактнаяИнформация.houseId;
			КонецЕсли;
		КонецЕсли;	
		НоваяЗапись.Записать();
	КонецЕсли;

КонецПроцедуры

Функция ЗаполнитьРеквизитыАбонента(ТекущийОбъект,ДанныеАбонента,АбонентОбъект,ФормироватьЛС, ЭтоСменаСобственника = Ложь)
	                                   	
	//АбонентОбъект.VIPабонент                    = ТекущийОбъект.VIPабонент;
	АбонентОбъект.Родитель 						= ТекущийОбъект.ГруппаАбонента;
	АбонентОбъект.Район 						= ТекущийОбъект.Район;
	АбонентОбъект.Организация 					= ТекущийОбъект.Организация;
	
	Если ДанныеАбонента.Свойство("КлючПомещения") Тогда
		АбонентОбъект.КлючПомещения = ДанныеАбонента.КлючПомещения;
	Иначе
		АбонентОбъект.КлючПомещения = ТекущийОбъект.КлючПомещения;
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("МуниципальноеОбразование") Тогда
		АбонентОбъект.МуниципальноеОбразование = ДанныеАбонента.МуниципальноеОбразование;
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("Поставщик") Тогда
		АбонентОбъект.Поставщик = ДанныеАбонента.Поставщик;
	КонецЕсли;
	
	АбонентОбъект.ФизЛицо 						= ДанныеАбонента.ФизЛицо; 	
	АбонентОбъект.ВидОбъекта 					= ?(ЭтоСменаСобственника, ТекущийОбъект.Абонент.ВидОбъекта, ДанныеАбонента.ВидОбъекта);
	АбонентОбъект.Наименование 					= СокрЛП(ДанныеАбонента.ФизЛицо);
	Если ЗначениеЗаполнено(ТекущийОбъект.СтарыйЛС) Тогда
		АбонентОбъект.СтарыйЛС 						= ТекущийОбъект.СтарыйЛС;
	КонецЕсли;
	
	Если ФормироватьЛС тогда
		АбонентОбъект.ЛицевойСчет 				= Обработки.энргНомераЛицевыхСчетовМенеджер.СФормироватьЛицевойСчет(ТекущийОбъект.Организация,ТекущийОбъект.Район,ТекущийОбъект.ГруппаАбонента, ?(ДанныеАбонента.Свойство("Филиал"), ДанныеАбонента.Филиал,Неопределено));
	ИначеЕсли ДанныеАбонента.Свойство("ЛицевойСчет") Тогда 
		АбонентОбъект.ЛицевойСчет 				= ДанныеАбонента.ЛицевойСчет;
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("СлужебныеОтметки") Тогда 
		АбонентОбъект.СлужебныеОтметки 			= ДанныеАбонента.СлужебныеОтметки;
	КонецЕсли;
	
	СтрокаКИ = Неопределено;
	//Помещение =  ДанныеАбонента.КлючПомещения.Помещение;
	Помещение =  АбонентОбъект.КлючПомещения.Помещение;
	Если ЗначениеЗаполнено(Помещение) И Не Помещение.Фиктивное Тогда
		СтрокаКИ = Помещение.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресПомещения, "Вид");	
	Иначе
		Строение =  ДанныеАбонента.КлючПомещения.Строение;
		Если ЗначениеЗаполнено(Строение) Тогда
			СтрокаКИ = Строение.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресДома, "Вид");
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаКИ <> Неопределено Тогда
		ТипКИ		= Перечисления.ТипыКонтактнойИнформации.Адрес;
		ВидКИ 		= Справочники.ВидыКонтактнойИнформации.АдресОбъекта;
		АбонентОбъект.КонтактнаяИнформация.Очистить();
		
		Если НЕ ПустаяСтрока(СтрокаКИ.Значение) Тогда
			АдресДома 	= СтрокаКИ.Значение;
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(АбонентОбъект, АдресДома, ВидКИ, ТипКИ);
		Иначе 
			АдресДома 	= СтрокаКИ.Представление;
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(АбонентОбъект, УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(АдресДома, ВидКИ), ВидКИ, ТипКИ);
		КонецЕсли;		
	КонецЕсли;
	
	АбонентОбъект.Записать();
	
	Если ДанныеАбонента.Свойство("Филиал") Тогда
		МЗ = РегистрыСведений.энргФилиалыАбонентов.СоздатьМенеджерЗаписи();
		МЗ.Абонент	= АбонентОбъект.Ссылка;
		МЗ.Период	= ТекущийОбъект.Дата;
		МЗ.Филиал	= ДанныеАбонента.Филиал;
		МЗ.Записать(Истина);
		// ЗаполнитьЗначенияСвойств(АбонентОбъект,ДанныеАбонента,"Филиал");
	КонецЕсли;
		
	Возврат Новый Структура("Абонент,ЛицевойСчет",АбонентОбъект.Ссылка,АбонентОбъект.ЛицевойСчет); 
КонецФункции

Функция МаршрутКонтроллераПоАдресу(АдресОбъекта) Экспорт 

	МаршрутКонтроллера = Новый Структура("Маршрут,Контроллер",Справочники.энргМаршрутыКонтроллеров.ПустаяСсылка(),Справочники.энргСотрудники.ПустаяСсылка());
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("АдресОбъекта",	АдресОбъекта);
	Запрос.Текст 	="ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка КАК Маршрут
	|ПОМЕСТИТЬ Маршруты
	|ИЗ
	|	Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	|ГДЕ
	|	&АдресОбъекта ПОДОБНО ""%"" + энргМаршрутыКонтроллеровАдресаМаршрута.Представление + ""%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргМаршрутыКонтроллеров.Владелец КАК Контроллер,
	|	Маршруты.Маршрут КАК Маршрут 
	|ИЗ
	|	Маршруты КАК Маршруты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров КАК энргМаршрутыКонтроллеров
	|		ПО Маршруты.Маршрут = энргМаршрутыКонтроллеров.Ссылка";
	
	Результат  		= Запрос.Выполнить();
	Выборка 		= Результат.Выбрать();
	
	Если Выборка.Следующий() тогда
		ЗаполнитьЗначенияСвойств(МаршрутКонтроллера,Выборка);
	КонецЕсли;
	
	Возврат МаршрутКонтроллера;
	
КонецФункции

Функция ПоляАдресаМКД(ДанныеАдреса) Экспорт 
	
	Корпус  				= "";
	ТипКорпуса 				= "";
	Если ЗначениеЗаполнено(ДанныеАдреса.Корпуса) и ТипЗнч(ДанныеАдреса.Корпуса) = Тип("Массив") тогда
		Корпус 				= ДанныеАдреса.Корпуса[0].Номер;
		ТипКорпуса 			= ДанныеАдреса.Корпуса[0].ТипКорпуса;
	КонецЕсли;
	
	ПоляАдреса  	= Новый Структура();
	ПоляАдреса.Вставить("Индекс",				ДанныеАдреса.Индекс);
	ПоляАдреса.Вставить("Регион",				ДанныеАдреса.Регион);
	ПоляАдреса.Вставить("Город",				ДанныеАдреса.Город);
	ПоляАдреса.Вставить("НаселенныйПункт",		ДанныеАдреса.НаселенныйПункт);
	ПоляАдреса.Вставить("Дом",					ДанныеАдреса.Здание.Номер);
	ПоляАдреса.Вставить("Корпус",				Корпус);
	ПоляАдреса.Вставить("Улица",				ДанныеАдреса.Улица);
	
	Возврат ПоляАдреса;
КонецФункции

Процедура ДобавитьАдресКМашруту(АдресОбъекта,АдресОбъектаПредставлениеПолей,Контроллер=Неопределено,Маршрут) Экспорт  
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("АдресОбъекта",	АдресОбъекта);
	Запрос.УстановитьПараметр("Маршрут",		Маршрут);
	Запрос.УстановитьПараметр("Контроллер",		?(Контроллер=Неопределено,Маршрут.Владелец, Контроллер));
	Запрос.Текст 	="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             	 |	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка КАК Маршрут
	             	 |ПОМЕСТИТЬ Маршруты
	             	 |ИЗ
	             	 |	Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	             	 |ГДЕ
	             	 |	энргМаршрутыКонтроллеровАдресаМаршрута.Представление ПОДОБНО &АдресОбъекта
	             	 |	И энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка = &Маршрут
	             	 |;
	             	 |
	             	 |////////////////////////////////////////////////////////////////////////////////
	             	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	             	 |	энргМаршрутыКонтроллеров.Владелец КАК Контроллер
	             	 |ИЗ
	             	 |	Маршруты КАК Маршруты
	             	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров КАК энргМаршрутыКонтроллеров
	             	 |		ПО Маршруты.Маршрут = энргМаршрутыКонтроллеров.Ссылка
	             	 |			И (энргМаршрутыКонтроллеров.Владелец = &Контроллер)";
	
	Результат  				= Запрос.Выполнить();
	
	Если не Результат.Пустой() тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем строку таб части
	МаршрутОбъект 			= Маршрут.получитьОбъект();
	СтрокаТЧ  				= МаршрутОбъект.АдресаМаршрута.добавить();
	СтрокаТЧ.ЗначенияПолей 	= АдресОбъектаПредставлениеПолей;
	СтрокаТЧ.Представление 	= АдресОбъекта;
	
	МаршрутОбъект.записать();
	
КонецПроцедуры

Процедура ПолучитьДанныеУК_МКД(ТекМКД, ТекДата, СтруктураДанных) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 	ТекДата);
	Запрос.УстановитьПараметр("МКД", 	ТекМКД);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	энргФормыУправленияМКДСрезПоследних.Район КАК Район,
	|	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД,
	|	энргФормыУправленияМКДСрезПоследних.ФормаУправления КАК ФормаУправления,
	|	энргФормыУправленияМКДСрезПоследних.УК КАК УК,
	|	энргФормыУправленияМКДСрезПоследних.Период КАК Период,
	|	энргФормыУправленияМКДСрезПоследних.РасчетОбъемовВыполняетУК КАК РасчетОбъемовВыполняетУК
	|ИЗ
	|	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(&Дата, МКД = &МКД) КАК энргФормыУправленияМКДСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргФормыУправленияМКДСрезПоследних.Район,
	|	энргФормыУправленияМКДСрезПоследних.УК,
	|	энргФормыУправленияМКДСрезПоследних.Период,
	|	энргФормыУправленияМКДСрезПоследних.ФормаУправления,
	|	энргФормыУправленияМКДСрезПоследних.МКД,
	|	энргФормыУправленияМКДСрезПоследних.РасчетОбъемовВыполняетУК";
	Результат 	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьАдресМКД(Строение) Экспорт 
	
	АдресМКД = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргСтроенияКонтактнаяИнформация.Представление КАК Представление,
		|	энргСтроенияКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
		|ИЗ
		|	Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
		|ГДЕ
		|	энргСтроенияКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		АдресМКД.Вставить("Представление",	ВыборкаДетальныеЗаписи.Представление);  
		АдресМКД.Вставить("ЗначенияПолей",	ВыборкаДетальныеЗаписи.ЗначенияПолей);
	Иначе
		АдресМКД.Вставить("Представление",	"");  
		АдресМКД.Вставить("ЗначенияПолей",	"");
	КонецЕсли;
	
	Возврат АдресМКД;
	
КонецФункции

Функция ДанныеАбонентаИзСтрокиJSON(ОписаниеАбонента)
	
	Чтение  								= Новый ЧтениеJSON;	
	Чтение.УстановитьСтроку(ОписаниеАбонента);
	ДанныеАбонента 							= ПрочитатьJSON(Чтение);
	
	Результат 								= Новый Структура;
	
	Если ДанныеАбонента.Свойство("ФизЛицо") Тогда
		Результат.Вставить("ФизЛицо",Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.ФизЛицо)));
	КонецЕсли;
	Если ДанныеАбонента.Свойство("ВидОбъекта") Тогда
		Результат.Вставить("ВидОбъекта", Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.ВидОбъекта)));
	КонецЕсли;
	Если ДанныеАбонента.Свойство("Филиал") Тогда
		Результат.Вставить("Филиал", Справочники.энргФилиалы.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.Филиал)));
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("АдресОбъекта") Тогда
		Результат.Вставить("АдресОбъекта", ДанныеАбонента.АдресОбъекта);
		Результат.Вставить("АдресОбъектаЗначение", ДанныеАбонента.АдресОбъектаЗначение);
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("ОКТМО") Тогда
		Результат.Вставить("ОКТМО", ДанныеАбонента.ОКТМО);
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("КлючПомещения") Тогда
		Результат.Вставить("КлючПомещения", ДанныеАбонента.КлючПомещения);
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("МуниципальноеОбразование") Тогда
		Результат.Вставить("МуниципальноеОбразование", Справочники.энргМуниципальноеОбразование.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.МуниципальноеОбразование))); 
	КонецЕсли;


	Возврат Результат;
	
КонецФункции

Функция ДанныеМКДИзСтрокиJSON(ОписаниеАбонента)
			
	Чтение  			= Новый ЧтениеJSON;	
	Чтение.УстановитьСтроку(ОписаниеАбонента);
	ДанныеМКД 			= ПрочитатьJSON(Чтение);
	
	Результат 			= Новый Структура;
	
	Если ДанныеМКД.Свойство("Организация") Тогда
		Результат.Вставить("Организация",						Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеМКД.Организация)));
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("Район") Тогда
		Результат.Вставить("Район", 							Справочники.энргЗоныОтвественности.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеМКД.Район)));
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("Бойлер") Тогда
		Результат.Вставить("Бойлер", 							Булево(ДанныеМКД.Бойлер));
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ГодПостройки") Тогда
		Результат.Вставить("ГодПостройки", 						Число(ДанныеМКД.ГодПостройки));
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ВидОбъектаАбонентов") Тогда
		Результат.Вставить("ВидОбъектаАбонентов", 				Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеМКД.ВидОбъектаАбонентов)));
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ГруппаПотребителейПоУмолчанию") Тогда
		Результат.Вставить("ГруппаПотребителейПоУмолчанию", 	Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеМКД.ГруппаПотребителейПоУмолчанию)));
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("КоличествоЭтажей") Тогда
		Результат.Вставить("КоличествоЭтажей", 					Число(ДанныеМКД.КоличествоЭтажей));
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ОКТМО") Тогда
		Результат.Вставить("ОКТМО", 							ДанныеМКД.ОКТМО);
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("ТипПлиты") Тогда
		Результат.Вставить("ТипПлиты", 							Перечисления.энргТипыПлит[ДанныеМКД.ТипПлиты]);
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("АдресОбъекта") Тогда
		Результат.Вставить("АдресОбъекта", 						ДанныеМКД.АдресОбъекта);
		Результат.Вставить("АдресОбъектаЗначение", 				ДанныеМКД.АдресОбъектаЗначение);
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("АдресОбъектаСтроительный") Тогда
		Результат.Вставить("АдресОбъектаСтроительный", 			ДанныеМКД.АдресОбъектаСтроительный);
		Результат.Вставить("АдресОбъектаСтроительныйЗначение", 	ДанныеМКД.АдресОбъектаСтроительныйЗначение);
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("Филиал") Тогда
		Результат.Вставить("Филиал", 	Справочники.энргФилиалы.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеМКД.Филиал)));
	Иначе
		Результат.Вставить("Филиал", 	Справочники.энргФилиалы.ПустаяСсылка());
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("Дата") Тогда
		Результат.Вставить("Дата", ДанныеМКД.Дата);
	КонецЕсли;
	
	Если ДанныеМКД.Свойство("МаршрутКонтроллера") Тогда
		Результат.Вставить("МаршрутКонтроллера"				,Справочники.энргМаршрутыКонтроллеров.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеМКД.МаршрутКонтроллера)));
	КонецЕсли;
	
	
	Если ДанныеМКД.Свойство("ВидыБлагоустройстваТарифныеКатегории") Тогда
		
		МассивВидов = Новый Массив;
		Для Каждого Строка Из ДанныеМКД.ВидыБлагоустройстваТарифныеКатегории Цикл
			Структура = Новый Структура;
			Если Строка.Свойство("Услуга") Тогда
				Структура.Вставить("Услуга", Справочники.энргВидыУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.Услуга)));
			КонецЕсли;
			Если Строка.Свойство("ВидБлагоустройстваИндивидуальный") Тогда
				Структура.Вставить("ВидБлагоустройстваИндивидуальный", Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ВидБлагоустройстваИндивидуальный)));
			КонецЕсли;
			Если Строка.Свойство("ВидБлагоустройстваОбщедомовой") Тогда
				Структура.Вставить("ВидБлагоустройстваОбщедомовой", Справочники.энргВидыБлагоустройств.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ВидБлагоустройстваОбщедомовой)));
			КонецЕсли;
			Если Строка.Свойство("ТарифнаяКатегория") Тогда
				Структура.Вставить("ТарифнаяКатегория", Справочники.энргГруппыПотребителей.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ТарифнаяКатегория)));
			КонецЕсли;
			МассивВидов.Добавить(Структура);
		КонецЦикла; 
		
		Результат.Вставить("ВидыБлагоустройстваТарифныеКатегории", МассивВидов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьВидыБлагоустройстваТарифныеКатегории(ТекущийОбъект,IDСтроки = Неопределено) Экспорт
	
	МассивУслуг			= Новый Массив;
	МассивУслугДобавить = Новый Массив;
	МассивУслугУдалить	= Новый Массив;
	МассивТекУслуг		= Новый Массив;
	Если IDСтроки = Неопределено Тогда
		МассивТекУслуг = ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.Выгрузить().ВыгрузитьКолонку("Услуга");
		КоллекцияТУ = ТекущийОбъект.Объект.ТочкиУчета;
	Иначе 
		СтрокиВБ = ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.НайтиСтроки(Новый Структура("IDСтрокиАбонента",IDСтроки));
		Для Каждого СтрокаВБ Из СтрокиВБ Цикл
			Если МассивТекУслуг.Найти(СтрокаВБ.Услуга) = Неопределено Тогда
				МассивТекУслуг.Добавить(СтрокаВБ.Услуга);	
			КонецЕсли; 	
		КонецЦикла; 
		КоллекцияТУ = ТекущийОбъект.Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиАбонента",IDСтроки));
	КонецЕсли; 
	
	Для Каждого ТекУслуга Из КоллекцияТУ Цикл
		
		Если Не ЗначениеЗаполнено(ТекУслуга.Услуга) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТекУслуга.Услуга.СоставнаяУслуга Тогда
			Для Каждого СостУслуга Из ТекУслуга.Услуга.СоставляющиеУслуг Цикл
				Если МассивТекУслуг.Найти(СостУслуга.Услуга) = Неопределено И МассивУслуг.Найти(СостУслуга.Услуга) = Неопределено Тогда
					МассивУслугДобавить.Добавить(СостУслуга.Услуга);
					МассивУслуг.Добавить(СостУслуга.Услуга);
				ИначеЕсли МассивУслуг.Найти(СостУслуга.Услуга) = Неопределено Тогда
					МассивУслуг.Добавить(СостУслуга.Услуга);
				КонецЕсли	
			КонецЦикла;			
		Иначе
			Если МассивТекУслуг.Найти(ТекУслуга.Услуга) = Неопределено И МассивУслуг.Найти(ТекУслуга.Услуга) = Неопределено Тогда
				МассивУслугДобавить.Добавить(ТекУслуга.Услуга);	
				МассивУслуг.Добавить(ТекУслуга.Услуга);
			ИначеЕсли МассивУслуг.Найти(ТекУслуга.Услуга) = Неопределено Тогда
				МассивУслуг.Добавить(ТекУслуга.Услуга);
			КонецЕсли;			
		КонецЕсли;
			
	КонецЦикла; 
	
	Для Каждого ТекУслуга Из МассивТекУслуг Цикл
		Если МассивУслуг.Найти(ТекУслуга) = Неопределено Тогда
			МассивУслугУдалить.Добавить(ТекУслуга);	
		КонецЕсли; 	
	КонецЦикла; 
	
	Для Каждого ТекУслуга Из МассивУслугУдалить Цикл
		Если IDСтроки = Неопределено Тогда
			СтрокиБлагоустройства = ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.НайтиСтроки(Новый Структура("Услуга",ТекУслуга));
		Иначе
			СтрокиБлагоустройства = ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.НайтиСтроки(Новый Структура("Услуга,IDСтрокиАбонента",ТекУслуга,IDСтроки));
		КонецЕсли; 
		
		Для Каждого ТекСтрока Из СтрокиБлагоустройства Цикл
			ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.Удалить(ТекСтрока);	
		КонецЦикла; 
	КонецЦикла; 
	
	Для Каждого ТекУслуга Из МассивУслугДобавить Цикл
		НоваяСтрока = ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.Добавить();
		НоваяСтрока.Услуга				= ТекУслуга;
		Если IDСтроки <> Неопределено Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "IDСтроки") Тогда 
				НоваяСтрока.IDСтроки			= Новый УникальныйИдентификатор();
			КонецЕсли;
			НоваяСтрока.IDСтрокиАбонента    = IDСтроки;	
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЗначениеПлощадей(ТекущийОбъект,IDСтроки = Неопределено) Экспорт
	
	МассивУслуг			= Новый Массив;
	МассивУслугДобавить = Новый Массив;
	МассивУслугУдалить	= Новый Массив;
	МассивТекУслуг		= Новый Массив;
	Если IDСтроки = Неопределено Тогда
		МассивТекУслуг = ТекущийОбъект.Объект.ЗначениеПлощадей.Выгрузить().ВыгрузитьКолонку("Услуга");
		КоллекцияТУ = ТекущийОбъект.Объект.ТочкиУчета;
	Иначе 
		СтрокиВБ = ТекущийОбъект.Объект.ЗначениеПлощадей.НайтиСтроки(Новый Структура("IDСтрокиАбонента",IDСтроки));
		Для Каждого СтрокаВБ Из СтрокиВБ Цикл
			Если МассивТекУслуг.Найти(СтрокаВБ.Услуга) = Неопределено Тогда
				МассивТекУслуг.Добавить(СтрокаВБ.Услуга);	
			КонецЕсли; 	
		КонецЦикла; 
		КоллекцияТУ = ТекущийОбъект.Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиАбонента",IDСтроки));
	КонецЕсли; 
	
	Для Каждого ТекУслуга Из КоллекцияТУ Цикл
		
		Если Не ЗначениеЗаполнено(ТекУслуга.Услуга) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТекУслуга.Услуга.СоставнаяУслуга Тогда
			Для Каждого СостУслуга Из ТекУслуга.Услуга.СоставляющиеУслуг Цикл
				Если МассивТекУслуг.Найти(СостУслуга.Услуга) = Неопределено И МассивУслуг.Найти(СостУслуга.Услуга) = Неопределено Тогда
					МассивУслугДобавить.Добавить(СостУслуга.Услуга);
					МассивУслуг.Добавить(СостУслуга.Услуга);
				ИначеЕсли МассивУслуг.Найти(СостУслуга.Услуга) = Неопределено Тогда
					МассивУслуг.Добавить(СостУслуга.Услуга);
				КонецЕсли	
			КонецЦикла;			
		Иначе
			Если МассивТекУслуг.Найти(ТекУслуга.Услуга) = Неопределено И МассивУслуг.Найти(ТекУслуга.Услуга) = Неопределено Тогда
				МассивУслугДобавить.Добавить(ТекУслуга.Услуга);	
				МассивУслуг.Добавить(ТекУслуга.Услуга);
			ИначеЕсли МассивУслуг.Найти(ТекУслуга.Услуга) = Неопределено Тогда
				МассивУслуг.Добавить(ТекУслуга.Услуга);
			КонецЕсли;			
		КонецЕсли;
			
	КонецЦикла; 
	
	Для Каждого ТекУслуга Из МассивТекУслуг Цикл
		Если МассивУслуг.Найти(ТекУслуга) = Неопределено Тогда
			МассивУслугУдалить.Добавить(ТекУслуга);	
		КонецЕсли; 	
	КонецЦикла; 
	
	Для Каждого ТекУслуга Из МассивУслугУдалить Цикл
		Если IDСтроки = Неопределено Тогда
			СтрокиБлагоустройства = ТекущийОбъект.Объект.ЗначениеПлощадей.НайтиСтроки(Новый Структура("Услуга",ТекУслуга));
		Иначе
			СтрокиБлагоустройства = ТекущийОбъект.Объект.ЗначениеПлощадей.НайтиСтроки(Новый Структура("Услуга,IDСтрокиАбонента",ТекУслуга,IDСтроки));
		КонецЕсли; 
		
		Для Каждого ТекСтрока Из СтрокиБлагоустройства Цикл
			ТекущийОбъект.Объект.ЗначениеПлощадей.Удалить(ТекСтрока);	
		КонецЦикла; 
	КонецЦикла; 
	
	Для Каждого ТекУслуга Из МассивУслугДобавить Цикл
		НоваяСтрока = ТекущийОбъект.Объект.ЗначениеПлощадей.Добавить();
		НоваяСтрока.Услуга				= ТекУслуга;
		Если IDСтроки <> Неопределено Тогда
			НоваяСтрока.IDСтроки			= Новый УникальныйИдентификатор();
			НоваяСтрока.IDСтрокиАбонента    = IDСтроки;	
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидБлагоустройстваАбонента(ТекущийОбъект) Экспорт
	
	ТекущийОбъект.Объект.ВидыБлагоустройств.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ АктивныеТУ
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения
		|				И ТочкаУчета В
		|					(ВЫБРАТЬ
		|						АктивныеТУ.ТочкаУчета
		|					ИЗ
		|						АктивныеТУ КАК АктивныеТУ)) КАК энргУслугиТочекУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.ТочкаУчета КАК ТочкаУчета,
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВТ_Услуги.Услуга) КАК Услуга
		|ПОМЕСТИТЬ СоставныеУслуги
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО ВТ_Услуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВидБлагоустройствАбонентаСрезПоследних.Услуга КАК Услуга,
		|	энргВидБлагоустройствАбонентаСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройства
		|ПОМЕСТИТЬ ВТ_ВидыБлагоустройств
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения
		|				И Услуга В
		|					(ВЫБРАТЬ
		|						СоставныеУслуги.Услуга
		|					ИЗ
		|						СоставныеУслуги КАК СоставныеУслуги)) КАК энргВидБлагоустройствАбонентаСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВидБлагоустройствАбонентаСрезПоследних.Услуга,
		|	энргВидБлагоустройствАбонентаСрезПоследних.ВидБлагоустройства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВидыБлагоустройств.ВидБлагоустройства КАК ВидБлагоустройства,
		|	СоставныеУслуги.Услуга КАК Услуга
		|ИЗ
		|	АктивныеТУ КАК АктивныеТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоставныеУслуги КАК СоставныеУслуги
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыБлагоустройств КАК ВТ_ВидыБлагоустройств
		|			ПО СоставныеУслуги.Услуга = ВТ_ВидыБлагоустройств.Услуга
		|		ПО АктивныеТУ.ТочкаУчета = СоставныеУслуги.ТочкаУчета";
	
	Запрос.УстановитьПараметр("КлючПомещения"	, ТекущийОбъект.Объект.КлючПомещения);
	Запрос.УстановитьПараметр("Организация"		, ТекущийОбъект.Объект.Организация);
	Запрос.УстановитьПараметр("Период"			, новый Граница(ТекущийОбъект.Объект.Дата,ВидГраницы.Исключая));//ТекущийОбъект.Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("Район"			, ТекущийОбъект.Объект.Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ТекущийОбъект.Объект.ВидыБлагоустройств.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидБлагоустройстваМКД(ТекущийОбъект) Экспорт
	
	ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВидБлагоустройствМКДСрезПоследних.Услуга КАК Услуга,
		|	энргВидБлагоустройствМКДСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройстваОбщедомовой
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД) КАК энргВидБлагоустройствМКДСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВидБлагоустройствМКДСрезПоследних.Услуга,
		|	энргВидБлагоустройствМКДСрезПоследних.ВидБлагоустройства";
	
	Запрос.УстановитьПараметр("МКД"			, ТекущийОбъект.Объект.МКД);
	Запрос.УстановитьПараметр("Организация"	, ТекущийОбъект.Объект.Организация);
	Запрос.УстановитьПараметр("Период"		, новый Граница(ТекущийОбъект.Объект.Дата,ВидГраницы.Исключая));//Запрос.УстановитьПараметр("Период", ТекущийОбъект.Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("Район"		, ТекущийОбъект.Объект.Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГруппуПотребителейАбонентов(ТекущийОбъект) Экспорт
	
	ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ АктивныеТУ
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения
		|				И ТочкаУчета В
		|					(ВЫБРАТЬ
		|						АктивныеТУ.ТочкаУчета
		|					ИЗ
		|						АктивныеТУ КАК АктивныеТУ)) КАК энргУслугиТочекУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.ТочкаУчета КАК ТочкаУчета,
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВТ_Услуги.Услуга) КАК Услуга
		|ПОМЕСТИТЬ СоставныеУслуги
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО ВТ_Услуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргГруппыПотребителейАбонентовСрезПоследних.Услуга КАК Услуга,
		|	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей КАК ТарифнаяКатегория
		|ПОМЕСТИТЬ ВТ_ТарифныеКатегории
		|ИЗ
		|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения
		|				И Услуга В
		|					(ВЫБРАТЬ
		|						СоставныеУслуги.Услуга
		|					ИЗ
		|						СоставныеУслуги КАК СоставныеУслуги)) КАК энргГруппыПотребителейАбонентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставныеУслуги.Услуга КАК Услуга,
		|	ВТ_ТарифныеКатегории.ТарифнаяКатегория КАК ТарифнаяКатегория
		|ИЗ
		|	АктивныеТУ КАК АктивныеТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставныеУслуги КАК СоставныеУслуги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТарифныеКатегории КАК ВТ_ТарифныеКатегории
		|			ПО СоставныеУслуги.Услуга = ВТ_ТарифныеКатегории.Услуга
		|		ПО АктивныеТУ.ТочкаУчета = СоставныеУслуги.ТочкаУчета";
	
	Запрос.УстановитьПараметр("КлючПомещения"	, ТекущийОбъект.Объект.КлючПомещения);
	Запрос.УстановитьПараметр("Организация"		, ТекущийОбъект.Объект.Организация);
	Запрос.УстановитьПараметр("Период"			, новый Граница(ТекущийОбъект.Объект.Дата,ВидГраницы.Исключая));//ТекущийОбъект.Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("Район"			, ТекущийОбъект.Объект.Район);
	                                 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ТекущийОбъект.Объект.ВидыБлагоустройстваТарифныеКатегории.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
	КонецЦикла;

	
КонецПроцедуры
 
Функция ТочкиУчетаРазделенныхЛС(Период,Организация,Район,КлючПомещения,Услуга = Неопределено) Экспорт 
			
	Запрос = Новый Запрос;
	Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Строение КАК Строение,
		|	энргКлючиПомещений.Помещение КАК Помещение,
		|	энргПомещения.Ссылка КАК Комната
		|ПОМЕСТИТЬ КомнатыПомещения
		|ИЗ
		|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
		|		ПО энргКлючиПомещений.Помещение = энргПомещения.Родитель
		|			И энргКлючиПомещений.Строение = энргПомещения.Строение
		|ГДЕ
		|	энргКлючиПомещений.Ссылка = &КлючПомещения
		|	И энргПомещения.ТипПомещения = ЗНАЧЕНИЕ(Перечисление.энргТипыПомещений.Комната)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомнатыПомещения.Строение КАК Строение,
		|	КомнатыПомещения.Помещение КАК Помещение,
		|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения,
		|	КомнатыПомещения.Комната КАК Комната
		|ПОМЕСТИТЬ КлючиРазделенныхЛС
		|ИЗ
		|	КомнатыПомещения КАК КомнатыПомещения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
			|		ПО КомнатыПомещения.Строение = энргКлючиПомещений.Строение
		|			И КомнатыПомещения.Комната = энргКлючиПомещений.Помещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиРазделенныхЛС.Строение КАК Строение,
		|	КлючиРазделенныхЛС.Помещение КАК Помещение,
		|	КлючиРазделенныхЛС.КлючПомещения КАК КлючПомещения,
		|	КлючиРазделенныхЛС.Комната КАК Комната,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргАктивностьТочекУчетаСрезПоследних.Организация КАК Организация,
		|	энргАктивностьТочекУчетаСрезПоследних.Район КАК Район
		|ПОМЕСТИТЬ АктивныеТочкиУчетаАбонента
		|ИЗ
		|	КлючиРазделенныхЛС КАК КлючиРазделенныхЛС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И КлючПомещения В
		|						(ВЫБРАТЬ
		|							КлючиРазделенныхЛС.КлючПомещения
		|						ИЗ
		|							КлючиРазделенныхЛС)) КАК энргАктивностьТочекУчетаСрезПоследних
		|		ПО КлючиРазделенныхЛС.КлючПомещения = энргАктивностьТочекУчетаСрезПоследних.КлючПомещения
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние в (ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена),ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВладельцыТочекУчетаСрезПоследних.Организация КАК Организация,
		|	энргВладельцыТочекУчетаСрезПоследних.Район КАК Район,
		|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ТочкиУчетаАбонента
		|ИЗ
		|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета В
		|					(ВЫБРАТЬ
		|						АктивныеТочкиУчетаАбонента.ТочкаУчета
		|					ИЗ
		|						АктивныеТочкиУчетаАбонента)) КАК энргВладельцыТочекУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктивныеТочкиУчетаАбонента.Строение КАК Строение,
		|	АктивныеТочкиУчетаАбонента.Помещение КАК Помещение,
		|	АктивныеТочкиУчетаАбонента.Комната КАК Комната,
		|	ТочкиУчетаАбонента.ТочкаУчета КАК ТочкаУчета,
		|	АктивныеТочкиУчетаАбонента.КлючПомещения КАК КлючПомещения,
		|	АктивныеТочкиУчетаАбонента.Организация КАК Организация,
		|	АктивныеТочкиУчетаАбонента.Район КАК Район
		|ПОМЕСТИТЬ ДействующиеТочкиУчета
		|ИЗ
		|	АктивныеТочкиУчетаАбонента КАК АктивныеТочкиУчетаАбонента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
		|		ПО АктивныеТочкиУчетаАбонента.ТочкаУчета = ТочкиУчетаАбонента.ТочкаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДействующиеТочкиУчета.КлючПомещения КАК КлючПомещения,
		|	ДействующиеТочкиУчета.Строение КАК Строение,
		|	ДействующиеТочкиУчета.Комната КАК Помещение,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга,
		|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И КлючПомещения В
		|						(ВЫБРАТЬ
		|							ДействующиеТочкиУчета.КлючПомещения
		|						ИЗ
		|							ДействующиеТочкиУчета)) КАК энргУслугиТочекУчетаСрезПоследних
		|		ПО ДействующиеТочкиУчета.Организация = энргУслугиТочекУчетаСрезПоследних.Организация
		|			И ДействующиеТочкиУчета.Район = энргУслугиТочекУчетаСрезПоследних.Район
		|			И ДействующиеТочкиУчета.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
		|			И ДействующиеТочкиУчета.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета
		|ГДЕ
		|	энргУслугиТочекУчетаСрезПоследних.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Период",					КонецДня(Период));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("КлючПомещения",			КлючПомещения);
	Запрос.УстановитьПараметр("Услуга",					Услуга);
	

	
	Если Не ЗначениеЗаполнено(Услуга) Тогда
		Текст 						= СтрЗаменить(Текст,"ГДЕ
		|	энргУслугиТочекУчетаСрезПоследних.Услуга = &Услуга","");
	КонецЕсли;
	
	Запрос.Текст = Текст;
	
	Результат  = Запрос.Выполнить();
	Возврат Результат;

КонецФункции

Функция ЗаполнитьПлощадьМКД(Период, Организация, Район, Строение = Неопределено, ВидПлощади = Неопределено, Услуга = Неопределено) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВладельцыТочекУчетаСрезПоследних.Организация КАК Организация,
		|	энргВладельцыТочекУчетаСрезПоследних.Район КАК Район,
		|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец КАК МКД,
		|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ТочкиУчетаМКД
		|ИЗ
		|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район) КАК энргВладельцыТочекУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
		|		ПО энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета = энргТочкиУчета.Ссылка
		|ГДЕ
		|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец = &МКД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктивностьТочекУчета.Организация КАК Организация,
		|	АктивностьТочекУчета.Район КАК Район,
		|	АктивностьТочекУчета.МКД КАК МКД,
		|	АктивностьТочекУчета.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ДействующиеТочкиМКД
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
		|			&Период,
		|			(Организация, Район, МКД, ТочкаУчета) В
		|				(ВЫБРАТЬ
		|					ТочкиУчетаМКД.Организация,
		|					ТочкиУчетаМКД.Район,
		|					ТочкиУчетаМКД.МКД,
		|					ТочкиУчетаМКД.ТочкаУчета
		|				ИЗ
		|					ТочкиУчетаМКД КАК ТочкиУчетаМКД)) КАК АктивностьТочекУчета
		|ГДЕ
		|	АктивностьТочекУчета.Состояние = ЗНАЧЕНИЕ(ПЕречисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УслугиТочекУчетаМКДСрезПоследних.Организация КАК Организация,
		|	УслугиТочекУчетаМКДСрезПоследних.Район КАК Район,
		|	УслугиТочекУчетаМКДСрезПоследних.МКД КАК МКД,
		|	УслугиТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	ВЫБОР
		|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
		|			ТОГДА УслугиТочекУчетаМКДСрезПоследних.Услуга
		|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
		|	КОНЕЦ КАК Услуга
		|ПОМЕСТИТЬ УслугиДействующихТочек
		|ИЗ
		|	РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И (Организация, Район, МКД, ТочкаУчета) В
		|					(ВЫБРАТЬ
		|						ДействующиеТочкиМКД.Организация,
		|						ДействующиеТочкиМКД.Район,
		|						ДействующиеТочкиМКД.МКД,
		|						ДействующиеТочкиМКД.ТочкаУчета
		|					ИЗ
		|						ДействующиеТочкиМКД КАК ДействующиеТочкиМКД)) КАК УслугиТочекУчетаМКДСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО УслугиТочекУчетаМКДСрезПоследних.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначениеПлощадейМКДСрезПоследних.Организация КАК Организация,
		|	энргЗначениеПлощадейМКДСрезПоследних.Район КАК Район,
		|	энргЗначениеПлощадейМКДСрезПоследних.МКД КАК МКД,
		|	энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади КАК ВидПлощади,
		|	энргЗначениеПлощадейМКДСрезПоследних.Услуга КАК Услуга,
		|	энргЗначениеПлощадейМКДСрезПоследних.Площадь КАК Площадь
		|ИЗ
		|	РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
		|			&Период,
		|			(Организация, Район, Услуга) В
		|					(ВЫБРАТЬ
		|						УслугиДействующихТочек.Организация КАК Организация,
		|						УслугиДействующихТочек.Район КАК Район,
		|						УслугиДействующихТочек.Услуга КАК Услуга
		|					ИЗ
		|						УслугиДействующихТочек КАК УслугиДействующихТочек)
		|				И Организация = &Организация
		|				И Район = &Район
		|				И МКД = &Строение) КАК энргЗначениеПлощадейМКДСрезПоследних
		|ГДЕ
		|	энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(перечисление.энргВидыПлощадей.ПлощадьМОП)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргЗначениеПлощадейМКДСрезПоследних.Организация,
		|	энргЗначениеПлощадейМКДСрезПоследних.Район,
		|	энргЗначениеПлощадейМКДСрезПоследних.МКД,
		|	энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади,
		|	энргЗначениеПлощадейМКДСрезПоследних.Услуга,
		|	энргЗначениеПлощадейМКДСрезПоследних.Площадь
		|ИЗ
		|	РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &Строение) КАК энргЗначениеПлощадейМКДСрезПоследних
		|ГДЕ
		|	энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД)";
	
	Запрос.УстановитьПараметр("МКД", Строение);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Строение", Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
		
	
КонецФункции

Процедура ИзменитьТипСтроения(Строение, ТипСтроения, НеПроверятьНаличиеФайла = Неопределено) Экспорт
	СтроениеОбъект = Строение.ПолучитьОбъект();
	Если не НеПроверятьНаличиеФайла = Неопределено  Тогда
		СтроениеОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеФайла", НеПроверятьНаличиеФайла);
	КонецЕсли;
	СтроениеОбъект.ТипСтроения = ТипСтроения; 	
	СтроениеОбъект.Записать();		
КонецПроцедуры


Процедура ЗаполнитьСхемуДанныхНаГраницуВремени(Схема, ПараметрыОтбора) Экспорт 
	
	#Область ДатаСостоянияЛицевогоСчета
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(Схема, ПараметрыОтбора, "СостояниеЛицевогоСчета");  
	#КонецОбласти
	
	#Область ВидБлагоустройства
	// ВТ - УслугиДействующихТочек
	РегистрыСведений.энргВидБлагоустройствАбонента.ВидБлагоустройстваДействующихТочек(Схема, ПараметрыОтбора, "ВидБлагоустройствАбонента");  
	#КонецОбласти
	
	#Область ЗначенияПлощадей
	РегистрыСведений.энргЗначенияПлощадей.ЗначенияПлощадейПомещений(Схема, ПараметрыОтбора, "ЗначенияПлощадейПомещений");
	#КонецОбласти
	
	#Область КоличествоКомнат
	РегистрыСведений.энргКоличествоКомнат.ТекстСрезПоследних(Схема, ПараметрыОтбора, "КоличествоКомнат");
	#КонецОбласти
	
	#Область КоличествоПроживающих
	РегистрыСведений.энргКоличествоПроживающих.КоличествоПроживающихПомещения(Схема, ПараметрыОтбора, "КоличествоПроживающихПомещения");
	#КонецОбласти
	
	#Область КоличествоПрописанных
	РегистрыСведений.энргКоличествоПрописанных.КоличествоПрописанныхПомещения(Схема, ПараметрыОтбора, "КоличествоПрописанныхПомещения");
	#КонецОбласти 	
	
	#Область КоличествоСобственников
	РегистрыСведений.энргКоличествоСобственников.КоличествоСобственниковПомещения(Схема, ПараметрыОтбора, "КоличествоСобственниковПомещения");
	#КонецОбласти	
	
	#Область КоличествоЭтажей
	// Дополнить схемой этажности
	#КонецОбласти
	
	#Область КоэффициентПУ
	РегистрыСведений.энргКоэффциентыПриборовУчета.КоэффциентыПриборовУчета(Схема, ПараметрыОтбора, "КоэффциентыПриборовУчета");
	#КонецОбласти
	
	#Область НаправлениеИспользованияТочекУчета
	// ВТ - ДействующиеТочки
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема, ПараметрыОтбора, "НаправлениеИспользованияДействующихТочек");
	#КонецОбласти
	
	#Область ЗначенияИзмерителей
	// ВТ - ДействующиеТочки
	РегистрыСведений.энргЗначенияИзмерителейТочекУчета.ЗначенияИзмерителейТочекУчетаДействующихТочек(Схема, ПараметрыОтбора, "ЗначенияИзмерителейТочекУчетаДействующихТочек");
	#КонецОбласти
	
	#Область энргТехническаяВозможностьУстановкиПУ
	// ВТ - ДействующиеТочки
	РегистрыСведений.энргТехническаяВозможностьУстановкиПУ.ТехническаяВозможностьУстановкиПУТочекУчета(Схема, ПараметрыОтбора, "ТехническаяВозможностьУстановкиПУТочекУчета");
	#КонецОбласти
	
	#Область ГруппаПотребителей
	РегистрыСведений.энргГруппыПотребителейАбонентов.ГруппыПотребителейАбонентов(Схема, ПараметрыОтбора, "ГруппыПотребителейАбонентов");
	#КонецОбласти
	
	#Область СвойствоТехническаяТочкиУчета
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема, ПараметрыОтбора, "СвойствоТехническаяТочкиУчета"); 
	#КонецОбласти	 
	
	#Область Жильцы
	//РегистрыСведений.энргПроживаниеЖильцов.(Схема, ПараметрыОтбора, "СвойствоТехническаяТочкиУчета"); 
	#КонецОбласти 
	
	#Область ОтключатьВНеполивнойСезон
	РегистрыСведений.энргАбонентыОтключаемыеВНеполивнойСезон.АбонентыОтключаемыеВНеполивнойСезон(Схема, ПараметрыОтбора, "АбонентыОтключаемыеВНеполивнойСезон"); 
	#КонецОбласти 	
	
	#Область Потери
	РегистрыСведений.энргЗначенияПотерь.АктуальныеЗначенияПотерь(Схема, ПараметрыОтбора, "АктуальныеЗначенияПотерь"); 
	#КонецОбласти
	
	#Область ПоставщикиУслуг
	РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиУслугАбонента(Схема, ПараметрыОтбора, "ПоставщикиУслугАбонента"); 
	#КонецОбласти
	
	#Область СпособРаспределенияОбъемаПомещения
	РегистрыСведений.энргСпособыРаспределенияОбъемаПомещения.АктуальныеСпособыРаспределенияОбъемаПомещения(Схема, ПараметрыОтбора, "АктуальныеСпособыРаспределенияОбъемаПомещения"); 
	#КонецОбласти
	
	#Область ТочкаУчетаРодитель
	РегистрыСведений.энргРодительТочкиУчета.АктуальныеРодителиТочекУчета(Схема, ПараметрыОтбора, "АктуальныеРодителиТочекУчета"); 
	#КонецОбласти
	
КонецПроцедуры

Функция ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницу(Схема, Шаблон, ИмяОсновнойТаблицы = "УслугиДействующихТочек") Экспорт 
	ПараметрыОтбора = "";
	
	ПоляСоединения = Новый Структура;
	ПоляСоединения.Вставить("Организация"	, "Организация");
	ПоляСоединения.Вставить("Район"			, "Район");
	ПоляСоединения.Вставить("КлючПомещения"	, "КлючПомещения");
	
	ВыбираемыеПоля 		= Новый Массив;
	МассивСоединений 	= Новый Массив;
	
	#Область ДатаСостоянияЛицевогоСчета
	ВыбираемыеПоля.Добавить("СостояниеЛицевогоСчета.Период КАК ДатаСостоянияЛицевогоСчета");
	ПоляСоединения.Удалить("КлючПомещения");
	ПоляСоединения.Вставить("Абонент"	, "Абонент");	
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "СостояниеЛицевогоСчета", ПоляСоединения);
	ПоляСоединения.Удалить("Абонент");
	ПоляСоединения.Вставить("КлючПомещения"	, "КлючПомещения");
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	#Область ВидБлагоустройства
	ВыбираемыеПоля.Добавить("ВидБлагоустройствАбонента.ВидБлагоустройства КАК ВидБлагоустройства");
	ПоляСоединения.Вставить("Услуга"	, "Услуга");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "ВидБлагоустройствАбонента", ПоляСоединения);
	ПоляСоединения.Удалить("Услуга");
	МассивСоединений.Добавить(Результат);
	#КонецОбласти 	
	
	#Область КоличествоКомнат
	ВыбираемыеПоля.Добавить("КоличествоКомнат.Количество КАК КоличествоКомнат");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "КоличествоКомнат", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	#Область КоличествоПроживающих
	ВыбираемыеПоля.Добавить("КоличествоПроживающихПомещения.Количество КАК КоличествоПроживающих");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "КоличествоПроживающихПомещения", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	#Область КоличествоПрописанных
	ВыбираемыеПоля.Добавить("КоличествоПрописанныхПомещения.Количество КАК КоличествоПрописанных");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "КоличествоПрописанныхПомещения", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти 	
	
	#Область КоличествоСобственников
	ВыбираемыеПоля.Добавить("КоличествоСобственниковПомещения.Количество КАК КоличествоСобственников");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "КоличествоСобственниковПомещения", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти	
	
	#Область КоличествоЭтажей
	// Дополнить схемой этажности
	#КонецОбласти
	
	#Область КоэффициентПУ
	ВыбираемыеПоля.Добавить("КоэффциентыПриборовУчета.Коэффициент КАК КоэффициентПУ");
	ПоляСоединения.Вставить("ПриборУчета"	, "ПриборУчета");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "КоэффциентыПриборовУчета", ПоляСоединения);
	ПоляСоединения.Удалить("ПриборУчета");
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	#Область НаправлениеИспользованияТочекУчета
	ВыбираемыеПоля.Добавить("НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ");
	ПоляСоединения.Вставить("ТочкаУчета"	, "ТочкаУчета");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "НаправлениеИспользованияДействующихТочек", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	#Область энргТехническаяВозможностьУстановкиПУ
	ВыбираемыеПоля.Добавить("ТехническаяВозможностьУстановкиПУТочекУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ");
	ВыбираемыеПоля.Добавить("ТехническаяВозможностьУстановкиПУТочекУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "ТехническаяВозможностьУстановкиПУТочекУчета", ПоляСоединения);	
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	#Область СвойствоТехническаяТочкиУчета
	ВыбираемыеПоля.Добавить("СвойствоТехническаяТочкиУчета.Техническая КАК Техническая");
	ПоляСоединения.Вставить("Услуга"	, "Услуга");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "СвойствоТехническаяТочкиУчета", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти 	
	
	#Область СпособРаспределенияОбъемаПомещения 
	ВыбираемыеПоля.Добавить("АктуальныеСпособыРаспределенияОбъемаПомещения.СпособРаспределения КАК СпособРаспределения");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "АктуальныеСпособыРаспределенияОбъемаПомещения", ПоляСоединения);
	ПоляСоединения.Удалить("Услуга");	
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
		
	#Область ТочкаУчетаРодитель
	ВыбираемыеПоля.Добавить("АктуальныеРодителиТочекУчета.РодительТочкиУчета КАК РодительТочкиУчета");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "АктуальныеРодителиТочекУчета", ПоляСоединения);
	ПоляСоединения.Удалить("ТочкаУчета");
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	#Область ГруппаПотребителей
	ВыбираемыеПоля.Добавить("ГруппыПотребителейАбонентов.ГруппаПотребителей КАК ГруппаПотребителей");
	ПоляСоединения.Вставить("Услуга"	, "Услуга");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "ГруппыПотребителейАбонентов", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	
	#Область ОтключатьВНеполивнойСезон
	ПоляСоединения.Вставить("Абонент"		, "Абонент");
	ПоляСоединения.Вставить("ТочкаУчета"	, "ТочкаУчета");
	ПоляСоединения.Удалить("КлючПомещения");
	ВыбираемыеПоля.Добавить("АбонентыОтключаемыеВНеполивнойСезон.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон");
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "АбонентыОтключаемыеВНеполивнойСезон", ПоляСоединения); 	
	ПоляСоединения.Вставить("КлючПомещения"	, "КлючПомещения");
	ПоляСоединения.Удалить("Абонент");
	ПоляСоединения.Удалить("ТочкаУчета");
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	Возврат Новый Структура("ВыбираемыеПоля, МассивСоединений", ВыбираемыеПоля, МассивСоединений);	 
	
	//#Область Жильцы
	////РегистрыСведений.энргПроживаниеЖильцов.(Схема, ПараметрыОтбора, "СвойствоТехническаяТочкиУчета"); 
	//#КонецОбласти 
	//
	// 	
	//
	//#Область Потери
	//РегистрыСведений.энргЗначенияПотерь.АктуальныеЗначенияПотерь(Схема, ПараметрыОтбора, "АктуальныеЗначенияПотерь"); 
	//#КонецОбласти
	//
	//#Область ЗначенияПлощадей
	//ВыбираемыеПоля.Добавить("ЗначенияПлощадейПомещений.ВидПлощади КАК ВидПлощади");
	//ВыбираемыеПоля.Добавить("ЗначенияПлощадейПомещений.Площадь КАК Площадь");
	//Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "ЗначенияПлощадейПомещений", ПоляСоединения);
	//МассивСоединений.Добавить(Результат);
	//#КонецОбласти
	//
	//#Область ПоставщикиУслуг
	//РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиУслугАбонента(Схема, ПараметрыОтбора, "ПоставщикиУслугАбонента"); 
	//#КонецОбласти 
	
КонецФункции

Функция ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницуПотери(ИмяОсновнойТаблицы = "УслугиДействующихТочек") Экспорт 
	ПоляСоединения = Новый Структура;
	ПоляСоединения.Вставить("Организация"	, "Организация");
	ПоляСоединения.Вставить("Район"			, "Район");
	ПоляСоединения.Вставить("КлючПомещения"	, "КлючПомещения");
	ПоляСоединения.Вставить("ТочкаУчета"	, "ТочкаУчета");
	
	ВыбираемыеПоля 		= Новый Массив;
	МассивСоединений 	= Новый Массив;
	
	#Область Потери
	ВыбираемыеПоля.Добавить("АктуальныеЗначенияПотерь.ВидПотерь КАК ВидПотерь");	
	ВыбираемыеПоля.Добавить("АктуальныеЗначенияПотерь.СпособРасчетаПотерь КАК СпособРасчетаПотерь");	
	ВыбираемыеПоля.Добавить("ЕСТЬNULL(АктуальныеЗначенияПотерь.Значение,0) КАК Значение");	
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "АктуальныеЗначенияПотерь", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	Возврат Новый Структура("ВыбираемыеПоля, МассивСоединений", ВыбираемыеПоля, МассивСоединений);	
КонецФункции 

Функция ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницуЗначениеПлощадей(ИмяОсновнойТаблицы = "УслугиДействующихТочек") Экспорт 
	ПоляСоединения = Новый Структура;
	ПоляСоединения.Вставить("Организация"	, "Организация");
	ПоляСоединения.Вставить("Район"			, "Район");
	ПоляСоединения.Вставить("КлючПомещения"	, "КлючПомещения");
	
	ВыбираемыеПоля 		= Новый Массив;
	МассивСоединений 	= Новый Массив;
	
	#Область ЗначенияПлощадей
	ВыбираемыеПоля.Добавить("ЕСТЬNULL(ЗначенияПлощадейПомещений.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади");	
	ВыбираемыеПоля.Добавить("ЗначенияПлощадейПомещений.Площадь КАК Площадь");	
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "ЗначенияПлощадейПомещений", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	Возврат Новый Структура("ВыбираемыеПоля, МассивСоединений", ВыбираемыеПоля, МассивСоединений);	
КонецФункции

Функция ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницуЗначенияИзмерителей(ИмяОсновнойТаблицы = "УслугиДействующихТочек") Экспорт 
	ПоляСоединения = Новый Структура;
	ПоляСоединения.Вставить("Организация"	, "Организация");
	ПоляСоединения.Вставить("Район"			, "Район");
	ПоляСоединения.Вставить("КлючПомещения"	, "КлючПомещения");
	ПоляСоединения.Вставить("ТочкаУчета"	, "ТочкаУчета");
	
	ВыбираемыеПоля 		= Новый Массив;
	МассивСоединений 	= Новый Массив;
		
	#Область ЗначенияИзмерителей
	ВыбираемыеПоля.Добавить("ЗначенияИзмерителейТочекУчетаДействующихТочек.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ");	
	ВыбираемыеПоля.Добавить("ЕСТЬNULL(ЗначенияИзмерителейТочекУчетаДействующихТочек.Значение,0) КАК Значение");	
	Результат = ПолучитьСтрокиСоединенияЗапроса(ИмяОсновнойТаблицы, "ЗначенияИзмерителейТочекУчетаДействующихТочек", ПоляСоединения);
	МассивСоединений.Добавить(Результат);
	#КонецОбласти
	
	Возврат Новый Структура("ВыбираемыеПоля, МассивСоединений", ВыбираемыеПоля, МассивСоединений);	
КонецФункции

Функция ПолучитьСтрокиСоединенияЗапроса(ОсновнаяТаблица, СоединяемаяТаблица, СтруктураСоединения, ТипСоединения = "ЛЕВОЕ")
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(СтрШаблон(ТипСоединения + " СОЕДИНЕНИЕ %1 КАК %1", СоединяемаяТаблица));
	
	Союз 				= "ПО ";
	ШаблонСоединения 	= "%1.%2 = %3.%4";
	Для Каждого ТекКлючЗначение из СтруктураСоединения Цикл
		СтрокаСоединения = СтрШаблон(ШаблонСоединения, ОсновнаяТаблица, ТекКлючЗначение.Ключ, СоединяемаяТаблица, ТекКлючЗначение.Значение);
		МассивСтрок.Добавить(Союз + СтрокаСоединения);
		
		Союз = "И ";
	КонецЦикла;
	
	Возврат СтрСоединить(МассивСтрок, Символы.ПС);
КонецФункции

Функция РезультатЗапросаВременноеОтсутствиеАбонента(Дата, Абонент) Экспорт
	
	РезультатЗапроса = Документы.энргРегистрацияВременногоОтсутствия.ПолучитьДокументСрезПоследнего(Абонент, Дата);
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеСвойствАбонента

Процедура ЗаполнитьСвойствоКоличествоКомнат(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  									= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПолучаемыеСвойства.КоличествоКомнат 	= Выборка.Количество;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоКоличествоПрописанных(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  									= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПолучаемыеСвойства.КоличествоПрописанных 	= Выборка.Количество;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоКоличествоПроживающих(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  									= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПолучаемыеСвойства.КоличествоПроживающих 	= Выборка.Количество;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоКоличествоСобственников(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  									= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПолучаемыеСвойства.КоличествоСобственников 	= Выборка.Количество;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоВидБлагоустройства(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  								= РезультатЗапроса.Выбрать();
	ВидыБлагоустройства 					= Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		 ВидыБлагоустройства.Вставить(Выборка.Услуга, Выборка.ВидБлагоустройства);
	КонецЦикла;
		
	 ПолучаемыеСвойства.ВидБлагоустройства	= ВидыБлагоустройства;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоЗначенияПлощадей(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	ЗначенияПлощадей 					= Новый Соответствие();
	Выборка  							= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		  ЗначенияПлощадей.Вставить(Выборка.ВидПлощади, Выборка.Значение);
	КонецЦикла;
	
	ПолучаемыеСвойства.ЗначенияПлощадей = ЗначенияПлощадей;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоГруппаПотребителей(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  								= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПолучаемыеСвойства.ГруппаПотребителей 	= Выборка.ГруппаПотребителей;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоДанныеСостоянияЛС(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  												= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ОписаниеСостояния  						= Новый Структура("СостояниеЛС, ДатаСостоянияЛС", Выборка.СостояниеЛС, Выборка.ДатаСостоянияЛС);	
	ПолучаемыеСвойства.ДанныеСостоянияЛС 	= ОписаниеСостояния;
		
КонецПроцедуры

Процедура ЗаполнитьСвойствоДанныеКонтроллера(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Выборка 								= РезультатЗапроса.Выбрать();
	Выборка.следующий();
	ДанныеКонтроллера 						= Новый Структура;
	ДанныеКонтроллера.Вставить("Контроллер", 	Выборка.Контроллер);
	ДанныеКонтроллера.Вставить("Маршрут", 		Выборка.Маршрут);
	ПолучаемыеСвойства.ДанныеКонтроллера 	= ДанныеКонтроллера;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоДанныеДоговора(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоЖильцы(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоЖильцыОтключатьВНеполивнойСезон(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоЭтажностьГодПостройки(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	Выборка  							= РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПолучаемыеСвойства, Выборка);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСвойствоТипПомещения(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  							= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПолучаемыеСвойства.ТипПомещения 	= Выборка.ТипПомещения;

КонецПроцедуры

Процедура ЗаполнитьСвойствоКлючПомещенияРодителя(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  							= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ПолучаемыеСвойства.КлючПомещенияРодителя 	= Выборка.КлючПомещенияРодителя;

КонецПроцедуры

Процедура ЗаполнитьСвойствоРайонПриЧтении(КоллекцияАбонентов, ТекущийОбъект) Экспорт 
	
	ТаблицаАбонентов	= ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("Абонент");  	
	СвойстваАбонентов 	= ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТаблицаАбонентов,"Район");
	
	Для Каждого ТекСтрока Из КоллекцияАбонентов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Абонент) Тогда
			ТекСтрока.Район 	= СвойстваАбонентов[ТекСтрока.Абонент];
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСвойстваАбонентовПриЧтении(КоллекцияАбонентов, ТЧТекущийОбъект, Свойства) Экспорт 
	
	ТаблицаАбонентов	= ТЧТекущийОбъект.Выгрузить().ВыгрузитьКолонку("Абонент");  	
	СвойстваАбонентов 	= ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ТаблицаАбонентов,Свойства);
	
	Для Каждого ТекСтрока Из КоллекцияАбонентов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Абонент) Тогда
			ЗаполнитьЗначенияСвойств(ТекСтрока,СвойстваАбонентов[ТекСтрока.Абонент]);
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСвойствоЖильцыЛьготныхКатегорий(ПолучаемыеСвойства, РезультатЗапроса) Экспорт 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка  												= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ОписаниеСостояния  										= Новый Структура("СостояниеЛьготника, ДатаСостоянияЛьготника", Выборка.Состояние, Выборка.ДатаСостояния);	
	ПолучаемыеСвойства.ДанныеОЛьготниках 					= ОписаниеСостояния;
		
КонецПроцедуры

Функция ЗаполняемыеСвойстваАбонентаПоУмолчанию() Экспорт 
	Возврат "Абонент,Район,КлючПомещения,Строение,Помещение,ЧастныйСектор,ЛицевойСчет,АдресОбъекта,ПериодНачисления,Организация,ГруппаАбонента,МКД,Филиал";
КонецФункции

#КонецОбласти

Функция ПолучитьДлинуЛС(Дата, Организация) Экспорт
	ДлинаЛС	= 14;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация); 
	Запрос.УстановитьПараметр("Дата",Дата);
	ЗАпрос.Текст = 
	"ВЫБРАТЬ
	|	ДлинаЛицевогоСчетаСрезПоследних.ДлинаЛС КАК ДлинаЛС
	|ИЗ
	|	РегистрСведений.энргДлинаЛицевогоСчета.СрезПоследних(&Дата, Организация = &Организация) КАК ДлинаЛицевогоСчетаСрезПоследних";
	Результат 	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	Выборка.Следующий();
	
	ДлинаЛС = Выборка.ДлинаЛС;
	
	Возврат ДлинаЛС;
КонецФункции

Функция ПолучитьСписокАбонентовМКДСПостановлениями(ДанныеШапки) Экспорт
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 			ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("Район", 					ДанныеШапки.Район);
	Запрос.УстановитьПараметр("МКД", 					ДанныеШапки.МКД);
	Запрос.УстановитьПараметр("Дата", 					ДанныеШапки.Дата);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ЕСТЬNULL(бестРабочиеПостановленияАбонентовСрезПоследних.Постановление, ЗНАЧЕНИЕ(Перечисление.бестРабочиеПостановления.ПустаяСсылка)) КАК Постановление
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргАбоненты.Ссылка КАК Абонент
	|	ИЗ
	|		Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|				И (энргКлючиПомещений.Строение = &МКД)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРабочиеПостановленияАбонентов.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестРабочиеПостановленияАбонентовСрезПоследних
	|		ПО ВложенныйЗапрос.Абонент = бестРабочиеПостановленияАбонентовСрезПоследних.Абонент";
	Результат 		= Запрос.Выполнить();
	Выгрузка		= Результат.Выбрать();
	
	Возврат Выгрузка;
КонецФункции

Процедура ПолучитьДанныеОДокументеФизЛица(ДатаЗапроса, ФизЛицо, ВидДокумента, Свойство, ПолучаемыеСвойства) Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Дата",			ДатаЗапроса);
	Запрос.УстановитьПараметр("Контрагент",		ФизЛицо);
	Запрос.УстановитьПараметр("ВидДокумента",	ВидДокумента);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	бестДокументыФизическихЛицСрезПоследних.Период КАК Период,
	|	бестДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	бестДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	бестДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	бестДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
	|	бестДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
	|	бестДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
	|	бестДокументыФизическихЛицСрезПоследних.ЯвляетсяДокументомУдостоверяющимЛичность КАК ЯвляетсяДокументомУдостоверяющимЛичность,
	|	бестДокументыФизическихЛицСрезПоследних.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.энргДокументыФизическихЛиц.СрезПоследних(
	|			&Дата,
	|			Контрагент = &Контрагент
	|				И ВидДокумента = &ВидДокумента) КАК бестДокументыФизическихЛицСрезПоследних";
	Результат  	= Запрос.Выполнить();
	Выборка  	= Результат.Выбрать();
	
	СтруктураДанных	= Новый Структура;
	для Каждого КолонкаРезультата из Результат.Колонки цикл
		СтруктураДанных.Вставить(КолонкаРезультата.Имя, "");	
	КонецЦикла;	
		
	Если Выборка.Следующий() тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных,Выборка);
	КонецЕсли;
	
	ПолучаемыеСвойства[Свойство] = СтруктураДанных;
КонецПроцедуры

Функция ДанныеДляОплатыАбонента(Период, Организация, Район, МКД, Абонент, ДополнительныеПараметры = Неопределено) Экспорт 
	ПериодОплатыНачало 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПериодОплатыНачало", Дата(1,1,1));
	ПериодОплатыКонец 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПериодОплатыКонец", Дата(1,1,1));		 
	
	Запрос   			= Новый Запрос;
	Запрос.УстановитьПараметр("Период" ,			Период);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				МКД);
	Запрос.УстановитьПараметр("Абонент",			Абонент);
	Запрос.УстановитьПараметр("ДатаНачала",			ПериодОплатыНачало);
	Запрос.УстановитьПараметр("ДатаКонца",			ПериодОплатыКонец);	
	Запрос.УстановитьПараметр("ТекДата",			ТекущаяДатаСеанса());
	
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг) КАК ВидЗадолженности,
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК Задолженность,
	|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ТекущиеОстатки
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргВзаиморасчетыПоМесяцамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления,
	|	энргВзаиморасчетыПоПениОстатки.Услуга,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня),
	|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргВзаиморасчетыПоПениОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗабалансоваяЗадолженностьОстатки.ПериодНачисления,
	|	энргЗабалансоваяЗадолженностьОстатки.Услуга,
	|	энргЗабалансоваяЗадолженностьОстатки.ВидЗадолженности,
	|	энргЗабалансоваяЗадолженностьОстатки.СуммаЗадолженностиОстаток,
	|	энргЗабалансоваяЗадолженностьОстатки.Поставщик
	|ИЗ
	|	РегистрНакопления.энргЗабалансоваяЗадолженность.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))
	|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргЗабалансоваяЗадолженностьОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргРеструктуризацияДолгаСрезПоследних.Организация КАК Организация,
	|	энргРеструктуризацияДолгаСрезПоследних.Район КАК Район,
	|	энргРеструктуризацияДолгаСрезПоследних.Строение КАК Строение,
	|	энргРеструктуризацияДолгаСрезПоследних.Абонент КАК Абонент,
	|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты КАК ДатаОплаты,
	|	энргРеструктуризацияДолгаСрезПоследних.Документ КАК Документ,
	|	СУММА(ВЫБОР
	|			КОГДА энргВзаиморасчеты.ВидДвижения ЕСТЬ NULL
	|				ТОГДА 0
	|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА энргВзаиморасчеты.Сумма
	|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И энргВзаиморасчеты.Сумма < 0
	|				ТОГДА -энргВзаиморасчеты.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая КАК СуммаОбщая
	|ПОМЕСТИТЬ Реструктуризация
	|ИЗ
	|	РегистрСведений.энргРеструктуризацияДолга.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Строение = &МКД
	|				И Абонент = &Абонент) КАК энргРеструктуризацияДолгаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
	|		ПО энргРеструктуризацияДолгаСрезПоследних.Организация = энргВзаиморасчеты.Организация
	|			И энргРеструктуризацияДолгаСрезПоследних.Район = энргВзаиморасчеты.Район
	|			И энргРеструктуризацияДолгаСрезПоследних.Строение = энргВзаиморасчеты.МКД
	|			И энргРеструктуризацияДолгаСрезПоследних.Абонент = энргВзаиморасчеты.Абонент
	|			И энргРеструктуризацияДолгаСрезПоследних.ДатаНачала <= энргВзаиморасчеты.Период
	|			И энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты >= энргВзаиморасчеты.Период
	|ГДЕ
	|	энргРеструктуризацияДолгаСрезПоследних.ДатаПредыдущегоЭтапа <= &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	энргРеструктуризацияДолгаСрезПоследних.Организация,
	|	энргРеструктуризацияДолгаСрезПоследних.Район,
	|	энргРеструктуризацияДолгаСрезПоследних.Строение,
	|	энргРеструктуризацияДолгаСрезПоследних.Абонент,
	|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты,
	|	энргРеструктуризацияДолгаСрезПоследних.Документ,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реструктуризация.Документ КАК Документ,
	|	Реструктуризация.СуммаОбщая КАК СуммаОбщая,
	|	МИНИМУМ(Реструктуризация.Сумма >= Реструктуризация.СуммаНарастающимИтогом) КАК ОтметкаВыполненного
	|ПОМЕСТИТЬ ВыполненныеРеструктуризации
	|ИЗ
	|	Реструктуризация КАК Реструктуризация
	|
	|СГРУППИРОВАТЬ ПО
	|	Реструктуризация.Документ,
	|	Реструктуризация.СуммаОбщая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Услуга КАК Услуга,
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Поставщик КАК Поставщик,
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.СуммаЗадолженностиКонечныйОстаток КАК Задолженность
	|ПОМЕСТИТЬ СуммыЗабаланса
	|ИЗ
	|	РегистрНакопления.энргЗабалансоваяЗадолженность.ОстаткиИОбороты(
	|			,
	|			&Период,
	|			Регистратор,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))
	|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргЗабалансоваяЗадолженностьОстаткиИОбороты
	|ГДЕ
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Регистратор В
	|			(ВЫБРАТЬ
	|				ВыполненныеРеструктуризации.Документ
	|			ИЗ
	|				ВыполненныеРеструктуризации КАК ВыполненныеРеструктуризации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеОстатки.ПериодНачисления КАК ПериодНачисления,
	|	ТекущиеОстатки.Услуга КАК Услуга,
	|	ТекущиеОстатки.ВидЗадолженности КАК ВидЗадолженности,
	|	ТекущиеОстатки.Задолженность - ЕСТЬNULL(СуммыЗабаланса.Задолженность, 0) КАК Задолженность,
	|	ТекущиеОстатки.Поставщик КАК Поставщик
	|ИЗ
	|	ТекущиеОстатки КАК ТекущиеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыЗабаланса КАК СуммыЗабаланса
	|		ПО ТекущиеОстатки.ПериодНачисления = СуммыЗабаланса.ПериодНачисления
	|			И ТекущиеОстатки.Услуга = СуммыЗабаланса.Услуга
	|			И ТекущиеОстатки.Поставщик = СуммыЗабаланса.Поставщик
	|			И (ТекущиеОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг))
	|ГДЕ
	|	ТекущиеОстатки.Задолженность - ЕСТЬNULL(СуммыЗабаланса.Задолженность, 0) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления"; 
	
	Если НЕ ЗначениеЗаполнено(ПериодОплатыНачало) и НЕ ЗначениеЗаполнено(ПериодОплатыКонец) Тогда
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)", "");
	КонецЕсли;
	
	Результат  		= Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

Функция ПолучитьАктуальныйСпособДоставкиКвитанции(Период, Организация, Район, КлючПомещения, Абонент) Экспорт	
	Схема 			= Новый СхемаЗапроса;  	
	ПараметрыВТ 	= Новый Массив;
	
	ПараметрТипРавно = энргФормированиеТекстовЗапроса.ПараметрТипРавно(	
		Новый Структура("Организация, Район, КлючПомещения, Абонент", 	
		"Организация", "Район", "КлючПомещения", "Абонент"));
	ПараметрыВТ.Добавить(ПараметрТипРавно); 
	
	Параметры 		= Новый Структура;	
	Параметры.Вставить("ПараметрыВТ", 	ПараметрыВТ);
	Параметры.Вставить("Период",  		Новый Структура("ИмяПараметра", "Период"));
	
	РегистрыСведений.энргСпособыДоставкиКвитанции.ПолучитьАктуальныйСпособДоставкиКвитанции(Схема, Параметры);
	
	Запрос 			= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Период"	      	, Период);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Район"	  		, Район);
	Запрос.УстановитьПараметр("КлючПомещения"	, КлючПомещения);
	Запрос.УстановитьПараметр("Абонент" 		, Абонент);

                                    	
	Результат 		= Запрос.Выполнить();	
	Возврат Результат;	
КонецФункции

