#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗаполнитьСписокСтроений(Организация,Район,Улица,Дом,ЧетнаяСторона,НечетнаяСторна) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
			|	энргСтроения.Ссылка КАК Ссылка,
			|	энргСтроенияКонтактнаяИнформация.ЗначенияПолей КАК Значение
			|ИЗ
			|	Справочник.энргСтроения КАК энргСтроения
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
			|		ПО (энргСтроенияКонтактнаяИнформация.Ссылка = энргСтроения.Ссылка)
			|ГДЕ
			|	энргСтроения.Район = &Район
			|   И НЕ энргСтроения.ПометкаУдаления
			|	И энргСтроения.Организация = &Организация
			|	И ВЫБОР
			|			КОГДА &Дом = """"
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ энргСтроения.Наименование ПОДОБНО ""%"" + &Дом + ""%""
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &Улица = """"
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ энргСтроения.Наименование ПОДОБНО ""%"" + &Улица + ""%""
			|		КОНЕЦ
			|";
	
	Запрос.УстановитьПараметр("Район",Район);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Дом",Дом);
	Запрос.УстановитьПараметр("Улица",Улица);
	
 	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции	

Процедура ПрикрепитьСтроениеСудебномуУчастку(ДатаДокумента, Организация, Район, Строение, СудебныйУчасток, ДопПараметры = Неопределено) Экспорт 
	
	НачатьТранзакцию();
	//ТекАбонент 		= Неопределено;
	//ТекТочкаУчета 	= Неопределено;
	НовДокумент		= Неопределено;
	

	Попытка
		Если НЕ НовДокумент = Неопределено Тогда
			// Проводим новый документ
			НовДокумент.Записать(РежимЗаписиДокумента.Проведение);					
			
		КонецЕсли;				
		
		// Создаем и заполняем шапку нового документа
		НовДокумент = СоздатьДокумент();
		НовДокумент.Дата 			= ДатаДокумента;
		НовДокумент.Организация 	= Организация;
		НовДокумент.Район 			= Район;			
		НовДокумент.СудебныйУчасток = СудебныйУчасток; 
		
		// Заполняем строение нового документа
		Если ЗначениеЗаполнено(Строение) Тогда
			НСтрока = НовДокумент.СписокСтроений.Добавить();
			НСтрока.Строение = Строение;
		КонецЕсли;
		
		
		Если НЕ НовДокумент = Неопределено Тогда
			// Проводим новый документ
			НовДокумент.Записать(РежимЗаписиДокумента.Проведение);			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Комментарий = "При создании работ произошла ошибка: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли