#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.энргСоответствиеСтроенийСудебномуУчастку.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокСтроений Из СписокСтроений Цикл
		
		Движение 						= Движения.энргСоответствиеСтроенийСудебномуУчастку.Добавить();
		Движение.Период 				= Дата;
		Движение.Строение 				= ТекСтрокаСписокСтроений.Строение;
		Движение.СудебныйУчасток 		= СудебныйУчасток;
 		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли