#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПередЗаписьюПереопределяемыйПосле(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписьюПереопределяемыйПосле(Отказ)
	// переопределено в расширении 
	ЗаписьДоступна = Истина;
	
	Попытка
	
		ЗаписьДоступна = РольДоступна("энргИзменение_энргВидыСезонности");
	
	Исключение
	
	КонецПопытки;
	
	Если НЕ ЗаписьДоступна Тогда 
		Отказ = Ложь;
		ВызватьИсключение "Нарушение прав доступа"; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли