#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция - Возвращает формулу расчета головной ТУ
//
// Параметры:
//  Период			 - Дата 
//  Организация		 - СправочникСсылка.Организации
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета
//  Услуга			 - СправочникСсылка.энргВидыУслуг
//  ГоловнаяТУ		 - СправочникСсылка.энргТочкиУчета 
//
Функция ФормулаРасчетаГоловнойТУ(Период, Организация, Район, ОбъектРасчета, Услуга, ГоловнаяТУ) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ОбъектРасчетаСубабонента КАК ОбъектРасчета,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ТочкаУчетаСубабонента КАК ТочкаУчета,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УслугаСубабонента КАК Услуга,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СхемаПриВыводеПодчиненногоПУ КАК СхемаПриВыводеПодчиненногоПУ,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Коэффициент КАК Коэффициент,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.Актуальность КАК Актуальность,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределения КАК СпособРаспределения,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СпособРаспределенияОстатка КАК СпособРаспределенияОстатка,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.УчитыватьИндивидуальноеПотребление КАК УчитыватьИндивидуальноеПотребление,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ФиксированныйОбъем КАК ФиксированныйОбъем,
	               |	бестФормулыРасчетаТочекУчетаНПСрезПоследних.ДоговорнойКоэффициент КАК ДоговорнойКоэффициент
	               |ПОМЕСТИТЬ ВТ_ФормулыТУ
	               |ИЗ
	               |	РегистрСведений.бестФормулыРасчетаТочекУчетаНП.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И ОбъектРасчета = &ОбъектРасчета
	               |				И Услуга = &Услуга
	               |				И ГоловнаяТочкаУчета = &ГоловнаяТУ) КАК бестФормулыРасчетаТочекУчетаНПСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	               |	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	               |ПОМЕСТИТЬ ВТ_ДоговорыТУ
	               |ИЗ
	               |	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И (ОбъектРасчета, ТочкаУчета, Услуга) В
	               |					(ВЫБРАТЬ
	               |						ВТ_ФормулыТУ.ОбъектРасчета КАК ОбъектРасчета,
	               |						ВТ_ФормулыТУ.ТочкаУчета КАК ТочкаУчета,
	               |						ВТ_ФормулыТУ.Услуга КАК Услуга
	               |					ИЗ
	               |						ВТ_ФормулыТУ КАК ВТ_ФормулыТУ)) КАК бестДоговорыТочекУчетаСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ФормулыТУ.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВТ_ФормулыТУ.ТочкаУчета КАК ТочкаУчета,
	               |	ВТ_ФормулыТУ.Услуга КАК Услуга,
	               |	ВТ_ФормулыТУ.СхемаПриВыводеПодчиненногоПУ КАК СхемаПриВыводеПодчиненногоПУ,
	               |	ВТ_ФормулыТУ.Коэффициент КАК Коэффициент,
	               |	ВТ_ФормулыТУ.Актуальность КАК Актуальность,
	               |	ВТ_ФормулыТУ.СпособРаспределения КАК СпособРаспределения,
	               |	ВТ_ФормулыТУ.СпособРаспределенияОстатка КАК СпособРаспределенияОстатка,
	               |	ВТ_ФормулыТУ.УчитыватьИндивидуальноеПотребление КАК УчитыватьИндивидуальноеПотребление,
	               |	ВТ_ФормулыТУ.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	               |	ВТ_ФормулыТУ.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	               |	ВТ_ФормулыТУ.ФиксированныйОбъем КАК ФиксированныйОбъем,
	               |	ВТ_ФормулыТУ.ДоговорнойКоэффициент КАК ДоговорнойКоэффициент,
	               |	ВТ_ДоговорыТУ.Договор КАК Договор
	               |ИЗ
	               |	ВТ_ФормулыТУ КАК ВТ_ФормулыТУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоговорыТУ КАК ВТ_ДоговорыТУ
	               |		ПО ВТ_ФормулыТУ.ОбъектРасчета = ВТ_ДоговорыТУ.ОбъектРасчета
	               |			И ВТ_ФормулыТУ.ТочкаУчета = ВТ_ДоговорыТУ.ТочкаУчета
	               |			И ВТ_ФормулыТУ.Услуга = ВТ_ДоговорыТУ.Услуга";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("ГоловнаяТУ", ГоловнаяТУ);
	
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#КонецЕсли