
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостьюИДоступностью();
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		
		Если Не ЗначениеЗаполнено(Параметры.Основание) Тогда
		 	Объект.ЭтапОбращения	= ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_ПервичноеОбращение");
		КонецЕсли;
		Объект.Дата = ТекущаяДата();
		ЗаполнитьПлановуюДатуОкончанияЭтапа();
	КонецЕсли;
	
	// ОТЭК, 19.05.2020, 000353559, добавлены подключаемые команды.
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
	Объект.Абонент = ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапОбращенияПриИзменении(Элемент)
	УправлениеВидимостьюИДоступностью()
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		// ОТЭК, 19.05.2020, 000353559.
		// энргПользовательскийВводКлиент.ПриИзмененииАбонента(Объект); 		 		 
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		// ОТЭК, 19.05.2020, 000353559.
	иначе
		Объект.МКД 			= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.ЛицевойСчет 	="";
		Объект.АдресОбъекта	="";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПлановуюДатуОкончанияЭтапа();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПлановуюДатуОкончанияЭтапа()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ОТЭК, 19.05.2020, 000353559, добавлены подключаемые команды.
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УправлениеВидимостьюИДоступностью()
	ЭтоПервичноеОбращение							= ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_ПервичноеОбращение");
	//Элементы.ТекстОбращения.ТолькоПросмотр			= НЕ (Объект.ЭтапОбращения = ЭтоПервичноеОбращение);
	//Элементы.ВидОбращения.ТолькоПросмотр			= НЕ (Объект.ЭтапОбращения = ЭтоПервичноеОбращение);
	Элементы.Основание.Доступность					= Объект.ЭтапОбращения <> ЭтоПервичноеОбращение;
	Элементы.Основание.Видимость					= Объект.ЭтапОбращения <> ЭтоПервичноеОбращение;
	Элементы.Ответ.Видимость						= Объект.ЭтапОбращения.ВидимостьОтвета;
	//Элементы.Ответ.ТолькоПросмотр					= Объект.ЭтапОбращения = ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_ОтветНаОбращение");
	Элементы.ОтветственныйЗаИсполнение.Видимость	= Объект.ЭтапОбращения = ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_НазначенОтветственный");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановуюДатуОкончанияЭтапа()
	ПОбъект = РеквизитФормыВЗначение("Объект");
	ПОбъект.ЗаполнитьПлановуюДатуОкончанияЭтапа();
	ЗначениеВРеквизитФормы(ПОбъект,"Объект");
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Дата", 			Объект.Дата);
	//Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	//Запрос.УстановитьПараметр("Этап", 			Объект.ЭтапОбращения);
	//ЗАпрос.Текст = "ВЫБРАТЬ
	//|	бестСрокиЭтаповОбращенийСрезПоследних.Срок КАК Срок
	//|ИЗ
	//|	РегистрСведений.бестСрокиЭтаповОбращений.СрезПоследних(
	//|			&Дата,
	//|			Организация = &Организация
	//|				И Этап = &Этап) КАК бестСрокиЭтаповОбращенийСрезПоследних
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бестСрокиЭтаповОбращенийСрезПоследних.Срок";
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Срок = 0;
	//Если Выборка.Следующий() Тогда
	//	Срок = Выборка.Срок;
	//КонецЕсли;
	//
	//Объект.ПлановаяДатаОкончанияЭтапа	= КонецДня(Объект.Дата + 86400*Срок);
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ОТЭК, 22.05.2020, 000202897.	
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент, ОБъект.Организация, Объект.Район,,СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
