#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ПроверитьДатуСобытия(Отказ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала события заполнена не верно.",ЭтотОбъект,"ДатаНачалаСобытия");
		Возврат;	
	КонецЕсли;
	
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Результат = ПолучитьДанныеДляПроведения();
		
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(Результат,	Движения.бестЗарегистрированноеБезучетноеБездоговорноеПотребление);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.Организация КАК Организация,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.Район КАК Район,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребленияПотребление.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребленияПотребление.Услуга КАК Услуга,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребленияПотребление.ТоковаяНагрузка КАК ТоковаяНагрузка,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребленияПотребление.ФазноеНапряжение КАК ФазноеНапряжение,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.МаксимальнаяМощность КАК МаксимальнаяМощность,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребленияПотребление.Фазность КАК Фазность,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.ПревышениеМаксимальнойМощности КАК ПревышениеМаксимальнойМощности,
	      		  |	ВЫБОР
	      		  |		КОГДА бестРегистрацияБездоговорногоБезучетногоПотребления.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БезучетноеПотребление)
	      		  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.БезучетноеПотребление)
	      		  |		КОГДА бестРегистрацияБездоговорногоБезучетногоПотребления.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БездоговорноеПотребление)
	      		  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.БездоговорноеПотребление)
	      		  |	КОНЕЦ КАК СпособНачисления,
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.Дата КАК ДатаРегистратора
	      		  |ИЗ
	      		  |	Документ.бестРегистрацияБездоговорногоБезучетногоПотребления.Потребление КАК бестРегистрацияБездоговорногоБезучетногоПотребленияПотребление
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРегистрацияБездоговорногоБезучетногоПотребления КАК бестРегистрацияБездоговорногоБезучетногоПотребления
	      		  |		ПО бестРегистрацияБездоговорногоБезучетногоПотребленияПотребление.Ссылка = бестРегистрацияБездоговорногоБезучетногоПотребления.Ссылка
	      		  |ГДЕ
	      		  |	бестРегистрацияБездоговорногоБезучетногоПотребления.Ссылка = &Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 
КонецФункции

Функция ПроверитьДатуСобытия(Отказ)
	КолвоЧасов = 0;
	Если ВидОперации = Перечисления.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БездоговорноеПотребление Тогда
		КолвоЧасов = 8760;
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.РегистрацияБездоговорногоБезучетногоПотребления_БезучетноеПотребление Тогда
		КолвоЧасов = 4380;
	КонецЕсли;
	Отказ = ДатаНачалаСобытия > Дата ИЛИ ДатаНачалаСобытия < Дата - КолвоЧасов * 3600;
	Возврат Отказ;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли