
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСвойстваЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтправлятьМнопоточноПриИзменении(Элемент)
	УстановитьСвойстваЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПорцииПриИзменении(Элемент)
	УстановитьСвойстваЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПотоковПриИзменении(Элемент)
	
	Если Объект.КоличествоПотоков > 10 Тогда 
		
		Объект.КоличествоПотоков = 3;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьСвойстваЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КоличествоПотоков",
		"Видимость",
		Объект.ОтправлятьМногопоточно);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КоличествоВПорции",
		"Видимость",
		Объект.ИспользоватьПорции);	
	
КонецПроцедуры

#КонецОбласти