
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураФО = ЗаполнитьСтруктуруЗначенийФО();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураФО);
	
	ДокументыДоговораНастройкиКД = ДокументыДоговора.КомпоновщикНастроек.ПолучитьНастройки();
	
	УстановитьОперации();
	
	ПриСозданииНаСервереПереопределеляемый(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьКнопкиОбновитьДанные();
	НастроитьВидимостьЭлементов();
	УстановитьВидимостьДанныхОбъектовРасчета(Ложь);
	НайтиИндексыНастроек(ЭтотОбъект);
	ЗаполнитьПараметрыДинамическогоСпискаДолевыеТУ();
	ЗаполнитьПараметрыДинамическогоСпискаСубабоненты();
	ЗаполнитьПараметрыДинамическогоСпискаДокументыДоговора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаПоискаДоговораПриИзменении(Элемент)
	НайтиДоговорПоСтрокеПоиска();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПДОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ЗначениеПоляРасшифровки = ЗначениеПоляРасшифровки(Расшифровка, ОтчетПоПДДанныеРасшифровки);
	Если Не ЗначениеПоляРасшифровки = Неопределено Тогда
		ПоказатьЗначение(, ЗначениеПоляРасшифровки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПДТипПриИзменении(Элемент)
	ОтчетПоПДИспользоватьОтборПоТипу = Истина;
	ОтчетПоПД = ВыполнитьОтборПоТипуПД(ОтчетПоПДКомпоновщикНастроек, ОтчетПоПДИспользоватьОтборПоТипу, ОтчетПоПДТип);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПДИспользоватьОтборПоТипуПриИзменении(Элемент)
	ОтчетПоПД = ВыполнитьОтборПоТипуПД(ОтчетПоПДКомпоновщикНастроек, ОтчетПоПДИспользоватьОтборПоТипу, ОтчетПоПДТип);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПДПериодПриИзменении(Элемент)
	ИзменитьАктуальностьДанныхОтчетаПоПД(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРасчета

&НаКлиенте
Процедура ОбъектыРасчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, ОбъектРасчета);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбъектРасчета = ТекущиеДанные.ОбъектРасчета;
	Элементы.ТочкиПоставки.ОтборСтрок = Новый ФиксированнаяСтруктура("ОбъектРасчета", ОбъектРасчета);
	ОбновитьДеревоОтображенияПоУмолчанию(ТекущиеДанные, "ОбъектРасчета", "ДеревоОтображенияДанныхПоТУ", ДеревоОтображенияДанныхПоТУ, ДеревоДанныеПоТУ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиПоставки

&НаКлиенте
Процедура ТочкиПоставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиПоставкиСтатус" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
		Отбор  = Новый Структура("ТочкаПоставки", ТекущиеДанные.ТочкаПоставки);
		ПараметрыОткрытия  = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("РегистрСведений.энргАктивностьТочекПоставки.ФормаСписка", ПараметрыОткрытия);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОтображенияДанныхПоТУ

&НаКлиенте
Процедура ДеревоОтображенияДанныхПоТУПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ДеревоОтображенияДанныхПоТУ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТочкаУчета = ТекущиеДанные.ТочкаУчета;
	ПриборУчета = ТекущиеДанные.ПриборУчета; 
	
	ОбновитьДеревоОтображенияПоУмолчанию(ТекущиеДанные, 
											"ТочкаУчета", 
											"ДеревоОтображенияДанныхПоПУ", 
											ДеревоОтображенияДанныхПоПУ, 
											ДеревоДанныеПоПУ);
	ОбновитьДеревоОтображенияПоУмолчанию(ТекущиеДанные, 
											"ТочкаУчета", 
											"ДеревоОтображенияДанныхПоИзмерительномуКомплексу", 
											ДеревоОтображенияДанныхПоИзмерительномуКомплексу, 
											ДеревоДанныеПоИзмерительномуКомплексу);
КонецПроцедуры
										
&НаКлиенте
Процедура ДеревоОтображенияДанныхПоТУВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначениеСсылкиВДереве("ДеревоОтображенияДанныхПоТУ", Поле.Имя);
КонецПроцедуры
										
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОтображенияДанныхПоПУ

&НаКлиенте
Процедура ДеревоОтображенияДанныхПоПУВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначениеСсылкиВДереве("ДеревоОтображенияДанныхПоПУ", Поле.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОтображенияДанныхПоИзмерительномуКомплексу

&НаКлиенте
Процедура ДеревоОтображенияДанныхПоИзмерительномуКомплексуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначениеСсылкиВДереве("ДеревоОтображенияДанныхПоИзмерительномуКомплексу", Поле.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДолевыеТУ

&НаКлиенте
Процедура ДолевыеТУПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ДолевыеТУ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПараметрыДинамическогоСпискаСубабоненты(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыДоговора

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиДоговорПоСтрокеПоиска(Команда = Неопределено)
	
	ПараметрыФормы = Новый Структура("СтрокаНачальногоПоиска, ТекущаяСтрока, НезависимыйСбыт", СтрокаПоискаДоговора, Договор, НезависимыйСбыт);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораДоговора", ЭтотОбъект);
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.Форма.ФормаПоискаПоСтроке", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДоговор(Команда)
	Если ЗначениеЗаполнено(Договор) Тогда
		ПоказатьЗначение(,Договор);
	Иначе
		НайтиДоговорПоСтрокеПоиска();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнформациюПоОбъектам(Команда)
	ВидимостьДанныхОбъектов = Не ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы, "ГруппаИнформацияПоОбъектам", "Видимость");
	УстановитьВидимостьДанныхОбъектовРасчета(ВидимостьДанныхОбъектов);
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьОтчетПоПД(Команда)
	Если Не ЗначениеЗаполнено(ОтчетПоПДПериод.ДатаОкончания) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнен период формирования отчета!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПоляДоговора = ОсновныеПоляДоговора();
	ПоляДоговора.Вставить("ДатаНачала", ОтчетПоПДПериод.ДатаНачала);
	ПоляДоговора.Вставить("ДатаОкончания", ОтчетПоПДПериод.ДатаОкончания);
	Если ОтчетПоПДИспользоватьОтборПоТипу Тогда
		ПоляДоговора.Вставить("ТипПД", ОтчетПоПДТип);
	КонецЕсли;
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ЗапуститьФоновоеЗаданиеФормированияОтчетаПоПД(УникальныйИдентификатор, ПоляДоговора);

	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет получение данных";
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФормированияОтчетаПоПД", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	СтруктураФО = ЗаполнитьСтруктуруЗначенийФО();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураФО);
	НастроитьВидимостьЭлементов();
	ВидимостьДанныхОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы, "ГруппаИнформацияПоОбъектам", "Видимость");
	ЗаполнитьДанныеДоговора(ВидимостьДанныхОбъектов);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюПоказаний(Команда)
	КлючиПараметров = "Организация, Район, ОбъектРасчета, ТочкаУчета, ПриборУчета";
	ПараметрыФормы = Новый Структура(КлючиПараметров);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЭтотОбъект, КлючиПараметров);
	ОткрытьФорму("ОбщаяФорма.бестФормаИсторияПоказаний", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьПоказания(Команда)
	ВыбратьОперациюИзСпискаЗавершение(Новый Структура("Значение", "бестРегистрацияПоказанийНП__бестРегистрацияПоказанийНП_РегистрацияПоказаний"), Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФормулуРасчета(Команда)
	ТекущиеДанные = Элементы.ДолевыеТУ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Договор) Тогда
		КлючиДопЗначЗапол = "ДолеваяТочкаУчета, Услуга";
	Иначе
		КлючиДопЗначЗапол = "Организация, Район, Договор, ОбъектРасчета, ДолеваяТочкаУчета, Услуга";
	КонецЕсли;
	ДопЗначЗапол = Новый Структура(КлючиДопЗначЗапол);
	ЗаполнитьЗначенияСвойств(ДопЗначЗапол, ТекущиеДанные);
	ДопЗначЗапол.ДолеваяТочкаУчета = ТекущиеДанные.ТочкаУчета;
	ОткрытьФормуНовогоДокумента("бестУстановитьФормулуРасчетаТочекУчетаНП", 
									"бестУстановитьФормулуРасчетаТочекУчетаНП_НачислениеПоФормуле", 
									,
									ДопЗначЗапол)
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСуммуНачислений(Команда)
	СтруктураСуммНачислений = ДанныеОСуммахНачислений(Организация, Район, Договор); 
	СуммаБезНДС = СтруктураСуммНачислений.СуммаБезНДС;
	СуммаНДС = СтруктураСуммНачислений.СуммаНДС;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДанныеДоговора(ВидимостьДанныхОбъектов = Ложь)

	ДанныеДоговора = ДанныеДоговора(Договор);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьДоговор", "Заголовок", ДанныеДоговора.ПредставлениеДоговора);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДоговора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВзаимодействиеСЭДОНет", "Видимость", Не ДанныеДоговора.ВзаимодействиеСЭДО И Не НезависимыйСбыт);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВзаимодействиеСЭДОДа", "Видимость", ДанныеДоговора.ВзаимодействиеСЭДО И Не НезависимыйСбыт);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорТарифнаяСетка", "Видимость", ДанныеДоговора.ФиксированныйТариф);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорЦеноваяКатегория", "Видимость", Не ДанныеДоговора.ФиксированныйТариф);
	РасходныеДоговоры.ЗагрузитьЗначения(ДанныеДоговора.РасходныеДоговоры);
	
	УстановитьВидимостьДанныхОбъектовРасчета(ВидимостьДанныхОбъектов);
	
	ЗаполнитьПараметрыДинамическогоСпискаДолевыеТУ();
	ЗаполнитьПараметрыДинамическогоСпискаДокументыДоговора();
	
	Для каждого эл из ДокументыДоговора.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если эл.ПредставлениеПользовательскойНастройки = "ЗаполнениеДоговор" Тогда
			эл.ПравоеЗначение = Договор;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	УстановитьОтборОбъектаРасчетаПоДоговору(ЭтотОбъект);
	
	ИзменитьАктуальностьДанныхОтчетаПоПД(Ложь); 
	
	ЗаполнитьДанныеДоговораПереопределяемый(ВидимостьДанныхОбъектов);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДоговора(Договор)

	ДанныеДоговора = Новый Структура("ПредставлениеДоговора, Организация, Район, Контрагент, 
										|СтатусДоговора, ДатаСостоянияДоговора, ВзаимодействиеСЭДО,
										|ЮридическийАдресКонтрагента, ЭлектронныйАдресКонтрагента,
										|ФиксированныйТариф, ИннКпп, ОкпоОгрн, РасходныеДоговоры");
	Пакет = бестРаботаСРабочимМестомОператораЮЛ.ДанныеДоговораДляРабочегоМестаОператора(Договор);
	Выборка = Пакет.Получить(Пакет.ВГраница()).Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ДанныеДоговора, Выборка);
	
	Шаблон = НСтр("ru = '%1/%2'");
	Если ЗначениеЗаполнено(Выборка.ИНН) И ЗначениеЗаполнено(Выборка.КПП) Тогда
		ДанныеДоговора.ИннКпп = СтрШаблон(Шаблон, Выборка.ИНН, Выборка.КПП);
	ИначеЕсли ЗначениеЗаполнено(Выборка.ИНН) Тогда
		ДанныеДоговора.ИннКпп = Выборка.ИНН;
	ИначеЕсли ЗначениеЗаполнено(Выборка.КПП) Тогда
		ДанныеДоговора.ИннКпп = Выборка.КПП;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ОКПО) И ЗначениеЗаполнено(Выборка.ОГРН) Тогда
		ДанныеДоговора.ОкпоОгрн = СтрШаблон(Шаблон, Выборка.ОКПО, Выборка.ОГРН);
	ИначеЕсли ЗначениеЗаполнено(Выборка.ОКПО) Тогда
		ДанныеДоговора.ОкпоОгрн = Выборка.ОКПО;
	ИначеЕсли ЗначениеЗаполнено(Выборка.ОГРН) Тогда
		ДанныеДоговора.ОкпоОгрн = Выборка.ОГРН;
	КонецЕсли;
	
	ДанныеДоговора.РасходныеДоговоры = Пакет.Получить(0).Выгрузить().ВыгрузитьКолонку("Договор");
	
	ДополнитьДанныеДоговора(ДанныеДоговора, Договор);
	
	Возврат ДанныеДоговора;

КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДанныхОбъектовРасчета(Видимость)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаИнформацияПоОбъектам",
		"Видимость",
		Видимость);
		
	ЗаголовокКнопки = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы, "ЗаполнитьИнформациюПоОбъектам", "Заголовок");	
	Если Видимость Тогда
		ЧтоЗаменить = "Показать";
		НаЧтоЗаменить = "Скрыть";
	Иначе
		ЧтоЗаменить = "Скрыть";
		НаЧтоЗаменить = "Показать";
	КонецЕсли;
	ЗаголовокКнопки = СтрЗаменить(ЗаголовокКнопки, ЧтоЗаменить, НаЧтоЗаменить); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЗаполнитьИнформациюПоОбъектам",
		"Заголовок",
		ЗаголовокКнопки);	
	
	Если Видимость Тогда 
		ЗаполнитьДанныеПоОбъектамРасчета();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоОбъектамРасчета()
	
	ОчиститьКоллекции();
	
	ПоляДоговора = ОсновныеПоляДоговора();
	ПоляДоговора.Вставить("Контрагент", Контрагент);
	ПоляДоговора.Вставить("НезависимыйСбыт", НезависимыйСбыт);
	ПоляДоговора.Вставить("ИспользоватьТарифныеЗоны", ИспользоватьТарифныеЗоны);
	ПоляДоговора.Вставить("ИспользоватьШкалыПриборовУчета", ИспользоватьШкалыПриборовУчета);
	ПоляДоговора.Вставить("ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ", ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ);
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ЗапуститьФоновоеЗаданиеПолученияДанныхПоОбъектамРасчета(УникальныйИдентификатор, ПоляДоговора, ОбъектыРасчета, ТочкиПоставки);

	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет получение данных";
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииПолученияДанныхПоОбъектамРасчета", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоллекции()
	
	ДеревоДанныеПоТУ.ПолучитьЭлементы().Очистить();
	ДеревоДанныеПоПУ.ПолучитьЭлементы().Очистить();
	ДеревоДанныеПоИзмерительномуКомплексу.ПолучитьЭлементы().Очистить();
	ДеревоОтображенияДанныхПоТУ.ПолучитьЭлементы().Очистить();
	ДеревоОтображенияДанныхПоПУ.ПолучитьЭлементы().Очистить();
	ДеревоОтображенияДанныхПоИзмерительномуКомплексу.ПолучитьЭлементы().Очистить();
	
	ОбъектыРасчета.Очистить();
	ТочкиПоставки.Очистить();
	ОчиститьКоллекцииПереопределяемый();
	
КонецПроцедуры

&НаКлиенте
Функция ОсновныеПоляДоговора()
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", Организация);
	Результат.Вставить("Район", Район);
	Результат.Вставить("Договор", Договор);
	                                     
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьФоновоеЗаданиеПолученияДанныхПоОбъектамРасчета(УникальныйИдентификатор, ПоляДоговора, Знач ОбъектыРасчетаОригинал, Знач ТочкиПоставкиОригинал)
	ДеревоДанныеПоТУ = НовоеДеревоТочекУчета();
	ДеревоДанныеПоПУ = НовоеДеревоПриборовУчета();
	ДеревоДанныеПоИзмерительномуКомплексу = НовоеДеревоИзмерительныйКомплекс();
	ОбъектыРасчета			= ОбъектыРасчетаОригинал.Выгрузить();
	ТочкиПоставки			= ТочкиПоставкиОригинал.Выгрузить();
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных объектов расчета для рабочего стола'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"бестРаботаСРабочимМестомОператораЮЛ.ЗаполнитьДанныеОбъектовРасчета",
		ПоляДоговора,
		ДеревоДанныеПоТУ,
		ДеревоДанныеПоПУ,
		ДеревоДанныеПоИзмерительномуКомплексу, 
		ОбъектыРасчета, 
		ТочкиПоставки);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьФоновоеЗаданиеФормированияОтчетаПоПД(УникальныйИдентификатор, ПоляДоговора)
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование отчета по платежным документам'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"Отчеты.бестАнализПлатежныхДокументовЭЭ.СформироватьОтчетПоПДДляРабочегоСтола",
		ПоляДоговора);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовоеДеревоТочекУчета()
	
	ТипыКолонкиКлюч = Новый Массив;
	ТипыКолонкиКлюч.Добавить("Строка");
    ТипыКолонкиКлюч.Добавить("СправочникСсылка.энргТочкиУчета");
	ТипыКолонкиКлюч.Добавить("СправочникСсылка.энргВидыУслуг");
	ТипыКолонкиКлюч.Добавить("СправочникСсылка.энргТарифныеЗоны");
	
	ТипыКолонкиЗначение = Новый Массив;
	ТипыКолонкиЗначение.Добавить("Строка");
    ТипыКолонкиЗначение.Добавить("СправочникСсылка.энргТочкиУчета");
    ТипыКолонкиЗначение.Добавить("СправочникСсылка.бестТарифныеСетки");
	
	Результат = Новый ДеревоЗначений;	
	Результат.Колонки.Добавить("Ключ", Новый ОписаниеТипов(ТипыКолонкиКлюч));	
	Результат.Колонки.Добавить("Значение", Новый ОписаниеТипов(ТипыКолонкиЗначение));	
	Результат.Колонки.Добавить("ОбъектРасчета", Новый ОписаниеТипов("СправочникСсылка.бестОбъектыРасчета"));	
	Результат.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));	
	Результат.Колонки.Добавить("ПриборУчета", Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовоеДеревоПриборовУчета()
	
	ТипыКолонкиКлюч = Новый Массив;
	ТипыКолонкиКлюч.Добавить("Строка");
    ТипыКолонкиКлюч.Добавить("СправочникСсылка.энргШкалыПриборовУчета");
	ТипыКолонкиКлюч.Добавить("СправочникСсылка.энргТарифныеЗоны");
	
	ТипыКолонкиЗначение = Новый Массив;
	ТипыКолонкиЗначение.Добавить("Строка");
    ТипыКолонкиЗначение.Добавить("СправочникСсылка.энргПриборыУчетаАбонента");
    ТипыКолонкиЗначение.Добавить("СправочникСсылка.энргМаркиПриборовУчета");
	
	Результат = Новый ДеревоЗначений;	
	Результат.Колонки.Добавить("Ключ", Новый ОписаниеТипов(ТипыКолонкиКлюч));	
	Результат.Колонки.Добавить("Значение", Новый ОписаниеТипов(ТипыКолонкиЗначение));	
	Результат.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	Возврат Результат;
	
КонецФункции 

&НаСервереБезКонтекста
Функция НовоеДеревоИзмерительныйКомплекс()

	ТипыКолонкиКлюч = Новый Массив;
	ТипыКолонкиКлюч.Добавить("Строка");
    ТипыКолонкиКлюч.Добавить("СправочникСсылка.энргТипыПриборовУчета");
	
	ТипыКолонкиЗначение = Новый Массив;
	ТипыКолонкиЗначение.Добавить("Строка");
    ТипыКолонкиЗначение.Добавить("СправочникСсылка.энргПриборыУчетаАбонента");
    ТипыКолонкиЗначение.Добавить("СправочникСсылка.энргМаркиПриборовУчета");
	
	Результат = Новый ДеревоЗначений;	
	Результат.Колонки.Добавить("Ключ", Новый ОписаниеТипов(ТипыКолонкиКлюч));	
	Результат.Колонки.Добавить("Значение", Новый ОписаниеТипов(ТипыКолонкиЗначение));	
	Результат.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьТЧФормы(Массив, НазваниеТЧФормы)

	ТЧФормы = ЭтотОбъект[НазваниеТЧФормы];
	Для каждого Строка Из Массив Цикл
	
		СтрокаТЧФормы = ТЧФормы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧФормы, Строка);
	
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбъектов(Результат, Знач ДеревоДанныеПоТУ, Знач ДеревоДанныеПоПУ, Знач ДеревоДанныеПоИзмерительномуКомплексу)
	
	ДанныеВременногоХранилища = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ДанныеПоУмолчанию = ДанныеВременногоХранилища.ДанныеПоУмолчанию;
	
	МассивОбъектов = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеВременногоХранилища.ОбъектыРасчета);
	МассивТП = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеВременногоХранилища.ТочкиПоставки);
	
	СтрокаДерева = ДеревоДанныеПоТУ.ПолучитьЭлементы();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеВременногоХранилища.ДеревоДанныеПоТУ);
	
	СтрокаДерева = ДеревоДанныеПоПУ.ПолучитьЭлементы();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеВременногоХранилища.ДеревоДанныеПоПУ);
	
	СтрокаДерева = ДеревоДанныеПоИзмерительномуКомплексу.ПолучитьЭлементы();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеВременногоХранилища.ДеревоДанныеПоИзмерительномуКомплексу);
	
	Возврат Новый Структура("ДанныеПоУмолчанию, МассивОбъектов, МассивТП, ДеревоДанныеПоТУ, ДеревоДанныеПоПУ, ДеревоДанныеПоИзмерительномуКомплексу", 
								ДанныеПоУмолчанию, МассивОбъектов, МассивТП, ДеревоДанныеПоТУ, ДеревоДанныеПоПУ, ДеревоДанныеПоИзмерительномуКомплексу);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеОтчета(Результат)
	
	РезультатВыполненияОтчета = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ОтчетДанныеРасшифровки = ПоместитьВоВременноеХранилище(РезультатВыполненияОтчета.ДанныеРасшифровкиКомпоновки, Новый УникальныйИдентификатор);
	
	ДанныеОтчета = Новый Структура("Отчет, ОтчетДанныеРасшифровки, НастройкиКД", 
										РезультатВыполненияОтчета.ТабДок, ОтчетДанныеРасшифровки, РезультатВыполненияОтчета.НастройкиКД);
	Возврат ДанныеОтчета;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		ЭлементДерева = КоллекцияЭлементовДерева.Добавить();		
		ЗаполнитьЗначенияСвойств(ЭлементДерева, Строка);
		
		Если Строка.ПолучитьЭлементы().Количество() > 0 Тогда
			
			ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ЭлементДерева.ПолучитьЭлементы(), Строка.ПолучитьЭлементы());
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоОтображенияПоУмолчанию(ТекущиеДанные, ИмяПоляПоиска, ИмяЭлементаДереваОтображения, ДеревоОтображения, ДеревоИсточник)
	
	КоллекцияСтрокВернегоУровня = ДеревоОтображения.ПолучитьЭлементы();
	КоллекцияСтрокВернегоУровня.Очистить();
	
	ЗначениеПоиска  = ТекущиеДанные[ИмяПоляПоиска];	
	СтрокиДерева 	= ДеревоИсточник.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева[ИмяПоляПоиска] = ЗначениеПоиска Тогда 
			ЭлементДерева = КоллекцияСтрокВернегоУровня.Добавить(); 
			ЗаполнитьЗначенияСвойств(ЭлементДерева, СтрокаДерева);
			ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ЭлементДерева.ПолучитьЭлементы(), СтрокаДерева.ПолучитьЭлементы());			
		КонецЕсли;
		
	КонецЦикла;
	
	ДеревоЭлемент = Элементы[ИмяЭлементаДереваОтображения];
	Для Каждого СтрокаДерева Из КоллекцияСтрокВернегоУровня Цикл		
		ДеревоЭлемент.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОперациюИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры)
	
	Если ВыбранныйЭлемент = Неопределено тогда
		Возврат;
	КонецЕсли;
	ВидОперации 		= Неопределено;
	МассивСтрок  		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыбранныйЭлемент.Значение, "__");
	ИмяДокумента  		= МассивСтрок[0];
	Если МассивСтрок.Количество() > 1 тогда
		ВидОперации 	= МассивСтрок[1]; 
	КонецЕсли;
	
	ОткрытьФормуНовогоДокумента(ИмяДокумента, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНовогоДокумента(ИмяДокумента, ВидОперации, ЗаполнитьДокумент = Истина, ДопЗначЗапол = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаполнитьДокумент", ЗаполнитьДокумент);
	Если ЗаполнитьДокумент Тогда
		КлючиЗначений = "Организация, Район, Контрагент, Договор, ОбъектРасчета, ТочкаУчета, ПриборУчета"; 
		ЗначенияЗаполнения = Новый Структура(КлючиЗначений);
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, ЭтотОбъект, КлючиЗначений); 
		ЗначенияЗаполнения.Вставить("Дата", ТекущаяДата());
	Иначе
		ЗначенияЗаполнения = Новый Структура;
	КонецЕсли;
	
	Если ТипЗнч(ДопЗначЗапол) = Тип("Структура") Тогда
		Для каждого ТекЗнач Из ДопЗначЗапол Цикл
			ЗначенияЗаполнения.Вставить(ТекЗнач.Ключ, ТекЗнач.Значение);
		КонецЦикла;
	КонецЕсли;
	Если ВидОперации <> Неопределено тогда
		ИмяВидаОперации = СтрШаблон("Перечисление.бестВидыОпераций.%1", ВидОперации);
		ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение(ИмяВидаОперации));
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ИмяФормыДокумента = СтрШаблон("Документ.%1.ФормаОбъекта", ИмяДокумента);
	ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеПоляРасшифровки(Расшифровка, ОтчетДанныеРасшифровки)
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
	
	ЭлементРасшифровки = ДанныеРасшифровки.Элементы.Получить(Расшифровка);
	Если ЭлементРасшифровки.ОсновноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		ПоляРасшифровки = ЭлементРасшифровки.ПолучитьПоля(); 
		Если ЗначениеЗаполнено(ПоляРасшифровки[0].Значение) Тогда
			Возврат ПоляРасшифровки[0].Значение;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьОтборПоТипуПД(КомпоновщикНастроекДанныхОтчета, ИспользованиеОтбора, ТипПД)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПолеТипПД = Новый ПолеКомпоновкиДанных("ПлатежныйДокументТипЗадолженности");
	ИдентификаторПользовательскойНастройки = Неопределено;
	Для каждого ОтборКД Из КомпоновщикНастроекДанныхОтчета.Настройки.Отбор.Элементы Цикл
		Если ОтборКД.ЛевоеЗначение = ПолеТипПД Тогда
			ИдентификаторПользовательскойНастройки = ОтборКД.ИдентификаторПользовательскойНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	Для каждого ПараметрНастроекКД Из КомпоновщикНастроекДанныхОтчета.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ПараметрНастроекКД) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
			Если ПараметрНастроекКД.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки Тогда
				ПараметрНастроекКД.ПравоеЗначение = ТипПД;
				ПараметрНастроекКД.Использование = ИспользованиеОтбора;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Отчет = Отчеты.бестАнализПлатежныхДокументовЭЭ.Создать();
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроекДанныхОтчета.Настройки);
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроекДанныхОтчета.ПользовательскиеНастройки);
	Отчет.КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(КомпоновщикНастроекДанныхОтчета.ФиксированныеНастройки);
	Отчет.СкомпоноватьРезультат(ТабДок);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьСтруктуруЗначенийФО()
	СтруктураФО = Новый Структура;
	СтруктураФО.Вставить("НезависимыйСбыт", энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестУчетНезависимыйСбыт"));
	СтруктураФО.Вставить("ИспользоватьТарифныеЗоны", энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны"));
	СтруктураФО.Вставить("ИспользоватьШкалыПриборовУчета", энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета"));
	СтруктураФО.Вставить("ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ", энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ"));
	СтруктураФО.Вставить("ИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ", энргОбщегоНазначения.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ"));
	Возврат СтруктураФО;
КонецФункции

&НаКлиенте
Процедура НастроитьВидимостьЭлементов()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВзаимодействиеСЭДО", "Видимость", Не НезависимыйСбыт);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОтчетПоПД", "Видимость", ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДолевыеТУУслуга", "Видимость", Не ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СубабонентыГруппаКолонокВода", "Видимость", ИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ);
	Если ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда
		ЗаголовокСтраницыТранзит = НСтр("ru = 'Транзит'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаДолевыеСхемыРасчетаТУ", "Заголовок", ЗаголовокСтраницыТранзит);
		ЗаголовокКнопкиДобавитьТранзит = НСтр("ru = 'Добавить транзитных потребителей'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СубабонентыУстановитьФормулуРасчета", "Заголовок", ЗаголовокКнопкиДобавитьТранзит);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьДанныеДоговора(ДанныеДоговора, Договор)
	// Переопределяется в расширении для заполнения дополнительных параметров структуры ДанныеДоговора
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАктуальностьДанныхОтчетаПоПД(ДанныеАктуальны)
	
	Элементы.ОтчетПоПД.ОтображениеСостояния.Видимость = Не ДанныеАктуальны;
	Если ДанныеАктуальны Тогда
		Элементы.ОтчетПоПД.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	Иначе
		Элементы.ОтчетПоПД.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		Элементы.ОтчетПоПД.ОтображениеСостояния.Текст = НСтр("ru = 'Изменились настройки. Нажмите ""Сформировать"" для получения отчета.'");
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НайтиИндексыНастроек(ЭтотОбъект)

	ПКДОбъектРасчета = Новый ПолеКомпоновкиДанных("ОбъектРасчета");
	
	ОтборыКД = ЭтотОбъект.ДокументыДоговораНастройкиКД.Отбор.Элементы;
	
	ИдентификаторПользовательскойНастройкиОбъектаРасчета = "";
	
	Для Каждого ЭлементОтбора Из ОтборыКД Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПКДОбъектРасчета Тогда
			ИдентификаторПользовательскойНастройкиОбъектаРасчета = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПользовательскиеНастройки = ЭтотОбъект.ДокументыДоговора.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ЭлементПользовательскихНастроекКДОбъектРасчета = ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройкиОбъектаРасчета);
	ЭтотОбъект.ДокументыДоговораИндексНастройкиОбъектаРасчета = ПользовательскиеНастройки.Элементы.Индекс(ЭлементПользовательскихНастроекКДОбъектРасчета);
	УстановитьОтборОбъектаРасчетаПоДоговору(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборОбъектаРасчетаПоДоговору(ЭтотОбъект)

	ПользовательскиеНастройки = ЭтотОбъект.ДокументыДоговора.КомпоновщикНастроек.ПользовательскиеНастройки;
	НастройкаОбъектРасчета = ПользовательскиеНастройки.Элементы.Получить(ЭтотОбъект.ДокументыДоговораИндексНастройкиОбъектаРасчета);
	
	СтруктураДоговор = энргОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Договор, "Организация, Район");
	ПарамерПериод = Новый ПараметрВыбора("Период", ТекДата());
	ПараметрОрганизация = Новый ПараметрВыбора("Организация", ЭтотОбъект.Организация);
	ПараметрРайон = Новый ПараметрВыбора("Район", ЭтотОбъект.Район);
	ПараметрДоговор = Новый ПараметрВыбора("Договор", ЭтотОбъект.Договор);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(ПарамерПериод);
	НовыйМассив.Добавить(ПараметрОрганизация);
	НовыйМассив.Добавить(ПараметрРайон);
	НовыйМассив.Добавить(ПараметрДоговор);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	ИмяЭлементаОбъектРасчета = СтрШаблон("КомпоновщикНастроекПользовательскиеНастройкиЭлемент%1Значение", ЭтотОбъект.ДокументыДоговораИндексНастройкиОбъектаРасчета);
	ЭлементФормыОбъектРасчета = ЭтотОбъект.Элементы[ИмяЭлементаОбъектРасчета];
	ЭлементФормыОбъектРасчета.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекДата()
	Возврат ТекущаяДатаСеанса();
КонецФункции 

&НаСервере
Процедура ДокументыДоговораПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	НайтиИндексыНастроек(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура УстановитьОперации()
	
	//Договоры
	СоздатьКнопкуОперации("бестЗаключениеДоговоровСЮридическимиЛицами", НСтр("ru = 'Регистрация характеристик договора'"), Элементы.ДокументыДоговораШапкаОперацииДоговоры, Истина);
	
	//Услуги
	СоздатьКнопкуОперации("бестОперацияСУслугамиНП", НСтр("ru = 'Подключение/отключение услуг'"), Элементы.ДокументыДоговораШапкаОперацииУслуги, Истина);
	СоздатьКнопкуОперации("бестСменаПоставщикаНП", НСтр("ru = 'Изменение поставщика услуг'"), Элементы.ДокументыДоговораШапкаОперацииУслуги);
	
	//Приборы
	СоздатьКнопкуОперации("бестОперацияСПриборомУчетаНП", НСтр("ru = 'Акт ввода/ вывода/ замены ПУ'"), Элементы.ДокументыДоговораШапкаОперацииПУ, Истина);
	СоздатьКнопкуОперации("бестУстановитьДатуПоверкиПУ", НСтр("ru = 'Изменение даты поверки приборов учета'"), Элементы.ДокументыДоговораШапкаОперацииПУ);
	СоздатьКнопкуОперации("бестИзменитьНомерПломбыПрибораУчета", НСтр("ru = 'Операция с пломбами'"), Элементы.ДокументыДоговораШапкаОперацииПУ);	
		
	//Показания
	СоздатьКнопкуОперации("бестРегистрацияПоказанийНП", НСтр("ru = 'Регистрация показаний'"), Элементы.ДокументыДоговораШапкаОперацииПоказания, Истина);
	СоздатьКнопкуОперации("бестРегистрацияПоказанийНПОбщий", НСтр("ru = 'Регистрация показаний (массовый ввод)'"), Элементы.ДокументыДоговораШапкаОперацииПоказания);
	
	Если ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда
		
		//Договоры
		СоздатьКнопкуОперации("энргОперацияСТочкамиПоставки", НСтр("ru = 'Операция с точками поставки'"), Элементы.ДокументыДоговораШапкаОперацииДоговоры);
		СоздатьКнопкуОперации("бестУстановитьТочкиПоставкиНаОбъектРасчета", НСтр("ru = 'Установить точки поставки на объект расчета'"), Элементы.ДокументыДоговораШапкаОперацииДоговоры);
		
		//Услуги
		СоздатьКнопкуОперации("бестИзменитьПараметрыТочкиУчета", НСтр("ru = 'Изменение параметров точки учета'"), Элементы.ДокументыДоговораШапкаОперацииУслуги);
		
		//Показания
		СоздатьКнопкуОперации("бестПочасоваяВедомость", НСтр("ru = 'Почасовая ведомость'"), Элементы.ДокументыДоговораШапкаОперацииПоказания);
		СоздатьКнопкуОперации("ОбработкабестЗагрузитьДанныеИзВнешнихИсточников", НСтр("ru = 'Загрузить данные из внешних источников'"), Элементы.ДокументыДоговораШапкаОперацииПоказания);
		СоздатьКнопкуОперации("ОбработкабестВыгрузкаИнтервальныхДанныхExcel", НСтр("ru = 'Выгрузка данных почасовых ведомостей'"), Элементы.ДокументыДоговораШапкаОперацииПоказания);
		
		//Оплата
		СоздатьКнопкуОперации("ОбработкабестФормированиеПлатежныхДокументов", НСтр("ru = 'Формирование платежных документов'"), Элементы.ДокументыДоговораШапкаОперацииОплата, Истина);
		СоздатьКнопкуОперации("бестПлатежныйДокумент", НСтр("ru = 'Платежный документ'"), Элементы.ДокументыДоговораШапкаОперацииОплата);
		СоздатьКнопкуОперации("бестПлатежноеПоручениеВходящееЭЭЮрЛица", НСтр("ru = 'Платежное поручение (входящие) ЭЭ'"), Элементы.ДокументыДоговораШапкаОперацииОплата);
		СоздатьКнопкуОперации("бестСчетФактураНаАванс", НСтр("ru = 'Счет-фактура на аванс'"), Элементы.ДокументыДоговораШапкаОперацииОплата);
		СоздатьКнопкуОперации("бестКорректировкаЗадолженности", НСтр("ru = 'Корректировка оплат'"), Элементы.ДокументыДоговораШапкаОперацииОплата);
		
		//Начисления
		СоздатьКнопкуОперации("бестПерерасчетЭЭ", НСтр("ru = 'Перерасчет ЭЭ'"), Элементы.ДокументыДоговораШапкаОперацииНачисления);
		СоздатьКнопкуОперации("ОбработкабестРасчетПоЦеновымКатегориям", НСтр("ru = 'Расчет по ценовым категориям'"), Элементы.ДокументыДоговораШапкаОперацииНачисления); 
		
	КонецЕсли;
	
	Если Не ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Или ИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ Тогда
		
		//Оплата
		СоздатьКнопкуОперации("бестПлатежноеПоручениеВходящееЮрЛица", НСтр("ru = 'Платежное поручение (входящие)'"), Элементы.ДокументыДоговораШапкаОперацииОплата);
		
		//Начисления
		СоздатьКнопкуОперации("бестПерерасчетНП", НСтр("ru = 'Перерасчет'"), Элементы.ДокументыДоговораШапкаОперацииНачисления);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуОперации(ИмяОперации, Заголовок, Родитель, ЭтоВажное = Ложь) 
	
    Команда	= Команды.Добавить(ИмяОперации);
    Команда.Действие = "ВыполнитьОперацию";

    Кнопка = Элементы.Добавить(ИмяОперации, Тип("КнопкаФормы"), Родитель);
    Кнопка.Заголовок	= Заголовок;
    Кнопка.ИмяКоманды	= ИмяОперации;
	
	Если ЭтоВажное Тогда 
		Кнопка.ЦветФона = Новый Цвет(250,204,31);
		ЖирныйШрифт = Новый Шрифт(,,Истина);
		Кнопка.Шрифт = ЖирныйШрифт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	ИмяКоманды = Команда.Имя;
	СтрокаОбработка = "Обработка";
	СтрокаОперацияСТП = "энргОперацияСТочкамиПоставки";
	Если СтрНайти(ИмяКоманды, СтрокаОбработка) Тогда
		ИмяКоманды = СтрЗаменить(ИмяКоманды, СтрокаОбработка, "");
		ОткрытьФормуОбработки(ИмяКоманды);
	ИначеЕсли СтрНайти(ИмяКоманды, СтрокаОперацияСТП) Тогда
		МассивТП = МассивТП();
		ДопЗначенияЗаполнения = Новый Структура("МассивТП", МассивТП);
		ЗначенияЗаполнения = Новый Структура("ДопЗначенияЗаполнения", ДопЗначенияЗаполнения);
		ПараметрыФормы = Новый Структура("ЗаполнитьДокумент, ЗначенияЗаполнения", Истина, ЗначенияЗаполнения);
		ИмяФормыДокумента = СтрШаблон("Документ.%1.ФормаОбъекта", ИмяКоманды);
		ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы);
	Иначе
		ОткрытьФормуНовогоДокумента(ИмяКоманды, Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяОбработки)

	КлючиПараметров = "Организация, Район, Договор, ТочкаУчета";
	ПараметрыФормы = Новый Структура(КлючиПараметров);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЭтотОбъект, КлючиПараметров);
	ИмяФормыДокумента = СтрШаблон("Обработка.%1.Форма", ИмяОбработки);
	ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопкиОбновитьДанные()
	Если ЗначениеЗаполнено(Договор) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбновитьДанные", "Доступность", Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МассивТП()
	Возврат ТочкиПоставки.Выгрузить(, "ТочкаПоставки").ВыгрузитьКолонку("ТочкаПоставки");
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПараметрыДинамическогоСпискаДолевыеТУ()

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДолевыеТУ, "Организация", Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДолевыеТУ, "Район", Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДолевыеТУ, "Договор", Договор);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыДинамическогоСпискаСубабоненты(ТекущиеДанные = Неопределено)

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Субабоненты, "Организация", Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Субабоненты, "Район", Район);
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Новый Структура("ОбъектРасчета, ТочкаУчета, Услуга",
											ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка"),
											ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка"),
											ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка"));
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Субабоненты, "ОбъектРасчета", ТекущиеДанные.ОбъектРасчета);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Субабоненты, "ТочкаУчета", ТекущиеДанные.ТочкаУчета);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Субабоненты, "Услуга", ТекущиеДанные.Услуга);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыДинамическогоСпискаДокументыДоговора()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыДоговора, "Договор", Договор);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределеляемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеОСуммахНачислений(Организация, Район, Договор)

	Возврат бестРаботаСРабочимМестомОператораЮЛ.ДанныеОСуммахНачислений(Организация, Район, Договор);

КонецФункции

#Область ОбработчикиСобытийОповещения

// Процедура - Обработка выбора договора
//
// Параметры:
//  Результат				 - СправочникСсылка.энргДоговорыКонтрагентов 
//  ДополнительныеПараметры	 - Структура 
//
&НаКлиенте
Процедура ОбработкаВыбораДоговора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока  			= Результат;
	
	Если ТекСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.Ссылка = Договор тогда
		Возврат;
	КонецЕсли;
	Договор = ТекСтрока.Ссылка;
	УстановитьДоступностьКнопкиОбновитьДанные();
	ЗаполнитьДанныеДоговора();
	
КонецПроцедуры
 
// Процедура - Вызывается при завершении получения данных по объектам расчета и заполняет реквизиты формы
//
// Параметры:
//  Результат				 - Структура - Результат выполнения фонового задания
//  ДополнительныеПараметры	 - Структура 
//
&НаКлиенте
Процедура ПриЗавершенииПолученияДанныхПоОбъектамРасчета(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		ПоказатьПредупреждение( ,Результат.КраткоеПредставлениеОшибки);
		
		Возврат;
	КонецЕсли;
	
	ДанныеОбъектов = ПолучитьДанныеОбъектов(Результат, ДеревоДанныеПоТУ, ДеревоДанныеПоПУ, ДеревоДанныеПоИзмерительномуКомплексу);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОбъектов.ДанныеПоУмолчанию);
	
	ЗаполнитьТЧФормы(ДанныеОбъектов.МассивОбъектов, "ОбъектыРасчета");
	ЗаполнитьТЧФормы(ДанныеОбъектов.МассивТП, "ТочкиПоставки");
	
	СтрокаДерева = ДеревоДанныеПоТУ.ПолучитьЭлементы();
	ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеОбъектов.ДеревоДанныеПоТУ.ПолучитьЭлементы());
	
	СтрокаДерева = ДеревоДанныеПоПУ.ПолучитьЭлементы();
	ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеОбъектов.ДеревоДанныеПоПУ.ПолучитьЭлементы());
	
	СтрокаДерева = ДеревоДанныеПоИзмерительномуКомплексу.ПолучитьЭлементы();
	ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеОбъектов.ДеревоДанныеПоИзмерительномуКомплексу.ПолучитьЭлементы());
	ПриЗавершенииПолученияДанныхПоОбъектамРасчетаПереопределяемый(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

// Процедура - Вызывается при завершении формирования отчета по ПД и выводит табличный документ на форму
//
// Параметры:
//  Результат				 - Структура - Результат выполнения фонового задания
//  ДополнительныеПараметры	 - Структура 
//
&НаКлиенте
Процедура ПриЗавершенииФормированияОтчетаПоПД(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		
		Возврат;
	КонецЕсли;
	
	ДанныеОтчета = ПолучитьДанныеОтчета(Результат);
	
	ОтчетПоПД = ДанныеОтчета.Отчет;
	ОтчетПоПДДанныеРасшифровки = ДанныеОтчета.ОтчетДанныеРасшифровки;
	ОтчетПоПДКомпоновщикНастроек.ЗагрузитьНастройки(ДанныеОтчета.НастройкиКД);
	
	ИзменитьАктуальностьДанныхОтчетаПоПД(Истина);

КонецПроцедуры

#КонецОбласти 

#Область ПереопределяемыеПроцедурыИФункциии

&НаКлиенте
Процедура ЗаполнитьДанныеДоговораПереопределяемый(ВидимостьДанныхОбъектов = Ложь)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииПолученияДанныхПоОбъектамРасчетаПереопределяемый(Результат, ДополнительныеПараметры)
	// Переопределяется в расширении 
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКоллекцииПереопределяемый()
	// Переопределяется в расширении
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоЗначениеСсылочногоТипа(Значение)
	Возврат ОбщегоНазначения.ЗначениеСсылочногоТипа(Значение);
КонецФункции

&НаКлиенте
Процедура ОткрытьЗначениеСсылкиВДереве(ИмяТаблицыФормы, ИмяПоля)

	ИмяКлючаТаблицы = СтрШаблон("%1Ключ", ИмяТаблицыФормы);
	ИмяЗначенияТаблицы = СтрШаблон("%1Значение", ИмяТаблицыФормы);
	ТекущиеДанные = Элементы[ИмяТаблицыФормы].ТекущиеДанные;
	Если ИмяПоля = ИмяКлючаТаблицы И ЭтоЗначениеСсылочногоТипа(ТекущиеДанные.Ключ) Тогда
		 ПоказатьЗначение(, ТекущиеДанные.Ключ);
	КонецЕсли;
	Если ИмяПоля = ИмяЗначенияТаблицы И ЭтоЗначениеСсылочногоТипа(ТекущиеДанные.Значение) Тогда
		 ПоказатьЗначение(, ТекущиеДанные.Значение);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
