#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ОбъектПечати,ИмяМакета,ТаблицаМакета,Организация,Район,Период",  ПараметрКоманды,"ПФ_MXL_АктПриемаПередачи","Документ.бестПлатежныйДокумент",энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды,"Организация"),энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды,"Район"), энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды,"Дата"));
	ОткрытьФорму("ОбщаяФорма.бестФормаПечатныхФорм", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти