#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	ПрошедшиеЭтапы = Новый Массив;
	
	Для каждого СтрокаТЧ Из Этапы Цикл
		Если ПрошедшиеЭтапы.Найти(СтрокаТЧ.Этап) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокСтрок = Этапы.НайтиСтроки(Новый Структура("Этап", СтрокаТЧ.Этап));
		Если СписокСтрок.Количество() > 1 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Повторяется этап " + Строка(СтрокаТЧ.Этап));
		КонецЕсли;
		
		ПрошедшиеЭтапы.Добавить(СтрокаТЧ.Этап);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ТипОРП = Перечисления.энргТипыЭтапов.ОграничениеРежимаПотребления;
	
	Если СхемаОРП Тогда
		ТекстОшибки = "Этап не относится к ОРП";
	Иначе
		ТекстОшибки = "В схему нельзя включать этапы ОРП";
	КонецЕсли;

	
	Для каждого СтрокаТЧ Из Этапы Цикл
		ТипЭтапа = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Этап, "Тип");
		
		Если (ТипЭтапа = ТипОРП) <> СхемаОРП Тогда
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ,"Этапы[" + (СтрокаТЧ.НомерСтроки-1) + "].Этап", "Объект");				
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли