#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает сведений о файлах.
//
// Параметры:
//  Файлы	-	ОпределяемыйТип.ПрисоединенныйФайл.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция РезультатПолученияСведенийОФайлах(Файлы) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСведенияОФайлахДополнительныеРеквизитыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжСведенияОФайлахДополнительныеРеквизитыМенеджер"].РезультатПолученияСведенийОФайлах(Файлы);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= энргРаботаСПрикрепленнымиФайламиСервер.РезультатПолученияСведенийОФайлах(Файлы);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргСведенияОФайлахДополнительныеРеквизиты.РезультатПолученияСведенийОФайлах";
		ПараметрыМетода 			= Новый Структура("Файлы", Файлы);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат; 	
	
КонецФункции

#КонецОбласти

#КонецЕсли