#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НомераСтрокСтабильногоПериода(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНомераСтрокСтабильногоПериода());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, ДатаРегистратора, ДокРегистратор";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргНомераСтрокСтабильногоПериодаСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

Функция ТекстЗапросаНомераСтрокСтабильногоПериода() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.Организация КАК Организация,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.Район КАК Район,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.ЧастныйСектор КАК ЧастныйСектор,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.Строение КАК Строение,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.Помещение КАК Помещение,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.Услуга КАК Услуга,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.ДатаРегистратора КАК ДатаРегистратора,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.ДокРегистратор КАК ДокРегистратор,
	|	энргНомераСтрокСтабильногоПериодаСрезПоследних.НомерПозиции КАК НомерПозиции
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериода.СрезПоследних КАК энргНомераСтрокСтабильногоПериодаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли