#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Для каждого стр из Абоненты цикл
		Запись 						= Движения.энргВзаиморасчетыПоПени.ДобавитьПриход();
		Запись.Организация 			= Организация;
		Запись.Район 				= Район;
		Запись.Период			 	= Дата;
		Запись.Регистратор		 	= Ссылка;
		ЗаполнитьЗначенияСвойств(Запись,стр);
		Запись.ПериодНачисления 	= ПериодНачисления;		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли