

Функция ВыполнитьЗапрос(СхемаЗапроса,Параметры, МВТ = Неопределено) Экспорт 
	
	Запрос = ИнициализироватьЗапрос(СхемаЗапроса, Параметры, МВТ);	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ВыполнитьПакет(СхемаЗапроса,Параметры, МВТ = Неопределено) Экспорт 
	
	Запрос 								= ИнициализироватьЗапрос(СхемаЗапроса, Параметры, МВТ);	
	РезультатЗапроса 					= Запрос.ВыполнитьПакет();
	Возврат РезультатЗапроса; 	
	
КонецФункции

Функция ИнициализироватьЗапрос(СхемаЗапроса, Параметры, МВТ)
	
	Запрос 								 	= Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());;
	УстановитьМенеджерВременныхТаблиц(Запрос, МВТ);
	ЗаполнитьПараметрыЗапроса(Запрос, Параметры);
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(Запрос, Параметры) 
	
	ПараметрыЗапроса  = Запрос.НайтиПараметры();
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ЗначениеПараметра 				= Параметры[ПараметрЗапроса.Имя];
		Запрос.УстановитьПараметр(ПараметрЗапроса.Имя, ЗначениеПараметра);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьМенеджерВременныхТаблиц(Запрос, МВТ) 
	
	Если Не МВТ  = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Иначе
		Запрос.МенеджерВременныхТаблиц 	= Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
КонецПроцедуры


