
#Область СтандартныеПроцедуры
&НаКлиенте
Процедура Сформировать(Команда)
	Если Организация.Пустая() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполненно поле Организация");	
		Возврат;
	КонецЕсли;
	
	
	Результат = Новый Структура("ПериодФормированияКвитанций, Организация, Район", ПериодФормированияКвитанций, Организация, Район);
		
	ИмяМакета  			= "ПФ_MXL_бестКвитанция";
	ТаблицаМакета 		= "Обработка.энргПечатьКвитанций";
	
	МассивОбъектов = Новый Массив;
	//МассивОбъектов = Районы.ВыгрузитьЗначения();
	МассивОбъектов.Добавить(Организация);
	МассивОбъектов.Добавить(Район);	
	Для Каждого ТекЭлемент Из МКД Цикл
		МассивОбъектов.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из Контролеры Цикл
		МассивОбъектов.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из Абоненты Цикл
		МассивОбъектов.Добавить(ТекЭлемент.Значение);
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТаблицаМакета,ИмяМакета,МассивОбъектов,ЭтотОбъект,Результат);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивОбъектов = Новый Массив; 
	Если Параметры.Свойство("МассивОбъектов", МассивОбъектов) Тогда
		Для каждого ОбъектОтбора из МассивОбъектов Цикл
			Если ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргАбоненты") тогда
				Абоненты.Добавить(ОбъектОтбора);
			//ИначеЕсли  ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргЗоныОтвественности") тогда
			//	Районы.Добавить(ОбъектОтбора);
			ИначеЕсли  ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргМногоквартирныеДома") тогда
				МКД.Добавить(ОбъектОтбора);
			ИначеЕсли  ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.энргСотрудники") тогда
				Контролеры.Добавить(ОбъектОтбора);
			КонецЕсли;			
		КонецЦикла;
		Организация = МассивОбъектов[0].Организация;
		Район = МассивОбъектов[0].Район;
		
		////Элементы.Абоненты.Доступность		= Ложь;
		////Элементы.Районы.Доступность			= Ложь;
		////Элементы.МКД.Доступность			= Ложь;
		////Элементы.Контролеры.Доступность		= Ложь;
		////Элементы.Организация.Доступность	= Ложь;
	КонецЕсли;
	ПериодФормированияКвитанций = ТекущаяДатаСеанса();
	ВывестиПериодНачисления();
КонецПроцедуры

&НаСервере
Процедура ВывестиПериодНачисления()
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПериодФормированияКвитанций, Организация, Район);
КонецПроцедуры	

&НаКлиенте
Процедура ПериодФормированияКвитанцийПриИзменении(Элемент)
	ВывестиПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ВывестиПериодНачисления();
КонецПроцедуры

#КонецОбласти

