#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает признак судебной задолженности абонента.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  МКД			-	СправочникСсылка.энргСтроения.
//  Абонент		-	СправочникСсылка.энргАбоненты.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьПризнакСудебнойЗадолженностиАбонента(Период, Организация, Район, МКД, Абонент)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПризнакСудебнойЗадолженностиАбонента(); 
		
	Запрос.УстановитьПараметр("Период", Период); 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район); 
	Запрос.УстановитьПараметр("МКД", МКД);	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат	РезультатЗапроса;
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПризнакСудебнойЗадолженностиАбонента()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Период КАК Период,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Организация КАК Организация,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Район КАК Район,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.ПризнакСудебнойЗадолженности КАК ПризнакСудебнойЗадолженности
	|ИЗ
	|	РегистрСведений.энргПризнакСудебнойЗадолженностиАбонента.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции   

#КонецОбласти

#КонецЕсли