#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
 
	
	КомандаОтчет 									= КомандыОтчетов.Добавить();	
	КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.ДвиженияДокумента.ПолноеИмя();
	КомандаОтчет.Представление 						= НСтр("ru = 'Движения документа'");
	КомандаОтчет.ФункциональныеОпции 				= "";
	КомандаОтчет.ИмяФормы 							= "Отчет.ДвиженияДокумента.Форма";
	КомандаОтчет.МножественныйВыбор 				= Ложь;
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерефейса_Проведение
 
#КонецОбласти

#КонецЕсли