#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДанныеОплаты() Экспорт
	
	ГраницыОтчетногоПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);	
	ЗавершениеОП 	= ГраницыОтчетногоПериода.ЗавершениеОП;	

	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("МКД", 				МКД);
	Запрос.УстановитьПараметр("Дата", 				ЗавершениеОП-1);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ОбъемНачислений", 	ЭтотОбъект.Движения.энргНачислениеПени.Выгрузить());
	Запрос.Текст 	=
	
	"ВЫБРАТЬ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодРасчета КАК ПериодНачисления,
	|	ОбъемНачислений.Район КАК Район,
	|	&МКД КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	//|	&Дата КАК Дата,
	|	ОбъемНачислений.Период КАК Дата,
	|	&Ссылка КАК ДокРегистратор,
	|	ОбъемНачислений.Сумма КАК СуммаОплаты,
	|	ЛОЖЬ КАК ЭтоОплата,
	|	ЛОЖЬ КАК ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&ОбъемНачислений КАК ОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка КАК Ссылка,
	|	энргПерерасчет.Район КАК Район,
	|	энргПерерасчет.Организация КАК Организация
	|ПОМЕСТИТЬ ДанныеШапки
	|ИЗ
	|	Документ.энргНачислениеПени КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемНачислений.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Дата КАК Дата,
	|	ОбъемНачислений.ДокРегистратор КАК ДокРегистратор,
	|	СУММА(ОбъемНачислений.СуммаОплаты) КАК СуммаОплаты,
	|	ОбъемНачислений.ЭтоОплата КАК ЭтоОплата,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты,
	|	МАКСИМУМ(ОбъемНачислений.Поставщик) КАК Поставщик
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ПО ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Организация,
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.Район,
	|	ОбъемНачислений.ЭтоОплата,
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Дата,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	ОбъемНачислений.ДокРегистратор";
 

	ДополнительныеСвойства.Вставить("ДанныеОплаты", Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроведениеРазрешено	= Ложь;
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
 	
	Ответственный = Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("Кассир", 						Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления", 			Неопределено);
	ДополнительныеСвойства.Вставить("ЭтоОплата", 					Ложь);
	ДополнительныеСвойства.Вставить("ОтложеннаяЗапись", 			Истина);
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",				Истина);	
	
	Если ПометкаУдаления Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Записать();
		КонецЦикла;
	КонецЕсли;
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли