#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НаборЗаписейОбъемаНачисленийЗаПериод(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаборЗаписейЗаПериод());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	ИсточникОбороты						= ОператорВыбора.Источники[1].Источник;
	ПараметрыВременнойТаблицы 			= ИсточникОбороты.Параметры;
	
	ПараметрНачалоПериода 				= ПараметрыВременнойТаблицы[0];
	Если Параметры.Свойство("НачалоПериода") Тогда
		ПараметрНачалоПериода.Выражение = Новый ВыражениеСхемыЗапроса("&" + Параметры["НачалоПериода"].ИмяПараметра);
	КонецЕсли;
	
	ПараметрОкончаниеПериода 		= ПараметрыВременнойТаблицы[1];
	Если Параметры.Свойство("ОкончаниеПериода") Тогда
		ПараметрОкончаниеПериода.Выражение = Новый ВыражениеСхемыЗапроса("&" + Параметры["ОкончаниеПериода"].ИмяПараметра);
	КонецЕсли; 
	
	ПараметрыОтбор			 		= ПараметрыВременнойТаблицы[3];
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, Регистратор";		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрыОтбор,Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуНаборомЗаписей(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуНаборомЗаписей());
	Пакет.ТаблицаДляПомещения 			= "ОбъемНачисленийПолный";
	ОператорВыбора 						= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Регистратор, Период, КлючПомещения, Абонент";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачислений",Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуНаборомЗаписейБезСторно());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	
КонецПроцедуры

Процедура ПрочитатьЗаписиПоПомещениюДоЗаписи(НаборОбъемНачислений) Экспорт
	
	Запрос  = Новый Запрос(ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи());
	Запрос.УстановитьПараметр("Регистратор", 	НаборОбъемНачислений.ДополнительныеСвойства["ДокРегистратор"]);
	Запрос.УстановитьПараметр("Организация", 	НаборОбъемНачислений.ДополнительныеСвойства["Организация"]);
	Запрос.УстановитьПараметр("Район", 			НаборОбъемНачислений.ДополнительныеСвойства["Район"]);
	Запрос.УстановитьПараметр("Строение", 		НаборОбъемНачислений.ДополнительныеСвойства["Строение"]);
	Запрос.УстановитьПараметр("Помещение", 		НаборОбъемНачислений.ДополнительныеСвойства["Помещение"]);
	НаборОбъемНачислений.ДополнительныеСвойства.Вставить("ДанныеНабораДоЗаписи", Запрос.Выполнить().Выгрузить());
КонецПроцедуры 

Функция СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор) Экспорт
	
	Набор  = СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Регистратор);
	
	Возврат Набор;
	
КонецФункции

Процедура ОчиститьНаборЗаписейПоРегистратору(Регистратор) Экспорт
	
	Набор = СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор);
	Набор.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаборЗаписейПоКлючуПомещения());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
		
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Период,Организация,ПериодНачисления,Район,ЧастныйСектор,Распределение,Строение,Помещение,Услуга,ТочкаУчета,Регистратор";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачислений",ПараметрыСхемы.ПараметрыВТ,ДоступныеПараметры);
		
		ДоступныеПараметры 			= "КлючПомещения";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачислений",ПараметрыСхемы.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуНаборомЗаписейРаспределенияПоКлючуПомещения(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуНаборомЗаписей());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
		
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Период,Организация,ПериодНачисления,Район,ЧастныйСектор,Распределение,Строение,Помещение,Услуга,ТочкаУчета,Регистратор,Абонент";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачислений",ПараметрыСхемы.ПараметрыВТ,ДоступныеПараметры);
		
		ДоступныеПараметры 			= "Абонент";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачислений",ПараметрыСхемы.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЗаписиПоКлючамПомещений(НаборОбъемНачислений) Экспорт
	
	НаборОбъемНачислений.Прочитать();		
	СтрокиУдалить 							= Новый Массив;
	МассивКлючейПомещений 					= НаборОбъемНачислений.ДополнительныеСвойства["МассивКлючейПомещений"];
	Для Каждого СтрокаНабора ИЗ НаборОбъемНачислений Цикл
		Если МассивКлючейПомещений.Найти(СтрокаНабора.КлючПомещения) = Неопределено Тогда
			Продолжить;
		КонецЕсли;			
		СтрокиУдалить.Добавить(СтрокаНабора);
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		НаборОбъемНачислений.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьСуммы(СтрокНабора, ДопЧисло = 1) Экспорт
	
	ПовыщающийКоэффициент 							= Макс(1,СтрокНабора.ПовыщающийКоэффициент);	
	СтрокНабора.Сумма 								= Окр(СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа,2)  * ДопЧисло * ПовыщающийКоэффициент + Окр(СтрокНабора.ОбъемУслугиПотери * СтрокНабора.ЗначениеТарифа,2);
	Если ПовыщающийКоэффициент > 1 Тогда
		СтрокНабора.СуммаПоПовышенномуКоэффициенту 	= Окр(СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа,2) * (ПовыщающийКоэффициент - 1);
	КонецЕсли;
	
	Если СтрокНабора.ПроцентСниженияСтоимости > 0 Тогда
		СуммаСниженияСтоимости 				= СтрокНабора.Сумма * СтрокНабора.ПроцентСниженияСтоимости / 100;
		СтрокНабора.СуммаСниженияСтоимости  = СуммаСниженияСтоимости;
		СтрокНабора.Сумма 					= СтрокНабора.Сумма - СтрокНабора.СуммаСниженияСтоимости;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммуПоПотребленномуОбъему(СтрокНабора, ДопЧисло = 1)  Экспорт
	
	ПовыщающийКоэффициент 							= Макс(1,СтрокНабора.ПовыщающийКоэффициент);	
	СтрокНабора.Сумма 								= Окр(СтрокНабора.ОбъемУслугиПотребленный * СтрокНабора.ЗначениеТарифа,2) * ДопЧисло * ПовыщающийКоэффициент + + Окр(СтрокНабора.ОбъемУслугиПотребленныйПотери * СтрокНабора.ЗначениеТарифа,2);
	Если ПовыщающийКоэффициент > 1 Тогда
		СтрокНабора.СуммаПоПовышенномуКоэффициенту 	= Окр(СтрокНабора.ОбъемУслугиПотребленный * СтрокНабора.ЗначениеТарифа,2) * (ПовыщающийКоэффициент - 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНеЗначащиеЗаписи(Набор) Экспорт
	
	Регистратор = Набор.Отбор.Регистратор.Значение;
	ЭтоНачисление = ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачисление");
	
	ДиапазонПоУмолчанию = Справочники.энргДиапазоныДифференцированныхТарифов.ДиапазонПоУмолчанию();
	//Справочники.энргДиапазоныДифференцированныхТарифов.НайтиПоНаименованию("Диапазон 1", Истина);
	
	ЭтоИндивидульныйРасчет = Набор.ДополнительныеСвойства.Свойство("ДанныеНабораДоЗаписи");
	
	ДобавитьВНачисленныйСредний = СоздатьНаборЗаписей();	
	
	Если НЕ ЭтоИндивидульныйРасчет Тогда 
		УдаленныеЗаписи = РегистрыСведений.энргТочкиУчетаСНулевымРасходом.СоздатьТаблицуЗначений();
	КонецЕсли;
	
	СтрокиУдалить 					= Новый Массив;

	ПоПриборам = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.энргСпособНачислений.ПоПриборам");
	НачислениеПоСреднему = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.энргСпособНачислений.НачислениеПоСреднему");
	СреднееПоНормативу = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.энргСпособНачислений.СреднееПоНормативу");
	ПоФормуламРасчета = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.энргСпособНачислений.ПоФормуламРасчета");
	ФиксированныйОбъем = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.энргСпособНачислений.ФиксированныйОбъем");
	
	ДатаСменыПостановленияДобавлениеДиапазонов = Справочники.энргДиапазоныДифференцированныхТарифов.ДатаСменыПостановленияДобавлениеДиапазонов();
	
	Для Сч = 0 По Набор.Количество() -1 Цикл		
		
		СтрокаНабора = Набор[Сч];
		
		Если ЭтоНачисление и СтрокаНабора.ПериодНачисления >= ДатаСменыПостановленияДобавлениеДиапазонов Тогда
			СтрокаНабора.ДиапазонДифференцированногоТарифа = ДиапазонПоУмолчанию;
		КонецЕсли;
		
		Если СтрокаНабора.УслугаОграничена Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаНабора.ДоговорЗаключенДоТП Тогда
			СтрокиУдалить.Добавить(СтрокаНабора);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаНабора.Поставщик = СтрокаНабора.ФизЛицо Тогда
			СтрокиУдалить.Добавить(СтрокаНабора);
			Продолжить;
		КонецЕсли;
				
		Если СтрокаНабора.Техническая Тогда
			СтрокаНабора.ОбъемУслугиТехнический = СтрокаНабора.ОбъемУслуги;
			СтрокаНабора.ОбъемУслуги 			= 0;
		КонецЕсли;   		
		
		Если СтрокаНабора.СпособНачисления = ПоПриборам
			И СтрокаНабора.СниматьНачисленныйСредний И Не СтрокаНабора.УслугаПолностьюОприборена Тогда
			
			СтрокиУдалить.Добавить(СтрокаНабора);
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДобавитьВНачисленныйСредний.Добавить(), СтрокаНабора);
		
		Если СтрокаНабора.СпособНачисления = ПоПриборам
			И СтрокаНабора.СниматьНачисленныйСредний Тогда
			СтрокиУдалить.Добавить(СтрокаНабора);			
		ИначеЕсли СтрокаНабора.СпособНачисления = ПоПриборам
			И СтрокаНабора.СниматьНачисленныйСреднийЗависимыхТочек Тогда
			СтрокиУдалить.Добавить(СтрокаНабора);			
		ИначеЕсли СтрокаНабора.СпособНачисления = ПоПриборам Тогда
			Продолжить;
		ИначеЕсли СтрокаНабора.СпособНачисления = НачислениеПоСреднему Тогда
			Продолжить;
		ИначеЕсли СтрокаНабора.СпособНачисления = СреднееПоНормативу Тогда
			Продолжить;	
		ИначеЕсли СтрокаНабора.СпособНачисления = ПоФормуламРасчета Тогда
			Продолжить;	
		ИначеЕсли СтрокаНабора.СпособНачисления = ФиксированныйОбъем Тогда
			Продолжить;
		ИначеЕсли  
			СтрокаНабора.ОбъемУслуги = 0 И СтрокаНабора.ОбъемУслугиПотребленный = 0 
			И СтрокаНабора.Сумма = 0 и СтрокаНабора.СуммаПоПовышенномуКоэффициенту = 0 Тогда
			СтрокиУдалить.Добавить(СтрокаНабора);
		КонецЕсли;		
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		
		СтрокаКУдалению = СтрокиУдалить[Сч];		
		Если НЕ ЭтоИндивидульныйРасчет И НЕ СтрокаКУдалению.ДоговорЗаключенДоТП Тогда
			НоваяСтрока = УдаленныеЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКУдалению);
		КонецЕсли; 	
		
		Набор.Удалить(СтрокиУдалить[Сч]);
		
	КонецЦикла;	
	
	Набор.ДополнительныеСвойства.Вставить("ОтложенныеНачисленияПоПриборам", ДобавитьВНачисленныйСредний);
	
	Если НЕ ЭтоИндивидульныйРасчет Тогда 
		Набор.ДополнительныеСвойства.Вставить("УдаленныеЗаписи", УдаленныеЗаписи);
	КонецЕсли;  	
	
КонецПроцедуры

Функция РезультатНачисленныйСреднийОбъем(тзНабор) Экспорт 
	
	Запрос  = Новый Запрос(ТекстЗапросаДанныеНачисленныйСреднийОбъем());
	Запрос.УстановитьПараметр("НаборОтложенные", тзНабор);
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ОтложенныеНачисленияПоПриборамДляСписания(тзНабор) Экспорт
	Запрос  = Новый Запрос(ТекстЗапросаДанныеНачисленныйСреднийОбъемДляСписания());
	Запрос.УстановитьПараметр("НаборОтложенные", тзНабор);
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПередачаДанныхВБухгалетерию

Процедура НаборЗаписейДляПередачиДанныхПоФактическойСезонности(Схема,Параметры) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе	
		Пакет  = Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъемыДляПередачиДанныхВБухгалтериюПоФактическомуОбъему());
	  	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНаборЗаписейЗаПериод()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК ОбъемНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений.Обороты(, , Запись, ) КАК ОбъемНачисленийОбороты
	|		ПО ОбъемНачислений.Период = ОбъемНачисленийОбороты.Период
	|			И ОбъемНачислений.Регистратор = ОбъемНачисленийОбороты.Регистратор
	|			И ОбъемНачислений.НомерСтроки = ОбъемНачисленийОбороты.НомерСтроки";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьСхемуНаборомЗаписей()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК ОбъемНачислений";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьСхемуНаборомЗаписейБезСторно()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачисленийПолный.*
	|ИЗ
	|	ОбъемНачисленийПолный КАК ОбъемНачисленийПолный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемНачисленийПолный КАК ОбъемНачисленийПолныйПрав
	|		ПО ОбъемНачисленийПолный.НомерСтроки = ОбъемНачисленийПолныйПрав.НомерСторнируемойСтроки
	|ГДЕ
	|	ОбъемНачисленийПолныйПрав.НомерСтроки ЕСТЬ NULL
	|	И НЕ ОбъемНачисленийПолный.ЭтоСторно";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи()
	
	Текст  =
	"ВЫБРАТЬ
	|	Набор.*
	|ПОМЕСТИТЬ ВТ_СтрокиПомещения
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК Набор
	|ГДЕ
	|	Набор.Регистратор = &Регистратор
	|	И Набор.Организация = &Организация
	|	И Набор.Район = &Район
	|	И НЕ Набор.Распределение
	|	И Набор.Строение = &Строение
	|	И Набор.Помещение В(&Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтрокиПомещения.*
	|ИЗ
	|	ВТ_СтрокиПомещения КАК ВТ_СтрокиПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтрокиПомещения КАК ВТ_СтрокиПомещенияПрав
	|		ПО ВТ_СтрокиПомещения.НомерСтроки = ВТ_СтрокиПомещенияПрав.НомерСторнируемойСтроки
	|ГДЕ
	|	ВТ_СтрокиПомещенияПрав.Организация ЕСТЬ NULL
	|	И НЕ ВТ_СтрокиПомещения.ЭтоСторно";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъемыДляПередачиДанныхВБухгалтериюПоФактическомуОбъему()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВЫБОР
	|		КОГДА НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|			ТОГДА энргОбъемНачислений.ОбъемУслуги
	|		ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|			ТОГДА энргОбъемНачислений.ОбъемУслуги
	|		ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|	КОНЕЦ * энргОбъемНачислений.ЗначениеТарифа КАК Сумма
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	НЕ энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеНачисленныйСреднийОбъем()
	Текст = 
	"ВЫБРАТЬ
	|	Набор.Период КАК Период,
	|	Набор.Район КАК Район,
	|	Набор.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоФормуламРасчета) КАК СпособНачисления,
	|	ВЫБОР
	|		КОГДА Набор.ВладелецЗависимойТочкиУчета = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|			ТОГДА Набор.Абонент
	|		ИНАЧЕ Набор.ВладелецЗависимойТочкиУчета
	|	КОНЕЦ КАК Абонент,
	|	Набор.Услуга КАК Услуга,
	|	Набор.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Набор.ЗависимаяТочкаУчета КАК ТочкаУчета,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка) КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(СПравочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	ЗНАЧЕНИЕ(СПравочник.энргТарифныеЗоны.БезРазбивки) КАК ТарифнаяЗона,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	-ВЫБОР
	|		КОГДА Набор.Техническая
	|			ТОГДА Набор.ОбъемУслугиТехнический
	|		ИНАЧЕ Набор.ОбъемУслуги
	|	КОНЕЦ * Набор.КоэффициентФормула КАК ОбъемУслуги,
	|	-Набор.ОбъемУслугиПотребленный * Набор.КоэффициентФормула КАК ОбъемУслугиПотребленный,
	|	-Набор.ОбъемУслугиПотери * Набор.КоэффициентФормула КАК ОбъемУслугиПотери,
	|	-Набор.ОбъемУслугиПотребленныйПотери * Набор.КоэффициентФормула КАК ОбъемУслугиПотребленныйПотери,
	|	-Набор.Сумма * Набор.КоэффициентФормула КАК Сумма,
	|	Набор.Поставщик КАК Поставщик,
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ЧастныйСектор КАК ЧастныйСектор,
	|	Набор.ПериодНачисления КАК ПериодНачисления,
	|	Набор.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	Набор.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Набор.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Набор.КоэффициентФормула КАК КоэффициентФормула,
	|	ЛОЖЬ КАК ИзменятьВзаиморасчеты,
	|	Набор.СверхНорматива КАК СверхНорматива,
	|	Набор.ВидБлагоустройства КАК ВидБлагоустройства,
	|	Набор.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	Набор.НормаПотребления КАК НормаПотребления
	|ПОМЕСТИТЬ Промежуточная_СниматьНачисленныйСреднийПоФормулам
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	(НЕ Набор.Сумма = 0
	|			ИЛИ НЕ Набор.ОбъемУслуги = 0
	|			ИЛИ НЕ Набор.ОбъемУслугиПотребленный = 0)
	|	И Набор.СниматьНачисленныйСреднийПоФормулам
	|	И Набор.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|	И НЕ Набор.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Набор.ЗависимаяТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТдляВсехСоставныхУслуг
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	НЕ Набор.СоставнаяУслуга = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТдляВсехСоставныхУслуг.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВТдляВсехСоставныхУслуг.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТдляСоставныхУслуг
	|ИЗ
	|	ВТдляВсехСоставныхУслуг КАК ВТдляВсехСоставныхУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Промежуточная_СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам1
	|		ПО ВТдляВсехСоставныхУслуг.ТочкаУчета = СниматьНачисленныйСреднийПоФормулам1.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Набор.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ СгруппированныеТУ
	|ИЗ
	|	ВТдляСоставныхУслуг КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.СоставнаяУслуга,
	|	Набор.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТдляСоставныхУслуг.ТочкаУчета КАК ТочкаУчета,
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ПОМЕСТИТЬ ТУ_Услуги
	|ИЗ
	|	ВТдляСоставныхУслуг КАК ВТдляСоставныхУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВТдляСоставныхУслуг.СоставнаяУслуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТдляСоставныхУслуг.ТочкаУчета,
	|	энргВидыУслугСоставляющиеУслуг.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ВидБлагоустройства КАК ВидБлагоустройства,
	|	Набор.НормаПотребления КАК НормаПотребления,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТочкаУчета КАК ТочкаУчета,
	|	Набор.Услуга КАК Услуга,
	|	ЗНАЧЕНИЕ(СПравочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТдляВсехТУ
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	Набор.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТдляВсехТУ.Строение КАК Строение,
	|	ВТдляВсехТУ.Помещение КАК Помещение,
	|	МАКСИМУМ(ВТдляВсехТУ.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	МАКСИМУМ(ВТдляВсехТУ.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	МАКСИМУМ(ВТдляВсехТУ.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	МАКСИМУМ(ВТдляВсехТУ.НормаПотребления) КАК НормаПотребления,
	|	ВТдляВсехТУ.ТочкаУчета КАК ТочкаУчета,
	|	ВТдляВсехТУ.Услуга КАК Услуга,
	|	ВТдляВсехТУ.Шкала КАК Шкала,
	|	ВТдляВсехТУ.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТдляВсехТУСгруппированная
	|ИЗ
	|	ВТдляВсехТУ КАК ВТдляВсехТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТдляВсехТУ.Строение,
	|	ВТдляВсехТУ.Помещение,
	|	ВТдляВсехТУ.ТочкаУчета,
	|	ВТдляВсехТУ.Услуга,
	|	ВТдляВсехТУ.Шкала,
	|	ВТдляВсехТУ.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Период КАК Период,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Район КАК Район,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Организация КАК Организация,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СпособНачисления КАК СпособНачисления,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Абонент КАК Абонент,
	|	ЕСТЬNULL(СгруппированныеТУ.Услуга, Промежуточная_СниматьНачисленныйСреднийПоФормулам.Услуга) КАК Услуга,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТочкаУчета КАК ТочкаУчета,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ПриборУчета КАК ПриборУчета,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Шкала КАК Шкала,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.ЗначениеТарифа, Промежуточная_СниматьНачисленныйСреднийПоФормулам.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.ТарифнаяГруппа, Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслуги КАК ОбъемУслуги,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Сумма КАК Сумма,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Поставщик КАК Поставщик,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.Строение, Промежуточная_СниматьНачисленныйСреднийПоФормулам.Строение) КАК Строение,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.Помещение, Промежуточная_СниматьНачисленныйСреднийПоФормулам.Помещение) КАК Помещение,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ЧастныйСектор КАК ЧастныйСектор,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ПериодНачисления КАК ПериодНачисления,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.КоэффициентФормула КАК КоэффициентФормула,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СверхНорматива КАК СверхНорматива,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.ВидБлагоустройства, Промежуточная_СниматьНачисленныйСреднийПоФормулам.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.НормаПотребления, Промежуточная_СниматьНачисленныйСреднийПоФормулам.НормаПотребления) КАК НормаПотребления
	|ПОМЕСТИТЬ тестСниматьНачисленныйСреднийПоФормулам
	|ИЗ
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам КАК Промежуточная_СниматьНачисленныйСреднийПоФормулам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТУ_Услуги КАК СгруппированныеТУ
	|		ПО Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТочкаУчета = СгруппированныеТУ.ТочкаУчета
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.Услуга = СгруппированныеТУ.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТдляВсехТУСгруппированная КАК ВТдляВсехТУСгруппированная
	|		ПО Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТочкаУчета = ВТдляВсехТУСгруппированная.ТочкаУчета
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.Услуга = ВТдляВсехТУСгруппированная.Услуга
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.Шкала = ВТдляВсехТУСгруппированная.Шкала
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона = ВТдляВсехТУСгруппированная.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.Период КАК Период,
	|	Набор.Организация КАК Организация,
	|	Набор.Район КАК Район,
	|	Набор.СпособНачисления КАК СпособНачисления,
	|	Набор.Абонент КАК Абонент,
	|	Набор.Услуга КАК Услуга,
	|	Набор.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Набор.ТочкаУчета КАК ТочкаУчета,
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Шкала КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Набор.ОбъемУслуги * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслуги,
	|	Набор.ОбъемУслугиПотребленный * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслугиПотребленный,
	|	Набор.ОбъемУслугиПотери * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслугиПотери,
	|	Набор.ОбъемУслугиПотребленныйПотери * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйПотери,
	|	Набор.Сумма * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Сумма,
	|	Набор.Поставщик КАК Поставщик,
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ЧастныйСектор КАК ЧастныйСектор,
	|	Набор.ПериодНачисления КАК ПериодНачисления,
	|	Набор.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	Набор.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Набор.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Набор.КоэффициентФормула КАК КоэффициентФормула,
	|	ЛОЖЬ КАК ИзменятьВзаиморасчеты,
	|	Набор.СверхНорматива КАК СверхНорматива,
	|	Набор.ВидБлагоустройства КАК ВидБлагоустройства, 
	|	Набор.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	Набор.НормаПотребления КАК НормаПотребления
	|ПОМЕСТИТЬ СниматьНачисленныйСредний
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	(НЕ Набор.Сумма = 0
	|			ИЛИ НЕ Набор.ОбъемУслуги = 0
	|			ИЛИ НЕ Набор.ОбъемУслугиПотребленный = 0)
	|	И (Набор.СниматьНачисленныйСредний
	|			ИЛИ Набор.СниматьНачисленныйСреднийЗависимыхТочек)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	табСниматьНачисленныйСреднийПоФормулам.Период КАК Период,
	|	табСниматьНачисленныйСреднийПоФормулам.Организация КАК Организация,
	|	табСниматьНачисленныйСреднийПоФормулам.Район КАК Район,
	|	табСниматьНачисленныйСреднийПоФормулам.СпособНачисления КАК СпособНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	|	табСниматьНачисленныйСреднийПоФормулам.Абонент КАК Абонент,
	|	табСниматьНачисленныйСреднийПоФормулам.Услуга КАК Услуга,
	|	табСниматьНачисленныйСреднийПоФормулам.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	табСниматьНачисленныйСреднийПоФормулам.ТочкаУчета КАК ТочкаУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.ПриборУчета КАК ПриборУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.Шкала КАК Шкала,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона КАК ТарифнаяЗона,
	|	табСниматьНачисленныйСреднийПоФормулам.ЗначениеТарифа КАК ЗначениеТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	табСниматьНачисленныйСреднийПоФормулам.Сумма КАК Сумма,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслуги КАК ОбъемУслуги,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ табСниматьНачисленныйСреднийПоФормулам.Строение
	|	КОНЕЦ КАК МКД,
	|	табСниматьНачисленныйСреднийПоФормулам.Строение КАК Строение,
	|	табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор КАК ЧастныйСектор,
	|	табСниматьНачисленныйСреднийПоФормулам.Помещение КАК Помещение,
	|	табСниматьНачисленныйСреднийПоФормулам.Поставщик КАК Поставщик,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	табСниматьНачисленныйСреднийПоФормулам.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты,
	|	табСниматьНачисленныйСреднийПоФормулам.СверхНорматива КАК СверхНорматива,
	|	табСниматьНачисленныйСреднийПоФормулам.ВидБлагоустройства КАК ВидБлагоустройства,
	|	табСниматьНачисленныйСреднийПоФормулам.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.НормаПотребления КАК НормаПотребления
	|ПОМЕСТИТЬ ПромежуточныйИтог
	|ИЗ
	|	тестСниматьНачисленныйСреднийПоФормулам КАК табСниматьНачисленныйСреднийПоФормулам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	табСниматьНачисленныйСреднийПоФормулам.Период,
	|	табСниматьНачисленныйСреднийПоФормулам.Организация,
	|	табСниматьНачисленныйСреднийПоФормулам.Район,
	|	табСниматьНачисленныйСреднийПоФормулам.СпособНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление),
	|	табСниматьНачисленныйСреднийПоФормулам.Абонент,
	|	табСниматьНачисленныйСреднийПоФормулам.Услуга,
	|	табСниматьНачисленныйСреднийПоФормулам.НаправлениеИспользованияТУ,
	|	табСниматьНачисленныйСреднийПоФормулам.ТочкаУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.ПриборУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.Шкала,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона,
	|	табСниматьНачисленныйСреднийПоФормулам.ЗначениеТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяГруппа,
	|	табСниматьНачисленныйСреднийПоФормулам.Сумма,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслуги,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленный,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленныйПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ПериодНачисления,
	|	ВЫБОР
	|		КОГДА табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ табСниматьНачисленныйСреднийПоФормулам.Строение
	|	КОНЕЦ,
	|	табСниматьНачисленныйСреднийПоФормулам.Строение,
	|	табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор,
	|	табСниматьНачисленныйСреднийПоФормулам.Помещение,
	|	табСниматьНачисленныйСреднийПоФормулам.Поставщик,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийПоФормулам,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСредний,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийЗависимыхТочек,
	|	табСниматьНачисленныйСреднийПоФормулам.ИзменятьВзаиморасчеты,
	|	табСниматьНачисленныйСреднийПоФормулам.СверхНорматива,
	|	табСниматьНачисленныйСреднийПоФормулам.ВидБлагоустройства,
	|	табСниматьНачисленныйСреднийПоФормулам.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.НормаПотребления
	|ИЗ
	|	СниматьНачисленныйСредний КАК табСниматьНачисленныйСреднийПоФормулам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныйИтог.Организация КАК Организация,
	|	ПромежуточныйИтог.СпособНачисления КАК СпособНачисления,
	|	ПромежуточныйИтог.ВидНачисления КАК ВидНачисления,
	|	ПромежуточныйИтог.Абонент КАК Абонент,
	|	ПромежуточныйИтог.Услуга КАК Услуга,
	|	ПромежуточныйИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ПромежуточныйИтог.ТочкаУчета КАК ТочкаУчета,
	|	ПромежуточныйИтог.ПриборУчета КАК ПриборУчета,
	|	ПромежуточныйИтог.Шкала КАК Шкала,
	|	ПромежуточныйИтог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПромежуточныйИтог.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ПромежуточныйИтог.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ПромежуточныйИтог.Сумма КАК Сумма,
	|	ПромежуточныйИтог.ОбъемУслуги КАК ОбъемУслуги,
	|	ПромежуточныйИтог.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ПромежуточныйИтог.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	ПромежуточныйИтог.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	ПромежуточныйИтог.Период КАК Период,
	|	ПромежуточныйИтог.ПериодНачисления КАК ПериодНачисления,
	|	ПромежуточныйИтог.МКД КАК МКД,
	|	ПромежуточныйИтог.Строение КАК Строение,
	|	ПромежуточныйИтог.ЧастныйСектор КАК ЧастныйСектор,
	|	ПромежуточныйИтог.Район КАК Район,
	|	ПромежуточныйИтог.Помещение КАК Помещение,
	|	ПромежуточныйИтог.Поставщик КАК Поставщик,
	|	ПромежуточныйИтог.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ПромежуточныйИтог.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты,
	|	ПромежуточныйИтог.СверхНорматива КАК СверхНорматива,
	|	ПромежуточныйИтог.ВидБлагоустройства КАК ВидБлагоустройства, 
	|	ПромежуточныйИтог.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	ПромежуточныйИтог.НормаПотребления КАК НормаПотребления
	|ИЗ
	|	ПромежуточныйИтог КАК ПромежуточныйИтог
	|ГДЕ
	|	(НЕ ПромежуточныйИтог.ОбъемУслуги = 0
	|			ИЛИ НЕ ПромежуточныйИтог.ОбъемУслугиПотребленный = 0)"; 
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеНачисленныйСреднийОбъемДляСписания()
	Текст = 
	"ВЫБРАТЬ
	|	Набор.Период КАК Период,
	|	Набор.Район КАК Район,
	|	Набор.Организация КАК Организация,
	|	Набор.СпособНачисления КАК СпособНачисления,
	|	Набор.ВладелецЗависимойТочкиУчета КАК ВладелецЗависимойТочкиУчета,
	|	Набор.Абонент КАК Абонент,
	|	Набор.Услуга КАК Услуга,
	|	Набор.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Набор.ТочкаУчета КАК ТочкаУчета,
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Шкала КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Набор.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Набор.ОбъемУслуги КАК ОбъемУслуги,
	|	Набор.КоэффициентФормула КАК КоэффициентФормула,
	|	Набор.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	Набор.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	Набор.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	Набор.Сумма КАК Сумма,
	|	Набор.Поставщик КАК Поставщик,
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ЧастныйСектор КАК ЧастныйСектор,
	|	Набор.ПериодНачисления КАК ПериодНачисления,
	|	Набор.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	Набор.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Набор.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Набор.СверхНорматива КАК СверхНорматива,
	|	Набор.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Набор.ВидБлагоустройства КАК ВидБлагоустройства,
	|	Набор.НормаПотребления КАК НормаПотребления,
	|	Набор.Техническая КАК Техническая,
	|	Набор.ОбъемУслугиТехнический КАК ОбъемУслугиТехнический,
	|	Набор.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Район КАК Район,
	|	ТЗ.Организация КАК Организация,
	|	ТЗ.Абонент КАК Абонент,
	|	ТЗ.Услуга КАК Услуга,
	|	ТЗ.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТЗ.ТочкаУчета КАК ТочкаУчета,
	|	ТЗ.ПриборУчета КАК ПриборУчета,
	|	ТЗ.Шкала КАК Шкала,
	|	ТЗ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТЗ.Поставщик КАК Поставщик,
	|	ТЗ.Строение КАК Строение,
	|	ТЗ.Помещение КАК Помещение,
	|	ТЗ.ЧастныйСектор КАК ЧастныйСектор,
	|	МАКСИМУМ(ТЗ.ПериодНачисления) КАК ПериодНачисления
	|ПОМЕСТИТЬ ВТ_МаксимальныйПериод
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ.Район,
	|	ТЗ.Организация,
	|	ТЗ.Абонент,
	|	ТЗ.Услуга,
	|	ТЗ.НаправлениеИспользованияТУ,
	|	ТЗ.ТочкаУчета,
	|	ТЗ.ПриборУчета,
	|	ТЗ.Шкала,
	|	ТЗ.ТарифнаяЗона,
	|	ТЗ.Поставщик,
	|	ТЗ.Строение,
	|	ТЗ.Помещение,
	|	ТЗ.ЧастныйСектор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Период КАК Период,
	|	ТЗ.Район КАК Район,
	|	ТЗ.Организация КАК Организация,
	|	ТЗ.СпособНачисления КАК СпособНачисления,
	|	ТЗ.ВладелецЗависимойТочкиУчета КАК ВладелецЗависимойТочкиУчета,
	|	ТЗ.Абонент КАК Абонент,
	|	ТЗ.Услуга КАК Услуга,
	|	ТЗ.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТЗ.ТочкаУчета КАК ТочкаУчета,
	|	ТЗ.ПриборУчета КАК ПриборУчета,
	|	ТЗ.Шкала КАК Шкала,
	|	ТЗ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТЗ.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ТЗ.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ТЗ.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ТЗ.ОбъемУслуги КАК ОбъемУслуги,
	|	ТЗ.КоэффициентФормула КАК КоэффициентФормула,
	|	ТЗ.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ТЗ.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	ТЗ.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	ТЗ.Сумма КАК Сумма,
	|	ТЗ.Поставщик КАК Поставщик,
	|	ТЗ.Строение КАК Строение,
	|	ТЗ.Помещение КАК Помещение,
	|	ТЗ.ЧастныйСектор КАК ЧастныйСектор,
	|	ТЗ.ПериодНачисления КАК ПериодНачисления,
	|	ТЗ.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	ТЗ.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ТЗ.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	ТЗ.СверхНорматива КАК СверхНорматива,
	|	ТЗ.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ТЗ.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ТЗ.НормаПотребления КАК НормаПотребления,
	|	ТЗ.Техническая КАК Техническая,
	|	ТЗ.ОбъемУслугиТехнический КАК ОбъемУслугиТехнический,
	|	ТЗ.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа
	|ПОМЕСТИТЬ ВТ_ПоследниеЗаписи
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПериод КАК ВТ_МаксимальныйПериод
	|		ПО ТЗ.Район = ВТ_МаксимальныйПериод.Район
	|			И ТЗ.Организация = ВТ_МаксимальныйПериод.Организация
	|			И ТЗ.Абонент = ВТ_МаксимальныйПериод.Абонент
	|			И ТЗ.Услуга = ВТ_МаксимальныйПериод.Услуга
	|			И ТЗ.НаправлениеИспользованияТУ = ВТ_МаксимальныйПериод.НаправлениеИспользованияТУ
	|			И ТЗ.ТочкаУчета = ВТ_МаксимальныйПериод.ТочкаУчета
	|			И ТЗ.ПриборУчета = ВТ_МаксимальныйПериод.ПриборУчета
	|			И ТЗ.Шкала = ВТ_МаксимальныйПериод.Шкала
	|			И ТЗ.ТарифнаяЗона = ВТ_МаксимальныйПериод.ТарифнаяЗона
	|			И ТЗ.Поставщик = ВТ_МаксимальныйПериод.Поставщик
	|			И ТЗ.Строение = ВТ_МаксимальныйПериод.Строение
	|			И ТЗ.Помещение = ВТ_МаксимальныйПериод.Помещение
	|			И ТЗ.ЧастныйСектор = ВТ_МаксимальныйПериод.ЧастныйСектор
	|			И ТЗ.ПериодНачисления > ВТ_МаксимальныйПериод.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеЗаписи.Период КАК Период,
	|	ВТ_ПоследниеЗаписи.Район КАК Район,
	|	ВТ_ПоследниеЗаписи.Организация КАК Организация,
	|	ВТ_ПоследниеЗаписи.СпособНачисления КАК СпособНачисления,
	|	ВТ_ПоследниеЗаписи.ВладелецЗависимойТочкиУчета КАК ВладелецЗависимойТочкиУчета,
	|	ВТ_ПоследниеЗаписи.Абонент КАК Абонент,
	|	ВТ_ПоследниеЗаписи.Услуга КАК Услуга,
	|	ВТ_ПоследниеЗаписи.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВТ_ПоследниеЗаписи.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ПоследниеЗаписи.ПриборУчета КАК ПриборУчета,
	|	ВТ_ПоследниеЗаписи.Шкала КАК Шкала,
	|	ВТ_ПоследниеЗаписи.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТ_ПоследниеЗаписи.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВТ_ПоследниеЗаписи.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВТ_ПоследниеЗаписи.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВТ_ПоследниеЗаписи.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_ПоследниеЗаписи.КоэффициентФормула КАК КоэффициентФормула,
	|	ВТ_ПоследниеЗаписи.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ВТ_ПоследниеЗаписи.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	ВТ_ПоследниеЗаписи.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	ВТ_ПоследниеЗаписи.Сумма КАК Сумма,
	|	ВТ_ПоследниеЗаписи.Поставщик КАК Поставщик,
	|	ВТ_ПоследниеЗаписи.Строение КАК Строение,
	|	ВТ_ПоследниеЗаписи.Помещение КАК Помещение,
	|	ВТ_ПоследниеЗаписи.ЧастныйСектор КАК ЧастныйСектор,
	|	ВТ_ПоследниеЗаписи.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ПоследниеЗаписи.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	ВТ_ПоследниеЗаписи.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ВТ_ПоследниеЗаписи.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	ВТ_ПоследниеЗаписи.СверхНорматива КАК СверхНорматива,
	|	ВТ_ПоследниеЗаписи.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВТ_ПоследниеЗаписи.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВТ_ПоследниеЗаписи.НормаПотребления КАК НормаПотребления,
	|	ВТ_ПоследниеЗаписи.Техническая КАК Техническая,
	|	ВТ_ПоследниеЗаписи.ОбъемУслугиТехнический КАК ОбъемУслугиТехнический,
	|	ВТ_ПоследниеЗаписи.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа
	|ИЗ
	|	ВТ_ПоследниеЗаписи КАК ВТ_ПоследниеЗаписи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЗ.Период,
	|	ТЗ.Район,
	|	ТЗ.Организация,
	|	ТЗ.СпособНачисления,
	|	ТЗ.ВладелецЗависимойТочкиУчета,
	|	ТЗ.Абонент,
	|	ТЗ.Услуга,
	|	ТЗ.НаправлениеИспользованияТУ,
	|	ТЗ.ТочкаУчета,
	|	ТЗ.ПриборУчета,
	|	ТЗ.Шкала,
	|	ТЗ.ТарифнаяЗона,
	|	ТЗ.ЗависимаяТочкаУчета,
	|	ТЗ.ЗначениеТарифа,
	|	ТЗ.ТарифнаяГруппа,
	|	ТЗ.ОбъемУслуги,
	|	ТЗ.КоэффициентФормула,
	|	ТЗ.ОбъемУслугиПотребленный,
	|	ТЗ.ОбъемУслугиПотери,
	|	ТЗ.ОбъемУслугиПотребленныйПотери,
	|	ТЗ.Сумма,
	|	ТЗ.Поставщик,
	|	ТЗ.Строение,
	|	ТЗ.Помещение,
	|	ТЗ.ЧастныйСектор,
	|	ТЗ.ПериодНачисления,
	|	ТЗ.СниматьНачисленныйСреднийПоФормулам,
	|	ТЗ.СниматьНачисленныйСредний,
	|	ТЗ.СниматьНачисленныйСреднийЗависимыхТочек,
	|	ТЗ.СверхНорматива,
	|	ТЗ.СоставнаяУслуга,
	|	ТЗ.ВидБлагоустройства,
	|	ТЗ.НормаПотребления,
	|	ТЗ.Техническая,
	|	ТЗ.ОбъемУслугиТехнический КАК ОбъемУслугиТехнический,
	|	ТЗ.ДиапазонДифференцированногоТарифа
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЗаписи КАК ВТ_ПоследниеЗаписи
	|		ПО ТЗ.Район = ВТ_ПоследниеЗаписи.Район
	|			И ТЗ.Организация = ВТ_ПоследниеЗаписи.Организация
	|			И ТЗ.Абонент = ВТ_ПоследниеЗаписи.Абонент
	|			И ТЗ.Услуга = ВТ_ПоследниеЗаписи.Услуга
	|			И ТЗ.НаправлениеИспользованияТУ = ВТ_ПоследниеЗаписи.НаправлениеИспользованияТУ
	|			И ТЗ.ТочкаУчета = ВТ_ПоследниеЗаписи.ТочкаУчета
	|			И ТЗ.ПриборУчета = ВТ_ПоследниеЗаписи.ПриборУчета
	|			И ТЗ.Шкала = ВТ_ПоследниеЗаписи.Шкала
	|			И ТЗ.ТарифнаяЗона = ВТ_ПоследниеЗаписи.ТарифнаяЗона
	|			И ТЗ.Поставщик = ВТ_ПоследниеЗаписи.Поставщик
	|			И ТЗ.Строение = ВТ_ПоследниеЗаписи.Строение
	|			И ТЗ.Помещение = ВТ_ПоследниеЗаписи.Помещение
	|			И ТЗ.ЧастныйСектор = ВТ_ПоследниеЗаписи.ЧастныйСектор
	|ГДЕ
	|	ВТ_ПоследниеЗаписи.Период ЕСТЬ NULL"; 
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНаборЗаписейПоКлючуПомещения()
	
	Текст = 
	"ВЫБРАТЬ
	|	ОбъемНачислений.Период КАК Период,
	|	ОбъемНачислений.Регистратор КАК Регистратор,
	|	ОбъемНачислений.НомерСтроки КАК НомерСтроки,
	|	ОбъемНачислений.Активность КАК Активность,
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.Район КАК Район,
	|	ОбъемНачислений.Распределение КАК Распределение,
	|	ОбъемНачислений.Строение КАК Строение,
	|	ОбъемНачислений.Помещение КАК Помещение,
	|	ОбъемНачислений.КлючПомещения КАК КлючПомещения,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	ОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
	|	ОбъемНачислений.ВидНачисления КАК ВидНачисления,
	|	ОбъемНачислений.СпособНачисления КАК СпособНачисления,
	|	ОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ОбъемНачислений.Измеритель КАК Измеритель,
	|	ОбъемНачислений.ПриборУчета КАК ПриборУчета,
	|	ОбъемНачислений.Шкала КАК Шкала,
	|	ОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ОбъемНачислений.Поставщик КАК Поставщик,
	|	ОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	ВЫБОР
	|		КОГДА ОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет
	|				И ВЫРАЗИТЬ(ОбъемНачислений.Регистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета)
	|			ТОГДА ОбъемНачислений.ПериодНачисления
	|		ИНАЧЕ ОбъемНачислений.ПериодРасчета
	|	КОНЕЦ КАК ПериодНачисления,
	|	ОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	ОбъемНачислений.СверхНорматива КАК СверхНорматива,
	|	ОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	ОбъемНачислений.БылУстановленныйПриборВЭтомГоду КАК БылУстановленныйПриборВЭтомГоду,
	|	ОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
	|	ОбъемНачислений.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	ОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ОбъемНачислений.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	ОбъемНачислений.ОбъемУслугиПотребленныйСоцНорма КАК ОбъемУслугиПотребленныйСоцНорма,
	|	ОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
	|	ОбъемНачислений.Сумма КАК Сумма,
	|	ОбъемНачислений.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
	|	ОбъемНачислений.СуммаСниженияСтоимости КАК СуммаСниженияСтоимости,
	|	ОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
	|	ОбъемНачислений.ВидПлощади КАК ВидПлощади,
	|	ОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
	|	ОбъемНачислений.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления,
	|	ОбъемНачислений.ЕстьСреднийПоВсемТочкамУслуги КАК ЕстьСреднийПоВсемТочкамУслуги,
	|	ОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ОбъемНачислений.ВладелецЗависимойТочкиУчета КАК ВладелецЗависимойТочкиУчета,
	|	ОбъемНачислений.ЗависитОтУслуги КАК ЗависитОтУслуги,
	|	ОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ОбъемНачислений.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
	|	ОбъемНачислений.ЗначениеСоциальнойНормыРасчетныйСпособ КАК ЗначениеСоциальнойНормыРасчетныйСпособ,
	|	ОбъемНачислений.ЗначениеТарифаРЭК КАК ЗначениеТарифаРЭК,
	|	ОбъемНачислений.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
	|	ОбъемНачислений.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	ОбъемНачислений.КлючНорматива КАК КлючНорматива,
	|	ОбъемНачислений.КлючСоцНорматива КАК КлючСоцНорматива,
	|	ОбъемНачислений.КоличествоИзмеретелейНаправления КАК КоличествоИзмеретелейНаправления,
	|	ОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
	|	ОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
	|	ОбъемНачислений.КонецПериода КАК КонецПериода,
	|	ОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
	|	ОбъемНачислений.КоэффициентНорматива КАК КоэффициентНорматива,
	|	ОбъемНачислений.КоэффициентНормативаНеПрименятьСезонность КАК КоэффициентНормативаНеПрименятьСезонность,
	|	ОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
	|	ОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ОбъемНачислений.КоэффициентСезоности КАК КоэффициентСезоности,
	|	ОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
	|	ОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	ОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
	|	ОбъемНачислений.НормаПотребления КАК НормаПотребления,
	|	ОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
	|	ОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
	|	ОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	ОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
	|	ОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	ОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
	|	ОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
	|	ОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
	|	ОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ОбъемНачислений.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	ОбъемНачислений.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	ОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ОбъемНачислений.СоциальнаяНормаПотребления КАК СоциальнаяНормаПотребления,
	|	ОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
	|	ОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ОбъемНачислений.Техническая КАК Техническая,
	|	ОбъемНачислений.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	ОбъемНачислений.УдалитьКлючПомещения КАК УдалитьКлючПомещения,
	|	ОбъемНачислений.УдалитьНеПрименятьСезонность КАК УдалитьНеПрименятьСезонность,
	|	ОбъемНачислений.ФизЛицо КАК ФизЛицо,
	|	ОбъемНачислений.ПотериОбъем КАК ПотериОбъем,
	|	ОбъемНачислений.ПотериПроцент КАК ПотериПроцент,
	|	ОбъемНачислений.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	ОбъемНачислений.ПроцентСниженияСтоимости КАК ПроцентСниженияСтоимости,
	|	ОбъемНачислений.УслугаПолностьюОприборена КАК УслугаПолностьюОприборена,
	|	ОбъемНачислений.ПоставщикиНеНачислять КАК ПоставщикиНеНачислять,
	|	ОбъемНачислений.УслугаОграничена КАК УслугаОграничена,
	|	ОбъемНачислений.ЭтоСторно КАК ЭтоСторно,
	|	ОбъемНачислений.НомерСторнируемойСтроки КАК НомерСторнируемойСтроки,
	|	ОбъемНачислений.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП,
	|	ОбъемНачислений.КоличествоДнейИспользованияУслуги КАК КоличествоДнейИспользованияУслуги,
	|	ОбъемНачислений.ОбъемУслугиТехнический КАК ОбъемУслугиТехнический,
	|	ОбъемНачислений.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК ОбъемНачислений
	|ГДЕ
	|	(ОбъемНачислений.Регистратор ССЫЛКА Документ.энргНачисление
	|			ИЛИ ОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет)
	|	И ВЫБОР
	|			КОГДА ОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет
	|					И ВЫРАЗИТЬ(ОбъемНачислений.Регистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета)
	|				ТОГДА ОбъемНачислений.ПериодНачисления МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Возврат Текст;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли