#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет предоставленные показания.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ПредоставленныеПоказания(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПредоставленныеПоказания());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, ПриборУчета, Шкала, ТарифнаяЗона, НомерПозиции, Разделитель, ДатаРегистратора, ДокРегистратор";
		ИмяТаблицы 					= "ПредоставленныеПоказания";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ИмяТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Заполняет максимальные показания срез.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция МаксимальныеПоказанияСрез(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМаксимальныеПоказанияСрез());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, ПриборУчета, Шкала, ТарифнаяЗона";
		ИмяТаблицы 					= "МаксимальныеПоказанияСрез";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ИмяТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Получает набор начальных показаний расчетного периода.
//
// Параметры:
//  ДанныеЗаполнения	-	РезультатЗапроса.
// 
// Возвращаемое значение:
//   РегистрСведенийНаборЗаписей.энргПредоставленныеПоказанияМКД.
//
Функция НаборНачальныеПоказанияРасчетногоПериода(ДанныеЗаполнения) Экспорт 
	
	Набор  							= СоздатьНаборЗаписей();
	Выборка 						= ДанныеЗаполнения.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаНабора 				= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
		СтрокаНабора.НомерПозиции = - 1;
	КонецЦикла;
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса предоставленные показания.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаПредоставленныеПоказания() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ПредоставленныеПоказания.*
	|ИЗ
	|	РегистрСведений.энргПредоставленныеПоказанияМКД КАК ПредоставленныеПоказания";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса максимальные показания срез.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаМаксимальныеПоказанияСрез() Экспорт 
	Текст = 
	"ВЫБРАТЬ
	|	МаксимальныеПоказанияСрез.*
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияСрезМКД КАК МаксимальныеПоказанияСрез";
	
	Возврат Текст;	
КонецФункции

#КонецОбласти

#КонецЕсли