
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;  
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьУК();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// ОТЭК, 25.05.2020, 000202897.
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если (Объект.ФормаУправления = ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.УК") ИЛИ
			Объект.ФормаУправления = ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.ТСЖ")) 
			И Не ЗначениеЗаполнено(Объект.УК) Тогда
				
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""УК"" не заполнено",, "Объект.УК",, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	// ОТЭК, 26.05.2020, 000202897.
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
	Объект.МКД = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// ОТЭК, 26.05.2020, 000202897.
	Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	Объект.МКД = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	МКДПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФормаУправленияПриИзменении(Элемент)
	УстановитьВидимостьУК();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьУК()
	// ОТЭК, 26.05.2020, 000202897.
	//Элементы.УК.Видимость = Объект.ФормаУправления <> ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.НУ");
	Элементы.УК.Видимость = Объект.ФормаУправления <> ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.ФормаУправленияНеВыбрана") И
								Объект.ФормаУправления <> ПредопределенноеЗначение("Перечисление.энргФормыУправленияМКД.НУ");
	Элементы.РасчетОбъемовВыполняетУК.Видимость	= Элементы.УК.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МКДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ОТЭК, 25.05.2020, 000202897.
	энргПользовательскийВводКлиент.отэкНачалоВыбораСтроения(Элемент, Объект.Организация, 
																Объект.Район, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура МКДПриИзмененииНаСервере()
	Объект.Район = Объект.МКД.Район;
КонецПроцедуры




