#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
			
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	бестЛокализацияСервер.ПриСозданииНаСервере_бестУстановитьЗначениеПлощадиНП(ЭтотОбъект);  
	
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = бестРаботаСОбъектамиНПСервер.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
КонецПроцедуры 

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = ПолучитьЗначениеРеквизита(Объект.Район, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдресОбъекта();
	ОбъектРасчетаПриИзмененииНаСервере();
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПлощадиВидПлощадиПриИзменении(Элемент)
	ТекДанные 				= Элементы.Площади.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ВидПлощади) Тогда
		СписокСтрок = Объект.Площади.НайтиСтроки(Новый Структура("ВидПлощади", ТекДанные.ВидПлощади));
		Если СписокСтрок.Количество() > 1 Тогда
			ТекДанные.ВидПлощади = Неопределено;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такой вид уже добавлен в документ");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлощадиВидПлощадиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.Площади.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СписокСтрок = Объект.Площади.НайтиСтроки(Новый Структура("ВидПлощади", ВыбранноеЗначение));
		Если СписокСтрок.Количество() >= 1 Тогда
			ТекДанные.ВидПлощади 	 = Неопределено;
			ВыбранноеЗначение = Неопределено;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид площади уже добавлен в документ");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлощадиПриИзменении(Элемент)
	ТекДанные = Элементы.Площади.ТекущиеДанные;
	Если ТекДанные = Неопределено И Не ЗначениеЗаполнено(ТекДанные.ВидПлощади) Тогда
	//Если ТекДанные <> Неопределено И Не ЗначениеЗаполнено(ТекДанные.ВидПлощади) Тогда		
		ТекДанные.ВидПлощади = ПредопределенноеЗначение("Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция ПолучитьЗначениеРеквизита(ТекОбъект, ИмяРеквизита)
	Возврат ТекОбъект[ИмяРеквизита];	
КонецФункции

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

&НаСервере
Процедура ОбъектРасчетаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестЗначенияПлощадейНПСрезПоследних.ВидПлощади КАК ВидПлощади,
	               |	бестЗначенияПлощадейНПСрезПоследних.Площадь КАК ПлощадьБыло
	               |ИЗ
	               |	РегистрСведений.бестЗначенияПлощадейНП.СрезПоследних(
	               |			&ГраницаДокумента,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И ОбъектРасчета = &ОбъектРасчета) КАК бестЗначенияПлощадейНПСрезПоследних";
	ДатаДокумента = ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия, Объект.Дата);
	ГраницаДокумента = Новый Граница(ДатаДокумента, ВидГраницы.Исключая);
	Запрос.УстановитьПараметр("ГраницаДокумента", ГраницаДокумента);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	Запрос.УстановитьПараметр("ОбъектРасчета", Объект.ОбъектРасчета);
	ТЗПлощади = Запрос.Выполнить().Выгрузить();
	Объект.Площади.Загрузить(ТЗПлощади);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьАдресОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти