#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет коэффициент негативного воздействия.
//
// Параметры:
//  ДокументНарушение	-	ДокументСсылка.бестИзменитьДанныеДляДополнительногоРасчета.
//  ОтборСтруктура		-	Структура.
// 
// Возвращаемое значение:
//   Число.
//
Функция ОпределитьКоэффициентНегативногоВоздействия(ДокументНарушение, ОтборСтруктура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(бестНегативноеВоздействие.Период) КАК КолвоНарушений
		|ПОМЕСТИТЬ ВТ_КолвоНарушений
		|ИЗ
		|	РегистрСведений.бестНегативноеВоздействие КАК бестНегативноеВоздействие
		|ГДЕ
		|	бестНегативноеВоздействие.Период МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И бестНегативноеВоздействие.ОбъектРасчета = &ОбъектРасчета
		|	И бестНегативноеВоздействие.ТочкаУчета = &ТочкаУчета
		|	И бестНегативноеВоздействие.Услуга = &Услуга
		|	И бестНегативноеВоздействие.Регистратор <> &ДокументНарушение
		|	И бестНегативноеВоздействие.Организация = &Организация
		|	И бестНегативноеВоздействие.Район = &Район
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_КолвоНарушений.КолвоНарушений, 0) + 1 КАК КолвоНарушений
		|ПОМЕСТИТЬ ВТ_КолвоНарушенийРезультат
		|ИЗ
		|	ВТ_КолвоНарушений КАК ВТ_КолвоНарушений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестКоэффициентыНарушенийСрезПоследних.Коэффициент КАК Коэффициент
		|ИЗ
		|	ВТ_КолвоНарушенийРезультат КАК ВТ_КолвоНарушенийРезультат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестКоэффициентыНарушений.СрезПоследних(&ПериодКонец, Организация = &Организация) КАК бестКоэффициентыНарушенийСрезПоследних
		|		ПО ВТ_КолвоНарушенийРезультат.КолвоНарушений >= бестКоэффициентыНарушенийСрезПоследних.КоличествоНарушенийОт
		|			И (ВТ_КолвоНарушенийРезультат.КолвоНарушений < бестКоэффициентыНарушенийСрезПоследних.КоличествоНарушенийДо
		|				ИЛИ бестКоэффициентыНарушенийСрезПоследних.КоличествоНарушенийДо = 0)";
	
	Запрос.УстановитьПараметр("ДокументНарушение", 	ДокументНарушение);
	Запрос.УстановитьПараметр("ОбъектРасчета", 		ОтборСтруктура.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", 		ОтборСтруктура.Организация);
	Запрос.УстановитьПараметр("ПериодКонец", 		ОтборСтруктура.Дата);
	Запрос.УстановитьПараметр("ПериодНачало", 		ДобавитьМесяц(ОтборСтруктура.Дата, -12));
	Запрос.УстановитьПараметр("Район", 				ОтборСтруктура.Район);
	Запрос.УстановитьПараметр("ТочкаУчета", 		ОтборСтруктура.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", 			ОтборСтруктура.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Коэффициент;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли