#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураДанныеФискальнойОперации() Экспорт
	
	ДанныеФискальнойОперации = Новый Структура;
	ДанныеФискальнойОперации.Вставить("ОтправлятьEmailЧерезОФД",          энргОбщегоНазначения.ЗначениеКонстанты("ОтправлятьЭлектронныеЧекиПоEmailЧерезОФД"));
	ДанныеФискальнойОперации.Вставить("ОтправлятьSMSЧерезОФД",            энргОбщегоНазначения.ЗначениеКонстанты("ОтправлятьЭлектронныеЧекиПоSMSЧерезОФД"));
	ДанныеФискальнойОперации.Вставить("НеПечататьФискальныйЧек",          энргОбщегоНазначения.ЗначениеФункциональнойОпции("НеПечататьФискальныйЧекПриОтправкеЭлектронногоЧекаПокупателю"));
	ДанныеФискальнойОперации.Вставить("ОтправительEmail");
	ДанныеФискальнойОперации.Вставить("ВариантОтправкиЭлектронногоЧека");
	ДанныеФискальнойОперации.Вставить("КонтактныеДанныеЭлектронногоЧека");
	
	ОчиститьДанныеФискальнойОперации(ДанныеФискальнойОперации);
	
	Возврат ДанныеФискальнойОперации;
	
КонецФункции

Процедура ОчиститьДанныеФискальнойОперации(ДанныеФискальнойОперации) Экспорт
	
	ДанныеФискальнойОперации.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ПустаяСсылка();
	ДанныеФискальнойОперации.КонтактныеДанныеЭлектронногоЧека = "";
	
КонецПроцедуры

Функция СистемаНалогообложенияФискальнойОперации(Организация, Дата = Неопределено) Экспорт
			
КонецФункции

#КонецОбласти