#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеДляПодключения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестДанныеДляПодключенияКFTP.Хост КАК Хост,
		|	бестДанныеДляПодключенияКFTP.Логин КАК Логин,
		|	бестДанныеДляПодключенияКFTP.Пароль КАК Пароль
		|ИЗ
		|	РегистрСведений.бестДанныеДляПодключенияКFTP КАК бестДанныеДляПодключенияКFTP";
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	Колонки 			= РезультатЗапроса.Колонки;
	
	Если РезультатЗапроса.Пустой() ТОгда
		
		Данные 	= Неопределено;
		
	Иначе 
		
		Данные 	= Новый Структура;
		
		Если Выборка.Следующий() Тогда 
			
			Для Каждого ТекСтрока из Колонки Цикл
				Данные.Вставить(ТекСтрока.Имя,Выборка[ТекСтрока.Имя]);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#КонецЕсли