#Область ПрограммныйИнтерфейс

Функция ОпределитьПериодНачисления(ДатаДокумента, Организация, Район) Экспорт
	Возврат Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДатаДокумента, Организация, Район);
КонецФункции

Функция ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления,УчитыватьНачалоВеденияУчета = ложь) Экспорт
	Возврат Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления,УчитыватьНачалоВеденияУчета);
КонецФункции

#КонецОбласти
