#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ФормированиеДвиженийДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса = Новый Структура;
	Схема = Неопределено;
	
	ДобавитьТекстЗапросаИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов(Схема, Регистры);
	
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", ДокументСсылка);
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольПроведения

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка, ДополнительныеСвойства) Экспорт 
	
	Схема = Неопределено;
	Параметры = Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема);
		
	КлючиТаблицКонтроля = Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1 Цикл
		
		Пакет = Схема.ПакетЗапросов[Сч];		
		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения, СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")), Сч);			
			Пакет.ТаблицаДляПомещения = "";
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 						ДокументСсылка);
	ПараметрыЗапроса.Вставить("ТекстСообщенияЛицевойСчетЗакрыт", 	НСтр("ru = 'На дату операции лицевой счет закрыт'"));
		
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 	энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 	КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ФормированиеДвиженийДокумента

Процедура ДобавитьТекстЗапросаИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов(Схема, Регистры)
	
	ИмяРегистра = "энргИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА табШапка.ДатаФактическогоСобытия
	|		ИНАЧЕ табШапка.Дата
	|	КОНЕЦ КАК Период,
	|	табШапка.Организация КАК Организация,
	|	табШапка.Район КАК Район,
	|	табШапка.Абонент КАК Абонент,
	|	табШапка.ДатаЗавершенияИсключения КАК ДатаЗавершенияИсключения,
	|	табШапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргИсключениеАбонентаИзРаспределенияДиффТарифов КАК табШапка
	|ГДЕ
	|	табШапка.Ссылка В (&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольПроведения

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	ШапкаДокумента.Ссылка КАК Ссылка,
	|	ШапкаДокумента.Организация КАК Организация,
	|	ШапкаДокумента.Район КАК Район,
	|	ШапкаДокумента.Абонент КАК Абонент,
	|	ШапкаДокумента.Дата КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргИсключениеАбонентаИзРаспределенияДиффТарифов КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема)
	
	ПараметрыВТ = Новый Структура(
	"ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей",
	"ПараметрыКонтроля", "ПараметрыКонтроля", "ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,Абонент", "Организация", "Район", "Абонент"));
	
	ПараметрыСостоянияМКД = Новый Структура;
	ПараметрыВременнойТаблицы = Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(ПараметрыВТ);
	
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(Схема, ПараметрыСостоянияМКД, "СостояниеЛицевогоСчета");
	
	Если Схема = Неопределено Тогда
		Схема = новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ТекстСообщенияЛицевойСчетЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеЛицевогоСчета КАК СостояниеЛицевогоСчета
	|		ПО ПараметрыКонтроля.Организация = СостояниеЛицевогоСчета.Организация
	|			И ПараметрыКонтроля.Район = СостояниеЛицевогоСчета.Район
	|			И ПараметрыКонтроля.Абонент = СостояниеЛицевогоСчета.Абонент
	|ГДЕ
	|	НЕ ПараметрыКонтроля.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|	И (НЕ ЕСТЬNULL(СостояниеЛицевогоСчета.Состояние, ЛОЖЬ)
	|			ИЛИ ПараметрыКонтроля.Период < ЕСТЬNULL(СостояниеЛицевогоСчета.Период, ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "КонтрольСостояниеЛС";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли