
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	Если ЯвляетсяУдостоверениемЛичности(Запись.Контрагент, Запись.ВидДокумента, Запись.Период) Тогда
		Запись.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
	КонецЕсли;
	
	Если Запись.ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ") Тогда
		ЭтаФорма.Элементы.Серия.Маска = "@@ @@";
		ЭтаФорма.Элементы.Номер.Маска = "@@@@@@";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЯвляетсяУдостоверениемЛичности(Контрагент, ВидДокумента, Дата)
	
	Возврат РегистрыСведений.энргДокументыФизическихЛиц.ЯвляетсяУдостоверениемЛичности(Контрагент, ВидДокумента, Дата);
	
КонецФункции

#КонецОбласти
