#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Рассчитывает госпошлину.
//
// Параметры:
//  СуммаЗадолженности	-	Число.
//  Период				-	Дата.
//  ВидСудопроизводства	-	ПеречислениеСсылка.энргВидыСудопроизводства.
// 
// Возвращаемое значение:
//   Число.
//
Функция РассчитатьГоспошлину(СуммаЗадолженности, Период,ВидСудопроизводства=Неопределено) Экспорт
	Результат = 0;
	
	Если Не ЗначениеЗаполнено(ВидСудопроизводства) Тогда
		Возврат 0;
	КонецЕсли;
	
	ЗаписьРС = РегистрыСведений.энргНастройкаРасчетаГоспошлины.ПолучитьПоследнее(Период, Новый Структура("ВидСудопроизводства", ВидСудопроизводства));
	
	ТЗ_Настройки = ЗаписьРС.НастройкаРасчета.Получить();
	Если ТЗ_Настройки = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из ТЗ_Настройки Цикл
		Если СуммаЗадолженности <= СтрокаТЗ.До Или СтрокаТЗ.До = 0 Тогда
			Результат = СтрокаТЗ.СтабильнаяСумма + ?(СуммаЗадолженности > СтрокаТЗ.ПроцентССуммы, СуммаЗадолженности - СтрокаТЗ.ПроцентССуммы, 0) * СтрокаТЗ.Процент / 100;
			
			Если ЗначениеЗаполнено(СтрокаТЗ.МинимальнаяСумма) И Результат < СтрокаТЗ.МинимальнаяСумма Тогда
				Результат = СтрокаТЗ.МинимальнаяСумма;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТЗ.МаксимальнаяСумма) И Результат > СтрокаТЗ.МаксимальнаяСумма Тогда
				Результат = СтрокаТЗ.МаксимальнаяСумма;
			КонецЕсли;	
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции 

#КонецОбласти

#КонецЕсли