#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает действующие приборы учета помещения.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  ВключаяОРП		-	Булево.
//  ПараметрыОтбора	-	Структура.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДействующиеПриборыУчетаПомещения(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ВключаяОРП = Ложь, ПараметрыОтбора = Неопределено) Экспорт 
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСостояниеПриборовУчетаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжСостояниеПриборовУчетаМенеджер"].ДействующиеПриборыУчетаПомещения(Период, Организация, Район, КлючПомещения, ТочкаУчета);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	РезультатЗапроса = энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Период, Организация, Район, КлючПомещения, ТочкаУчета, ВключаяОРП, ПараметрыОтбора); 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "СостояниеПриборовУчетаМенеджер.ДействующиеПриборыУчетаПомещения";
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультатЗапросаКодом(ИмяМетода, РезультатЗапроса);		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Получает действующие приборы учета помещения с вспомогательным оборудованием.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  ВключаяОРП		-	Булево.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДействующиеПриборыУчетаПомещенияСВспомогательнымОборудованием(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ВключаяОРП = Ложь) Экспорт
	
	РезультатЗапроса = энргСостояниеПриборовУчета.ДействующийСоставУзлаПомещения(Период, Организация, Район, КлючПомещения, ТочкаУчета, ВключаяОРП);
	Возврат РезультатЗапроса;
	
КонецФункции

// Получает действующие приборы учета по маршруту
//
// Параметры:
//  Период				-	Дата.
//  Организация			-	СправочникСсылка.Организации.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  МаршрутКонтроллера	-	СправочникСсылка.энргСотрудники.
//  Строение			-	СправочникСсылка.энргСтроения.
//  ВключаяОРП			-	Булево.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДействующиеПриборыУчетаПоМаршруту(Период, Организация, Район, МаршрутКонтроллера, Строение = Неопределено, ВключаяОРП = Ложь) Экспорт
	
	РезультатЗапроса = энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПоМаршруту(Период, Организация, Район, МаршрутКонтроллера, Строение, ВключаяОРП);
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли