#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргБанкротство(ЭтотОбъект);
	Параметры.Свойство("СписаниеНаЗабаланс", СписаниеНаЗабаланс);
	
	ЭтаФорма.ЗакрыватьПриВыборе 					 	= Ложь;
	Элементы.ТаблицаЗадолженности.МножественныйВыбор 	= Истина;
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Район",		  Район);
	Параметры.Свойство("Строение",	  Строение);
	Параметры.Свойство("Абонент",     Абонент);
	Параметры.Свойство("Дата",	   	  Дата);

	Если СписаниеНаЗабаланс Тогда
		ОбновитьЗадолженность();
	Иначе 
		ОбновитьЗадолженностьИзЗабаланса();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаЗадолженностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 	
	ОбработкаВыбораВФорме(ВыбраннаяСтрока);		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрОтбораПриИзменении(Элемент)
	ОбновитьЗадолженность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ВыбратьВФорме(Команда) 	
	ОбработкаВыбораВФорме(Элементы.ТаблицаЗадолженности.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеЗадолженности(Команда)
	Если СписаниеНаЗабаланс Тогда
		ОбновитьЗадолженность();
	Иначе 
		ОбновитьЗадолженностьИзЗабаланса();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДополнительныеФункции

&НаКлиенте
Процедура ОбработкаВыбораВФорме(ВыбраннаяСтрока)
	ОписаниеСтроки  			= Новый ФиксированнаяСтруктура("ПериодЗадолженности, Услуга, Поставщик, СуммаСписания");
	
	Если ТипЗнч(ВыбраннаяСтрока)  = Тип("Массив") тогда
		МассивСтрок 			= Новый Массив;
		для Каждого строка из ВыбраннаяСтрока цикл
			СтруктураСтроки  	= Новый Структура(ОписаниеСтроки);
			ТекСтрока  			= ТаблицаЗадолженности.НайтиПоИдентификатору(строка);
			ЗаполнитьЗначенияСвойств(СтруктураСтроки,ТекСтрока);
			МассивСтрок.Добавить(СтруктураСтроки);
		КонецЦикла;			
		ОповеститьОВыборе(МассивСтрок);		
	иначе
		СтруктураСтроки  		= Новый Структура(ОписаниеСтроки);
		ТекСтрока  				= ТаблицаЗадолженности.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,ТекСтрока);
		ОповеститьОВыборе(МассивСтрок);
	КонецЕсли;    	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗадолженность()
	ОбязОтборы 	= Новый Структура("Абонент, Организация, Район, Строение, Дата");
	ЗаполнитьЗначенияСвойств(ОбязОтборы, ЭтаФорма);
	Модуль 		= Документы.энргБанкротство;
	
	ТаблицаЗадолженности.Очистить();
	Результат 	= Модуль.ПолучитьЗадолженность(ОбязОтборы, Период.ДатаНачала, Период.ДатаОкончания, Услуга, Поставщик);
	Выборка 	= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НСтрока = ТаблицаЗадолженности.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла;
	//ТаблицаЗадолженности.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗадолженностьИзЗабаланса()
	
	ОбязОтборы 	= Новый Структура("Абонент, Организация, Район, Строение, Дата");
	ЗаполнитьЗначенияСвойств(ОбязОтборы, ЭтаФорма);
	Модуль 		= Документы.энргБанкротство;
	
	ТаблицаЗадолженности.Очистить();
	Результат 	= Модуль.ДанныеПоЗабалансовойЗадолженности(ОбязОтборы, Период.ДатаНачала, Период.ДатаОкончания, Услуга, Поставщик);
	Выборка 	= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НСтрока = ТаблицаЗадолженности.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
