#Область ПрограммныйИнтерфейс

// Процедура - Загрузить файл формата XML 80020 из регламентного задания бестЗагрузкаФайловАСКУЭФорматаXML80020 
//
Процедура ЗагрузитьФайлПочасовкиXML80020() Экспорт
	
	ИспользоватьЭЭ = Обработки.энргКонстантыМенеджер.ЗначениеКонстанты("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ");
	Если Не ИспользоватьЭЭ Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = НастройкиВыполненияЗадания();
	КаталогФайлов = энргОбщегоНазначения.ЗначениеКонстанты(Настройки.Каталог);
	
	Если ПустаяСтрока(КаталогФайлов) Тогда
		Возврат;
	КонецЕсли;	
	
	ФайлыДляЗагрузки = бестИнтеграции.ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогФайлов, "Загружен_");
	
	Если ФайлыДляЗагрузки.Количество() = 0 Тогда
		ИмяЗадания = "Загрузка файлов АСКУЭ формата XML 80020 (профиль энергии и мощности)";	
		Комментарий = "Не найдены файлы в каталоге для загрузки";
		ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьФайлМногопоточноДлительныеОперации(ФайлыДляЗагрузки, Настройки); 
	
	ОбработатьЗагруженныеФайлы(ФайлыДляЗагрузки);

КонецПроцедуры  

Процедура ЗагрузитьФайлМногопоточноДлительныеОперации(ФайлыДляЗагрузки, Настройки)
		
	КоличествоДанных = ФайлыДляЗагрузки.Количество();
	КоличествоПотоков = Настройки.КоличествоПотоков;
	РазмерПотока = ?(КоличествоДанных < КоличествоПотоков, КоличествоДанных, Цел(КоличествоДанных/КоличествоПотоков));
	Пока РазмерПотока > Настройки.МаксРазмерПотока Цикл
		РазмерПотока = РазмерПотока - 1;
	КонецЦикла;
		
	Потоки = Новый Массив;
	МассивДанныхВПотоке = Новый Массив;
	Для Каждого ТекФайл Из ФайлыДляЗагрузки Цикл
		
		Файл = Новый ДвоичныеДанные(ТекФайл.ПолноеИмя);
		МассивДанныхВПотоке.Добавить(Файл);
		Если МассивДанныхВПотоке.Количество() = РазмерПотока Тогда
			Потоки.Добавить(МассивДанныхВПотоке);
			МассивДанныхВПотоке = Новый Массив;
		КонецЕсли;
		
	КонецЦикла; 
	
	Если МассивДанныхВПотоке.Количество() > 0 Тогда
		Потоки.Добавить(МассивДанныхВПотоке);
	КонецЕсли;
	
	ВыполняемыйМетод = Настройки.ПроцедураВыполнения; 
	Идентификатор = Новый УникальныйИдентификатор;
	Операции = Новый Массив;   
	Для Каждого Поток из Потоки Цикл
		ПараметрыВыполнения = ПараметрыВыполненияЗадания(Идентификатор); 
		
		ПараметрыФункцииПоток = Новый Структура("Файлы", Поток);

		ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыФункцииПоток, ПараметрыВыполнения.АдресРезультата);				
		Операции.Добавить(ДлительнаяОперация);
	КонецЦикла;
		
	ОжидатьЗавершениеЗадания(Операции);  
		
КонецПроцедуры   

Процедура ОжидатьЗавершениеЗадания(Операции)
	
	Для Каждого Операция из Операции Цикл 
		РезультатЗадания = ДлительныеОперации.ОперацияВыполнена(Операция.ИдентификаторЗадания);
		Пока РезультатЗадания.Статус = "Выполняется" Цикл
			РезультатЗадания = ДлительныеОперации.ОперацияВыполнена(Операция.ИдентификаторЗадания);;
		КонецЦикла; 
	КонецЦикла;  
	
КонецПроцедуры

Процедура ОбработатьЗагруженныеФайлы(Файлы)
	
	Для Каждого ТекФайл Из Файлы Цикл 
		НовоеИмяФайла = бестИнтеграции.ПолучитьИмяФайлаПослеЗагрузки(ТекФайл.ПолноеИмя);
		ПереместитьФайл(ТекФайл.ПолноеИмя, НовоеИмяФайла);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыВыполненияЗадания(Идентификатор)
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Идентификатор); 
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "бестЗагрузкаФайловАСКУЭФорматаXML80020";  
	ПараметрыВыполнения.КлючФоновогоЗадания = Новый УникальныйИдентификатор; 
	ПараметрыВыполнения.ЗапуститьВФоне = Истина; 
	ПараметрыВыполнения.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ПараметрыВыполнения.КлючФоновогоЗадания);
	Возврат ПараметрыВыполнения;
КонецФункции   

Функция НастройкиВыполненияЗадания()
	Настройки = Новый Структура;
	Настройки.Вставить("КоличествоПотоков", 5);
	Настройки.Вставить("МаксРазмерПотока", 7);
	Настройки.Вставить("ПроцедураВыполнения", "Обработка.бестЗагрузкаФайловАСКУЭФорматаXML80020.МодульОбъекта.ЗагрузитьПоказанияИзРегламентногоЗадания");
	Настройки.Вставить("Каталог", ИмяКонстантыКаталогаХраненияФайловXML80020());
	Возврат Настройки;
КонецФункции 

Функция ИмяКонстантыКаталогаХраненияФайловXML80020() 
	Возврат "бестКаталогЗагрузкиФайловXML80020";
КонецФункции

#КонецОбласти
