#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьРеквизитовДоговорСоцНайма();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	ТекПараметры	=	 Новый Структура;
	ТекПараметры.Вставить("Дата",			?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия, Объект.Дата));
	ТекПараметры.Вставить("Организация",	Объект.Организация);
	ТекПараметры.Вставить("Район",			Объект.Район);
	ТекПараметры.Вставить("Абонент",		Объект.Абонент);
	ТекущийТипСобственности	= АбонентПриИзмененииНаСервере(ТекПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ТипСобственностиЖильяПриИзменении(Элемент)
	УстановитьВидимостьРеквизитовДоговорСоцНайма();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	// ОТЭК, 22.05.2020, 000202897.
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");	
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ОТЭК, 22.05.2020, 000202897.	
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент, ОБъект.Организация, Объект.Район,,СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Функция АбонентПриИзмененииНаСервере(ТекПараметры)
	Объект.КлючПомещения = ТекПараметры.Абонент.КлючПомещения;
	
	Запрос = Новый Запрос;             
	Запрос.УстановитьПараметр("Дата", 			ТекПараметры.Дата);
	Запрос.УстановитьПараметр("Организация",	ТекПараметры.Организация);
	Запрос.УстановитьПараметр("Район",			ТекПараметры.Район);
	Запрос.УстановитьПараметр("КлючПомещения", 	ТекПараметры.Абонент.КлючПомещения);
	Запрос.Текст = "ВЫБРАТЬ
	|	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности КАК ТипСобственности
	|ИЗ
	|	РегистрСведений.энргТипСобственностиАбонентов.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК энргТипСобственностиАбонентовСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности";
	Результат 	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ТипСобственности;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьРеквизитовДоговорСоцНайма()

	ВидимостьРеквизитов = Объект.ТипСобственностиЖилья = ПредопределенноеЗначение("Перечисление.энргТипыСобственниковЖилья.МуниципальнаяСобственность")
									Или Объект.ТипСобственностиЖилья = ПредопределенноеЗначение("Перечисление.энргТипыСобственниковЖилья.ФедеральнаяСобственность");

	Элементы.НомерДоговораСоцНайма.Видимость = ВидимостьРеквизитов;
	Элементы.ДатаДоговораСоцНайма.Видимость	 = ВидимостьРеквизитов;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

