#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет период начисления.
//
// Параметры:
//  ДатаДокумента	-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
// 
// Возвращаемое значение:
//   Дата.
//
Функция ОпределитьПериодНачисления(Знач ДатаДокумента, Знач Организация, Знач Район) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов("энргГраницыПериодаНачисленияМенеджер","ОпределитьПериодНачисления") Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжГраницыПериодаНачисленияМенеджер") = Неопределено Тогда
				Возврат Обработки["слжГраницыПериодаНачисленияМенеджер"].ОпределитьПериодНачисления(ДатаДокумента, Организация, Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ГраницыРасчетногоПериодаВРазрезеРайонов = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргГраницыРасчетногоПериодаВРазрезеРайонов");
	
	Если ГраницыРасчетногоПериодаВРазрезеРайонов Тогда
		Район 								= Справочники.энргЗоныОтвественности.ПустаяСсылка()				
	КонецЕсли; 
	
	Дата									= ?(Не ЗначениеЗаполнено(ДатаДокумента),ТекущаяДата(),ДатаДокумента);
	ДатаКонстанта 							= РегистрыСведений.энргДатыОтчетногоПериодыОбщиеНастройки.ЗавершениеПериодаНачисленияПоОрганизации(Организация, Район);
	ЧислоЗавершенияПоРегистру 				= РегистрыСведений.энргДатыОтчетногоПериоды.ЗавершениеПериодаНачисления(Организация,Район,НачалоМесяца(Дата));
	
	Если Не ЗначениеЗаполнено(ДатаКонстанта) и ЗначениеЗаполнено(ЧислоЗавершенияПоРегистру) Тогда
		ДатаКонстанта 						= ЧислоЗавершенияПоРегистру;
	ИначеЕсли Не ЗначениеЗаполнено(ДатаКонстанта) Тогда
		ДатаКонстанта 						= 27;
		Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Район) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена константа 'День завершения расчетного периода'");
		КонецЕсли;
	КонецЕсли;
	
	КолВоДнейВМесяце 						= День(КонецМесяца(Дата));
	ДнейСНачалоПериода						= Мин(ДатаКонстанта, КолВоДнейВМесяце);
	ЧислоЗавОП								= НачалоМесяца(Дата) + ДнейСНачалоПериода  * 86400;
	
	Если Дата < ЧислоЗавОП Тогда
		ВозвратнаяДата						= НачалоМесяца(Дата);
	Иначе
		ВозвратнаяДата						= НачалоМесяца(ДобавитьМесяц(Дата,1));
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда		 
		ИмяМетода 							= "энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления";
		ПараметрыМетода 					= Новый Структура("ДатаДокумента, Организация, Район",ДатаДокумента, Организация, Район);
		слжОбщегоНазначенияМодуль 			= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, ВозвратнаяДата, ПараметрыМетода);
	КонецЕсли;
	
	Возврат ВозвратнаяДата;
КонецФункции

// Функция - Границы расчетного периода
//
// Параметры:
//  Организация					-	СправочникСсылка.Организации.
//  Район						-	СправочникСсылка.энргЗоныОтвественности.
//  ПериодНачисления			-	Дата.
//  УчитыватьНачалоВеденияУчета	-	Булево.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления,УчитыватьНачалоВеденияУчета = ложь) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов("энргГраницыПериодаНачисленияМенеджер", "ГраницыРасчетногоПериода") Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжГраницыПериодаНачисленияМенеджер") = Неопределено Тогда
				Возврат Обработки["слжГраницыПериодаНачисленияМенеджер"].ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,УчитыватьНачалоВеденияУчета);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Текст  							= энргНачисления.ТекстГраницОтчетногоПериода(ПериодНачисления,ПериодНачисления,УчитыватьНачалоВеденияУчета);
	Запрос  						= Новый запрос;
	Запрос.Текст 					= СтрЗаменить(Текст,"ПОМЕСТИТЬ ГраницыОтчетногоПериода","");
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	РезультатЗапроса				= Запрос.Выполнить();
	Результат  						= Новый Структура;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка  					= РезультатЗапроса.Выбрать();
		Выборка.Следующий();	
		Для Каждого КолонкаРезульта Из РезультатЗапроса.Колонки Цикл
			Результат.Вставить(КолонкаРезульта.Имя, Выборка[КолонкаРезульта.Имя]);
		КонецЦикла;
	Иначе		
		Результат.Вставить("Организация", 		Организация);
		Результат.Вставить("Район",				Район);
		Результат.Вставить("ПериодНачисления",	ПериодНачисления);
		Результат.Вставить("НачалоОП",			НачалоМесяца(ПериодНачисления));
		Результат.Вставить("ЗавершениеОП",		КонецМесяца(ПериодНачисления)+1);
		Результат.Вставить("ДнейВПериоде",		День(КонецМесяца(ПериодНачисления)));
		Для Каждого КолонкаРезульта Из РезультатЗапроса.Колонки Цикл
			Если Результат.Свойство(КолонкаРезульта.Имя) Тогда
				Продолжить;
			КонецЕсли; 			
			ТипыЗначения 			= КолонкаРезульта.ТипЗначения.Типы();
			ИндексУдаляемогоТипа 	= ТипыЗначения.Найти(Тип("Null"));
			Если Не ИндексУдаляемогоТипа = Неопределено Тогда
				ТипыЗначения.Удалить(ИндексУдаляемогоТипа);
			КонецЕсли;
			ТипЗначения 			= Новый ОписаниеТипов(ТипыЗначения);
			Результат.Вставить(КолонкаРезульта.Имя, ТипЗначения.ПривестиЗначение());
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда		 
		ИмяМетода 					= "энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода";
		ПараметрыМетода 			= Новый Структура("Организация,Район,ПериодНачисления,УчитыватьНачалоВеденияУчета",Организация,Район,ПериодНачисления,УчитыватьНачалоВеденияУчета);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли