#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
			
			//Объект.МаршрутКонтроллера = ЭтотОбъект.Строение.МаршрутКонтроллера;
			//Объект.Контроллер = Объект.МаршрутКонтроллера.Владелец;
			ЗаполнениеЖильцов();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ТипСобственности = ?(Объект.ДолеваяСобственность, "Долевая", "Совместная");

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДолиСобственности();
	ПерезаполнитьКатегории();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПерезаполнитьКатегории();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);

	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьКорректностьДанных(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры


&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнениеЖильцов();
	УстановитьВидимостьДолиСобственности();
КонецПроцедуры

&НаКлиенте
Процедура ТипСобственностиПриИзменении(Элемент)
	Объект.ДолеваяСобственность = ТипСобственности = "Долевая";
	Модифицированность = Истина;
	УстановитьВидимостьДолиСобственности();
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	//НайтиАбонента();
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	//НайтиАбонента();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЖильцы

&НаКлиенте
Процедура ЖильцыПриИзменении(Элемент)
	Если Элементы.Жильцы.ТекущиеДанные.ФизическоеЛицо.Пустая()=Истина Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пустое значение в колоке Физическое лицо"); 
	Иначе
		ПараметрыОтбора = Новый Структура;
		
		ПараметрыОтбора.Вставить("ФизическоеЛицо", Элементы.Жильцы.ТекущиеДанные.ФизическоеЛицо);
		
		НайденныеСтроки = Объект.Жильцы.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()> 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Физическое лицо уже выбрано");
			
			ИдентификаторСтроки = Элементы.Жильцы.ТекущаяСтрока;
			ЭлементКоллекции = Объект.Жильцы.НайтиПоИдентификатору(ИдентификаторСтроки);
			ИндексЭлементаКоллекции = Объект.Жильцы.Индекс(ЭлементКоллекции);
			Объект.Жильцы.Удалить(ИндексЭлементаКоллекции);
		иначе 
			
			УстановитьКлючиСтрокЖильцы();
			УстановитьКлючиСтрокЛьготы();
			УстановитьВидимостьСтрок();
			
		КонецЕсли;
	КонецЕсли;

	КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Объект.Жильцы[Объект.Жильцы.Количество()-1].IDСтроки = ПолучитьМаксимальныйКлючСтроки() + 1;
	КонецЕсли;
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПриАктивизацииСтроки(Элемент)
	Если Элементы.Жильцы.ТекущаяСтрока <> Неопределено Тогда 
		УстановитьВидимостьСтрок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДолиСобственности()

	Элементы.ЖильцыГруппаДоляСобственности.Видимость = Объект.ДолеваяСобственность;

КонецПроцедуры

&НаКлиенте
Процедура ЖильцыЛьготнаяКатегорияПриИзменении(Элемент)
	Если Элементы.Жильцы.ТекущиеДанные <> Неопределено Тогда
		Элементы.Жильцы.ТекущиеДанные.ПроцентЛьготы = ПолучитьПроцентЛьготы(Элементы.Жильцы.ТекущиеДанные.ЛьготнаяКатегория);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыСобственникПриИзменении(Элемент)
	ТекДанные = Элементы.Жильцы.ТекущиеДанные; 
	Если не ТекДанные.Собственник Тогда 
		Если ЗначениеЗаполнено(ТекДанные.ДоляСобственностиЧислитель) Тогда 
			ТекДанные.ДоляСобственностиЧислитель = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекДанные.ДоляСобственностиЗнаменатель) Тогда 
			ТекДанные.ДоляСобственностиЗнаменатель = 0;
		КонецЕсли;
	Иначе 
			ТекДанные.ДоляСобственностиЧислитель = 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПередУдалением(Элемент, Отказ)
	ИндексСтроки = Объект.Жильцы.Индекс(Элементы.Жильцы.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Жильцы.Получить(ИндексСтроки);
	IDСтроки = ВыделеннаяСтрока.IDСтроки;

	НулевыеСтроки = Объект.Льготы.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
	Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
		Объект.Льготы.Удалить(СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЖильцыДоляСобственностиЗнаменательПриИзменении(Элемент)
	Если Элементы.Жильцы.ТекущиеДанные <> Неопределено Тогда
		
		ТекДанные = элементы.Жильцы.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекДанные.ДоляСобственностиЧислитель) Тогда
			Если (ТекДанные.ДоляСобственностиЧислитель/ ТекДанные.ДоляСобственностиЗнаменатель)> 1 Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Доля собственности больше 1");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыДоляСобственностиЧислительПриИзменении(Элемент)
	Если Элементы.Жильцы.ТекущиеДанные <> Неопределено Тогда
		
		ТекДанные = элементы.Жильцы.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекДанные.ДоляСобственностиЗнаменатель) Тогда
			Если (ТекДанные.ДоляСобственностиЧислитель/ ТекДанные.ДоляСобственностиЗнаменатель)> 1 Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Доля собственности больше 1");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛьготы

&НаКлиенте
Процедура ЛьготыПриИзменении(Элемент)
	УстановитьКлючиСтрокЖильцы();
	УстановитьКлючиСтрокЛьготы();
КонецПроцедуры

&НаКлиенте
Процедура ЛьготыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Попытка
		ИндексСтрокиСостав = Объект.Жильцы.Индекс(Элементы.Жильцы.ТекущиеДанные);
		ВыделеннаяСтрока = Объект.Жильцы.Получить(ИндексСтрокиСостав);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Сначала выделите строку из табличной части ""Жильцы""'"));
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛьготыЛьготнаяКатегорияПриИзменении(Элемент)
	Если Элементы.Льготы.ТекущиеДанные <> Неопределено Тогда
		Элементы.Льготы.ТекущиеДанные.ПроцентЛьготы = ПолучитьПроцентЛьготы(Элементы.Льготы.ТекущиеДанные.ЛьготнаяКатегория);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьКорректностьДанных(Отказ)
	
	ДоляСобственности = 0;
	КолВоСобственников = 0; 
	КолВоПрописанных = 0; 
	КолВоПроживающих = 0; 
	
	Для Каждого стр из Объект.Жильцы цикл 
		Если ЗначениеЗаполнено(стр.ФизическоеЛицо) и не стр.Проживаюший  и не стр.Прописанный и Не стр.Собственник Тогда 
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан признак  Собственник/Проживающий/Прописанный в строке " + Строка(Стр.номерСтроки));
			
		ИначеЕсли ЗначениеЗаполнено(стр.ФизическоеЛицо) Тогда
			Если стр.Собственник тогда 
				Если ТипСобственности = "Долевая" Тогда 
					
					Если  ЗначениеЗаполнено(стр.ДоляСобственностиЗнаменатель) и ЗначениеЗаполнено(стр.ДоляСобственностиЧислитель) Тогда 
						ДоляСобственности = ДоляСобственности + (стр.ДоляСобственностиЧислитель/стр.ДоляСобственностиЗнаменатель);
					ИначеЕсли не ЗначениеЗаполнено(стр.ДоляСобственностиЗнаменатель) Тогда
						Отказ = истина; 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан знаменатель в строке " + Строка(Стр.номерСтроки) );
					ИначеЕсли  не ЗначениеЗаполнено(стр.ДоляСобственностиЧислитель)  Тогда
						Отказ = истина; 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан числитель в строке " + Строка(Стр.номерСтроки) );
					КонецЕсли;
					
				КонецЕсли;
				
				КолВоСобственников = КолВоСобственников + 1;
				
			КонецЕсли;
			
			Если стр.Проживаюший тогда 
				КолВоПроживающих = КолВоПроживающих + 1;
			КонецЕсли;
			
			Если стр.Прописанный тогда 
				КолВоПрописанных = КолВоПрописанных + 1;
			КонецЕсли;
			
			
		Иначе 
			Отказ = истина; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано физическое лицо в строке " + Строка(Стр.номерСтроки) );
		КонецЕсли;
	КонецЦикла;
	
	Если ДоляСобственности > 1 Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма долей собственности не может быть больше 1");
	КонецЕсли;
	
	Если Объект.КоличествоПроживающих < КолВоПроживающих Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество проживающих превышает допустимое");
	КонецЕсли;
	
	Если  Объект.КоличествоПрописанных < КолВоПрописанных  Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество прописанных превышает допустимое");
	КонецЕсли;
	
	Если  Объект.КоличествоСобственников < КолВоСобственников  Тогда 
		Отказ = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество собственников превышает допустимое");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПроцентЛьготы(ЛьготнаяКатегория)
	Период = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	
	Возврат Документы.энргОперацияСЛицевымСчетом.ПолучитьПроцентЛьготы(ЛьготнаяКатегория, Объект.Организация, Объект.Район, Период);
КонецФункции

&НаСервере
Процедура ПерезаполнитьКатегории()
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеЖильцов()

	Документы.энргИзменениеКоличестваПрописанныхПроживающихСобственников.ЗаполнениеЖильцов(Объект);
	
		
КонецПроцедуры // ие()

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура УстановитьКлючиСтрокЖильцы()
	Для каждого Стр Из Объект.Жильцы Цикл
		Если Не ЗначениеЗаполнено(Стр.IdСтроки) или стр.IDСтроки = "00000000-0000-0000-0000-000000000000" Тогда
			Стр.IdСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	УстановитьВидимостьСтрок();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтрок()
	СоставИндексСтроки = Объект.Жильцы.Индекс(Элементы.Жильцы.ТекущиеДанные);
	Если СоставИндексСтроки >= 0 Тогда
		ВыделеннаяСтрока = Объект.Жильцы.Получить(СоставИндексСтроки);
		IdСтроки = ВыделеннаяСтрока.IdСтроки;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("IdСтроки", IdСтроки);
		Элементы.Льготы.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКлючиСтрокЛьготы()
	
	ИндексСтрокиЛьгота = Объект.Жильцы.Индекс(Элементы.Жильцы.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Жильцы.Получить(ИндексСтрокиЛьгота);
	КлючСтроки = ВыделеннаяСтрока.IdСтроки;
	
	Для каждого Стр Из Объект.Льготы Цикл
		Если Не ЗначениеЗаполнено(Стр.IdСтроки) Тогда
			Стр.IdСтроки = КлючСтроки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМаксимальныйКлючСтроки()
	МаксимальныйКлючСтроки = 1;
	Для каждого Стр Из Объект.Жильцы Цикл
		Попытка
			МаксимальныйКлючСтроки = Макс(МаксимальныйКлючСтроки, Число(Стр.IDСтроки));
		Исключение
			МаксимальныйКлючСтроки = МаксимальныйКлючСтроки;
		КонецПопытки;
	КонецЦикла;
	Возврат МаксимальныйКлючСтроки;
КонецФункции

#КонецОбласти