#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	слжСлужебныеОперацииПриСозданииНаСервере();
		
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацияСЛицевымСчетом(ЭтотОбъект);
		
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,,,,"УслугиДерево");
	// энргРаботаСПоставщиками }
	
	ЗаполнитьПериодНачисления();
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании,,"ДобавитьКомандыСозданияОткрытияЛицевогоСчетаНаОсновании");
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
		
		Если НЕ ЗначениеЗаполнено(Объект.Договор) и ЗначениеЗаполнено(Объект.Организация) и ЗначениеЗаполнено(Объект.Район) и ЗначениеЗаполнено(ФизЛицо) Тогда
			Объект.Договор 				= Обработки.энргДоговорыКонтрагентовМенеджер.НайтиДействующийДоговорПоПараметрам(Объект.Организация, Объект.Район, ФизЛицо, ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),Объект.ДатаФактическогоСобытия,Объект.Дата));			
		КонецЕсли;
		
		ЗаполнитьСвойстваФормыПоДоговору(); 		
		ЗаполнитьСвойстваФормыПоКлючуПомещения();
		
		Если НЕ ЗначениеЗаполнено(Филиал) Тогда
			ЭтаФорма.Филиал = Обработки.энргФилиалыСтроенийМенеджер.ПолучитьТекущееЗначениеФилиала(Объект.Организация, Объект.Район, Строение);
		КонецЕсли;
		
		ПоказатьУзлы();
	КонецЕсли;			
	
	УстановитьПараметрВыбораПомещения();
	УстановитьСвязиПараметровВыбораТаблицыВидыБлагоустройстваТарифныеКатегории();
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	ЗаполнитьСвойстваАбонента(ТекущийОбъект.Абонент,ТекущийОбъект.ОписаниеАбонента);
			
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);
		
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	УслугиДерево.ПолучитьЭлементы().Очистить();
	ЗаполнитьДеревоУслугНаОснованииТочекУчета(Объект, УслугиДерево);
		
	Если ЗначениеЗаполнено(ЭтотОбъект.Строение) Тогда
		ТипСтроения					= ТипСтроения();
		НастроитьВидимостьПомещенияСервер(ТипСтроения);		
	КонецЕсли; 
	
	ПоказатьУзлы();
	ПерезаполнитьКатегории();
	ЗаполнитьДанныеСНТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//УстановитьСвязиПараметровВыбораТаблицыВидыБлагоустройстваТарифныеКатегории();
	УстановитьВидимостьГруппыДоговорСоцНайма();
	УстановитьВидимостьДолиСобственности();
	УстановитьВидимостьСНТ();
	ЗаполнитьТипСобственности();  
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеАбонента = Обработки.энргАбонентыМенеджер.ЗаписатьДанныеАбонента(ЭтотОбъект);	
	
	СоответствиеСтрок = Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		

		ДатаПроверки	= ?(Объект.ДатаФактическогоСобытия = Дата(1,1,1), Объект.Дата, Объект.ДатаФактическогоСобытия);
		НовыйАбонент	= Обработки.энргАбонентыМенеджер.СсылкаПоКлючевымПараметрам(ДатаПроверки, ТекущийОбъект.Организация, ТекущийОбъект.Район, ТекущийОбъект.КлючПомещения, Неопределено, ТекущийОбъект.Поставщик, ТекущийОбъект.ТочкиУчета.Выгрузить(,"Услуга"));
		
		Если ЗначениеЗаполнено(НовыйАбонент) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данным услугам в указанном помещении есть активный ЛС " + НовыйАбонент.ЛицевойСчет);
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущийОбъект.Абонент ) Тогда
			ТекущийОбъект.Абонент = Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовыйАбонент", Истина);
		КонецЕсли;
		
		// Определяем контроллера по адресу.
		// энргРаботаСЛицевымСчетомСервер.ДобавитьАдресКМашруту(ЭтотОбъект.АдресОбъекта,ЭтотОбъект.АдресОбъектаЗначение,ТекущийОбъект.Контроллер,ТекущийОбъект.МаршрутКонтроллера);
		Обработки.энргМаршрутыКонтроллеровМенеджер.ЗарегистрироватьКлючПомещенияВМаршрутеКонтролера(Объект.МаршрутКонтроллера, Объект.КлючПомещения);
		// TODO FIX ME
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		// TODO FIX ME
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		НовыеИзмерители 					= Новый Массив;
		СоответствиеПрибора 				= Новый Соответствие;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;			
		КонецЦикла; 		
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				//СтрокаИзмерителя.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				//НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				
				ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.Абонент);
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("УстановкаФормулыРасчета") тогда
		ДанныеУстановкиФормулыРасчета = ДопСвойства.УстановкаФормулыРасчета;		 
	иначе
		ДанныеУстановкиФормулыРасчета = Неопределено;
	КонецЕсли;
	
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
	
	ЗаполнитьСвойстваАбонента(ТекущийОбъект.Абонент,ТекущийОбъект.ОписаниеАбонента);
	
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		ЗаполнитьДанныеАбонента(ТекущийОбъект);		
		НовыеТочкиУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеТочкиУчета") Тогда
			НовыеТочкиУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеТочкиУчета;
		КонецЕсли;
		
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			ЗаполнитьДанныеТочкиВСтроке(Отказ,НовыеТочкиУчета, СтрокаТочки.ТочкаУчета, СтрокаТочки.ОписаниеТочки, СтрокаТочки.НомерСтроки);
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
			КонецЕсли;
		КонецЦикла; 		
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Отказ Тогда
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеДляФормулРасчета(ТекущийОбъект);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчета", энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект));   		
	КонецЕсли;	
	
	ПриЗаписиНаСервереПереопределяемыйПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи); 	

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервереПереопределяемыйПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Переопределяется в расширении
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если  ДанныеУстановкиФормулыРасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУстановкиФормулыРасчетаЗавершение",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ установки формулы расчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
	Если Не Объект.Проведен Или Не ЗначениеЗаполнено(Строение) Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьТехВозможностьОРП();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановкиФормулыРасчетаЗавершение(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуУстановкиФормулы(ДанныеУстановкиФормулыРасчета);
		иначе
			ДанныеУстановкиФормулыРасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Объект.ТочкиУчета.Очистить();
	ЗаполнитьТочкиНаОснованииДереваУслуг(УслугиДерево.ПолучитьЭлементы(), Неопределено);
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;	
		
КонецПроцедуры

#Конецобласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 	
	ЗаполнитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		СтроениеПомещениеПриИзмененииСервер(Истина);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	СтроениеПомещениеПриИзмененииСервер(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент, ИзменятьДооговор = Ложь)
	Объект.Жильцы.Очистить();
	Если ЗначениеЗаполнено(ЭтотОбъект.ФизЛицо) Тогда
		Стр 								= Объект.Жильцы.Добавить();
		Стр.ФизическоеЛицо					= ЭтотОбъект.ФизЛицо;
		Стр.ДоляСобственностиЧислитель		= 1;
		Стр.ДоляСобственностиЗнаменатель	= 1;
		Стр.Собственник						= Объект.ТипСобственностиЖилья = ПредопределенноеЗначение("Перечисление.энргТипыСобственниковЖилья.ЧастнаяСобственность");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контрагент изменен. Необходимо перепроверить договор.");	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииСервер();	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыФизическоеЛицоПриИзменении(Элемент)
	Если Элементы.Жильцы.ТекущиеДанные <> Неопределено Тогда
		Элементы.Жильцы.ТекущиеДанные.ЛьготнаяКатегория = ПолучитьЛьготуКонтрагента(Элементы.Жильцы.ТекущиеДанные.ФизическоеЛицо);
		Элементы.Жильцы.ТекущиеДанные.ПроцентЛьготы = ПолучитьПроцентЛьготы(Элементы.Жильцы.ТекущиеДанные.ЛьготнаяКатегория);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыЛьготнаяКатегорияПриИзменении(Элемент)
	Если Элементы.Жильцы.ТекущиеДанные <> Неопределено Тогда
		Элементы.Жильцы.ТекущиеДанные.ПроцентЛьготы = ПолучитьПроцентЛьготы(Элементы.Жильцы.ТекущиеДанные.ЛьготнаяКатегория);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент, ИзменятьДооговор = Истина)	
	РайонПриИзмененииСервер();
КонецПроцедуры      

&НаСервере
Процедура РайонПриИзмененииСервер()
	ПерезаполнитьКатегории();
КонецПроцедуры 

&НаКлиенте
Процедура ТипСобственностиЖильяПриИзменении(Элемент)
	УстановитьВидимостьГруппыДоговорСоцНайма();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ПриИзмененииДоговораСервер();
КонецПроцедуры

&НаКлиенте
Процедура СНТДНТПривязанПриИзменении(Элемент)
	УстановитьВидимостьСНТ();
	Если Не ЗначениеЗаполнено(Объект.СНТДНТПривязан) Тогда   
		Объект.ТочкаПоставкиЮЛПотребление = ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СНТДНТПотребление) Тогда
		Объект.СНТДНТПотребление = Объект.СНТДНТПривязан;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиЮЛПотреблениеПриИзменении(Элемент)
	ЗаполнитьДанныеСНТ();	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиЮЛПотреблениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	МассивПараметров 	= Новый Массив;
    НовыйПараметр 		= Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьТППоДоговору(Объект.Дата, Объект.СНТДНТПотребление));
    МассивПараметров.Добавить(НовыйПараметр);
	ЗначениеСвойства = Новый ФиксированныйМассив(МассивПараметров);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкаПоставкиЮЛПотребление", "ПараметрыВыбора", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
	
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);
	
КонецПроцедуры

#Конецобласти

#Область СобытияЭлементовСобственности

&НаКлиенте
Процедура ТипСобственностиПриИзменении(Элемент)
	Объект.ДолеваяСобственность = ТипСобственности = ЭтоДолеваяСобственность();
	УстановитьВидимостьДолиСобственности();
КонецПроцедуры

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	Объект.ТочкиУчета.Очистить();
	Модифицированность = Истина;
	ЗаполнитьТочкиНаОснованииДереваУслуг(УслугиДерево.ПолучитьЭлементы(), Неопределено);
	ТочкиУчетаПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТаблицаФормы 					= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	
	Если Копирование Тогда		
		Родитель	  				= УслугиДерево.НайтиПоИдентификатору(ТаблицаФормы.ТекущаяСтрока).ПолучитьРодителя();
	Иначе
		Отказ 						= Истина;		
		НоваяСтрока  				= УслугиДерево.ПолучитьЭлементы().Добавить();
		ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
		ТаблицаФормы.ИзменитьСтроку();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаПриИзмененииСервер()
	// TODO FIX ME
	энргРаботаСЛицевымСчетомСервер.ОбновитьВидыБлагоустройстваТарифныеКатегории(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура РегистрируетОбъемПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныНаправлениеИспользованияТУПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета; 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаправленияИспользованияТУ(ТекущиеДанные.IDСтроки,ТекущиеДанные.НаправлениеИспользованияТУ);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	ИмяТаблицыНаправленийИзмеренийТУ  	= "ЗначенияИзмерителей" + ПрефиксТочекУчета;
	ТаблицыНаправленийИзмеренийТУ  		= Элементы[ИмяТаблицыНаправленийИзмеренийТУ];
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПриАктивацииСтроки(ТаблицыНаправленийИзмеренийТУ,"IDСтроки",ТекущиеДанные.IDСтроки);
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ЗначенияИзмерителей,ТекущиеДанные);
	
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ШкалыПриборовУчета,ТекущиеДанные,"IDСтрокиТочкиУчета");
	
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ТочкиПоставок,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТаблицаТочкиПоставок					= Элементы.ТочкиПоставокУзлы;
	
	ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаТочкиПоставок,"IDСтроки",ТекущиеДанные.IDСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныВидКанальностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныГоловнаяПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	
	Если ТекущиеДанные.ЭтоСоставнаяУслуга Тогда
		//энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
		СтандартнаяОбработка				= Ложь;
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	Иначе 
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	КонецЕсли;
	
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ЕстьШкалыЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	Состав 									= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтроки,Состав,"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДиаметрСеченияПриИзменении(Элемент)
	ТекСтрока = Элемент.Родитель.Родитель.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.РассчитыватьПоДиаметруСечения = ЗначениеЗаполнено(ТекСтрока.ДиаметрСечения);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны 

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныНаправлениеИспользованияТУПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета; 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаправленияИспользованияТУ(ТекущиеДанные.IDСтроки,ТекущиеДанные.НаправлениеИспользованияТУ);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	ТаблицаТочкиПоставок					= Элементы.ТочкиПоставок;
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	ИмяТаблицыНаправленийИзмеренийТУ  	= "ЗначенияИзмерителей" + ПрефиксТочекУчета;
	ТаблицыНаправленийИзмеренийТУ  		= Элементы[ИмяТаблицыНаправленийИзмеренийТУ];
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПриАктивацииСтроки(ТаблицыНаправленийИзмеренийТУ,"IDСтроки",ТекущиеДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаТочкиПоставок,"IDСтроки",ТекущиеДанные.IDСтроки);
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками } 	
	
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ЗначенияИзмерителей,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиШкалы,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности,ТекущиеДанные.услуга),"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныГоловнаяПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	
	Если ТекущиеДанные.ЭтоСоставнаяУслуга Тогда
		//энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
		СтандартнаяОбработка=Ложь;
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	Иначе 
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонНаправлениеИспользованияТУПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета; 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаправленияИспользованияТУ(ТекущиеДанные.IDСтроки,ТекущиеДанные.НаправлениеИспользованияТУ);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкалы	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалы,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	ИмяТаблицыНаправленийИзмеренийТУ  	= "ЗначенияИзмерителей" + ПрефиксТочекУчета;
	ТаблицыНаправленийИзмеренийТУ  		= Элементы[ИмяТаблицыНаправленийИзмеренийТУ];
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПриАктивацииСтроки(ТаблицыНаправленийИзмеренийТУ,"IDСтроки",ТекущиеДанные.IDСтроки);
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ЗначенияИзмерителей,ТекущиеДанные);
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ШкалыПриборовУчета,ТекущиеДанные,"IDСтрокиТочкиУчета");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонВидКанальностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомДифференцированности }
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонГоловнаяПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	
	Если ТекущиеДанные.ЭтоСоставнаяУслуга Тогда
		//энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
		СтандартнаяОбработка=Ложь;
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	Иначе 
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыНаправленийИзмеренийТУ  	= "ЗначенияИзмерителей" + ПрефиксТочекУчета;
	ТаблицыНаправленийИзмеренийТУ  		= Элементы[ИмяТаблицыНаправленийИзмеренийТУ];
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПриАктивацииСтроки(ТаблицыНаправленийИзмеренийТУ,"IDСтроки",ТекущиеДанные.IDСтроки);
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ЗначенияИзмерителей,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонНаправлениеИспользованияТУПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета; 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаправленияИспользованияТУ(ТекущиеДанные.IDСтроки,ТекущиеДанные.НаправлениеИспользованияТУ);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонГоловнаяПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	
	Если ТекущиеДанные.ЭтоСоставнаяУслуга Тогда
		//энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
		СтандартнаяОбработка				= Ложь;
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	Иначе 
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	// энргРаботаСПоставщиками }
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыВидыБлагоустройстваТарифныеКатегории

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 

#Область СобытияТаблицыФормыПринадлежностьТочекУчета

&НаКлиенте
Процедура ПринадлежностьТочекУчетаПередНачаломИзменения(Элемент, Отказ)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанныеТочкиУчета					= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Отказ 								= Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыПринадлежностьТочекУчета 		= "ПринадлежностьТочекУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыПринадлежностьТочекУчета].ТекущиеДанные;
	ТекущиеДанные.IDСтрокиТочкиУчета 		= ТекущиеДанныеТочкиУчета.IDСтроки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура ДобавитьПодчиненнуюУслугу(Команда)	
	Отказ 						= Истина;
	ТаблицаФормы 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	Родитель  					= УслугиДерево.НайтиПоИдентификатору(ТаблицаФормы.ТекущаяСтрока);
	НоваяСтрока  				= Родитель.ПолучитьЭлементы().Добавить();
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();		
КонецПроцедуры

#Конецобласти

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

#Конецобласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСвязиПараметровВыбораТаблицыВидыБлагоустройстваТарифныеКатегории()
		
	мЭлементыФорм 							= Новый Массив;
	мЭлементыФорм.Добавить(Элементы.ВидыБлагоустройстваТарифныеКатегорииВидБлагоустройстваИндивидуальный);
	мЭлементыФорм.Добавить(Элементы.ВидыБлагоустройстваТарифныеКатегорииТарифнаяКатегория);
	Для ИндексЭлемента = 0 По мЭлементыФорм.ВГраница() Цикл
		ЭлементФормы 						= мЭлементыФорм[ИндексЭлемента];
		ТекущиеСвязиПараметровВыбора 		= ЭлементФормы.СвязиПараметровВыбора;
		Связи 								= Новый Массив;
		ИмяТаблицыТочекУчета 				= "ТочкиУчета" + ПрефиксТочекУчета; 
		Для Индекс = 0 По ТекущиеСвязиПараметровВыбора.ВГраница() Цикл
			Если ТекущиеСвязиПараметровВыбора[Индекс].Имя = "ДополнительныеСвойства.Услуга" Тогда
				ПутьКДанным 				= "Элементы." + ИмяТаблицыТочекУчета + ".ТекущиеДанные.Услуга";
				Связь 						= Новый СвязьПараметраВыбора("ДополнительныеСвойства.Услуга",ПутьКДанным,РежимИзмененияСвязанногоЗначения.НеИзменять);
			Иначе
				Связь 						= ТекущиеСвязиПараметровВыбора[Индекс];
			КонецЕсли;
			Связи.Добавить(Связь);
		КонецЦикла;	
		СвязиПараметровВыбора 				= Новый ФиксированныйМассив(Связи);	
		ЭлементФормы.СвязиПараметровВыбора 	= СвязиПараметровВыбора;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТипСобственности() 
	ТипСобственности 			= ?(Объект.ДолеваяСобственность,ЭтоДолеваяСобственность(),ЭтоСовместнаяСобственность());
КонецПроцедуры

&НаКлиенте
Функция ЭтоДолеваяСобственность()
	Возврат 0;	
КонецФункции

&НаКлиенте
Функция ЭтоСовместнаяСобственность()
	Возврат 1;
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеПоУслугам() Экспорт 
	ОбновитьДанныеПоУслугамСервер();
	ТочкиУчетаПриИзмененииСервер();
	
	ПоказатьУзлы();
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер()
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,Объект);	
	
	Строки  			= УслугиДерево.ПолучитьЭлементы();
	Строки.Очистить();
				
	ЗаполнитьДеревоУслугНаОснованииТочекУчета(Объект, УслугиДерево, Неопределено, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТочкиНаОснованииДереваУслуг(Строки, Родитель)
	
	Для Каждого Строка Из Строки Цикл 		
		СтрокаТочки  						= Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочки, Строка);
		Если Не Родитель = Неопределено Тогда
			СтрокаТочки.IDСтрокиРодитель	= Родитель;			
		КонецЕсли;
		ЗаполнитьТочкиНаОснованииДереваУслуг(Строка.ПолучитьЭлементы(), Строка.IDСтроки);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные)
	ДопПараметры = Новый Структура("ЭтоВводПУ,НеРегистрацияОбъема",Истина,Истина);
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма,ДопПараметры);
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаправленияИспользованияТУ(IDСтроки,РодительскийЭлемент)
	
	Справочники.энргНаправлениеИспользованияТочекУчета.ОбновитьТЧЗначенияИзмерителей(Объект.ЗначенияИзмерителей,IDСтроки,РодительскийЭлемент,Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУслугНаОснованииТочекУчета(ТекущийОбъект, СтрокаРодитель, Родитель = Неопределено, ЗаполнятьТекстыГиперссылок = Истина)
	
	Если Родитель = Неопределено Тогда
		ОписаниеТипа  		= Новый ОписаниеТипов("УникальныйИдентификатор");	
		Родитель 			= ОписаниеТипа.ПривестиЗначение();
	КонецЕсли;
	
	Вершины 				= ТекущийОбъект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиРодитель", Родитель));
	Строки  				= СтрокаРодитель.ПолучитьЭлементы();
		
	Для Сч = 0 По Вершины.ВГраница() Цикл
		Если ЗначениеЗаполнено(Вершины[Сч].IDСтроки) Тогда
			СтрокаДерева  	= Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Вершины[Сч]);
			
			Если ЗаполнятьТекстыГиперссылок Тогда
				СтрокаДерева.ДанныеУслуги 			= энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстДанныеУслуги(СтрокаДерева);
				СтрокаДерева.ДанныеРасположения 	= энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстДанныеРасположения(СтрокаДерева);
				СтрокаДерева.ТехническиеСвойстваТУ	= энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(СтрокаДерева, Объект.Потери.НайтиСтроки(Новый Структура("IDСтроки", СтрокаДерева.IDСтроки)));
				
				ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаДерева.IDСтроки)));
				энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(СтрокаДерева, ДанныеИзмерителей);
			КонецЕсли;
			
			ЗаполнитьДеревоУслугНаОснованииТочекУчета(ТекущийОбъект, СтрокаДерева, Вершины[Сч].IDСтроки, ЗаполнятьТекстыГиперссылок);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаОснованииСтроения(ТипСтроения)
	
	Если Не ТипСтроения = Перечисления.энргТипыСтроений.МКД Тогда
		Возврат;
	КонецЕсли;
	Объект.ТочкиУчета.Очистить();
	Объект.ВидыБлагоустройстваТарифныеКатегории.Очистить();
	ЗаполнитьУслугиПомещенияПоУслугамМКД();
	ЗаполнитьВидыБлагоустройстваТарифныеКатегорииНаОснованииУслугСтроения();		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиПомещенияПоУслугамМКД()
	ПолучаемыеСвойства 								= "СтруктураСети";
	РезультатЗапроса  								= Обработки.энргСостояниеУслугСтроенийМенеджер.ДействующиеУслугиСтроения(Объект.Организация,Объект.Район,Строение,ПолучаемыеСвойства);
	тзУслугиСтроений								= РезультатЗапроса.Выгрузить();
	тзУслугиСтроений.Свернуть("СоставнаяУслуга,Услуга,Поставщик,СтруктураСети");
	тзУслугиСтроений.Сортировать("СоставнаяУслуга");
	текСоставнаяУслуга 								= Неопределено;
	Для Каждого УслугаСтроения Из тзУслугиСтроений Цикл
		Если НЕ текСоставнаяУслуга = УслугаСтроения.СоставнаяУслуга
			ИЛИ НЕ ЗначениеЗаполнено(УслугаСтроения.СоставнаяУслуга) Тогда
			НоваяСтрокаТочки						= Объект.ТочкиУчета.Добавить();
			НоваяСтрокаТочки.IDСтроки 				= Новый УникальныйИдентификатор;
			НоваяСтрокаТочки.Услуга 				= ?(ЗначениеЗаполнено(УслугаСтроения.СоставнаяУслуга),УслугаСтроения.СоставнаяУслуга,УслугаСтроения.Услуга);
			НоваяСтрокаТочки.ЭтоСоставнаяУслуга		= ЗначениеЗаполнено(УслугаСтроения.СоставнаяУслуга);
			НоваяСтрокаТочки.СтруктураСети			= УслугаСтроения.СтруктураСети;
		КонецЕсли;
		
		Если НоваяСтрокаТочки.ЭтоСоставнаяУслуга Тогда
			СтрокаПоствщика 						= Объект.ПоставщикиСоставныхУслуг.Добавить();
			СтрокаПоствщика.IDСтроки 				= НоваяСтрокаТочки.IDСтроки;
			СтрокаПоствщика.ЧастьСоставнойУслуги 	= УслугаСтроения.Услуга;
			СтрокаПоствщика.Поставщик 				= УслугаСтроения.Поставщик;
		Иначе
			НоваяСтрокаТочки.Поставщик 				= УслугаСтроения.Поставщик;
		КонецЕсли;
		
		текСоставнаяУслуга 							= УслугаСтроения.СоставнаяУслуга;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыБлагоустройстваТарифныеКатегорииНаОснованииУслугСтроения()
		
	мУслуги 											= Новый Массив;
	Для Каждого СтрокаТочкиУчета Из Объект.ТочкиУчета Цикл
		Если СтрокаТочкиУчета.ЭтоСоставнаяУслуга Тогда
			Продолжить;
		КонецЕсли;		
		мУслуги.Добавить(СтрокаТочкиУчета.Услуга);		
	КонецЦикла;
	
	Для Каждого СтрокаТочкиУчета Из Объект.ПоставщикиСоставныхУслуг Цикл
		мУслуги.Добавить(СтрокаТочкиУчета.ЧастьСоставнойУслуги);		
	КонецЦикла;
	
	мУникальныеУслуги 									= ОбщегоНазначенияКлиентСервер.СвернутьМассив(мУслуги);
	ВидыБлагоустройстваТарифныеКатегорииСтроения 		= Обработки.энргСтроенияМенеджер.ВидыБлагоустройстваТарифныеКатегорииСтроения(Строение,мУникальныеУслуги);
	Выборка 											= ВидыБлагоустройстваТарифныеКатегорииСтроения.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока 									= Объект.ВидыБлагоустройстваТарифныеКатегории.Добавить();
		НоваяСтрока.Услуга 								= Выборка.Услуга;
		НоваяСтрока.ВидБлагоустройстваИндивидуальный	= Выборка.ВидБлагоустройстваИндивидуальный;
		НоваяСтрока.ТарифнаяКатегория					= Выборка.ТарифнаяКатегория;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТипСтроения()
	ПолучаемыеСвойства 	= "ТипСтроения";
	ЗначенияСвойств 	= Обработки.энргСтроенияМенеджер.ЗначенияСвойствОбъекта(Строение,ПолучаемыеСвойства);
	Возврат ЗначенияСвойств["ТипСтроения"];	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКанальности) тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.ВидКанальности = ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование(ТекДанные)
	Если ТекДанные.Головная Тогда 
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга + "_Головная";
	Иначе
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга;
	КонецЕсли;
КонецПроцедуры

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков",IDСтроки = Неопределено, СоотвествиеУслуг = Неопределено) Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы,"УслугиДерево");
КонецПроцедуры
// энргРаботаСПоставщиками }

&НаСервереБезКонтекста
Функция ПроверитьКоличествоЖильцов(Знач ТаблицаЖильцов, КолвоПрописанных)
	Возврат ТаблицаЖильцов.Количество() <> КолвоПрописанных;
	//Возврат Объект.Жильцы.Количество() <> Объект.КоличествоПрописанных;
КонецФункции

&НаСервере
Функция ПолучитьЛьготуКонтрагента(Контрагент)
	// TODO FIX ME
	Период = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	
	Возврат Документы.энргОперацияСЛицевымСчетом.ПолучитьЛьготуКонтрагента(Контрагент, Объект.Организация, Объект.Район, Период);
КонецФункции

&НаСервере
Функция ПолучитьПроцентЛьготы(ЛьготнаяКатегория)
	// TODO FIX ME
	Период = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	
	Возврат Документы.энргОперацияСЛицевымСчетом.ПолучитьПроцентЛьготы(ЛьготнаяКатегория, Объект.Организация, Объект.Район, Период);
КонецФункции

&НаСервере
Процедура ПерезаполнитьКатегории()  	
	Для каждого стр из Объект.Жильцы Цикл
		стр.ЛьготнаяКатегория = ПолучитьЛьготуКонтрагента(стр.ФизическоеЛицо);
		стр.ПроцентЛьготы = ПолучитьПроцентЛьготы(стр.ЛьготнаяКатегория);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПомещенияСервер(ТипСтроения) 	
	//ЭлементФормы  				= Элементы.Помещение;
	//Если ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЖД") Тогда
	//	//ЭлементФормы.Доступность 	= Не ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЖД");
	//	ЭлементФормы.Доступность 	= Истина;
	//Иначе
	//	ЭлементФормы.Доступность 	= Ложь;
	//	
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДоговораСервер()
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат;
	КонецЕсли;
	
	ПолучаемыеРеквизиты = "Организация,Район,Контрагент";
	ЗначенияРеквизитов 	= Обработки.энргДоговорыКонтрагентовМенеджер.ЗначенияСвойствОбъекта(Объект.Договор, ПолучаемыеРеквизиты);
			
	Если Объект.Организация <> ЗначенияРеквизитов["Организация"] Тогда
		Объект.Организация = ЗначенияРеквизитов["Организация"];
		ОрганизацияПриИзмененииСервер();
	КонецЕсли;
	
	Если Объект.Район <> ЗначенияРеквизитов["Район"] Тогда
		Объект.Район = ЗначенияРеквизитов["Район"];
		РайонПриИзмененииСервер();
	КонецЕсли;
	
	Если ФизЛицо <> ЗначенияРеквизитов["Контрагент"] Тогда
		ФизЛицо = ЗначенияРеквизитов["Контрагент"];		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтроениеПомещениеПриИзмененииСервер(СтроениеИзменено)
	
	ДанныеКлючаПомещения 			= Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Строение,Помещение);
	 	
	Если НЕ ДанныеКлючаПомещения.КлючПомещения = Объект.КлючПомещения Тогда
		ЗаполнитьЗначенияСвойств(Объект,ДанныеКлючаПомещения,"КлючПомещения");
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеКлючаПомещения,"ЧастныйСектор");
		ДанныеМаршрута  			= Обработки.энргМаршрутыКонтроллеровМенеджер.ДанныеМаршрутаПоКлючуПомещения(Объект.КлючПомещения);
		Объект.МаршрутКонтроллера 	= ДанныеМаршрута.Маршрут;
		Объект.Контроллер			= ДанныеМаршрута.Контролер;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеКлючаПомещения.Район) и НЕ Объект.Район = ДанныеКлючаПомещения.Район Тогда
		Объект.Район 				= ДанныеКлючаПомещения.Район;
	КонецЕсли; 	
	
	Если СтроениеИзменено и Объект.ТочкиУчета.Количество() = 0 Тогда
		ТекДата 					= ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия, Объект.Дата);
		ТипСтроения 				= ТипСтроения();
		НастроитьВидимостьПомещенияСервер(ТипСтроения);	
		ЗаполнитьТЧНаОснованииСтроения(ТипСтроения);
		
		Строки  			= УслугиДерево.ПолучитьЭлементы();
		Строки.Очистить();
		ЗаполнитьДеревоУслугНаОснованииТочекУчета(Объект, УслугиДерево);
		
		// энргРаботаСПоставщиками {
		энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,,,,"УслугиДерево");
		// энргРаботаСПоставщиками }
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьГруппыДоговорСоцНайма()
	
	Элементы.ГруппаДоговорСоцНайма.Видимость = Объект.ТипСобственностиЖилья = ПредопределенноеЗначение("Перечисление.энргТипыСобственниковЖилья.МуниципальнаяСобственность")
	Или Объект.ТипСобственностиЖилья = ПредопределенноеЗначение("Перечисление.энргТипыСобственниковЖилья.ФедеральнаяСобственность");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДолиСобственности()

	Элементы.ЖильцыГруппаДоляСобственности.Видимость = Объект.ДолеваяСобственность;

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьСНТ()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСкрываемаяСНТ", 
		"Видимость", ЗначениеЗаполнено(Объект.СНТДНТПривязан));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	ЗаполнитьПериодНачисления();
	ПерезаполнитьКатегории();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисления() 
	
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваФормыПоКлючуПомещения()
	Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда 			
		ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
		ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		
		Если Не ЗначениеЗаполнено(Объект.Район) Тогда
			ОписаниеСтроения 		= Обработки.энргСтроенияМенеджер.ЗначенияСвойствОбъекта(Строение, "Район");			
			Объект.Район 			= ОписаниеСтроения.Район;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваТочекУчета(Знач ТекущийОбъект)
	
	ПолучаемыеСвойстваТочекУчета 	= ПолучаемыеСвойстваТочекУчета();
	мТочкиУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"));	
	СвойстваТочекУчета 				= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектов(мТочкиУчета, ПолучаемыеСвойстваТочекУчета);
	ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Объект.ТочкиУчета, СвойстваТочекУчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Коллекция, СвойстваТочекУчета)
	
	СоотвествиеРеквизитовСвойств 								= СоотвествиеРеквизитовСвойствамТочкиУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ТочкаУчета) Тогда
			СвойстваТочкиУчета 									= СвойстваТочекУчета[СтрокаКоллекции.ТочкаУчета];		
		Иначе
			СвойстваТочкиУчета 									= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеТочки);
		КонецЕсли; 
		
		Если СвойстваТочкиУчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СвойстваТочкиУчета.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваТочкиУчета[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваАбонента(АбонентСсылка, ОписаниеАбонента)
	перем ЗначенияРеквизитов;
	
	ПолучаемыеСвойстваАбонента  = "Контрагент,ВидОбъекта,МуниципальноеОбразование,Филиал";
	Если ЗначениеЗаполнено(АбонентСсылка) Тогда
		ЗначенияРеквизитов 		= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(АбонентСсылка,ПолучаемыеСвойстваАбонента);		
	ИначеЕсли НЕ ПустаяСтрока(ОписаниеАбонента) Тогда
		ЗначенияРеквизитов 		= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовИзСтрокиJSON(ОписаниеАбонента,ПолучаемыеСвойстваАбонента);
	КонецЕсли;
	
	Если ЗначенияРеквизитов = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ФизЛицо 					= ЗначенияРеквизитов.Контрагент;
	ВидОбъекта 					= ЗначенияРеквизитов.ВидОбъекта;
	МуниципальноеОбразование 	= ЗначенияРеквизитов.МуниципальноеОбразование;
	Филиал 						= ЗначенияРеквизитов.Филиал;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваФормыПоДоговору() 
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ПолучаемыеРеквизитыДоговора = "Контрагент,Филиал";
		ЗначениеРеквизитовДоговора 	= Обработки.энргДоговорыКонтрагентовМенеджер.ЗначенияСвойствОбъекта(Объект.Договор, ПолучаемыеРеквизитыДоговора);
		ЭтаФорма.ФизЛицо 			= ЗначениеРеквизитовДоговора.Контрагент;
		ЭтаФорма.Филиал				= ЗначениеРеквизитовДоговора.Филиал;
	Иначе
		Если Параметры.ЗначенияЗаполнения.Свойство("Контрагент") Тогда
			ЭтаФорма.ФизЛицо 		= Параметры.ЗначенияЗаполнения.Контрагент;
		КонецЕсли;
		
		Если Параметры.ЗначенияЗаполнения.Свойство("Филиал") Тогда
			ЭтаФорма.Филиал 		= Параметры.ЗначенияЗаполнения.Филиал;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	ТаблицаЖильцов 		= Объект.Жильцы;
	КолвоПрописанных 	= Объект.КоличествоПрописанных;
	ЭтоПроведение		= РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Если ЭтоПроведение Тогда
		
		Если НЕ ЗначениеЗаполнено(Филиал) Тогда
			
			ЕстьОшибкиЗаполнения = Истина; 			
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Поле ""Абонентский отдел"" не заполнено'"),,
			"Филиал");
			
		КонецЕсли; 
		
		Если ПомещениеНеЗаполненоМКД(Строение, Помещение) Тогда
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ЭтоПроведение И ПроверитьКоличествоЖильцов(ТаблицаЖильцов, КолвоПрописанных) Тогда
		ПоказатьОповещениеПользователя("Количество прописанных не соответствует количеству жильцов"); 		
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.Контроллер) Тогда 
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле «Контроллер» не заполнено");
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.МаршрутКонтроллера) Тогда 
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле «Маршрут контроллера» не заполнено");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда 
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните точки учета");
	КонецЕсли;
	
	Если НАЧАЛОМЕСЯЦА(Объект.Дата) = НАЧАЛОМЕСЯЦА(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПомещениеНеЗаполненоМКД(Строение, Помещение)
	Результат = Ложь;
	СтроениеДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строение, "ТипСтроения");
	Если СтроениеДокумента = Перечисления.энргТипыСтроений.МКД И НЕ ЗначениеЗаполнено(Помещение) Тогда
		
		Результат = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать помещение!");
		
	КонецЕсли;                                                                             
	
	Возврат Результат;	
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамПрибораУчета()
	Возврат энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамТочкиУчета()
	Возврат Новый Структура("НаименованиеТочки,Расположение,Головная","Наименование","Расположение","Головная");
КонецФункции

&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета()
	Возврат энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
КонецФункции

&НаСервере
Функция ПолучаемыеСвойстваТочекУчета() 
	ПолучаемыеСвойстваТочекУчета 	= "
	|Наименование,Расположение,Головная";	
	Возврат ПолучаемыеСвойстваТочекУчета;
КонецФункции

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАбонента(Знач ТекущийОбъект)
	
	Перем ОписаниеОбъектаАбонент, ЭтоНовыйАбонент;
	
	ОписаниеОбъектаАбонент 							= Обработки.энргАбонентыМенеджер.ОписаниеОбъекта();
	ОписаниеОбъектаАбонент.Организация 				= ТекущийОбъект.Организация;		
	ОписаниеОбъектаАбонент.Район 					= ТекущийОбъект.Район;
	ОписаниеОбъектаАбонент.КлючПомещения 			= ТекущийОбъект.КлючПомещения;
	ОписаниеОбъектаАбонент.ФизЛицо 					= ФизЛицо;
	ОписаниеОбъектаАбонент.ГруппаАбонента 			= ТекущийОбъект.ГруппаАбонента;
	ОписаниеОбъектаАбонент.ВидОбъекта 				= ВидОбъекта;
	ОписаниеОбъектаАбонент.СтарыйЛС 				= ТекущийОбъект.СтарыйЛС;
	ОписаниеОбъектаАбонент.Филиал 					= Филиал;
	ОписаниеОбъектаАбонент.МуниципальноеОбразование = МуниципальноеОбразование;
	ОписаниеОбъектаАбонент.Ссылка 					= ТекущийОбъект.Абонент;
	ОписаниеОбъектаАбонент.Поставщик				= ТекущийОбъект.Поставщик;
	
	ЭтоНовыйАбонент 								= Ложь;
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭтоНовыйАбонент") Тогда
		ЭтоНовыйАбонент 							= ТекущийОбъект.ДополнительныеСвойства.ЭтоНовыйАбонент;
	КонецЕсли;
	
	Обработки.энргАбонентыМенеджер.ЗаполнитьОбъектПоОписанию(ОписаниеОбъектаАбонент, ЭтоНовыйАбонент, ТекущийОбъект.Дата);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТочкиВСтроке(Отказ,Знач НовыеТочкиУчета, Знач ТочкаУчета, Знач ОписаниеТочки, Знач НомерСтроки)
		
	ЭтоНоваяТочка 										= НЕ НовыеТочкиУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаТочкиУчета 							= Обработки.энргТочкиУчетаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовТочкиУчета						= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеТочки);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовТочкиУчета Цикл
		Если ОписаниеОбъектаТочкиУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаТочкиУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаТочкиУчета.Ссылка 					= ТочкаУчета;
	Если НЕ Обработки.энргТочкиУчетаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаТочкиУчета,ЭтоНоваяТочка) Тогда
		Отказ											= Истина;
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрВыбораПомещения()
	ДоступныеТипыПомещений = Новый Массив;
	ДоступныеТипыПомещений.Добавить(Перечисления.энргТипыПомещений.Квартира);
	ДоступныеТипыПомещений.Добавить(Перечисления.энргТипыПомещений.Комната);	
	
	МассивПараметров 	= Новый Массив;
    НовыйПараметр 		= Новый ПараметрВыбора("Отбор.ТипПомещения", ДоступныеТипыПомещений);
    МассивПараметров.Добавить(НовыйПараметр);
	ЗначениеСвойства = Новый ФиксированныйМассив(МассивПараметров);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Помещение", "ПараметрыВыбора", ЗначениеСвойства);   
КонецПроцедуры

&НаСервере
Процедура УстановитьТехВозможностьОРП()
	
	РС = РегистрыСведений.энргТехническаяВозможностьОРП;
	РезультатЗапроса = РС.ПолучитьВозможностьОРП(Строение, Помещение);
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ТекТехническаяВозможностьПроведенияОРП = Выборка.ЕстьВозможность;
	Иначе
		ТекТехническаяВозможностьПроведенияОРП = Ложь;
	КонецЕсли;
	
	Если ТекТехническаяВозможностьПроведенияОРП <> ТехническаяВозможностьПроведенияОРП Тогда
		РС.УстановитьВозможностьОРП(Строение, Помещение, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСНТ()
	ВычитатьОбъемИзОбъемаЮЛ = ЗначениеЗаполнено(Объект.ТочкаПоставкиЮЛПотребление);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТППоДоговору(Период, СНТДНТПотребление)
	 Возврат бестРаботаСТочкамиУчетаНПСервер.ПолучитьТППоДоговору(Период, СНТДНТПотребление);	
КонецФункции


#Конецобласти

#Область РаботаСУзлами

&НаКлиенте
Процедура ДобавитьТочкуСУзлом(Команда)
	энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияУслуг(энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияУслуг(ЭтотОбъект));
КонецПроцедуры

// В дальнейшем удалится 
&НаСервере
Процедура ПоказатьУзлы()
	Если НЕ ПолучитьФункциональнуюОпцию("энргУзлыУчетаФизическихЛиц") Тогда
		Возврат
	КонецЕсли;
	ПрефиксТочекУчета 										= "";
	
	Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоны.Видимость  	= Ложь;
	Элементы.СтраницаНетШкалЕстьТарифныеЗоны.Видимость  	= Ложь;
	Элементы.СтраницаЕстьШкалыНетТарифныхЗон.Видимость  	= Ложь;
	Элементы.СтраницаНетШкалНетТарифныхЗон.Видимость  		= Ложь;
	Элементы.СтраницаУслуги.Видимость  						= Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеЛьготнойКатегории(Категория)
	ТекПериод = ?(ЗначениеЗаполнено(Объект.ПериодНачисления), Объект.ПериодНачисления, ТекущаяДатаСеанса());
	Возврат РегистрыСведений.энргЗначенияЛьготныхКатегорий.ПолучитьЗначенияЛьготнойКатегории(Категория, Объект.Организация, Объект.Район, ТекПериод); 
КонецФункции

&НаКлиенте
Процедура ЛьготныеКатегорииКатегорияПриИзменении(Элемент)
	ТекДанные =  Элементы.ЛьготныеКатегории.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Данные = ПолучитьЗначениеЛьготнойКатегории(ТекДанные.Категория);
		ТекДанные.Процент = Данные.ПроцентОтНачислений;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РаботаСТочкамиПоставок

&НаКлиенте
Процедура ТочкиПоставокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда		
		ИмяТаблицыТочек 		= "ТочкиУчета" + ПрефиксТочекУчета;
		ТекущиеДанные 			= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элемент.ТекущиеДанные.IDСтроки			= ТекущиеДанные.IDСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ИмяТаблицыТочек 		= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 			= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Выберите точку учета");
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставокУзлыТочкаПоставкиПриИзменении(Элемент)
	ИмяТаблицыТочек 		= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 			= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДанныеРасположения = энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстДанныеРасположения(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область Подсистема_ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область Подсистема_слжСлужебная

&НаКлиенте
Процедура Подключаемый_слж_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ОбработкаВыбораПоляВвода(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПриИзменении(Элемент)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ПолеВводаПриИзменении(Элемент, ЭтаФорма);	
	ДействиеПоУмолчанию 		= слжСобытияФормКлиентМодуль.ДействиеПриИзмененииПоУмолчанию(Элемент, ЭтаФорма);
	Если Не ПустаяСтрока(ДействиеПоУмолчанию) Тогда
		Выполнить(ДействиеПоУмолчанию+"(Элемент)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПередЗаписью(Отказ, ПараметрыЗаписи)
	 	
	слжМодульКлиент					= ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	СтруктураДействияПоУмолчанию 	= слжМодульКлиент.СтруктураДействияПоУмолчанию(ЭтаФорма);
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписью) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписью+"(Отказ, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
			
	Отказ 							= слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписи) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписи+"(ПараметрыЗаписи)");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	Отказ 							= Истина;
	Модифицированность 				= Ложь;
	
КонецПроцедуры

&НаСервере
Функция слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи)
	
	слжМодуль 					= ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");		
	слжТекущийОбъект 			= РеквизитФормыВЗначение("Объект");
	Отказ 						= Ложь;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере) Тогда		
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЕсли;		
	
	Если НЕ слжТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ 					= Истина;
		Возврат Истина;
	КонецЕсли;

	НачатьТранзакцию();		
	слжТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере+"(слжТекущийОбъект, ПараметрыЗаписи)");
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(слжТекущийОбъект,"Объект");
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура слжСлужебныеОперацииПриСозданииНаСервере()	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжСобытияФормМодуль = ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");
		слжСобытияФормМодуль.ПриСозданииНаСервере(ЭтотОбъект, Объект);
		Если Параметры.Свойство("слжКлюч") Тогда			
			слжПреобразовательДанныхМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжПреобразовательДанных");
			слжТекущийОбъект 				= слжПреобразовательДанныхМодуль.ТекущийОбъектПриЧтенииНаСервере(Параметры["слжКлюч"]);			
			слжПреобразовательДанныхМодуль.ЗаполнитьДанныеФормы(Параметры["слжКлюч"],Объект);
			ПриЧтенииНаСервере(слжТекущийОбъект);			
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПриАктивизацииСтроки(Элемент)
	
	ТаблицаЛьготныеКатегории= Элементы.ЛьготныеКатегории;
	
	ТекДанные = Элементы.Жильцы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаЛьготныеКатегории,"IDСтроки",ТекДанные.IDСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ЖильцыПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.Жильцы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ЛьготныеКатегории,ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ЛьготныеКатегорииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда		
		ТекДанныеЖильцы = Элементы.Жильцы.ТекущиеДанные;
		Если ТекДанныеЖильцы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элемент.ТекущиеДанные.IDСтроки			= ТекДанныеЖильцы.IDСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛьготныеКатегорииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанныеЖильцы = Элементы.Жильцы.ТекущиеДанные;
	Если ТекДанныеЖильцы = Неопределено Тогда
		ПоказатьПредупреждение(,"Выберите жильца");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияСНТДНТ

&НаКлиенте
Процедура СНТДНТПотреблениеПриИзменении(Элемент)
	Объект.ТочкаПоставкиЮЛПотребление = Неопределено;
	ЗаполнитьДанныеСНТ();
КонецПроцедуры

#КонецОбласти