#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргРегистрацияПоказанийМКД.ТочкиУчета КАК ТаблицаТочекУчета
	|ГДЕ
	|	ТаблицаТочекУчета.Ссылка = &ссылка
	|	И НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
						
	ТаблицаЗарегистрированныеОбъемы = ПолучитьТаблицуЗарегистрированныеОбъемы();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ТаблицаЗарегистрированныеОбъемы,	Движения.бестЗарегистрированныеОбъемыПотребленияНП);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуЗарегистрированныеОбъемы()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Док", Ссылка); 	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Ссылка КАК Регистратор,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Дата КАК Период,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Организация КАК Организация,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Район КАК Район,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.Услуга КАК Услуга,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъемИтоговый) КАК ОбъемИтоговый,
	|	СУММА(бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъемДосчитанный) КАК ОбъемДосчитанный,
	|	СУММА(бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.Объем) КАК ОбъемПоПрибору,
	|	СУММА(бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.КоличествоЧасовШтатнойРаботыПУ) КАК КоличествоЧасовШтатнойРаботыПУ,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Дата КАК ПериодРегистрации,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.Температура КАК Температура,
	|	СУММА(бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъемМГВ - бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъемОбратнойСетевойВоды) КАК ОбъемМГВ,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.СпособНачисления КАК СпособНачисления,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъектРасчета.МКД КАК МКД
	|ИЗ
	|	Документ.бестРегистрацияОбъемовПотребленияПриборовУчета.ТочкиУчета КАК бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРегистрацияОбъемовПотребленияПриборовУчета КАК бестРегистрацияОбъемовПотребленияПриборовУчета
	|		ПО бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.Ссылка = бестРегистрацияОбъемовПотребленияПриборовУчета.Ссылка
	|ГДЕ
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Ссылка = &Док
	|
	|СГРУППИРОВАТЬ ПО
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Ссылка,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъектРасчета,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ТочкаУчета,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.Услуга,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ПриборУчета,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Дата,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Организация,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Район,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.ПериодНачисления,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.КоличествоЧасовРаботыТУ,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.Температура,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.СпособНачисления,
	|	бестРегистрацияОбъемовПотребленияПриборовУчетаТочкиУчета.ОбъектРасчета.МКД,
	|	бестРегистрацияОбъемовПотребленияПриборовУчета.Дата";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли