#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргИзменитьНомерПломбыПрибораУчетаМКД(ЭтотОбъект);
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ЗаполнитьТочкуУчетаОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
	ЗаполнитьТочкуУчетаОтбора();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлеметовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли; 
	
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)	
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район 			= ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

#КонецОбласти

#Область РаботаСТЧ

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер()
	Объект.ТочкиУчета.Очистить();
	Объект.НомераПломб.Очистить();
	
	Если не ЗначениеЗаполнено(ТочкаУчета) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана точка учета");		
		Возврат;
	КонецЕсли;	
	
	ОтборТочкиУчета 	= ?(ЗначениеЗаполнено(ТочкаУчета), ТочкаУчета, Неопределено);
	Результат 			= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаМКД(Объект.Дата, Объект.Организация, Объект.Район, Объект.МКД, ОтборТочкиУчета); 
	Выборка  			= Результат.выбрать();
	ТекПрибор 			= Неопределено;
	
	Пока Выборка.следующий() цикл
		
		Если НЕ ТекПрибор = Выборка.ПриборУчета Тогда			
			НоваяСтрока = Объект.ТочкиУчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		КонецЕсли;
		
		ТекПрибор = Выборка.ПриборУчета;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТочкуУчетаОтбора()
	ТочкаУчета = ?(Объект.ТочкиУчета.Количество() = 0, Справочники.энргТочкиУчета.ПустаяСсылка(), Объект.ТочкиУчета[0].ТочкаУчета);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)	
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  	
	
	ТаблицаФормы 				= Элементы.НомераПломб;
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормы, "IDСтрокиТочки", ТекущиеДанные.IDСтроки);	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)	
	ТекущиеДанные  		= Элементы.ТочкиУчета.ТекущиеДанные;
	УсловияОтбора		= Новый Структура("IDСтрокиТочки", ТекущиеДанные.IDСтроки);
	ТЧОчистки			= Объект.НомераПломб;
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТЧОчистки, УсловияОтбора);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиНомераПломб

&НаКлиенте
Процедура НомераПломбПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	Отказ = Элементы.ТочкиУчета.ТекущиеДанные = Неопределено;	
КонецПроцедуры

&НаКлиенте
Процедура НомераПломбПередНачаломИзменения(Элемент, Отказ)	
	Отказ = Элементы.ТочкиУчета.ТекущиеДанные = Неопределено; 	
КонецПроцедуры

&НаКлиенте
Процедура НомераПломбПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) 	
	ТекущиеДанныеТочки 					= Элементы.ТочкиУчета.ТекущиеДанные;
	ТекущиеДанные 						= Элементы.НомераПломб.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.IDСтрокиТочки 	= ТекущиеДанныеТочки.IDСтроки;		
	КонецЕсли;				
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти