#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьКонтактныеЛица(Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестКонтактныеЛицаКонтрагентов.Ссылка КАК КонтактноеЛицо
		|ИЗ
		|	Справочник.бестКонтактныеЛицаКонтрагентов КАК бестКонтактныеЛицаКонтрагентов
		|ГДЕ
		|	бестКонтактныеЛицаКонтрагентов.Владелец = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо");
КонецФункции

#КонецОбласти

#КонецЕсли