#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет точки учета помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТочкиУчетаПомещения(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеТаблицы());
	Пакет.ТаблицаДляПомещения 				= "ДанныеТаблицыВладельцыТочекУчета"; 
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, ТочкаУчета, АбонентВладелец";
		Если ПараметрыОтбора.Свойство("Район")  Тогда
			ДоступныеПараметры = ДоступныеПараметры + ", Район";
		КонецЕсли;
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргВладельцыТочекУчета",ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли; 	
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) и ПараметрыОтбора.Период.Свойство("ТипПараметра") Тогда
		Если ПараметрыОтбора.Период["ТипПараметра"] = "ТипПараметраГраницаИсключая" Тогда
			Пакет.Операторы[0].Отбор.Добавить("энргВладельцыТочекУчета.Период < &" + ПараметрыОтбора["Период"].ИмяПараметра);
		Иначе
			Пакет.Операторы[0].Отбор.Добавить("энргВладельцыТочекУчета.Период <= &" + ПараметрыОтбора["Период"].ИмяПараметра);
		КонецЕсли; 		
	ИначеЕсли ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда	
		Пакет.Операторы[0].Отбор.Добавить("энргВладельцыТочекУчета.Период <= &" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		ДоступныеПоляОтбора	 				= Новый Структура("ТочкиУчета", "ТочкаУчета");
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"",ПараметрыОтбора.Отбор,ДоступныеПоляОтбора);		
	Иначе
		ИндексТаблицыТочек 					= 1;
		Источники 							= Пакет.Операторы[0].Источники;
		Источники.Удалить(ИндексТаблицыТочек);
	КонецЕсли; 
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТочкиУчетаПоКлючуПомещения());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 							= Пакет.Операторы[0];	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей.Свойство("КлючПомещения") Тогда				
				СоотвествиеПолей 			= Новый Структура("АбонентВладелец", ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей["КлючПомещения"]);
				ОтборКлючПомещения 			= Новый Структура("ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра,СоотвествиеПолей);
				Если ПараметрыОтбора.ПараметрыВТ[Сч].Свойство("ИмяПараметра") Тогда
					ОтборКлючПомещения.Вставить("ИмяПараметра", ПараметрыОтбора.ПараметрыВТ[Сч]["ИмяПараметра"]);
				КонецЕсли;
				
				Если ПараметрыОтбора.ПараметрыВТ[Сч].Свойство("ТаблицаИсточник") Тогда
					ОтборКлючПомещения.Вставить("ТаблицаИсточник", ПараметрыОтбора.ПараметрыВТ[Сч]["ТаблицаИсточник"]);
				КонецЕсли;
				
				МассивОтбора 				= новый Массив;
				МассивОтбора.Добавить(ОтборКлючПомещения);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргВладельцыТочекУчета", МассивОтбора, "АбонентВладелец");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	Источник 								= ОператорВыбора.Источники[1].Источник;
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет точки учета МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТочкиУчетаМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТочкиУчетаМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		ИсточникиПолей	 			= Новый Структура("ТочкаУчета", "энргТочкиУчета");
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргВладельцыТочекУчетаСрезПоследних",ПараметрыОтбора.ПараметрыВТ, ИсточникиПолей);		
	КонецЕсли; 	
		
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеТаблицы()
	Текст  =
	"ВЫБРАТЬ
	|	энргВладельцыТочекУчета.Период КАК Период,
	|	энргВладельцыТочекУчета.Регистратор КАК Регистратор,
	|	энргВладельцыТочекУчета.НомерСтроки КАК НомерСтроки,
	|	энргВладельцыТочекУчета.Активность КАК Активность,
	|	энргВладельцыТочекУчета.Организация КАК Организация,
	|	энргВладельцыТочекУчета.Район КАК Район,
	|	энргВладельцыТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргВладельцыТочекУчета.АбонентВладелец КАК АбонентВладелец
	|ПОМЕСТИТЬ ДанныеТаблицы
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета КАК энргВладельцыТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК ТочкиУчета
	|		ПО энргВладельцыТочекУчета.ТочкаУчета = ТочкиУчета.Ссылка";
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаТочкиУчетаПоКлючуПомещения()
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргВладельцыТочекУчета.АбонентВладелец КАК КлючПомещения,
	|	энргВладельцыТочекУчета.АбонентВладелец КАК МКД,
	|	энргВладельцыТочекУчета.АбонентВладелец КАК Объект,
	|	ВЫБОР
	|		КОГДА энргВладельцыТочекУчета.АбонентВладелец ССЫЛКА Справочник.энргКлючиПомещений
	|			ТОГДА 1
	|		КОГДА энргВладельцыТочекУчета.АбонентВладелец ССЫЛКА Справочник.энргСтроения
	|			ТОГДА 2
	|		КОГДА энргВладельцыТочекУчета.АбонентВладелец ССЫЛКА Справочник.бестОбъектыРасчета
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипВладельца
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПериодМаксимум КАК ПериодМаксимум,
	|		МАКСИМУМ(энргВладельцыТочекУчета.Регистратор) КАК РегистраторМаксимум
	|	ИЗ
	|		(ВЫБРАТЬ
	|			энргВладельцыТочекУчетаСрезПоследних.Организация КАК Организация,
	|			энргВладельцыТочекУчетаСрезПоследних.Район КАК Район,
	|			энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(энргВладельцыТочекУчетаСрезПоследних.Период) КАК ПериодМаксимум
	|		ИЗ
	|			ДанныеТаблицыВладельцыТочекУчета КАК энргВладельцыТочекУчетаСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			энргВладельцыТочекУчетаСрезПоследних.Организация,
	|			энргВладельцыТочекУчетаСрезПоследних.Район,
	|			энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТаблицыВладельцыТочекУчета КАК энргВладельцыТочекУчета
	|			ПО ВложенныйЗапрос.Организация = энргВладельцыТочекУчета.Организация
	|				И ВложенныйЗапрос.Район = энргВладельцыТочекУчета.Район
	|				И ВложенныйЗапрос.ТочкаУчета = энргВладельцыТочекУчета.ТочкаУчета
	|				И ВложенныйЗапрос.ПериодМаксимум = энргВладельцыТочекУчета.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.ТочкаУчета,
	|		ВложенныйЗапрос.ПериодМаксимум) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТаблицыВладельцыТочекУчета КАК энргВладельцыТочекУчета
	|		ПО ВложенныйЗапрос.Организация = энргВладельцыТочекУчета.Организация
	|			И ВложенныйЗапрос.Район = энргВладельцыТочекУчета.Район
	|			И ВложенныйЗапрос.ТочкаУчета = энргВладельцыТочекУчета.ТочкаУчета
	|			И ВложенныйЗапрос.РегистраторМаксимум = энргВладельцыТочекУчета.Регистратор
	|			И ВложенныйЗапрос.ПериодМаксимум = энргВладельцыТочекУчета.Период";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаТочкиУчетаМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.Организация КАК Организация,
	|	энргВладельцыТочекУчетаСрезПоследних.Район КАК Район,
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец КАК МКД,
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних КАК энргВладельцыТочекУчетаСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|		ПО энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета = энргТочкиУчета.Ссылка
	|ГДЕ
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец = &МКД";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли