#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 Булево - Ложь, функция не работает.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Ложь;
	
КонецФункции

#Область СлужебныйИнтерфейс

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов.
//  ПараметрыПечати			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати.
//  КоллекцияПечатныхФорм	-	см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм.
//  ОбъектыПечати			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати.
//  ПараметрыВывода			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета;
	
	Если ИмяМакета = "ПФ_MXL_ПроектПисьмаОбОтсутствующихДокументах" Тогда
		ТабличныйДокумент 		= СформироватьПроектПисьмаОбОтсутствующихДокументах(ИмяМакета, ПараметрыПечати);
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета, СинонимМакета,
		ТабличныйДокумент, ,
		"Документ.бестПлатежныйДокумент." + ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Процедура - Инициализировать данные документа
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами 
//  ДополнительныеСвойства	 - Структура 
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт 
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	ИнициализироватьИсходныеДанныеДокумента(Схема);
		
	ДобавитьТекстЗапросабестНагрузкаПоУслугамНП(Схема, "бестНагрузкаПоУслугамНП");
	ДобавитьТекстЗапросабестПотребителиГВС(Схема, "бестПотребителиГВС"); 
	ДобавитьТекстЗапросабестТочкиПоставкиТочекУчетаЮЛ(Схема, "бестТочкиПоставкиТочекУчетаЮЛ"); 
	ДобавитьТекстЗапросабестКоэффциентыПриборовУчетаНП(Схема, "бестКоэффциентыПриборовУчетаНП");
	ДобавитьТекстЗапросабестДатыПоверкиПрибораУчетаНП(Схема, "бестДатыПоверкиПрибораУчетаНП");
	ДобавитьТекстЗапросабестПоказанияПриборовУчетаНП(Схема, "бестПоказанияПриборовУчетаНП");   
	ДобавитьТекстЗапросабестГарантированныеОбъемы(Схема, "бестГарантированныеОбъемы");  
	ДобавитьТекстЗапросабестСпособНачисленияНормативаНП(Схема, "бестСпособНачисленияНормативаНП");
	ДобавитьТекстЗапросабестАктивностьТочекУчетаНП(Схема, "бестАктивностьТочекУчетаНП");  
	ДобавитьТекстЗапросабестУслугиТочекУчетаНП(Схема, "бестУслугиТочекУчетаНП");
	ДобавитьТекстЗапросабестТУРассчитываемыеПоГрафикуГП(Схема, "бестТУРассчитываемыеПоГрафикуГП");
	ДобавитьТекстЗапросабестСостояниеДоговоров(Схема, "бестСостояниеДоговоров"); 
	ДобавитьТекстЗапросабестЗначенияПлощадейНП(Схема, "бестЗначенияПлощадейНП"); 
	ДобавитьТекстЗапросабестУчастиеОбъектовВРаспределенииРесурсовВМКД(Схема, "бестУчастиеОбъектовВРаспределенииРесурсовВМКД"); 
	ДобавитьТекстЗапросабестВыставлениеПереплатыВАвансовыхСчетах(Схема, "бестВыставлениеПереплатыВАвансовыхСчетах"); 
	ДобавитьТекстЗапросабестДоговорныеНастройкиРасчетаПени(Схема, "бестДоговорныеНастройкиРасчетаПени");
	ДобавитьТекстЗапросаэнргФормулыРасчетаУслугМКД(Схема, "энргФормулыРасчетаУслугМКД"); 
	ДобавитьТекстЗапросабестВидыДифференцированностиПриборовУчетаНП(Схема, "бестВидыДифференцированностиПриборовУчетаНП"); 
	ДобавитьТекстЗапросабестТемпературныеГрафикиДоговоровСЮридическимиЛицами(Схема, "бестТемпературныеГрафикиДоговоровСЮридическимиЛицами"); 
	ДобавитьТекстЗапросабестМаксимальныеНагрузкиПоДоговору(Схема, "бестМаксимальныеНагрузкиПоДоговору");
	ДобавитьТекстЗапросабестТарифныеКатегорииНП(Схема, "бестТарифныеКатегорииНП");
	ДобавитьТекстЗапросабестСостояниеПриборовУчетаНП(Схема, "бестСостояниеПриборовУчетаНП"); 
	ДобавитьТекстЗапросабестПриборыТочекУчетаНП(Схема, "бестПриборыТочекУчетаНП"); 
	ДобавитьТекстЗапросабестПараметрыИзмерителей(Схема, "бестПараметрыИзмерителей");
	ДобавитьТекстЗапросабестСобственникиОбъектовРасчета(Схема, "бестСобственникиОбъектовРасчета");
	ДобавитьТекстЗапросабестДоговорыТочекУчета(Схема, "бестДоговорыТочекУчета"); 
	ДобавитьТекстЗапросабестПрочиеДополнительныеНачисления(Схема, "бестПрочиеДополнительныеНачисления");
	ДобавитьТекстЗапросабестТочкиПоставкиОбъектовРасчета(Схема, "бестТочкиПоставкиОбъектовРасчета");
	ДобавитьТекстЗапросабестФормулыРасчетаТочекУчетаНП(Схема, "бестФормулыРасчетаТочекУчетаНП");
	ДобавитьТекстЗапросабестРежимыПотребления(Схема, "бестРежимыПотребления");
	ДобавитьТекстЗапросабестПриборыУзловУчетаНП(Схема, "бестПриборыУзловУчетаНП");
	ДобавитьТекстЗапросабестДопускПриборовУчетаККоммерческомуУчету(Схема, "бестДопускПриборовУчетаККоммерческомуУчету");
	ДобавитьТекстЗапросабестНомерПломбПриборовУчетаНП(Схема, "бестНомерПломбПриборовУчетаНП");
	ДобавитьТекстЗапросабестПотериТочекУчета(Схема, "бестПотериТочекУчета");
	ДобавитьТекстЗапросабестСезонныеНагрузкиПоУслугам(Схема, "бестСезонныеНагрузкиПоУслугам"); 
	ДобавитьТекстЗапросабестНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов(Схема, "бестНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов");
	ДобавитьТекстЗапросабестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам(Схема, "бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам");  
	ДобавитьТекстЗапросабестГрафикиРежимаОграничения(Схема, "бестГрафикиРежимаОграничения");  
	ДобавитьТекстЗапросабестВеличиныБрони(Схема, "бестВеличиныБрони");
	ДобавитьТекстЗапросабестПоставщикиУслугНП(Схема, "бестПоставщикиУслугНП"); 
	ДобавитьТекстЗапросаДанныеТочекУчетаНеОбъектУК(Схема, "энргВладельцыТочекУчета"); 
	ДобавитьТекстЗапросаДанныеТочекУчетаНеОбъектУК(Схема, "бестРасположениеТочекУчетаОтносительноГБП");  
	ДобавитьТекстЗапросаДанныеТочекУчетаНеОбъектУК(Схема, "бестСтруктураСетиТочекУчетаНП");
	ДобавитьТекстЗапросаДанныеТочекУчетаНеОбъектУК(Схема, "бестТехническаяВозможностьУстановкиПУ");
	ДобавитьТекстЗапросаДанныеТочекУчетаНеОбъектУК(Схема, "бестУчастиеТочекУчетаОбъектовВРаспределенииРесурсовВМКД"); 
	ДобавитьТекстЗапросабестСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема, "бестСвойствоРасчетТолькоПоПоказаниямТочекУчета");
	ДобавитьТекстЗапросабестТипыТарифовТочекУчета(Схема, "бестТипыТарифовТочекУчета");  
	ДобавитьТекстЗапросабестЗначенияСкидкиТочекУчета(Схема, "бестЗначенияСкидкиТочекУчета");
	ДобавитьТекстЗапросабестТарифныеСеткиТочекУчета(Схема, "бестТарифныеСеткиТочекУчета");
	ДобавитьТекстЗапросабестЦеновыеКатегорииТочекУчета(Схема, "бестЦеновыеКатегорииТочекУчета");
	ДобавитьТекстЗапросабестПодключениеНеОтОбщейСборки(Схема, "бестПодключениеНеОтОбщейСборки"); 
	ДобавитьТекстЗапросабестОбъемыПостоянногоРасхода(Схема, "бестОбъемыПостоянногоРасхода");  
	ДобавитьТекстЗапросабестТУРассчитываемыеПоПостоянномуРасходу(Схема, "бестТУРассчитываемыеПоПостоянномуРасходу");
	
	ДобавитьТекстЗапросаПереопределяемая(Схема);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	//Если ЕстьЗначенияЗАполнения тогда
	//	ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	//КонецЕсли;
	
	Если Параметры.свойство("Основание") Тогда
		СтандартнаяОбработка 	= Ложь;
		ВыбраннаяФорма = "ФормаДокументаРегистрацияОбъекта";
		Возврат;
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ключ, "ВидОперации");//Параметры.ключ.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестЗаключениеДоговоровСЮридическимиЛицами",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестЗаключениеДоговоровСЮридическимиЛицами",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестЗаключениеДоговоровСЮридическимиЛицами",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;			
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестЗаключениеДоговоровСЮридическимиЛицами");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление 			= "" + Данные.ВидОперации + " №" + СтрЗаменить(Данные.Номер, " ", "") + " от " +  Данные.Дата;
	СтандартнаяОбработка 	= Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатныеФормы

Функция СформироватьПроектПисьмаОбОтсутствующихДокументах(ИмяМакета, ПараметрыПечати)
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Документ.бестЗаключениеДоговоровСЮридическимиЛицами." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	
	ОбластьПисьмо  = Макет.ПолучитьОбласть("Письмо");
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"";
	
	//Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	//
	//РезультатЗапроса = Запрос.ВыполнитьПакет();
	//
	//ВыборкаШапка 			= РезультатЗапроса[2].Выбрать();
	//ВыборкаОбъектРасчета 	= РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//ВыборкаИтогПоЕдИзм 		= РезультатЗапроса[4].Выбрать();
	//
	//Если ВыборкаШапка.Следующий() Тогда
	//	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
	//	ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
	//	ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
	//	ТабДок.Вывести(ОбластьШапка);
	//	
	//	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
	//КонецЕсли;
	//
	//
	//Пока ВыборкаОбъектРасчета.Следующий() Цикл
	//	ОбластьОбъектРасчета = Макет.ПолучитьОбласть("ОбъектРасчета");
	//	ОбластьОбъектРасчета.Параметры.ОбъектРасчета = ВыборкаОбъектРасчета.ОбъектРасчета;
	//	ТабДок.Вывести(ОбластьОбъектРасчета);
	//	а = 1;
	//	
	//	ВыборкаДетальныеЗаписи = ВыборкаОбъектРасчета.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
	//		ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры,ВыборкаДетальныеЗаписи);
	//		ОбластьДанныеЗадолженности.Параметры.Номер = а;
	//		
	//		ТабДок.Вывести(ОбластьДанныеЗадолженности);
	//		а = а + 1;
	//	КонецЦикла;
	//	
	//	ОбластьИтогПоОбъектуРасчета = Макет.ПолучитьОбласть("ИтогПоОбъектуРасчета");
	//	ЗаполнитьЗначенияСвойств(ОбластьИтогПоОбъектуРасчета.Параметры,ВыборкаОбъектРасчета);
	//	ТабДок.Вывести(ОбластьИтогПоОбъектуРасчета);
	//	
	//КонецЦикла;
	//
	//СуммаБезНДС = 0;
	//СуммаНДС 	= 0;
	//СуммаСНДС 	= 0;
	//
	//Пока ВыборкаИтогПоЕдИзм.Следующий() Цикл
	//	ОбластьИтогиПоЕдИзм = Макет.ПолучитьОбласть("ИтогиПоЕдИзм");
	//	ЗаполнитьЗначенияСвойств(ОбластьИтогиПоЕдИзм.Параметры,ВыборкаИтогПоЕдИзм);
	//	ТабДок.Вывести(ОбластьИтогиПоЕдИзм);
	//	
	//	СуммаБезНДС = СуммаБезНДС + ВыборкаИтогПоЕдИзм.СуммаБезНДС;
	//	СуммаНДС 	= СуммаНДС + ВыборкаИтогПоЕдИзм.СуммаНДС;
	//	СуммаСНДС 	= СуммаСНДС + ВыборкаИтогПоЕдИзм.СуммаСНДС;
	//КонецЦикла;
	//
	//ОбластьОбщиеИтоги = Макет.ПолучитьОбласть("ОбщиеИтоги");
	//ОбластьОбщиеИтоги.Параметры.СуммаБезНДС = СуммаБезНДС;
	//ОбластьОбщиеИтоги.Параметры.СуммаНДС = СуммаНДС;
	//ОбластьОбщиеИтоги.Параметры.СуммаСНДС = СуммаСНДС;
	//ТабДок.Вывести(ОбластьОбщиеИтоги);
	//
	//
	//
	//Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
	//	Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
	//		ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
	//		ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
	//		Если ЗначениеЗаполнено(эл.Доверенность) Тогда
	//			ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
	//		Иначе
	//			ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
	//		КонецЕсли;	
	//	ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
	//		ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
	//		ОбластьПодвал.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
	//		Если ЗначениеЗаполнено(эл.Доверенность) Тогда
	//			ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
	//		Иначе
	//			ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "";
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	ТабДок.Вывести(ОбластьПисьмо);
	Возврат ТабДок;
КонецФункции

#КонецОбласти 

#Область РеализацияИнтерефейса_Проведение

Процедура ДобавитьТекстЗапросаПереопределяемая(Схема)
	// Процедура для добавления новых движений в расширениях проектов	
КонецПроцедуры

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема)
	ПолучитьШапкуДокумента(Схема);
	ПолучитьТаблицуТочекУчета(Схема);
	ПолучитьТаблицуОбъектовРасчета(Схема);
	ПолучитьТаблицуПУ(Схема);
	ПолучитьТаблицуОбъемов(Схема); 
	ПолучитьТаблицуТранзитныхТУ(Схема); 
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.Дата
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Район КАК Район,
	|	Шапка.Договор КАК Договор,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.УчитыватьПереплату КАК УчитыватьПереплату,
	|	Шапка.РассчитыватьПени КАК РассчитыватьПени,
	|	Шапка.ГруппаПотребителей КАК ГруппаПотребителей,
	|	Шапка.ВариантРасчета КАК ВариантРасчета,
	|	Шапка.ПроцентПени КАК ПроцентПени
	|ПОМЕСТИТЬ РеквизитыДокумента
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)");	
КонецПроцедуры  

Процедура ПолучитьТаблицуТочекУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Ссылка КАК Ссылка,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.IDСтроки КАК IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.IDСтрокиВладельца КАК IDСтрокиВладельца,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.УзелУчета КАК УзелУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Поставщик КАК Поставщик,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.НомерПломбы КАК НомерПломбы,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ДатаВыпуска КАК ДатаВыпуска,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.СтруктураСети КАК СтруктураСети,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ОписаниеТочки КАК ОписаниеТочки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ОписаниеПрибора КАК ОписаниеПрибора,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ГБП КАК ГБП,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТипУзлаУчета КАК ТипУзлаУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ВладелецУзлаУчета КАК ВладелецУзлаУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ОбъектУК КАК ОбъектУК,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.НетТехническойВозможностиУстановкиПУ КАК НетТехническойВозможностиУстановкиПУ,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Участвует КАК Участвует,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ВладелецПрибораУчета КАК ВладелецПрибораУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.IDТочкиУчета КАК IDТочкиУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ДиаметрСечения КАК ДиаметрСечения,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Договор КАК Договор,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Техническая КАК Техническая,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.РассчитыватьРеактивнуюЭнергию КАК РассчитыватьРеактивнуюЭнергию,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.РассчитыватьПотери КАК РассчитыватьПотери,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.tgφ КАК tgφ,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТочкаПоставки КАК ТочкаПоставки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.РасчетПоГрафикуГП КАК РасчетПоГрафикуГП,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ДлинаТрубы КАК ДлинаТрубы,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТипТарифа КАК ТипТарифа,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТарифнаяСетка КАК ТарифнаяСетка,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ЗначениеСкидки КАК ЗначениеСкидки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ПодключениеНеОтОбщейСборки КАК ПодключениеНеОтОбщейСборки
	|ПОМЕСТИТЬ ТаблицаТочекУчета
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Ссылка В(&мДокументы)");	
КонецПроцедуры

Процедура ПолучитьТаблицуОбъектовРасчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка КАК Ссылка,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки КАК IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НаименованиеОбъектаРасчета КАК НаименованиеОбъектаРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Площадь КАК Площадь,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НазначениеНП КАК НазначениеНП,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.МКД КАК МКД,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Участвует КАК Участвует,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОписаниеОбъекта КАК ОписаниеОбъекта,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.КатегорияОбъекта КАК КатегорияОбъекта,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектУК КАК ОбъектУК,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОтклонениеТемпературыПроцент КАК ОтклонениеТемпературыПроцент,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОтклонениеТемпературыГрадус КАК ОтклонениеТемпературыГрадус,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Контролер КАК Контролер,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Собственник КАК Собственник,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтрокиЛицевойСчет КАК IDСтрокиЛицевойСчет,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НеОтключаемый КАК НеОтключаемый,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.КоличествоРабочихДней КАК КоличествоРабочихДней,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.КоличествоРабочихЧасовВДень КАК КоличествоРабочихЧасовВДень,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ПотреблениеВРабДни КАК ПотреблениеВРабДни,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ПотреблениеВРВыхДни КАК ПотреблениеВРВыхДни,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НаличиеГенерирующихУстановок КАК НаличиеГенерирующихУстановок,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НагрузкаЭлектроприемника КАК НагрузкаЭлектроприемника,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.РежимЭлСнабжения КАК РежимЭлСнабжения,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ТочкаУчетаДоТП КАК ТочкаУчетаДоТП,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ЗаявкаНаТехнологическоеПрисоединение КАК ЗаявкаНаТехнологическоеПрисоединение,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ДоговорТехнологическогоПрисоединения КАК ДоговорТехнологическогоПрисоединения
	|ПОМЕСТИТЬ ТаблицаОбъектовРасчета
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка В(&мДокументы)
	|	И бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета <> ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка)");	
КонецПроцедуры

Процедура ПолучитьТаблицуПУ(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена) КАК Состояние,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК АбонентВладелец,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга,
	|	ТаблицаТочекУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ПриборУчета КАК ПриборУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.НомерПломбы КАК НомерПломбы,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	ВЫБОР
	|		КОГДА ТаблицаТочекУчета.КоэффициентПУ = 0
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаТочекУчета.КоэффициентПУ
	|	КОНЕЦ КАК Коэффициент,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ДатаПоверкиСчетчика КАК ДатаПоверки,
	|	ТаблицаТочекУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ТаблицаТочекУчета.IDСтроки КАК IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	|	ТаблицаТочекУчета.ГБП КАК ГБП,
	|	ТаблицаТочекУчета.СтруктураСети КАК СтруктураСети,
	|	ТаблицаТочекУчета.ПриборУчета КАК УзелУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ТипПрибораУчета КАК ТипПрибораУчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	ТаблицаОбъектовРасчета.Ссылка КАК Ссылка,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.IDСтроки КАК IDСтрокиИзмеритель,
	|	ТаблицаОбъектовРасчета.ОбъектУК КАК ОбъектУК
	|ПОМЕСТИТЬ ТаблицаПУ
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Измерители КАК бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители
	|				ПО ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.IDСтрокиТочкиУчета
	|					И (бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.Ссылка = ТаблицаТочекУчета.Ссылка)
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка");	
КонецПроцедуры

Процедура ПолучитьТаблицуОбъемов(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки КАК IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь КАК ОбъемУслуги,
	|	1 КАК Месяц,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год КАК Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаОбъемов
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль,
	|	2,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март,
	|	3,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель,
	|	4,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май,
	|	5,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь,
	|	6,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль,
	|	7,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август,
	|	8,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь,
	|	9,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь,
	|	10,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь,
	|	11,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь,
	|	12,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка В(&мДокументы)");	
КонецПроцедуры

Процедура ПолучитьТаблицуТранзитныхТУ(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.IDСтроки КАК IDСтроки
	|ПОМЕСТИТЬ ИдентификаторыТУСоСхемойПоРазнымРайонам
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Субабоненты КАК бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП КАК бестАктивностьТочекУчетаНП
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыДокумента КАК РеквизитыДокумента
	|			ПО бестАктивностьТочекУчетаНП.Период <= РеквизитыДокумента.Дата
	|				И бестАктивностьТочекУчетаНП.Район <> РеквизитыДокумента.Район
	|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ОбъектРасчета = бестАктивностьТочекУчетаНП.ОбъектРасчета
	|			И бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ТочкаУчета = бестАктивностьТочекУчетаНП.ТочкаУчета
	|ГДЕ
	|	бестАктивностьТочекУчетаНП.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	И бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Ссылка В(&мДокументы)");	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

Процедура ДобавитьТекстЗапросабестНагрузкаПоУслугамНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаУслугиОбъектов.Услуга КАК Услуга,
	|	ТаблицаУслугиОбъектов.Нагрузка КАК Нагрузка,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.УслугиОбъектов КАК ТаблицаУслугиОбъектов
	|		ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаУслугиОбъектов.Ссылка)
	|			И (ТаблицаОбъектовРасчета.IDСтроки = ТаблицаУслугиОбъектов.IDСтроки)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПотребителиГВС(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаПотребителиГВС.Тип КАК Тип,
	|	ТаблицаПотребителиГВС.Количество КАК Количество,
	|	ТаблицаПотребителиГВС.КоличествоРабочихЧасовВДень КАК КоличествоРабочихЧасовВДень,
	|	ТаблицаПотребителиГВС.ТипНормы КАК ТипНорм
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПотребителиГВС КАК ТаблицаПотребителиГВС
	|		ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаПотребителиГВС.Ссылка)
	|			И (ТаблицаОбъектовРасчета.IDСтроки = ТаблицаПотребителиГВС.IDСтроки)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТочкиПоставкиТочекУчетаЮЛ(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаТочекУчета.ТочкаПоставки КАК ТочкаПоставки
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|					И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца)
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестКоэффциентыПриборовУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаПУ.Период КАК Период,
	|	ТаблицаПУ.Организация КАК Организация,
	|	ТаблицаПУ.Район КАК Район,
	|	ТаблицаПУ.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПУ.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПУ.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаПУ.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПУ.Коэффициент КАК Коэффициент
	|ИЗ
	|	ТаблицаПУ КАК ТаблицаПУ";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестДатыПоверкиПрибораУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаПУ.Период КАК Период,
	|	ТаблицаПУ.Организация КАК Организация,
	|	ТаблицаПУ.Район КАК Район,
	|	ТаблицаПУ.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаПУ.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПУ.ДатаПоверки КАК ДатаПоверки
	|ИЗ
	|	ТаблицаПУ КАК ТаблицаПУ";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПоказанияПриборовУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РеквизитыДокумента.Дата, ДЕНЬ) КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) КАК ПричинаОтклонения,
	|	ЛОЖЬ КАК КС,
	|	ЛОЖЬ КАК Переворот,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ШкалыПриборовУчета.Шкала КАК Шкала
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ШкалыПриборовУчета КАК ШкалыПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыДокумента КАК РеквизитыДокумента
	|					ПО (РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка)
	|				ПО ТаблицаТочекУчета.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|					И ТаблицаТочекУчета.IDСтрокиВладельца = ТаблицаОбъектовРасчета.IDСтроки
	|					И (НЕ ТаблицаОбъектовРасчета.ОбъектУК)
	|			ПО (ТаблицаТочекУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка)
	|				И (ТаблицаТочекУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтрокиТочкиУчета)
	|		ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестГарантированныеОбъемы(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъемов.Услуга КАК Услуга,
	|	ТаблицаОбъемов.ОбъемУслуги КАК ОбъемУслуги,
	|	ТаблицаОбъемов.Месяц КАК Месяц,
	|	ТаблицаОбъемов.Год КАК Год
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъемов КАК ТаблицаОбъемов
	|			ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаОбъемов.Ссылка
	|					И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаОбъемов.IDСтроки)
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестСпособНачисленияНормативаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга,
	|	ТаблицаТочекУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ЭтоСоставнаяУслуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.Организация,
	|	РеквизитыДокумента.Район,
	|	РеквизитыДокумента.Договор,
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.ЧастьСоставнойУслуги,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.СпособРасчетаНорматива,
	|	ТаблицаТочекУчета.ТочкаУчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.СпособыРасчетаНормативаСоставныхУслуг КАК бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг
	|				ПО (ТаблицаТочекУчета.ЭтоСоставнаяУслуга
	|						И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.IDСтроки
	|						И бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.Ссылка = ТаблицаТочекУчета.Ссылка)
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестАктивностьТочекУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА ТаблицаОбъектовРасчета.ТочкаУчетаДоТП
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	КОНЕЦ КАК Состояние,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|					И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца)
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестУслугиТочекУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|					И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца)
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТУРассчитываемыеПоГрафикуГП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаТочекУчета.РасчетПоГрафикуГП КАК РасчетПоГрафикуГП
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|					И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца)
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестСостояниеДоговоров(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	ИСТИНА КАК Состояние
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестЗначенияПлощадейНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.Площадь КАК Площадь,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП) КАК ВидПлощади
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестУчастиеОбъектовВРаспределенииРесурсовВМКД(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.Участвует КАК Участвует
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестВыставлениеПереплатыВАвансовыхСчетах(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.УчитыватьПереплату КАК УчитыватьПереплату
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО (РеквизитыДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|				И энргДоговорыКонтрагентов.ОснованиеДопСоглашения = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.пустаяссылка))";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестДоговорныеНастройкиРасчетаПени(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.РассчитыватьПени КАК РассчитыватьПени,
	|	РеквизитыДокумента.ГруппаПотребителей КАК ГруппаПотребителей,
	|	РеквизитыДокумента.ВариантРасчета КАК ВариантРасчета,
	|	РеквизитыДокумента.ПроцентПени КАК ПроцентПени
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО (РеквизитыДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|				И энргДоговорыКонтрагентов.ОснованиеДопСоглашения = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.пустаяссылка))";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргФормулыРасчетаУслугМКД(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиФормулыРасчетаУслуг.ФормулаРасчета КАК ФормулаРасчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ФормулыРасчетаУслуг КАК бестЗаключениеДоговоровСЮридическимиЛицамиФормулыРасчетаУслуг
	|			ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиФормулыРасчетаУслуг.Ссылка
	|				И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиФормулыРасчетаУслуг.IDСтрокиТочкиУчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестВидыДифференцированностиПриборовУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.Шкала КАК Шкала,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ШкалыПриборовУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета
	|				ПО (ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.IDСтрокиТочкиУчета
	|						И бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|						И НЕ ТаблицаТочекУчета.ОбъектУК)
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТемпературныеГрафикиДоговоровСЮридическимиЛицами(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов.ТемпературныйГрафик КАК ТемпературныйГрафик
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТемпературныеГрафикиОбъектов КАК бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов
	|			ПО ТаблицаОбъектовРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестМаксимальныеНагрузкиПоДоговору(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Нагрузка) КАК Нагрузка,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Услуга КАК Услуга
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.МаксимальныеНагрузки КАК бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки
	|			ПО ТаблицаОбъектовРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.Организация,
	|	РеквизитыДокумента.Район,
	|	РеквизитыДокумента.Договор,
	|	РеквизитыДокумента.ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Услуга,
	|	РеквизитыДокумента.Дата";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТарифныеКатегорииНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТарифныеКатегорииУслуги.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	ТарифныеКатегорииУслуги.Услуга КАК Услуга,
	|	бестОбъектыРасчета.МКД КАК МКД
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТарифныеКатегорииУслуги КАК ТарифныеКатегорииУслуги
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТарифныеКатегорииУслуги.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТарифныеКатегорииУслуги.IDСтроки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|			ПО ТаблицаОбъектовРасчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.Организация,
	|	РеквизитыДокумента.Район,
	|	РеквизитыДокумента.Договор,
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета,
	|	МАКСИМУМ(ТаблицаТочекУчета.ТарифнаяКатегория),
	|	ТаблицаТочекУчета.Услуга,
	|	бестОбъектыРасчета.МКД
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|			ПО ТаблицаОбъектовРасчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И (ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|					И ТаблицаТочекУчета.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население))
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.Организация,
	|	РеквизитыДокумента.Район,
	|	РеквизитыДокумента.Договор,
	|	РеквизитыДокумента.ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета,
	|	бестОбъектыРасчета.МКД,
	|	ТаблицаТочекУчета.Услуга,
	|	РеквизитыДокумента.Дата";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестСостояниеПриборовУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ОбъектУК
	|	И ТаблицаТочекУчета.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПриборыТочекУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ОбъектУК
	|	И ТаблицаТочекУчета.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПараметрыИзмерителей(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	ТаблицаТочекУчета.ПриборУчета КАК Измеритель,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.Шкала КАК Шкала,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.ВидПараметра КАК ВидПараметра,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.ТипТемпературы КАК ТипТемпературы
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ШкалыПриборовУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета
	|			ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.Ссылка
	|				И (ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.IDСтрокиТочкиУчета
	|					И бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.ВидПараметра <> ЗНАЧЕНИЕ(Справочник.бестВидыПараметровИзмерителей.ПустаяСсылка))
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ОбъектУК";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестСобственникиОбъектовРасчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.Собственник КАК Собственник
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестДоговорыТочекУчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА ВложенныйЗапрос.Договор
	|		ИНАЧЕ ЕСТЬNULL(бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.Договор, Значение(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка))
	|	КОНЕЦ КАК Договор
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеквизитыДокумента.Дата КАК Период,
	|		РеквизитыДокумента.Организация КАК Организация,
	|		РеквизитыДокумента.Район КАК Район,
	|		ВЫБОР
	|			КОГДА энргДоговорыКонтрагентов.ОснованиеДопСоглашения = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.пустаяссылка)
	|				ТОГДА ТаблицаТочекУчета.Договор
	|			ИНАЧЕ энргДоговорыКонтрагентов.ОснованиеДопСоглашения
	|		КОНЕЦ КАК Договор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|		ВЫБОР
	|			КОГДА ТаблицаТочекУчета.Услуга.СоставнаяУслуга
	|				ТОГДА ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, Значение(Справочник.энргВидыУслуг.ПустаяСсылка))
	|			ИНАЧЕ ТаблицаТочекУчета.Услуга
	|		КОНЕЦ КАК Услуга,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтроки,
	|		РеквизитыДокумента.Ссылка КАК Ссылка
	|	ИЗ
	|		РеквизитыДокумента КАК РеквизитыДокумента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|				ПО ТаблицаТочекУчета.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|					И (ТаблицаТочекУчета.Услуга.СоставнаяУслуга)
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|				ПО ТаблицаТочекУчета.Договор = энргДоговорыКонтрагентов.Ссылка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|				ПО (ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка)
	|					И (ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца)
	|			ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ДоговорыСоставныхУслуг КАК бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг
	|		ПО ВложенныйЗапрос.Услуга = бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.ЧастьСоставнойУслуги
	|			И ВложенныйЗапрос.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.IDСтроки
	|			И ВложенныйЗапрос.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПрочиеДополнительныеНачисления(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.ТипДополнительногоНачисления КАК ТипДополнительногоНачисления,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.ТарифнаяКатегория КАК ТарифнаяКатегория,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.Сезонность КАК Сезонность,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.Процент КАК Процент
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ДополнительныеНачисленияТУ КАК бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ДополнительныеНачисленияЗначения КАК бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения
	|					ПО бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.Ссылка
	|						И бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.IDСтроки
	|				ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Ссылка
	|					И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.IDСтрокиТУ
	|					И ТаблицаТочекУчета.IDСтрокиВладельца = бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.IDСтрокиВладельца
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТочкиПоставкиОбъектовРасчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиПоставки КАК бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки
	|			ПО ТаблицаОбъектовРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестФормулыРасчетаТочекУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ГоловнаяТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Услуга КАК УслугаСубабонента,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ОбъектРасчета КАК ОбъектРасчетаСубабонента,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ТочкаУчета КАК ТочкаУчетаСубабонента,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Абонент КАК АбонентСубабонента,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Коэффициент КАК Коэффициент,
	|	НЕ ИдентификаторыТУСоСхемойПоРазнымРайонам.IDСтроки ЕСТЬ NULL КАК ТранзитИзРазныхРО,
	|	ИСТИНА КАК Актуальность
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыТУСоСхемойПоРазнымРайонам КАК ИдентификаторыТУСоСхемойПоРазнымРайонам
	|				ПО ТаблицаТочекУчета.IDСтроки = ИдентификаторыТУСоСхемойПоРазнымРайонам.IDСтроки
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Субабоненты КАК бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты
	|				ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Ссылка
	|					И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.IDСтроки
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестРежимыПотребления(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.КоличествоРабочихДней КАК КоличествоРабочихДней,
	|	ТаблицаОбъектовРасчета.КоличествоРабочихЧасовВДень КАК КоличествоРабочихЧасовВДень,
	|	ТаблицаОбъектовРасчета.ПотреблениеВРабДни КАК ПотреблениеВРабДни,
	|	ТаблицаОбъектовРасчета.ПотреблениеВРВыхДни КАК ПотреблениеВРВыхДни,
	|	ТаблицаОбъектовРасчета.НаличиеГенерирующихУстановок КАК НаличиеГенерирующихУстановок,
	|	ТаблицаОбъектовРасчета.НагрузкаЭлектроприемника КАК НагрузкаЭлектроприемника,
	|	ТаблицаОбъектовРасчета.РежимЭлСнабжения КАК РежимЭлСнабжения
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПриборыУзловУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
		|	ТаблицаПУ.Период КАК Период,
		|	ТаблицаПУ.Организация КАК Организация,
		|	ТаблицаПУ.Район КАК Район,
		|	ТаблицаПУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ТаблицаПУ.МКД КАК МКД,
		|	ТаблицаПУ.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаПУ.УзелУчета КАК УзелУчета,
		|	ТаблицаПУ.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПУ.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние
		|ИЗ
		|	ТаблицаПУ КАК ТаблицаПУ
		|ГДЕ
		|	ТаблицаПУ.УзелУчета <> ТаблицаПУ.ПриборУчета
		|	И НЕ ТаблицаПУ.ОбъектУК";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестДопускПриборовУчетаККоммерческомуУчету(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	ТаблицаТочекУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	ТаблицаТочекУчета.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И НЕ ТаблицаТочекУчета.ОбъектУК";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестНомерПломбПриборовУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.НомерПломбы КАК НомерПломбы,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.КлючСтроки КАК МестоУстановки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.ДатаУстановкиПломбы КАК ДатаОперацииСПломбой,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.ЛицоУстановившееПломбу КАК ОтветственноеЛицо,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.ВидПломбы КАК ВидПломбы,
		|	ИСТИНА КАК Состояние,
		|	ТаблицаПУ.Организация КАК Организация,
		|	ТаблицаПУ.Район КАК Район,
		|	ТаблицаПУ.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПУ.Период КАК Период
		|ИЗ
		|	ТаблицаПУ КАК ТаблицаПУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.НомераПломб КАК бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб
		|		ПО ТаблицаПУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.Ссылка
		|			И ТаблицаПУ.IDСтрокиИзмеритель = бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.IDСтрокиИзмерителя";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПотериТочекУчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ВидПотерь КАК ВидПотерь,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ПроцентПотерь КАК ПроцентПотерь
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Потери КАК бестЗаключениеДоговоровСЮридическимиЛицамиПотери
	|				ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиПотери.Ссылка
	|					И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиПотери.IDСтроки
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестСезонныеНагрузкиПоУслугам(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Нагрузка КАК Нагрузка,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Сезонность КАК Сезонность
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.СезонныеНагрузки КАК бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки
	|			ПО ТаблицаОбъектовРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Формировать КАК Формировать
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов КАК бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов
	|		ПО РеквизитыДокумента.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.ТипОплаты КАК ТипОплаты,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.ДеньФормирования КАК ДеньФормирования,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.Процент КАК Процент,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.БазаРасчетаОбъема КАК БазаРасчетаОбъема,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.БазаРасчетаСуммы КАК БазаРасчетаСуммы,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.СрокОплаты КАК СрокОплаты
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.НастройкиОплаты КАК бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты
	|		ПО РеквизитыДокумента.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестГрафикиРежимаОграничения(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Месяц КАК Месяц,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.КодРежима КАК КодРежима,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Значение КАК Значение,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Услуга КАК Услуга
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГрафикиРежимаОграничения КАК бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения
	|			ПО ТаблицаОбъектовРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестВеличиныБрони(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.Сезонность КАК Сезонность,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.ТипБрони КАК ТипБрони,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.ЗначениеБрони КАК ЗначениеБрони
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ВеличинаБрони КАК бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони
	|			ПО ТаблицаОбъектовРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПоставщикиУслугНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга,
	|	ЕСТЬNULL(бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.Поставщик, ТаблицаТочекУчета.Поставщик) КАК Поставщик,
	|	ЕСТЬNULL(бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ТаблицаТочекУчета.Услуга) КАК ЧастьСоставной
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПоставщикиСоставныхУслуг КАК бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг
	|			ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.Ссылка
	|				И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДанныеТочекУчетаНеОбъектУК(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Договор КАК Договор,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА ТаблицаОбъектовРасчета.ТочкаУчетаДоТП
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	КОНЕЦ КАК Состояние,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК АбонентВладелец,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга,
	|	ТаблицаТочекУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочекУчета.НомерПломбы КАК НомерПломбы,
	|	ТаблицаТочекУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	ВЫБОР
	|		КОГДА ТаблицаТочекУчета.КоэффициентПУ = 0
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаТочекУчета.КоэффициентПУ
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаТочекУчета.ДатаПоверкиСчетчика КАК ДатаПоверки,
	|	ТаблицаТочекУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ТаблицаТочекУчета.IDСтроки КАК IDСтроки,
	|	ТаблицаТочекУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ТаблицаТочекУчета.Участвует КАК Участвует,
	|	ТаблицаТочекУчета.ГБП КАК ГБП,
	|	ТаблицаТочекУчета.СтруктураСети КАК СтруктураСети,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаТочекУчета.Ссылка КАК Ссылка,
	|	ТаблицаТочекУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ТаблицаТочекУчета.ТочкаПоставки КАК ТочкаПоставки,
	|	ТаблицаТочекУчета.Поставщик КАК Поставщик
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ПО ТаблицаТочекУчета.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|				И ТаблицаТочекУчета.IDСтрокиВладельца = ТаблицаОбъектовРасчета.IDСтроки
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ОбъектУК";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТарифныеСеткиТочекУчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.ТарифнаяСетка КАК ТарифнаяСетка
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	ТаблицаТочекУчета.ТарифнаяСетка <> ЗНАЧЕНИЕ(Справочник.бестТарифныеСетки.ПустаяСсылка)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры 

Процедура ДобавитьТекстЗапросабестТипыТарифовТочекУчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	МАКСИМУМ(ТаблицаТочекУчета.ТипТарифа) КАК ТипТарифа
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	ТаблицаТочекУчета.ТипТарифа <> ЗНАЧЕНИЕ(Перечисление.бестТипыТарифаНезависимыйСбыт.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеквизитыДокумента.Организация,
	|	РеквизитыДокумента.Район,
	|	РеквизитыДокумента.ПериодНачисления,
	|	ТаблицаОбъектовРасчета.МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета,
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.Дата";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестЗначенияСкидкиТочекУчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.ЗначениеСкидки КАК ЗначениеСкидки
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	ТаблицаТочекУчета.ЗначениеСкидки <> 0";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры 

Процедура ДобавитьТекстЗапросабестЦеновыеКатегорииТочекУчета(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочекУчета.ЦеноваяКатегория КАК ЦеноваяКатегория
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка
	|ГДЕ
	|	ТаблицаТочекУчета.ЦеноваяКатегория <> ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПустаяСсылка)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестПодключениеНеОтОбщейСборки(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаТочекУчета.ПодключениеНеОтОбщейСборки КАК ПодключениеНеОтОбщейСборки
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестОбъемыПостоянногоРасхода(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходОбъемы.Месяц КАК Месяц,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходОбъемы.Объем КАК Объем
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПостоянныйРасходТУ КАК бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПостоянныйРасходОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходОбъемы
	|					ПО бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходОбъемы.Ссылка
	|						И бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходОбъемы.IDСтроки
	|				ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.Ссылка
	|					И ТаблицаТочекУчета.IDСтрокиВладельца = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.IDСтрокиОбъектРасчета
	|					И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.IDСтрокиТочкиУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТУРассчитываемыеПоПостоянномуРасходу(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаОбъектовРасчета.МКД КАК МКД,
	|	ТаблицаОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.Услуга КАК Услуга,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ИСТИНА КАК ПрименятьПостоянныйРасход
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовРасчета КАК ТаблицаОбъектовРасчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПостоянныйРасходТУ КАК бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ
	|				ПО ТаблицаТочекУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.Ссылка
	|					И ТаблицаТочекУчета.IDСтрокиВладельца = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.IDСтрокиОбъектРасчета
	|					И ТаблицаТочекУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиПостоянныйРасходТУ.IDСтрокиТочкиУчета
	|			ПО ТаблицаОбъектовРасчета.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И ТаблицаОбъектовРасчета.IDСтроки = ТаблицаТочекУчета.IDСтрокиВладельца
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаОбъектовРасчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти 

#КонецЕсли