#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Вызывается при переходе на версию конфигурации 2.1.3.16.
//
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииПомещения() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации("Адрес");
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресПомещения;  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	ПараметрыВида.ОбязательноеЗаполнение = Истина;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);	
	
КонецПроцедуры

Функция СформироватьНаименование(СтрокаJSON) Экспорт 
	
	яНаименование 					= "";	
	Чтение 							= Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ДанныеАдреса  					= ПрочитатьJSON(Чтение);
		
	// квартира, комната и т.д.
	
	Если ДанныеАдреса.Свойство("apartments") Тогда
		Для Каждого Строка Из ДанныеАдреса.apartments Цикл
			Если ЗначениеЗаполнено(Строка.number) Тогда
				яНаименование	= яНаименование + Строка.type + " " + Строка.number + ", ";
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Лев(яНаименование,СтрДлина(яНаименование) - 2);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

Процедура ПомещенияПоПредставлениюАдресов(Схема, ТаблицаДляПомещения = "") Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргПомещения.Строение КАК Строение,
	|	энргПомещения.Ссылка КАК Помещение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		энргПомещенияКонтактнаяИнформация.Ссылка КАК Помещение
	|	ИЗ
	|		Адреса КАК Адреса
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	|			ПО (энргПомещенияКонтактнаяИнформация.Представление ПОДОБНО Адреса.Представление + ""%"")) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ВложенныйЗапрос.Помещение = энргПомещения.Ссылка";
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе	
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры
 
Процедура ПомещенияПоРодителю(Схема, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПомещенияПоРодителю());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
		
КонецПроцедуры 

#Область ТекстыЗапросов

Функция ТекстЗапросаПомещенияПоРодителю()
	
	Текст = "ВЫБРАТЬ
	|	энргПомещения.Ссылка КАК Помещение,
	|	энргПомещения.Строение КАК Строение
	|ИЗ
	|	Справочник.энргПомещения КАК энргПомещения
	|ГДЕ
	|	энргПомещения.Ссылка В ИЕРАРХИИ(&Родитель)";
	//|	энргПомещения.Родитель В ИЕРАРХИИ(&Родитель)";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
