#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем Период,Район,Организация,АбонентВладелец,ОбъектРасчета,ТочкиСПриборами;
	Если Параметры.Свойство("Период") Тогда
		Период 				= Параметры.Период;
	Иначе 
		Период					= ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Район") Тогда
		Район 				= Параметры.Район;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация 		= Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("АбонентВладелец") Тогда
		АбонентВладелец 		= Параметры.АбонентВладелец;
	ИначеЕсли Параметры.Свойство("Строение") И Параметры.Свойство("Помещение") И Параметры.Свойство("ЧастныйСектор") Тогда
		АбонентВладелец 	= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(Параметры.Строение,Параметры.Помещение).КлючПомещения;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектРасчета") Тогда
		ОбъектРасчета 		= Параметры.ОбъектРасчета;
	КонецЕсли;
		
	Если АбонентВладелец = Неопределено ИЛИ НЕ ЗначениеЗаполнено(АбонентВладелец) тогда
		Возврат; 		
	КонецЕсли;
	
	Если Параметры.Свойство("ТочкиСПриборами") Тогда
		ТочкиСПриборами 		= Параметры.ТочкиСПриборами;
	КонецЕсли;
	
	ПараметрыОтбора 			= Новый Структура();
	
	Если Параметры.Свойство("ВыбратьТУСрезНаДату") Тогда
		ПараметрыОтбора.Вставить("ВыбратьТУСрезНаДату", Параметры.ВыбратьТУСрезНаДату);
	КонецЕсли;
	
	СтандартнаяОбработка 	= Ложь;
		
	Если ТипЗнч(АбонентВладелец) = Тип("СправочникСсылка.энргКлючиПомещений") Тогда		
		Результат  			= энргРаботаСТочкамиУчетаСервер.ДействующиеТочкиУчета(Период, Организация, Район,АбонентВладелец, ОбъектРасчета, ТочкиСПриборами, Параметры.СтрокаПоиска, ПараметрыОтбора);
	ИначеЕсли ТипЗнч(АбонентВладелец) = Тип("СправочникСсылка.энргСтроения") Тогда
		Результат  			= энргРаботаСТочкамиУчетаСервер.ДействующиеТочкиУчетаМКД(Период, Организация, Район,АбонентВладелец, ТочкиСПриборами, Параметры.СтрокаПоиска);
	Иначе
		ВызватьИсключение "Владелец точки учета не определен";
	КонецЕсли;
	Выборка  				= Результат.выбрать();
	
	ДанныеВыбора  			= Новый СписокЗначений;
	
	Пока Выборка.следующий() цикл
		ДанныеВыбора.Добавить(Выборка.ТочкаУчета);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограмныйИнтерфейс

Функция ЗначенияРеквизитовОбъектов(мТочкиУчета,ПолучаемыеСвойства) Экспорт 
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(мТочкиУчета,ПолучаемыеСвойства);
			
	Возврат Результат;
	
КонецФункции

Функция УдалосьЗаполнитьОбъектПоОписанию(ТочкаУчетаСсылка, ОписаниеОбъекта, ЭтоНоваяСсылка) Экспорт 
		
	ЕстьИзменения 							= Ложь;
	Если ЭтоНоваяСсылка Тогда
		ЭлементОбъект 						= СоздатьЭлемент();		
		ЭлементОбъект.УстановитьСсылкуНового(ТочкаУчетаСсылка);
		ЕстьИзменения 						= Истина;
	Иначе
		ЭлементОбъект 						= ТочкаУчетаСсылка.ПолучитьОбъект();
	КонецЕсли;	
	
	Если НЕ ЭлементОбъект.Наименование = ОписаниеОбъекта.Наименование Тогда 
		ЭлементОбъект.Наименование 			= ОписаниеОбъекта.Наименование;
		ЕстьИзменения						= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.Расположение = ОписаниеОбъекта.Расположение Тогда 
		ЭлементОбъект.Расположение 			= ОписаниеОбъекта.Расположение;
		ЕстьИзменения						= Истина;
	КонецЕсли;
	
	Если НЕ ЭлементОбъект.Головная = ОписаниеОбъекта.Головная Тогда 
		ЭлементОбъект.Головная 				= ОписаниеОбъекта.Головная;
		ЕстьИзменения						= Истина;
	КонецЕсли;
	
	Если НЕ ЕстьИзменения Тогда
		Возврат Истина;
	КонецЕсли;
		
	Попытка
		ЭлементОбъект.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВывестиТочкиПоставки(Форма, ТЧТочкиПоставки, ТаблицаЗначенийТочкиПоставки, ПолеДляВыгрузки) Экспорт
	
	КоллекцияТочекПоставки		 	= Форма.Объект[ТЧТочкиПоставки];
	Запрос 							= Новый Запрос; 	
	Запрос.Текст 					= 
	"ВЫБРАТЬ
	|	ДанныеТабЧасти." + ПолеДляВыгрузки + " КАК ТочкаПоставки
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргТочкиУчета.Ссылка КАК ТочкаПоставки,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргПараметрыТочекПоставкиСрезПоследних.СтруктураСети КАК СтруктураСети,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
	|	энргПараметрыТочекПоставкиСрезПоследних.ДоговорТП КАК ДоговорТП,
	|	энргПараметрыТочекПоставкиСрезПоследних.АктТП КАК АктТП
	|ИЗ
	|	ДанныеТабЧасти КАК ДанныеТабЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних КАК энргПараметрыТочекПоставкиСрезПоследних
	|			ПО (энргТочкиУчета.Ссылка = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки)
	|		ПО (ДанныеТабЧасти.ТочкаПоставки = энргТочкиУчета.Ссылка)";
	
	
	Запрос.УстановитьПараметр("ДанныеТабЧасти", КоллекцияТочекПоставки.Выгрузить(,ПолеДляВыгрузки));	
	
	Результат  				= Запрос.Выполнить();
	Выборка 				= Результат.Выбрать();
	
	КоллекцияТЗТочкиПоставки = Форма[ТаблицаЗначенийТочкиПоставки];
	КоллекцияТЗТочкиПоставки.Очистить();
	Пока Выборка.Следующий() Цикл
		СтрокаДляЗаполнения = КоллекцияТЗТочкиПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли