#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Период = Запись.Период;
	//РеквизитФормыВЗначение("Запись");
	ПолучитьЗначениеНастройки();
	
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	СписокЭлементов = Новый Структура("Период, ТаблицаРасчётаГоспошлины");
	ОбъектМетаданных = Метаданные.РегистрыСведений.энргНастройкаРасчетаГоспошлины;
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтотОбъект, СписокЭлементов, ОбъектМетаданных, "Редактирование");
	// -- Акимов Д.В.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаПриЗакрытии", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область КомандыФормы
&НаКлиенте
Процедура ЗаписатьИЗакрытьРС(Команда)
	ЗаписатьРС(Команда);
	Если Не Модифицированность Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРС(Команда)
	
	ПредДо = Неопределено;
	Сч = 0;
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле ""Период"" не заполнено";
		Сообщение.Поле = "Период";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		
		Отказ = Истина;
	
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из ТаблицаРасчётаГоспошлины Цикл
		ТекстСообщения	= "";
		ПолеСообщения	= "";
		Если СтрокаТЗ.До = ПредДо Тогда
			ТекстСообщения = "Уже есть запись с таким ""До"".";
			ПолеСообщения = "До";
		ИначеЕсли ЗначениеЗаполнено(СтрокаТЗ.МинимальнаяСумма) И ЗначениеЗаполнено(СтрокаТЗ.МаксимальнаяСумма) И 
					СтрокаТЗ.МаксимальнаяСумма < СтрокаТЗ.МинимальнаяСумма Тогда 
			ТекстСообщения = "Минимальная сумма не может быть больше максимальной.";
			ПолеСообщения  = "МинимальнаяСумма";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ТаблицаРасчётаГоспошлины[" + Сч + "]." + ПолеСообщения;
			Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			ВыдатьСообщение = Истина;
		КонецЕсли;
		
		ПредДо	= СтрокаТЗ.До;
		Сч		= Сч + 1;
	КонецЦикла;

	Если Не Отказ Тогда
		ЗаписатьНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ТаблицаРасчётаГоспошлиныПриИзменении(Элемент)
	ОбновитьТаблицуРасчёта();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасчётаГоспошлиныПослеУдаления(Элемент)
	ОбновитьТаблицуРасчёта();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасчётаГоспошлиныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Модифицированность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ВспомогательныеФункции
&НаКлиенте
Процедура ОбновитьТаблицуРасчёта()
	
	Перем ПослДо, СтрокаТЗ, МаксЗнач;
	
	// Заполнение колонки "до"
	МаксЗнач = 9999999999.99;
	Для каждого СтрокаТЗ Из ТаблицаРасчётаГоспошлины Цикл
		Если СтрокаТЗ.До = 0 Тогда
			СтрокаТЗ.До = МаксЗнач;
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаРасчётаГоспошлины.Сортировать("До Возр");
	
	// Заполнение колонки "от"
	ПослДо = 0;
	Для каждого СтрокаТЗ Из ТаблицаРасчётаГоспошлины Цикл
		СтрокаТЗ.От = ПослДо;  
		Если СтрокаТЗ.До < МаксЗнач Тогда
			ПослДо = СтрокаТЗ.До;
		Иначе 
			СтрокаТЗ.До = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначениеНастройки()
	Перем ТЗ_Настройки;
	
	ЗаписьРС = РеквизитФормыВЗначение("Запись");
	
	Период		 = ЗаписьРС.Период;
	ТЗ_Настройки = ЗаписьРС.НастройкаРасчета.Получить();
	
	Если ТЗ_Настройки <> Неопределено Тогда
		ЗначениеВРеквизитФормы(ТЗ_Настройки, "ТаблицаРасчётаГоспошлины");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	Перем ТЗ_Настройки;
	
	ЗаписьРС = РеквизитФормыВЗначение("Запись");
	ТЗ_Настройки = РеквизитФормыВЗначение("ТаблицаРасчётаГоспошлины");
	Хранилище = Новый ХранилищеЗначения(ТЗ_Настройки);
	
	ЗаписьРС.Период = Период;
	ЗаписьРС.НастройкаРасчета = Хранилище;
	ЗаписьРС.Записать(Ложь);
	
	Модифицированность = Ложь; 
	
	ПолучитьЗначениеНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПриЗакрытии(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ЗаписатьИЗакрытьРС(Неопределено);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Модифицированность = Истина;
	Период = НачалоМесяца(Период);
КонецПроцедуры
#КонецОбласти





