#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "КонтактнаяИнформация");
	КонецЕсли;
	
	Нагрузка.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	УчастиеВМКД.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	ПотребителиГВС.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	Площади.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	ПоказателиТемпературы.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);

	
	ЗаполнитьТЗГарантированныеОбъемыНаСервере();
	
	УправлениеВидимостью();
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	Нагрузка.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	УчастиеВМКД.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	ПотребителиГВС.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	Площади.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	ПоказателиТемпературы.Параметры.УстановитьЗначениеПараметра("ОбъектРасчета", Объект.Ссылка);
	ПриЧтенииНаСервереПереопределяемый(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьДанныеОбъектаРасчета", Объект.Ссылка);
	ПослеЗаписиПереопределяемый(ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаУстановитьНагрузку(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыУстановитьПериодическиеПараметры", ЭтаФорма);

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияЗаполнения = Новый Структура("ОбъектРасчета, Район, Организация", Объект.Ссылка, энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МКД,"Район"), объект.Организация);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.бестУстановитьНагрузкуПоУслугам.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,,,,ОповещениеОЗакрытии);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьУчастиеВРаспределенииВМКД(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияЗаполнения = Новый Структура("ОбъектРасчета, Район", Объект.Ссылка, энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МКД,"Район"));
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		Форма = ПолучитьФорму("Документ.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
		
		Форма.Элементы.ОбъектРасчета.Доступность = Ложь;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПлощадь(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыУстановитьПериодическиеПараметры", ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияЗаполнения = Новый Структура("ОбъектРасчета, Район, Организация", Объект.Ссылка,  энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МКД,"Район"),  Объект.Организация);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.бестУстановитьЗначениеПлощадиНП.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,,,,ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьПотребителя(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗначенияЗаполнения = Новый Структура("ОбъектРасчета, Район", Объект.Ссылка,  энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МКД,"Район"));
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		Форма = ПолучитьФорму("Документ.бестУстановитьПотребителейГВС.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
		
		Форма.Элементы.ОбъектРасчета.Доступность = Ложь;
		Форма.Открыть();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьОбъемы(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыУстановитьГарантОбъемы", ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияЗаполнения = Новый Структура("ОбъектРасчета, Организация, Район", Объект.Ссылка,  Объект.Организация, энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МКД,"Район"));
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.бестУстановитьГарантированныеОбъемыНП.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,,,,ОповещениеОЗакрытии);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьТемпературу(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыУстановитьПериодическиеПараметры", ЭтаФорма);

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияЗаполнения = Новый Структура("ОбъектРасчета, Район, Организация", Объект.Ссылка, энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МКД,"Район"),  Объект.Организация);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.бестУстановитьПоказателиТемпературыВнутриПомещения.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,,,,ОповещениеОЗакрытии);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаКлиенте
Процедура ЗакрытиеФормыУстановитьПериодическиеПараметры(Результат,ДополнительныеПараметры) Экспорт 
   Элементы.Площади.Обновить();
   Элементы.Нагрузка.Обновить();
   Элементы.ПоказателиТемпературы.Обновить();
КонецПроцедуры

&НаСервере
Процедура МКДПриИзмененииНаСервере()
	
	ОбъектТек = РеквизитФормыВЗначение("Объект");
	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектТек, ОбъектТек.МКД.Наименование, Справочники.ВидыКонтактнойИнформации.АдресОбъектаРасчета);  	
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ОбъектТек);
	ОбъектТек.Строение	= ОбъектТек.МКД;
	ЗначениеВРеквизитФормы(ОбъектТек,"Объект");	
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	
	МКДПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура СтроениеПриИзмененииНаСервере()
	ОбъектТек = РеквизитФормыВЗначение("Объект");
	
	Если ОбъектТек.Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД Тогда
		ОбъектТек.МКД	= ОбъектТек.Строение;
		Иначе
		ОбъектТек.МКД	= Справочники.энргСтроения.ПустаяСсылка();
		ОбъектТек.КонтактнаяИнформация.Очистить();
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектТек, ОбъектТек.Строение.Наименование, Справочники.ВидыКонтактнойИнформации.АдресОбъектаРасчета);  	
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ОбъектТек);
	ЗначениеВРеквизитФормы(ОбъектТек,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	СтроениеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТЗГарантированныеОбъемыНаСервере()
	
	ГарантированныеОбъемы.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	бестГарантированныеОбъемы.Услуга КАК Услуга,
	  |	бестГарантированныеОбъемы.Месяц КАК Месяц,
	  |	бестГарантированныеОбъемы.Период КАК Период,
	  |	бестГарантированныеОбъемы.ОбъемУслуги КАК ОбъемУслуги,
	  |	бестГарантированныеОбъемы.Регистратор КАК Регистратор
	  |ПОМЕСТИТЬ ВТ_Услуги
	  |ИЗ
	  |	РегистрСведений.бестГарантированныеОбъемы КАК бестГарантированныеОбъемы
	  |ГДЕ
	  |	бестГарантированныеОбъемы.ОбъектРасчета = &ОбъектРасчета
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ГОД(ВТ_Услуги.Период) КАК Год,
	  |	ВТ_Услуги.Регистратор КАК Регистратор
	  |ПОМЕСТИТЬ ВТ_Год
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ВТ_Услуги.Услуга,
	  |	ГОД(ВТ_Услуги.Период),
	  |	ВТ_Услуги.Регистратор
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Январь
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 1
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Февраль
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 2
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Март
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 3
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Апрель
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 4
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Май
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 5
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Июнь
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 6
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Июль
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 7
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Август
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 8
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Сентябрь
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 9
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Октябрь
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 10
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Ноябрь
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 11
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Услуги.Услуга КАК Услуга,
	  |	ВТ_Услуги.ОбъемУслуги КАК ОбъемУслуги,
	  |	ГОД(ВТ_Услуги.Период) КАК Год
	  |ПОМЕСТИТЬ ВТ_Декабрь
	  |ИЗ
	  |	ВТ_Услуги КАК ВТ_Услуги
	  |ГДЕ
	  |	ВТ_Услуги.Месяц = 12
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	ВТ_Январь.ОбъемУслуги КАК Январь,
	  |	ВТ_Февраль.ОбъемУслуги КАК Февраль,
	  |	ВТ_Март.ОбъемУслуги КАК Март,
	  |	ВТ_Апрель.ОбъемУслуги КАК Апрель,
	  |	ВТ_Май.ОбъемУслуги КАК Май,
	  |	ВТ_Июнь.ОбъемУслуги КАК Июнь,
	  |	ВТ_Июль.ОбъемУслуги КАК Июль,
	  |	ВТ_Август.ОбъемУслуги КАК Август,
	  |	ВТ_Сентябрь.ОбъемУслуги КАК Сентябрь,
	  |	ВТ_Октябрь.ОбъемУслуги КАК Октябрь,
	  |	ВТ_Ноябрь.ОбъемУслуги КАК Ноябрь,
	  |	ВТ_Декабрь.ОбъемУслуги КАК Декабрь,
	  |	ВТ_Год.Регистратор КАК Регистратор,
	  |	ВТ_Год.Год КАК Год,
	  |	ВТ_Год.Услуга КАК Услуга
	  |ИЗ
	  |	ВТ_Год КАК ВТ_Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Январь КАК ВТ_Январь
	  |		ПО ВТ_Год.Услуга = ВТ_Январь.Услуга
	  |			И ВТ_Год.Год = ВТ_Январь.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Февраль КАК ВТ_Февраль
	  |		ПО ВТ_Год.Услуга = ВТ_Февраль.Услуга
	  |			И ВТ_Год.Год = ВТ_Февраль.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Март КАК ВТ_Март
	  |		ПО ВТ_Год.Услуга = ВТ_Март.Услуга
	  |			И ВТ_Год.Год = ВТ_Март.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Апрель КАК ВТ_Апрель
	  |		ПО ВТ_Год.Услуга = ВТ_Апрель.Услуга
	  |			И ВТ_Год.Год = ВТ_Апрель.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Май КАК ВТ_Май
	  |		ПО ВТ_Год.Услуга = ВТ_Май.Услуга
	  |			И ВТ_Год.Год = ВТ_Май.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Июнь КАК ВТ_Июнь
	  |		ПО ВТ_Год.Услуга = ВТ_Июнь.Услуга
	  |			И ВТ_Год.Год = ВТ_Июнь.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Июль КАК ВТ_Июль
	  |		ПО ВТ_Год.Услуга = ВТ_Июль.Услуга
	  |			И ВТ_Год.Год = ВТ_Июль.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Август КАК ВТ_Август
	  |		ПО ВТ_Год.Услуга = ВТ_Август.Услуга
	  |			И ВТ_Год.Год = ВТ_Август.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сентябрь КАК ВТ_Сентябрь
	  |		ПО ВТ_Год.Услуга = ВТ_Сентябрь.Услуга
	  |			И ВТ_Год.Год = ВТ_Сентябрь.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Октябрь КАК ВТ_Октябрь
	  |		ПО ВТ_Год.Услуга = ВТ_Октябрь.Услуга
	  |			И ВТ_Год.Год = ВТ_Октябрь.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ноябрь КАК ВТ_Ноябрь
	  |		ПО ВТ_Год.Услуга = ВТ_Ноябрь.Услуга
	  |			И ВТ_Год.Год = ВТ_Ноябрь.Год
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Декабрь КАК ВТ_Декабрь
	  |		ПО ВТ_Год.Услуга = ВТ_Декабрь.Услуга
	  |			И ВТ_Год.Год = ВТ_Декабрь.Год";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", Объект.Ссылка);
	
	ГарантированныеОбъемы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыУстановитьГарантОбъемы(Результат,ДополнительныеПараметры) Экспорт 
    ЗаполнитьТЗГарантированныеОбъемыНаСервере();
	Элементы.ГарантированныеОбъемы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыУстановитьГарантОбъемы", ЭтаФорма);
	ОткрытьФорму("Документ.бестУстановитьГарантированныеОбъемыНП.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Регистратор), ЭтаФорма,,,,ОповещениеОЗакрытии);

КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	Элементы.ГруппаПотребителиГВС.Видимость = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервереПереопределяемый(ТекущийОбъект)
	// Переопределяется в расширении
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиПереопределяемый(ПараметрыЗаписи)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаСервере
Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	
	МодульУправлениеКонтактнойИнформацией =
		ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	Возврат МодульУправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(
		ЭтотОбъект, Объект, Результат);
	
	КонецФункции
	
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МодульУправлениеКонтактнойИнформациейКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	МодульУправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти