#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),		Движения.бестУсредненныеОбъемы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	бестПрофильГарантирующегоПоставщика.Организация КАК Организация,
		 |	бестПрофильГарантирующегоПоставщика.ПериодНачисления КАК ПериодНачисления,
		 |	бестПрофильГарантирующегоПоставщика.Услуга КАК Услуга,
		 |	бестПрофильГарантирующегоПоставщика.Поставщик КАК Поставщик,
		 |	бестПрофильГарантирующегоПоставщикаУсредненныеОбъемы.День КАК День,
		 |	бестПрофильГарантирующегоПоставщикаУсредненныеОбъемы.Час КАК Час,
		 |	бестПрофильГарантирующегоПоставщикаУсредненныеОбъемы.Объем КАК Объем
		 |ИЗ
		 |	Документ.бестПрофильГарантирующегоПоставщика.УсредненныеОбъемы КАК бестПрофильГарантирующегоПоставщикаУсредненныеОбъемы
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПрофильГарантирующегоПоставщика КАК бестПрофильГарантирующегоПоставщика
		 |		ПО бестПрофильГарантирующегоПоставщикаУсредненныеОбъемы.Ссылка = бестПрофильГарантирующегоПоставщика.Ссылка
		 |ГДЕ
		 |	бестПрофильГарантирующегоПоставщика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли