#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заместить информацию
//
Процедура ЗаместитьИнформацию() Экспорт
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ПолучитьТекстЗапросаДляЗаполненияСреза();
	Запрос.УстановитьПараметр("ЗагруженныеДанные", ЗагруженныеДанные.Выгрузить());
	Запрос.УстановитьПараметр("ПредоставленныеОбъемы", ПредоставленныеОбъемы.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	ТекОрганизация 			= Неопределено;
	ТекРайон 				= Неопределено;
	ТекПериодНачисления 	= Неопределено;
	ТекМКД 					= Неопределено;
	МассивОбъектов			= Неопределено;
	
	Обработка = Обработки.бестРаботаСПоследовательностямиНП.Создать();
	Пока Выборка.Следующий() Цикл
		Если ТекОрганизация <> Выборка.Организация
			Или ТекРайон <> Выборка.Район 
			Или ТекПериодНачисления <> Выборка.ПериодНачисления
			Или ТекМКД <> Выборка.МКД Тогда
			
			Если МассивОбъектов <> Неопределено Тогда
				Обработка.ЗаполнитьДанныеПочасовойВедомостиСрез(ТекОрганизация, ТекРайон, ТекМКД, Ложь, ТекПериодНачисления, МассивОбъектов); 
			КонецЕсли;
			
			ТекОрганизация 			= Выборка.Организация;
			ТекРайон 				= Выборка.Район;
			ТекПериодНачисления 	= Выборка.ПериодНачисления;
			ТекМКД 					= Выборка.МКД;
			МассивОбъектов 			= Новый Массив;
			
		КонецЕсли; 
		
		МассивОбъектов.Добавить(Выборка.ОбъектРасчета);
	КонецЦикла;
	
	Если МассивОбъектов <> Неопределено Тогда
		Обработка.ЗаполнитьДанныеПочасовойВедомостиСрез(ТекОрганизация, ТекРайон, ТекМКД, Ложь, ТекПериодНачисления, МассивОбъектов); 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
		|	СтрокиСПустымиОбъемами.День КАК День,
		|	СтрокиСПустымиОбъемами.Час КАК Час,
		|	СтрокиСПустымиОбъемами.IDСтроки КАК IDСтроки,
		|	бестДанныеПочасовойВедомостиСрез.Объем КАК Объем
		|ИЗ
		|	СтрокиСПустымиОбъемами КАК СтрокиСПустымиОбъемами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестДанныеПочасовойВедомостиСрез КАК бестДанныеПочасовойВедомостиСрез
		|		ПО СтрокиСПустымиОбъемами.Организация = бестДанныеПочасовойВедомостиСрез.Организация
		|			И бестДанныеПочасовойВедомостиСрез.Район = СтрокиСПустымиОбъемами.Район
		|			И бестДанныеПочасовойВедомостиСрез.МКД = СтрокиСПустымиОбъемами.МКД
		|			И бестДанныеПочасовойВедомостиСрез.ОбъектРасчета = СтрокиСПустымиОбъемами.ОбъектРасчета
		|			И бестДанныеПочасовойВедомостиСрез.ТочкаУчета = СтрокиСПустымиОбъемами.ТочкаУчета
		|			И бестДанныеПочасовойВедомостиСрез.ПериодНачисления = СтрокиСПустымиОбъемами.ПериодНачисления
		|			И бестДанныеПочасовойВедомостиСрез.День = СтрокиСПустымиОбъемами.День
		|			И бестДанныеПочасовойВедомостиСрез.Час = СтрокиСПустымиОбъемами.Час";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		Отбор = Новый Структура();
		Отбор.Вставить("День", Выборка.День);   
		Отбор.Вставить("Час", Выборка.Час);
		Отбор.Вставить("IDСтроки", Выборка.IDСтроки);
		ДополняемаяСтрока = ПредоставленныеОбъемы.НайтиСтроки(Отбор);
		Если ДополняемаяСтрока.Количество() <> 0 Тогда
			ДополняемаяСтрока[0].Объем = Выборка.Объем;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	МассоваяЗагрузка = Неопределено;
	ДополнительныеСвойства.Свойство("МассоваяЗагрузка", МассоваяЗагрузка);
	Если МассоваяЗагрузка = Неопределено Или Не МассоваяЗагрузка Тогда
		ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	КонецЕсли;
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаДляЗаполненияСреза()
	Возврат "ВЫБРАТЬ
	        |	ЗагруженныеДанные.Организация КАК Организация,
	        |	ЗагруженныеДанные.Район КАК Район,
	        |	ЗагруженныеДанные.ОбъектРасчета КАК ОбъектРасчета,
	        |	ЗагруженныеДанные.ПериодНачисления КАК ПериодНачисления,
	        |	ЗагруженныеДанные.ГотовКОбработке КАК ГотовКОбработке,
	        |	ЗагруженныеДанные.IDСтроки КАК IDСтроки,
	        |	ЗагруженныеДанные.ТочкаУчета КАК ТочкаУчета
	        |ПОМЕСТИТЬ ТЧЗагруженныеДанные
	        |ИЗ
	        |	&ЗагруженныеДанные КАК ЗагруженныеДанные
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПредоставленныеОбъемы.День КАК День,
	        |	ПредоставленныеОбъемы.Час КАК Час,
	        |	ПредоставленныеОбъемы.Объем КАК Объем,
	        |	ПредоставленныеОбъемы.IDСтроки КАК IDСтроки
	        |ПОМЕСТИТЬ ПредоставленныеОбъемы
	        |ИЗ
	        |	&ПредоставленныеОбъемы КАК ПредоставленныеОбъемы
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТЧЗагруженныеДанные.Организация КАК Организация,
	        |	ТЧЗагруженныеДанные.Район КАК Район,
	        |	ТЧЗагруженныеДанные.ОбъектРасчета КАК ОбъектРасчета,
	        |	ТЧЗагруженныеДанные.ПериодНачисления КАК ПериодНачисления,
	        |	ПредоставленныеОбъемы.День КАК День,
	        |	ПредоставленныеОбъемы.Час КАК Час,
	        |	ПредоставленныеОбъемы.Объем КАК Объем,
	        |	ПредоставленныеОбъемы.IDСтроки КАК IDСтроки,
	        |	ТЧЗагруженныеДанные.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъектыРасчета.МКД КАК МКД
	        |ПОМЕСТИТЬ СтрокиСПустымиОбъемами
	        |ИЗ
	        |	ТЧЗагруженныеДанные КАК ТЧЗагруженныеДанные
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПредоставленныеОбъемы КАК ПредоставленныеОбъемы
	        |		ПО ТЧЗагруженныеДанные.IDСтроки = ПредоставленныеОбъемы.IDСтроки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	        |		ПО ТЧЗагруженныеДанные.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	        |ГДЕ
	        |	ТЧЗагруженныеДанные.ГотовКОбработке
	        |	И ПредоставленныеОбъемы.Объем = -1
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СтрокиСПустымиОбъемами.Организация КАК Организация,
	        |	СтрокиСПустымиОбъемами.Район КАК Район,
	        |	СтрокиСПустымиОбъемами.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтрокиСПустымиОбъемами.ПериодНачисления КАК ПериодНачисления,
	        |	бестОбъектыРасчета.МКД КАК МКД
	        |ИЗ
	        |	СтрокиСПустымиОбъемами КАК СтрокиСПустымиОбъемами
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	        |		ПО СтрокиСПустымиОбъемами.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Организация,
	        |	Район,
	        |	ПериодНачисления";
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли