#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыВыбораОбработкаЗагрузки();
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции 

#Область РаботаСОбработкамиЗагрузкиДанных

&НаСервере
Процедура УстановитьПараметрыВыбораОбработкаЗагрузки()
	НовыйПараметр 							= Новый ПараметрВыбора("Отбор.Ссылка", НаборОбработокЗагрузкиДанных());
	НовыйМассив 							= Новый Массив;
	НовыйМассив.Добавить(НовыйПараметр);
	ПараметрыВыбораСсылки 					= Новый ФиксированныйМассив(НовыйМассив);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбработкаЗагрузки", "ПараметрыВыбора", ПараметрыВыбораСсылки);
КонецПроцедуры

&НаСервере
Функция НаборОбработокЗагрузкиДанных()	
	Возврат Справочники.энргИсточникиПоказаний.НаборОбработокЗагрузкиДанных();
КонецФункции

#КонецОбласти     

#КонецОбласти

