#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Коллекция  = Метаданные.Перечисления.энргТипыСтроений.ЗначенияПеречисления;
	Для Каждого Значение Из Коллекция Цикл		
		ТипыСтроений.Добавить(Перечисления.энргТипыСтроений[Значение.Имя],Значение.Синоним);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипыСтроенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранноеЗначение 					= ТипыСтроений.Получить(ВыбраннаяСтрока);
	Если ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.МКД") 
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ОБЩ") Тогда
		ВыбранноеЗначение 				= ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОткрытиеМКД_Открытие");
		ИмяДокумента 					= "энргОткрытиеМКД";
		ПрефиксФормы 					= энргРаботаСВидамиОперацийВызовСервера.ПрефиксФормы(ИмяДокумента,ВыбранноеЗначение);
		энргРаботаСВидамиОперацийКлиент.ОткрытьФормуНовогоДокументаПоВидуОперации(ИмяДокумента,ВыбранноеЗначение,ПрефиксФормы,Новый Структура);
		ЭтаФорма.Закрыть();
	ИначеЕсли ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЖД")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЖД_БлокЗастройки")
		или ВыбранноеЗначение.Значение=ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ОСЗ")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЗУ")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.Гараж")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ХБ")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.СД") Тогда
		ДанныеЗаполнения 				= Новый Структура();
		ДанныеЗаполнения.Вставить("ТипСтроения",ВыбранноеЗначение.Значение); 
		ОткрытьФорму("Справочник.энргСтроения.ФормаОбъекта",Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения),ЭтаФорма.ВладелецФормы,,,,, РежимОткрытияОкнаФормы.Независимый);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьСоздание(Команда)
	// Вставить содержимое обработчика.
		ТипыСтроенийВыбор(Элементы.ТипыСтроений, ТекущийЭлемент.ТекущаяСтрока, Элементы.ТипыСтроений.ТекущийЭлемент, Истина);

КонецПроцедуры

#КонецОбласти