#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьСобытияАбонента(ПараметрыОтчета,АдресХранилища) Экспорт 
	
	ТабСобытияАбонента 			= Новый ТабличныйДокумент;
	
	ОбластиМакета  				= ОбластиМакета(ПараметрыОтчета);
	
	СобытияАбонента(ТабСобытияАбонента,ПараметрыОтчета,ОбластиМакета);
	
	ТабСобытияАбонента.ПоказатьУровеньГруппировокСтрок(1);
	ПараметрыОтчета.вставить("ТабСобытияАбонента",ТабСобытияАбонента);
	ПоместитьВоВременноеХранилище(ТабСобытияАбонента,АдресХранилища); 	
	//АдресХранилища = ПоместитьВоВременноеХранилище(ТабСобытияАбонента); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,Параметры)
	
	ОбластиМакета[ИмяОбласти].параметры.заполнить(Параметры);	
	
КонецПроцедуры

Процедура ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,Уровень)
	
	ТабДок.вывести(ОбластиМакета[ИмяОбласти],Уровень);	
	
КонецПроцедуры

Функция СобытияАбонента(ТабСобытияАбонента,ПараметрыОтчета,ОбластиМакета)
	перем ТДНач;
	
	ТабСобытияАбонента.ФиксацияСверху 	= 10;
	СтруктураПоказаний 					= Новый Соответствие(); 	
	СтруктураНачПок						= Новый Соответствие;
	
	ДанныеЗаполнения  							= Новый Структура("ДанныеАбонента, КоличествоКомнат, ДанныеСостоянияЛС");  // TODO FIX ME Убрать количетство комнат
	ДанныеЗаполнения.ДанныеАбонента  			= Новый Структура("Район,КлючПомещения,Строение,Помещение");
	ДанныеЗаполнения.ДанныеСостоянияЛС			= Новый Структура("ДатаСостоянияЛС, СостояниеЛС");
	
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаАбонента(ПараметрыОтчета.Организация, ПараметрыОтчета.Район, ПараметрыОтчета.Абонент,ПараметрыОтчета.НачалоПериода,ДанныеЗаполнения);
	
	ДанныеЗаполнения.Вставить("выбПериод", ПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода));
	
	Если Не ПараметрыОтчета.Свойство("Район") Тогда
		ПараметрыОтчета.Вставить("Район", ДанныеЗаполнения.ДанныеАбонента.Район);
	КонецЕсли;
	
	Если Не ПараметрыОтчета.Свойство("КлючПомещения") Тогда
		ПараметрыОтчета.Вставить("КлючПомещения", ДанныеЗаполнения.ДанныеАбонента.КлючПомещения);
	КонецЕсли;
	
	Если Не ПараметрыОтчета.Свойство("Строение") Тогда
		ПараметрыОтчета.Вставить("Строение", ДанныеЗаполнения.ДанныеАбонента.Строение);
	КонецЕсли;
	
	Если Не ПараметрыОтчета.Свойство("Помещение") Тогда
		ПараметрыОтчета.Вставить("Помещение", ДанныеЗаполнения.ДанныеАбонента.Помещение);
	КонецЕсли;
	








	ТДШапка 							= ВывестиШапкуОтчета(ОбластиМакета, ДанныеЗаполнения);	
	ТабСобытияАбонента.Вывести(ТДШапка);
	
	//Если ДанныеЗаполнения.ДанныеСостоянияЛС.СостояниеЛС <> Неопределено ИЛИ ДанныеЗаполнения.ДанныеСостоянияЛС.ДатаСостоянияЛС <> Неопределено Тогда
	НачальныйОстаток 					= 0;	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) тогда		 					
		ТДНачПоказатели					= ВывестиНачальныеПоказатели(ПараметрыОтчета,ОбластиМакета,СтруктураНачПок,НачальныйОстаток);
		ТабСобытияАбонента.Вывести(ТДНачПоказатели);
	КонецЕсли;
	
	ТДДАнныеЗаПериод  					= ВывестиДанныеЗаПериод(ПараметрыОтчета,ОбластиМакета,СтруктураПоказаний,СтруктураНачПок,НачальныйОстаток);
	
	ТабСобытияАбонента.Вывести(ТДДАнныеЗаПериод); 
	//	КонецЕсли;	
	
	Возврат ТабСобытияАбонента;
	
КонецФункции


Функция ОбластиМакета(ПараметрыОтчета)
	//ПрефиксШапки	 			= ?(ПараметрыОтчета.РасчетДляСуда,"ДляСуда","");
	ПрефиксШапки	 			= "";
	
	
	// Макет 						= Отчеты.энргКарточкаАбонента.ПолучитьМакет("Макет");
	Макет 						= ПолучитьМакет("Макет");;
	
	ОбластиМакета  				= Новый Структура;
	
	Области  					= Новый Массив;
	Области.Добавить("Шапка");
	Области.Добавить("ШапкаДляСуда");
	Области.Добавить("ПараметрыАбонента");
	Области.Добавить("ПериодНачисления");
	Области.Добавить("СтрокаСобытия");
	Области.Добавить("Расшифровка");
	Области.Добавить("ИтогиПериод");
	Области.Добавить("ШапкаИтогиВзаиморасчетов");
	Области.Добавить("ВзаиморасчетыСтрока");
	Области.Добавить("ВзаиморасчетыИтогПериод");
	Области.Добавить("ПодвалСобытияСуд");
	Области.Добавить("Подписанты");
	Области.Добавить("Исполнитель");
	Области.Добавить("Пустая");
	
	для Каждого ИмяОбласти из Области цикл
		ОбластиМакета.Вставить("" +   ИмяОбласти,Макет.ПолучитьОбласть(ИмяОбласти));
	КонецЦикла; 
	
	Возврат ОбластиМакета;
КонецФункции

Функция ВывестиШапкуОтчета(ОбластиМакета, ДанныеЗаполнения)
	
	ТабДок  = Новый ТабличныйДокумент;
	ЗаполнитьПараметрыОбласти(ОбластиМакета,"Шапка",ДанныеЗаполнения);
	
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,"Шапка",0);
	Возврат ТабДок;
	
КонецФункции

Функция ВывестиДанныеЗаПериод(ПараметрыОтчета,ОбластиМакета,СтруктураПоказаний,СтруктураНачПок,НачальныйОстаток)
	
	ТабДок 												= Новый ТабличныйДокумент;
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	РезультатПериодДействияАбонента						= РезультатЗапроса(ТекстЗапросаПериодаДействияАбонента(),ПараметрыОтчета);
	ВыборкаПериодДействияАбонента						= РезультатПериодДействияАбонента.Выбрать();
	ВыборкаПериодДействияАбонента.Следующий();
	ПараметрыОтчета.Вставить("НачалоПериодаДействияЛС",	ВыборкаПериодДействияАбонента.НачалоПериодаДействияЛС);
	ПараметрыОтчета.Вставить("КонецПериодаДействияЛС",	ВыборкаПериодДействияАбонента.КонецПериодаДействияЛС);
	ПараметрыОтчета.Вставить("ТекущаяДата",				ТекущаяДатаСеанса());
	
	РезультатСобытияАбонента  							= РезультатЗапроса(ТекстЗапросаСобытияАбонента(),ПараметрыОтчета);
	ВыборкаПериодНачисления								= РезультатСобытияАбонента.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	РезультатДеталиВзаиморасчетов 						= РезультатЗапроса(ТекстДеталиВзаиморасчетов(),ПараметрыОтчета);
	СоотвествиеДеталиВзаиморасчеты 						= СоотвествиеДеталиВзаиморасчеты(РезультатДеталиВзаиморасчетов);
	
	РезультатДеталиНачислений							= РезультатЗапроса(ТекстДеталиНачислений(),ПараметрыОтчета);
	СоотвествиеДеталиНачислений 						= СоотвествиеДеталиНачислений(РезультатДеталиНачислений);
	
	РезультатИтогиВзаиморасчетов 						= РезультатЗапроса(ТекстОстаткиГраницыПериодаНачисления(ПараметрыОтчета),ПараметрыОтчета);
	СоотвествиеИтогиВзаиморасчетов 						= СоотвествиеИтогиВзаиморасчетов(РезультатИтогиВзаиморасчетов);
	
	ТекПериод 											= Неопределено;
	Пока ВыборкаПериодНачисления.следующий() цикл  		
		Если ТекПериод <> ВыборкаПериодНачисления.ПериодНачисления и ТекПериод <> Неопределено тогда
			// выводим итоги за период  			
			ИмяОбласти 									= "СтрокаСобытия";
			ПараметрыОбл 								= ПараметрыОбласти(ИмяОбласти);
			ПараметрыОбл.Событие 						= "Итого за период";
			ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл); 			
			ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,2);
			
			ИмяОбласти 									= "ШапкаИтогиВзаиморасчетов";
			ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,3);
			
			МассивИтогиЗаПериод 						= СоотвествиеИтогиВзаиморасчетов.Детали[ТекПериод];
			Если МассивИтогиЗаПериод <> Неопределено тогда								
				
				ИтогиЗаПериод 							= СоотвествиеИтогиВзаиморасчетов.итоги[ТекПериод];
				НачальныйОстаток						= ИтогиЗаПериод.ОстатокКонДт - ИтогиЗаПериод.ОстатокКонКт - ИтогиЗаПериод.ОстатокКонДтПеня;
				ЗадолженностьПени						= ИтогиЗаПериод.ОстатокКонДтПеня;
				ИмяОбласти 								= "ВзаиморасчетыИтогПериод";
				ПараметрыОбл 							= ПараметрыОбласти(ИмяОбласти);				
				ЗаполнитьЗначенияСвойств(ПараметрыОбл,ИтогиЗаПериод);
				ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
				ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,3);				
				
				ИмяОбласти 								= "ВзаиморасчетыСтрока"; 
				ПараметрыОбл 							= ПараметрыОбласти(ИмяОбласти);
				для Каждого СтрокаИтогов из МассивИтогиЗаПериод цикл
					ЗаполнитьЗначенияСвойств(ПараметрыОбл,СтрокаИтогов);
					ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
					ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,4);
				КонецЦикла;				
			КонецЕсли;
		КонецЕсли;
		
		ТекПериод 										= ВыборкаПериодНачисления.ПериодНачисления;
		ИмяОбласти 										= "ПериодНачисления";
		ПараметрыОбл  									= Новый Структура("ПериодНачисления,Задолженность,ЗадолженностьПени",Формат(ТекПериод,"ДФ='ММММ гггг'"),НачальныйОстаток,ЗадолженностьПени);
		ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
		ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,ВыборкаПериодНачисления.уровень()+1);
		
		ВыборкаРегистратор  							= ВыборкаПериодНачисления.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРегистратор.следующий() цикл
			
			ИмяОбласти 									= "СтрокаСобытия";
			ПараметрыОбл 								= ПараметрыОбласти(ИмяОбласти);
			
			ПараметрыОбл.Событие 						= ВыборкаРегистратор.РегистраторПредставление + ВыборкаРегистратор.ИсточникОплаты;
			ПараметрыОбл.Регистратор					= ВыборкаРегистратор.Регистратор;
			ПараметрыОбл.ТочкаУчета						= ВыборкаРегистратор.ТочкаУчетаПредставление;
			ПараметрыОбл.Период							= ВыборкаРегистратор.Период;
			ПараметрыОбл.Начислено						= ВыборкаРегистратор.НачисленоИтого;
			ПараметрыОбл.Оплачено						= ВыборкаРегистратор.Оплачено;
			
			ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
			
			ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,ВыборкаРегистратор.уровень()+1);
			
			МассивВзаиморасчеты  						= СоотвествиеДеталиВзаиморасчеты.получить(ВыборкаРегистратор.Регистратор); 	
			МассивНачисления 							= СоотвествиеДеталиНачислений.получить(ВыборкаРегистратор.Регистратор);
			
			Выборка  									= ВыборкаРегистратор.выбрать();
			
			Пока Выборка.следующий() цикл
				Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
					ТипРегистратора	= 1;
				ИначеЕсли ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.энргНачислениеПени") Или ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.энргРучноеИзменениеПени") Тогда
					ТипРегистратора = 2;
				Иначе
					ТипРегистратора	= 0;
				КонецЕсли;
				
				Если ТипЗнч(Выборка.Значение) = Тип("Дата") тогда
					Значение 							= Формат(Выборка.Значение,"ДФ=dd.MM.гггг");
				иначе
					Значение 							= Выборка.Значение;
				КонецЕсли;  
				
				Если ТипЗнч(Выборка.ДопЗначение1) = Тип("Дата") тогда
					ДопЗначение1 						= Формат(Выборка.ДопЗначение1,"ДФ=dd.MM");
				иначе
					ДопЗначение1 						= Выборка.ДопЗначение1;
				КонецЕсли;
				
				Если ТипЗнч(Выборка.ДопЗначение2) = Тип("Дата") тогда
					ДопЗначение2 						= Формат(Выборка.ДопЗначение2,"ДФ=dd.MM");
				иначе
					ДопЗначение2						= Выборка.ДопЗначение2;
				КонецЕсли; 
				
				Если ТипЗнч(Выборка.ДопЗначение3) = Тип("Дата") тогда
					ДопЗначение3 						= Формат(Выборка.ДопЗначение3,"ДФ=dd.MM");
				иначе
					ДопЗначение3						= Выборка.ДопЗначение3;
				КонецЕсли; 
				
				Если Выборка.НачальныеПоказания  = Неопределено тогда
					НачальныеПоказания 					= "";
				иначе
					НачальныеПоказания 					= Выборка.НачальныеПоказания;
				КонецЕсли;
				
				Если Выборка.КонечныеПоказания  = Неопределено тогда
					КонечныеПоказания 					= "";
				иначе
					КонечныеПоказания 					= Выборка.КонечныеПоказания;
				КонецЕсли;   
				
				ДопЗначение1 							= ?(ЗначениеЗаполнено(ДопЗначение1),ДопЗначение1,"");
				ДопЗначение2 							= ?(ЗначениеЗаполнено(ДопЗначение2),ДопЗначение2,"");
				ДопЗначение2 							= ?(ЗначениеЗаполнено(ДопЗначение2),ДопЗначение2,"");
				ДопЗначение 							= 
				?(ЗначениеЗаполнено(ДопЗначение1) 
				или ЗначениеЗаполнено(ДопЗначение2)
				или ЗначениеЗаполнено(ДопЗначение3),
				"(" + 
				?(ЗначениеЗаполнено(ДопЗначение1),ДопЗначение1,"") + 
				?(ЗначениеЗаполнено(ДопЗначение2)," - " + ДопЗначение2,"") +
				?(ЗначениеЗаполнено(ДопЗначение3)," - " + ДопЗначение3,"") +
				")","");
				
				Если Выборка.ПредставлениеСобытия = "Изменение вида благоустройства" тогда   // ДопЗначение4-хвс,ДопЗначение5-Полив
					
					Значение=Строка(Значение)+";"+Символы.ПС+"Норма ХВС: "+Строка(Выборка.ДопЗначение4)+" Норма Полив: "+Строка(Выборка.ДопЗначение5);
					
				КонецЕсли;
				
				ИмяОбласти 								= "Расшифровка";
				ПараметрыОбл 							= Новый Структура("
				|Событие, Период,
				|ДопЗначение
				|,ТочкаУчета,ПриборУчета,ТипПрибора,
				|Начислено,Оплачено,Расход,
				|Значение,ЗначениеТарифа,НачПок,КонПок,Статус",
				Выборка.ПредставлениеСобытия,Выборка.Период,
				ДопЗначение,
				Выборка.ТочкаУчетаПредставление,Выборка.ПриборУчетаПредставление,Выборка.ТипПрибораУчетаПредставление,
				Выборка.Начислено,Выборка.Оплачено,Выборка.Расход,
				Значение,Выборка.ЗначениеТарифа,НачальныеПоказания,КонечныеПоказания);
				ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
				
				
				ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,Выборка.уровень()+1);  				
				
				Если Выборка.ПредставлениеСобытия = "Изменение задолженности" или  Выборка.ПредставлениеСобытия = "Оплата" тогда
					Если МассивВзаиморасчеты<> Неопределено тогда
						ПараметрыОбл 					= Новый Структура("
						|Событие,Период,
						|ДопЗначение,
						|Начислено,Оплачено,
						|Значение,ТочкаУчета,ПриборУчета",);
						
						для Каждого СтруктрураВзаиморасчетов  из МассивВзаиморасчеты цикл
							ПараметрыОбл.Событие 		= "		" + СтруктрураВзаиморасчетов.ПредставлениеСобытия;
							ПараметрыОбл.ДопЗначение	= Символы.ПС + "(" + СтруктрураВзаиморасчетов.ПоставщикПредставление + ")";
							ПараметрыОбл.Начислено 		= СтруктрураВзаиморасчетов.Начислено;
							ПараметрыОбл.Оплачено 		= СтруктрураВзаиморасчетов.Оплачено;
							ПараметрыОбл.Период 		= Формат(СтруктрураВзаиморасчетов.ПериодНачисления,"ДФ='ММММ гггг'");
							ПараметрыОбл.Значение 		= СтруктрураВзаиморасчетов.УслугаПредставление;
							ПараметрыОбл.ТочкаУчета 	= "";
							ПараметрыОбл.ПриборУчета 	= "";
							ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
							ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,Выборка.уровень()+2);
						КонецЦикла;  						
					КонецЕсли;
				ИначеЕсли Выборка.ПредставлениеСобытия = "Начисление за период" тогда
					// Выводим детали начислений
					Если МассивНачисления <> Неопределено тогда
						
						ПараметрыОбл 					= ПараметрыОбласти(ИмяОбласти);
						
						для Каждого СтруктрураНачислений  из МассивНачисления цикл
							Если ТипРегистратора = 1 И СтруктрураНачислений.ПериодРасчета <> Выборка.ПериодНачисления Тогда 
								// Надо выводить начисление только этого периода
								// Документ корректировка делает движения в разные периоды начислений
								Продолжить;
							ИначеЕсли ТипРегистратора = 2 И СтруктрураНачислений.ПериодНачисления <> Выборка.Период Тогда 
								// Надо выводить начисление только этого периода
								Продолжить;
							КонецЕсли;
							
							ПараметрыОбл.Событие 		= "		" + СтруктрураНачислений.ПредставлениеСобытия;
							ПараметрыОбл.ДопЗначение	= Символы.ПС + "(" + СтруктрураНачислений.ПоставщикПредставление + ")";
							ПараметрыОбл.Начислено 		= СтруктрураНачислений.Начислено;
							ПараметрыОбл.Расход 		= СтруктрураНачислений.Расход;
							Если ЗначениеЗаполнено(СтруктрураНачислений.НачалоПериода) ИЛИ ЗначениеЗаполнено(СтруктрураНачислений.КонецПериода) тогда
								ПараметрыОбл.Период 		= Формат(СтруктрураНачислений.НачалоПериода,"ДФ=дд.ММ") + "-" +  Формат(СтруктрураНачислений.КонецПериода,"ДФ=дд.ММ");
							Иначе
								ПараметрыОбл.Период 		= Формат(НачалоМесяца(СтруктрураНачислений.ПериодНачисления),"ДФ=дд.ММ") + "-" +  Формат(КонецМесяца(СтруктрураНачислений.ПериодНачисления),"ДФ=дд.ММ"); 
							КонецЕсли;
							ПараметрыОбл.Значение 		= СтруктрураНачислений.УслугаПредставление;
							ПараметрыОбл.ТочкаУчета 	= СтруктрураНачислений.ТочкаУчетаПредставление ;
							ПараметрыОбл.ЗначениеТарифа	= СтруктрураНачислений.ЗначениеТарифа;  
							ПараметрыОбл.НачПок 		= СтруктрураНачислений.НачальныеПоказания;
							ПараметрыОбл.КонПок 		= СтруктрураНачислений.КонечныеПоказания;
							ПараметрыОбл.ПриборУчета 	= СтруктрураНачислений.ПриборУчетаПредставление;
							ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
							ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,Выборка.уровень()+2);
						КонецЦикла;
					КонецЕсли;					
				КонецЕсли;   								
			КонецЦикла;			
		КонецЦикла; 			
	КонецЦикла;
	
	Если ТекПериод <> Неопределено тогда
		ИмяОбласти 											= "СтрокаСобытия";
		ПараметрыОбл 										= ПараметрыОбласти(ИмяОбласти);
		ПараметрыОбл.Событие 								= "Итого за период";
		ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл); 			
		ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,2);
		
		ИмяОбласти 											= "ШапкаИтогиВзаиморасчетов";
		ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,3);
		
		МассивИтогиЗаПериод 								= СоотвествиеИтогиВзаиморасчетов.Детали[ТекПериод];
		Если МассивИтогиЗаПериод <> Неопределено тогда								
			
			ИтогиЗаПериод 									= СоотвествиеИтогиВзаиморасчетов.итоги[ТекПериод];
			ИмяОбласти 										= "ВзаиморасчетыИтогПериод";
			ПараметрыОбл 									= ПараметрыОбласти(ИмяОбласти);				
			ЗаполнитьЗначенияСвойств(ПараметрыОбл,ИтогиЗаПериод);
			ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
			ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,3);				
			
			ИмяОбласти 										= "ВзаиморасчетыСтрока"; 
			ПараметрыОбл 									= ПараметрыОбласти(ИмяОбласти);
			для Каждого СтрокаИтогов из МассивИтогиЗаПериод цикл
				ЗаполнитьЗначенияСвойств(ПараметрыОбл,СтрокаИтогов);
				ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбл);
				ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,4);
			КонецЦикла;				
		КонецЕсли;
	КонецЕсли;	
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	Возврат ТабДок;
КонецФункции

Функция РезультатЗапроса(Текст,ПараметрыОтчета)
	
	Запрос 		 							= Новый Запрос;
	Запрос.Текст 							= Текст;
	для Каждого ПараметрОтчета из ПараметрыОтчета цикл
		Запрос.УстановитьПараметр(ПараметрОтчета.Ключ,ПараметрОтчета.Значение);
	КонецЦикла;	
	
	Результат  								= Запрос.Выполнить();
	Возврат  Результат;
КонецФункции

Функция ТекстЗапросаПериодаДействияАбонента()
	Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСостояниеЛС.Состояние
	|				ТОГДА энргСостояниеЛС.Период
	|			ИНАЧЕ &НачалоПериода
	|		КОНЕЦ) КАК Начало,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НЕ энргСостояниеЛС.Состояние
	|				ТОГДА энргСостояниеЛС.Период
	|			ИНАЧЕ &КонецПериода
	|		КОНЕЦ) КАК КОНЕЦ

	|ПОМЕСТИТЬ ВТ_Даты
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС КАК энргСостояниеЛС
	|ГДЕ
	//|	энргСостояниеЛС.Период МЕЖДУ &НачалоПериода И &КонецПериода
	| энргСостояниеЛС.Организация = &Организация
	|	И энргСостояниеЛС.Район = &Район
	|	И энргСостояниеЛС.Абонент = &Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&НачалоПериода,
	|	&КонецПериода


	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_Даты.Начало) КАК НачалоПериодаДействияЛС,
	|	МИНИМУМ(ВТ_Даты.Конец) КАК КонецПериодаДействияЛС

	|ИЗ
	|	ВТ_Даты КАК ВТ_Даты";


	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаСобытияАбонента()
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргВзаиморасчеты.Период КАК Период,
	|	энргВзаиморасчеты.Регистратор КАК Регистратор,
	|	энргВзаиморасчеты.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ РегистраторыВзаиморасчеты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
	|ГДЕ
	|	энргВзаиморасчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргВзаиморасчеты.Абонент = &Абонент
	|	И НЕ энргВзаиморасчеты.Регистратор ССЫЛКА Документ.энргБанкротство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Период КАК Период,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Регистратор КАК Регистратор,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.НомерСтроки КАК НомерСтроки,
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Услуга КАК Услуга
	|ПОМЕСТИТЬ РегистраторыОтключениеУслуги
	|ИЗ
	|	РегистрНакопления.энргКоличествоДнейИспользованияУслугиПриОтключении КАК энргКоличествоДнейИспользованияУслугиПриОтключении
	|ГДЕ
	|	энргКоличествоДнейИспользованияУслугиПриОтключении.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргКоличествоДнейИспользованияУслугиПриОтключении.Регистратор.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗабалансоваяЗадолженность.Период КАК Период,
	|	энргЗабалансоваяЗадолженность.Регистратор КАК Регистратор,
	|	энргЗабалансоваяЗадолженность.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ РегистраторыЗабаланс
	|ИЗ
	|	РегистрНакопления.энргЗабалансоваяЗадолженность КАК энргЗабалансоваяЗадолженность
	|ГДЕ
	|	энргЗабалансоваяЗадолженность.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргЗабалансоваяЗадолженность.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ РегистраторыОбъемы
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Запись,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Строение = &Строение
	|				И Помещение = &Помещение
	|				И Абонент = &Абонент) КАК энргОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ТаблицаРегистра.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВидыБлагоустройстваАбонентов
	|ИЗ
	|	РегистрСведений.энргВидБлагоустройствАбонента КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыБлагоустройстваАбонентов.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВидыБлагоустройстваАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	ВидыБлагоустройстваАбонентов.ПериодРегистрации КАК ПериодРегистрации,
	|	0 КАК НормаХВС,
	|	0 КАК НормаПолив,
	|	ВидыБлагоустройстваАбонентов.Период КАК Период,
	|	ВидыБлагоустройстваАбонентов.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВидыБлагоустройстваАбонентовСНормами
	|ИЗ
	|	ВидыБлагоустройстваАбонентов КАК ВидыБлагоустройстваАбонентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВидыБлагоустройстваАбонентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Состояние КАК Значение,
	|	"""" КАК ДопЗначение1,
	|	"""" КАК ДопЗначение2,
	|	"""" КАК ДопЗначение3,
	|	"""" КАК ПриборУчетаПредставление,
	|	"""" КАК ТипПрибораУчетаПредставление,
	|	"""" КАК ТочкаУчетаПредставление,
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка) КАК ТочкаУчета,
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор) КАК РегистраторПредставление,
	|	""Изменение состояния лицевого счета"" КАК ПредставлениеСобытия,
	|	ТаблицаРегистра.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации КАК ПериодРегистрации,
	|	0 КАК Начислено,
	|	0 КАК НачисленоИтого,
	|	0 КАК Оплачено,
	|	0 КАК Расход,
	|	0 КАК ЗначениеТарифа,
	|	НЕОПРЕДЕЛЕНО КАК НачальныеПоказания,
	|	НЕОПРЕДЕЛЕНО КАК КонечныеПоказания,
	|	NULL КАК ДопЗначение4,
	|	NULL КАК ДопЗначение5,
	|	NULL КАК ИсточникОплаты
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.Абонент = &Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Услуга),
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ТочкаУчета),
	|	ТаблицаРегистра.ТочкаУчета,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение услуги точки учета"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчета КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Состояние),
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ТочкаУчета),
	|	ТаблицаРегистра.ТочкаУчета,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение сост-я пр-ра учета"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Коэффициент,
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение р-го к-та прибора учета"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Состояние,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ТочкаУчета),
	|	ТаблицаРегистра.ТочкаУчета,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменения состояния услуги"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ДатаПоверки,
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Регистрация изменения даты поверки"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргДатыПоверкиПрибораУчета КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.СостояниеПоказаний),
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Регистрация показаний пр-ра учета"",
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА ВЫРАЗИТЬ(ТаблицаРегистра.Регистратор КАК Документ.энргПерерасчет).ПериодНачисления
	|		ИНАЧЕ ТаблицаРегистра.ПериодНачисления
	|	КОНЕЦ,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаРегистра.Показание,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВидыБлагоустройстваАбонентовСНормами.ВидБлагоустройства, """"),
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ВидыБлагоустройстваАбонентовСНормами.Период,
	|	ВидыБлагоустройстваАбонентовСНормами.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ВидыБлагоустройстваАбонентовСНормами.Регистратор),
	|	""Изменение вида благоустройства"",
	|	ВидыБлагоустройстваАбонентовСНормами.ПериодНачисления,
	|	ВидыБлагоустройстваАбонентовСНормами.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЕСТЬNULL(ВидыБлагоустройстваАбонентовСНормами.НормаХВС, 0),
	|	ЕСТЬNULL(ВидыБлагоустройстваАбонентовСНормами.НормаПолив, 0),
	|	NULL
	|ИЗ
	|	ВидыБлагоустройстваАбонентовСНормами КАК ВидыБлагоустройстваАбонентовСНормами
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ГруппаПотребителей,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение тарифной группы потребителя"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргГруппыПотребителейАбонентов КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Площадь,
	|	ТаблицаРегистра.ВидПлощади,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение площади абонента"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргЗначенияПлощадей КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Количество,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение количества комнат"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргКоличествоКомнат КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Количество,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение количества прописанных"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргКоличествоПрописанных КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.КлючПомещения = &КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	энргОбъемНачислений.Период,
	|	энргОбъемНачислений.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.Регистратор),
	|	""Начисление за период"",
	|	НАЧАЛОПЕРИОДА(энргОбъемНачислений.Период, МЕСЯЦ),
	|	энргОбъемНачислений.Период,
	|	СУММА(энргОбъемНачислений.Сумма),
	|	СУММА(энргОбъемНачислений.Сумма),
	|	0,
	|	СУММА(энргОбъемНачислений.ОбъемУслуги),
	|	0,
	|	МИНИМУМ(энргОбъемНачислений.НачальныеПоказания),
	|	МАКСИМУМ(энргОбъемНачислений.КонечныеПоказания),
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	энргОбъемНачислений.Период >= &НачалоПериода
	|	И энргОбъемНачислений.Период <= &КонецПериода
	|	И энргОбъемНачислений.Организация = &Организация
	|	И энргОбъемНачислений.Район = &Район
	|	И энргОбъемНачислений.Строение = &Строение
	|	И энргОбъемНачислений.Помещение = &Помещение
	|	И энргОбъемНачислений.Абонент = &Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОбъемНачислений.Регистратор,
	|	энргОбъемНачислений.ПериодРасчета,
	|	энргОбъемНачислений.Период,
	|	энргОбъемНачислений.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	энргНачислениеПени.ПериодНачисления,
	|	энргНачислениеПени.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(энргНачислениеПени.Регистратор),
	|	""Начисление за период"",
	|	НАЧАЛОПЕРИОДА(энргНачислениеПени.Период, МЕСЯЦ),
	|	энргНачислениеПени.Период,
	|	СУММА(энргНачислениеПени.Сумма),
	|	СУММА(энргНачислениеПени.Сумма),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК энргНачислениеПени
	|ГДЕ
	|	энргНачислениеПени.Период >= &НачалоПериода
	|	И энргНачислениеПени.Период <= &КонецПериода
	|	И энргНачислениеПени.Организация = &Организация
	|	И энргНачислениеПени.Район = &Район
	|	И энргНачислениеПени.МКД = &МКД
	|	И энргНачислениеПени.Абонент = &Абонент
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Регистратор,
	|	энргНачислениеПени.ПериодНачисления,
	|	энргНачислениеПени.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА ""Перерасчет""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргБанкротство
	|			ТОГДА ""Задолженность под мораторием""
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	|			ТОГДА ""Изменение задолженности""
	|		ИНАЧЕ ""Оплата""
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(ТаблицаРегистра.ПериодНачисления, МЕСЯЦ),
	|	ТаблицаРегистра.Период,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	|				ТОГДА ТаблицаРегистра.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	|				ТОГДА ТаблицаРегистра.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПриходныйКассовыйОрдер
	|			ТОГДА "" (Касса)""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА "" ("" + ТаблицаРегистра.Регистратор.ИсточникПоступления.Наименование + "")""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПерерасчет
	|				И ТаблицаРегистра.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты)
	|			ТОГДА "" ("" + ТаблицаРегистра.Регистратор.ИсточникПоступления.Наименование + "")""
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчеты КАК ТаблицаРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистраторыВзаиморасчеты КАК РегистраторыВзаиморасчеты
	|		ПО ТаблицаРегистра.Период = РегистраторыВзаиморасчеты.Период
	|			И ТаблицаРегистра.Регистратор = РегистраторыВзаиморасчеты.Регистратор
	|			И ТаблицаРегистра.НомерСтроки = РегистраторыВзаиморасчеты.НомерСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРегистра.Регистратор,
	|	ТаблицаРегистра.Период,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПриходныйКассовыйОрдер
	|			ТОГДА "" (Касса)""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА "" ("" + ТаблицаРегистра.Регистратор.ИсточникПоступления.Наименование + "")""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПерерасчет
	|				И ТаблицаРегистра.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты)
	|			ТОГДА "" ("" + ТаблицаРегистра.Регистратор.ИсточникПоступления.Наименование + "")""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(ТаблицаРегистра.ПериодНачисления, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА ""Перерасчет""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргБанкротство
	|			ТОГДА ""Задолженность под мораторием""
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	|			ТОГДА ""Изменение задолженности""
	|		ИНАЧЕ ""Оплата""
	|	КОНЕЦ,
	|	ТаблицаРегистра.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргБанкротство
	|			ТОГДА ""Задолженность под мораторием""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргСоглашениеПоРассрочке
	|			ТОГДА ""Реструктуризация задолженности""
	|		ИНАЧЕ ""Оплата""
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(ТаблицаРегистра.Период, МЕСЯЦ),
	|	ТаблицаРегистра.Период,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	|				ТОГДА ТаблицаРегистра.СуммаЗадолженности
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	|				ТОГДА ТаблицаРегистра.СуммаЗадолженности
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	|				ТОГДА ТаблицаРегистра.СуммаЗадолженности
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистраторыЗабаланс КАК РегистраторыЗабаланс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргЗабалансоваяЗадолженность КАК ТаблицаРегистра
	|		ПО РегистраторыЗабаланс.Период = ТаблицаРегистра.Период
	|			И РегистраторыЗабаланс.Регистратор = ТаблицаРегистра.Регистратор
	|			И РегистраторыЗабаланс.НомерСтроки = ТаблицаРегистра.НомерСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргБанкротство
	|			ТОГДА ""Задолженность под мораторием""
	|		КОГДА ТаблицаРегистра.Регистратор ССЫЛКА Документ.энргСоглашениеПоРассрочке
	|			ТОГДА ""Реструктуризация задолженности""
	|		ИНАЧЕ ""Оплата""
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(ТаблицаРегистра.Период, МЕСЯЦ),
	|	ТаблицаРегистра.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	РегистраторыОтключениеУслуги.Услуга,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	"""",
	|	НАЧАЛОПЕРИОДА(ТаблицаРегистра.Период, МЕСЯЦ),
	|	ТаблицаРегистра.Период,
	|	"""",
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	"""",
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.энргКоличествоДнейИспользованияУслугиПриОтключении КАК ТаблицаРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистраторыОтключениеУслуги КАК РегистраторыОтключениеУслуги
	|		ПО ТаблицаРегистра.Период = РегистраторыОтключениеУслуги.Период
	|			И ТаблицаРегистра.Регистратор = РегистраторыОтключениеУслуги.Регистратор
	|			И ТаблицаРегистра.НомерСтроки = РегистраторыОтключениеУслуги.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ЗначениеНорматива,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	""Изменение соц. нормы"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргЗначенияДополнительныхСоциальныхНормативов КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период МЕЖДУ &НачалоПериодаДействияЛС И &КонецПериодаДействияЛС
	|	И ТаблицаРегистра.Организация = &Организация
	|	И ТаблицаРегистра.Район = &Район
	|	И ТаблицаРегистра.Строение = &Строение
	|	И ТаблицаРегистра.Помещение = &Помещение
	|	И ТаблицаРегистра.Регистратор.Абонент = &Абонент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	ПериодРегистрации,
	|	Регистратор
	|ИТОГИ
	|	МАКСИМУМ(ПериодРегистрации),
	|	МАКСИМУМ(Начислено),
	|	СУММА(НачисленоИтого),
	|	СУММА(Оплачено),
	|	МАКСИМУМ(ИсточникОплаты)
	|ПО
	|	ПериодНачисления,
	|	Регистратор";
	Возврат  Текст;
	
КонецФункции

Функция ВывестиНачальныеПоказатели(ПараметрыОтчета,ОбластиМакета,СтруктураНачПок,НачальныйОстаток)
	
	Район 										= Неопределено;
	Если ПараметрыОтчета.Свойство("Район") Тогда
		Район 									= ПараметрыОтчета.Район;
	КонецЕсли;
	
	ТабДок  									= Новый ТабличныйДокумент;
	ТабДок.НачатьАвтогруппировкуСтрок();
	ДанныеЗаполнения  							= Новый Структура("ДанныеАбонента, ДанныеФизЛица, КоличествоКомнат");  // TODO FIX ME Убрать количетство комнат
	ДанныеЗаполнения.ДанныеАбонента  			= Новый Структура("Район,КлючПомещения,Строение,Помещение,ЛицевойСчет,СтарыйЛС,ПредставлениеАбонента,АдресОбъекта,АдресОбъектаЗначенияПолей,ВидОбъекта,ГруппаАбонента, ОтключатьВНеполивнойСезон");
	ДанныеЗаполнения.ДанныеФизЛица  			= Новый Структура("ПаспортРФ,ДатаРождения,МестоРождения");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаАбонента(ПараметрыОтчета.Организация, Район, ПараметрыОтчета.Абонент,ПараметрыОтчета.НачалоПериода,ДанныеЗаполнения);
	
	ИмяОбласти  								= "ПараметрыАбонента";
	Область  									= ОбластиМакета[ИмяОбласти];
	
	ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ДанныеЗаполнения.ДанныеАбонента);
	ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ДанныеЗаполнения.ДанныеФизЛица);
	ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ДанныеЗаполнения.ДанныеФизЛица.ПаспортРФ);
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	ПараметрыЗапроса 							= Новый Структура("Организация,Район,Абонент,МКД,КлючПомещения,Строение,Помещение,Период");
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса,ПараметрыОтчета);
	ПараметрыЗапроса.Период 					= ПараметрыОтчета.НачалоПериода;







	
	ИмяОбласти  								= "СтрокаСобытия";		
	Область  									= ОбластиМакета[ИмяОбласти]; 	
	Область.Параметры.Событие 					= "Начальные показатели";
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,1);
	
	РезультатНачальныеОстатки  					= РезультатЗапроса(ТекстНачальныеПоказатели(),ПараметрыЗапроса);
	Выборка 									= РезультатНачальныеОстатки.выбрать();
	
	ПараметрыЗапроса.Период 					= Новый Граница(ПараметрыОтчета.НачалоПериода,ВидГраницы.Исключая);
	
	РезультатДеталиВзаиморасчеты 				= РезультатЗапроса(ТекстНачальныеДеталиВзаиморасчетов(),ПараметрыЗапроса);				  
	ВыборкаВзаиморасчеты 						= РезультатДеталиВзаиморасчеты.Выбрать();
	Пока Выборка.следующий() цикл
		
		Если Выборка.ПредставлениеСобытия = "Задолженность на начало периода" тогда
			ИмяОбласти  							= "СтрокаСобытия";
		Иначе
			ИмяОбласти  							= "Расшифровка";
		КонецЕсли;
		
		Значение=Выборка.Значение;
		
		Если Выборка.ПредставлениеСобытия = "Изменение вида благоустройства" тогда   // ДопЗначение4-хвс,ДопЗначение5-Полив
			
			Значение=Строка(Значение)+";"+Символы.ПС+"Норма ХВС: "+Строка(Выборка.ДопЗначение4)+" Норма Полив: "+Строка(Выборка.ДопЗначение5);
			
		КонецЕсли;
		
		ПараметрыОбласти 						= ПараметрыОбласти(ИмяОбласти);
		ПараметрыОбласти.Событие 				= Выборка.ПредставлениеСобытия;
		
		Если Выборка.ПредставлениеСобытия = "Задолженность на начало периода" тогда
			ПараметрыОбласти.Начислено 				= Значение;
		Иначе
			ПараметрыОбласти.Период 				= Выборка.Период;
			ПараметрыОбласти.ДопЗначение 			= Выборка.ДопЗначение1;
			ПараметрыОбласти.ТочкаУчета 			= Выборка.ТочкаУчетаПредставление;
			ПараметрыОбласти.ПриборУчета 			= Выборка.ПриборУчетаПредставление;
			ПараметрыОбласти.ТипПрибора 			= Выборка.ТипПрибораУчетаПредставление;
			ПараметрыОбласти.Значение 				= Значение;
			ПараметрыОбласти.КонПок 				= ФорматироватьПоказания(Выборка, Выборка.КонечныеПоказания);
		КонецЕсли;
		
		ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбласти);
		
		
		Если Выборка.ПредставлениеСобытия = "Задолженность на начало периода" тогда
			ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,1);
			
			ИмяОбласти = "Расшифровка";
			НачальныйОстаток 					= Выборка.Значение; 			
			Пока ВыборкаВзаиморасчеты.следующий() цикл
				ПараметрыОбласти 				= ПараметрыОбласти(ИмяОбласти);
				ПараметрыОбласти.Событие 		= "		" + ВыборкаВзаиморасчеты.Событие + ?(ЗначениеЗаполнено(ВыборкаВзаиморасчеты.ПоставщикПредставление),Символы.ПС +"(" +ВыборкаВзаиморасчеты.ПоставщикПредставление +")","");
				ПараметрыОбласти.Период 		= Формат(ВыборкаВзаиморасчеты.ПериодНачисления,"ДФ='ММММ гггг'; ДП=-");
				ПараметрыОбласти.Начислено		= ВыборкаВзаиморасчеты.Начислено;
				ПараметрыОбласти.Оплачено		= ВыборкаВзаиморасчеты.Оплачено;
				ПараметрыОбласти.Значение		= ВыборкаВзаиморасчеты.УслугаПредставление;
				ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ПараметрыОбласти);
				ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,2);				
			КонецЦикла;
		Иначе 
			ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти, 2);
		КонецЕсли;			
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	Возврат ТабДок;	
КонецФункции

Функция ТекстДеталиВзаиморасчетов()
	
	Текст 	= "ВЫБРАТЬ
	|	энргАвансы.Период,
	|	энргАвансы.Регистратор,
	|	энргАвансы.НомерСтроки
	|ПОМЕСТИТЬ РегистраторыАвансы
	|ИЗ
	|	РегистрНакопления.энргАвансы КАК энргАвансы
	|ГДЕ
	|	энргАвансы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргАвансы.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцам.Период,
	|	энргВзаиморасчетыПоМесяцам.Регистратор,
	|	энргВзаиморасчетыПоМесяцам.НомерСтроки
	|ПОМЕСТИТЬ РегистраторыВзаиморасчетыПоМесяцам
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
	|ГДЕ
	|	энргВзаиморасчетыПоМесяцам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргВзаиморасчетыПоМесяцам.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Абонент,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	ТаблицаРегистра.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаРегистра.Поставщик,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Поставщик) КАК ПоставщикПредставление,
	|	ТаблицаРегистра.Услуга,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Услуга) КАК УслугаПредставление,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ""Увеличение задолженности""
	|		ИНАЧЕ ""Уменьшение задолженности""
	|	КОНЕЦ КАК ПредставлениеСобытия,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТаблицаРегистра.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Начислено,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ТаблицаРегистра.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Оплачено
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК ТаблицаРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистраторыВзаиморасчетыПоМесяцам КАК РегистраторыВзаиморасчетыПоМесяцам
	|		ПО ТаблицаРегистра.Период = РегистраторыВзаиморасчетыПоМесяцам.Период
	|			И ТаблицаРегистра.Регистратор = РегистраторыВзаиморасчетыПоМесяцам.Регистратор
	|			И ТаблицаРегистра.НомерСтроки = РегистраторыВзаиморасчетыПоМесяцам.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Абонент,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Регистратор),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка),
	|	"""",
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ""Поступление аванса""
	|		ИНАЧЕ ""Использование аванса""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ТаблицаРегистра.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТаблицаРегистра.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.энргАвансы КАК ТаблицаРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистраторыАвансы КАК РегистраторыАвансы
	|		ПО ТаблицаРегистра.Период = РегистраторыАвансы.Период
	|			И ТаблицаРегистра.Регистратор = РегистраторыАвансы.Регистратор
	|			И ТаблицаРегистра.НомерСтроки = РегистраторыАвансы.НомерСтроки
	|ИТОГИ ПО
	|	Регистратор";
	
	Возврат Текст;
КонецФункции

Функция ТекстДеталиНачислений()
	Текст  =
	"ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	энргОбъемНачислений.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ОбъемыНачисленийРегистраторы
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	энргОбъемНачислений.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргОбъемНачислений.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНачислениеПени.Период КАК Период,
	|	энргНачислениеПени.Регистратор КАК Регистратор,
	|	энргНачислениеПени.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ОбъемыНачисленийПениРегистраторы
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК энргНачислениеПени
	|ГДЕ
	|	энргНачислениеПени.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргНачислениеПени.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачислений.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.Услуга) КАК УслугаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.ТочкаУчета) КАК ТочкаУчетаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.СпособНачисления) КАК ПредставлениеСобытия,
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.ПриборУчета) КАК ПриборУчетаПредставление,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.Поставщик) КАК ПоставщикПредставление,
	|	СУММА(энргОбъемНачислений.Сумма) КАК Начислено,
	|	СУММА(энргОбъемНачислений.ОбъемУслуги) КАК Расход,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
	|	МИНИМУМ(энргОбъемНачислений.НачальныеПоказания) КАК НачальныеПоказания,
	|	МАКСИМУМ(энргОбъемНачислений.КонечныеПоказания) КАК КонечныеПоказания
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыНачисленийРегистраторы КАК ОбъемыНачисленийРегистраторы
	|		ПО энргОбъемНачислений.Период = ОбъемыНачисленийРегистраторы.Период
	|			И энргОбъемНачислений.Регистратор = ОбъемыНачисленийРегистраторы.Регистратор
	|			И энргОбъемНачислений.НомерСтроки = ОбъемыНачисленийРегистраторы.НомерСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОбъемНачислений.Регистратор,
	|	энргОбъемНачислений.ЗначениеТарифа,
	|	энргОбъемНачислений.ПериодНачисления,
	|	энргОбъемНачислений.ПериодРасчета,
	|	энргОбъемНачислений.НачалоПериода,
	|	энргОбъемНачислений.КонецПериода,
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.Услуга),
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.ТочкаУчета),
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.СпособНачисления),
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(энргОбъемНачислений.Поставщик)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНачислениеПени.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(энргНачислениеПени.Услуга),
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	ПРЕДСТАВЛЕНИЕ(энргНачислениеПени.Поставщик),
	|	СУММА(энргНачислениеПени.Сумма),
	|	0,
	|	энргНачислениеПени.ПериодНачисления,
	|	энргНачислениеПени.ПериодРасчета,
	|	энргНачислениеПени.НачалоПериода,
	|	энргНачислениеПени.КонецПериода,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК энргНачислениеПени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыНачисленийПениРегистраторы КАК ОбъемыНачисленийПениРегистраторы
	|		ПО энргНачислениеПени.Период = ОбъемыНачисленийПениРегистраторы.Период
	|			И энргНачислениеПени.Регистратор = ОбъемыНачисленийПениРегистраторы.Регистратор
	|			И энргНачислениеПени.НомерСтроки = ОбъемыНачисленийПениРегистраторы.НомерСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Регистратор,
	|	энргНачислениеПени.ПериодРасчета,
	|	энргНачислениеПени.ПериодНачисления,
	|	энргНачислениеПени.НачалоПериода,
	|	энргНачислениеПени.КонецПериода,
	|	ПРЕДСТАВЛЕНИЕ(энргНачислениеПени.Услуга),
	|	ПРЕДСТАВЛЕНИЕ(энргНачислениеПени.Поставщик)
	|ИТОГИ ПО
	|	Регистратор";
	Возврат Текст;
КонецФункции

Функция СоотвествиеДеталиВзаиморасчеты(результатВзаиморасчеты)
	Соотвествие  				= Новый Соответствие;
	ВыборкаРегистратор 		 	= результатВзаиморасчеты.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОписаниеСтроки 				= Новый ФиксированнаяСтруктура("ПредставлениеСобытия,ПериодНачисления,Услуга,УслугаПредставление,Поставщик,ПоставщикПредставление,Начислено,Оплачено"); 
	
	Пока ВыборкаРегистратор.следующий() цикл
		
		Детали  				= ВыборкаРегистратор.выбрать();
		ДеталиМассив  			= Новый Массив;
		Пока Детали.следующий() цикл
			ДанныеСтроки  	= Новый Структура(ОписаниеСтроки);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,Детали);
			ДеталиМассив.Добавить(ДанныеСтроки);
		КонецЦикла; 		   
		Соотвествие.Вставить(ВыборкаРегистратор.Регистратор,ДеталиМассив);		   
	КонецЦикла;
	
	Возврат Соотвествие;	
	
КонецФункции  

Функция СоотвествиеДеталиНачислений(РезультатНачисления)
	
	Соотвествие  				= Новый Соответствие;
	ВыборкаРегистратор 		 	= РезультатНачисления.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОписаниеСтроки 				= Новый ФиксированнаяСтруктура("
	|ПредставлениеСобытия,ПериодНачисления,ПериодРасчета,
	|УслугаПредставление,ТочкаУчетаПредставление,
	|ПоставщикПредставление,ЗначениеТарифа,
	|ПриборУчетаПредставление,
	|НачалоПериода,КонецПериода,
	|НачальныеПоказания,КонечныеПоказания,
	|Расход,Начислено"); 
	
	Пока ВыборкаРегистратор.следующий() цикл
		
		Детали  				= ВыборкаРегистратор.выбрать();
		ДеталиМассив  			= Новый Массив;
		Пока Детали.следующий() цикл
			ДанныеСтроки  		= Новый Структура(ОписаниеСтроки);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,Детали);
			ДанныеСтроки.НачальныеПоказания = ФорматироватьПоказания(Детали, Детали.НачальныеПоказания);
			ДанныеСтроки.КонечныеПоказания = ФорматироватьПоказания(Детали, Детали.КонечныеПоказания);
			ДеталиМассив.Добавить(ДанныеСтроки);
		КонецЦикла; 		   
		Соотвествие.Вставить(ВыборкаРегистратор.Регистратор,ДеталиМассив);		   
	КонецЦикла;
	
	Возврат Соотвествие; 	
	
КонецФункции

Функция СоотвествиеИтогиВзаиморасчетов(РезультатИтогиВзаиморасчетов) 
	
	Соотвествие  				= Новый Соответствие;
	
	СоотвествиеИтоги 			= Новый Соответствие;
	
	
	ВыборкаПериодНачисления	 	= РезультатИтогиВзаиморасчетов.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОписаниеСтроки 				= Новый ФиксированнаяСтруктура(ПараметрыОбласти("ВзаиморасчетыСтрока"));	
	Пока ВыборкаПериодНачисления.следующий() цикл
		ДанныеСтроки  			= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ВыборкаПериодНачисления);
		СоотвествиеИтоги.Вставить(ВыборкаПериодНачисления.ПериодРасчетов,ДанныеСтроки);
		Детали  				= ВыборкаПериодНачисления.выбрать();
		ДеталиМассив  			= Новый Массив;
		Пока Детали.следующий() цикл
			
			//Если Детали.ОстатокКонДт = 0 И  Детали.ОстатокКонДтМор = 0 И Детали.ОстатокКонДтРест = 0 И Детали.ОстатокКонКт = 0
			//	И Детали.ОстатокНачДт = 0 И  Детали.ОстатокНачДтМор = 0 И Детали.ОстатокНачДтРест = 0 И Детали.ОстатокНачКт = 0 И Детали.Оплачено = 0 Тогда
			//	Продолжить;
			//КонецЕсли;
			
			ДанныеСтроки  		= Новый Структура(ОписаниеСтроки);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,Детали);
			ДеталиМассив.Добавить(ДанныеСтроки);
		КонецЦикла; 		   
		Соотвествие.Вставить(ВыборкаПериодНачисления.ПериодРасчетов,ДеталиМассив);		   
	КонецЦикла;
	
	Возврат Новый Структура("Детали,Итоги",Соотвествие,СоотвествиеИтоги); 
	
КонецФункции

Функция ПараметрыОбласти(ИмяОбласти)
	
	Если ИмяОбласти = "СтрокаСобытия"  тогда
		Возврат 
		Новый Структура("
		|Событие,ТочкаУчета,Регистратор,
		|Период,Начислено,Оплачено");
	ИначеЕсли ИмяОбласти = "Расшифровка" тогда
		Возврат
		Новый Структура("
		|Событие,Период,
		|ДопЗначение,ЗначениеТарифа,
		|Начислено,Расход,НачПок,КонПок,Оплачено,
		|Значение,ТочкаУчета,ПриборУчета,ТипПрибора");
	ИначеЕсли ИмяОбласти = "ВзаиморасчетыСтрока" тогда
		Возврат 
		Новый Структура("
		|Поставщик,ПериодНачисления,Услуга,ОстатокНачДт,ОстатокНачКт,
		|НачисленноСумма,НачисленноОбъем,Оплачено,
		|ИспользованоИзАвансов,ОстатокКонДт,ОстатокКонКт,
		|ОстатокНачДтМор,ОстатокНачДтРест,ОстатокКонДтМор,ОстатокКонДтРест,ОстатокНачДтИтого,ОстатокКонДтИтого,Статус,ОстатокКонДтПеня");	
	ИначеЕсли ИмяОбласти = "ВзаиморасчетыИтогПериод" тогда
		Возврат 
		Новый Структура("
		|ОстатокНачДт,ОстатокНачКт,
		|НачисленноСумма,НачисленноОбъем,Оплачено,
		|ИспользованоИзАвансов,ОстатокКонДт,ОстатокКонКт,
		|ОстатокНачДтМор,ОстатокНачДтРест,ОстатокКонДтМор,ОстатокКонДтРест,ОстатокНачДтИтого,ОстатокКонДтИтого");		
	КонецЕсли;	 
	
КонецФункции

Функция ТекстНачальныеПоказатели()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Период КАК Период,
	|	энргПоказанияПриборовУчета.Регистратор КАК Регистратор,
	|	энргПоказанияПриборовУчета.Разделитель КАК Разделитель,
	|	энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|	энргПоказанияПриборовУчета.Показание КАК Показание,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	энргПоказанияПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПриборовУчета.ПериодРегистрации КАК ПериодРегистрации
	|ПОМЕСТИТЬ Набор
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|ГДЕ
	|	энргПоказанияПриборовУчета.Организация = &Организация
	|	И энргПоказанияПриборовУчета.Район = &Район
	|	И энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения
	|	И энргПоказанияПриборовУчета.Период < &Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(Набор.Период) КАК Период
	|ПОМЕСТИТЬ МаксимальнаяДатаРегистратора
	|ИЗ
	|	Набор КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|	МаксимальнаяДатаРегистратора.Период КАК Период,
	|	МАКСИМУМ(Набор.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ МаксимумРегистратор
	|ИЗ
	|	МаксимальнаяДатаРегистратора КАК МаксимальнаяДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Набор КАК Набор
	|		ПО МаксимальнаяДатаРегистратора.ПриборУчета = Набор.ПриборУчета
	|			И МаксимальнаяДатаРегистратора.Период = Набор.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаРегистратора.Период,
	|	МаксимальнаяДатаРегистратора.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимумРегистратор.ПриборУчета КАК ПриборУчета,
	|	МаксимумРегистратор.Период КАК Период,
	|	МаксимумРегистратор.Регистратор КАК Регистратор,
	|	МАКСИМУМ(Набор.Разделитель) КАК Разделитель
	|ПОМЕСТИТЬ МаксимумРазделить
	|ИЗ
	|	МаксимумРегистратор КАК МаксимумРегистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Набор КАК Набор
	|		ПО МаксимумРегистратор.ПриборУчета = Набор.ПриборУчета
	|			И МаксимумРегистратор.Период = Набор.Период
	|			И МаксимумРегистратор.Регистратор = Набор.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимумРегистратор.Регистратор,
	|	МаксимумРегистратор.ПриборУчета,
	|	МаксимумРегистратор.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Период КАК Период,
	|	Набор.Регистратор КАК Регистратор,
	|	Набор.Разделитель КАК Разделитель,
	|	Набор.Переворот КАК Переворот,
	|	Набор.Показание КАК Показание,
	|	Набор.СостояниеПоказаний КАК СостояниеПоказаний,
	|	Набор.ПериодНачисления КАК ПериодНачисления,
	|	Набор.ПериодРегистрации КАК ПериодРегистрации
	|ПОМЕСТИТЬ энргПоказанияПриборовУчетаСрезПоследних
	|ИЗ
	|	Набор КАК Набор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимумРазделить КАК МаксимумРазделить
	|		ПО Набор.ПриборУчета = МаксимумРазделить.ПриборУчета
	|			И Набор.Период = МаксимумРазделить.Период
	|			И Набор.Регистратор = МаксимумРазделить.Регистратор
	|			И Набор.Разделитель = МаксимумРазделить.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	ТаблицаРегистра.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаРегистра.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВидыБлагоустройстваАбонентов
	|ИЗ
	|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыБлагоустройстваАбонентов.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВидыБлагоустройстваАбонентов.Период КАК Период,
	|	ВидыБлагоустройстваАбонентов.Регистратор КАК Регистратор,
	|	ВидыБлагоустройстваАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	ВидыБлагоустройстваАбонентов.ПериодРегистрации КАК ПериодРегистрации,
	|	0 КАК НормаХВС,
	|	0 КАК НормаПолив,
	|	ВидыБлагоустройстваАбонентов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВидыБлагоустройстваАбонентовСНормами
	|ИЗ
	|	ВидыБлагоустройстваАбонентов КАК ВидыБлагоустройстваАбонентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Набор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимальнаяДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВидыБлагоустройстваАбонентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРазделить
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Состояние КАК Значение,
	|	"""" КАК ДопЗначение1,
	|	"""" КАК ПриборУчетаПредставление,
	|	"""" КАК ТипПрибораУчетаПредставление,
	|	"""" КАК ТочкаУчетаПредставление,
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка) КАК ТочкаУчета,
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Регистратор КАК Регистратор,
	|	""Изменение состояния лицевого счета"" КАК ПредставлениеСобытия,
	|	ТаблицаРегистра.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации КАК ПериодРегистрации,
	|	0 КАК КонечныеПоказания,
	|	NULL КАК ДопЗначение4,
	|	NULL КАК ДопЗначение5
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент = &Абонент) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Услуга),
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ТочкаУчета),
	|	ТаблицаРегистра.ТочкаУчета,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменение услуги точки учета"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Состояние),
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ТочкаУчета),
	|	ТаблицаРегистра.ТочкаУчета,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменение сост-я пр-ра учета"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУчетаАбонента.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Коэффициент,
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменение р-го к-та прибора учета"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Состояние,
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ТочкаУчета),
	|	ТаблицаРегистра.ТочкаУчета,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменения состояния услуги"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ДатаПоверки,
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Регистрация изменения даты поверки"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргДатыПоверкиПрибораУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.СостояниеПоказаний),
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета),
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.ПриборУчета.ТипПрибораУчета),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Регистрация показаний пр-ра учета"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	ТаблицаРегистра.Показание,
	|	NULL,
	|	NULL
	|ИЗ
	|	энргПоказанияПриборовУчетаСрезПоследних КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВидыБлагоустройстваАбонентовСНормами.ВидБлагоустройства, """"),
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ВидыБлагоустройстваАбонентовСНормами.Услуга),
	|	ВидыБлагоустройстваАбонентовСНормами.Услуга,
	|	ВидыБлагоустройстваАбонентовСНормами.Период,
	|	ВидыБлагоустройстваАбонентовСНормами.Регистратор,
	|	""Изменение вида благоустройства"",
	|	ВидыБлагоустройстваАбонентовСНормами.ПериодНачисления,
	|	ВидыБлагоустройстваАбонентовСНормами.ПериодРегистрации,
	|	0,
	|	ЕСТЬNULL(ВидыБлагоустройстваАбонентовСНормами.НормаХВС, 0),
	|	ЕСТЬNULL(ВидыБлагоустройстваАбонентовСНормами.НормаПолив, 0)
	|ИЗ
	|	ВидыБлагоустройстваАбонентовСНормами КАК ВидыБлагоустройстваАбонентовСНормами
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.ГруппаПотребителей,
	|	"""",
	|	"""",
	|	"""",
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Услуга),
	|	ТаблицаРегистра.Услуга,
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменение тарифной группы потребителя"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Площадь,
	|	ТаблицаРегистра.ВидПлощади,
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменение площади абонента"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Количество,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменение количества комнат"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргКоличествоКомнат.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Количество,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка),
	|	ТаблицаРегистра.Период,
	|	ТаблицаРегистра.Регистратор,
	|	""Изменение количества прописанных"",
	|	ТаблицаРегистра.ПериодНачисления,
	|	ТаблицаРегистра.ПериодРегистрации,
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.СуммаОстаток,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО,
	|	""Задолженность на начало периода"",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчеты.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК ТаблицаРегистра";
	
	Возврат  Текст;
	
КонецФункции

Функция ТекстНачальныеДеталиВзаиморасчетов()
	Текст 	= "ВЫБРАТЬ
	|	""Задолженность"" КАК Событие,
	|	ТаблицаРегистра.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаРегистра.Поставщик КАК Поставщик,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Поставщик) КАК ПоставщикПредставление,
	|	ТаблицаРегистра.Услуга КАК Услуга,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Услуга) КАК УслугаПредставление,
	|	ТаблицаРегистра.СуммаОстаток КАК Начислено,
	|	0 КАК Оплачено
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Аванс"",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка),
	|	"""",
	|	0,
	|	ТаблицаРегистра.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.энргАвансы.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК ТаблицаРегистра";
	
	Возврат Текст;
КонецФункции

Функция ТекстОстаткиГраницыПериодаНачисления(ПараметрыОтчета) 
	
	ПериодНачисленияНачало 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.Организация,ПараметрыОтчета.Район);
	ПериодНачисленияКонец  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПараметрыОтчета.КонецПериода, ПараметрыОтчета.Организация,ПараметрыОтчета.Район);
	
	ПараметрыОПКонец			= энргНачисления.ГраницыОтчетногоПериода(ПараметрыОтчета.Организация,ПараметрыОтчета.Район, ПериодНачисленияНачало);
	ПараметрыОПНачало			= энргНачисления.ГраницыОтчетногоПериода(ПараметрыОтчета.Организация,ПараметрыОтчета.Район, ПериодНачисленияКонец);	
	
	ТекстГраницыПериодов 		= "ВЫБРАТЬ * ПОМЕСТИТЬ ГраницыОтчетногоПериода  ИЗ (" + энргНачисления.ТекстГраницОтчетногоПериода(ПериодНачисленияНачало,ПериодНачисленияКонец,Ложь) + ") КАК ВложенныйЗапрос";
	
	ОсновнойТекст  				 = 
	"ВЫБРАТЬ
	|	&ПериодНачисленияНачало КАК Период,
	|	энргАвансыОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ АвансыОстатки
	|ИЗ
	|	РегистрНакопления.энргАвансы.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргАвансыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАвансыОбороты.Период КАК Период,
	|	энргАвансыОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ АвансыОбороты
	|ИЗ
	|	РегистрНакопления.энргАвансы.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргАвансыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисленияНачало КАК Период,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик,
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК СуммаОстаток,
	|	0 КАК СуммаОстатокМор,
	|	0 КАК СуммаОстатокРест
	|ПОМЕСТИТЬ УслугиОстатки
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоМесяцамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодНачисленияНачало,
	|	энргЗабалансоваяЗадолженностьОстатки.Услуга,
	|	энргЗабалансоваяЗадолженностьОстатки.ПериодНачисления,
	|	энргЗабалансоваяЗадолженностьОстатки.Поставщик,
	|	0,
	|	ВЫБОР
	|		КОГДА энргЗабалансоваяЗадолженностьОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность)
	|			ТОГДА энргЗабалансоваяЗадолженностьОстатки.СуммаЗадолженностиОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА энргЗабалансоваяЗадолженностьОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность)
	|			ТОГДА энргЗабалансоваяЗадолженностьОстатки.СуммаЗадолженностиОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.энргЗабалансоваяЗадолженность.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))) КАК энргЗабалансоваяЗадолженностьОстатки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА энргЗабалансоваяЗадолженностьОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность)
	|				ТОГДА &МораторнаяЗадолженность
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА энргЗабалансоваяЗадолженностьОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность)
	|				ТОГДА &РеструктуризированнаяЗадолженность
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисленияНачало КАК Период,
	|	энргВзаиморасчетыПоПениОстатки.Услуга.Наименование + ""(Пеня)"" КАК Услуга,
	|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления КАК ПериодНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка) КАК Поставщик,
	|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток КАК СуммаОстаток,
	|	0 КАК СуммаОстатокМор,
	|	0 КАК СуммаОстатокРест
	|ПОМЕСТИТЬ УслугиПеняОстатки
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоПениОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОбороты.Период КАК Период,
	|	энргВзаиморасчетыПоМесяцамОбороты.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОбороты.Поставщик КАК Поставщик,
	|	энргВзаиморасчетыПоМесяцамОбороты.СуммаОборот КАК СуммаОборот,
	|	0 КАК СуммаОборотМор,
	|	0 КАК СуммаОборотРест
	|ПОМЕСТИТЬ УслугиОбороты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоМесяцамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗабалансоваяЗадолженностьОбороты.Период,
	|	энргЗабалансоваяЗадолженностьОбороты.Услуга,
	|	энргЗабалансоваяЗадолженностьОбороты.ПериодНачисления,
	|	энргЗабалансоваяЗадолженностьОбороты.Поставщик,
	|	0,
	|	ВЫБОР
	|		КОГДА энргЗабалансоваяЗадолженностьОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность)
	|			ТОГДА энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА энргЗабалансоваяЗадолженностьОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность)
	|			ТОГДА энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.энргЗабалансоваяЗадолженность.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))) КАК энргЗабалансоваяЗадолженностьОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА энргЗабалансоваяЗадолженностьОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность)
	|				ТОГДА &МораторнаяЗадолженность
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА энргЗабалансоваяЗадолженностьОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность)
	|				ТОГДА &РеструктуризированнаяЗадолженность
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоПениОбороты.Период КАК Период,
	|	энргВзаиморасчетыПоПениОбороты.Услуга.Наименование + ""(Пеня)"" КАК Услуга,
	|	энргВзаиморасчетыПоПениОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка) КАК Поставщик,
	|	энргВзаиморасчетыПоПениОбороты.СуммаОборот КАК СуммаОборот,
	|	0 КАК СуммаОборотМор,
	|	0 КАК СуммаОборотРест
	|ПОМЕСТИТЬ УслугиПеняОбороты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоПениОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(ВложенныйЗапрос.ОстатокНач) КАК ОстатокНач,
	|	СУММА(ВложенныйЗапрос.ОстатокКон) КАК ОстатокКон
	|ПОМЕСТИТЬ ОстаткиАванса
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодНачисления,
	|		АвансыОстатки.СуммаОстаток КАК ОстатокНач,
	|		0 КАК ОстатокКон
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОстатки КАК АвансыОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления >= АвансыОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		АвансыОбороты.СуммаОборот,
	|		0
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОбороты КАК АвансыОбороты
	|			ПО ГраницыОтчетногоПериода.НачалоОП > АвансыОбороты.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		0,
	|		АвансыОстатки.СуммаОстаток
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОстатки КАК АвансыОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления >= АвансыОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		0,
	|		АвансыОбороты.СуммаОборот
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОбороты КАК АвансыОбороты
	|			ПО ГраницыОтчетногоПериода.ЗавершениеОП > АвансыОбороты.Период) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодРасчета КАК ПериодРасчета,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	СУММА(ВложенныйЗапрос.ОстатокНач) КАК ОстатокНач,
	|	СУММА(ВложенныйЗапрос.ОстатокКон) КАК ОстатокКон,
	|	СУММА(ВложенныйЗапрос.ОстатокНачМор) КАК ОстатокНачМор,
	|	СУММА(ВложенныйЗапрос.ОстатокНачРест) КАК ОстатокНачРест,
	|	СУММА(ВложенныйЗапрос.ОстатокКонМор) КАК ОстатокКонМор,
	|	СУММА(ВложенныйЗапрос.ОстатокКонРест) КАК ОстатокКонРест
	|ПОМЕСТИТЬ ОстаткиУслуги
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодРасчета,
	|		УслугиОстатки.Услуга КАК Услуга,
	|		УслугиОстатки.ПериодНачисления КАК ПериодНачисления,
	|		УслугиОстатки.Поставщик КАК Поставщик,
	|		УслугиОстатки.СуммаОстаток КАК ОстатокНач,
	|		0 КАК ОстатокКон,
	|		УслугиОстатки.СуммаОстатокМор КАК ОстатокНачМор,
	|		УслугиОстатки.СуммаОстатокРест КАК ОстатокНачРест,
	|		0 КАК ОстатокКонМор,
	|		0 КАК ОстатокКонРест
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОстатки КАК УслугиОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления >= УслугиОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиОбороты.Услуга,
	|		УслугиОбороты.ПериодНачисления,
	|		УслугиОбороты.Поставщик,
	|		УслугиОбороты.СуммаОборот,
	|		0,
	|		УслугиОбороты.СуммаОборотМор,
	|		УслугиОбороты.СуммаОборотРест,
	|		0,
	|		0
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОбороты КАК УслугиОбороты
	|			ПО ГраницыОтчетногоПериода.НачалоОП > УслугиОбороты.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиОстатки.Услуга,
	|		УслугиОстатки.ПериодНачисления,
	|		УслугиОстатки.Поставщик,
	|		0,
	|		УслугиОстатки.СуммаОстаток,
	|		0,
	|		0,
	|		УслугиОстатки.СуммаОстатокМор,
	|		УслугиОстатки.СуммаОстатокРест
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОстатки КАК УслугиОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления >= УслугиОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиОбороты.Услуга,
	|		УслугиОбороты.ПериодНачисления,
	|		УслугиОбороты.Поставщик,
	|		0,
	|		УслугиОбороты.СуммаОборот,
	|		0,
	|		0,
	|		УслугиОбороты.СуммаОборотМор,
	|		УслугиОбороты.СуммаОборотРест
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиОбороты КАК УслугиОбороты
	|			ПО ГраницыОтчетногоПериода.ЗавершениеОП > УслугиОбороты.Период) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодРасчета,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодРасчета КАК ПериодРасчета,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	СУММА(ВложенныйЗапрос.ОстатокНач) КАК ОстатокНач,
	|	СУММА(ВложенныйЗапрос.ОстатокКон) КАК ОстатокКон,
	|	СУММА(ВложенныйЗапрос.ОстатокНачМор) КАК ОстатокНачМор,
	|	СУММА(ВложенныйЗапрос.ОстатокНачРест) КАК ОстатокНачРест,
	|	СУММА(ВложенныйЗапрос.ОстатокКонМор) КАК ОстатокКонМор,
	|	СУММА(ВложенныйЗапрос.ОстатокКонРест) КАК ОстатокКонРест
	|ПОМЕСТИТЬ ОстаткиУслугиПеня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления КАК ПериодРасчета,
	|		УслугиПеняОстатки.Услуга КАК Услуга,
	|		УслугиПеняОстатки.ПериодНачисления КАК ПериодНачисления,
	|		УслугиПеняОстатки.Поставщик КАК Поставщик,
	|		УслугиПеняОстатки.СуммаОстаток КАК ОстатокНач,
	|		0 КАК ОстатокКон,
	|		УслугиПеняОстатки.СуммаОстатокМор КАК ОстатокНачМор,
	|		УслугиПеняОстатки.СуммаОстатокРест КАК ОстатокНачРест,
	|		0 КАК ОстатокКонМор,
	|		0 КАК ОстатокКонРест
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиПеняОстатки КАК УслугиПеняОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления >= УслугиПеняОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиПеняОбороты.Услуга,
	|		УслугиПеняОбороты.ПериодНачисления,
	|		УслугиПеняОбороты.Поставщик,
	|		УслугиПеняОбороты.СуммаОборот,
	|		0,
	|		УслугиПеняОбороты.СуммаОборотМор,
	|		УслугиПеняОбороты.СуммаОборотРест,
	|		0,
	|		0
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиПеняОбороты КАК УслугиПеняОбороты
	|			ПО ГраницыОтчетногоПериода.НачалоОП > УслугиПеняОбороты.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиПеняОстатки.Услуга,
	|		УслугиПеняОстатки.ПериодНачисления,
	|		УслугиПеняОстатки.Поставщик,
	|		0,
	|		УслугиПеняОстатки.СуммаОстаток,
	|		0,
	|		0,
	|		УслугиПеняОстатки.СуммаОстатокМор,
	|		УслугиПеняОстатки.СуммаОстатокРест
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиПеняОстатки КАК УслугиПеняОстатки
	|			ПО ГраницыОтчетногоПериода.ПериодНачисления >= УслугиПеняОстатки.Период
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГраницыОтчетногоПериода.ПериодНачисления,
	|		УслугиПеняОбороты.Услуга,
	|		УслугиПеняОбороты.ПериодНачисления,
	|		УслугиПеняОбороты.Поставщик,
	|		0,
	|		УслугиПеняОбороты.СуммаОборот,
	|		0,
	|		0,
	|		УслугиПеняОбороты.СуммаОборотМор,
	|		УслугиПеняОбороты.СуммаОборотРест
	|	ИЗ
	|		ГраницыОтчетногоПериода КАК ГраницыОтчетногоПериода
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиПеняОбороты КАК УслугиПеняОбороты
	|			ПО ГраницыОтчетногоПериода.ЗавершениеОП > УслугиПеняОбороты.Период) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодРасчета,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийОбороты.ПериодРасчета КАК ПериодРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(энргСпособыРаспределенияОплатыСрезПоследних.ПерерасчетыВключатьВРасчетныйПериод, ЛОЖЬ)
	|			ТОГДА энргОбъемНачисленийОбороты.ПериодРасчета
	|		ИНАЧЕ энргОбъемНачисленийОбороты.ПериодНачисления
	|	КОНЕЦ КАК ПериодНачисления,
	|	энргОбъемНачисленийОбороты.СуммаОборот КАК НачисленноСумма,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиОборот КАК НачисленноОбъем
	|ПОМЕСТИТЬ НачисленныйОбъем
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Строение = &Строение
	|				И Помещение = &Помещение
	|				И Абонент = &Абонент) КАК энргОбъемНачисленийОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРаспределенияОплаты.СрезПоследних(&КонецПериода, Организация = &Организация) КАК энргСпособыРаспределенияОплатыСрезПоследних
	|		ПО энргОбъемНачисленийОбороты.Организация = энргСпособыРаспределенияОплатыСрезПоследних.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНачислениеПениОбороты.Услуга.Наименование + ""(Пеня)"" КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка) КАК Поставщик,
	|	энргНачислениеПениОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргНачислениеПениОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргНачислениеПениОбороты.СуммаОборот КАК НачисленноСумма,
	|	0 КАК НачисленноОбъем
	|ПОМЕСТИТЬ НачисленныйОбъемПеня
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент = &Абонент) КАК энргНачислениеПениОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОплатаУслугОбороты.Услуга КАК Услуга,
	|	энргОплатаУслугОбороты.Поставщик КАК Поставщик,
	|	энргОплатаУслугОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОплатаУслугОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОплатаУслугОбороты.СуммаОборот КАК Оплачено
	|ПОМЕСТИТЬ ДанныеОплаты
	|ИЗ
	|	РегистрНакопления.энргОплатаУслуг.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргОплатаУслугОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОплатаПениОбороты.Услуга.Наименование + ""(Пеня)"" КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка) КАК Поставщик,
	|	энргОплатаПениОбороты.ПериодРасчета КАК ПериодРасчета,
	|	энргОплатаПениОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргОплатаПениОбороты.СуммаОборот КАК Оплачено
	|ПОМЕСТИТЬ ДанныеОплатыПеня
	|ИЗ
	|	РегистрНакопления.энргОплатаПени.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргОплатаПениОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ээнргАвансыИспользованныеОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	|			ТОГДА ээнргАвансыИспользованныеОбороты.Услуга.Наименование + ""(Пеня)""
	|		ИНАЧЕ ээнргАвансыИспользованныеОбороты.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВЫБОР
	|		КОГДА ээнргАвансыИспользованныеОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
	|		ИНАЧЕ ээнргАвансыИспользованныеОбороты.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ээнргАвансыИспользованныеОбороты.ПериодРасчета КАК ПериодРасчета,
	|	ээнргАвансыИспользованныеОбороты.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(ээнргАвансыИспользованныеОбороты.СуммаОборот) КАК ИспользованноСумма
	|ПОМЕСТИТЬ ИспользованиеАванса
	|ИЗ
	|	РегистрНакопления.энргАвансыИспользованные.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК ээнргАвансыИспользованныеОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ээнргАвансыИспользованныеОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	|			ТОГДА ээнргАвансыИспользованныеОбороты.Услуга.Наименование + ""(Пеня)""
	|		ИНАЧЕ ээнргАвансыИспользованныеОбороты.Услуга
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ээнргАвансыИспользованныеОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
	|		ИНАЧЕ ээнргАвансыИспользованныеОбороты.Поставщик
	|	КОНЕЦ,
	|	ээнргАвансыИспользованныеОбороты.ПериодРасчета,
	|	ээнргАвансыИспользованныеОбороты.ПериодНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Аванс"",
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка),
	|	ээнргАвансыИспользованныеОбороты.ПериодРасчета,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	-ээнргАвансыИспользованныеОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.энргАвансыИспользованные.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК ээнргАвансыИспользованныеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАвансыПоступившиеОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргАвансыПоступившиеОбороты.СуммаОборот КАК ПоступлениеАвансаСумма
	|ПОМЕСТИТЬ АвансыПоступившие
	|ИЗ
	|	РегистрНакопления.энргАвансыПоступившие.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргАвансыПоступившиеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Аванс"" КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПУстаяСсылка) КАК Поставщик,
	|	энргАвансыПоступившиеОбороты.ПериодНачисления КАК ПериодРасчета,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНачисления,
	|	энргАвансыПоступившиеОбороты.СуммаОборот КАК ИспользованноСумма
	|ПОМЕСТИТЬ Поступление
	|ИЗ
	|	РегистрНакопления.энргАвансыПоступившие.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргАвансыПоступившиеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргСтатусыСудебныхДелСрезПоследних.Период, МЕСЯЦ) КАК Период,
	|	энргСтатусыСудебныхДелСрезПоследних.Статус КАК Статус,
	|	энргСтатусыСудебныхДелСрезПоследних.СудебноеДело.Абонент КАК СудебноеДелоАбонент,
	|	энргСтатусыСудебныхДелСрезПоследних.Период КАК ПериодДата,
	|	энргСтатусыСудебныхДелСрезПоследних.СудебноеДело КАК СудебноеДело
	|ПОМЕСТИТЬ СтатусыСудебныхДел
	|ИЗ
	|	РегистрСведений.энргСтатусыСудебныхДел.СрезПоследних(, СудебноеДело.Абонент = &Абонент) КАК энргСтатусыСудебныхДелСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(СтатусыСудебныхДел.Период) КАК Период,
	|	СтатусыСудебныхДел.СудебноеДелоАбонент КАК СудебноеДелоАбонент,
	|	МАКСИМУМ(СтатусыСудебныхДел.ПериодДата) КАК ПериодДата
	|ПОМЕСТИТЬ ПоследнийСтатусВМесяце
	|ИЗ
	|	СтатусыСудебныхДел КАК СтатусыСудебныхДел
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыСудебныхДел.СудебноеДелоАбонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыСудебныхДел.Период КАК Период,
	|	СтатусыСудебныхДел.Статус КАК Статус,
	|	СтатусыСудебныхДел.СудебноеДело.ПериодЗадолженностиНачало КАК СудебноеДелоПериодЗадолженностиНачало,
	|	СтатусыСудебныхДел.СудебноеДело.ПериодЗадолженностиКонец КАК СудебноеДелоПериодЗадолженностиКонец
	|ПОМЕСТИТЬ СтатусИтог
	|ИЗ
	|	ПоследнийСтатусВМесяце КАК ПоследнийСтатусВМесяце
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатусыСудебныхДел КАК СтатусыСудебныхДел
	|		ПО ПоследнийСтатусВМесяце.Период = СтатусыСудебныхДел.Период
	|			И ПоследнийСтатусВМесяце.СудебноеДелоАбонент = СтатусыСудебныхДел.СудебноеДелоАбонент
	|			И ПоследнийСтатусВМесяце.ПериодДата = СтатусыСудебныхДел.ПериодДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗАпрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗАпрос.ПериодРасчета КАК ПериодРасчетов,
	|	ВложенныйЗАпрос.Услуга КАК Услуга,
	|	ВложенныйЗАпрос.Поставщик КАК Поставщик,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачДт) КАК ОстатокНачДт,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачКт) КАК ОстатокНачКт,
	|	СУММА(ВложенныйЗАпрос.НачисленноСумма) КАК НачисленноСумма,
	|	СУММА(ВложенныйЗАпрос.НачисленноОбъем) КАК НачисленноОбъем,
	|	СУММА(ВложенныйЗАпрос.Оплачено) КАК Оплачено,
	|	СУММА(ВложенныйЗАпрос.использованоИзАвансов) КАК использованоИзАвансов,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонДт) КАК ОстатокКонДт,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонКт) КАК ОстатокКонКт,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачМор) КАК ОстатокНачДтМор,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачРест) КАК ОстатокНачДтРест,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонМор) КАК ОстатокКонДтМор,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонРест) КАК ОстатокКонДтРест,
	|	СУММА(ВложенныйЗАпрос.ОстатокНачДт + ВложенныйЗАпрос.ОстатокНачМор + ВложенныйЗАпрос.ОстатокНачРест) КАК ОстатокНачДтИтого,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонДт + ВложенныйЗАпрос.ОстатокКонМор + ВложенныйЗАпрос.ОстатокКонРест) КАК ОстатокКонДтИтого,
	|	МАКСИМУМ(СтатусИтог.Статус) КАК Статус,
	|	СУММА(ВложенныйЗАпрос.ОстатокКонДтПеня) КАК ОстатокКонДтПеня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиАванса.ПериодНачисления КАК ПериодРасчета,
	|		ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНачисления,
	|		0 КАК ОстатокНачДт,
	|		ОстаткиАванса.ОстатокНач КАК ОстатокНачКт,
	|		0 КАК ОстатокКонДт,
	|		ОстаткиАванса.ОстатокКон КАК ОстатокКонКт,
	|		""Аванс"" КАК Услуга,
	|		ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка) КАК Поставщик,
	|		0 КАК НачисленноСумма,
	|		0 КАК НачисленноОбъем,
	|		0 КАК Оплачено,
	|		0 КАК использованоИзАвансов,
	|		0 КАК ОстатокНачМор,
	|		0 КАК ОстатокНачРест,
	|		0 КАК ОстатокКонМор,
	|		0 КАК ОстатокКонРест,
	|		0 КАК ОстатокКонДтПеня
	|	ИЗ
	|		ОстаткиАванса КАК ОстаткиАванса
	|	ГДЕ
	|		(ОстаткиАванса.ОстатокНач <> 0
	|				ИЛИ ОстаткиАванса.ОстатокКон <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиУслуги.ПериодРасчета,
	|		ОстаткиУслуги.ПериодНачисления,
	|		ВЫБОР
	|			КОГДА ОстаткиУслуги.ОстатокНачРест > ОстаткиУслуги.ОстатокНач
	|				ТОГДА 0
	|			ИНАЧЕ ОстаткиУслуги.ОстатокНач - ОстаткиУслуги.ОстатокНачРест
	|		КОНЕЦ,
	|		0,
	|		ВЫБОР
	|			КОГДА ОстаткиУслуги.ОстатокКонРест >= ОстаткиУслуги.ОстатокКон
	|				ТОГДА 0
	|			ИНАЧЕ ОстаткиУслуги.ОстатокКон - ОстаткиУслуги.ОстатокКонРест
	|		КОНЕЦ,
	|		0,
	|		ОстаткиУслуги.Услуга,
	|		ОстаткиУслуги.Поставщик,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОстаткиУслуги.ОстатокНачМор,
	|		ОстаткиУслуги.ОстатокНачРест,
	|		ОстаткиУслуги.ОстатокКонМор,
	|		ОстаткиУслуги.ОстатокКонРест,
	|		0
	|	ИЗ
	|		ОстаткиУслуги КАК ОстаткиУслуги
	|	ГДЕ
	|		(ОстаткиУслуги.ОстатокНач <> 0
	|				ИЛИ ОстаткиУслуги.ОстатокКон <> 0
	|				ИЛИ ОстаткиУслуги.ОстатокНачМор <> 0
	|				ИЛИ ОстаткиУслуги.ОстатокНачРест <> 0
	|				ИЛИ ОстаткиУслуги.ОстатокКонМор <> 0
	|				ИЛИ ОстаткиУслуги.ОстатокКонРест <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиУслугиПеня.ПериодРасчета,
	|		ОстаткиУслугиПеня.ПериодНачисления,
	|		ВЫБОР
	|			КОГДА ОстаткиУслугиПеня.ОстатокНачРест > ОстаткиУслугиПеня.ОстатокНач
	|				ТОГДА 0
	|			ИНАЧЕ ОстаткиУслугиПеня.ОстатокНач - ОстаткиУслугиПеня.ОстатокНачРест
	|		КОНЕЦ,
	|		0,
	|		ВЫБОР
	|			КОГДА ОстаткиУслугиПеня.ОстатокКонРест >= ОстаткиУслугиПеня.ОстатокКон
	|				ТОГДА 0
	|			ИНАЧЕ ОстаткиУслугиПеня.ОстатокКон - ОстаткиУслугиПеня.ОстатокКонРест
	|		КОНЕЦ,
	|		0,
	|		ОстаткиУслугиПеня.Услуга,
	|		ОстаткиУслугиПеня.Поставщик,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОстаткиУслугиПеня.ОстатокНачМор,
	|		ОстаткиУслугиПеня.ОстатокНачРест,
	|		ОстаткиУслугиПеня.ОстатокКонМор,
	|		ОстаткиУслугиПеня.ОстатокКонРест,
	|		ВЫБОР
	|			КОГДА ОстаткиУслугиПеня.ОстатокКонРест >= ОстаткиУслугиПеня.ОстатокКон
	|				ТОГДА 0
	|			ИНАЧЕ ОстаткиУслугиПеня.ОстатокКон - ОстаткиУслугиПеня.ОстатокКонРест
	|		КОНЕЦ
	|	ИЗ
	|		ОстаткиУслугиПеня КАК ОстаткиУслугиПеня
	|	ГДЕ
	|		(ОстаткиУслугиПеня.ОстатокНач <> 0
	|				ИЛИ ОстаткиУслугиПеня.ОстатокКон <> 0
	|				ИЛИ ОстаткиУслугиПеня.ОстатокНачМор <> 0
	|				ИЛИ ОстаткиУслугиПеня.ОстатокНачРест <> 0
	|				ИЛИ ОстаткиУслугиПеня.ОстатокКонМор <> 0
	|				ИЛИ ОстаткиУслугиПеня.ОстатокКонРест <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачисленныйОбъем.ПериодРасчета,
	|		НачисленныйОбъем.ПериодНачисления,
	|		0,
	|		0,
	|		0,
	|		0,
	|		НачисленныйОбъем.Услуга,
	|		НачисленныйОбъем.Поставщик,
	|		НачисленныйОбъем.НачисленноСумма,
	|		НачисленныйОбъем.НачисленноОбъем,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		НачисленныйОбъем КАК НачисленныйОбъем
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачисленныйОбъемПеня.ПериодРасчета,
	|		НачисленныйОбъемПеня.ПериодНачисления,
	|		0,
	|		0,
	|		0,
	|		0,
	|		НачисленныйОбъемПеня.Услуга,
	|		НачисленныйОбъемПеня.Поставщик,
	|		НачисленныйОбъемПеня.НачисленноСумма,
	|		НачисленныйОбъемПеня.НачисленноОбъем,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		НачисленныйОбъемПеня КАК НачисленныйОбъемПеня
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОплаты.ПериодРасчета,
	|		ДанныеОплаты.ПериодНачисления,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ДанныеОплаты.Услуга,
	|		ДанныеОплаты.Поставщик,
	|		0,
	|		0,
	|		ДанныеОплаты.Оплачено,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ДанныеОплаты КАК ДанныеОплаты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеОплатыПеня.ПериодРасчета,
	|		ДанныеОплатыПеня.ПериодНачисления,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ДанныеОплатыПеня.Услуга,
	|		ДанныеОплатыПеня.Поставщик,
	|		0,
	|		0,
	|		ДанныеОплатыПеня.Оплачено,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ДанныеОплатыПеня КАК ДанныеОплатыПеня
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИспользованиеАванса.ПериодРасчета,
	|		ИспользованиеАванса.ПериодНачисления,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ИспользованиеАванса.Услуга,
	|		ИспользованиеАванса.Поставщик,
	|		0,
	|		0,
	|		0,
	|		ИспользованиеАванса.ИспользованноСумма,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ИспользованиеАванса КАК ИспользованиеАванса
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АвансыПоступившие.ПериодНачисления,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		0,
	|		0,
	|		0,
	|		""Аванс"",
	|		ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПУстаяСсылка),
	|		0,
	|		0,
	|		АвансыПоступившие.ПоступлениеАвансаСумма,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		АвансыПоступившие КАК АвансыПоступившие) КАК ВложенныйЗАпрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусИтог КАК СтатусИтог
	|		ПО (ВложенныйЗАпрос.ПериодРасчета МЕЖДУ СтатусИтог.СудебноеДелоПериодЗадолженностиНачало И СтатусИтог.СудебноеДелоПериодЗадолженностиКонец)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗАпрос.ПериодРасчета,
	|	ВложенныйЗАпрос.ПериодНачисления,
	|	ВложенныйЗАпрос.Услуга,
	|	ВложенныйЗАпрос.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗАпрос.ПериодРасчета,
	|	ВложенныйЗАпрос.ПериодНачисления,
	|	ВложенныйЗАпрос.Услуга
	|ИТОГИ
	|	СУММА(ОстатокНачДт),
	|	СУММА(ОстатокНачКт),
	|	СУММА(НачисленноСумма),
	|	СУММА(НачисленноОбъем),
	|	СУММА(Оплачено),
	|	СУММА(использованоИзАвансов),
	|	СУММА(ОстатокКонДт),
	|	СУММА(ОстатокКонКт),
	|	СУММА(ОстатокНачДтМор),
	|	СУММА(ОстатокНачДтРест),
	|	СУММА(ОстатокКонДтМор),
	|	СУММА(ОстатокКонДтРест),
	|	СУММА(ОстатокНачДтИтого),
	|	СУММА(ОстатокКонДтИтого),
	|	МАКСИМУМ(Статус),
	|	СУММА(ОстатокКонДтПеня)
	|ПО
	|	ПериодРасчетов";
	
	
	ПараметрыОтчета.вставить("ПериодНачисленияНачало",ПериодНачисленияНачало);
	
	Возврат ТекстГраницыПериодов  
	+ Символы.ПС + ";" 
	+ Символы.ПС + "/////////"
	+ Символы.ПС + ОсновнойТекст;
	
КонецФункции


Функция ФорматироватьПоказания(Выборка, ЗначениеПоказаний)
	Возврат ЗначениеПоказаний;
КонецФункции

#КонецОбласти

#КонецЕсли