#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Перем СтрокаПоиска, Организация, Район, ТипДоговора, ВидДоговора, ГруппаФинансирования;
	
	Если Не Параметры.Свойство("СтрокаПоиска", СтрокаПоиска) Тогда 
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Организация", 		 	Организация);
	Параметры.Свойство("Район", 				Район);
	Параметры.Свойство("ТипДоговора", 		 	ТипДоговора);
	Параметры.Свойство("ВидДоговора", 		 	ВидДоговора);
	Параметры.Свойство("ГруппаФинансирования", 	ГруппаФинансирования);

	Если ЗначениеЗаполнено(Организация) ИЛИ ЗначениеЗаполнено(Район) ИЛИ ЗначениеЗаполнено(ТипДоговора) 
			ИЛИ ЗначениеЗаполнено(ВидДоговора) ИЛИ ЗначениеЗаполнено(ГруппаФинансирования) Тогда
			
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
			|ГДЕ
			|	НЕ энргДоговорыКонтрагентов.ПометкаУдаления
			|	И энргДоговорыКонтрагентов.Организация = &Организация
			|	И (энргДоговорыКонтрагентов.Наименование ПОДОБНО &Наименование
			|			ИЛИ энргДоговорыКонтрагентов.Номер ПОДОБНО &Наименование)
			|	И энргДоговорыКонтрагентов.Район = &Район
			|	И энргДоговорыКонтрагентов.ТипДоговора = &ТипДоговора
			|	И энргДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
			|	И энргДоговорыКонтрагентов.ГруппаФинансирования = &ГруппаФинансирования";
		
		Запрос.УстановитьПараметр("Наименование", Параметры.СтрокаПоиска + "%");
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		Иначе
		    Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргДоговорыКонтрагентов.Организация = &Организация", "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Район) Тогда
			Запрос.УстановитьПараметр("Район", Район);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргДоговорыКонтрагентов.Район = &Район", "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипДоговора) Тогда
			Запрос.УстановитьПараметр("ТипДоговора", ТипДоговора);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргДоговорыКонтрагентов.ТипДоговора = &ТипДоговора", "");
		КонецЕсли;

		Если ЗначениеЗаполнено(ВидДоговора) Тогда
			Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргДоговорыКонтрагентов.ВидДоговора = &ВидДоговора", "");
		КонецЕсли;

		Если ЗначениеЗаполнено(ГруппаФинансирования) Тогда
			Запрос.УстановитьПараметр("ГруппаФинансирования", ГруппаФинансирования);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргДоговорыКонтрагентов.ГруппаФинансирования = &ГруппаФинансирования", "");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));

	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область ПрограммныйИнтерфейс

// Определить объекты метаданных, в модулях менеджеров которых ограничивается возможность
// редактирования реквизитов с помощью экспортной функции ПолучитьБлокируемыеРеквизитыОбъекта.
//
// Возвращаемое значение:
//  Результат - Массив
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Номер");
	Результат.Добавить("Организация");
	Результат.Добавить("Район");
	Результат.Добавить("ТипДоговора");
	Результат.Добавить("ВидДоговора");
	Результат.Добавить("КатегорияКонтрагента");
	Результат.Добавить("ОтветственныйЗаДоговор");
	Результат.Добавить("ОтветственныйЗаРасчеты");
	Результат.Добавить("ДатаНачалаДействия");
	Результат.Добавить("ПролонгацияДоговора");
	Результат.Добавить("ДатаПролонгации");
	Результат.Добавить("ГруппаФинансирования");
	Результат.Добавить("Комментарий");
	Результат.Добавить("Автор");
	Результат.Добавить("Дата");
	Результат.Добавить("БлокЮридическихЛиц");
	Результат.Добавить("бестКодДоговораERP");
	Результат.Добавить("Контрагент");
	Результат.Добавить("БанковскийСчетКонтрагента");
	Результат.Добавить("Статус");
	Результат.Добавить("ПоставщикКонтрагент");
	Результат.Добавить("ТипТарифа");
	Результат.Добавить("ТарифнаяСетка");
	Результат.Добавить("ЦеноваяКатегория");
	Результат.Добавить("ЗначениеСкидки");
	Результат.Добавить("ДатаОкончанияДействия");
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияСвойствОбъекта(ДоговорСсылка, ПолучаемыеСвойства) Экспорт 
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорСсылка, ПолучаемыеСвойства); 
	
КонецФункции

Функция НайтиДействующийДоговорПоПараметрам(Организация, Район, Контрагент, ДатаОкончанияДействия) Экспорт 
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И (ДоговорыКонтрагентов.ДатаОкончанияДействия >= &ДатаОкончанияДействия
	|			ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	И ДоговорыКонтрагентов.ДатаНачалаДействия <= &ДатаОкончанияДействия
	|	И (ДоговорыКонтрагентов.Статус <> ЗНАЧЕНИЕ(Перечисление.бестСтатусыДоговоровКонтрагентов.Закрыт)
	|			ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Район = &Район
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("ДатаОкончанияДействия",	ДатаОкончанияДействия);
	Запрос.УстановитьПараметр("Контрагент",	 			Контрагент);
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("Район",		 			Район);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда		
		Возврат ПустаяСсылка();
	КонецЕсли;	
	
	Выборка 		= РезультатЗапроса.Выбрать();	
	Выборка.Следующий(); 	
	Возврат Выборка.Ссылка; 	
	
КонецФункции

Процедура ЗаполнитьОбъектПоОписанию(ДоговорСсылка, ОписаниеОбъекта, НомерДоговора, ЭтоНоваяСсылка) Экспорт
	ДоговорОбъект = ИнициализироватьОбъект(ДоговорСсылка, ЭтоНоваяСсылка);
	
	ЕстьИзменения = Ложь;
	ЗаполнитьИзмененияОбъекта(ДоговорОбъект, ОписаниеОбъекта, НомерДоговора, ЭтоНоваяСсылка); 	
	ПопытатьсяЗаписатьИзменения(ДоговорОбъект, ЕстьИзменения);	 	
КонецПроцедуры

Функция СсылкаПоКлючевымПараметрам(Организация, Район, Контрагент) Экспорт 			
	Запрос  		= Новый Запрос;	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);	
		
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|ГДЕ
	|	энргДоговорыКонтрагентов.Организация = &Организация
	|	И энргДоговорыКонтрагентов.Район = &Район
	|	И энргДоговорыКонтрагентов.Контрагент = &Контрагент";
	РезультатЗапроса			= Запрос.Выполнить();
	Выборка 					= РезультатЗапроса.Выбрать(); 
	Если Выборка.Следующий() тогда
		Возврат Выборка.ссылка; 
	КонецЕсли;
	
	Возврат Справочники.энргДоговорыКонтрагентов.ПустаяСсылка();	
КонецФункции

Функция СФормироватьНомерДоговора(ОписаниеОбъекта) Экспорт
	// Переопределен	
КонецФункции

Функция МассивСсылокПолнотекстовогоПоиска(СтрокаПоиска) Экспорт 
	перем РезультатЗапроса;
		
	мСтрокиПоиска 		= СтрРазделить(СтрокаПоиска," ",Ложь);
	Схема 				= Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(ТекстЗапросаПолнотекстовыйПоиск());
	Пакет 				= Схема.ПакетЗапросов[0];
	Оператор 			= Пакет.Операторы[0];
	Отбор	 			= Оператор.Отбор;
	ОтборЭталон 		= Отбор[0];
	Для Индекс = 1 По мСтрокиПоиска.ВГраница() Цикл
		Отбор.Добавить(СтрЗаменить(ОтборЭталон, "&СтрокаПоиска1","&СтрокаПоиска" + (Индекс+1)));
	КонецЦикла;
	
	Запрос  			= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Для Индекс = 0 По мСтрокиПоиска.ВГраница() Цикл
		Запрос.УстановитьПараметр("СтрокаПоиска" + (Индекс+1), мСтрокиПоиска[Индекс]);
	КонецЦикла;
	
	РезультатЗапроса 	= Запрос.Выполнить();
			
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

 #Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьОбъект(ДоговорСсылка, ЭтоНоваяСсылка)
	Если ЭтоНоваяСсылка Тогда
		ДоговорОбъект 	= СоздатьЭлемент();
		ДоговорОбъект.УстановитьСсылкуНового(ДоговорСсылка);
	Иначе
		ДоговорОбъект 	= ДоговорСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ДоговорОбъект;
КонецФункции

Процедура ЗаполнитьИзмененияОбъекта(ДоговорОбъект, ОписаниеОбъекта, НомерДоговора, ЭтоНоваяСсылка)
	Если НЕ ДоговорОбъект.Организация = ОписаниеОбъекта.Организация Тогда 
		ДоговорОбъект.Организация 						= ОписаниеОбъекта.Организация;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ ДоговорОбъект.Район = ОписаниеОбъекта.Район Тогда 
		ДоговорОбъект.Район 							= ОписаниеОбъекта.Район;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ ДоговорОбъект.СпособЗаключенияДоговора = ОписаниеОбъекта.СпособЗаключенияДоговора Тогда 
		ДоговорОбъект.СпособЗаключенияДоговора 			= ОписаниеОбъекта.СпособЗаключенияДоговора;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ ДоговорОбъект.Публичный = ОписаниеОбъекта.Публичный Тогда 
		ДоговорОбъект.Публичный 						= ОписаниеОбъекта.Публичный;
		ЕстьИзменения									= Истина;
	КонецЕсли;
	
	Если НЕ ДоговорОбъект.НачислениеПени = ОписаниеОбъекта.НачислениеПени Тогда 
		ДоговорОбъект.НачислениеПени 					= ОписаниеОбъекта.НачислениеПени;
		ЕстьИзменения									= Истина;
	КонецЕсли; 	
	
		
	Если ЭтоНоваяСсылка Тогда  
		ДоговорОбъект.Номер 							= НомерДоговора;
	КонецЕсли;
КонецПроцедуры

Процедура ПопытатьсяЗаписатьИзменения(ДоговорОбъект, ЕстьИзменения)
	Если Не ЕстьИзменения Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		ДоговорОбъект.Записать();		
	Исключение
		
	КонецПопытки;
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаПолнотекстовыйПоиск()
	Текст  = 
	"ВЫБРАТЬ
	|	энргДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|		ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|ГДЕ
	|	(энргДоговорыКонтрагентов.Номер ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%""
	|			ИЛИ энргДоговорыКонтрагентов.Наименование ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%""
	|			ИЛИ ЕСТЬNULL(энргКонтрагенты.Наименование, """") ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%""
	|			ИЛИ ЕСТЬNULL(энргКонтрагенты.ИНН, """") ПОДОБНО ""%"" + &СтрокаПоиска1 + ""%"")";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли