#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВидыЭнергииСредствИзмерения(Схема,Параметры, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеПомещения());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
		
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "ТипПрибораУчета, ВидЭнергии";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргВидыЭнергииСредствИзмерения", Параметры.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеПомещения()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргВидыЭнергииСредствИзмерения.ТипПрибораУчета КАК ТипПрибораУчета,
	|	энргВидыЭнергииСредствИзмерения.ВидЭнергии КАК ВидЭнергии,
	|	энргВидыЭнергииСредствИзмерения.КлассТочности КАК КлассТочности
	|ИЗ
	|	РегистрСведений.энргВидыЭнергииСредствИзмерения КАК энргВидыЭнергииСредствИзмерения";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли