#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция АктуальныеДанные(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанные());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Жилец,Организация,Район,ЛьготнаяКатегория,Абонент";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			Источник.Параметры[1],
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);		
		
		//Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
		//	Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
		//		Пакет.Операторы[0].Отбор.Очистить();
		//		
		//		СоотвествиеПолей 	= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
		//		ОтборДляУстановки 	= Новый Структура(
		//			"ИмяПараметра,ТипПараметра,СоотвествиеПолей", 
		//			ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,
		//			"ТипПараметраВременнаяТаблица", 
		//			СоотвествиеПолей);
		//							
		//		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(
		//			Пакет.Операторы[0].Отбор, 
		//			"ТаблицаСрезПоследних", 
		//			ОтборДляУстановки, 
		//			"");
		//	КонецЕсли;			
		//КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность";	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаАктуальныеДанные()
	
	Текст =
	"ВЫБРАТЬ
	|	ТаблицаИнформации.Период КАК Период,
	|	ТаблицаИнформации.Жилец КАК Жилец,
	|	ТаблицаИнформации.Организация КАК Организация,
	|	ТаблицаИнформации.Район КАК Район,
	|	ТаблицаИнформации.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
	|	ТаблицаИнформации.Абонент КАК Абонент,
	|	ТаблицаИнформации.ПроцентЛьготы КАК ПроцентЛьготы,
	|	ТаблицаИнформации.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних КАК ТаблицаИнформации";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли