#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

// Описание полей
// ВыводитьВТЧ - необходим для справочника с настройками шаблонов
// Возвращаемое значение:
//	 Соответствие 
//
Функция ПолучитьСтатическиеКолонки() Экспорт
	
	СтатическиеКолонки = Новый Соответствие;
	СтатическиеКолонки.Вставить("IDСтроки"	,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","IDСтроки"	,ОбщегоНазначения.ОписаниеТипаСтрока(36)				,Тип("УникальныйИдентификатор")	,"IDСтроки" 	,Ложь));
	СтатическиеКолонки.Вставить("IDСтрокиТочекУчета"	,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","IDСтрокиТочекУчета"	,ОбщегоНазначения.ОписаниеТипаСтрока(36)				,Тип("УникальныйИдентификатор")	,"IDСтрокиТочекУчета" 	,Ложь));
	СтатическиеКолонки.Вставить("ДатаВремя"	,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","ДатаВремя"	,ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя)	,Тип("Дата")					,"Дата время"	,Истина));
	СтатическиеКолонки.Вставить("BНP"		,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","BНP"		,ОбщегоНазначения.ОписаниеТипаЧисло(15)					,Тип("Число")					,"BНP"			,Истина));
	СтатическиеКолонки.Вставить("BOC"		,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","BOC"		,ОбщегоНазначения.ОписаниеТипаЧисло(15)					,Тип("Число")					,"BOC"			,Истина));
	
	Возврат СтатическиеКолонки;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий	

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

#КонецОбласти

#КонецЕсли