#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	&ОбъектРасчета КАК ОбъектРасчета,
	|	&МКД КАК МКД,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.бестУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаТочекУчета
	|ГДЕ
	|	НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И ТаблицаТочекУчета.Ссылка = &Ссылка";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	энргДатаПоследнегоИзменения	= ТекущаяДата();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
					
	бестРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеПоказанийПриборовУчета(),Движения);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоверки(), Движения.бестДатыПоверкиПрибораУчетаНП);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПоказанийПриборовУчета()  	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.Текст	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ТаблицаПоказанийПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ВложенныйЗапрос.КС КАК КС,
	|	ТаблицаПоказанийПриборовУчета.Переворот КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Период КАК ПериодРегистрации,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаПоказанийПриборовУчета.Разница КАК Разница,
	|	ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	|		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаШкал.Шкала КАК Шкала,
	|		ТаблицаШкал.IDСтроки КАК IDСтроки,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ТаблицаДокумента.Район КАК Район,
	|		ТаблицаДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|		ТаблицаДокумента.ОбъектРасчета.МКД КАК МКД,
	|		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаДокумента.Дата КАК Период,
	|		ЛОЖЬ КАК КС,
	|		ТаблицаДокумента.ИсточникПоказаний КАК ИсточникПоказаний
	|	ИЗ
	|		Документ.бестУстановитьДатуПоверкиПУ.ТочкиУчета КАК ТаблицаПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьДатуПоверкиПУ.ШкалыПриборовУчета КАК ТаблицаШкал
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	|				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	|				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьДатуПоверкиПУ КАК ТаблицаДокумента
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьДатуПоверкиПУ.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.ПриборУчета";
	
	Возврат Запрос.Выполнить();  	
КонецФункции 

Функция ДанныеПоверки()
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.Текст	= 
	"ВЫБРАТЬ
	|	бестУстановитьДатуПоверкиПУТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестУстановитьДатуПоверкиПУТочкиУчета.ДатаПоверки КАК ДатаПоверки,
	|	бестУстановитьДатуПоверкиПУТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	бестУстановитьДатуПоверкиПУТочкиУчета.Ссылка.Район КАК Район,
	|	бестУстановитьДатуПоверкиПУТочкиУчета.Ссылка.Организация КАК Организация,
	|	бестУстановитьДатуПоверкиПУТочкиУчета.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.бестУстановитьДатуПоверкиПУ.ТочкиУчета КАК бестУстановитьДатуПоверкиПУТочкиУчета
	|ГДЕ
	|	бестУстановитьДатуПоверкиПУТочкиУчета.ДатаПоверки <> ДАТАВРЕМЯ(1, 1, 1)
	|	И бестУстановитьДатуПоверкиПУТочкиУчета.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли