#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ОбъемФизЛиц = ТекущийОбъект.Движения.энргОбъемНачислений.Выгрузить();
	ОбъемФизЛиц.Свернуть("Услуга", "ОбъемУслуги,Сумма");
	ТекстПодвалаФЛОбъемУслуги	= "";
	ТекстПодвалаФЛСумма		= "";
	Для Каждого ТекСтрока Из ОбъемФизЛиц Цикл
		ТекстПодвалаФЛОбъемУслуги	= ТекстПодвалаФЛОбъемУслуги + ТекСтрока.Услуга.ПредставлениеДляПечати + ": " + Формат(ТекСтрока.ОбъемУслуги,"ЧДЦ=6")  + Символы.ПС;
		ТекстПодвалаФЛСумма		= ТекстПодвалаФЛСумма + ТекСтрока.Услуга.ПредставлениеДляПечати + ": " + Формат(ТекСтрока.Сумма,"ЧДЦ=2") + Символы.ПС;
	КонецЦикла;
	ТекстПодвалаФЛОбъемУслуги	= Сред(ТекстПодвалаФЛОбъемУслуги,1,СтрДлина(ТекстПодвалаФЛОбъемУслуги)-1);
	ТекстПодвалаФЛСумма			= Сред(ТекстПодвалаФЛСумма,1,СтрДлина(ТекстПодвалаФЛСумма)-1);
	
	
	ОбъемЮрЛиц = ТекущийОбъект.Движения.бестОбъемНачисленийНП.Выгрузить();
	ОбъемЮрЛиц.Свернуть("Услуга", "ОбъемУслуги");
	ТекстПодвалаЮЛОбъемУслуги	= "";
	Для Каждого ТекСтрока Из ОбъемЮрЛиц Цикл
		ТекстПодвалаЮЛОбъемУслуги	= ТекстПодвалаЮЛОбъемУслуги + ТекСтрока.Услуга.ПредставлениеДляПечати + ": " + Формат(ТекСтрока.ОбъемУслуги,"ЧДЦ=6")  + Символы.ПС;
	КонецЦикла;
	ТекстПодвалаЮЛОбъемУслуги	= Сред(ТекстПодвалаЮЛОбъемУслуги,1,СтрДлина(ТекстПодвалаЮЛОбъемУслуги)-1);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимость()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НП", 
		"Видимость", энргОбщегоНазначения.ЗначениеКонстанты("бестИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЭЭЮЛ", 
		"Видимость", энргОбщегоНазначения.ЗначениеКонстанты("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ"));
КонецПроцедуры

#КонецОбласти