#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить недели замещения
//
// Параметры:
//  ПроизводственныйКалендарь	 - СправочникСсылка.ПроизводственныеКалендари 
//
Процедура ЗаполнитьНеделиЗамещения(ПроизводственныйКалендарь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.Год КАК Год,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
		|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса
		|ПОМЕСТИТЬ ДанныеКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКалендаря.Дата КАК КонецНедели,
		|	НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) КАК ГодМесяц,
		|	ДОБАВИТЬКДАТЕ(ДанныеКалендаря.Дата, ДЕНЬ, -6) КАК НачалоНедели
		|ПОМЕСТИТЬ ДанныеКалендаряНедели
		|ИЗ
		|	ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДЕНЬНЕДЕЛИ(ДанныеКалендаря.Дата) = 7
		|	И ДЕНЬ(ДанныеКалендаря.Дата) >= 7
		|	И ДанныеКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКалендаряНедели.КонецНедели КАК КонецНедели,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеКалендаря.Дата) КАК КолвоРабочихДней,
		|	ДанныеКалендаряНедели.ГодМесяц КАК ГодМесяц
		|ПОМЕСТИТЬ ПолныеНедели
		|ИЗ
		|	ДанныеКалендаря КАК ДанныеКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеКалендаряНедели КАК ДанныеКалендаряНедели
		|		ПО ДанныеКалендаря.Дата >= ДанныеКалендаряНедели.НачалоНедели
		|			И ДанныеКалендаря.Дата <= ДанныеКалендаряНедели.КонецНедели
		|			И (НЕ ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Нерабочий)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеКалендаряНедели.КонецНедели,
		|	ДанныеКалендаряНедели.ГодМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПолныеНедели.КонецНедели) КАК КонецНедели,
		|	ПолныеНедели.ГодМесяц КАК ГодМесяц
		|ПОМЕСТИТЬ ПоследняяПолнаяНеделя
		|ИЗ
		|	ПолныеНедели КАК ПолныеНедели
		|ГДЕ
		|	ПолныеНедели.КолвоРабочихДней = 7
		|
		|СГРУППИРОВАТЬ ПО
		|	ПолныеНедели.ГодМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеКалендаряНедели.КонецНедели КАК КонецНедели,
		|	ДанныеКалендаряНедели.ГодМесяц КАК ГодМесяц,
		|	ДанныеКалендаряНедели.НачалоНедели КАК НачалоНедели
		|ИЗ
		|	ПоследняяПолнаяНеделя КАК ПоследняяПолнаяНеделя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеКалендаряНедели КАК ДанныеКалендаряНедели
		|		ПО ПоследняяПолнаяНеделя.КонецНедели = ДанныеКалендаряНедели.КонецНедели
		|			И ПоследняяПолнаяНеделя.ГодМесяц = ДанныеКалендаряНедели.ГодМесяц";
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаборРС = РегистрыСведений.бестНеделиЗамещения.СоздатьНаборЗаписей();
	
	НаборРС.Загрузить(РезультатЗапроса.Выгрузить());
	
	НаборРС.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли