#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем СписокАбонентов;
	
	Если Параметры.Свойство("СписокАбонентов", СписокАбонентов) Тогда
	
		ДанныеОбАбонентах = Обработки.бестГрупповойВводСобытийПИР.ПолучитьДанныеОбАбоненте(СписокАбонентов);
		
		Для каждого ДанныеОбАбоненте Из ДанныеОбАбонентах Цикл
			
			ТекСтрока = Абоненты.Добавить();
			ТекСтрока.Ид = Новый УникальныйИдентификатор;
			
			ЗаполнитьЗначенияСвойств(ТекСтрока, ДанныеОбАбоненте);
			
			Для каждого ЗадачаАбонента Из ДанныеОбАбоненте.Задачи Цикл
				Если Не ЗначениеЗаполнено(ЗадачаАбонента) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТЗ = ЗадачиАбонента.Добавить();
				СтрокаТЗ.ИдАбонента = ТекСтрока.Ид;
				СтрокаТЗ.Задача		= ЗадачаАбонента;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьЗадачиАбонента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСобытияПриИзменении(Элемент)
	ЗаполнитьПараметрыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАбоненты

&НаКлиенте
Процедура АбонентыПриАктивизацииСтроки(Элемент)
	ОтобразитьЗадачиАбонента();
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПередУдалением(Элемент, Отказ)
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		СтрокиЗадач = ЗадачиАбонента.НайтиСтроки(Новый Структура("ИдАбонента", ТекСтрока.Ид));
		
		Для каждого СтрокаУдаления Из СтрокиЗадач Цикл
			ЗадачиАбонента.Удалить(СтрокаУдаления);		
		КонецЦикла;
		
		Отбор = Новый Структура("ИдАбонента", Неопределено);
		Элементы.Задачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
		ТекСтрока.Ид = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентыАбонентПриИзменении(Элемент)
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		ОбновитьДанныеОбАбоненте(Элементы.Абоненты.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачи

&НаКлиенте
Процедура ЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьСобытия(Команда)
	СоздатьСобытияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
	ЗначПарам = Новый Соответствие;
	
	Для каждого СтрокаТЧ Из ПараметрыСобытия Цикл
		ЗначПарам.Вставить(СтрокаТЧ.Параметр, СтрокаТЧ.Значение);
	КонецЦикла;
	
	ПараметрыСобытия.Очистить();
	
	СписокПараметровТипа = Справочники.энргСпособСвязи.ПолучитьСписокПараметров(ТипСобытия);
	
	Для каждого Параметр Из СписокПараметровТипа Цикл
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			СтрокаТЧ = ПараметрыСобытия.Добавить();
			
			СтрокаТЧ.Параметр = Параметр;
			
			Значение		  = ЗначПарам.Получить(Параметр);
			Если Значение <> Неопределено Тогда
				СтрокаТЧ.Значение = Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанныеОбАбоненте(ИдентификаторСтроки)

	ТекСтрока = Абоненты.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокиЗадач = ЗадачиАбонента.НайтиСтроки(Новый Структура("ИдАбонента", ТекСтрока.Ид));
	Для каждого СтрокаУдаления Из СтрокиЗадач Цикл
		ЗадачиАбонента.Удалить(СтрокаУдаления);		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекСтрока.Абонент) Тогда
		ДанныеОбАбоненте = Обработки.бестГрупповойВводСобытийПИР.ПолучитьДанныеОбАбоненте(ТекСтрока.Абонент);
		
		Если ТипЗнч(ДанныеОбАбоненте) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ТекСтрока, ДанныеОбАбоненте);
			
			Для каждого ЗадачаАбонента Из ДанныеОбАбоненте.Задачи Цикл
				Если Не ЗначениеЗаполнено(ЗадачаАбонента) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТЗ = ЗадачиАбонента.Добавить();
				СтрокаТЗ.ИдАбонента = ТекСтрока.Ид;
				СтрокаТЗ.Задача		= ЗадачаАбонента;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЗадачиАбонента()
	
	Перем ИдАбонента, Отбор, ТекСтрока;
	
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	
	ИдАбонента = ?(ТекСтрока = Неопределено, Неопределено, ТекСтрока.Ид);
	
	Отбор = Новый Структура("ИдАбонента", ИдАбонента);
	Элементы.Задачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСобытияНаСервере()

	Для каждого СтрокаТЗ Из Абоненты Цикл
	
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Абонент) Тогда
			Продолжить;
		КонецЕсли;
		
		Событие = Документы.энргСобытие.СоздатьДокумент();
		Событие.Дата = ТекущаяДата();
		Событие.ТипСобытия = ТипСобытия;
		Событие.Организация = СтрокаТЗ.Организация;
		
		СтрокиЗадач = ЗадачиАбонента.НайтиСтроки(Новый Структура("ИдАбонента", СтрокаТЗ.Ид));
		Событие.Одинарный = СтрокиЗадач.Количество() <= 1;
		
		Если Событие.Одинарный Тогда
			Задача = ?(ЗначениеЗаполнено(СтрокиЗадач), СтрокиЗадач[0].Задача, Неопределено);
			
			СтрокаТЧ = Событие.Абоненты.Добавить();
			
			СтрокаТЧ.Абонент = СтрокаТЗ.Абонент;
			СтрокаТЧ.Основание = Задача;
		Иначе	
			Для каждого СтрокаЗадачи Из СтрокиЗадач Цикл
				СтрокаТЧ = Событие.Абоненты.Добавить();
				
				СтрокаТЧ.Абонент = СтрокаТЗ.Абонент;
				СтрокаТЧ.Основание = СтрокаЗадачи.Задача;
			КонецЦикла;
		КонецЕсли;
		
		Для каждого СтрокаПарам Из ПараметрыСобытия Цикл
		
			СтрокаТЧ = Событие.Параметры.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаПарам);
		
		КонецЦикла;
		
		Событие.Записать();
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

