
#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестПлатежныйДокумент(ЭтотОбъект);	
КонецПроцедуры

#КонецОбласти

#Область СобытияШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.НеоплаченныеСчета.Очистить();
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьВзаиморасчетыНПЭЭ(Объект.Организация, Объект.ПериодНачисления, Объект.Район, Объект.Договор);
	РезультатЗапроса = бестВзаиморасчетыЮрЛицаСервер.ПолучитьЗадолженностьПоДоговору(Объект.Организация, Объект.Район, Объект.ПериодНачисления, Объект.Дата, Объект.Договор);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.НеоплаченныеСчета.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

