#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();

	бестПроведениеСерверНП.ВыполнитьДвижение(ДанныеШапки, Движения.бестИзмененияОкружающейСреды);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",								?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",								Район);
	ДанныеШапки.Вставить("Организация",							Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",					Дата);
	ДанныеШапки.Вставить("ПериодНачисления",					ПериодНачисления);
	ДанныеШапки.Вставить("ПроектнаяТемператураХВС",				ПроектнаяТемператураХВС);
	ДанныеШапки.Вставить("ПроектнаяТемператураГВС",				ПроектнаяТемператураГВС);
	ДанныеШапки.Вставить("ТемператураХВСВОтопительныйПериод",	ТемператураХВСВОтопительныйПериод);
	ДанныеШапки.Вставить("ТемператураХВСВНеотопительныйПериод",	ТемператураХВСВНеотопительныйПериод);

	Возврат ДанныеШапки; 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли