#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для плана обмена "ОбменБиллингУправлениеТеплосетью".

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента.
//
Процедура ОбменБиллингУправлениеТеплосетьюЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменБиллингУправлениеТеплосетью", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью.
//
Процедура ОбменБиллингУправлениеТеплосетьюЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменБиллингУправлениеТеплосетью", Источник, Отказ);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра.
//
Процедура ОбменБиллингУправлениеТеплосетьюЗарегистрироватьИзменениеНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменБиллингУправлениеТеплосетью", Источник, Отказ, Замещение);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением.
//
Процедура ОбменБиллингУправлениеТеплосетьюЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменБиллингУправлениеТеплосетью", Источник, Отказ);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// Служебные процедуры для целей автоматизированного тестирования обменов.

Процедура ПроверкаНегативногоСценария(УзелКорреспондента, ДокументОбъект = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(УзелКорреспондента) Тогда
		Возврат;
	КонецЕсли;
	НегативныйСценарий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелКорреспондента, "НегативныйСценарий");
	Если НегативныйСценарий = "" Тогда
		Возврат;
	ИначеЕсли НегативныйСценарий = "ОшибкаГлобальногоОбработчика" И ДокументОбъект = Неопределено Тогда
		// Выполнение заведомо ошибочной строки кода.
		Результат = 1 + "а";
	ИначеЕсли НегативныйСценарий = "ОшибкаПроверкиЗаполнения" И ДокументОбъект <> Неопределено Тогда
		// Очистка обязательного реквизита документа.
		ДокументОбъект.Организация = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
