#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеОбАбоненте(Абонент) Экспорт
	
	Результат = Новый Массив;
	Однократно = ТипЗнч(Абонент) <> Тип("Массив");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.Организация КАК Организация,
		|	энргАбоненты.Ссылка КАК Абонент
		|ПОМЕСТИТЬ ВТ_ДанныеОбАбоненте
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	энргАбоненты.Ссылка В(&Абонент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеОбАбоненте.Абонент КАК Абонент,
		|	ВТ_ДанныеОбАбоненте.Организация КАК Организация,
		|	энргЗадачаПИД.Ссылка КАК Задача
		|ИЗ
		|	ВТ_ДанныеОбАбоненте КАК ВТ_ДанныеОбАбоненте
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО ВТ_ДанныеОбАбоненте.Абонент = энргЗадачаПИД.Абонент
		|			И (НЕ энргЗадачаПИД.ПометкаУдаления)
		|			И (НЕ энргЗадачаПИД.Выполнена)
		|			И (НЕ энргЗадачаПИД.ПрекращенаДеятельность)
		|ИТОГИ
		|	МАКСИМУМ(Организация)
		|ПО
		|	Абонент";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАбонент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаАбонент.Следующий() Цикл
		ДанныеОбАбоненте = Новый Структура("Организация, Абонент");
		
		ЗаполнитьЗначенияСвойств(ДанныеОбАбоненте, ВыборкаАбонент);
		
		ДанныеОбАбоненте.Вставить("Задачи", Новый Массив);
		Выборка = ВыборкаАбонент.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			ДанныеОбАбоненте.Задачи.Добавить(Выборка.Задача);
		КонецЦикла;
		
		Если Однократно Тогда
		
			Возврат ДанныеОбАбоненте;
		КонецЕсли;
		
		Результат.Добавить(ДанныеОбАбоненте);
	КонецЦикла;

	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли