#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов
//
Функция МассивПриборов() Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	ТаблицаТочекУчета.Абонент КАК Абонент,
	|	ШапкаДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргАбоненты.Организация КАК Организация,
	|	энргАбоненты.Район КАК Район,
	|	ШапкаДокумента.Дата КАК ПериодРегистрации,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргАбоненты.КлючПомещения.Строение КАК МКД,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргАбоненты.КлючПомещения.Строение КАК Строение,
	|	энргАбоненты.КлючПомещения.Помещение КАК Помещение,
	|	ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТУ
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.ТочкиУчета КАК ТаблицаТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие КАК ШапкаДокумента
	|		ПО ТаблицаТочекУчета.Ссылка = ШапкаДокумента.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ТаблицаТочекУчета.Абонент = энргАбоненты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО (энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.ШкалыПриборовУчета КАК энргПлатежноеПоручениеВходящиеШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.ПоказанияПриборовУчета КАК энргПлатежноеПоручениеВходящиеПоказанияПриборовУчета
	|			ПО энргПлатежноеПоручениеВходящиеШкалыПриборовУчета.IDСтроки = энргПлатежноеПоручениеВходящиеПоказанияПриборовУчета.IDСтроки
	|				И (энргПлатежноеПоручениеВходящиеПоказанияПриборовУчета.ПоказанияПредоставлены)
	|				И энргПлатежноеПоручениеВходящиеШкалыПриборовУчета.Ссылка = энргПлатежноеПоручениеВходящиеПоказанияПриборовУчета.Ссылка
	|		ПО ТаблицаТочекУчета.IDСтроки = энргПлатежноеПоручениеВходящиеШкалыПриборовУчета.IDСтрокиТочкиУчета
	|			И ТаблицаТочекУчета.Ссылка = энргПлатежноеПоручениеВходящиеШкалыПриборовУчета.Ссылка
	|ГДЕ
	|	ТаблицаТочекУчета.Ссылка = &ссылка
	|	И НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючПомещения,
	|	ПриборУчета";
	
	ДополнительныеСвойства.Вставить("МассивПриборов", Запрос.Выполнить());
	
КонецФункции

// Вставляет в дополнительные свойсва данные оплаты
//
Процедура ДанныеОплаты() Экспорт
	
	ДополнительныеСвойства.Вставить("ДанныеОплаты", ПолучитьДанныеОплаты(Ложь));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьЕдиничнуюОплатуИзЗагрузкиДанных(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		
		ОтменаРазрешена = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ОтменаПлатежногоРазрешена", Ложь);
		СменаПометки = Ложь;
		Если ЗначениеЗаполнено(Ссылка) Тогда 
			СменаПометки = НЕ ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
		КонецЕсли;
				
		Если НЕ ОтменаРазрешена И (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ СменаПометки) Тогда
			
			Отказ = Истина;
			КомментарийОшибки = НСтр("ru = 'Отмена проведения разрешена только из документа основания'");
			ОбщегоНазначения.СообщитьПользователю(КомментарийОшибки);
			ВызватьИсключение КомментарийОшибки;
			
		КонецЕсли;		
		
		ПроведениеРазрешено = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ПроведениеПлатежногоРазрешено", Ложь);
		Если НЕ ПроведениеРазрешено И РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ энргМассовыйВводОплат.ЕстьНЕПроведенныеОплатыОтДокументаОснования(ДокументОснование) Тогда		
			
			Отказ = Истина;
			КомментарийОшибки = НСтр("ru = 'В документе основания есть непроведённые документы, корректировка документа недоступна. Необходимо провести все созданные документы из документа основания'");
			ОбщегоНазначения.СообщитьПользователю(КомментарийОшибки);
			ВызватьИсключение КомментарийОшибки;
			
		КонецЕсли;		
		
		ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", Ложь);
		
	КонецЕсли; 	
	
	ОбновитьСуммаОстатокОплаты(Отказ);
	Ответственный = Пользователи.ТекущийПользователь();	
	
	ДополнительныеСвойства.Вставить("Кассир",				Справочники.Пользователи.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	ИсточникПоступления);
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",		Истина);
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ПроверитьДокументыРегистрацииПоказаний(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	ИсторияОплаты();
	УменьшитьОперативнуюЗадолженность();	                    	
		
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		РезультатЗапросаПакет 	= ПолучитьДанныеОбъемовИПоказаний();
		КолвоПакетов			= РезультатЗапросаПакет.Количество();
		РезультатПоказания		= РезультатЗапросаПакет[КолвоПакетов - 1];
		РезультатОбъемов		= РезультатЗапросаПакет[КолвоПакетов - 2];
		ЗарегистрироватьПоказанияПриборовУчета(РезультатПоказания);
		энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатОбъемов	, Движения.энргЗарегистрированныйОбъемПриборов);
		ЗафиксироватьОбъемСреднего(РезультатОбъемов);
	КонецЕсли;
	
	ОбработкаПроведенияПосле(Отказ, РежимПроведения)
	
КонецПроцедуры

Процедура ОбработкаПроведенияПосле(Отказ, РежимПроведения)	
	// Переопределена в расширении	
КонецПроцедуры 

Процедура ПриКопировании(ОбъектКопирования)
		
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);
	ДокументОснование = Документы.энргЗагрузкаДанныхИзВнешнихИсточников.ПустаяСсылка();
	ФайлДляЧтения = "";
	Примечание = "";
	
	НеЗагруженныеДанные.Очистить();
	Оплата.Очистить();
	ПоказанияПриборовУчета.Очистить();
	ТочкиУчета.Очистить();
	ШкалыПриборовУчета.Очистить();
	ОплатаСудебнойЗадолженности.Очистить();
	Задолженность.Очистить();
	ПереносСуммыОплаты.Очистить();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МетодыПроведения 

Процедура ИсторияОплаты()
	
	Запрос = Новый Запрос;
	Запрос.Текст	= Документы.энргПлатежноеПоручениеВходящие.ТекстЗапросаОплаты() + " ; " + 
	"ВЫБРАТЬ
	|	ВТ_Оплата.СуммаПлатежа КАК СуммаПлатежа,
	|	ВТ_Оплата.ДатаПлатежа КАК ДатаПлатежа,
	|	ВТ_Оплата.Абонент КАК Абонент,
	|	ВТ_Оплата.Организация КАК Организация,
	|	ВТ_Оплата.Дата КАК Период,
	|	ВТ_Оплата.Район КАК Район,
	|	ВТ_Оплата.ИсточникПоступления КАК ИсточникПоступления,
	|	ВТ_Оплата.Разделитель КАК Разделитель,
	|	ВТ_Оплата.СуммаКРаспределению КАК СуммаКРаспределению,
	|	ВТ_Оплата.СуммаАвизо КАК СуммаАвизо,
	|	ВТ_Оплата.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_ВсяОплатаПП КАК ВТ_Оплата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Абонент,
	|	ДатаПлатежа,
	|	Разделитель";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Движения.энргИсторияОплаты.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

Функция ПолучитьДанныеОплаты(ВычитатьПени)
	
	//ГраницыПериода			= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	Запрос  				= Новый Запрос; 
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	//Запрос.УстановитьПараметр("НачалоПериодаРасчета",	ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
	Запрос.УстановитьПараметр("ВычитатьПени",			ВычитатьПени);	
	Запрос.Текст 			=  "" + Документы.энргПлатежноеПоручениеВходящие.ТекстЗапросаОплаты() + " ; " + 
	"ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящиеЗадолженность.IDСтроки КАК IDСтроки,
	|	СУММА(энргПлатежноеПоручениеВходящиеЗадолженность.СуммаОплаты) КАК СуммаОплаты
	|ПОМЕСТИТЬ ДанныеПени
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.Задолженность КАК энргПлатежноеПоручениеВходящиеЗадолженность
	|ГДЕ
	|	энргПлатежноеПоручениеВходящиеЗадолженность.Ссылка = &Ссылка
	|	И энргПлатежноеПоручениеВходящиеЗадолженность.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
	|	И &ВычитатьПени
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПлатежноеПоручениеВходящиеЗадолженность.IDСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ВсяОплатаПП.Организация КАК Организация,
	|	ВТ_ВсяОплатаПП.Район КАК Район,
	|	ВТ_ВсяОплатаПП.МКД КАК МКД,
	|	ИСТИНА КАК ЭтоОплата,
	|	ВТ_ВсяОплатаПП.Абонент КАК Абонент,
	|	ВТ_ВсяОплатаПП.Дата КАК Дата,
	|	СУММА(ВТ_ВсяОплатаПП.СуммаКРаспределению - ЕСТЬNULL(ДанныеПени.СуммаОплаты, 0)) КАК СуммаОплаты,
	|	СУММА(ВТ_ВсяОплатаПП.СуммаКРаспределению - ЕСТЬNULL(ДанныеПени.СуммаОплаты, 0)) КАК Сумма,
	|	ВТ_ВсяОплатаПП.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_ВсяОплатаПП.Разделитель КАК Разделитель
	|ИЗ
	|	ВТ_ВсяОплатаПП КАК ВТ_ВсяОплатаПП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПени КАК ДанныеПени
	|		ПО ВТ_ВсяОплатаПП.IDСтроки = ДанныеПени.IDСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсяОплатаПП.Район,
	|	ВТ_ВсяОплатаПП.Организация,
	|	ВТ_ВсяОплатаПП.Дата,
	|	ВТ_ВсяОплатаПП.Абонент,
	|	ВТ_ВсяОплатаПП.МКД,
	|	ВТ_ВсяОплатаПП.Разделитель,
	|	ВТ_ВсяОплатаПП.Дата";
		
	Результат = Запрос.Выполнить();
	
	Возврат Результат;

КонецФункции

Процедура УменьшитьОперативнуюЗадолженность()
	
	ДанныеОплаты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
	ДополнительныеСвойства,
	"ДанныеОплаты",
	Неопределено);
	
	Если ДанныеОплаты = Неопределено Тогда 
		ДанныеОплаты = ПолучитьДанныеОплаты(Ложь);
	КонецЕсли;
	
	Движения.энргВзаиморасчеты.Загрузить(ДанныеОплаты.Выгрузить());
	
КонецПроцедуры

Функция ПолучитьДанныеОбъемовИПоказаний()	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ДокументСсылка КАК ДокРегистратор,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Шкала КАК Шкала,
	               |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ТаблицаПоказанийПриборовУчета.Разница КАК ОбъемУслугиПотребленный,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение,
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	               |	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	               |	ТаблицаПоказанийПриборовУчета.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	               |	ТаблицаПоказанийПриборовУчета.ПоказанияПредоставлены КАК ПоказанияПредоставлены,
	               |	ТаблицаПоказанийПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	               |	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	               |	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	               |	ВложенныйЗапрос.ИсточникПоступления КАК ИсточникПоступления,
	               |	ТаблицаПоказанийПриборовУчета.Переворот КАК Переворот,
	               |	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	               |	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	               |	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаПоказанийПриборовУчета.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	               |	ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний
	               |ПОМЕСТИТЬ ДанныеПоказаний
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	               |		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	               |		ТаблицаШкал.Шкала КАК Шкала,
	               |		ТаблицаШкал.IDСтроки КАК IDСтроки,
	               |		энргАбоненты.Организация КАК Организация,
	               |		энргАбоненты.Район КАК Район,
	               |		ТаблицаПриборовУчета.КлючПомещения КАК КлючПомещения,
	               |		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	               |		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	               |		ТаблицаПриборовУчета.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	               |		&Период КАК Период,
	               |		ТаблицаДокумента.ИсточникПоступления КАК ИсточникПоступления,
	               |		ТаблицаДокумента.ИсточникПоступления.ИсточникПоказаний КАК ИсточникПоказаний
	               |	ИЗ
	               |		Документ.энргПлатежноеПоручениеВходящие.ТочкиУчета КАК ТаблицаПриборовУчета
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.ШкалыПриборовУчета КАК ТаблицаШкал
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	               |				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	               |				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие КАК ТаблицаДокумента
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	               |			ПО ТаблицаПриборовУчета.Абонент = энргАбоненты.Ссылка) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	               |		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	               |			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеПоказаний.ДокРегистратор КАК ДокРегистратор,
	               |	ДанныеПоказаний.Район КАК Район,
	               |	ДанныеПоказаний.Организация КАК Организация,
	               |	ДанныеПоказаний.Шкала КАК Шкала,
	               |	ДанныеПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ДанныеПоказаний.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	               |	ДанныеПоказаний.ПериодНачисления КАК ПериодНачисления,
	               |	ДанныеПоказаний.ТочкаУчета КАК ТочкаУчета,
	               |	ДанныеПоказаний.Строение КАК Строение,
	               |	ДанныеПоказаний.Помещение КАК Помещение,
	               |	ДанныеПоказаний.Период КАК Период,
	               |	ДанныеПоказаний.ЧастныйСектор КАК ЧастныйСектор
	               |ИЗ
	               |	ДанныеПоказаний КАК ДанныеПоказаний
	               |ГДЕ
	               |	ДанныеПоказаний.РегистрируетОбъем
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеПоказаний.Период КАК Период,
	               |	ДанныеПоказаний.Организация КАК Организация,
	               |	ДанныеПоказаний.Район КАК Район,
	               |	ДанныеПоказаний.КлючПомещения КАК КлючПомещения,
	               |	ДанныеПоказаний.ПриборУчета КАК ПриборУчета,
	               |	ДанныеПоказаний.Шкала КАК Шкала,
	               |	ДанныеПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ДанныеПоказаний.ТекущиеПоказания КАК Показание,
	               |	ДанныеПоказаний.СостояниеПоказаний КАК СостояниеПоказаний,
	               |	ДанныеПоказаний.ИсточникПоступления = ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.КонтрольныйСъем) КАК КС,
	               |	ДанныеПоказаний.ИсточникПоказаний КАК ИсточникПоказаний,
	               |	ДанныеПоказаний.ПричинаОтклонения КАК ПричинаОтклонения,
	               |	ДанныеПоказаний.Переворот КАК Переворот,
	               |	ДанныеПоказаний.ПериодНачисления КАК ПериодНачисления,
	               |	ДанныеПоказаний.Период КАК ПериодРегистрации,
	               |	ДанныеПоказаний.НомерСтроки КАК НомерСтрокиТЧ,
	               |	ДанныеПоказаний.ТочкаУчета КАК ТочкаУчета
	               |ИЗ
	               |	ДанныеПоказаний КАК ДанныеПоказаний
	               |ГДЕ
	               |	НЕ ДанныеПоказаний.РегистрируетОбъем
	               |	И ВЫБОР
	               |			КОГДА ДанныеПоказаний.СтатусИзмененПользователем
	               |					ИЛИ ДанныеПоказаний.ПереворотИзмененПользователем
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НЕ ДанныеПоказаний.ПричинаОтклонения В (&ПричиныОтклоненияИсключая)
	               |		КОНЕЦ
	               |	И ДанныеПоказаний.ПоказанияПредоставлены
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КлючПомещения,
	               |	ПриборУчета,
	               |	Шкала,
	               |	ТарифнаяЗона";
	
	ПричиныОтклоненияИсключая = Новый Массив;//энргРаботаСПоказаниямиПриборовУчетаСервер.ПричиныОтклоненияИсключая();
	
	Запрос.УстановитьПараметр("ДокументСсылка"				, Ссылка);
	Запрос.УстановитьПараметр("Период"						, Дата);
	Запрос.УстановитьПараметр("ПричиныОтклоненияИсключая"	, ПричиныОтклоненияИсключая);
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;	
КонецФункции

Процедура ЗарегистрироватьПоказанияПриборовУчета(РезультатЗапроса)
	Набор 				= Движения.энргПоказанияПриборовУчета;
	Выборка 			= РезультатЗапроса.Выбрать();			
	ТекКлючПомещения	= Неопределено;
	ТекПриборУчета 		= Неопределено;
	ТекТарифнаяЗона 	= Неопределено;
	ТекРазделитель 		= 0;
	
	Пока Выборка.следующий() цикл
		Если ТекКлючПомещения = Выборка.КлючПомещения И ТекПриборУчета = Выборка.ПриборУчета И ТекТарифнаяЗона = Выборка.ТарифнаяЗона тогда
			ТекРазделитель 				= ТекРазделитель + 1;
		иначе
			ТекРазделитель 				= 0;
		КонецЕсли;	
		Запись  						= Набор.добавить();		
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.Разделитель 				= ТекРазделитель;
		ТекКлючПомещения  				= Выборка.КлючПомещения;
		ТекПриборУчета 					= Выборка.ПриборУчета;
		ТекТарифнаяЗона 				= Выборка.ТарифнаяЗона;
	КонецЦикла;
КонецПроцедуры

Процедура ЗафиксироватьОбъемСреднего(Результат)
	Выборка 				= Результат.Выбрать();
	НаборРасчетСреднего 	= РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
	НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНабор  			= НаборРасчетСреднего.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНабор,Выборка);	
		СтрокаНабор.ОбъемУслуги = Выборка.ОбъемУслугиПотребленный;
		
	КонецЦикла;
	НаборРасчетСреднего.Записать(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьЕдиничнуюОплатуИзЗагрузкиДанных

Процедура ЗаполнитьЕдиничнуюОплатуИзЗагрузкиДанных(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДобавлениеЕдиничнойОплаты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеЗаполнения,
		"ДобавлениеЕдиничнойОплаты",
		Неопределено);
		
	Если ДобавлениеЕдиничнойОплаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДобавлениеЕдиничнойОплаты);
		
КонецПроцедуры 
	
#КонецОбласти

#Область РаботаСОплатой

Процедура ОбновитьСуммаОстатокОплаты(Отказ)
	
	Ошибки = Новый Массив;
	
	ШаблонОшибки = "В строке номер %1 по абоненту %2 некорректно распределена сумма оплаты";
	Для Каждого СтрокаНабора из Оплата Цикл
		
		СуммаПереноса = ОпределитьСуммуПереносаПоИдентификаторуСтроки(СтрокаНабора.IDСтроки);
		СтрокаНабора.СуммаОстаток = СтрокаНабора.СуммаОплаты - СтрокаНабора.Авизо - СуммаПереноса;
		
		СуммаРаспределенияОплатыНаЗадолженность = ОпределитьСуммуРаспределенияОплатыНаЗадолженностьПоИдентификаторуСтроки(СтрокаНабора.IDСтроки);		
		ОбщаяСумма = СтрокаНабора.Авизо + СуммаПереноса + СуммаРаспределенияОплатыНаЗадолженность; 		
		
		Если СтрокаНабора.СуммаОплаты < ОбщаяСумма Тогда
			Ошибки.Добавить(СтрШаблон(ШаблонОшибки, СтрокаНабора.НомерСтроки, СтрокаНабора.Абонент));			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		Отказ = Истина;
		СообщениеИсключения = СтрСоединить(Ошибки, Символы.ПС);
		ОбщегоНазначения.СообщитьПользователю(СообщениеИсключения);
		ВызватьИсключение СообщениеИсключения;
	КонецЕсли;
			
КонецПроцедуры

Функция ОпределитьСуммуПереносаПоИдентификаторуСтроки(ИдентификаторСтроки)
	Возврат ПереносСуммыОплаты.Выгрузить(Новый Структура("IDСтроки", ИдентификаторСтроки), "СуммаПереноса").Итог("СуммаПереноса");
КонецФункции        

Функция ОпределитьСуммуРаспределенияОплатыНаЗадолженностьПоИдентификаторуСтроки(ИдентификаторСтроки)
	Возврат Задолженность.Выгрузить(Новый Структура("IDСтроки", ИдентификаторСтроки), "СуммаОплаты").Итог("СуммаОплаты");
КонецФункции

#КонецОбласти

#Область РаботаССостояниемДокументовПоказаний

Процедура ПроверитьДокументыРегистрацииПоказаний(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ОтменитьПроверкуДокументовРегистрацииПоказаний") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоПроведение = РежимЗаписи = РежимЗаписиДокумента.Проведение;
	ЭтоОтменаПроведения = РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ ПометкаУдаления;
	
	Если Не ЭтоПроведение и НЕ ЭтоОтменаПроведения Тогда
		Возврат;
	КонецЕсли; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И энргРегистрацияПоказанийАбонента.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	Если ЭтоПроведение Тогда 
		
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И энргРегистрацияПоказанийАбонента.Проведен",
			"И НЕ энргРегистрацияПоказанийАбонента.Проведен
			|	И НЕ энргРегистрацияПоказанийАбонента.ПометкаУдаления");
		
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПроведение Тогда
		
		Отказ = Истина;
		Комментарий = "Перед проведением текущего документа, необходимо провести связанные документы регистрации показаний";
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий; 
		
	КонецЕсли;
	
	Если ЭтоОтменаПроведения Тогда
		
		Отказ = Истина;
		Комментарий = "Перед отменой проведения текущего документа, необходимо отменить проведение связанных документов регистрации показаний";
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий; 
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли