#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ПредыдущийТипСтроения = Перечисления.энргТипыСтроений.МКД Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя изменить МКД");
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка); 			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ИзменитьТипСтроения(Отказ, НовыйТипСтроения);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ИзменитьТипСтроения(Отказ, ПредыдущийТипСтроения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьТипСтроения(Отказ, ТипСтроения)
	Результат = Обработки.энргСтроенияМенеджер.ЗначенияСвойствОбъекта(МКД, "ТипСтроения");
	Если ТипСтроения = Результат.ТипСтроения Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		энргРаботаСЛицевымСчетомСервер.ИзменитьТипСтроения(МКД, ТипСтроения, Истина);		
	Исключение
		Отказ 			= Истина;
		ОписаниеОшибки 	= ИнформацияОбОшибке();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ОписаниеОшибки));
	КонецПопытки; 		
КонецПроцедуры
	
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли