#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргПлатежноеПоручениеВходящие(ЭтотОбъект);	
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    

КонецПроцедуры

#КонецОбласти   


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	Запрос = Новый Запрос;	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	СУММА(энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты) КАК СуммаОплаты,
	|	энргПлатежноеПоручениеВходящиеОплата.Ссылка.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|ГДЕ
	|	энргПлатежноеПоручениеВходящиеОплата.Ссылка.ДокументОснование В(&ДокументОснование)
	|	И энргПлатежноеПоручениеВходящиеОплата.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПлатежноеПоручениеВходящиеОплата.Ссылка.ДокументОснование"; 	
	
	Запрос.УстановитьПараметр("ДокументОснование", Строки.ПолучитьКлючи());
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаСписка = Строки[Выборка.ДокументОснование];		
		СтрокаСписка.Данные["СуммаПоДокументу"] = Выборка.СуммаОплаты;		
		
	КонецЦикла;
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти    

