#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	ПериодыНачисления = Новый Соответствие;
	Если Параметры.Свойство("ПериодыНачисления", ПериодыНачисления) Тогда
		Для каждого ТекПериод Из ПериодыНачисления Цикл
			СтрокаТЗ = ВыбранныеПериодыНаисления.Добавить();
			
			СтрокаТЗ.ПериодНачисления = ТекПериод.Ключ;
			СтрокаТЗ.Флаг			  = Истина;
		КонецЦикла;
	КонецЕсли;
	
	ОДНПоСпособуНачисления = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КаталогСохранения = ПолучитьИмяВременногоФайла(".tmp");
	КаталогСохранения = СтрЗаменить(КаталогСохранения, ".tmp", "");
	
	СоздатьКаталог(КаталогСохранения);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КаталогНаДиске = Новый Файл(КаталогСохранения);
	Если КаталогНаДиске.Существует() Тогда
		УдалитьФайлы(КаталогСохранения); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрикрепитьКвитанции(Команда)
	СписокФайлов = Новый Массив;
	
	
	Для каждого СтрокаТЗ Из ВыбранныеПериодыНаисления Цикл
		Если Не СтрокаТЗ.Флаг Тогда
			Продолжить;
		КонецЕсли;
		
		ТабДок		= Новый ТабличныйДокумент;
		
		
		Результат 	= ПолучитьПараметрыПечати(ТабДок, СтрокаТЗ.ПериодНачисления, Организация, Район, Абонент, КаталогСохранения, ОДНПоСпособуНачисления);
		
		ИмяМакета			= Макет;
		ТаблицаМакета 		= "Обработка.энргПечатьКвитанций1";
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Район);
		МассивОбъектов.Добавить(Организация);
		МассивОбъектов.Добавить(МКД);
		МассивОбъектов.Добавить(Абонент);
		
		Префикс = "Квитанция ";
		
		ТабличныйДокумент = ПолучитьДокументПечати(МассивОбъектов,Результат, ИмяМакета);
		
		СтрокаТЗ.ИмяФайла 	= Префикс + "_" + Формат(СтрокаТЗ.ПериодНачисления, "ДФ='MM.yyyy'") + ".pdf";
		СтрокаТЗ.ПутьКФайлу = КаталогСохранения + "\" + СтрокаТЗ.ИмяФайла;
		ТабличныйДокумент.Записать(СтрокаТЗ.ПутьКФайлу, ТипФайлаТабличногоДокумента.PDF);
		
		Двоичное = Новый ДвоичныеДанные(СтрокаТЗ.ПутьКФайлу);
		АдресФайла = ПоместитьВоВременноеХранилище(Двоичное);
		ЭлемМасс = Новый Структура("Представление, ПериодНачисления, Значение", СтрокаТЗ.ИмяФайла, СтрокаТЗ.ПериодНачисления, АдресФайла);
		СписокФайлов.Добавить(ЭлемМасс);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СписокФайлов) Тогда
		ПрикрепитьКвитанцииНаСервере(СтартоваяЗадача, СписокФайлов);
	КонецЕсли;
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	Для каждого СтрокаТЗ Из ВыбранныеПериодыНаисления Цикл
		СтрокаТЗ.Флаг = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	Для каждого СтрокаТЗ Из ВыбранныеПериодыНаисления Цикл
		СтрокаТЗ.Флаг = Истина;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ДополнительныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыПечати(ТабДок, ПериодНачисления, Организация, Район, Абонент, КаталогСохранения, ОДНПоСпособуНачисления)
	ДеньЗавершенияСтруктура = РегистрыСведений.энргДатыОтчетногоПериодыОбщиеНастройки.Получить(Новый Структура("Организация", Организация));
	Если Не ЗначениеЗаполнено(ДеньЗавершенияСтруктура.Завершение) Тогда
		ДеньЗавершения = 26;
	Иначе
		ДеньЗавершения = ДеньЗавершенияСтруктура.Завершение;
	КонецЕсли;	
	ДеньЗавершения = Мин(ДеньЗавершения, День(КонецМесяца(ПериодНачисления)));
	
	КонецПериода	= Дата(ГОД(ПериодНачисления), Месяц(ПериодНачисления), ДеньЗавершения, 23, 59, 59);
	//НачалоПериода	= Дата(ГОД(ДобавитьМесяц(ПериодНачисления, -1)), Месяц(ДобавитьМесяц(ПериодНачисления, -1)), 27);
	НачалоПериода	= НачалоДня(ДобавитьМесяц(КонецПериода, -1) + 1);
	МассивАбонентов	= Новый Массив;
	МассивАбонентов.Добавить(Абонент);
	СпособыДоставкиЕПД = Новый Массив;
	Районы = Новый Массив;
	Районы.Добавить(Район);
	
	УчитыватьСписание	= ПериодНачисления >= Константы.бестДатаСменыФормыЕПД.Получить() И ЗначениеЗаполнено(Константы.бестДатаСменыФормыЕПД.Получить());
	Возврат Новый Структура("ПериодФормированияКвитанций, ПериодНачисления, НачалоПериода, КонецПериода, Организация, ФормироватьQRКод, ФормироватьВPDF, КаталогСохранения, ФормироватьРеестрЕПД, МассивАбонентов, СпособыДоставкиЕПД, ТабДок, УслугаБезОДН,КаталогСохранения, Районы, УслугаПоНормативу, УчитыватьСписание, ОДНПоСпособуНачисления", 
								ПериодНачисления, ПериодНачисления, НачалоПериода, КонецПериода, Организация, Истина, Истина, КаталогСохранения, Ложь, МассивАбонентов, СпособыДоставкиЕПД, ТабДок, Неопределено, КаталогСохранения, Районы, Неопределено, УчитыватьСписание, ОДНПоСпособуНачисления);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДокументПечати(МассивОбъектов, Результат, ИмяМакета)
	РезультатСтруктура = ПолучитьВременСтруктуруДляФайлаПечати(ИмяМакета);
	ТабДок = Обработки.энргПечатьКвитанций1.ПолучитьТабличныйДокумент(МассивОбъектов,Результат,РезультатСтруктура,Неопределено,Неопределено);
	Возврат ТабДок;
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьВременСтруктуруДляФайлаПечати(ИмяМакета)
	Макеты = Новый ТаблицаЗначений;
	Макеты.Колонки.Добавить("ИмяМакета");
	Макеты.Колонки.Добавить("СинонимМакета");
	
	Стр = Макеты.Добавить();
	Если ИмяМакета = "бестКвитанцияАТЭК"  Тогда 
		
		Стр.ИмяМакета = "бестКвитанцияАТЭК";
		Стр.СинонимМакета = "Квитанция";
	ИначеЕсли ИмяМакета = "бестКвитанцияАТЭКСписаниеСреднего"  Тогда 
		
		Стр.ИмяМакета = "бестКвитанцияАТЭКСписаниеСреднего";
		Стр.СинонимМакета = "Квитанция";
	ИначеЕсли ИмяМакета = "бестКвитанцияОТЭКНовая"  Тогда 
		
		Стр.ИмяМакета = "бестКвитанцияОТЭКНовая";
		Стр.СинонимМакета = "Квитанция";

	ИначеЕсли ИмяМакета = "бестРеестрЕПД"
		ТОгда 
		Стр.ИмяМакета = "бестРеестрЕПД"
	КонецЕсли;
	
	Возврат Макеты;
КонецФункции

&НаСервереБезКонтекста
Процедура ПрикрепитьКвитанцииНаСервере(СтартоваяЗадача, СписокФайлов)

	Задачи.энргЗадачаПИД.ПрикрепитьФайлы(СтартоваяЗадача, СписокФайлов, Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли