#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ПолучитьУслугу(КомпоновщикНастроек.Настройки.ПараметрыДанных);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьУслугу(ПараметрыДанных) Экспорт
	ПараметрыДанных.УстановитьЗначениеПараметра("Тепло", Справочники.энргВидыУслуг.НайтиПоКоду("000000046"));
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли