#Область ПрограммныйИнтерфейс

// Получает действующие приборы учета по объекту расчета.
//
// Параметры:
//  Период									-	Дата.
//  Организация								-	СправочникСсылка.Организации.
//  Район									-	СправочникСсылка.энргЗоныОтвественности.
//  ОбъектРасчета							-	СправочникСсылка.бестОбъектыРасчета.
//  СТочкамиБезПриборов						-	Булево.
//  БезУзлов								-	Булево.
//  МВТ										-	МенеджерВременныхТаблиц.
//  ПростыеУслуги							-	Булево.
//  ТочкаУслуги								-	Справочник.энргТочкиУчета.
//  СПриборамиБезВидаДифференцированности	-	Булево.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДействующиеПриборыУчетаПоОбъектуРасчета(Период,Организация,Район,ОбъектРасчета = Неопределено,СТочкамиБезПриборов = Ложь, БезУзлов = Ложь, МВТ = Неопределено, ПростыеУслуги = Ложь, ТочкаУслуги = Неопределено, СПриборамиБезВидаДифференцированности = Ложь) Экспорт 
	
	Запрос  		= Новый Запрос;
	Если МВТ <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МВТ;
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",			ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета",				ТочкаУслуги);
	
	Запрос.Текст = ТекстЗапросаДействующиеПриборыУчетаПоОбъектуРасчета(ОбъектРасчета,СТочкамиБезПриборов, БезУзлов, ПростыеУслуги, ТочкаУслуги, СПриборамиБезВидаДифференцированности);	
	
	Если МВТ = Неопределено Тогда
		Пакет = запрос.ВыполнитьПакетСПромежуточнымиДанными();
		Результат = Пакет[Пакет.Количество() - 1];
		Возврат Результат;
	Иначе
		Результат  = Запрос.Выполнить();
	КонецЕсли;
КонецФункции

// Получает действующие приборы учета по объекту с показаниями.
//
// Параметры:
//  Период									-	Дата.
//  Организация								-	СправочникСсылка.Организации.
//  Район									-	СправочникСсылка.энргЗоныОтвественности.
//  ОбъектРасчета							-	СправочникСсылка.бестОбъектыРасчета.
// 
// Возвращаемое значение:
//  РезультатЗапроса.
//
Функция ДействующиеПриборыУчетаПоОбъектуРасчетаСПоказаниями(Период,Организация,Район,ОбъектРасчета = Неопределено) Экспорт 

	Запрос  		= Новый Запрос;  
	МВТ				= Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",			ОбъектРасчета);
	
	Запрос.Текст = ТекстЗапросаДействующиеПриборыУчетаПоОбъектуРасчета(ОбъектРасчета,Ложь, Ложь, Ложь, Неопределено, Ложь);	
	
	Параметры  								= Новый Структура("Организация,Район,Дата,ОбъектРасчета",Организация, Район, Новый Граница(Период,ВидГраницы.Исключая), ОбъектРасчета);   	
	
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.МаксимальныеПоказанияСрезПоследних(МВТ,"энргМаксимальныеПоказанияСрезПоследних",Параметры);
	
	Запрос.МенеджерВременныхТаблиц	 = МВТ;
	
	Запрос.Текст = Запрос.Текст + 
	"; ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ВидДифференцированности КАК ВидДифференцированности,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.ПриборУчета КАК ПриборУчета,
	|	Итог.РегистрируетОбъем КАК РегистрируетОбъем,
	|	Итог.ЗаводскойНомерПриборУчета КАК ЗаводскойНомерПриборУчета,
	|	Итог.ВидПараметра КАК ВидПараметра,
	|	Итог.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	Итог.ВидКанальности КАК ВидКанальности,
	|	энргМаксимальныеПоказанияСрезПоследних.Показание КАК Показание
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргМаксимальныеПоказанияСрезПоследних КАК энргМаксимальныеПоказанияСрезПоследних
	|		ПО Итог.ПриборУчета = энргМаксимальныеПоказанияСрезПоследних.ПриборУчета
	|			И Итог.Шкала = энргМаксимальныеПоказанияСрезПоследних.Шкала
	|			И Итог.ТарифнаяЗона = энргМаксимальныеПоказанияСрезПоследних.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Итог.ОбъектРасчета,
	|	Итог.ТочкаУчета,
	|	Итог.ПриборУчета,
	|	Итог.Шкала";
	
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Результат = Пакет[Пакет.Количество() - 1];
	
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаДействующиеПриборыУчетаПоОбъектуРасчета(ОбъектРасчета, СТочкамиБезПриборов, БезУзлов, ПростыеУслуги, ТочкаУслуги, СПриборамиБезВидаДифференцированности)
   Текст 	=
	"ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета
	|				И ТочкаУчета = &ТочкаУчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|                                          
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочекУчета
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ТочкаУчета, ОбъектРасчета) В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета,
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестПриборыТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета.ВидКанальности КАК ВидКанальности
	|ПОМЕСТИТЬ ВведенныеПриборы
	|ИЗ
	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ПриборыТочекУчета.ОбъектРасчета КАК ОбъектРасчета,
	|						ПриборыТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|						ПриборыТочекУчета.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ПриборыТочекУчета КАК ПриборыТочекУчета)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВведенныеПриборы.ОбъектРасчета КАК ОбъектРасчета,
	|	ВведенныеПриборы.ТочкаУчета КАК ТочкаУчета,
	|	ВведенныеПриборы.ВидКанальности КАК ВидКанальности,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВведенныеПриборы.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	ВведенныеПриборы КАК ВведенныеПриборы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВведенныеПриборы.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|ГДЕ
	|	НЕ ВведенныеПриборы.ПриборУчета.РегистрируетОбъем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВидыДифференцированностиТочекУчета
	|ИЗ
	|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ПриборУчета В
	|					(ВЫБРАТЬ
	|						ДанныеПоПриборам.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ДанныеПоПриборам КАК ДанныеПоПриборам)) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПараметрыИзмерителейСрезПоследних.Измеритель КАК Измеритель,
	|	бестПараметрыИзмерителейСрезПоследних.ВидПараметра КАК ВидПараметра,
	|	бестПараметрыИзмерителейСрезПоследних.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	бестПараметрыИзмерителейСрезПоследних.Шкала КАК Шкала
	|ПОМЕСТИТЬ ВТ_ПараметрыИзмерителей
	|ИЗ
	|	РегистрСведений.бестПараметрыИзмерителей.СрезПоследних(
	|			&Период,
	|			Измеритель В
	|				(ВЫБРАТЬ
	|					ДанныеПоПриборам.ПриборУчета КАК ПриборУчета
	|				ИЗ
	|					ДанныеПоПриборам КАК ДанныеПоПриборам)) КАК бестПараметрыИзмерителейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	
	Если ПростыеУслуги Тогда
		Текст 	=  Текст + Символы.ПС +
		"ВЫБРАТЬ
		|	Вложенныйзапрос.ОбъектРасчета КАК ОбъектРасчета,
		|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
		|	Вложенныйзапрос.Шкала КАК Шкала,
		|	ВЫБОР
		|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
		|			ТОГДА Вложенныйзапрос.Услуга
		|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
		|	КОНЕЦ КАК Услуга,
		|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
		|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
		|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
		|	Вложенныйзапрос.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
		|	Вложенныйзапрос.ПриборУчета.Код КАК ЗаводскойНомерПриборУчета,
		|	ВТ_ПараметрыИзмерителей.ВидПараметра КАК ВидПараметра,
		|	ВТ_ПараметрыИзмерителей.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	Вложенныйзапрос.ВидКанальности КАК ВидКанальности
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеПоПриборам.ОбъектРасчета КАК ОбъектРасчета,
		|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
		|		ДанныеПоПриборам.Шкала КАК Шкала,
		|		ЕСТЬNULL(УслугиТочекУчета.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
		|		ЕСТЬNULL(ВидыДифференцированностиТочекУчета.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
		|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
		|		ДанныеПоПриборам.ВидКанальности КАК ВидКанальности
		|	ИЗ
		|		ДанныеПоПриборам КАК ДанныеПоПриборам
		|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
		|			ПО ДанныеПоПриборам.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчета КАК ВидыДифференцированностиТочекУчета
		|			ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчета.ПриборУчета
		|				И ДанныеПоПриборам.Шкала = ВидыДифференцированностиТочекУчета.Шкала) КАК Вложенныйзапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
		|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыИзмерителей КАК ВТ_ПараметрыИзмерителей
		|		ПО Вложенныйзапрос.ПриборУчета = ВТ_ПараметрыИзмерителей.Измеритель
		|			И Вложенныйзапрос.Шкала = ВТ_ПараметрыИзмерителей.Шкала
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО Вложенныйзапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка";
		
	Иначе
		Текст 	=  Текст + Символы.ПС +
		"ВЫБРАТЬ
		|	Вложенныйзапрос.ОбъектРасчета КАК ОбъектРасчета,
		|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
		|	Вложенныйзапрос.Шкала КАК Шкала,
		|	Вложенныйзапрос.Услуга КАК Услуга,
		|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
		|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
		|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
		|	Вложенныйзапрос.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
		|	Вложенныйзапрос.ПриборУчета.Код КАК ЗаводскойНомерПриборУчета,
		|	ВТ_ПараметрыИзмерителей.ВидПараметра КАК ВидПараметра,
		|	ВТ_ПараметрыИзмерителей.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	Вложенныйзапрос.ВидКанальности КАК ВидКанальности
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеПоПриборам.ОбъектРасчета КАК ОбъектРасчета,
		|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
		|		ДанныеПоПриборам.Шкала КАК Шкала,
		|		ЕСТЬNULL(УслугиТочекУчета.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
		|		ЕСТЬNULL(ВидыДифференцированностиТочекУчета.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
		|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
		|		ДанныеПоПриборам.ВидКанальности КАК ВидКанальности
		|	ИЗ
		|		ДанныеПоПриборам КАК ДанныеПоПриборам
		|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
		|			ПО ДанныеПоПриборам.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчета КАК ВидыДифференцированностиТочекУчета
		|			ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчета.ПриборУчета
		|				И ДанныеПоПриборам.Шкала = ВидыДифференцированностиТочекУчета.Шкала) КАК Вложенныйзапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
		|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыИзмерителей КАК ВТ_ПараметрыИзмерителей
		|		ПО Вложенныйзапрос.ПриборУчета = ВТ_ПараметрыИзмерителей.Измеритель
		|			И Вложенныйзапрос.Шкала = ВТ_ПараметрыИзмерителей.Шкала";
	КонецЕсли;
	
	Если СТочкамиБезПриборов Тогда
		Если ПростыеУслуги Тогда
			Текст 	= Текст 	+ Символы.ПС + 
			"ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	АктивныеТочкиУчетаОбъекта.ОбъектРасчета,
			|	АктивныеТочкиУчетаОбъекта.ТочкаУчета,
			|	NULL,
			|	ВЫБОР
			|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
			|			ТОГДА УслугиТочекУчета.Услуга
			|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
			|	КОНЕЦ КАК Услуга,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL
			|ИЗ
			|	АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
			|		ПО АктивныеТочкиУчетаОбъекта.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПриборам КАК ДанныеПоПриборам
			|		ПО АктивныеТочкиУчетаОбъекта.ОбъектРасчета = ДанныеПоПриборам.ОбъектРасчета
			|			И АктивныеТочкиУчетаОбъекта.ТочкаУчета = ДанныеПоПриборам.ТочкаУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
			|		ПО УслугиТочекУчета.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
			|ГДЕ
			|	ДанныеПоПриборам.ПриборУчета ЕСТЬ NULL";
		Иначе
			Текст 	= Текст 	+ Символы.ПС + 
			"ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	АктивныеТочкиУчетаОбъекта.ОбъектРасчета,
			|	АктивныеТочкиУчетаОбъекта.ТочкаУчета,
			|	NULL,
			|	УслугиТочекУчета.Услуга,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL
			|ИЗ
			|	АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
			|		ПО АктивныеТочкиУчетаОбъекта.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПриборам КАК ДанныеПоПриборам
			|		ПО АктивныеТочкиУчетаОбъекта.ОбъектРасчета = ДанныеПоПриборам.ОбъектРасчета
			|			И АктивныеТочкиУчетаОбъекта.ТочкаУчета = ДанныеПоПриборам.ТочкаУчета
			|ГДЕ
			|	ДанныеПоПриборам.ПриборУчета ЕСТЬ NULL";
		КонецЕсли;
	КонецЕсли;
	
	Если СПриборамиБезВидаДифференцированности Тогда
		Текст = СтрЗаменить(Текст, 
									"ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны",
									"ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны");
	КонецЕсли;
	
	Текст 	=  Текст + Символы.ПС +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ВидДифференцированности КАК ВидДифференцированности,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.ПриборУчета КАК ПриборУчета,
	|	Итог.РегистрируетОбъем КАК РегистрируетОбъем,
	|	Итог.ЗаводскойНомерПриборУчета КАК ЗаводскойНомерПриборУчета,
	|	Итог.ВидПараметра КАК ВидПараметра,
	|	Итог.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	Итог.ВидКанальности КАК ВидКанальности
	|ИЗ
	|	Итог КАК Итог
	|	УПОРЯДОЧИТЬ ПО
	|	Итог.ОбъектРасчета,
	|	Итог.ТочкаУчета,
	|	Итог.ПриборУчета,
	|	Итог.Шкала";
	
	
	Если НЕ БезУзлов Тогда
		
		Текст = СтрЗаменить(Текст,"НЕ ВложенныйЗапрос.ПриборУчета.РегистрируетОбъем", "ИСТИНА");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Текст = СтрЗаменить(Текст, "ОбъектРасчета = &ОбъектРасчета", "Истина");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТочкаУслуги) Тогда
		Текст = СтрЗаменить(Текст, "ТочкаУчета = &ТочкаУчета", "Истина");  
	КонецЕсли;
	
	Если ТипЗнч(ОбъектРасчета) = Тип("Массив") Тогда
		Текст = СтрЗаменить(Текст,"ОбъектРасчета = &ОбъектРасчета", "ОбъектРасчета В (&ОбъектРасчета)");
	КонецЕсли;
	
		
	
	Возврат Текст;	

КонецФункции

// Получает действующие приборы учета по объекту расчета с измерителями.
// Получение измерителей, используется в объектах рнт.
//
// Параметры:
//  Период				-	Дата.
//  Организация			-	СправочникСсылка.Организации.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  ОбъектРасчета		-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета			-	СправочникСсылка.энргТочкиУчета.
//  МВТ					-	МенеджерВременныхТаблиц.
// 
// Возвращаемое значение:
//  Массив	-	массив с пакетами результата запроса.
//
Функция ДействующиеПриборыУчетаПоОбъектуРасчетаСИзмерителями(Период,Организация,Район,ОбъектРасчета = Неопределено,ТочкаУчета = Неопределено,МВТ = Неопределено) Экспорт 
	
	Запрос  		= Новый Запрос;
	Если МВТ <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МВТ;
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета
	|				И ТочкаУчета = &ТочкаУчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочекУчета
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ТочкаУчета, ОбъектРасчета) В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета,
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестПриборыТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета.ВидКанальности КАК ВидКанальности
	|ПОМЕСТИТЬ ВведенныеПриборы
	|ИЗ
	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ПриборыТочекУчета.ОбъектРасчета КАК ОбъектРасчета,
	|						ПриборыТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|						ПриборыТочекУчета.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ПриборыТочекУчета КАК ПриборыТочекУчета)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВведенныеПриборы.ОбъектРасчета КАК ОбъектРасчета,
	|	ВведенныеПриборы.ТочкаУчета КАК ТочкаУчета,
	|	ВведенныеПриборы.ВидКанальности КАК ВидКанальности,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВведенныеПриборы.ПриборУчета КАК ПриборУчета,
	|	энргПриборыУчетаАбонента.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргПриборыУчетаАбонента.ТипУзлаУчета КАК ТипУзлаУчета
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	ВведенныеПриборы КАК ВведенныеПриборы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВведенныеПриборы.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВведенныеПриборы.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|ГДЕ
	|	НЕ ВведенныеПриборы.ПриборУчета.РегистрируетОбъем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВидыДифференцированностиТочекУчета
	|ИЗ
	|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ПриборУчета В
	|					(ВЫБРАТЬ
	|						ДанныеПоПриборам.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ДанныеПоПриборам КАК ДанныеПоПриборам)) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПараметрыИзмерителейСрезПоследних.Измеритель КАК Измеритель,
	|	бестПараметрыИзмерителейСрезПоследних.ВидПараметра КАК ВидПараметра,
	|	бестПараметрыИзмерителейСрезПоследних.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	бестПараметрыИзмерителейСрезПоследних.Шкала КАК Шкала
	|ПОМЕСТИТЬ ВТ_ПараметрыИзмерителей
	|ИЗ
	|	РегистрСведений.бестПараметрыИзмерителей.СрезПоследних(
	|			&Период,
	|			Измеритель В
	|				(ВЫБРАТЬ
	|					ДанныеПоПриборам.ПриборУчета КАК ПриборУчета
	|				ИЗ
	|					ДанныеПоПриборам КАК ДанныеПоПриборам)) КАК бестПараметрыИзмерителейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	ИСТИНА КАК ВспомогательноеОборудование,
	|	бестПриборыУзловУчетаНПСрезПоследних.ТипИзмерителя КАК ТипИзмерителя,
	|	энргПриборыУчетаАбонента.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ Измерители
	|ИЗ
	|	РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета, УзелУчета) В
	|					(ВЫБРАТЬ
	|						ДанныеПоПриборам.ОбъектРасчета КАК ОбъектРасчета,
	|						ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|						ДанныеПоПриборам.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ДанныеПоПриборам КАК ДанныеПоПриборам)) КАК бестПриборыУзловУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложенныйзапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|	Вложенныйзапрос.Шкала КАК Шкала,
	|	Вложенныйзапрос.Услуга КАК Услуга,
	|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|	Вложенныйзапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВТ_ПараметрыИзмерителей.ВидПараметра КАК ВидПараметра,
	|	Вложенныйзапрос.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	Вложенныйзапрос.ВидКанальности КАК ВидКанальности,
	|	Вложенныйзапрос.ТипУзлаУчета КАК ТипУзлаУчета,
	|	энргТипыПриборовУчета.Родитель КАК ТипИзмерителя
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоПриборам.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоПриборам.Шкала КАК Шкала,
	|		ЕСТЬNULL(УслугиТочекУчета.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|		ЕСТЬNULL(ВидыДифференцированностиТочекУчета.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
	|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|		ДанныеПоПриборам.ВидКанальности КАК ВидКанальности,
	|		ДанныеПоПриборам.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|		ДанныеПоПриборам.РегистрируетОбъем КАК РегистрируетОбъем,
	|		ДанныеПоПриборам.ТипУзлаУчета КАК ТипУзлаУчета
	|	ИЗ
	|		ДанныеПоПриборам КАК ДанныеПоПриборам
	|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
	|			ПО ДанныеПоПриборам.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчета КАК ВидыДифференцированностиТочекУчета
	|			ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчета.ПриборУчета
	|				И ДанныеПоПриборам.Шкала = ВидыДифференцированностиТочекУчета.Шкала) КАК Вложенныйзапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыИзмерителей КАК ВТ_ПараметрыИзмерителей
	|		ПО Вложенныйзапрос.ПриборУчета = ВТ_ПараметрыИзмерителей.Измеритель
	|			И Вложенныйзапрос.Шкала = ВТ_ПараметрыИзмерителей.Шкала
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	|		ПО Вложенныйзапрос.ПриборУчета.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	Итог.Шкала КАК Шкала,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ВидДифференцированности КАК ВидДифференцированности,
	|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Итог.ПриборУчета КАК ПриборУчетаВывод,
	|	Итог.РегистрируетОбъем КАК РегистрируетОбъем,
	|	Итог.ВидПараметра КАК ВидПараметра,
	|	Итог.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	Итог.ВидКанальности КАК ВидКанальности,
	|	Итог.ТипУзлаУчета КАК ТипУзлаУчета,
	|	Итог.ТипИзмерителя КАК ТипИзмерителя
	|ИЗ
	|	Итог КАК Итог
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТочкаУчета,
	|	Шкала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Измерители.ТочкаУчета КАК ТочкаУчета,
	|	Измерители.ПриборУчета КАК ПриборУчета,
	|	Измерители.ВспомогательноеОборудование КАК ВспомогательноеОборудование,
	|	Измерители.ТипИзмерителя КАК ТипИзмерителя,
	|	Измерители.РасположениеИзмерителя КАК РасположениеИзмерителя
	|ИЗ
	|	Измерители КАК Измерители";
	
	Если ОбъектРасчета = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОбъектРасчета = &ОбъектРасчета", "");
	Иначе
		Запрос.УстановитьПараметр("ОбъектРасчета",			ОбъектРасчета);
	КонецЕсли;
	
	Если ТочкаУчета = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТочкаУчета = &ТочкаУчета", "");
	Иначе
		Запрос.УстановитьПараметр("ТочкаУчета",			ТочкаУчета);
	КонецЕсли;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
КонецФункции

// Получает массив действующих приборов учета.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  СИзмерителями	-	Булево.
// 
// Возвращаемое значение:
//   Массив	из СправочникСсылка.энргПриборыУчетаАбонента.
//
Функция ПолучитьМассивДействующихПриборовУчета(Период,Организация,Район,ОбъектРасчета,ТочкаУчета = Неопределено, СИзмерителями = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Если СИзмерителями Тогда
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	бестСостояниеПриборовУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестСостояниеПриборовУчетаНПСрезПоследних.Район КАК Район,
		|	бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ Узлы
		|ИЗ
		|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестСостояниеПриборовУчетаНПСрезПоследних
		|ГДЕ
		|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
		|ИЗ
		|	Узлы КАК Узлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И ОбъектРасчета = &ОбъектРасчета
		|					И ТочкаУчета = &ТочкаУчета) КАК бестПриборыУзловУчетаНПСрезПоследних
		|		ПО Узлы.Организация = бестПриборыУзловУчетаНПСрезПоследних.Организация
		|			И Узлы.Район = бестПриборыУзловУчетаНПСрезПоследних.Район
		|			И Узлы.ОбъектРасчета = бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета
		|			И Узлы.ТочкаУчета = бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета
		|			И Узлы.ПриборУчета = бестПриборыУзловУчетаНПСрезПоследних.УзелУчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Узлы.ПриборУчета
		|ИЗ
		|	Узлы КАК Узлы";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
		|ИЗ
		|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестСостояниеПриборовУчетаНПСрезПоследних
		|ГДЕ
		|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод)";
		
	КонецЕсли;
	
	
	
	Запрос.УстановитьПараметр("Период"			,Период);
	Запрос.УстановитьПараметр("Организация"		,Организация);
	Запрос.УстановитьПараметр("Район"			,Район);
	Запрос.УстановитьПараметр("ОбъектРасчета"	,ОбъектРасчета);
	Если НЕ ЗначениеЗаполнено(ТочкаУчета) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТочкаУчета = &ТочкаУчета", "Истина");
	Иначе
		Запрос.УстановитьПараметр("ТочкаУчета"		,ТочкаУчета);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПриборУчета");		
	
КонецФункции

// Получает выведеные приборы.
//
// Параметры:
//  ПараметрыОперации	-	Структура:
//   * МоментВремени	-	Дата.
//   * Организация		-	СправочникСсылка.Организации.
//   * Район			-	СправочникСсылка.энргЗоныОтвественности.
//   * ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//   * МассивТочекУчета	-	Массив из СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПриборыВыведены(ПараметрыОперации) Экспорт 
	Запрос  =		Новый Запрос;
	Запрос.установитьПараметр("МоментВремени",		ПараметрыОперации.МоментВремени);
	Запрос.установитьПараметр("Организация",		ПараметрыОперации.Организация);
	Запрос.установитьПараметр("Район",				ПараметрыОперации.Район);
	Запрос.установитьПараметр("ОбъектРасчета",		ПараметрыОперации.ОбъектРасчета);
	Запрос.установитьПараметр("МассивТочекУчета",	ПараметрыОперации.МассивТочекУчета);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочек
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета
	|				И ТочкаУчета В (&МассивТочекУчета)) КАК бестПриборыТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В (&МассивТочекУчета)
	|				И (ОбъектРасчета, ТочкаУчета, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ПриборыТочек.ОбъектРасчета,
	|						ПриборыТочек.ТочкаУчета,
	|						ПриборыТочек.ПриборУчета
	|					ИЗ
	|						ПриборыТочек КАК ПриборыТочек)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеприборовУчета.Ввод)";
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
КонецФункции

#Область УстаревшиеМетоды  

// Получает начало конец действия коммерческого учета.
// Устаревшая.
// Параметры:
//  Организация			-	СправочникСсылка.энргЗоныОтвественности.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Дата				-	Дата.
//  СтрокаТУ			-	Объект.ТочкиУчета.
//  МКД					-	СправочникСсылка.энргСтроения.
//  Договор				-	СправочникСсылка.энргДоговорыКонтрагентов.
//  ОбъектРасчета		-	СправочникСсылка.бестОбъектыРасчета.
//
Процедура ПолучитьНачалоКонецДействияКоммерческогоУчета(Организация, Район, Дата, СтрокаТУ, МКД = Неопределено, Договор = Неопределено, ОбъектРасчета = Неопределено) Экспорт
	Если ЗначениеЗаполнено(МКД) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
		|ИЗ
		|	РегистрСведений.энргДопускПриборовУчетаККоммерческомуУчетуМКД.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета
		|				И ПриборУчета = &ПриборУчета
		|				И МКД = &МКД) КАК энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("МКД", МКД);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПриборУчета", СтрокаТУ.ПриборУчета);
		Запрос.УстановитьПараметр("Район", Район);
		Запрос.УстановитьПараметр("ТочкаУчета", СтрокаТУ.ТочкаУчета);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТУ.НачалоДействияКоммерскогоУчета = ВыборкаДетальныеЗаписи.НачалоДействияКоммерскогоУчета;
			СтрокаТУ.КонецПериодаКоммерскогоУчета = ВыборкаДетальныеЗаписи.КонецПериодаКоммерскогоУчета;
		КонецЦикла;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
		|ИЗ
		|	РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета
		|				И ПриборУчета = &ПриборУчета
		|				И ОбъектРасчета = &ОбъектРасчета) КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПриборУчета", СтрокаТУ.ПриборУчета);
		Запрос.УстановитьПараметр("Район", Район);
		Запрос.УстановитьПараметр("ТочкаУчета", СтрокаТУ.ТочкаУчета);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТУ.НачалоДействияКоммерскогоУчета = ВыборкаДетальныеЗаписи.НачалоДействияКоммерскогоУчета;
			СтрокаТУ.КонецДействияКоммерскогоУчета = ВыборкаДетальныеЗаписи.КонецПериодаКоммерскогоУчета;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

// Получает бест способ начисления норматива.
// Устаревшая.
// Параметры:
//  Организация		-	СправочникСсылка.энргЗоныОтвественности.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  Дата			-	Дата.
//  СтрокаТУ		-	Объект.ТочкиУчета.
//  ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//
Процедура ПолучитьбестСпособНачисленияНорматива(Организация, Район, Дата, СтрокаТУ, ОбъектРасчета) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестСпособНачисленияНормативаНПСрезПоследних.СпособРасчетаНорматива КАК СпособРасчетаНорматива
	|ИЗ
	|	РегистрСведений.бестСпособНачисленияНормативаНП.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета = &ТочкаУчета
	|				И Услуга = &Услуга
	|				И ОбъектРасчета = &ОбъектРасчета) КАК бестСпособНачисленияНормативаНПСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкаУчета", СтрокаТУ.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", СтрокаТУ.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТУ.СпособРасчетаНорматива = ВыборкаДетальныеЗаписи.СпособРасчетаНорматива;
	КонецЦикла;
	
КонецПроцедуры

// Получает действующие приборы учета по договору для узлов.
// Устаревшая.
// Параметры:
//  Период				-	Дата.
//  Организация			-	СправочникСсылка.энргЗоныОтвественности.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  ПериодНачисления	-	Дата.
//  Договор				-	СправочникСсылка.энргДоговорыКонтрагентов.
//  ОбъектРасчета		-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета			-	СправочникСсылка.энргТочкиУчета.
//  МКД					-	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//  Массив	-	массив с пакетами результата запроса.
//
Функция ДействующиеПриборыУчетаПоДоговоруДляУзлов(Период,Организация,Район,ПериодНачисления, Договор = Неопределено, ОбъектРасчета = Неопределено, ТочкаУчета = Неопределено, МКД = Неопределено) Экспорт 
	
	ГраницыПериода  								= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",					Период);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериода",			КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Договор",				Договор);
	Запрос.УстановитьПараметр("ОбъектРасчета",			ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета",				ТочкаУчета);
	Запрос.УстановитьПараметр("МКД",					МКД);
	Запрос.УстановитьПараметр("НачалоПериодаКонецДня",	НачалоПериодаРасчета + 59 + 59*60);
	
	
	
	Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия,
	|	энргВидыУслуг.Ссылка КАК Услуга
	|ПОМЕСТИТЬ ОтопительныйПериод
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргДлительностиПериодов.Сезонность КАК Сезонность,
	|		ДЕНЬ(энргДлительностиПериодов.НачалоПериода) КАК ДеньНачала,
	|		МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) КАК МесяцНачала,
	|		ДЕНЬ(энргДлительностиПериодов.КонецПериода) КАК ДеньОкончания,
	|		МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|					И МЕСЯЦ(энргДлительностиПериодов.КонецПериода) >= МЕСЯЦ(&Период)
	|				ТОГДА ГОД(&Период) - 1
	|			ИНАЧЕ ГОД(&Период)
	|		КОНЕЦ КАК ГодНачало,
	|		ВЫБОР
	|			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|					И МЕСЯЦ(энргДлительностиПериодов.КонецПериода) >= МЕСЯЦ(&Период)
	|				ТОГДА ГОД(&Период)
	|			ИНАЧЕ ГОД(&Период) + 1
	|		КОНЕЦ КАК ГодОкончания
	|	ИЗ
	|		РегистрСведений.энргДлительностиПериодов.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Сезонность = энргВидыУслуг.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДоговорыТочекУчетаСрезПоследних.Организация КАК Организация,
	|	бестДоговорыТочекУчетаСрезПоследних.Район КАК Район,
	|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Отбор
	|ИЗ
	|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета
	|				И ТочкаУчета = &ТочкаУчета) КАК бестДоговорыТочекУчетаСрезПоследних
	|ГДЕ
	|	бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&НачалоПериода,
	|			(Организация, Район, ОбъектРасчета, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.ОбъектРасчета,
	|					ВТ.ТочкаУчета
	|				ИЗ
	|					ВТ_Отбор КАК ВТ)) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	И бестОбъектыРасчета.МКД = &МКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНП.ТочкаУчета,
	|	бестАктивностьТочекУчетаНП.ОбъектРасчета,
	|	бестАктивностьТочекУчетаНП.Период
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП КАК бестАктивностьТочекУчетаНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО бестАктивностьТочекУчетаНП.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	бестАктивностьТочекУчетаНП.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	И бестАктивностьТочекУчетаНП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бестОбъектыРасчета.МКД = &МКД
	|	И (бестАктивностьТочекУчетаНП.Организация, бестАктивностьТочекУчетаНП.Район, бестАктивностьТочекУчетаНП.ОбъектРасчета, бестАктивностьТочекУчетаНП.ТочкаУчета) В
	|			(ВЫБРАТЬ
	|				ВТ.Организация,
	|				ВТ.Район,
	|				ВТ.ОбъектРасчета,
	|				ВТ.ТочкаУчета
	|			ИЗ
	|				ВТ_Отбор КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестАктивностьТочекУчетаНП.Период КАК Период,
	|	бестАктивностьТочекУчетаНП.Состояние КАК Состояние
	|ПОМЕСТИТЬ СостояниеТочкиУчетаТекПериод
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП КАК бестАктивностьТочекУчетаНП
	|ГДЕ
	|	бестАктивностьТочекУчетаНП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (бестАктивностьТочекУчетаНП.Организация, бестАктивностьТочекУчетаНП.Район, бестАктивностьТочекУчетаНП.ОбъектРасчета, бестАктивностьТочекУчетаНП.ТочкаУчета) В
	|			(ВЫБРАТЬ
	|				ВТ.Организация,
	|				ВТ.Район,
	|				ВТ.ОбъектРасчета,
	|				ВТ.ТочкаУчета
	|			ИЗ
	|				ВТ_Отбор КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК энргВладельцыТочекУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета,
	|	АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ДействующиеТочкиУчета
	|ИЗ
	|	ТочкиУчетаОбъекта КАК ТочкиУчетаОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
	|		ПО ТочкиУчетаОбъекта.ТочкаУчета = АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ПриборыТочекУчета
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестПриборыТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|			И (НЕ энргПриборыУчетаАбонента.ПометкаУдаления)
	|			И (энргПриборыУчетаАбонента.РегистрируетОбъем)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыУзловУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестПриборыУзловУчетаНПСрезПоследних.Район КАК Район,
	|	бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.УзелУчета КАК УзелУчета,
	|	бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВычислителиУзловУчета
	|ИЗ
	|	ПриборыТочекУчета КАК ПриборыТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыУзловУчетаНП.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район
	|					И (ОбъектРасчета, ТочкаУчета, УзелУчета) В
	|						(ВЫБРАТЬ
	|							ПриборыТочекУчета.ОбъектРасчета,
	|							ПриборыТочекУчета.ТочкаУчета,
	|							ПриборыТочекУчета.ПриборУчета
	|						ИЗ
	|							ПриборыТочекУчета КАК ПриборыТочекУчета)) КАК бестПриборыУзловУчетаНПСрезПоследних
	|		ПО ПриборыТочекУчета.ОбъектРасчета = бестПриборыУзловУчетаНПСрезПоследних.ОбъектРасчета
	|			И ПриборыТочекУчета.ТочкаУчета = бестПриборыУзловУчетаНПСрезПоследних.ТочкаУчета
	|			И ПриборыТочекУчета.ПриборУчета = бестПриборыУзловУчетаНПСрезПоследних.УзелУчета
	|			И (бестПриборыУзловУчетаНПСрезПоследних.ПриборУчета.ТипПрибораУчета.бестЯвляетсяВычислителем)
	|ГДЕ
	|	бестПриборыУзловУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеВычислителиУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|	ДействующиеВычислителиУзловУчета.ПриборУчета КАК ПриборУчета,
	|	ЕСТЬNULL(бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияКомУчета,
	|	ДействующиеВычислителиУзловУчета.Организация КАК Организация,
	|	ДействующиеВычислителиУзловУчета.Район КАК Район,
	|	ДействующиеВычислителиУзловУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ДействующиеВычислителиУзловУчета.УзелУчета КАК УзелУчета
	|ПОМЕСТИТЬ КомУчетПриборов
	|ИЗ
	|	ВычислителиУзловУчета КАК ДействующиеВычислителиУзловУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних
	|		ПО ДействующиеВычислителиУзловУчета.ТочкаУчета = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ТочкаУчета
	|			И ДействующиеВычислителиУзловУчета.ПриборУчета = бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ПриборыТочекУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	КомУчетПриборов.ДатаОкончанияКомУчета КАК ДатаОкончанияКомУчета
	|ПОМЕСТИТЬ УзлыУчетаКомУчет
	|ИЗ
	|	ПриборыТочекУчета КАК ПриборыТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КомУчетПриборов КАК КомУчетПриборов
	|		ПО ПриборыТочекУчета.ОбъектРасчета = КомУчетПриборов.ОбъектРасчета
	|			И ПриборыТочекУчета.ТочкаУчета = КомУчетПриборов.ТочкаУчета
	|			И ПриборыТочекУчета.ПриборУчета = КомУчетПриборов.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	УзлыУчетаКомУчет.ПриборУчета КАК ПриборУчета,
	|	ДействующиеТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	УзлыУчетаКомУчет.ДатаОкончанияКомУчета КАК ДатаОкончанияКомУчета
	|ПОМЕСТИТЬ ПриборыДействующихТочек
	|ИЗ
	|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УзлыУчетаКомУчет КАК УзлыУчетаКомУчет
	|		ПО ДействующиеТочкиУчета.ОбъектРасчета = УзлыУчетаКомУчет.ОбъектРасчета
	|			И ДействующиеТочкиУчета.ТочкаУчета = УзлыУчетаКомУчет.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			(Организация, Район, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.ТочкаУчета
	|				ИЗ
	|					ВТ_Отбор КАК ВТ)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	УслугиТочекУчета.Услуга КАК Услуга,
	|	энргВидыУслуг.СоставнаяУслуга КАК СоставнаяУслуга
	|ПОМЕСТИТЬ СостУслуга
	|ИЗ
	|	УслугиТочекУчета КАК УслугиТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО УслугиТочекУчета.Услуга = энргВидыУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиТочекУчета.ТочкаУчета,
	|	УслугиТочекУчета.Услуга,
	|	энргВидыУслуг.СоставнаяУслуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостУслуга.ТочкаУчета КАК ТочкаУчета,
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга,
	|	СостУслуга.Услуга КАК СоставнаяУслуга
	|ПОМЕСТИТЬ УпрощаемУслугу
	|ИЗ
	|	СостУслуга КАК СостУслуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО СостУслуга.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|ГДЕ
	|	СостУслуга.СоставнаяУслуга
	|
	|СГРУППИРОВАТЬ ПО
	|	СостУслуга.ТочкаУчета,
	|	энргВидыУслугСоставляющиеУслуг.Услуга,
	|	СостУслуга.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостУслуга.ТочкаУчета,
	|	СостУслуга.Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргвидыуслуг.пустаяссылка)
	|ИЗ
	|	СостУслуга КАК СостУслуга
	|ГДЕ
	|	НЕ СостУслуга.СоставнаяУслуга
	|
	|СГРУППИРОВАТЬ ПО
	|	СостУслуга.ТочкаУчета,
	|	СостУслуга.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УпрощаемУслугу.ТочкаУчета КАК ТочкаУчета,
	|	УпрощаемУслугу.Услуга КАК Услуга,
	|	УпрощаемУслугу.СоставнаяУслуга КАК СоставнаяУслуга
	|ПОМЕСТИТЬ УслугиСУчетомСезонности
	|ИЗ
	|	УпрощаемУслугу КАК УпрощаемУслугу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УслугиСУчетомСезонности.ТочкаУчета КАК ТочкаУчета,
	|	УслугиСУчетомСезонности.Услуга КАК Услуга,
	|	ЕСТЬNULL(бестПоставщикиУслугНПСрезПоследних.Поставщик, """") КАК Поставщик,
	|	УслугиСУчетомСезонности.СоставнаяУслуга КАК СоставнаяУслуга
	|ПОМЕСТИТЬ УслСПоставщиком
	|ИЗ
	|	УслугиСУчетомСезонности КАК УслугиСУчетомСезонности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПоставщикиУслугНПСрезПоследних
	|		ПО УслугиСУчетомСезонности.Услуга = бестПоставщикиУслугНПСрезПоследних.Услуга
	|			И УслугиСУчетомСезонности.ТочкаУчета = бестПоставщикиУслугНПСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыДействующихТочек.ОбъектРасчета КАК ОбъектРасчета,
	|	ПриборыДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыДействующихТочек.ПриборУчета КАК ПриборУчета,
	|	ПриборыДействующихТочек.ПриборУчета.ВидКанальности КАК ВидКанальности,
	|	ПриборыДействующихТочек.ДатаОкончанияКомУчета КАК ДатаОкончанияКомУчета
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	ПриборыДействующихТочек КАК ПриборыДействующихТочек
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриборыДействующихТочек.ОбъектРасчета,
	|	ПриборыДействующихТочек.ТочкаУчета,
	|	ПриборыДействующихТочек.ПриборУчета,
	|	ПриборыДействующихТочек.ПриборУчета.ВидКанальности,
	|	ПриборыДействующихТочек.ДатаОкончанияКомУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВидыДифференцированностиТочекУчета
	|ИЗ
	|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ПриборУчета В
	|					(ВЫБРАТЬ
	|						ДанныеПоПриборам.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ДанныеПоПриборам КАК ДанныеПоПриборам)) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложенныйзапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|	Вложенныйзапрос.Услуга КАК Услуга,
	|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Вложенныйзапрос.Поставщик КАК Поставщик,
	|	Вложенныйзапрос.ДатаОкончанияКомУчета КАК ДатаОкончанияКомУчета,
	|	Вложенныйзапрос.СоставнаяУслуга КАК СоставнаяУслуга
	|ПОМЕСТИТЬ ВрТ15
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоПриборам.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|		ЕСТЬNULL(УслСПоставщиком.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|		ВЫБОР
	|			КОГДА ВидыДифференцированностиТочекУчета.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.пустаяссылка)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|			ИНАЧЕ ЕСТЬNULL(ВидыДифференцированностиТочекУчета.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный))
	|		КОНЕЦ КАК ВидДифференцированности,
	|		УслСПоставщиком.Поставщик КАК Поставщик,
	|		ДанныеПоПриборам.ДатаОкончанияКомУчета КАК ДатаОкончанияКомУчета,
	|		УслСПоставщиком.СоставнаяУслуга КАК СоставнаяУслуга
	|	ИЗ
	|		ДанныеПоПриборам КАК ДанныеПоПриборам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслСПоставщиком КАК УслСПоставщиком
	|			ПО ДанныеПоПриборам.ТочкаУчета = УслСПоставщиком.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчета КАК ВидыДифференцированностиТочекУчета
	|			ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчета.ПриборУчета) КАК Вложенныйзапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Вложенныйзапрос.ОбъектРасчета,
	|	Вложенныйзапрос.ТочкаУчета,
	|	Вложенныйзапрос.ПриборУчета,
	|	Вложенныйзапрос.Услуга,
	|	Вложенныйзапрос.ВидДифференцированности,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона,
	|	Вложенныйзапрос.Поставщик,
	|	Вложенныйзапрос.ДатаОкончанияКомУчета,
	|	Вложенныйзапрос.СоставнаяУслуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостояниеТочкиУчетаТекПериод.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеТочкиУчетаТекПериод.Период КАК Период,
	|	ВЫБОР
	|		КОГДА СостояниеТочкиУчетаТекПериод.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|			ТОГДА ИСТИНА
	|		КОГДА СостояниеТочкиУчетаТекПериод.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена)
	|			ТОГДА ЛОЖЬ
	|	КОНЕЦ КАК Состояние,
	|	УслугиСУчетомСезонности.Услуга КАК Услуга
	|ПОМЕСТИТЬ СобытияТУТекПериод
	|ИЗ
	|	СостояниеТочкиУчетаТекПериод КАК СостояниеТочкиУчетаТекПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиСУчетомСезонности КАК УслугиСУчетомСезонности
	|		ПО СостояниеТочкиУчетаТекПериод.ТочкаУчета = УслугиСУчетомСезонности.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиСУчетомСезонности.ТочкаУчета,
	|	КОНЕЦПЕРИОДА(ОтопительныйПериод.КонецПериодаДействия, ДЕНЬ),
	|	ЛОЖЬ,
	|	УслугиСУчетомСезонности.Услуга
	|ИЗ
	|	УслугиСУчетомСезонности КАК УслугиСУчетомСезонности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтопительныйПериод КАК ОтопительныйПериод
	|		ПО УслугиСУчетомСезонности.Услуга = ОтопительныйПериод.Услуга
	|			И (ОтопительныйПериод.КонецПериодаДействия > &НачалоПериода)
	|			И (ОтопительныйПериод.КонецПериодаДействия < &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиСУчетомСезонности.ТочкаУчета,
	|	&НачалоПериода,
	|	ИСТИНА,
	|	УслугиСУчетомСезонности.Услуга
	|ИЗ
	|	УслугиСУчетомСезонности КАК УслугиСУчетомСезонности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияТУТекПериод.ТочкаУчета КАК ТочкаУчета,
	|	СобытияТУТекПериод.Период КАК Период,
	|	МИНИМУМ(СобытияТУТекПериод.Состояние) КАК Состояние,
	|	СобытияТУТекПериод.Услуга КАК Услуга
	|ПОМЕСТИТЬ СобытияТУТекПериодГрупп
	|ИЗ
	|	СобытияТУТекПериод КАК СобытияТУТекПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияТУТекПериод.ТочкаУчета,
	|	СобытияТУТекПериод.Период,
	|	СобытияТУТекПериод.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияТУТекПериодГрупп.ТочкаУчета КАК ТочкаУчета,
	|	СобытияТУТекПериодГрупп.Период КАК Период,
	|	КОЛИЧЕСТВО(СобытияТУТекПериодГрупп1.Период) КАК ПорядковыйНомер,
	|	СобытияТУТекПериодГрупп.Услуга КАК Услуга
	|ПОМЕСТИТЬ СостояниеТУНомерСтроки
	|ИЗ
	|	СобытияТУТекПериодГрупп КАК СобытияТУТекПериодГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СобытияТУТекПериодГрупп КАК СобытияТУТекПериодГрупп1
	|		ПО СобытияТУТекПериодГрупп.Период >= СобытияТУТекПериодГрупп1.Период
	|			И СобытияТУТекПериодГрупп.ТочкаУчета = СобытияТУТекПериодГрупп1.ТочкаУчета
	|			И СобытияТУТекПериодГрупп.Услуга = СобытияТУТекПериодГрупп1.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияТУТекПериодГрупп.ТочкаУчета,
	|	СобытияТУТекПериодГрупп.Период,
	|	СобытияТУТекПериодГрупп.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияТУТекПериодГрупп.ТочкаУчета КАК ТочкаУчета,
	|	СобытияТУТекПериодГрупп.Период КАК Период,
	|	СобытияТУТекПериодГрупп.Состояние КАК Состояние,
	|	СостояниеТУНомерСтроки.ПорядковыйНомер КАК ПорядковыйНомер,
	|	СобытияТУТекПериодГрупп.Услуга КАК Услуга
	|ПОМЕСТИТЬ СостояниеТУПорядок
	|ИЗ
	|	СобытияТУТекПериодГрупп КАК СобытияТУТекПериодГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СостояниеТУНомерСтроки КАК СостояниеТУНомерСтроки
	|		ПО СобытияТУТекПериодГрупп.ТочкаУчета = СостояниеТУНомерСтроки.ТочкаУчета
	|			И СобытияТУТекПериодГрупп.Период = СостояниеТУНомерСтроки.Период
	|			И СобытияТУТекПериодГрупп.Услуга = СостояниеТУНомерСтроки.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета) КАК КонецПериодаКоммерскогоУчета
	|ПОМЕСТИТЬ ДопускККомУчету
	|ИЗ
	|	РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
	|			&Период,
	|			Район = &Район
	|				И Организация = &Организация
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						ДействующиеТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|						ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						ДействующиеТочкиУчета КАК ДействующиеТочкиУчета)) КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостояниеТУНачало.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеТУНачало.Период КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА СостояниеТУКонец.Период ЕСТЬ NULL
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(СостояниеТУКонец.Период, СЕКУНДА, -1)
	|	КОНЕЦ КАК КонецПериода,
	|	СостояниеТУНачало.Состояние КАК Состояние,
	|	СостояниеТУНачало.Услуга КАК Услуга
	|ПОМЕСТИТЬ ПериодыСостоянияТУ
	|ИЗ
	|	СостояниеТУПорядок КАК СостояниеТУНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеТУПорядок КАК СостояниеТУКонец
	|		ПО СостояниеТУНачало.ТочкаУчета = СостояниеТУКонец.ТочкаУчета
	|			И (СостояниеТУНачало.ПорядковыйНомер = СостояниеТУКонец.ПорядковыйНомер - 1)
	|			И СостояниеТУНачало.Услуга = СостояниеТУКонец.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыСостоянияТУ.ТочкаУчета КАК ТочкаУчета,
	|	СУММА(ВЫБОР
	|			КОГДА ПериодыСостоянияТУ.КонецПериода <> &КонецПериода
	|				ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.КонецПериода, ЧАС), ЧАС) + 1
	|			ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.КонецПериода, ЧАС), ЧАС)
	|		КОНЕЦ) КАК КоличествоЧасов,
	|	ПериодыСостоянияТУ.Услуга КАК Услуга,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ДопускККомУчету.ТочкаУчета ЕСТЬ NULL
	|					И ДопускККомУчету.КонецПериодаКоммерскогоУчета > &НачалоПериода
	|					И ДопускККомУчету.КонецПериодаКоммерскогоУчета > ПериодыСостоянияТУ.НачалоПериода
	|				ТОГДА ВЫБОР
	|						КОГДА ДопускККомУчету.КонецПериодаКоммерскогоУчета < ПериодыСостоянияТУ.КонецПериода
	|							ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДопускККомУчету.КонецПериодаКоммерскогоУчета, ЧАС), ЧАС)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПериодыСостоянияТУ.КонецПериода <> &КонецПериода
	|									ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.КонецПериода, ЧАС), ЧАС) + 1
	|								ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ПериодыСостоянияТУ.КонецПериода, ЧАС), ЧАС)
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоЧасовРаботыВКоммерческомУчете
	|ПОМЕСТИТЬ КоличествоЧасовРаботыТУТекПериод
	|ИЗ
	|	ПериодыСостоянияТУ КАК ПериодыСостоянияТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДопускККомУчету КАК ДопускККомУчету
	|		ПО ПериодыСостоянияТУ.ТочкаУчета = ДопускККомУчету.ТочкаУчета
	|ГДЕ
	|	ПериодыСостоянияТУ.Состояние
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыСостоянияТУ.ТочкаУчета,
	|	ПериодыСостоянияТУ.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВрТ15.ОбъектРасчета КАК ОбъектРасчета,
	|	ВрТ15.ТочкаУчета КАК ТочкаУчета,
	|	ВрТ15.ПриборУчета КАК ПриборУчета,
	|	ВрТ15.Услуга КАК Услуга,
	|	ВрТ15.ВидДифференцированности КАК ВидДифференцированности,
	|	ВрТ15.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка, 0) КАК ЗначениеНагрузки,
	|	ВрТ15.Поставщик КАК Поставщик,
	|	ДопускККомУчету.КонецПериодаКоммерскогоУчета КАК ДатаОкончанияКомУчета,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ДоговорнойОбъем,
	|	ВЫБОР
	|		КОГДА КоличествоЧасовРаботыТУТекПериод.КоличествоЧасов ЕСТЬ NULL
	|			ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(&КонецПериода, ЧАС), ЧАС)
	|		ИНАЧЕ КоличествоЧасовРаботыТУТекПериод.КоличествоЧасов
	|	КОНЕЦ КАК КоличествоЧасовРаботыТУ,
	|	ВЫБОР
	|		КОГДА КоличествоЧасовРаботыТУТекПериод.КоличествоЧасов ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ДопускККомУчету.КонецПериодаКоммерскогоУчета < &НачалоПериода
	|						ТОГДА 0
	|					КОГДА ДопускККомУчету.КонецПериодаКоммерскогоУчета < &КонецПериода
	|						ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(ДопускККомУчету.КонецПериодаКоммерскогоУчета, ЧАС), ЧАС)
	|					ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, ЧАС), НАЧАЛОПЕРИОДА(&КонецПериода, ЧАС), ЧАС)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КоличествоЧасовРаботыТУТекПериод.КоличествоЧасовРаботыВКоммерческомУчете < 0
	|					ТОГДА 0
	|				ИНАЧЕ КоличествоЧасовРаботыТУТекПериод.КоличествоЧасовРаботыВКоммерческомУчете
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоЧасовРаботыВКоммерческомУчете,
	|	ВрТ15.СоставнаяУслуга КАК СоставнаяУслуга,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент
	|ИЗ
	|	ВрТ15 КАК ВрТ15
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНагрузкаПоУслугамНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестНагрузкаПоУслугамНПСрезПоследних
	|		ПО ВрТ15.ОбъектРасчета = бестНагрузкаПоУслугамНПСрезПоследних.ОбъектРасчета
	|			И ВрТ15.Услуга = бестНагрузкаПоУслугамНПСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И Месяц = МЕСЯЦ(&ПериодНачисления)) КАК бестГарантированныеОбъемыСрезПоследних
	|		ПО ВрТ15.ОбъектРасчета = бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета
	|			И ВрТ15.Услуга = бестГарантированныеОбъемыСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоЧасовРаботыТУТекПериод КАК КоличествоЧасовРаботыТУТекПериод
	|		ПО ВрТ15.ТочкаУчета = КоличествоЧасовРаботыТУТекПериод.ТочкаУчета
	|			И ВрТ15.Услуга = КоличествоЧасовРаботыТУТекПериод.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДопускККомУчету КАК ДопускККомУчету
	|		ПО ВрТ15.ТочкаУчета = ДопускККомУчету.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ПО бестДоговорыТочекУчетаСрезПоследних.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ПО ВрТ15.ОбъектРасчета = бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ВрТ15.ТочкаУчета = бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета
	|			И ВрТ15.Услуга = бестДоговорыТочекУчетаСрезПоследних.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектРасчета,
	|	ТочкаУчета,
	|	Услуга
	|АВТОУПОРЯДОЧИВАНИЕ";	
	//Результат  = Запрос.Выполнить();
	
	Если НЕ ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Текст = СтрЗаменить(Текст, "ОбъектРасчета = &ОбъектРасчета", " ИСТИНА ");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТочкаУчета) Тогда
		Текст = СтрЗаменить(Текст, "ТочкаУчета = &ТочкаУчета", " ИСТИНА ");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МКД) Тогда
		Текст = СтрЗаменить(Текст, "бестОбъектыРасчета.МКД = &МКД", "ИСТИНА");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Текст = СтрЗаменить(Текст, "бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст	= Текст;
	Пакет			= запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Результат		= Пакет[Пакет.Количество() - 1];
	Возврат Результат;
КонецФункции

// Получает данные для массового ввода.
// Устаревшая, используется только для документа бестРегистрацияПоказанийНПОбщий.
// Параметры:
//  Период				-	Дата.
//  ПериодНачисления	-	Дата.
//  Организация			-	СправочникСсылка.энргЗоныОтвественности.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Договор				-	СправочникСсылка.энргДоговорыКонтрагентов.
//  МКД					-	СправочникСсылка.энргСтроения.
//  ОбъектРасчета		-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета			-	СправочникСсылка.энргТочкиУчета.
//  Услуга				-	СправочникСсылка.энргВидыУслуг.
//  Контролер			-	СправочникСсылка.энргСотрудники.
//  
// Возвращаемое значение:
//  Массив	-	массив с пакетами результата запроса.
//
Функция ДанныеДляМассовогоВвода(Период, ПериодНачисления, Организация, Район, Договор, МКД, ОбъектРасчета, ТочкаУчета, Услуга, Контролер = Неопределено) Экспорт	
	
	ГраницыПериода  								= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	МВТ  									= Новый МенеджерВременныхТаблиц;
	Параметры  								= Новый Структура("Организация,Район,Дата",Организация, Район, новый Граница(Период, ВидГраницы.Исключая));
	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Параметры.Вставить("ОбъектРасчета", ОбъектРасчета);
	КонецЕсли;
	
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.МаксимальныеПоказанияСрезПоследних(МВТ,"энргМаксимальныеПоказанияСрезПоследних",Параметры);

	
	Запрос  		= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц			= МВТ;
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Договор",				Договор);
	Запрос.УстановитьПараметр("МКД",					МКД);
	Запрос.УстановитьПараметр("ОбъектРасчета",			ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета",				ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга",					Услуга);
	Запрос.УстановитьПараметр("Контролер",				Контролер);
	
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	
	Запрос.УстановитьПараметр("НачалоПредМесяца",		ДобавитьМесяц(НачалоПериодаРасчета, -1));
	Запрос.УстановитьПараметр("КонецПредМесяца",		ДобавитьМесяц(КонецПериодаРасчета, -1));
	Запрос.УстановитьПараметр("НачалоМесяцаПредГод",	ДобавитьМесяц(НачалоПериодаРасчета, -12));
	Запрос.УстановитьПараметр("КонецМесяцаПредГод",		ДобавитьМесяц(КонецПериодаРасчета, -12));
	
	Текст 	=  
	"ВЫБРАТЬ
	|	бестДоговорыТочекУчетаСрезПоследних.Организация КАК Организация,
	|	бестДоговорыТочекУчетаСрезПоследних.Район КАК Район,
	|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Отбор
	|ИЗ
	|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета
	|				И ТочкаУчета = &ТочкаУчета) КАК бестДоговорыТочекУчетаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
	|	И бестОбъектыРасчета.Контролер = &Контролер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестАктивностьТочекУчетаНПСрезПоследних.Район КАК Район
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			(Организация, Район, ОбъектРасчета, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.ОбъектРасчета,
	|					ВТ.ТочкаУчета
	|				ИЗ
	|					ВТ_Отбор КАК ВТ)) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	И бестОбъектыРасчета.МКД = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Район КАК Район,
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Отбор.Договор КАК Договор
	|ПОМЕСТИТЬ ВведенныеПриборы
	|ИЗ
	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)
	|				И ОбъектРасчета = &ОбъектРасчета) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|			И (НЕ энргПриборыУчетаАбонента.ПометкаУдаления)
	|			И (НЕ энргПриборыУчетаАбонента.РегистрируетОбъем)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Отбор КАК ВТ_Отбор
	|		ПО бестСостояниеПриборовУчетаНПСрезПоследних.Организация = ВТ_Отбор.Организация
	|			И бестСостояниеПриборовУчетаНПСрезПоследних.Район = ВТ_Отбор.Район
	|			И бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета = ВТ_Отбор.ОбъектРасчета
	|			И бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета = ВТ_Отбор.ТочкаУчета
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестУслугиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестУслугиТочекУчетаНПСрезПоследних.Район КАК Район,
	|	бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВведенныеПриборы.ТочкаУчета КАК ТочкаУчета,
	|	ВведенныеПриборы.ПриборУчета КАК ПриборУчета,
	|	ВведенныеПриборы.Организация КАК Организация,
	|	ВведенныеПриборы.Район КАК Район,
	|	УслугиТочекУчета.Услуга КАК Услуга,
	|	ВведенныеПриборы.ОбъектРасчета КАК ОбъектРасчета,
	|	ВведенныеПриборы.Договор КАК Договор
	|ПОМЕСТИТЬ ПриборыУчетаСУслугой
	|ИЗ
	|	ВведенныеПриборы КАК ВведенныеПриборы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
	|		ПО ВведенныеПриборы.Организация = УслугиТочекУчета.Организация
	|			И ВведенныеПриборы.Район = УслугиТочекУчета.Район
	|			И ВведенныеПриборы.ОбъектРасчета = УслугиТочекУчета.ОбъектРасчета
	|			И ВведенныеПриборы.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала КАК Шкала,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ВидыДифференцированностиТочекУчета
	|ИЗ
	|	РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта)) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриборыУчетаСУслугой.ОбъектРасчета КАК ОбъектРасчета,
	|	ПриборыУчетаСУслугой.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыУчетаСУслугой.ПриборУчета.ВидКанальности КАК ВидКанальности,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ПриборыУчетаСУслугой.ПриборУчета КАК ПриборУчета,
	|	ПриборыУчетаСУслугой.Услуга КАК Услуга,
	|	ПриборыУчетаСУслугой.Договор КАК Договор
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	ПриборыУчетаСУслугой КАК ПриборыУчетаСУслугой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ПриборыУчетаСУслугой.ПриборУчета.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Организация КАК Организация,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Район КАК Район,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	бестКоэффциентыПриборовУчетаНПСрезПоследних.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ КоэффициентыПУ
	|ИЗ
	|	РегистрСведений.бестКоэффциентыПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ТочкаУчета, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборы.ТочкаУчета КАК ТочкаУчета,
	|						ВведенныеПриборы.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ВведенныеПриборы КАК ВведенныеПриборы)) КАК бестКоэффциентыПриборовУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНПОбороты.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНПОбороты.Услуга КАК Услуга,
	|	бестОбъемНачисленийНПОбороты.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|	бестОбъемНачисленийНПОбороты.Шкала КАК Шкала,
	|	бестОбъемНачисленийНПОбороты.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ОбъемЗаПредМесяц
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	|			&НачалоПредМесяца,
	|			&КонецПредМесяца,
	|			Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестОбъемНачисленийНПОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемНачисленийНПОбороты.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНПОбороты.Услуга КАК Услуга,
	|	бестОбъемНачисленийНПОбороты.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот,
	|	бестОбъемНачисленийНПОбороты.Шкала КАК Шкала,
	|	бестОбъемНачисленийНПОбороты.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ОбъемЗаТекМесяцПредГода
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	|			&НачалоМесяцаПредГод,
	|			&КонецМесяцаПредГод,
	|			Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|						АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)) КАК бестОбъемНачисленийНПОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСреднийОбъемПотребленияНП.Организация КАК Организация,
	|	бестСреднийОбъемПотребленияНП.Район КАК Район,
	|	бестСреднийОбъемПотребленияНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСреднийОбъемПотребленияНП.Услуга КАК Услуга,
	|	бестСреднийОбъемПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСреднийОбъемПотребленияНП.Шкала КАК Шкала,
	|	бестСреднийОбъемПотребленияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестСреднийОбъемПотребленияНП.Объем КАК Объем
	|ПОМЕСТИТЬ СреднийОбъемПотребления
	|ИЗ
	|	РегистрСведений.бестСреднийОбъемПотребленияНП КАК бестСреднийОбъемПотребленияНП
	|ГДЕ
	|	бестСреднийОбъемПотребленияНП.ПериодНачисления = &ПериодНачисления
	|	И бестСреднийОбъемПотребленияНП.Район = &Район
	|	И бестСреднийОбъемПотребленияНП.Организация = &Организация
	|	И (бестСреднийОбъемПотребленияНП.ОбъектРасчета, бестСреднийОбъемПотребленияНП.ТочкаУчета) В
	|			(ВЫБРАТЬ
	|				АктивныеТочкиУчетаОбъекта.ОбъектРасчета КАК ОбъектРасчета,
	|				АктивныеТочкиУчетаОбъекта.ТочкаУчета КАК ТочкаУчета
	|			ИЗ
	|				АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестКоэффициентыПоказателейПотребленияСрезПоследних.Услуга КАК Услуга,
	|	бестКоэффициентыПоказателейПотребленияСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестКоэффициентыПоказателейПотребленияСрезПоследних.ПовышающийКоэффициент КАК ПовышающийКоэффициент
	|ПОМЕСТИТЬ ПовышающийКоэф
	|ИЗ
	|	РегистрСведений.бестКоэффициентыПоказателейПотребления.СрезПоследних(&Период, Организация = &Организация) КАК бестКоэффициентыПоказателейПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложенныйзапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|	Вложенныйзапрос.Услуга КАК Услуга,
	|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	Вложенныйзапрос.Шкала КАК Шкала,
	|	Вложенныйзапрос.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	|	Вложенныйзапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ЕСТЬNULL(бестПоказанияПриборовУчетаНПСрезПоследних.Показание, 0) КАК ПредыдущиеПоказания,
	|	бестПоказанияПриборовУчетаНПСрезПоследних.Период КАК ДатаПоследнихПоказаний,
	|	Вложенныйзапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ОбъемЗаПредМесяц.ОбъемУслугиОборот, 0) КАК РасходЗаПредМесяц,
	|	ЕСТЬNULL(ОбъемЗаТекМесяцПредГода.ОбъемУслугиОборот, 0) КАК РасходЗаАналогичныйПериодПредГода,
	|	ЕСТЬNULL(СреднийОбъемПотребления.Объем, 0) * ЕСТЬNULL(ПовышающийКоэф.ПовышающийКоэффициент, 1) * ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(бестПоказанияПриборовУчетаНПСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ) = 0
	|			ТОГДА 1
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(бестПоказанияПриборовУчетаНПСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)), &ПериодНачисления, МЕСЯЦ)
	|	КОНЕЦ КАК СреднийРасход,
	|	бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК АдресОбъекта,
	|	Вложенныйзапрос.Договор КАК Договор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоПриборам.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоПриборам.Шкала КАК Шкала,
	|		ЕСТЬNULL(УслугиТочекУчета.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|		ЕСТЬNULL(ВидыДифференцированностиТочекУчета.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
	|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|		ЕСТЬNULL(КоэффициентыПУ.Коэффициент, 1) КАК КоэффициентПУ,
	|		энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ДанныеПоПриборам.Договор КАК Договор
	|	ИЗ
	|		ДанныеПоПриборам КАК ДанныеПоПриборам
	|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиТочекУчета КАК УслугиТочекУчета
	|			ПО ДанныеПоПриборам.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
	|				И ДанныеПоПриборам.ОбъектРасчета = УслугиТочекУчета.ОбъектРасчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчета КАК ВидыДифференцированностиТочекУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|				ПО ВидыДифференцированностиТочекУчета.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|			ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчета.ПриборУчета
	|				И ДанныеПоПриборам.Шкала = ВидыДифференцированностиТочекУчета.Шкала
	|			ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПУ КАК КоэффициентыПУ
	|			ПО ДанныеПоПриборам.ТочкаУчета = КоэффициентыПУ.ТочкаУчета
	|				И ДанныеПоПриборам.ПриборУчета = КоэффициентыПУ.ПриборУчета
	|	ГДЕ
	|		УслугиТочекУчета.Услуга = &Услуга) КАК Вложенныйзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ энргМаксимальныеПоказанияСрезПоследних КАК бестПоказанияПриборовУчетаНПСрезПоследних
	|		ПО Вложенныйзапрос.ОбъектРасчета = бестПоказанияПриборовУчетаНПСрезПоследних.ОбъектРасчета
	|			И Вложенныйзапрос.ПриборУчета = бестПоказанияПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И Вложенныйзапрос.Шкала = бестПоказанияПриборовУчетаНПСрезПоследних.Шкала
	|			И Вложенныйзапрос.ТарифнаяЗона = бестПоказанияПриборовУчетаНПСрезПоследних.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемЗаПредМесяц КАК ОбъемЗаПредМесяц
	|		ПО Вложенныйзапрос.ОбъектРасчета = ОбъемЗаПредМесяц.ОбъектРасчета
	|			И Вложенныйзапрос.Услуга = ОбъемЗаПредМесяц.Услуга
	|			И Вложенныйзапрос.ТочкаУчета = ОбъемЗаПредМесяц.ТочкаУчета
	|			И Вложенныйзапрос.Шкала = ОбъемЗаПредМесяц.Шкала
	|			И Вложенныйзапрос.ТарифнаяЗона = ОбъемЗаПредМесяц.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемЗаТекМесяцПредГода КАК ОбъемЗаТекМесяцПредГода
	|		ПО Вложенныйзапрос.ОбъектРасчета = ОбъемЗаТекМесяцПредГода.ОбъектРасчета
	|			И Вложенныйзапрос.Услуга = ОбъемЗаТекМесяцПредГода.Услуга
	|			И Вложенныйзапрос.ТочкаУчета = ОбъемЗаТекМесяцПредГода.ТочкаУчета
	|			И Вложенныйзапрос.Шкала = ОбъемЗаТекМесяцПредГода.Шкала
	|			И Вложенныйзапрос.ТарифнаяЗона = ОбъемЗаТекМесяцПредГода.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъемПотребления КАК СреднийОбъемПотребления
	|		ПО Вложенныйзапрос.ОбъектРасчета = СреднийОбъемПотребления.ОбъектРасчета
	|			И Вложенныйзапрос.ТочкаУчета = СреднийОбъемПотребления.ТочкаУчета
	|			И Вложенныйзапрос.Услуга = СреднийОбъемПотребления.Услуга
	|			И Вложенныйзапрос.Шкала = СреднийОбъемПотребления.Шкала
	|			И Вложенныйзапрос.ТарифнаяЗона = СреднийОбъемПотребления.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	|		ПО Вложенныйзапрос.ОбъектРасчета = бестОбъектыРасчетаКонтактнаяИнформация.Ссылка
	|			И (бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПовышающийКоэф КАК ПовышающийКоэф
	|		ПО Вложенныйзапрос.ТарифнаяЗона = ПовышающийКоэф.ТарифнаяЗона
	|			И Вложенныйзапрос.Услуга = ПовышающийКоэф.Услуга
	|ГДЕ
	|	Вложенныйзапрос.Услуга.ЗависитОтУслуги = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вложенныйзапрос.ОбъектРасчета,
	|	Вложенныйзапрос.ТочкаУчета,
	|	Вложенныйзапрос.Шкала";
	
	
	Если НЕ ЗначениеЗаполнено(МКД) Тогда
		Текст = СтрЗаменить(Текст, "бестОбъектыРасчета.МКД = &МКД", "ИСТИНА");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контролер) Тогда
		Текст = СтрЗаменить(Текст, "бестОбъектыРасчета.Контролер = &Контролер", "ИСТИНА");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Текст = СтрЗаменить(Текст, "бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор", "ИСТИНА");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Текст = СтрЗаменить(Текст, "ОбъектРасчета = &ОбъектРасчета", "ИСТИНА");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТочкаУчета) Тогда
		Текст = СтрЗаменить(Текст, "ТочкаУчета = &ТочкаУчета", "ИСТИНА");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Услуга) Тогда
		Текст = СтрЗаменить(Текст, "УслугиТочекУчета.Услуга = &Услуга", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст 	= Текст;
	
	Результат  = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

// Записывает показания результат запроса.
// Устаревшая, проведение осуществлять через ОМ бестПроведениеСерверНП.
// Параметры:
//  РезультатЗапроса	-	РезультатЗапроса.
//  Движения			-	Движения.
//
Процедура ЗаписатьПоказанияРезультатЗапроса(РезультатЗапроса,Движения) Экспорт 
	
	Набор  								= Движения["бестПоказанияПриборовУчетаНП"];
	Выборка 							= РезультатЗапроса.выбрать();
	
	ТекДоговор  						= Неопределено;
	ТекПриборУчета 						= Неопределено;
	ТекШкала							= Неопределено;
	ТекТарифнаяЗона 					= Неопределено;
	ТекРазделитель 						= 0;
	
	Пока Выборка.следующий() цикл
		Если ТекПриборУчета = Выборка.ПриборУчета и ТекШкала = Выборка.Шкала и ТекТарифнаяЗона = Выборка.ТарифнаяЗона тогда
			ТекРазделитель 				= ТекРазделитель + 1;
		иначе
			ТекРазделитель 				= 0;
		КонецЕсли;	
		Запись  						= Набор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);		
		Запись.Разделитель 				= ТекРазделитель;
		
		ТекПриборУчета 					= Выборка.ПриборУчета;
		ТекШкала 						= Выборка.Шкала;
		ТекТарифнаяЗона 				= Выборка.ТарифнаяЗона;
	КонецЦикла;
	
КонецПроцедуры

// Получает показания результата запроса.
// Устаревша, используется только для документа бестПроведениеСерверНП.
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.энргЗоныОтвественности.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
// 	СправочникСсылка.энргПриборыУчетаАбонента	-	прибор учета.
//
Функция ПолучитьПриборУчетаПоТочке(Период, Организация = Неопределено, Район = Неопределено, ОбъектРасчета = Неопределено, ТочкаУчета) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета
	|				И ТочкаУчета = &ТочкаУчета) КАК бестПриборыТочекУчетаНПСрезПоследних";
	
	Запрос.УстановитьПараметр("МоментВремени", Период);
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Истина");
	КонецЕсли;
	Если ЗначениеЗаполнено(Район) Тогда
		Запрос.УстановитьПараметр("Район", Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "Истина");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета = &ОбъектРасчета", "Истина");
	КонецЕсли;

	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ПриборУчета;
	Иначе
		Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти