#Область ПрограммныйИнтерфейс

// Процедура добавляет в коллекцию движений новую запись рабочего постановления МКД с данными из структуры-параметра.
//
// Параметры:
//  Движения	-	КоллекцияДвижений.
//  ДанныеШапки	-	Структура:
//   * Дата					–	Дата.
//   * Организация			-	СправочникСсылка.Организации.
//   * Район				-	СправочникСсылка.энргЗоныОтвественности.
//   * МКД					–	СправочникСсылка.энргСтроения.
//   * Постановление		-	ПеречислениеСсылка.бестРабочиеПостановления.
//   * ПериодРегистрации	-	Дата.
//   * ПериодНачисления		–	Дата.
//   * Документ				-	ДокументСсылка.бестСменаРабочегоПостановленияМКД.
//
Процедура УстановитьРабочееПостановлениеМКД(Движения, ДанныеШапки) Экспорт
	Набор 								= Движения.бестРабочиеПостановленияМКД;
	
	Запись								= Набор.Добавить();
	Запись.Период  						= ДанныеШапки.Дата;
	Запись.Организация  				= ДанныеШапки.Организация;
	Запись.Район						= ДанныеШапки.Район;
	Запись.МКД  						= ДанныеШапки.МКД;
	Запись.Постановление 				= ДанныеШапки.Постановление;
	Запись.ПериодРегистрации			= ДанныеШапки.ПериодРегистрации;
	Запись.ПериодНачисления				= ДанныеШапки.ПериодНачисления;
КонецПроцедуры

// Процедура добавляет в коллекцию движений записи рабочих постановлений для абонентов.
//
// Параметры:
//  Движения	-	КоллекцияДвижений.
//  Выборка		-	ВыборкаИзРезультатаЗапроса.
//  ДанныеШапки	-	Структура:
//   * Дата					–	Дата.
//   * Организация			-	СправочникСсылка.Организации.
//   * Район				-	СправочникСсылка.энргЗоныОтвественности.
//   * МКД					–	СправочникСсылка.энргСтроения.
//   * Постановление		-	ПеречислениеСсылка.бестРабочиеПостановления.
//   * ПериодРегистрации	-	Дата.
//   * ПериодНачисления		–	Дата.
//   * Документ				-	ДокументСсылка.бестСменаРабочегоПостановленияМКД.
//
Процедура УстановитьРабочееПостановлениеАбонентов(Движения, Выборка, ДанныеШапки) Экспорт
	Набор 								= Движения.бестРабочиеПостановленияАбонентов;
	Пока Выборка.следующий() цикл 
		Если Не Выборка.Постановление   = ДанныеШапки.Постановление Тогда
			Запись						= Набор.Добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Организация  		= ДанныеШапки.Организация;
			Запись.МКД  				= ДанныеШапки.МКД;
			Запись.Район				= ДанныеШапки.Район;
			Запись.Абонент 				= Выборка.Абонент;
			Запись.Постановление		= ДанныеШапки.Постановление;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти