
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	
	Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", Регистратор.Метаданные())  Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
	
	Если ЭтотОбъект.Количество() > 0 Тогда		
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
			
	Если ДополнительныеСвойства.Свойство("НаборыЗаписей") Тогда
		энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей, Замещение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если НЕ ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если НЕ ДополнительныеСвойства.Свойство("Организация") И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", Регистратор.Метаданные())  Тогда
		ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("МКД") Тогда 
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("МКД", Регистратор.Метаданные())  Тогда
			ДополнительныеСвойства.Вставить("МКД", Регистратор.МКД);
		Иначе
			ДополнительныеСвойства.Вставить("МКД", Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Строение") Тогда
		ДополнительныеСвойства.Вставить("Строение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Помещение") Тогда
		ДополнительныеСвойства.Вставить("Помещение", Неопределено);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ЧастныйСектор") Тогда
		ДополнительныеСвойства.Вставить("ЧастныйСектор", Ложь);
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Район") И ОбщегоНазначения.ЕстьРеквизитОбъекта("Район", Регистратор.Метаданные()) Тогда
		ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
	КонецЕсли;
			
	НаборыЗаписей = Новый Структура;	
	РазделыЗаписи = Новый Массив;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачислениеПени") Тогда

		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.Взаиморасчеты, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));

	КонецЕсли;
		
	ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);	  
	
	ЭтоРучнойПерерасчетПени = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоРучнойПерерасчетПени", Ложь);// Удалить"ЭтоРучнойПерерасчетПени". Исправить ручной перерасчет пени
	
	Если НЕ ЭтоРучнойПерерасчетПени Тогда 
		НаборВзаиморасчеты = РегистрыНакопления.энргВзаиморасчетыПоПени.СоздатьНаборЗаписей();
		НаборВзаиморасчеты.Отбор.Регистратор.Установить(Регистратор);
		НаборВзаиморасчеты.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
		НаборыЗаписей.Вставить("энргВзаиморасчетыПоПени", НаборВзаиморасчеты);		
	КонецЕсли;
	
	Если ТипЗнч(Регистратор) <> Тип("ДокументСсылка.энргПерерасчет") Тогда
		НаборВзаиморасчеты	= РегистрыНакопления.энргВзаиморасчеты.СоздатьНаборЗаписей();
		НаборВзаиморасчеты.Отбор.Регистратор.установить(Регистратор);
		НаборВзаиморасчеты.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
		НаборыЗаписей.Вставить("энргВзаиморасчеты", 		НаборВзаиморасчеты);
	КонецЕсли;

	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	перем НаборВзаиморасчеты, ВзаиморасчетыПоПени, нНаборВзаиморасчеты;
	
	НаборыЗаписей = ДополнительныеСвойства.НаборыЗаписей;
	
	ЭтоРучнойПерерасчетПени = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоРучнойПерерасчетПени", Ложь);// Удалить"ЭтоРучнойПерерасчетПени". Исправить ручной перерасчет пени
	Если НЕ ЭтоРучнойПерерасчетПени Тогда
		Если НЕ НаборыЗаписей.Свойство("энргВзаиморасчетыПоПени", ВзаиморасчетыПоПени) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ НаборыЗаписей.Свойство("энргВзаиморасчеты", НаборВзаиморасчеты) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ДанныеВзаиморасчеты();
	НаборВзаиморасчеты.Загрузить(Результат.Выгрузить());

КонецПроцедуры

Функция ДанныеВзаиморасчеты()
	
	тзНаборЗаписей = ЭтотОбъект.Выгрузить(); 	
	ДополнительныеСвойства.Вставить("тзНаборЗаписей", тзНаборЗаписей);			
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Набор", тзНаборЗаписей);
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	энргНачислениеПени.Период КАК Период,
	|	энргНачислениеПени.Организация КАК Организация,
	|	энргНачислениеПени.Район КАК Район,
	|	энргНачислениеПени.МКД КАК МКД,
	|	энргНачислениеПени.Абонент КАК Абонент,
	|	энргНачислениеПени.Услуга КАК Услуга,
	|	энргНачислениеПени.ПериодРасчета КАК ПериодРасчета,
	|	энргНачислениеПени.Сумма КАК Сумма
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&Набор КАК энргНачислениеПени
	|ГДЕ
	|	НЕ энргНачислениеПени.Сумма = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	СУММА(ОбъемНачислений.Сумма) КАК Сумма,
	|	МАКСИМУМ(ОбъемНачислений.Организация) КАК Организация,
	|	МАКСИМУМ(ОбъемНачислений.Период) КАК Период,
	|	ОбъемНачислений.ПериодРасчета КАК ПериодНачисления,
	|	МАКСИМУМ(ОбъемНачислений.МКД) КАК МКД,
	|	МАКСИМУМ(ОбъемНачислений.Район) КАК Район
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.Услуга,
	|	ОбъемНачислений.ПериодРасчета
	|
	|ИМЕЮЩИЕ
	|	СУММА(ОбъемНачислений.Сумма) <> 0";
	
		
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти


