
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("Организация",  		 Параметры.Организация);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("Район", 			 Параметры.Район);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("КлючПомещения",		 Параметры.КлючПомещения);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("ТочкаУчета",		 Параметры.ТочкаУчета);
	//ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("СписокТУ_ПоФормуле", Параметры.СписокТУ_ПоФормуле);
	ФормулыРасчетаТочекУчета.Параметры.УстановитьЗначениеПараметра("Период",			 Параметры.Период);
КонецПроцедуры
