#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПолучениеДанных

// Получает обязательные типы файлов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПолучитьОбязательныеТипыФайлов(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбязательныеТипыФайловКПрикреплению());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения; 
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
		
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		ДоступныеПараметры 					= "ВладелецФайла, ВидОперации";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргОбязательныеТипыФайловКПрикреплению", ПараметрыОтбора.Отбор, ДоступныеПараметры);		
	КонецЕсли;		
КонецПроцедуры  

#КонецОбласти

#Область ВспомогательныеМетоды

// Получает описание объекта.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ПолучитьОписаниеОбъекта() Экспорт
	Возврат энргОбщегоНазначения.ПолучитьОписаниеСвойствРегистра(Метаданные.РегистрыСведений.энргОбязательныеТипыФайловКПрикреплению);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаОбязательныеТипыФайловКПрикреплению()
	Текст  =
	"ВЫБРАТЬ
	|	энргОбязательныеТипыФайловКПрикреплению.ВладелецФайла КАК ВладелецФайла,
	|	энргОбязательныеТипыФайловКПрикреплению.ВидОперации КАК ВидОперации,
	|	энргОбязательныеТипыФайловКПрикреплению.ТипФайла КАК ТипФайла
	|ИЗ
	|	РегистрСведений.энргОбязательныеТипыФайловКПрикреплению КАК энргОбязательныеТипыФайловКПрикреплению";
	
	Возврат Текст;	
КонецФункции

#КонецОбласти

#КонецЕсли