#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура КоличествоДнейИспользованияУслугПриОтсутствии(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "")  Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	КонецЕсли;
		
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствии());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "ПериодНачисления, Организация, Район, ЧастныйСектор, Строение, Помещение";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргКоличествоДнейИспользованияУслугПриОтсутствии", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность"; 	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура КоличествоДнейИспользованияУслугПриОтсутствииКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "")  Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	КонецЕсли;
		
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстВложенногоЗапросаКоличествоДнейИспользованияУслугПриОтсутствииКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 	= "втКоличествоДнейИспользованияУслугПриОтсутствии";
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "ПериодНачисления, Организация, Район, ЧастныйСектор, Строение, Помещение";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргКоличествоДнейИспользованияУслугПриОтсутствии", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствииКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "ПериодНачисления, Организация, Район, ЧастныйСектор, Строение, Помещение";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргКоличествоДнейИспользованияУслугПриОтсутствии", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность"; 	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствии() Экспорт
	
	Текст  =
	"ВЫБРАТЬ
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления КАК ПериодНачисления,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация КАК Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район КАК Район,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение КАК Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение КАК Помещение,
	|	СУММА(энргКоличествоДнейИспользованияУслугПриОтсутствии.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.энргКоличествоДнейИспользованияУслугПриОтсутствии КАК энргКоличествоДнейИспользованияУслугПриОтсутствии
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстВложенногоЗапросаКоличествоДнейИспользованияУслугПриОтсутствииКоллекцияПериодов() Экспорт
	
	Текст  =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.ПериодНачисления КАК ПериодНачисления,
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация КАК Организация,
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.Район КАК Район,
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор КАК ЧастныйСектор,
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение КАК Строение,
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение КАК Помещение,
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.Количество КАК Количество,
	|			энргКоличествоДнейИспользованияУслугПриОтсутствии.Период КАК Период
	|		ИЗ
	|			РегистрНакопления.энргКоличествоДнейИспользованияУслугПриОтсутствии КАК энргКоличествоДнейИспользованияУслугПриОтсутствии
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|				ПО энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация = ТаблицаПериодов.Организация
	|					И энргКоличествоДнейИспользованияУслугПриОтсутствии.Район = ТаблицаПериодов.Район
	|					И энргКоличествоДнейИспользованияУслугПриОтсутствии.Период <= ТаблицаПериодов.ЗавершениеОП";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаКоличествоДнейИспользованияУслугПриОтсутствииКоллекцияПериодов() Экспорт
	
	Текст  =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация КАК Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район КАК Район,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение КАК Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.энргКоличествоДнейИспользованияУслугПриОтсутствии КАК энргКоличествоДнейИспользованияУслугПриОтсутствии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКоличествоДнейИспользованияУслугПриОтсутствии КАК ВложенныйЗапрос
	|		ПО энргКоличествоДнейИспользованияУслугПриОтсутствии.Период = ВложенныйЗапрос.Период
	|			И энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация = ВложенныйЗапрос.Организация
	|			И энргКоличествоДнейИспользованияУслугПриОтсутствии.Район = ВложенныйЗапрос.Район
	|			И энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор = ВложенныйЗапрос.ЧастныйСектор
	|			И энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение = ВложенныйЗапрос.Строение
	|			И энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение = ВложенныйЗапрос.Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Организация,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Район,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.ЧастныйСектор,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Строение,
	|	энргКоличествоДнейИспользованияУслугПриОтсутствии.Помещение,
	|	ВложенныйЗапрос.ПериодНачисления";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли