#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ТочкаМаршрута) Тогда
		БП = Неопределено;
		Если ТипЗнч(Запись.ТочкаМаршрута) = Тип("ТочкаМаршрутаБизнесПроцессаСсылка.бестПодготовкаПроектаДоговора") Тогда
			БП = "бестПодготовкаПроектаДоговора";
			БизнесПроцесс = "Подготовка проекта договора"; 
		ИначеЕсли ТипЗнч(Запись.ТочкаМаршрута) = Тип("ТочкаМаршрутаБизнесПроцессаСсылка.бестНаправлениеДокументаРуководителю") Тогда
			БП = "бестНаправлениеДокументаРуководителю";
			БизнесПроцесс = "Направление документа руководителю";
		ИначеЕсли ТипЗнч(Запись.ТочкаМаршрута) = Тип("ТочкаМаршрутаБизнесПроцессаСсылка.бестНаправлениеПротоколаРазногласийЮристам") Тогда
			БП = "бестНаправлениеПротоколаРазногласийЮристам";
			БизнесПроцесс = "Направление протокола разногласий юристам";
		ИначеЕсли ТипЗнч(Запись.ТочкаМаршрута) = Тип("ТочкаМаршрутаБизнесПроцессаСсылка.бестПроверкаКомплектаДокументов") Тогда
			БП = "бестПроверкаКомплектаДокументов";
			БизнесПроцесс = "Проверка комплекта документов";
		ИначеЕсли ТипЗнч(Запись.ТочкаМаршрута) = Тип("ТочкаМаршрутаБизнесПроцессаСсылка.бестЗаключениеДоговора") Тогда
			БП = "бестЗаключениеДоговора";
			БизнесПроцесс = "Заключение договора";
		КонецЕсли;
		
		Если БП <> Неопределено Тогда
			ЗаполнитьМассивТочек(БП);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура Реквизит1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	БП = Неопределено;
	Если ВыбранноеЗначение = Тип("БизнесПроцессСсылка.бестПодготовкаПроектаДоговора") Тогда
		БП = "бестПодготовкаПроектаДоговора";
	ИначеЕсли ВыбранноеЗначение = Тип("БизнесПроцессСсылка.бестНаправлениеДокументаРуководителю") Тогда
		БП = "бестНаправлениеДокументаРуководителю";
	ИначеЕсли ВыбранноеЗначение = Тип("БизнесПроцессСсылка.бестНаправлениеПротоколаРазногласийЮристам") Тогда
		БП = "бестНаправлениеПротоколаРазногласийЮристам";
	ИначеЕсли ВыбранноеЗначение = Тип("БизнесПроцессСсылка.бестПроверкаКомплектаДокументов") Тогда
		БП = "бестПроверкаКомплектаДокументов";
	ИначеЕсли ВыбранноеЗначение = Тип("БизнесПроцессСсылка.бестЗаключениеДоговора") Тогда
		БП = "бестЗаключениеДоговора";
	КонецЕсли;
	
	Если БП <> Неопределено Тогда
		ЗаполнитьМассивТочек(БП);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	БизнесПроцесс = Строка(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьМассивТочек(БП)
	мТочек = Новый Массив;
	Для каждого Точка из БизнесПроцессы[БП].ТочкиМаршрута Цикл
		Если Точка.Вид = ВидТочкиМаршрутаБизнесПроцесса.Действие
			ИЛИ Точка.Вид = ВидТочкиМаршрутаБизнесПроцесса.ВложенныйБизнесПроцесс Тогда
			мТочек.Добавить(Точка);	 
		КонецЕсли;
	КонецЦикла;
	Элементы.ТочкаМаршрута.СписокВыбора.Очистить();
	Элементы.ТочкаМаршрута.СписокВыбора.ЗагрузитьЗначения(мТочек);
КонецПроцедуры

#КонецОбласти