#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьКатегориюДебитора(Период, Организация, ДниЗадолженности) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНастройкиКатегорийДебитораСрезПоследних.КатегорияДебитора КАК КатегорияДебитора
		|ИЗ
		|	РегистрСведений.бестНастройкиКатегорийДебитора.СрезПоследних(&Период, Организация = &Организация) КАК бестНастройкиКатегорийДебитораСрезПоследних
		|ГДЕ
		|	бестНастройкиКатегорийДебитораСрезПоследних.От <= &ДниЗадолженности
		|	И ВЫБОР
		|			КОГДА бестНастройкиКатегорийДебитораСрезПоследних.До = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &ДниЗадолженности < бестНастройкиКатегорийДебитораСрезПоследних.До
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДниЗадолженности", 	ДниЗадолженности);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Период", 			Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.КатегорияДебитора;
	КонецЕсли;
	
	Возврат Справочники.бестКатегорииДебитора.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
