#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата	= НачалоМесяца(ТекущаяДата());
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			Строение	= Объект.КлючПомещения.Строение;
			Помещение	= Объект.КлючПомещения.Помещение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				ПериодРегистрации = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
				
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПериодРегистрации, Объект.Организация, Объект.Район);	
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСуммуЗадолженности();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ГраницыОП	= ПолучитьПериодНачисленияСервер(Объект.Дата, Объект.Организация, Объект.Район);
	Объект.ПериодНачисления	= ГраницыОП.ПериодНачисления;
	Объект.Дата				= ГраницыОП.НачалоОП;

КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТЗ = Документы.энргИзменениеВидаЗадолженности.ПолучитьЗадолженность(Новый Структура("Абонент, Дата, ПериодЗадолженности", Объект.Абонент, Объект.Дата, ПериодЗадолженности));
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ОбъектФормы.РасчетЗадолженности.Загрузить(ТЗ);
	
	ЗначениеВРеквизитФормы(ОбъектФормы,"Объект");
	
	ЗаполнитьСуммуЗадолженности();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПериодНачисленияСервер(ПериодРегистрации, Организация, Район)
	
	Возврат Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПериодРегистрации, Организация, Район)) ;
	 
КонецФункции

&НаСервере
Процедура ЗаполнитьСуммуЗадолженности()
	
	ТЗ = Объект.РасчетЗадолженности.Выгрузить(Новый Структура("ПросуженнаяБлокированная", Истина), "СуммаЗадолженности");
	ТЗ.Свернуть(,"СуммаЗадолженности");
	
	Если ТЗ.Количество()  > 0 Тогда
		СуммаЗадолженностиВсего = ТЗ[0].СуммаЗадолженности;
	Иначе 
		СуммаЗадолженностиВсего = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗадолженностиПросуженнаяБлокированнаяПриИзменении(Элемент)
	ЗаполнитьСуммуЗадолженности();
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(Значение)
	Для Каждого ТекСтрока Из Объект.РасчетЗадолженности Цикл 
		ТекСтрока.ПросуженнаяБлокированная = Значение;		
	КонецЦикла;
	
	ЗаполнитьСуммуЗадолженности();
	
КонецПроцедуры

#КонецОбласти