#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоОП = НачалоГода(ТекущаяДата());
	КонецОП = КонецГода(ТекущаяДата());
	Организация = Справочники.Организации.НашаОрганизация;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru = 'Выберите файл'");
	Диалог.Фильтр = "Файлы Microsoft Excel(*.xlsx)|*.xlsx"; 
	Диалог.МножественныйВыбор = Ложь;
	
	ДопПараметры = НовыеДополнительныеПараметрыВыбораПутиКФайлу();
	Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораФайлаЗавершение", ЭтотОбъект, ДопПараметры);	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, Диалог);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьФайлаШаблонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru = 'Выберите файл'");
	Диалог.Фильтр = "Файлы Microsoft Excel(*.xlsx)|*.xlsx"; 
	Диалог.МножественныйВыбор = Ложь;
	
	ДопПараметры = НовыеДополнительныеПараметрыВыбораПутиКФайлу();
	ДопПараметры.ИмяРеквизита = "ПутьФайлаШаблона";
	Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораФайлаЗавершение", ЭтотОбъект, ДопПараметры);	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, Диалог);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  	
	
	ЭтотОбъект[ДополнительныеПараметры.ИмяРеквизита] = Результат[0];
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПутьКФайлу = ПутьФайлаШаблона Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Пути файлов должны отличаться.'"));
		Возврат;
	КонецЕсли;	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КопироватьФайлСНовымИменемЗавершение", ЭтотОбъект);
	НачатьКопированиеФайла(
		ОписаниеОповещения,	
		ПутьФайлаШаблона, 
		ПутьКФайлу);
			
КонецПроцедуры 

&НаКлиенте
Процедура КопироватьФайлСНовымИменемЗавершение(СкопированныйФайл, Дополнительно) Экспорт 
		
	ЗапуститьФоновоеЗаданиеКлиент();
		
КонецПроцедуры

#КонецОбласти

#Область ФоновоеВыполнениеЗадачи

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеКлиент()
	
	ПараметрыОтборов = СформироватьПараметрыОтборов();
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(УникальныйИдентификатор, ПараметрыОтборов);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Выполняется сохранение Формы №46'");
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗадания", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьФоновоеЗаданиеСервер(УникальныйИдентификаторФормы, ПараметрыОтборов)
	
	ИмяФункции = "Обработки.бестФорма46.ПолучитьДанныеРазделов";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификаторФормы);	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		ИмяФункции,
		ПараметрыОтборов);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗадания(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		
		УдалитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки); 		
		Возврат;
		
	КонецЕсли;
	
	ДанныеХранилища = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);  			
	УдалитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);                                 	
	
	Если ДанныеХранилища.Раздел1А.Количество() > 0 ИЛИ
			ДанныеХранилища.Раздел1Б.Количество() > 0 ИЛИ
			ДанныеХранилища.Раздел1В.Количество() > 0 Тогда 
			
		СохранитьДанныеВЭксель(ДанныеХранилища);	
	КонецЕсли;  		
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьДанныеВЭксель(ДанныеХранилища)

	Эксель = ОткрытьЭксельКлиент();
	Если Эксель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Успешно = Истина;
	Попытка
	
		ЗаполнитьЭксель(Эксель, ДанныеХранилища);	
	
	Исключение
		Успешно = Ложь;
	    ОпОшибки = ИнформацияОбОшибке();
		Комментарий = "Не удалось сохранить данные.";
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Комментарий + " Подробднее: " + КраткоеПредставлениеОшибки(ОпОшибки));
	КонецПопытки;	
		
	Эксель.Application.Quit();
	
	Если Успешно Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	КонецЕсли;	
	
КонецПроцедуры

#Если НЕ МобильныйКлиент Тогда

&НаКлиенте
Функция ОткрытьЭксельКлиент() 	
	
	Попытка
		
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.Application.DisplayAlerts = Ложь;
		
	Исключение
		
		ОпОшибки = ИнформацияОбОшибке();
		Комментарий = "Excel: Неудачная попытка подключения компоненты Excel.
		| Возможно, программа Excel не установлена на данном компьютере!";
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Комментарий + " Подробднее: " + КраткоеПредставлениеОшибки(ОпОшибки));
		Возврат Неопределено;
		
	КонецПопытки; 
	
	Возврат Эксель;
	
КонецФункции

#КонецЕсли

&НаКлиенте
Процедура ЗаполнитьЭксель(Эксель, РазделыЗаполнения)
	
	Книга = Эксель.WorkBooks.Open(ПутьКФайлу); 		
		
	Для Каждого РазделДанных Из РазделыЗаполнения Цикл 
		
		Если РазделДанных.Значение.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НомерЛиста = 3;
		Если РазделДанных.Ключ = "Раздел1Б" Тогда
			НомерЛиста = 4;
		ИначеЕсли РазделДанных.Ключ = "Раздел1В" Тогда
			НомерЛиста = 5;			
		Иначе 
			
		КонецЕсли;
		ЛистЗаполнения = Книга.WorkSheets(НомерЛиста);
		
		Для Каждого КоординатыЗаполнения из РазделДанных.Значение Цикл 
			ЯчейкаЭкселя = ЛистЗаполнения.Cells(КоординатыЗаполнения.НомерСтроки, КоординатыЗаполнения.НомерКолонки);
			ЯчейкаЭкселя.Value = КоординатыЗаполнения.Значение;
		КонецЦикла; 		
		
	КонецЦикла;	
	
	Книга.Save();
	
КонецПроцедуры


&НаКлиенте
Функция СформироватьПараметрыОтборов()
	
	Результат = НовыеПараметрыОтборов();
	Результат.НачалоОП = НачалоОП;
	Результат.КонецОП = КонецДня(КонецОП);
	Результат.Организация = Организация;
	Результат.Район = Район;
	
	Возврат Результат;	
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыеПараметрыОтборов()
	Возврат Обработки.бестФорма46.НовыеПараметрыОтборов();
КонецФункции


&НаКлиенте
Функция НовыеДополнительныеПараметрыВыбораПутиКФайлу()
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", "ПутьКФайлу");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


