#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ФормаКакОбъектМетаданых = Обработки.энргСобытиеМенеджерФорм.ПолучитьФормыДляОтображенияКакОбъектМетаданных();
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		ВыбраннаяФорма			= ФормаКакОбъектМетаданых.ФормаДокумента;		
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда 		
		СтандартнаяОбработка 	= Ложь;
		ВыбраннаяФорма 			= ФормаКакОбъектМетаданых.ФормаСписка;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСПечатнымиФормами

#Область ПечатьПФ_MXL_Претензия_Долг_Пеня

Процедура НапечататьПретензиюДолгИПеня(ДокументСобытие, ТабДок) Экспорт 
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_MXL_ПретензияДолгИПеня");
	Результат	= ДанныеПретензияДолгПеня(ДокументСобытие);	
	ЗаполнитьДанныеПретензияДолгПеня(Результат, ТабДок, Макет);	
КонецПроцедуры

Процедура НапечататьПретензиюДолг(ДокументСобытие, ТабДок) Экспорт 
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_MXL_Претензия_Долг");
	Результат	= ДанныеПретензияДолгПеня(ДокументСобытие); 	
	ЗаполнитьДанныеПретензияДолг(Результат, ТабДок, Макет);	
КонецПроцедуры

Процедура НапечататьПретензиюПени(ДокументСобытие, ТабДок) Экспорт 
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_MXL_Претензия_Пени");
	Результат	= ДанныеПретензияДолгПеня(ДокументСобытие); 	
	ЗаполнитьДанныеПретензияПени(Результат, ТабДок, Макет);	
КонецПроцедуры

Процедура СформироватьСлужебнуюЗаписку(ДокументСобытие, ТабДок) Экспорт 
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_MXL_ПИР_СлужебнаяЗаписка");
	Результат	= ДанныеПретензияДолгПеня(ДокументСобытие); 	
	ЗаполнитьДанныеСлужебнаяЗаписка(Результат, ТабДок, Макет);	
КонецПроцедуры

Процедура СформироватьИсковоеЗаявление(ДокументСобытие, ТабДок) Экспорт 
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_MXL_ИсковоеЗаявлениеВСуд");
	Результат	= ДанныеПретензияДолгПеня(ДокументСобытие); 	
	ЗаполнитьДанныеИсковогоЗаявления(Результат, ТабДок, Макет);	
КонецПроцедуры

Процедура СформироватьУведомлениеОРП(ДокументСобытие, ТабДок) Экспорт 
	Макет 		= УправлениеПечатью.МакетПечатнойФормы("Документ.энргСобытие.ПФ_MXL_УведомлениеОРП");
	Результат	= ДанныеУведомленияОРП(ДокументСобытие); 	
	ЗаполнитьДанныеУведомленияОРП(Результат, ТабДок, Макет);	
КонецПроцедуры

Функция ДанныеПретензияДолгПеня(ДокументСобытие)	
	Схема = Новый СхемаЗапроса;  	
	
	ДанныеДокументаСобытия(Схема);
	ДанныеПоОрганизации(Схема);
	ДанныеРайонногоОтделения(Схема);
	ДанныеАбонента(Схема);	
	ДанныеБанка(Схема);
	ДанныеКонтрагента(Схема);
	ДанныеПодписанта(Схема);
	ДанныеОтветственного(Схема);
	
	
	Пакет = Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеСобытия.Район КАК РайонноеОтделение,
	|	ДанныеСобытия.Абонент КАК Абонент,
	|	ДанныеРайона.ДиректорРО КАК ДиректорРО,
	|	ДанныеАбонентов.АдресОбъектаЛС КАК ЮрАдресПотребителя1,
	|	ДанныеБанка.Район КАК Район,
	|	ДанныеБанка.Организация КАК Организация,
	|	ДанныеБанка.Банк КАК НаименованиеБанка,
	|	ДанныеБанка.НомерСчета КАК РасчетныйСчет,
	|	ДанныеБанка.КоррСчет КАК КорСчет,
	|	ДанныеБанка.Код КАК БИК,
	|	ДанныеСобытия.СобытиеСсылка КАК СобытиеСсылка,
	|	энргЗадачаПИД.Дата КАК ДатаРегистрации,
	|	энргЗадачаПИД.ПериодЗадолженностиКонец КАК ЗадолженностьЗаПериодПо,
	|	энргЗадачаПИД.ПериодЗадолженностиНачало КАК ЗадолженностьЗаПериодС,
	|	энргЗадачаПИД.СуммаЗадолженности КАК СуммаЗадолженности,
	|	энргЗадачаПИД.СуммаПени КАК Пеня,
	|	ДанныеСобытия.Основание КАК Основание,
	|	энргЗадачаПИД.Договор.Дата КАК ДатаДоговора,
	|	энргЗадачаПИД.Договор.Номер КАК НомерДоговора,
	|	ДанныеСобытия.Организация КАК Организация1,
	|	энргЗадачаПИД.Абонент.Ссылка КАК АбонентСсылка,
	|	энргЗадачаПИД.Договор.Контрагент КАК Контрагент,
	|	энргЗадачаПИД.Договор КАК Договор,
	|	ДанныеКонтрагента.ЮрАдрес КАК ЮрАдресПотребителя,
	|	ДанныеПодписанта.Сотрудник КАК Подписант,
	|	ДанныеОтветственного.НомерТелефонаОтветственного КАК НомерТелефонаОтветственного,
	|	ДанныеСобытия.Ответственный КАК Ответственный,
	|	ДанныеСобытия.НаименованиеСуда КАК НаименованиеСуда,
	|	ДанныеПоОрганизации.ЮридическийАдресОрганизации КАК ЮридическийАдресОрганизации,
	|	ДанныеСобытия.ДатаАктаСверки КАК ДатаАктаСверки
	|ИЗ
	|	ДанныеСобытия КАК ДанныеСобытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРайона КАК ДанныеРайона
	|		ПО ДанныеСобытия.Район = ДанныеРайона.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеАбонентов КАК ДанныеАбонентов
	|		ПО ДанныеСобытия.КлючПомещения = ДанныеАбонентов.КлючПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагента КАК ДанныеКонтрагента
	|			ПО энргЗадачаПИД.Ссылка = ДанныеКонтрагента.СсылкаПид
	|		ПО ДанныеСобытия.Основание = энргЗадачаПИД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеБанка КАК ДанныеБанка
	|		ПО ДанныеСобытия.Организация = ДанныеБанка.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПодписанта КАК ДанныеПодписанта
	|		ПО ДанныеСобытия.Район = ДанныеПодписанта.Район
	|			И ДанныеСобытия.Организация = ДанныеПодписанта.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОтветственного КАК ДанныеОтветственного
	|		ПО ДанныеСобытия.Ответственный = ДанныеОтветственного.Ответственный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоОрганизации КАК ДанныеПоОрганизации
	|		ПО ДанныеСобытия.Организация = ДанныеПоОрганизации.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Абонент");
	
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Период"				, ДокументСобытие.Дата); 
	ПараметрыЗапроса.Вставить("Организация"			, ДокументСобытие.Организация);
	ПараметрыЗапроса.Вставить("Район"				, ДокументСобытие.Район); 	
	ПараметрыЗапроса.Вставить("СписокДокументов"	, ДокументСобытие); 	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
КонецФункции

Функция ДанныеУведомленияОРП(ДокументСобытие)	
	Схема = Новый СхемаЗапроса;  	
	
	ДанныеДокументаСобытия(Схема);
	//ДанныеПоОрганизации(Схема);
	ДанныеРайонногоОтделения(Схема);
	//ДанныеБанка(Схема);
	ДанныеКонтрагента(Схема);
	//ДанныеПодписанта(Схема);
	//ДанныеОтветственного(Схема);
	ДанныеОбъектовРасчета(Схема);
	
	
	Пакет = Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеРайона.ДиректорРО КАК ДиректорРО,
	|	ДанныеРайона.Район КАК Район,
	|	ДанныеРайона.ФактАдресРайона КАК ФактАдресРайона,
	|	ДанныеРайона.ТелефонРайона КАК ТелефонРайона,
	|	ДанныеРайона.EmailРайона КАК EmailРайона,
	|	ДанныеСобытия.Основание КАК Основание,
	|	ДанныеСобытия.ДатаДоговора КАК ДатаДоговора,
	|	ДанныеСобытия.ДатаСобытия КАК ДатаСобытия,
	|	ДанныеСобытия.СпособВручения КАК СпособВручения,
	|	ДанныеСобытия.ДатаВрученияУведомления КАК ДатаВрученияУведомления,
	|	ДанныеСобытия.НомерДоговора КАК НомерДоговора,
	|	ДанныеКонтрагента.Контрагент КАК Контрагент,
	|	ДанныеСобытия.Исполнитель КАК Исполнитель,
	|	ДанныеСобытия.Договор КАК Договор
	|ИЗ
	|	ДанныеСобытия КАК ДанныеСобытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРайона КАК ДанныеРайона
	|		ПО ДанныеСобытия.Район = ДанныеРайона.Район
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагента КАК ДанныеКонтрагента
	|		ПО ДанныеСобытия.Контрагент = ДанныеКонтрагента.Контрагент");
	
	
	Пакет = Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеОбъектовРасчета.АдресОбъекта КАК АдресОбъекта,
	|	ДанныеОбъектовРасчета.ОбъектРасчета КАК ОбъектРасчета
	|ИЗ
	|	ДанныеОбъектовРасчета КАК ДанныеОбъектовРасчета");
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Период"				, ДокументСобытие.Дата); 
	ПараметрыЗапроса.Вставить("Организация"			, ДокументСобытие.Организация);
	ПараметрыЗапроса.Вставить("Район"				, ДокументСобытие.Район); 	
	ПараметрыЗапроса.Вставить("СписокДокументов"	, ДокументСобытие); 	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса);	
КонецФункции

Процедура ЗаполнитьДанныеПретензияДолгПеня(Результат, ТабДок, Макет) 
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");	
	Выборка 		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПараметрыШапкиДолгПеня(ТабДок, ОбластьШапка, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанныеУведомленияОРП(Результат, ТабДок, Макет) 
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка 			= Результат[4].Выбрать();
	ВыборкаОбъектыРасчета 	= Результат[5].Выбрать();
	              
	Пока ВыборкаШапка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаШапка);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаСобытия 				= Формат(ВыборкаШапка.ДатаСобытия,"ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ДатаВрученияУведомления 	= Формат(ВыборкаШапка.ДатаВрученияУведомления,"ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ДатаДоговора 			= Формат(ВыборкаШапка.ДатаДоговора,"ДФ=dd.MM.yyyy");
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Номер = 1;
	Пока ВыборкаОбъектыРасчета.Следующий() Цикл
		ОбластьОбъектыРасчета 	= Макет.ПолучитьОбласть("ОбъектыРасчета");
		ЗаполнитьЗначенияСвойств(ОбластьОбъектыРасчета.Параметры, ВыборкаОбъектыРасчета);
		ОбластьОбъектыРасчета.Параметры.Номер 	= Номер;
		ТабДок.Вывести(ОбластьОбъектыРасчета);
		Номер = Номер + 1;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

Процедура ЗаполнитьДанныеПретензияДолг(Результат, ТабДок, Макет) 
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");	
	Выборка 		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПараметрыШапкиДолг(ТабДок, ОбластьШапка, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанныеПретензияПени(Результат, ТабДок, Макет) 
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");	
	Выборка 		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПараметрыШапкиПени(ТабДок, ОбластьШапка, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанныеСлужебнаяЗаписка(Результат, ТабДок, Макет) 
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");	
	Выборка 		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПараметрыШапкиСлужебнаяЗаписка(ТабДок, ОбластьШапка, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьДанныеИсковогоЗаявления(Результат, ТабДок, Макет) 
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");	
	Выборка 		= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьПараметрыШапкиИсковогоЗаявления(ТабДок, ОбластьШапка, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПараметрыШапкиДолгПеня(ТабДок, ОбластьШапка, Выборка)
	ЗаполнитьЗначенияСвойств (ОбластьШапка.Параметры, Выборка);
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		ДатаРегистрации = Выборка.ДатаРегистрации + 86400*30;
		ОбластьШапка.Параметры.ДатаРегистрации 		= Формат(ДатаРегистрации,"ДФ=dd.MM.yyyy" );
		Если ЗначениеЗаполнено(Выборка.Договор) Тогда
			РезультатЗадолженность = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор);
			ВыборкаЗадолженность = РезультатЗадолженность.Выбрать();
			Пока ВыборкаЗадолженность.Следующий() Цикл
				СуммаЗадолженности = ВыборкаЗадолженность.Сумма;
			КонецЦикла;
			РезультатПени = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор); 	
			
			ВыборкаПени = РезультатПени.Выбрать();
			Пока ВыборкаПени.Следующий() Цикл
				СуммаПени = ВыборкаПени.Сумма;
			КонецЦикла; 	
			ОбластьШапка.Параметры.СуммаЗадолженности 		= СуммаЗадолженности;
			ОбластьШапка.Параметры.Пеня 		= СуммаПени;
			
		КонецЕсли;
	КонецЕсли;
	
	ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодС 			= Формат(Выборка.ЗадолженностьЗаПериодС,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодПо 			= Формат(Выборка.ЗадолженностьЗаПериодПо,"ДФ=dd.MM.yyyy" ); 
	
	
	ТабДок.Вывести(ОбластьШапка); 	
КонецПроцедуры

Процедура ЗаполнитьПараметрыШапкиДолг(ТабДок, ОбластьШапка, Выборка)
	ЗаполнитьЗначенияСвойств (ОбластьШапка.Параметры, Выборка);
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		ДатаРегистрации = Выборка.ДатаРегистрации + 86400*30;
		ОбластьШапка.Параметры.ДатаРегистрации 		= Формат(ДатаРегистрации,"ДФ=dd.MM.yyyy" );
		Если ЗначениеЗаполнено(Выборка.Договор) Тогда
			РезультатЗадолженность = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор);
			ВыборкаЗадолженность = РезультатЗадолженность.Выбрать();
			Пока ВыборкаЗадолженность.Следующий() Цикл
				СуммаЗадолженности = ВыборкаЗадолженность.Сумма;
			КонецЦикла;
			РезультатПени = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор);
			ВыборкаПени = РезультатПени.Выбрать();
			Пока ВыборкаПени.Следующий() Цикл
				СуммаПени = ВыборкаПени.Сумма;
			КонецЦикла; 	
			ОбластьШапка.Параметры.СуммаЗадолженности 		= СуммаЗадолженности;
		КонецЕсли;
	КонецЕсли;
	ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодС 			= Формат(Выборка.ЗадолженностьЗаПериодС,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодПо 			= Формат(Выборка.ЗадолженностьЗаПериодПо,"ДФ=dd.MM.yyyy" ); 
	
	
	//ОбластьШапка.Параметры.Пеня 		= СуммаПени;	
	ТабДок.Вывести(ОбластьШапка); 	
КонецПроцедуры

Процедура ЗаполнитьПараметрыШапкиПени(ТабДок, ОбластьШапка, Выборка)
	ЗаполнитьЗначенияСвойств (ОбластьШапка.Параметры, Выборка);
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		ДатаРегистрации = Выборка.ДатаРегистрации + 86400*30;
		ОбластьШапка.Параметры.ДатаРегистрации 		= Формат(ДатаРегистрации,"ДФ=dd.MM.yyyy" );
		Если ЗначениеЗаполнено(Выборка.Договор) Тогда
			РезультатЗадолженность = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор);
			ВыборкаЗадолженность = РезультатЗадолженность.Выбрать();
			Пока ВыборкаЗадолженность.Следующий() Цикл
				СуммаЗадолженности = ВыборкаЗадолженность.Сумма;
			КонецЦикла;
			РезультатПени = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор);	
			ВыборкаПени = РезультатПени.Выбрать();
			Пока ВыборкаПени.Следующий() Цикл
				СуммаПени = ВыборкаПени.Сумма;
			КонецЦикла; 
			ОбластьШапка.Параметры.Пеня 		= СуммаПени;
		КонецЕсли;
	КонецЕсли;
	
	ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодС 			= Формат(Выборка.ЗадолженностьЗаПериодС,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодПо 			= Формат(Выборка.ЗадолженностьЗаПериодПо,"ДФ=dd.MM.yyyy" ); 
	//ОбластьШапка.Параметры.СуммаЗадолженности 		= СуммаЗадолженности;
	
	ТабДок.Вывести(ОбластьШапка);	
КонецПроцедуры

Процедура ЗаполнитьПараметрыШапкиСлужебнаяЗаписка(ТабДок, ОбластьШапка, Выборка)
	ЗаполнитьЗначенияСвойств (ОбластьШапка.Параметры, Выборка);
	СуммаЗадолженности = 0;
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) И ЗначениеЗаполнено(Выборка.Договор) Тогда
		РезультатЗадолженность = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор);
		ВыборкаЗадолженность = РезультатЗадолженность.Выбрать();
		Пока ВыборкаЗадолженность.Следующий() Цикл
			СуммаЗадолженности = ВыборкаЗадолженность.Сумма;
		КонецЦикла;
	КонецЕсли;
	ДатаРегистрации = Выборка.ДатаРегистрации;
	ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодС 			= Формат(Выборка.ЗадолженностьЗаПериодС,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодПо 			= Формат(Выборка.ЗадолженностьЗаПериодПо,"ДФ=dd.MM.yyyy" ); 
	ОбластьШапка.Параметры.ДатаРегистрации 		= Формат(ДатаРегистрации,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.Подписант 		= СклонениеПредставленийОбъектов.ПросклонятьФИО(СокрЛП(Выборка.Подписант), 3);     
	ОбластьШапка.Параметры.СуммаЗадолженности 		= СуммаЗадолженности;
	ОбластьШапка.Параметры.НомерТелефонаОтветственного = Выборка.НомерТелефонаОтветственного;
	ТабДок.Вывести(ОбластьШапка);	
КонецПроцедуры

Процедура ЗаполнитьПараметрыШапкиИсковогоЗаявления(ТабДок, ОбластьШапка, Выборка)
	ЗаполнитьЗначенияСвойств (ОбластьШапка.Параметры, Выборка);
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) И ЗначениеЗаполнено(Выборка.Договор) Тогда
		РезультатЗадолженность = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Выборка.Организация, Выборка.Район, Выборка.ДатаРегистрации, Выборка.Договор);
		ВыборкаЗадолженность = РезультатЗадолженность.Выбрать();
		Пока ВыборкаЗадолженность.Следующий() Цикл
			СуммаЗадолженности = ВыборкаЗадолженность.Сумма;
		КонецЦикла;
		ОбластьШапка.Параметры.СуммаЗадолженности 		= СуммаЗадолженности;
	КонецЕсли;

	ДатаАктаСверки = Выборка.ДатаАктаСверки;
	ОбластьШапка.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодС 			= Формат(Выборка.ЗадолженностьЗаПериодС,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ЗадолженностьЗаПериодПо 			= Формат(Выборка.ЗадолженностьЗаПериодПо,"ДФ=dd.MM.yyyy" ); 
	ОбластьШапка.Параметры.ДатаАктаСверки 		= Формат(ДатаАктаСверки,"ДФ=dd.MM.yyyy" );
	ОбластьШапка.Параметры.ДатаРегистрации 		= Формат(Выборка.ДатаРегистрации,"ДФ=dd.MM.yyyy" );    
	
	ОбластьШапка.Параметры.Контрагент = Выборка.Контрагент;
	ТабДок.Вывести(ОбластьШапка);	
КонецПроцедуры

Процедура ДанныеДокументаСобытия(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеДокументаСобытия());
	Пакет.ТаблицаДляПомещения	= "ДанныеСобытия";
КонецПроцедуры

Процедура ДанныеПоОрганизации(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеПоОрганизации());
	Пакет.ТаблицаДляПомещения	= "ДанныеПоОрганизации";
КонецПроцедуры

Процедура ДанныеРайонногоОтделения(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеРайонногоОтделения());
	Пакет.ТаблицаДляПомещения	= "ДанныеРайона";
КонецПроцедуры

Процедура ДанныеАбонента(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеАбонента());
	Пакет.ТаблицаДляПомещения	= "ДанныеАбонентов";
КонецПроцедуры

Процедура ДанныеБанка(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеБанка());
	Пакет.ТаблицаДляПомещения	= "ДанныеБанка";
КонецПроцедуры

Процедура ДанныеКонтрагента(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеКонтрагента());
	Пакет.ТаблицаДляПомещения	= "ДанныеКонтрагента";
КонецПроцедуры

Процедура ДанныеПодписанта(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеПодписанта());
	Пакет.ТаблицаДляПомещения	= "ДанныеПодписанта";
КонецПроцедуры

Процедура ДанныеОтветственного(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеОтветственного());
	Пакет.ТаблицаДляПомещения	= "ДанныеОтветственного";
КонецПроцедуры

Процедура ДанныеОбъектовРасчета(Схема)
	Пакет 						= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеОбъектовРасчета());
	Пакет.ТаблицаДляПомещения	= "ДанныеОбъектовРасчета";
КонецПроцедуры

Функция ТекстЗапросаДанныеБанка()
	Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк КАК Банк,
	|	КлассификаторБанков.КоррСчет КАК КоррСчет,
	|	КлассификаторБанков.Код КАК Код,
	|	Организации.Ссылка КАК Организация,
	|	энргЗоныОтвественности.Ссылка КАК Район
	|ИЗ
	|	Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|				ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
	|					И БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
	|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|		ПО энргЗоныОтвественности.Организация = Организации.Ссылка
	|ГДЕ
	|	энргЗоныОтвественности.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеСобытия.Район
	|			ИЗ
	|				ДанныеСобытия КАК ДанныеСобытия)";
	
	Возврат Текст	
КонецФункции

Функция ТекстЗапросаДанныеДокументаСобытия()	
	Текст = 
	"ВЫБРАТЬ
	|	энргСобытие.Ссылка КАК СобытиеСсылка,
	|	энргСобытие.Организация КАК Организация,
	|	энргСобытие.Район КАК Район,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Ссылка КАК КлючПомещения,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргСобытиеАбоненты.Абонент КАК Абонент,
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСобытиеПараметры.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бестПараметрыТиповСобытий.СрокПогашенияЗадолженности)
	|				ТОГДА энргСобытиеПараметры.Значение
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаПогашенияЗадолженности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСобытиеПараметры.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бестПараметрыТиповСобытий.ПланируемаяДатаВведенияОРП)
	|				ТОГДА энргСобытиеПараметры.Значение
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ПланируемаяДатаВведенияОРП,
	|	энргСобытиеАбоненты.Основание КАК Основание,
	|	энргСобытие.Ответственный КАК Ответственный,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСобытиеПараметры.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бестПараметрыТиповСобытий.Суд_СудебныйУчасток)
	|				ТОГДА энргСобытиеПараметры.Значение
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК НаименованиеСуда,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСобытиеПараметры.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бестПараметрыТиповСобытий.ДатаФормированияАктаСверки)
	|				ТОГДА энргСобытиеПараметры.Значение
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаАктаСверки,
	|	энргСобытие.Номер КАК НомерСобытия,
	|	энргСобытие.Дата КАК ДатаСобытия,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСобытиеПараметры.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бестПараметрыТиповСобытий.ДатаВрученияУведомления)
	|				ТОГДА энргСобытиеПараметры.Значение
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаВрученияУведомления,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСобытиеПараметры.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бестПараметрыТиповСобытий.СпособВрученияУведомления)
	|				ТОГДА энргСобытиеПараметры.Значение
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК СпособВручения,
	|	энргДоговорыКонтрагентов.Ссылка КАК Договор,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргСобытиеПараметры.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бестПараметрыТиповСобытий.Исполнитель)
	|				ТОГДА энргСобытиеПараметры.Значение
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Исполнитель
	|ПОМЕСТИТЬ ДанныеСобытия
	|ИЗ
	|	Документ.энргСобытие КАК энргСобытие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|				ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
	|			ПО энргСобытиеАбоненты.Абонент = энргАбоненты.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ПО энргСобытиеАбоненты.Абонент = энргДоговорыКонтрагентов.Ссылка
	|		ПО энргСобытие.Ссылка = энргСобытиеАбоненты.Ссылка
	|			И (энргСобытие.Ссылка В (&СписокДокументов))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргСобытие.Параметры КАК энргСобытиеПараметры
	|		ПО энргСобытие.Ссылка = энргСобытиеПараметры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргАбоненты.ЛицевойСчет,
	|	энргСобытиеАбоненты.Абонент,
	|	энргКлючиПомещений.Ссылка,
	|	энргСобытие.Ссылка,
	|	энргСобытие.Организация,
	|	энргСобытие.Район,
	|	энргКлючиПомещений.Строение,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	энргКлючиПомещений.Помещение,
	|	энргКлючиПомещений.ЧастныйСектор,
	|	энргСобытиеАбоненты.Основание,
	|	энргСобытие.Ответственный,
	|	энргСобытие.Номер,
	|	энргСобытие.Дата,
	|	энргДоговорыКонтрагентов.Ссылка,
	|	энргДоговорыКонтрагентов.Дата,
	|	энргДоговорыКонтрагентов.Номер,
	|	энргДоговорыКонтрагентов.Контрагент";
	
	Возврат Текст;
КонецФункции  

Функция ТекстЗапросаДанныеРайонногоОтделения() 	
	Текст = 
	"ВЫБРАТЬ
	|	энргЗоныОтвественности.Ссылка КАК Район,
	|	энргЗоныОтвественности.ДиректорРайонногоОтделения КАК ДиректорРО,	
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргЗоныОтвественностиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И энргЗоныОтвественностиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресРайона)
	|				ТОГДА энргЗоныОтвественностиКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ФактАдресРайона,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргЗоныОтвественностиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И энргЗоныОтвественностиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонРайона)
	|				ТОГДА энргЗоныОтвественностиКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ТелефонРайона,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргЗоныОтвественностиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И энргЗоныОтвественностиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailРайона)
	|				ТОГДА энргЗоныОтвественностиКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК EmailРайона
	|ПОМЕСТИТЬ ДанныеРайона
	|ИЗ
	|	Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности.КонтактнаяИнформация КАК энргЗоныОтвественностиКонтактнаяИнформация
	|		ПО энргЗоныОтвественности.Ссылка = энргЗоныОтвественностиКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	энргЗоныОтвественности.Ссылка В
	|				(ВЫБРАТЬ					
	|					ДанныеСобытия.Район КАК Район
	|				ИЗ
	|					ДанныеСобытия КАК ДанныеСобытия)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргЗоныОтвественности.Ссылка";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДанныеАбонента() 
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	МАКСИМУМ(ВложенныйЗапрос.АдресОбъектаЛС) КАК АдресОбъектаЛС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеСобытия.КлючПомещения КАК КлючПомещения,
	|		энргСтроенияКонтактнаяИнформация.Представление КАК АдресОбъектаЛС
	|	ИЗ
	|		ДанныеСобытия КАК ДанныеСобытия
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|			ПО ДанныеСобытия.Строение = энргСтроенияКонтактнаяИнформация.Ссылка
	|				И (энргСтроенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргСтроенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))
	|				И (ДанныеСобытия.ЧастныйСектор)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеСобытия.КлючПомещения,
	|		энргПомещенияКонтактнаяИнформация.Представление
	|	ИЗ
	|		ДанныеСобытия КАК ДанныеСобытия
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	|			ПО ДанныеСобытия.Помещение = энргПомещенияКонтактнаяИнформация.Ссылка
	|				И (энргПомещенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргПомещенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПомещения))
	|				И (НЕ ДанныеСобытия.ЧастныйСектор)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.КлючПомещения";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДанныеКонтрагента() 
	Текст = 
	"ВЫБРАТЬ
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ЮрАдрес,
	|	энргЗадачаПИД.Ссылка КАК СсылкаПИД,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	энргКонтрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|			ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|				И (энргКонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|			ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|				И (энргКонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|				И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|		ПО энргЗадачаПИД.Договор.Контрагент = энргКонтрагенты.Ссылка
	|ГДЕ
	|	энргЗадачаПИД.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеСобытия.Основание КАК Основание
	|			ИЗ
	|				ДанныеСобытия КАК ДанныеСобытия)";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДанныеПодписанта() 
	Текст = 
	"ВЫБРАТЬ
	|	энргРегистрацияУполномоченныхЛицПодписанты.Сотрудник КАК Сотрудник,
	|	энргРегистрацияУполномоченныхЛиц.Организация КАК Организация,
	|	энргРегистрацияУполномоченныхЛиц.Район КАК Район
	|ИЗ
	|	Документ.энргРегистрацияУполномоченныхЛиц КАК энргРегистрацияУполномоченныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргРегистрацияУполномоченныхЛиц.Подписанты КАК энргРегистрацияУполномоченныхЛицПодписанты
	|		ПО энргРегистрацияУполномоченныхЛиц.Ссылка = энргРегистрацияУполномоченныхЛицПодписанты.Ссылка
	|ГДЕ
	|	энргРегистрацияУполномоченныхЛицПодписанты.ВидПодписанта = ЗНАЧЕНИЕ(Перечисление.энргВидыПодписантов.НачальникЮУ)";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДанныеОтветственного() 
	Текст = 
	"ВЫБРАТЬ
	|	ПользователиКонтактнаяИнформация.Представление КАК НомерТелефонаОтветственного,
	|	Пользователи.Ссылка КАК Ответственный
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО Пользователи.Ссылка = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|ГДЕ
	|	Пользователи.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеСобытия.Ответственный
	|			ИЗ
	|				ДанныеСобытия КАК ДанныеСобытия)";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДанныеПоОрганизации()	
	Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ФактАдресОрганизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ЮридическийАдресОрганизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ЭлектроннаяПочтаОрганизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ФаксОрганизации,
	|	Организации.ИНН КАК ИННОрганизации,
	|	Организации.КПП КАК КППОрганизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СайтОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК СайтОрганизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК ТелефонОрганизации
	|ПОМЕСТИТЬ ДанныеОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	Организации.Ссылка В
	|				(ВЫБРАТЬ					
	|					ДанныеСобытия.Организация КАК Организация
	|				ИЗ
	|					ДанныеСобытия КАК ДанныеСобытия)
	|
	|СГРУППИРОВАТЬ ПО
	|	Организации.ИНН,
	|	Организации.КПП,
	|	Организации.Ссылка";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаДанныеОбъектовРасчета()
	Возврат 
		"ВЫБРАТЬ
		|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК АдресОбъекта,
		|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
		|		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестОбъектыРасчетаКонтактнаяИнформация.Ссылка
		|			И (бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета))
		|ГДЕ
		|	бестДоговорыТочекУчетаСрезПоследних.Договор В
		|			(ВЫБРАТЬ
		|				ДанныеСобытия.Договор КАК Договор
		|			ИЗ
		|				ДанныеСобытия КАК ДанныеСобытия)";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область МетодыДляРаботыСЭлектронойПочтой

Функция ПолучитьУчетнуюЗаписьЭП(Район) Экспорт 
	//ДоступныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина);
	//Если ДоступныеЗаписи.Количество() > 0 Тогда
	//	Возврат ДоступныеЗаписи[0].Ссылка;
	//Иначе
	//	Возврат Неопределено;
	//КонецЕсли;
	Возврат Район.УчетнаяЗаписьДляОтправкиПочты;
КонецФункции

Функция ПолучитьЭлектроннуюПочтуАбонента(Абонент) Экспорт 
	Если Не ЗначениеЗаполнено(Абонент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВидКонтактнойИнформации = энргОбщегоНазначения.ЗначениеКонстанты("энргВидЭлектроногоАдресаДляПИР"); 
	Если Не ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Контрагент = Абонент.ФизЛицо;
	СтрокаСЭлекАдресом = Контрагент.КонтактнаяИнформация.Найти(ВидКонтактнойИнформации, "Вид");
	Если СтрокаСЭлекАдресом <> Неопределено И Не ПустаяСтрока(СтрокаСЭлекАдресом.АдресЭП) Тогда 
		Возврат СтрокаСЭлекАдресом.АдресЭП;
	Иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции

Функция ОтправкаЭлектроннойПочтыДоступна(Абонент, Район) Экспорт 
	Возврат ЗначениеЗаполнено(Район.УчетнаяЗаписьДляОтправкиПочты) И ЗначениеЗаполнено(ПолучитьЭлектроннуюПочтуАбонента(Абонент));
КонецФункции

#КонецОбласти

#Область МетодыДляРаботыСSMS

Функция ПолучитьТелефонАбонента(Абонент, Представление = Ложь) Экспорт 
	Если Не ЗначениеЗаполнено(Абонент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВидКонтактнойИнформации = энргОбщегоНазначенияСерверПовтИспол.ПолучитьЗначениеКонстанты("энргВидТелефонаДляПИР");
	Если Не ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Абонент) = Тип("СправочникСсылка.энргАбоненты") Тогда
		
		Контрагент = Абонент.ФизЛицо;
	ИначеЕсли ТипЗнч(Абонент) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда             
		
		Контрагент = Абонент.Контрагент;
	Иначе
		
		Возврат Неопределено
	КонецЕсли;
	
	
	СтрокаСТелефоном = Контрагент.КонтактнаяИнформация.Найти(ВидКонтактнойИнформации, "Вид");
	Если СтрокаСТелефоном <> Неопределено И Не ПустаяСтрока(СтрокаСТелефоном.НомерТелефона) Тогда 
		Если Представление Тогда
			Возврат СтрокаСТелефоном.Представление;
		Иначе
			Возврат СтрокаСТелефоном.НомерТелефона;
		КонецЕсли;
	Иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции

Функция ОтправкаSMSДоступна(Абонент) Экспорт 
	Возврат ОтправкаSMS.ДоступнаОтправкаSMS() И ЗначениеЗаполнено(ПолучитьТелефонАбонента(Абонент));
КонецФункции

#КонецОбласти

#Область ЭкспортныеМетоды

Функция СоздатьИВыполнитьСобытиеНаОсновеЗадачи(Задача, ТипСобытия, ТекстШаблона = "", ТексТемы = "", ИмяМакета = "", МассивФайлов = Неопределено) Экспорт
	
	ДокОбъект = Документы.энргСобытие.СоздатьДокумент();
	ДокОбъект.Дата				 = ТекущаяДатаСеанса();
	ДокОбъект.ТипСобытия		 = ТипСобытия;
	ДокОбъект.ТекстШаблона		 = ТекстШаблона;
	ДокОбъект.ТемаСобытия		 = ТексТемы;
	ДокОбъект.МакетПечатнойФормы = ИмяМакета;
	ДокОбъект.Организация		 = Задача.Организация;
	
	СтрокаТЧ = ДокОбъект.Абоненты.Добавить();
	СтрокаТЧ.Абонент	= Задача.Абонент;
	СтрокаТЧ.Основание	= Задача;
	Попытка
		ДокОбъект.Записать();
		
		Если ЗначениеЗаполнено(МассивФайлов) Тогда
			Для каждого ТекФайл Из МассивФайлов Цикл
				ДатаМодификацииФайла		= ТекущаяДатаСеанса();
				ПараметрыДобавляемогоФайла	= Новый Структура;
				ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов",	 			ДокОбъект.Ссылка);
				ПараметрыДобавляемогоФайла.Вставить("Автор",						Строка(ПараметрыСеанса.ТекущийПользователь));
				ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения",				ТекФайл.Имя);
				ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки",			ТекФайл.Расширение);
				ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения",				МестноеВремя(ДатаМодификацииФайла, ЧасовойПоясСеанса()));
				ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное",	ДатаМодификацииФайла);
				РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, ТекФайл.Адрес); 
			КонецЦикла;
		КонецЕсли;
		
		ДокОбъект.ВыполнитьСобытия();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Если ДокОбъект.Абоненты[0].Успех Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отправить сообщение абоненту " + Задача.Абонент);
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ЭтоСобытиеСОтправкой(ТипСобытия) Экспорт
	
	СобытияСОтправкой = Новый Массив;
	СобытияСОтправкой.Добавить(Справочники.энргСпособСвязи.АвтоЗвонок);
	СобытияСОтправкой.Добавить(Справочники.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту);
	СобытияСОтправкой.Добавить(Справочники.энргСпособСвязи.ОтправкаСМС);
	
	Возврат СобытияСОтправкой.Найти(ТипСобытия) <> Неопределено;
КонецФункции

Функция ПолучитьПодэтапыЗадачи(Основание) Экспорт 
	
	Перем Запрос;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЗадачаПИДПодэтапы.Подэтап КАК Подэтап,
	|	энргЗадачаПИДПодэтапы.IDЭтапа КАК IDЭтапа,
	|	энргЗадачаПИДПодэтапы.Выполнен КАК Выполнен,
	|	энргЗадачаПИДПодэтапы.Текущий КАК Текущий,
	|	энргЗадачаПИДПодэтапы.Результат КАК Результат
	|ИЗ
	|	Задача.энргЗадачаПИД.Подэтапы КАК энргЗадачаПИДПодэтапы
	|ГДЕ
	|	энргЗадачаПИДПодэтапы.Ссылка = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область РаботаСоСтатусомСогласования

Процедура ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат) Экспорт
	
	Попытка
		МенеджерРегистра.ЗарегистрироватьСтатусСогласовано(ПериодСогласования, ОписаниеОжидаемыхДанных);
	Исключение
		ИнформацияОбОшибке		= ИнформацияОбОшибке();
		Результат 				= "Статус не зарегистрирован по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Комментарий				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		НеобязательныеПараметры = энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		НеобязательныеПараметры.ВыводитьСообщениеПользователю = Ложь;		
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Изменение статуса", УровеньЖурналаРегистрации.Ошибка, Комментарий, НеобязательныеПараметры); 		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьСтатусВернутьНаДоработку(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат) Экспорт
	
	Попытка
		МенеджерРегистра.ЗарегистрироватьСтатусВернутьНаДоработку(ПериодСогласования, ОписаниеОжидаемыхДанных);
		СтатусСогласования = ОписаниеОжидаемыхДанных.Статус;
	Исключение
		ИнформацияОбОшибке		= ИнформацияОбОшибке();
		Результат 				= "Статус не зарегистрирован по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Комментарий				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		НеобязательныеПараметры = энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		НеобязательныеПараметры.ВыводитьСообщениеПользователю = Ложь;		
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Изменение статуса", УровеньЖурналаРегистрации.Ошибка, Комментарий, НеобязательныеПараметры); 		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСВыполнениемСобытия

Процедура ЗарегистрироватьСтатусНеВыполнено(МенеджерРегистра, ПериодВыполнения, ОписаниеОжидаемыхДанных, Результат) Экспорт
	
	Попытка
		МенеджерРегистра.ЗарегистрироватьСтатусНеВыполнено(ПериодВыполнения, ОписаниеОжидаемыхДанных);
	Исключение
		ИнформацияОбОшибке		= ИнформацияОбОшибке();
		Результат 				= "Событие не выполнено по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Комментарий				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		НеобязательныеПараметры = энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		НеобязательныеПараметры.ВыводитьСообщениеПользователю = Ложь;		
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Выполнение события", УровеньЖурналаРегистрации.Ошибка, Комментарий, НеобязательныеПараметры); 		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьПараметрыПечатиЗаявлениеОВынесенииСудебногоПриказа(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЗадачаПИД.Организация КАК Организация,
	|	энргЗадачаПИД.Район КАК Район,
	|	энргЗадачаПИД.Абонент КАК Абонент,
	|	энргЗадачаПИД.ПериодЗадолженностиНачало КАК ПериодЗадолженностиНачало,
	|	энргЗадачаПИД.ПериодЗадолженностиКонец КАК ПериодЗадолженностиКонец,
	|	энргЗадачаПИД.СуммаЗадолженности КАК ОсновнойДолг,
	|	энргЗадачаПИД.СуммаПени КАК Пени,
	|	энргЗадачаПИД.ДатаРасчетаПени КАК ДатаРасчетаПени,
	|	энргЗадачаПИД.СуммаГоспошлина КАК Госпошлина,
	|	энргЗадачаПИД.СуммаЗадолженности + энргЗадачаПИД.СуммаПени КАК СуммаИска,
	|	энргЗадачаПИД.Ссылка КАК Ссылка,
	|	энргЗадачаПИД.ВидСудопроизводства КАК ВидСудопроизводства,
	|	энргФилиалыАбонентовСрезПоследних.Филиал.Наименование КАК АбонентскийОтдел
	|ПОМЕСТИТЬ ВТ_Задача
	|ИЗ
	|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних(, ) КАК энргФилиалыАбонентовСрезПоследних
	|		ПО энргЗадачаПИД.Абонент = энргФилиалыАбонентовСрезПоследних.Абонент
	|ГДЕ
	|	энргЗадачаПИД.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задача.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК ОрганизацияПолное,
	|	Организации.НаименованиеСокращённое КАК ОрганизацияСокращенное,
	|	Организации.ИНН КАК ИНН_Организации,
	|	Организации.КПП КАК КПП_Организации,
	|	Организации.РегистрационныйНомер КАК ОГРН_Организации,
	|	Организации.КодПоОКПО КАК ОКПО_Организации
	|ПОМЕСТИТЬ ВТ_Организация
	|ИЗ
	|	ВТ_Задача КАК ВТ_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТ_Задача.Организация = Организации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задача.Ссылка КАК Ссылка,
	|	энргЗадачаПИДСудебныеИнстанции.СудебыйУчасток КАК СудебыйУчасток,
	|	отэкСудыКонтактнаяИнформация.Представление КАК АдресСуда
	|ПОМЕСТИТЬ ВТ_СудебныйУчасток
	|ИЗ
	|	ВТ_Задача КАК ВТ_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.СудебныеИнстанции КАК энргЗадачаПИДСудебныеИнстанции
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСуды.КонтактнаяИнформация КАК отэкСудыКонтактнаяИнформация
	|			ПО энргЗадачаПИДСудебныеИнстанции.Суд = отэкСудыКонтактнаяИнформация.Ссылка
	|				И (отэкСудыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))
	|		ПО ВТ_Задача.Ссылка = энргЗадачаПИДСудебныеИнстанции.Ссылка
	|ГДЕ
	|	энргЗадачаПИДСудебныеИнстанции.Текущая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задача.Ссылка КАК Ссылка,
	|	энргКонтрагенты.бестФамилия КАК ФамилияДолжника,
	|	энргКонтрагенты.бестИмя КАК ИмяДолжника,
	|	энргКонтрагенты.бестОтчество КАК ОтчествоДолжника,
	|	энргКонтрагенты.бестДатаРождения КАК ДатаРожденияДолжника,
	|	энргКонтрагенты.МестоРождения КАК МестоРождения,
	//|	бестДокументыФизическихЛицСрезПоследних.Представление КАК Паспорт,
	|	энргКонтрагентыКонтактнаяИнформацияАдресПроживания.Представление КАК МестоРегистрацииДолжника,
	|	энргКонтрагентыКонтактнаяИнформацияАдресРегистрации.Представление КАК АдресДолжник,
	|	энргАбонентыКонтактнаяИнформация.Представление КАК АдресПомещения,
	|	энргАбонентыКонтактнаяИнформация.Город КАК Город,
	|	энргАбоненты.ВидОбъекта.Наименование КАК ВидОбъектаНаименование,
	|	энргФилиалыАбонентовСрезПоследних.Филиал КАК Филиал
	|ПОМЕСТИТЬ ВТ_Должник
	|ИЗ
	|	ВТ_Задача КАК ВТ_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестДокументыФизическихЛиц.СрезПоследних КАК бестДокументыФизическихЛицСрезПоследних
	//|				ПО энргКонтрагенты.Ссылка = бестДокументыФизическихЛицСрезПоследних.Контрагент
	//|					И (бестДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформацияАдресРегистрации
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформацияАдресРегистрации.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформацияАдресРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформацияАдресПроживания
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформацияАдресПроживания.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформацияАдресПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			ПО энргАбоненты.ФизЛицо = энргКонтрагенты.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|			ПО энргАбоненты.Ссылка = энргАбонентыКонтактнаяИнформация.Ссылка
	|				И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних КАК энргФилиалыАбонентовСрезПоследних
	|			ПО энргАбоненты.Ссылка = энргФилиалыАбонентовСрезПоследних.Абонент.Ссылка
	|		ПО ВТ_Задача.Абонент = энргАбоненты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления,
	|	энргЗадачаПИДЗадолженность.Услуга КАК Услуга,
	|	ВТ_Задача.Организация КАК Организация,
	|	ВТ_Задача.Район КАК Район,
	|	ВТ_Задача.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ПериодыДолга
	|ИЗ
	|	ВТ_Задача КАК ВТ_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
	|		ПО ВТ_Задача.Ссылка = энргЗадачаПИДЗадолженность.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(энргОбъемНачисленийОбороты.СуммаОборот) КАК Сумма
	|ПОМЕСТИТЬ ВТ_НачисленияПоМесяцам
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			,
	|			,
	|			,
	|			(Организация, Район, Абонент, Услуга, ПериодНачисления) В
	|				(ВЫБРАТЬ
	|					ВТ_ПериодыДолга.Организация КАК Организация,
	|					ВТ_ПериодыДолга.Район КАК Район,
	|					ВТ_ПериодыДолга.Абонент КАК Абонент,
	|					ВТ_ПериодыДолга.Услуга КАК Услуга,
	|					ВТ_ПериодыДолга.ПериодНачисления КАК ПериодНачисления
	|				ИЗ
	|					ВТ_ПериодыДолга КАК ВТ_ПериодыДолга)) КАК энргОбъемНачисленийОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОбъемНачисленийОбороты.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_НачисленияПоМесяцам.Сумма) КАК СуммаНачислений,
	|	&Задача КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОбъемНачислений
	|ИЗ
	|	ВТ_НачисленияПоМесяцам КАК ВТ_НачисленияПоМесяцам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НачисленияПоМесяцам.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_НачисленияПоМесяцам.Сумма КАК Сумма
	|ИЗ
	|	ВТ_НачисленияПоМесяцам КАК ВТ_НачисленияПоМесяцам
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задача.Организация КАК Организация,
	|	ВТ_Задача.Район КАК Район,
	|	ВТ_Задача.Абонент КАК Абонент,
	|	ВТ_Задача.ПериодЗадолженностиНачало КАК ПериодЗадолженностиНачало,
	|	ВТ_Задача.ПериодЗадолженностиКонец КАК ПериодЗадолженностиКонец,
	|	ВТ_Задача.ОсновнойДолг КАК ОсновнойДолг,
	|	ВТ_Задача.Пени КАК Пени,
	|	ВТ_Задача.ДатаРасчетаПени КАК ДатаПени,
	|	ВТ_Задача.Госпошлина КАК Госпошлина,
	|	ВТ_Задача.СуммаИска КАК СуммаИска,
	|	ВТ_Задача.Ссылка КАК Ссылка,
	|	ВТ_Должник.ФамилияДолжника КАК ФамилияДолжника,
	|	ВТ_Должник.ИмяДолжника КАК ИмяДолжника,
	|	ВТ_Должник.ОтчествоДолжника КАК ОтчествоДолжника,
	|	ВТ_Должник.ДатаРожденияДолжника КАК ДатаРожденияДолжника,
	|	ВТ_Должник.МестоРождения КАК МестоРождения,
	//|	ВТ_Должник.Паспорт КАК Паспорт,
	|	ВТ_Должник.МестоРегистрацииДолжника КАК МестоРегистрацииДолжника,
	|	ВТ_Должник.АдресДолжник КАК АдресДолжник,
	|	ВТ_Должник.АдресПомещения КАК АдресПомещения,
	|	ВТ_ОбъемНачислений.СуммаНачислений КАК СуммаНачислений,
	|	ВТ_Организация.ОрганизацияПолное КАК ОрганизацияПолное,
	|	ВТ_Организация.ОрганизацияСокращенное КАК ОрганизацияСокращенное,
	|	ВТ_Организация.ИНН_Организации КАК ИНН_Организации,
	|	ВТ_Организация.КПП_Организации КАК КПП_Организации,
	|	ВТ_Организация.ОГРН_Организации КАК ОГРН_Организации,
	|	ВТ_Организация.ОКПО_Организации КАК ОКПО_Организации,
	|	ВТ_СудебныйУчасток.СудебыйУчасток КАК СудебыйУчасток,
	|	ВТ_СудебныйУчасток.АдресСуда КАК АдресСуда,
	|	ЕСТЬNULL(ВТ_ОбъемНачислений.СуммаНачислений, 0) - ВТ_Задача.ОсновнойДолг КАК СуммаОплат,
	|	ВТ_Должник.Город КАК Город,
	|	ВТ_Должник.ВидОбъектаНаименование КАК ТипПомещения,
	|	ВТ_Задача.ВидСудопроизводства КАК ВидСудопроизводства,
	|	ВЫБОР
	|		КОГДА энргФилиалыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресАбонентскогоОтдела)
	|			ТОГДА энргФилиалыКонтактнаяИнформация.Представление
	|	КОНЕЦ КАК АдресФилиала,
	|	ВЫБОР
	|		КОГДА энргФилиалыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонЦентраОбслуживания)
	|			ТОГДА энргФилиалыКонтактнаяИнформация.Представление
	|	КОНЕЦ КАК ТелефонФилиала,
	|	ВТ_Задача.АбонентскийОтдел КАК АбонентскийОтдел
	|ИЗ
	|	ВТ_Задача КАК ВТ_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Организация КАК ВТ_Организация
	|		ПО ВТ_Задача.Ссылка = ВТ_Организация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СудебныйУчасток КАК ВТ_СудебныйУчасток
	|		ПО ВТ_Задача.Ссылка = ВТ_СудебныйУчасток.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемНачислений КАК ВТ_ОбъемНачислений
	|		ПО ВТ_Задача.Ссылка = ВТ_ОбъемНачислений.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Должник КАК ВТ_Должник
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргФилиалы.КонтактнаяИнформация КАК энргФилиалыКонтактнаяИнформация
	|			ПО ВТ_Должник.Филиал = энргФилиалыКонтактнаяИнформация.Ссылка
	|				И (энргФилиалыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресАбонентскогоОтдела))
	|		ПО ВТ_Задача.Ссылка = ВТ_Должник.Ссылка";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатПакета  = Запрос.ВыполнитьПакет();
	РезультатЗапроса = РезультатПакета[РезультатПакета.Количество()-1];
	
	ПараметрыПечати = Новый Структура;
	Для каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
		ПараметрыПечати.Вставить(ТекКолонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПечати, Выборка);
		Если СклонениеПредставленийОбъектов.ДоступенСервисСклонения() Тогда 
			СудебныйУчасток = НРег(Выборка.СудебыйУчасток);
			ПараметрыПечати.Вставить("СудебныйУчастокР", СклонениеПредставленийОбъектов.ПросклонятьПредставление(СудебныйУчасток, 2));
		КонецЕсли;
		ФамилияИмяОтчество = ?(ЗначениеЗаполнено(Выборка.ФамилияДолжника), Выборка.ФамилияДолжника, "")
		+ ?(ЗначениеЗаполнено(Выборка.ИмяДолжника), " " + Выборка.ИмяДолжника, "") 
		+ ?(ЗначениеЗаполнено(Выборка.ОтчествоДолжника), " " + Выборка.ОтчествоДолжника, "");
		ПараметрыПечати.Вставить("ФамилияИмяОтчество", ФамилияИмяОтчество);
		ФИО = 				 ?(ЗначениеЗаполнено(Выборка.ФамилияДолжника), Выборка.ФамилияДолжника, "")
		+ ?(ЗначениеЗаполнено(Выборка.ИмяДолжника), " " + Лев(Выборка.ИмяДолжника, 1) + ".", "") 
		+ ?(ЗначениеЗаполнено(Выборка.ОтчествоДолжника), " " + Лев(Выборка.ОтчествоДолжника, 1) + ".", "");
		ПараметрыПечати.Вставить("ФИО", ФИО);
		ПараметрыПечати.Вставить("ГодРождения", ?(ЗначениеЗаполнено(Выборка.ДатаРожденияДолжника), Формат(Выборка.ДатаРожденияДолжника, "ДФ=гггг"), ""));
		НачалоДолга = ?(ЗначениеЗаполнено(Выборка.ПериодЗадолженностиНачало), Формат(Выборка.ПериодЗадолженностиНачало, "ДФ='ММММ гггг'"), "");
		ПараметрыПечати.Вставить("НачалоДолга", НачалоДолга);
		ДеньНачалоДолга = ?(ЗначениеЗаполнено(Выборка.ПериодЗадолженностиНачало), Формат(Выборка.ПериодЗадолженностиНачало, "ДФ='dd ММММ гггг'"), "");
		ПараметрыПечати.Вставить("ДеньНачалоДолга", ДеньНачалоДолга);
		ДатаПени = ?(ЗначениеЗаполнено(Выборка.ДатаПени), Формат(Выборка.ДатаПени, "ДФ='dd ММММ гггг'"), "");
		ПараметрыПечати.Вставить("ДатаПени", ДатаПени);
		
		ОкончаниеДолга = ?(ЗначениеЗаполнено(Выборка.ПериодЗадолженностиКонец), Формат(Выборка.ПериодЗадолженностиКонец, "ДФ='ММММ гггг'"), "");
		ПараметрыПечати.Вставить("ОкончаниеДолга", ОкончаниеДолга);
	КонецЦикла;
	
	РезультатЗапроса = РезультатПакета[РезультатПакета.Количество()-2];
	ТаблицаНачислений = Новый Массив;
	Сч = 1;
	МесяцаЗадолженности = "";
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = Новый Структура("НомерСтроки, МесяцНачислений, СуммаНачисленийЗаМесяц");
		
		СтрокаТаблицы.НомерСтроки = Сч;
		МесяцНачисления = НРег(Формат(Выборка.ПериодНачисления, "ДФ='ММММ гггг'"));
		МесяцаЗадолженности = ?(ЗначениеЗаполнено(МесяцаЗадолженности), МесяцаЗадолженности + ", ", "") + МесяцНачисления;
		СтрокаТаблицы.МесяцНачислений = МесяцНачисления;
		СтрокаТаблицы.СуммаНачисленийЗаМесяц = Выборка.Сумма;
		СтрокаТаблицы.НомерСтроки = Сч;
		
		ТаблицаНачислений.Добавить(СтрокаТаблицы);
		Сч = Сч + 1;
	КонецЦикла;
	
	ПараметрыПечати.Вставить("МесяцаДолга", МесяцаЗадолженности);
	ПараметрыПечати.Вставить("ТаблицаНачислений", ТаблицаНачислений);
	
	Если ЗначениеЗаполнено(ПараметрыПечати.ТипПомещения) Тогда
		ТипПомещения = ПолучитьСклоненияСтроки(НРег(ПараметрыПечати.ТипПомещения), 
		,"ПД=Родительный");
		ПараметрыПечати.ТипПомещения = ТипПомещения[0];
	Иначе	
		ПараметрыПечати.ТипПомещения = "      ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыПечати.СуммаИска) Тогда
		ПараметрыПечати.Вставить("СуммаИскаПрописью",ЧислоПрописью(ПараметрыПечати.СуммаИска, "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2"));
	Иначе	
		ПараметрыПечати.СуммаИскаПрописью = "";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ПараметрыПечати.Пени) Тогда
		ПараметрыПечати.Вставить("ПениПрописью",ЧислоПрописью(ПараметрыПечати.Пени, "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2"));
	Иначе	
		ПараметрыПечати.ПениПрописью = "";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ПараметрыПечати.Госпошлина) Тогда
		ПараметрыПечати.Вставить("ГоспошлинаПрописью",ЧислоПрописью(ПараметрыПечати.Госпошлина, "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2"));
	Иначе	
		ПараметрыПечати.ГоспошлинаПрописью = "";
	КонецЕсли;	
	
	ЗапросОплат = Новый Запрос;
	ЗапросОплат.Текст = "ВЫБРАТЬ
	|	СУММА(энргВзаиморасчетыПоМесяцамОбороты.СуммаРасход) КАК СуммаОплаты,
	|	энргВзаиморасчетыПоМесяцамОбороты.Период КАК ДатаОплаты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ПериодНачисления МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоМесяцамОбороты
	|ГДЕ
	|	(энргВзаиморасчетыПоМесяцамОбороты.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ИЛИ энргВзаиморасчетыПоМесяцамОбороты.Регистратор ССЫЛКА Документ.энргПриходныйКассовыйОрдер)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыПоМесяцамОбороты.Период";
	
	ЗапросОплат.УстановитьПараметр("Организация",ПараметрыПечати.Организация);
	ЗапросОплат.УстановитьПараметр("Район",ПараметрыПечати.Район);
	ЗапросОплат.УстановитьПараметр("Абонент",ПараметрыПечати.Абонент);
	ЗапросОплат.УстановитьПараметр("НачалоПериода",ПараметрыПечати.ПериодЗадолженностиНачало);
	ЗапросОплат.УстановитьПараметр("КонецПериода",ПараметрыПечати.ПериодЗадолженностиКонец);
	
	Выборка = ЗапросОплат.Выполнить().Выбрать();
	ТаблицаОплат = Новый Массив;
	СтрокаОплат = "";
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаОплат = СтрокаОплат + НРег(Формат(Выборка.ДатаОплаты, "ДФ='дд ММ гггг'"))+ " г. - " + Формат(Выборка.СуммаОплаты, "ЧЦ=10; ЧДЦ=2;") + " руб.,";
		
	КонецЦикла;
	
	ПараметрыПечати.Вставить("СтрокаОплат", Лев(СтрокаОплат,СтрДлина(СтрокаОплат)-2));
	
	ФИОД = ПолучитьСклоненияСтроки(ПараметрыПечати.ФамилияИмяОтчество,,"ПД=Дательный");
	ПараметрыПечати.Вставить("ФамилияИмяОтчествоД",ФИОД[0]);
	
	ФИОТ = ПолучитьСклоненияСтроки(ПараметрыПечати.ФамилияИмяОтчество,,"ПД=Творительный");
	ПараметрыПечати.Вставить("ФамилияИмяОтчествоТ",ФИОТ[0]);
	ФИОР = ПолучитьСклоненияСтроки(ПараметрыПечати.ФамилияИмяОтчество,,"ПД=Родительный");
	ПараметрыПечати.Вставить("ФамилияИмяОтчествоР",ФИОР[0]);
	ПараметрыПечати.Вставить("НачалоДолгаВ",Нрег(ПолучитьСклоненияСтроки(ПараметрыПечати.НачалоДолга,,"ПД=Родительный")[0]));
	ПараметрыПечати.Вставить("ОкончаниеДолгаНрег",Нрег(ПараметрыПечати.ОкончаниеДолга));
	ПараметрыПечати.Вставить("АдресФилиал",ПараметрыПечати.АдресФилиала);	
	ПараметрыПечати.Вставить("ТелефонФилиал",ПараметрыПечати.ТелефонФилиала);	
	
	Возврат ПараметрыПечати;
	
КонецФункции

Функция ПолучитьПараметрыПечатиЗаявлениеИсполнительногоДокумента(Задача) Экспорт
	
	ПараметрыПечати = Новый Структура;
	
	ПараметрыПечати.Вставить("НомерСудебногоДела",Задача.НомерСудебногоДела);
	ПараметрыПечати.Вставить("ДатаСудебногоДела",Формат(Задача.Дата, "ДФ='дд ММ гггг'"));
	ПараметрыПечати.Вставить("НомерИсполнительногоЛиста",Задача.НомерИсполнительногоЛиста);
	ПараметрыПечати.Вставить("ДатаИсполнительногоЛиста",Формат(Задача.ДатаИсполительногоЛиста, "ДФ='дд ММ гггг'"));
	Если Задача.ИсполнительныеДокументы.Количество() <> 0 Тогда
		ПараметрыПечати.Вставить("ВидДокумента",Нрег(Строка(Задача.ИсполнительныеДокументы[0].ИсполнительныйДокумент)));
	Иначе	
		ПараметрыПечати.Вставить("ВидДокумента","исполнительный лист/судебный приказ");
	КонецЕсли;	
	
	
	Возврат ПараметрыПечати
	
КонецФункции	

#Область РаботаПечатнымиФормамиУведомленияПИРФЛ

Процедура СформироватьУведомлениеИсполнителюОРП(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьУведомлениеИсполнителюОРППереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьУведомлениеИсполнителюОбОтменеОРП(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьУведомлениеИсполнителюОбОтменеОРППереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьУведомлениеИсполнителюОПереносеОРП(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьУведомлениеИсполнителюОПереносеОРППереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьУведомлениеПотребителюОПереносеОРП(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьУведомлениеПотребителюОПереносеОРППереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьУведомлениеИсполнителюОВозобновленииЭнергоснабжения(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьУведомлениеИсполнителюОВозобновленииЭнергоснабженияПереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьУведомлениеПотребителюОВозобновленииЭнергоснабжения(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьУведомлениеПотребителюОВозобновленииЭнергоснабженияПереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры	

Процедура СформироватьУведомлениеПретензия(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьУведомлениеПретензияПереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьНапоминаниеОЗадолженности(ДокументСобытие, ТабДок) Экспорт
	Если СформироватьНапоминаниеОЗадолженностиПереопределяемый(ДокументСобытие, ТабДок) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПечатнойФормыПереопределяемый

Функция СформироватьУведомлениеИсполнителюОРППереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

Функция СформироватьУведомлениеИсполнителюОПереносеОРППереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

Функция СформироватьУведомлениеПотребителюОПереносеОРППереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

Функция СформироватьУведомлениеИсполнителюОбОтменеОРППереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

Функция СформироватьУведомлениеИсполнителюОВозобновленииЭнергоснабженияПереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

Функция СформироватьУведомлениеПотребителюОВозобновленииЭнергоснабженияПереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

Функция СформироватьУведомлениеПретензияПереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

Функция СформироватьНапоминаниеОЗадолженностиПереопределяемый(ДокументСобытие, ТабДок)
	Возврат Ложь;	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли