#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорФилиал", "Видимость", Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт());

	бестЛокализацияСервер.ПриСозданииНаСервере_бестРегистрацияПоказанийНПОбщий(ЭтотОбъект, Объект.Ссылка);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Для каждого стр из Объект.ТочкиУчета Цикл
		бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,стр.ОбъектРасчета);
		//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РайонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда 
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросОчистка",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"При изменении Района данные ТЧ будут очищены. продолжить?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда 
		СтандартнаяОбработка = ложь;
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросПередВыборомРайона",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"При изменении Района данные ТЧ будут очищены. продолжить?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда 
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросПередВыборомОрганизации",ЭтотОбъект,Элемент);
		ПоказатьВопрос(ОписаниеОповещения,"При изменении Организации данные ТЧ будут очищены. продолжить?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда 
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросОчистка",ЭтотОбъект,Элемент);
		ПоказатьВопрос(ОписаниеОповещения,"При изменении Организации данные ТЧ будут очищены. продолжить?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ПериодНачисления = ВычислитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ПериодНачисления = ВычислитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	СписокУслуг = бестПользовательскийВводСервер.ПолучитьСписокУслугДляВыбора(?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата), Объект.Организация, Объект.Район, ОбъектРасчета, ТочкаУчета);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент, Новый Структура("ТочкиСПриборами", Истина));
		СтандартнаяОбработка = Ложь;
	
	ВыборУслугиИТочкиУчета(Новый Структура, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаТекущиеПоказанияПриИзменении(Элемент)
	
	текСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	Если текСтрока.ТекущиеПоказания < 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущие показания не могут быть отрицательными!");
		текСтрока.ТекущиеПоказания = Неопределено;	
	Иначе 
		бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока, Объект.Дата, Ложь);
		
		Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
		КонецЕсли;	
		
		бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПровестиАнализаПолученногоРасхода(ТекСтрока);
	КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузкаВExcelСПоказаниями(Команда)
	ВыгрузитьВEXCELРегистрацияКС(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаВExcelБезПоказаний(Команда)
	ВыгрузитьВEXCELРегистрацияКС(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок 						= Новый ТабличныйДокумент;
	МассивДокументов 			= Новый Массив;
	МассивДокументов.Добавить(Объект.Ссылка);
	ПечатьНаСервере(МассивДокументов, ТабДок);
	ТабДок.АвтоМасштаб 			= Истина;
	ТабДок.Защита 				= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Показать("Регистрация показаний юр.лиц");	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
	Объект.ПериодНачисления = ВычислитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчистка(РезультатВопроса,ДополнительныеПараметры) Экспорт 
		
		Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
			Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
				Объект.ТочкиУчета.Очистить();
			КонецЕсли; 		
		КонецЕсли;	
	КонецПроцедуры
	
&НаКлиенте
Процедура ВопросПередВыборомОрганизации(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			Объект.ТочкиУчета.Очистить();
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередВыборомРайона(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			Объект.ТочкиУчета.Очистить();
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере(НайденнаяСтрока, Дубль)
	Результат = бестРаботаСприборамиУчетаСервер.ДанныеДляМассовогоВвода(Объект.Дата,Объект.ПериодНачисления,Объект.Организация,Объект.Район, Договор, МКД, ОбъектРасчета, ТочкаУчета, Услуга, Контролер);
	Выборка	= Результат.Выбрать();
	
	//ТЧТочки					= Объект.ТочкиУчета;
	ТЧТочки = Объект.ТочкиУчета.Выгрузить();
	ТЧТочки.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Отказ = Ложь;
		Отбор = Новый Структура("ПриборУчета, ОбъектРасчета, Шкала, ТочкаУчета, ТарифнаяЗона");
		
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		ИщемСтроку = Объект.ТочкиУчета.НайтиСтроки(Отбор);                  
		Если ИщемСтроку.Количество() > 0 Тогда
			Для мммм = 0 по ИщемСтроку.Количество()-1 Цикл
				Дубль = Истина;
				Если НайденнаяСтрока = "" Тогда
					НайденнаяСтрока = ИщемСтроку[мммм].ПолучитьИдентификатор();
				КонецЕсли;
				Если Не ИщемСтроку[мммм].ПредыдущиеПоказания = Выборка.ПредыдущиеПоказания Тогда
					ЗаполнитьЗначенияСвойств(ИщемСтроку[мммм], Выборка, "ПредыдущиеПоказания");
					бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(ИщемСтроку[мммм], Объект.Дата, Ложь);
					бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПровестиАнализаПолученногоРасхода(ИщемСтроку[мммм]);
				КонецЕсли;
				Отказ = Истина;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		
		Если Не Отказ = Истина Тогда
			ЕстьСредиДобавленных = ТЧТочки.НайтиСтроки(Отбор);
			Отказ = ЕстьСредиДобавленных.Количество() <> 0;
		КонецЕсли;
		
		Если Не Отказ Тогда
			НовСтрока = ТЧТочки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		КонецЕсли;			
	КонецЦикла;
	
	Для каждого НовСтрокаТЧ Из ТЧТочки Цикл
		СтрокаТЧ = Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, НовСтрокаТЧ);
		
		Если НайденнаяСтрока = "" Тогда
			НайденнаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьТЧНаСервереПереопределяемый();
	
	//Пока Выборка.Следующий() Цикл
	//	Отказ = Ложь;
	//	Если Дубль	= Неопределено Тогда
	//		Для каждого стр из ТЧ Цикл			
	//			Если Выборка.ПриборУчета = стр.ПриборУчета Тогда
	//				Дубль = Истина;
	//				НайденнаяСтрока	= стр.ПолучитьИдентификатор();
	//				Прервать;
	//			КонецЕсли;									
	//		КонецЦикла;
	//	Иначе
	//		Прервать;
	//	КонецЕсли;			
	//КонецЦикла;
	//Если Дубль = Неопределено Тогда
	//	Выборка.Сбросить();
	//	Пока Выборка.Следующий() Цикл
	//		НовСтрока = ТЧ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
	//		НайденнаяСтрока = НовСтрока.ПолучитьИдентификатор();
	//	КонецЦикла;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Район) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен район");
		Возврат;
	КонецЕсли;

	ТекСтрока		= "";
	Дубль = Неопределено;
	ЗаполнитьТЧНаСервере(ТекСтрока, Дубль);
	Если не Дубль = Неопределено Тогда
		Отказ 			= Истина;
		ДопПараметры	= Новый Структура;
		ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
		ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
		ДопПараметры.Вставить("ТекСтрока", 		ТекСтрока);
		ПоказанияУжеВведеныВопрос(ДопПараметры);			
	КонецЕсли;
	Если Не ТекСтрока = "" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ТочкиУчета;
		Элементы.ТочкиУчета.ТекущаяСтрока = ТекСтрока;
		Элементы.ТочкиУчета.ТекущийЭлемент = Элементы.ТочкиУчетаТекущиеПоказания;
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПоказанияУжеВведеныВопрос(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросПереходаКСтроке",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Показания уже введены. Перейти к строке?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПереходаКСтроке(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ПерейтиКСтроке(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСтроке(ДополнительныеПараметры)
	Элементы[ДополнительныеПараметры.ТЧ].ТекущаяСтрока = ДополнительныеПараметры.ТекСтрока;
	Элементы[ДополнительныеПараметры.ТЧ].ТекущийЭлемент = Элементы[ДополнительныеПараметры.ТЧ + "ТекущиеПоказания"];	
КонецПроцедуры

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета, ПростыеУслуги",КонецДня(Объект.ДатаФактическогоСобытия));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	СтруктураОтбора.Период = ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), КонецДня(Объект.ДатаФактическогоСобытия), КонецДня(Объект.Дата));
	
	Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
		СтруктураОтбора.ОбъектРасчета = ОбъектРасчета;
	Иначе
		СтруктураОтбора.ОбъектРасчета = ТекДанные.ОбъектРасчета;
	КонецЕсли;
	
	СтруктураОтбора.ПростыеУслуги = Истина;	
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора, ТипВладельца, РегистрацияПоказанийЮЛ", СтруктураОтбора, "НП", Истина);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		
		Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
			ТочкаУчета = РезультатЗакрытия.ТочкаУчета;
			Услуга = РезультатЗакрытия.Услуга;
		Иначе
			ТекДанные.ТочкаУчета = РезультатЗакрытия.ТочкаУчета;
			ТекДанные.Услуга = РезультатЗакрытия.Услуга;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВEXCELРегистрацияКС(ПоказыватьТекПоказания)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выгрузкой документ необходимо записать");
		Возврат;
	КонецЕсли;
	
	ТабДок 					= Новый ТабличныйДокумент;
	МассивДок 				= Новый Массив;
	МассивДок.Добавить(Объект.Ссылка);
	ВыгрузкаВEXCELНаСервере(МассивДок, ТабДок, ПоказыватьТекПоказания);
	КаталогВыгрузки 		= ПолучитьКаталогВыгрузки();
	ПолноеИмяФайла			= КаталогВыгрузки + "Регистрация_показаний_" + ?(ПоказыватьТекПоказания, "с_показаниями_№", "без_показаний_№")  + Строка(Объект.Номер) + "_от_" + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + ".xlsx";
	
	ТабДок.Вывод			= ИспользованиеВывода.Разрешить;
	ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + ПолноеИмяФайла + " записан");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКаталогВыгрузки()
	ТекКаталогВыгрузки	= ""; 
	#Если ВебКлиент Тогда

		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	    
	    ДиалогВыбораФайла.Каталог = ТекКаталогВыгрузки;
	    ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	    
	    ПараметрыСценария = Новый Структура;
	    Оповещение = Новый ОписаниеОповещения("КаталогНачалоВыбораЗавершение", ЭтаФорма);
	    ПараметрыСценария.Вставить("Оповещение_ПослеЗакрытияДиалогаВыбораФайла", Оповещение);
	    ПараметрыСценария.Вставить("ДиалогВыбораФайла", ДиалогВыбораФайла);
	                                
	    ВыполнитьСценарийВыбораФайла(, ПараметрыСценария);
	#Иначе
		Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
		ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
		СтандартнаяОбработка = Ложь;
		ДиалогОткрытия.Каталог = ""; 
		ДиалогОткрытия.МножественныйВыбор = Ложь; 
		ДиалогОткрытия.Заголовок = "Выберите каталог"; 
		
		Если ДиалогОткрытия.Выбрать() Тогда 
			ТекКаталогВыгрузки = ДиалогОткрытия.Каталог + "\"; 
		КонецЕсли;
	#КонецЕсли	
	
	Возврат ТекКаталогВыгрузки;	
КонецФункции

&НаСервере
Процедура ВыгрузкаВEXCELНаСервере(МассивДок, ТабДок, ПоказыватьТекПоказания)
	Документы.бестРегистрацияПоказанийНПОбщий.СформироватьПечатнуюФорму(МассивДок, ТабДок, ПоказыватьТекПоказания);	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    КаталогВыгрузки = Результат[0]+"\";   
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтсчетШагов(ПараметрыСценария)
	
	Если ПараметрыСценария = Неопределено Тогда
		ПараметрыСценария = Новый Структура;
	КонецЕсли;
	
	Если НЕ ПараметрыСценария.Свойство("ПредыдущийШаг") Тогда
		// при первом запуске основной процедуры это свойство отстуствует
		ПараметрыСценария.Вставить("ПредыдущийШаг", 0);
	КонецЕсли;
	
	ПараметрыСценария.Вставить("ТекущийШаг", 0);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтотШагЕщеНеВыполнялся(ПараметрыСценария)
	
	ПараметрыСценария.ТекущийШаг = ПараметрыСценария.ТекущийШаг + 1;

	Если ПараметрыСценария.ПредыдущийШаг >= ПараметрыСценария.ТекущийШаг Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыСценария.ПредыдущийШаг = ПараметрыСценария.ТекущийШаг;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ЭтоРезультатВыполненногоШага(ПараметрыСценария)

	Возврат ПараметрыСценария.ПредыдущийШаг = ПараметрыСценария.ТекущийШаг;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСценарийВыбораФайла(Результат = Неопределено, ПараметрыСценария = Неопределено) Экспорт
    
    НачатьОтсчетШагов(ПараметрыСценария);
    
    Оповещение = Новый ОписаниеОповещения("ВыполнитьСценарийВыбораФайла", ЭтаФорма, ПараметрыСценария);
    
    // подключить расширение работы с файлами
    Если ЭтотШагЕщеНеВыполнялся(ПараметрыСценария) Тогда
            НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
            Возврат;
        
    ИначеЕсли ЭтоРезультатВыполненногоШага(ПараметрыСценария) Тогда
        
        // если расширение подключилось, перейти к следующему шагу
        Если Результат = Истина Тогда
            
        // если расширение не подключилось, задать вопрос об его установке
        ИначеЕсли Результат = Ложь Тогда
            ТекстСообщения = "Расширение для работы с файлами не установлено. Установить?";
            ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
            Возврат;
            
        // пользователь отказался от установки расширения по работе с файлами
        ИначеЕсли Результат <> КодВозвратаДиалога.Да Тогда
            Возврат;
            
        // пользователь подтвердил установку расширения по работе с файлами
        ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
            НачатьУстановкуРасширенияРаботыСФайлами();
            Возврат;
            
        КонецЕсли;
            
    КонецЕсли;
    
    // открыть диалог выбора файла
    Если ЭтотШагЕщеНеВыполнялся(ПараметрыСценария) Тогда
        
        // переадресовываем результат на прикладную процедуру
        ПараметрыСценария.ДиалогВыбораФайла.Показать(ПараметрыСценария.Оповещение_ПослеЗакрытияДиалогаВыбораФайла);
        Возврат;
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(МассивДокументов, ТабДок)
	Документы.бестРегистрацияПоказанийНПОбщий.СформироватьПечатнуюФорму53(МассивДокументов, ТабДок);
КонецПроцедуры

&НаСервере
Функция ВычислитьПериодНачисления()
	Если ЗначениеЗаполнено(Объект.Организация) и ЗначениеЗаполнено(Объект.Район) Тогда
		Возврат Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервереПереопределяемый()
	// Переопределяется в расширении	
КонецПроцедуры

#КонецОбласти