#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЗащитыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
	Отказ 						= Ложь;
	МенеджерЗащиты 				= слкМенеджерЗащитыПовтИсп.ПолучитьМенеджерЗащиты();
	ОписаниеОшибки  			= "";  
	Серия 						= Метаданные.Подсистемы.энргБиллинг.Подсистемы.энргСистемаЛицензированияБиллинг.Комментарий;
	Отказ 						= Истина;
	Если МенеджерЗащиты[Серия] <> Неопределено тогда
		слкМенеджерЗащиты.ПроверитьЛицензиюСеанса(серия,ОписаниеОшибки);
		Отказ 					= ЗначениеЗаполнено(ОписаниеОшибки);
	КонецЕсли; 	
	
	Если Отказ тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось обнаружить свободные лицензии сеанса конфигурации " + Метаданные.Синоним + ", проверьте настройки сервера лицензирования");
		СтандартнаяОбработка 	= Ложь;
		ВыбраннаяФорма  		= "Обработка.слкМенеджерЛицензий.Форма.МенеджерЛицензийСЛК";		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

