#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЛСПодключенКЛК(Дата,ЛС) Экспорт
	
	Подключен = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСостояниеЛСВЛКСрезПоследних.Подключен КАК Подключен
		|ИЗ
		|	РегистрСведений.бестСостояниеЛСВЛК.СрезПоследних(&Дата, ЛицевойСчет = &ЛС) КАК бестСостояниеЛСВЛКСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЛС"	, ЛС);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Подключен = Выборка.Подключен;
	КонецЕсли; 	
		
	Возврат Подключен;
	
КонецФункции

#КонецОбласти

#КонецЕсли
