#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// энргОбщегоНазначения.ЗаполнитьОрганизациюПоУмолчанию();
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"СпособРасчетаНорматива","СпособыРасчетаНормативаСоставныхУслуг","ПараметрыСпособовРасчетаНорматива");
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ИтогиПоДоговору = Ложь;
	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
	
	ЗаполнитьТекстовыеПоля();
	бестЛокализацияСервер.ПриСозданииНаСервере_бестЗаключениеДоговоровСЮридическимиЛицами(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	//энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");

	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
	
	ОбновитьСуммуПоКварталу();
	ОбновитьЗаголовокКнопкиПереключенияИтогов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(Нов_НомерДоговора)
			 И ЗначениеЗаполнено(Нов_ДатаДоговора) И ЗначениеЗаполнено(Нов_ТипДоговора)	Тогда
		Элементы.Группа19.Видимость = Ложь;
	КонецЕсли;
	
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);
			

	//энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект);
	СоответствиеСтрок 						= Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
	
	
	бестПользовательскийВводСервер.ЗаписатьПараметрыОбъекта(Объект.ОбъектыРасчета, ТекущийОбъект);
	

	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
	//	// проверяем и создаем Объекты 
	//	СоотвествиеКолонок  = Новый Структура;
	//	СоотвествиеКолонок.Вставить("Наименование",	"НаименованиеОбъектаРасчета");
	//	СоотвествиеКолонок.Вставить("НазначениеНП",	"НазначениеНП");
	//	СоотвествиеКолонок.Вставить("МКД",			"МКД");
	//	
	//	бестРаботаСТочкамиУчетаНПСервер.ПроверитьИСоздатьОбъектыРасчета(ТекущийОбъект,"ОбъектыРасчета",СоотвествиеКолонок);
	//	
	//	// проверяем и создаем ТУ	
	//	бестРаботаСТочкамиУчетаНПСервер.ПроверитьИСоздатьТочкиУчета(Объект,ТекущийОбъект, "ТочкиУчета","ОбъектыРасчета");
	//	
	//	// проверяем и создаем приборы учета 
	//	СоотвествиеКолонок  = Новый Структура;
	//	СоотвествиеКолонок.Вставить("ЗаводскойНомер",		"ЗаводскойНомер");
	//	СоотвествиеКолонок.Вставить("ТипПрибораУчета",		"ТипПрибораУчета");
	//	СоотвествиеКолонок.Вставить("ДатаВыпуска",			"ДатаВыпуска");
	//	СоотвествиеКолонок.Вставить("ДатаПоверкиСчетчика",	"ДатаПоверкиСчетчика");
	//	СоотвествиеКолонок.Вставить("ПриборУчета",			"ПриборУчета"); 
	//	СоотвествиеКолонок.Вставить("ВидКанальности",		"ВидКанальности");
	//	СоотвествиеКолонок.Вставить("КоэффициентПУ",		"КоэффициентПУ");
	//	
	//	Для Каждого стр из Объект.ТочкиУчета цикл
	//		стр.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();
	//	КонецЦикла;
	//	
	////	энргРаботаСприборамиУчетаСервер.ПроверитьИСоздатьПриборы(Объект.ТочкиУчета, ТекущийОбъект.ТочкиУчета,СоотвествиеКолонок,Ложь,Отказ);
	//
	//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);

	//	
	//КонецЕсли;

	
	////энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	//
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//			
	//	бестРаботаСТочкамиУчетаНПСервер.ПроверитьИСоздатьОбъектыРасчета(ТекущийОбъект,"ОбъектыРасчета");

	//	энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);		
	//	
	//	НовыеТочкиУчета						= Новый Массив;
	//	НовыеПриборыУчета 					= Новый Массив;
	//	
	//	Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
	//		Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Или СтрокаТочкиУчета.ТочкаУчета.ПолучитьОбъект() = Неопределено Тогда
	//			СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
	//			НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
	//		КонецЕсли;
	//		
	//		Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
	//			СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
	//			НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
	//		КонецЕсли;			
	//	КонецЦикла;
	//	
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	//	
	//КонецЕсли; 


КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.Договор);

	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");

	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
	//	энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
	//КонецЕсли;
	
	Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		бестРаботаСОбъектамиНПСервер.ПроверитьИСоздатьОбъектыРасчета(ТекущийОбъект,"ОбъектыРасчета");
		// Добавлено для УК!
		Если Объект.Договор.ТипДоговора <> Перечисления.бестТипыДоговоров.УправляющаяКомпания Тогда
			энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
			//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
			//энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
			
			
			НовыеПриборыУчета 					= Новый Массив;
			Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
				НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
			КонецЕсли;
			
			НовыеИзмерители 					= Новый Массив;
			Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
				НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
			КонецЕсли;
			
			Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
				Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
					ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
				КонецЕсли;			
			КонецЦикла;
			
			Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		СтрукРек = Новый Структура("Нов_НомерДоговора, Нов_ДатаДоговора, Нов_ТипДоговора");
		
		Для каждого ТекСтрук Из СтрукРек Цикл
			ТекИндекс = ПроверяемыеРеквизиты.Найти(ТекСтрук.Ключ);
			Если ТекИндекс <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ТекИндекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестЗаключениеДоговоровСЮридическимиЛицами",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиОбъекты

&НаКлиенте
Процедура ОбъектыРасчетаПриАктивизацииСтроки(Элемент)
		
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	//энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.УслугиОбъектов,						Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПотребителиГВС,						Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы["ТочкиУчета"	],	Неопределено,		ТекДанные.IDСтроки,, "Владельца");
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТемпературныеГрафикиОбъектов,			Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.МаксимальныеНагрузки,					Неопределено,		ТекДанные.IDСтроки);
	//энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны,				Неопределено,		ТекДанные.IDСтроки); 
	//энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ФормулыРасчетаУслугЕстьШкалыЕстьТарифныеЗоны,					Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТарифныеКатегорииУслуги,				Неопределено,		ТекДанные.IDСтроки);

	Если Объект.ОбъемыИНагрузкиВРазрезеДоговора И ТекДанные.НомерСтроки > 1 Тогда
		Элементы.ГарантированныеОбъемы.ТолькоПросмотр = Истина;
		Элементы.УслугиОбъектов.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ГарантированныеОбъемы.ТолькоПросмотр = Ложь;
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ГарантированныеОбъемы,					Неопределено,		ТекДанные.IDСтроки);
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.УслугиОбъектов,						Неопределено,		ТекДанные.IDСтроки);
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ИтогиДоговорныхОбъемов,				Неопределено,		ТекДанные.IDСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаНаименованиеОбъектаРасчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.НаименованиеОбъектаРасчета) Тогда
		ТекДанные.ОбъектРасчета = ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаОбъектРасчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ОбъектРасчета) Тогда 
		// Ищем строки по индентификатору
		ТаблицыФормы				= Новый Массив;	
		ТаблицыФормы.Добавить("УслугиОбъектов");
		ТаблицыФормы.Добавить("ПотребителиГВС");
		ТаблицыФормы.Добавить("ГарантированныеОбъемы");
		ТаблицыФормы.Добавить("ТарифныеКатегорииУслуги");

		энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
			
		ДанныеОбъекта = бестРаботаСОбъектамиНПСервер.ПолучитьИнформациюПоОбъекту(ТекДанные.ОбъектРасчета);
		ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеОбъекта.СтруктураОбъекта);
		
		СоответствиеНагрузок = ДанныеОбъекта.СоответствиеНагрузок;
		Для Каждого ТекНагрузка Из СоответствиеНагрузок Цикл
			НовСтрока = Объект.УслугиОбъектов.Добавить();
			НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
			НовСтрока.Услуга	= ТекНагрузка.Ключ;
			НовСтрока.Нагрузка	= ТекНагрузка.Значение;
		КонецЦикла;
		
		СоответствиеПотребителей = ДанныеОбъекта.СоответствиеПотребителей;
		Для Каждого ТекПотребитель Из СоответствиеПотребителей Цикл
			НовСтрока = Объект.ПотребителиГВС.Добавить();
			НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
			НовСтрока.Тип	= ТекПотребитель.Ключ;
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекПотребитель.Значение);
		КонецЦикла;
		
		МассивОбъемов = ДанныеОбъекта.МассивОбъемов;
		Для Каждого ТекОбъем Из МассивОбъемов Цикл
			НовСтрока = Объект.ГарантированныеОбъемы.Добавить();
			НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекОбъем);
		КонецЦикла;
		
		СоответствиеТарифныхКатегорий = ДанныеОбъекта.СоответствиеТарифныхКатегорий;
		Для Каждого ТекТарифнаяКатегория Из СоответствиеТарифныхКатегорий Цикл
			НовСтрока = Объект.УслугиОбъектов.Добавить();
			НовСтрока.IDСтроки	= ТекДанные.IDСтроки;
			НовСтрока.Услуга	= ТекНагрузка.Ключ;
			НовСтрока.Нагрузка	= ТекНагрузка.Значение;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередУдалением(Элемент, Отказ)
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("УслугиОбъектов");
	ТаблицыФормы.Добавить("ПотребителиГВС");
	ТаблицыФормы.Добавить("ГарантированныеОбъемы");
	ТаблицыФормы.Добавить("ТемпературныеГрафикиОбъектов");
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);

	
	ТаблицыФормы.Очистить();
	ТаблицыФормы.Добавить("ТочкиУчета");
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	ТаблицыФормыВторогоУровня.Добавить("ФормулыРасчетаУслуг");
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы,"Владельца", ТаблицыФормыВторогоУровня);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;	
		НоваяСтрока = Объект.ОбъектыРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные);
		НоваяСтрока.idСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиГарантированныеОбъемы

&НаКлиенте
Процедура ГарантированныеОбъемыПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеОбъемы = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанныеОбъемы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеОбъемы.IDСтроки = ТекДанные.IDСтроки;

	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	
	//ТекДанные = Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	//энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны, Элементы.ФормулыРасчетаУслуг, ТекДанные.IDСтроки); 

	ТекущиеДанные			= Элементы["ТочкиУчета"				].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыШкал		= Элементы["ШкалыПриборовУчета"		];
	ТаблицаФормыФормул		= Элементы["ФормулыРасчетаУслуг"	];
	ТаблицаФормыШкалУслуг	= Элементы["ШкалыУслуг"				];
	
	// энргРаботаСВидомКанальности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,		"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтроки); 
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыФормул,		"IDСтроки",				ТекущиеДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг,	"IDСтроки",				ТекущиеДанные.IDСтроки);
	// энргРаботаСВидомКанальности }
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" ;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидКанальностиПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомКанальности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомКанальности }
	
	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ВидКанальности);
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиШкалы,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности,ТекущиеДанные.услуга),"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	// энргРаботаСПоставщиками {
	бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСПоставщиками } 
	
	УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	Если ИспользоватьШкалыПриборовУчета Тогда
		СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
		бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
	
	ТекущиеДанные.ВладелецПрибораУчета = Объект.Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	ТаблицыФормы.Добавить("ШкалыУслуг");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы,,ТаблицыФормыВторогоУровня);
КонецПроцедуры  

&НаКлиенте
Процедура ТочкиУчетаНетШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалы, Объект, ТаблицыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	ТаблицыФормы.Добавить("ШкалыУслуг");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтрокиВладельца = ТекДанные.IDСтроки;
	
	ТочкиУчетаПриИзмененииСервер(ТекДанные.IDСтроки);
 КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаПриИзмененииСервер(IDСтроки)	
	бестРаботаСТочкамиУчетаНПСервер.ОбновитьГруппыПотребителейУслуги(ЭтотОбъект, IDСтроки);	
КонецПроцедуры


&НаКлиенте
Процедура ТочкиУчетаСпособРасчетаНормативаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");
	//бестРаботаСоСпособомРасчетаНормативаКлиент.СпособРасчетаНормативаАвтоПодбор(ЭтаФорма,ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСпособРасчетаНормативаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиШкалыПриборовУчета
&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	Состав 									= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтроки,Состав,"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" ;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" ;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиФормулыРасчетаУслуг

&НаКлиенте
Процедура ФормулыРасчетаУслугФормулаРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ИмяТаблицыФормул						= "ФормулыРасчетаУслуг" ;

	ТекущиеДанныеТочкиУчета 	= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ТекущиеДанные 				= Элементы[ИмяТаблицыФормул].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ  ТекущиеДанныеТочкиУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоставУслуги 				= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(ТекущиеДанныеТочкиУчета.Услуга);

	//	
	//ТарифныеЗоны 				= Новый Массив;
	//
	//Для Каждого СтрокаТарифнойЗоны Из Объект.ПоказанияПриборовУчета Цикл
	//	Если НЕ ТекущиеДанныеТочкиУчета.IDСтроки  = СтрокаТарифнойЗоны.IDСтроки Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	ТарифныеЗоны.Добавить(СтрокаТарифнойЗоны.ТарифнаяЗона);
	//КонецЦикла;	
	  Шкалы		 				= Новый Массив;
	
	Для Каждого СтрокаШкалы Из Объект.ШкалыПриборовУчета Цикл
		Если НЕ ТекущиеДанныеТочкиУчета.IDСтроки  = СтрокаШкалы.IDСтрокиТочкиУчета Тогда
			Продолжить;
		КонецЕсли;
		Шкалы.Добавить(СтрокаШкалы.Шкала);
	КонецЦикла;
	
	Оповещение 					= Новый ОписаниеОповещения("НастройкаФормулыРасчетаЗавершение",ЭтаФорма,Новый Структура("КлючСтроки", Элементы.ФормулыРасчетаУслугЕстьШкалыЕстьТарифныеЗоны.ТекущаяСтрока));
	ПараметрыФормы 				= Новый Структура;
	ПараметрыФормы.Вставить("Услуга", 					ТекущиеДанные.Услуга);
	ПараметрыФормы.Вставить("СоставУслуги", 			СоставУслуги);
	//ПараметрыФормы.Вставить("ТарифныеЗоны", 			ТарифныеЗоны);
	ПараметрыФормы.Вставить("Шкалы", 					Шкалы);
	ПараметрыФормы.Вставить("ПредставлениеФормулы", 	ТекущиеДанные.ФормулаРасчетаПредставление);


	
	ОткрытьФорму("ОбщаяФорма.энргНастройкаФормулРасчета",ПараметрыФормы,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
	КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиФормулыРасчетаУслуг

&НаКлиенте
Процедура ШкалыУслугШкалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	Элемент.СписокВыбора.ЗагрузитьЗначения(СоставКанальности);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТарифныеКатегорииУслуги

&НаКлиенте
Процедура ТарифныеКатегорииУслугиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеТарифныеКатегории = Элементы.ТарифныеКатегорииУслуги.ТекущиеДанные;
	Если ТекДанныеТарифныеКатегории = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеТарифныеКатегории.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура ТарифныеКатегорииУслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиУслугиОбъектов

&НаКлиенте
Процедура УслугиОбъектовУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Элементы.УслугиОбъектов.ТекущиеДанные.Услуга.Пустая()=Истина Тогда
		Отказ=Истина;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("IDСтроки", Элементы.УслугиОбъектов.ТекущиеДанные.IDСтроки);
		ПараметрыОтбора.Вставить("Услуга", Элементы.УслугиОбъектов.ТекущиеДанные.Услуга);
		
		НайденныеСтроки = Объект.УслугиОбъектов.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()> 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По услуге "+ Элементы.УслугиОбъектов.ТекущиеДанные.Услуга + " уже введена нагрузка");
			//Объект.УслугиОбъектов.Удалить(Элементы.УслугиОбъектов.ТекущаяСтрока);
			ИдентификаторСтроки = Элементы.УслугиОбъектов.ТекущаяСтрока;
			ЭлементКоллекции = Объект.УслугиОбъектов.НайтиПоИдентификатору(ИдентификаторСтроки);
			ИндексЭлементаКоллекции = Объект.УслугиОбъектов.Индекс(ЭлементКоллекции);
			Объект.УслугиОбъектов.Удалить(ИндексЭлементаКоллекции);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныеПроцедурыФункции

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКанальности) тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.ВидКанальности = ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	НастроитьВидимостьРеквизитовДоговора();
	//Элементы.ГарантированныеОбъемы.Видимость = Не Объект.ОбъемыИНагрузкиВРазрезеДоговора;	
	//Элементы.ГарантированныеОбъемыПоДоговору.Видимость = Объект.ОбъемыИНагрузкиВРазрезеДоговора;	
КонецПроцедуры	
		
&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ТекущийДоговор) тогда
		ИсключаемыеСвойства 	= "";
		ДанныеДоговора  		= Новый Структура("Организация,Район,Контрагент");
		бестПользовательскийВводСервер.УстановитьЗависимыеРеквизитыДоговораКонтрагента(Объект.ТекущийДоговор,ДанныеДоговора);
		ЗаполнитьЗначенияСвойств(Объект,ДанныеДоговора,,ИсключаемыеСвойства);
		
		ЗаполнитьДанныеДоговораСервер();
		
		ЗаполнитьИтогиДоговорныхОбъемов();
		ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеУслуги = Элементы.УслугиОбъектов.ТекущиеДанные;
	Если ТекДанныеУслуги = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеУслуги.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура ПотребителиГВСПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители = Элементы.ПотребителиГВС.ТекущиеДанные;
	Если ТекДанныеПотребители = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители.IDСтроки = ТекДанные.IDСтроки;
	Если Не ЗначениеЗаполнено(ТекДанныеПотребители.ТипНормы) Тогда
		ТекДанныеПотребители.ТипНормы = ПредопределенноеЗначение("Перечисление.бестВидыПериодов.Сутки");	
	КонецЕсли;
	Если ТекДанныеПотребители.КоличествоРабочихЧасовВДень = 0 Тогда
		ТекДанныеПотребители.КоличествоРабочихЧасовВДень = 24;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормулыРасчетаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатЗакрытия.Свойство("ПредставлениеФормулы") ИЛИ Не РезультатЗакрытия.Свойство("ФормулаРасчета") Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтроки  								= ДополнительныеПараметры.КлючСтроки;
	ТекущиеДанные  								= Объект.ФормулыРасчетаУслуг.НайтиПоИдентификатору(КлючСтроки);
	ТекущиеДанные.ФормулаРасчетаПредставление 	= РезультатЗакрытия.ПредставлениеФормулы;
	ТекущиеДанные.ФормулаРасчета 				= РезультатЗакрытия.ФормулаРасчета;
	
КонецПроцедуры

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры

// энргРаботаСПоставщиками }

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер()
	
	ТекДоговор	= Объект.ТекущийДоговор;
	
	Нов_НомерДоговора				= ТекДоговор.Номер;
	Нов_СтавкаНДС					= ТекДоговор.СтавкаНДС;
	Нов_ГруппаФинансирования		= ТекДоговор.СтавкаНДС;
	Нов_ТипДоговора					= ТекДоговор.ТипДоговора;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	//РегистрыСведений.бестВладельцыОбъектовРасчета.ПолучитьВладельцевОбъектовРасчета(МВТ, Объект.Дата, Объект.Организация, Объект.Район,,Объект.ТекущийДоговор,"ВладельцыОбъектовРасчета");
	//РегистрыСведений.бестАктивностьОбъектовРасчета.ПолучитьАктивныеОбъектыРасчета(МВТ, Объект.Дата, Объект.Организация, Объект.Район,"АктивныеОбъекты", Истина);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Дата", 			Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("Договор",	 	Объект.ТекущийДоговор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктивныеОбъекты.Организация КАК Организация,
	               |	АктивныеОбъекты.Район КАК Район,
	               |	АктивныеОбъекты.Договор КАК Договор,
	               |	АктивныеОбъекты.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестОбъектыРасчета.Наименование КАК НаименованиеОбъектаРасчета,
	               |	бестОбъектыРасчета.КатегорияПомещения КАК КатегорияОбъекта,
	               |	бестОбъектыРасчета.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	               |	бестОбъектыРасчета.МКД КАК МКД,
	               |	бестОбъектыРасчета.НазначениеНП КАК НазначениеНП,
	               |	ВЫРАЗИТЬ(бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК СТРОКА(150)) КАК АдресОбъектаЗначение
	               |ПОМЕСТИТЬ ПараметрыОбъектов
	               |ИЗ
	               |	АктивныеОбъекты КАК АктивныеОбъекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	               |		ПО АктивныеОбъекты.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	               |		ПО АктивныеОбъекты.ОбъектРасчета = бестОбъектыРасчетаКонтактнаяИнформация.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АктивныеОбъекты.ОбъектРасчета,
	               |	АктивныеОбъекты.Район,
	               |	бестОбъектыРасчета.МКД,
	               |	бестОбъектыРасчета.КатегорияПомещения,
	               |	АктивныеОбъекты.Организация,
	               |	бестОбъектыРасчета.ГруппаОбъектовРасчета,
	               |	бестОбъектыРасчета.Наименование,
	               |	бестОбъектыРасчета.НазначениеНП,
	               |	АктивныеОбъекты.Договор,
	               |	ВЫРАЗИТЬ(бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК СТРОКА(150))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Период КАК Период,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Регистратор КАК Регистратор,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.НомерСтроки КАК НомерСтроки,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Активность КАК Активность,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Организация КАК Организация,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Район КАК Район,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестСобственникиОбъектовРасчетаСрезПоследних.Собственник КАК Собственник
	               |ПОМЕСТИТЬ СобственникиОбъектов
	               |ИЗ
	               |	РегистрСведений.бестСобственникиОбъектовРасчета.СрезПоследних(
	               |			&Дата,
	               |			(Организация, Район, ОбъектРасчета) В
	               |				(ВЫБРАТЬ
	               |					АктивныеОбъекты.Организация КАК Организация,
	               |					АктивныеОбъекты.Район КАК Район,
	               |					АктивныеОбъекты.ОбъектРасчета КАК ОбъектРасчета
	               |				ИЗ
	               |					АктивныеОбъекты КАК АктивныеОбъекты)) КАК бестСобственникиОбъектовРасчетаСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПараметрыОбъектов.Организация КАК Организация,
	               |	ПараметрыОбъектов.Район КАК Район,
	               |	ПараметрыОбъектов.Договор КАК Договор,
	               |	ПараметрыОбъектов.ОбъектРасчета КАК ОбъектРасчета,
	               |	ПараметрыОбъектов.НаименованиеОбъектаРасчета КАК НаименованиеОбъектаРасчета,
	               |	ПараметрыОбъектов.КатегорияОбъекта КАК КатегорияОбъекта,
	               |	ПараметрыОбъектов.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	               |	ПараметрыОбъектов.МКД КАК МКД,
	               |	ПараметрыОбъектов.НазначениеНП КАК НазначениеНП,
	               |	ПараметрыОбъектов.АдресОбъектаЗначение КАК АдресОбъектаЗначение,
	               |	СУММА(ЕСТЬNULL(бестЗначенияПлощадейНПСрезПоследних.Площадь, 0)) КАК Площадь,
	               |	ЕСТЬNULL(бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних.Участвует, ЛОЖЬ) КАК Участвует
	               |ПОМЕСТИТЬ ПараметрыСПлощадьюИРаспределениемВМКД
	               |ИЗ
	               |	ПараметрыОбъектов КАК ПараметрыОбъектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЗначенияПлощадейНП.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП)) КАК бестЗначенияПлощадейНПСрезПоследних
	               |		ПО ПараметрыОбъектов.Организация = бестЗначенияПлощадейНПСрезПоследних.Организация
	               |			И ПараметрыОбъектов.Район = бестЗначенияПлощадейНПСрезПоследних.Район
	               |			И ПараметрыОбъектов.ОбъектРасчета = бестЗначенияПлощадейНПСрезПоследних.ОбъектРасчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУчастиеОбъектовВРаспределенииРесурсовВМКД.СрезПоследних(
	               |				&Дата,
	               |				ОбъектРасчета В
	               |					(ВЫБРАТЬ
	               |						ПараметрыОбъектов.ОбъектРасчета КАК ОбъектРасчета
	               |					ИЗ
	               |						ПараметрыОбъектов КАК ПараметрыОбъектов
	               |					СГРУППИРОВАТЬ ПО
	               |						ПараметрыОбъектов.ОбъектРасчета)) КАК бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних
	               |		ПО ПараметрыОбъектов.ОбъектРасчета = бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних.ОбъектРасчета
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПараметрыОбъектов.ГруппаОбъектовРасчета,
	               |	ПараметрыОбъектов.МКД,
	               |	ПараметрыОбъектов.Район,
	               |	ПараметрыОбъектов.НазначениеНП,
	               |	ПараметрыОбъектов.АдресОбъектаЗначение,
	               |	ПараметрыОбъектов.НаименованиеОбъектаРасчета,
	               |	ПараметрыОбъектов.ОбъектРасчета,
	               |	ПараметрыОбъектов.Договор,
	               |	ПараметрыОбъектов.КатегорияОбъекта,
	               |	ПараметрыОбъектов.Организация,
	               |	ЕСТЬNULL(бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних.Участвует, ЛОЖЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестНагрузкаПоУслугамНПСрезПоследних.Услуга КАК Услуга,
	               |	СУММА(бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка) КАК Нагрузка,
	               |	бестНагрузкаПоУслугамНПСрезПоследних.ВидНагрузки КАК ВидНагрузки,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Организация КАК Организация,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Район КАК Район,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Договор КАК Договор,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.ОбъектРасчета КАК ОбъектРасчета,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.НаименованиеОбъектаРасчета КАК НаименованиеОбъектаРасчета,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.КатегорияОбъекта КАК КатегорияОбъекта,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.МКД КАК МКД,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.НазначениеНП КАК НазначениеНП,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.АдресОбъектаЗначение КАК АдресОбъектаЗначение,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Площадь КАК Площадь,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Участвует КАК Участвует,
	               |	СобственникиОбъектов.Собственник КАК Собственник
	               |ИЗ
	               |	ПараметрыСПлощадьюИРаспределениемВМКД КАК ПараметрыСПлощадьюИРаспределениемВМКД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНагрузкаПоУслугамНП.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестНагрузкаПоУслугамНПСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СобственникиОбъектов КАК СобственникиОбъектов
	               |			ПО (СобственникиОбъектов.Организация = бестНагрузкаПоУслугамНПСрезПоследних.Организация)
	               |				И (СобственникиОбъектов.Район = бестНагрузкаПоУслугамНПСрезПоследних.Район)
	               |				И (СобственникиОбъектов.ОбъектРасчета = бестНагрузкаПоУслугамНПСрезПоследних.ОбъектРасчета)
	               |		ПО ПараметрыСПлощадьюИРаспределениемВМКД.Организация = бестНагрузкаПоУслугамНПСрезПоследних.Организация
	               |			И ПараметрыСПлощадьюИРаспределениемВМКД.Район = бестНагрузкаПоУслугамНПСрезПоследних.Район
	               |			И ПараметрыСПлощадьюИРаспределениемВМКД.ОбъектРасчета = бестНагрузкаПоУслугамНПСрезПоследних.ОбъектРасчета
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестНагрузкаПоУслугамНПСрезПоследних.ВидНагрузки,
	               |	бестНагрузкаПоУслугамНПСрезПоследних.Услуга,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.ОбъектРасчета,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Район,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Договор,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Организация,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.НаименованиеОбъектаРасчета,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Участвует,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.НазначениеНП,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.КатегорияОбъекта,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.ГруппаОбъектовРасчета,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.МКД,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.АдресОбъектаЗначение,
	               |	ПараметрыСПлощадьюИРаспределениемВМКД.Площадь,
	               |	СобственникиОбъектов.Собственник
	               |ИТОГИ ПО
	               |	ОбъектРасчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктивныеОбъекты.Организация КАК Организация,
	               |	АктивныеОбъекты.Район КАК Район,
	               |	АктивныеОбъекты.Договор КАК Договор,
	               |	АктивныеОбъекты.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестПотребителиГВССрезПоследних.Тип КАК Тип,
	               |	СУММА(бестПотребителиГВССрезПоследних.Количество) КАК Количество,
	               |	СУММА(бестПотребителиГВССрезПоследних.КоличествоРабочихЧасовВДень) КАК КоличествоРабочихЧасовВДень,
	               |	бестПотребителиГВССрезПоследних.ТипНормы КАК ТипНормы
	               |ИЗ
	               |	АктивныеОбъекты КАК АктивныеОбъекты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПотребителиГВС.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестПотребителиГВССрезПоследних
	               |		ПО АктивныеОбъекты.Организация = бестПотребителиГВССрезПоследних.Организация
	               |			И АктивныеОбъекты.Район = бестПотребителиГВССрезПоследних.Район
	               |			И АктивныеОбъекты.ОбъектРасчета = бестПотребителиГВССрезПоследних.ОбъектРасчета
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АктивныеОбъекты.Район,
	               |	АктивныеОбъекты.ОбъектРасчета,
	               |	бестПотребителиГВССрезПоследних.ТипНормы,
	               |	АктивныеОбъекты.Организация,
	               |	АктивныеОбъекты.Договор,
	               |	бестПотребителиГВССрезПоследних.Тип
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.ТемпературныйГрафик КАК ТемпературныйГрафик
	               |ИЗ
	               |	РегистрСведений.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами.СрезПоследних(
	               |			&Дата,
	               |			(Организация, Район, ОбъектРасчета) В
	               |				(ВЫБРАТЬ
	               |					АктивныеОбъекты.Организация КАК Организация,
	               |					АктивныеОбъекты.Район КАК Район,
	               |					АктивныеОбъекты.ОбъектРасчета КАК ОбъектРасчета
	               |				ИЗ
	               |					АктивныеОбъекты КАК АктивныеОбъекты
	               |				СГРУППИРОВАТЬ ПО
	               |					АктивныеОбъекты.ОбъектРасчета,
	               |					АктивныеОбъекты.Район,
	               |					АктивныеОбъекты.Организация)) КАК бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.ОбъектРасчета,
	               |	бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.ТемпературныйГрафик
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 1
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Январь,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 2
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Февраль,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 3
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Март,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 4
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Апрель,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 5
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Май,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 6
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Июнь,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 7
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Июль,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 8
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Август,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 9
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Сентябрь,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 10
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Октябрь,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 11
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Ноябрь,
	               |	СУММА(ВЫБОР
	               |			КОГДА бестГарантированныеОбъемыСрезПоследних.Месяц = 12
	               |				ТОГДА бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Декабрь,
	               |	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ГОД, бестГарантированныеОбъемыСрезПоследних.Год - 1), МЕСЯЦ) КАК Год
	               |ИЗ
	               |	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И ОбъектРасчета В
	               |					(ВЫБРАТЬ
	               |						АктивныеОбъекты.ОбъектРасчета КАК ОбъектРасчета
	               |					ИЗ
	               |						АктивныеОбъекты КАК АктивныеОбъекты)) КАК бестГарантированныеОбъемыСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестГарантированныеОбъемыСрезПоследних.Услуга,
	               |	бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета,
	               |	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ГОД, бестГарантированныеОбъемыСрезПоследних.Год - 1), МЕСЯЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбъектРасчета,
	               |	Услуга,
	               |	Год УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.Организация КАК Организация,
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.Район КАК Район,
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.ОбъектыРасчета КАК ОбъектРасчета,
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.Услуга КАК Услуга,
	               |	СУММА(бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.Нагрузка) КАК Нагрузка
	               |ИЗ
	               |	РегистрСведений.бестМаксимальныеНагрузкиПоДоговору.СрезПоследних(
	               |			&Дата,
	               |			(Организация, Район, ОбъектыРасчета) В
	               |				(ВЫБРАТЬ
	               |					АктивныеОбъекты.Организация КАК Организация,
	               |					АктивныеОбъекты.Район КАК Район,
	               |					АктивныеОбъекты.ОбъектРасчета КАК ОбъектРасчета
	               |				ИЗ
	               |					АктивныеОбъекты КАК АктивныеОбъекты
	               |				СГРУППИРОВАТЬ ПО
	               |					АктивныеОбъекты.ОбъектРасчета,
	               |					АктивныеОбъекты.Район,
	               |					АктивныеОбъекты.Организация)) КАК бестМаксимальныеНагрузкиПоДоговоруСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.Организация,
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.Услуга,
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.Район,
	               |	бестМаксимальныеНагрузкиПоДоговоруСрезПоследних.ОбъектыРасчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестТарифныеКатегорииНПСрезПоследних.Период КАК Период,
	               |	бестТарифныеКатегорииНПСрезПоследних.Организация КАК Организация,
	               |	бестТарифныеКатегорииНПСрезПоследних.Район КАК Район,
	               |	бестТарифныеКатегорииНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестТарифныеКатегорииНПСрезПоследних.Услуга КАК Услуга,
	               |	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория КАК ТарифнаяКатегория
	               |ИЗ
	               |	РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	               |			&Дата,
	               |			(Организация, Район, ОбъектРасчета) В
	               |				(ВЫБРАТЬ
	               |					АктивныеОбъекты.Организация КАК Организация,
	               |					АктивныеОбъекты.Район КАК Район,
	               |					АктивныеОбъекты.ОбъектРасчета КАК ОбъектРасчета
	               |				ИЗ
	               |					АктивныеОбъекты КАК АктивныеОбъекты)) КАК бестТарифныеКатегорииНПСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестТарифныеКатегорииНПСрезПоследних.ОбъектРасчета,
	               |	бестТарифныеКатегорииНПСрезПоследних.Организация,
	               |	бестТарифныеКатегорииНПСрезПоследних.Услуга,
	               |	бестТарифныеКатегорииНПСрезПоследних.Период,
	               |	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория,
	               |	бестТарифныеКатегорииНПСрезПоследних.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестСрокиПретензионнойДеятельностиПоДоговорамСрезПоследних.Организация КАК Организация,
	               |	бестСрокиПретензионнойДеятельностиПоДоговорамСрезПоследних.Район КАК Район,
	               |	бестСрокиПретензионнойДеятельностиПоДоговорамСрезПоследних.Договор КАК Договор,
	               |	бестСрокиПретензионнойДеятельностиПоДоговорамСрезПоследних.Этап КАК Этап,
	               |	бестСрокиПретензионнойДеятельностиПоДоговорамСрезПоследних.Срок КАК Срок
	               |ИЗ
	               |	РегистрСведений.бестСрокиПретензионнойДеятельностиПоДоговорам.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И Договор = &Договор) КАК бестСрокиПретензионнойДеятельностиПоДоговорамСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Период КАК Период,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация КАК Организация,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район КАК Район,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор КАК Договор,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ТипОплаты КАК ТипОплаты,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ЧислоМесяца КАК ЧислоМесяца,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Процент КАК Процент,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты КАК СрокОплаты,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.БазаРасчета КАК БазаРасчета
	               |ИЗ
	               |	РегистрСведений.бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И Договор = &Договор) КАК бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ТипОплаты,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Период,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.БазаРасчета,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ЧислоМесяца,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Процент,
	               |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестСпособыРаспределенияПоступившейОплатыСрезПоследних.Период КАК Период,
	               |	бестСпособыРаспределенияПоступившейОплатыСрезПоследних.Организация КАК Организация,
	               |	бестСпособыРаспределенияПоступившейОплатыСрезПоследних.Район КАК Район,
	               |	бестСпособыРаспределенияПоступившейОплатыСрезПоследних.Договор КАК Договор,
	               |	бестСпособыРаспределенияПоступившейОплатыСрезПоследних.СпособРаспределенияОплаты КАК СпособРаспределенияОплаты
	               |ИЗ
	               |	РегистрСведений.бестСпособыРаспределенияПоступившейОплаты.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И Договор = &Договор) КАК бестСпособыРаспределенияПоступившейОплатыСрезПоследних";
	Результат 					= Запрос.ВыполнитьПакет();
	ВыборкаОбъекты				= Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПотребителиГВС		= Результат[5].Выгрузить();
	ВыборкаТемператГрафик		= Результат[6].Выгрузить();
	ВыборкаДоговорныеОбъемы		= Результат[7].Выгрузить();
	ВыборкаМаксимНагрузки		= Результат[8].Выгрузить();
	ВыборкаТарифнеКатегории		= Результат[9].Выгрузить();
	ВыборкаЭтапыПИД				= Результат[10].Выгрузить();
	ВыборкаСрокиОплаты			= Результат[11].Выгрузить();
	ВыборкаСпособРаспрОплаты	= Результат[12].Выгрузить();
	
	ТЧОбъекты					= Объект.ОбъектыРасчета;
	ТЧОУслугиОбъектов			= Объект.УслугиОбъектов;
	ТЧПотребителиГВС			= Объект.ПотребителиГВС;
	ТЧТемпГрафик				= Объект.ТемпературныеГрафикиОбъектов;
	ТЧДоговорныеОбъемы			= Объект.ГарантированныеОбъемы;
	ТЧМаксимНагрузки			= Объект.МаксимальныеНагрузки;
	ТЧТарифКатегории			= Объект.ТарифныеКатегорииУслуги;
	ТЧЭтапыПИД					= Объект.ЭтапыПИД;
	ТЧСрокиОплаты				= Объект.НастройкиОплаты;
	ТЧСпособРасперОплаты		= Объект.РаспределениеПоступившейОплаты;
	
	Объект.ТочкиУчета.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ШкалыУслуг.Очистить();
	ТЧОбъекты.Очистить();
	ТЧОУслугиОбъектов.Очистить();
	ТЧПотребителиГВС.Очистить();
	ТЧТемпГрафик.Очистить();
	ТЧДоговорныеОбъемы.Очистить();
	
	ТЧМаксимНагрузки.Очистить();
	ТЧТарифКатегории.Очистить();
	ТЧЭтапыПИД.Очистить();
	ТЧСрокиОплаты.Очистить();
	ТЧСпособРасперОплаты.Очистить();

	Пока ВыборкаОбъекты.Следующий() Цикл
		ТекОбъект				= ВыборкаОбъекты.ОбъектРасчета;
		НовСтрокаОбъекты		= ТЧОбъекты.Добавить();
		
		IDСтроки				= Новый УникальныйИдентификатор;
		НовСтрокаОбъекты.IDСтроки = IDСтроки;
		
		ВыборкаНагрузки			= ВыборкаОбъекты.Выбрать();
		Пока ВыборкаНагрузки.Следующий() Цикл
			// Запрет на создание пустых строк
			Если Не ЗначениеЗаполнено(ВыборкаНагрузки.Услуга) Тогда
				Продолжить;
			КонецЕсли;
			
			// Объекты расчета
			ЗаполнитьЗначенияСвойств(НовСтрокаОбъекты, ВыборкаНагрузки);
			
			//Нагрузка
			НовСтрокаУслугиОбъектов	= ТЧОУслугиОбъектов.Добавить();
			НовСтрокаУслугиОбъектов.IDСтроки = IDСтроки;
			ЗаполнитьЗначенияСвойств(НовСтрокаУслугиОбъектов, ВыборкаНагрузки);
			
			
		КонецЦикла;	
		//////////////////////////
		Если Объект.ТекущийДоговор.ТипДоговора = Перечисления.бестТипыДоговоров.УправляющаяКомпания Тогда
			ЗаполнитьТочками(НовСтрокаОбъекты.IDСтроки,НовСтрокаОбъекты.МКД,ТекОбъект);
			
			энргРаботаСПоказаниямиПриборовУчетаСервер.ОбновитьПоказанияПриборовУчетаМКД(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация, Объект.Район,НовСтрокаОбъекты.МКД,Ложь);
			
		ИначеЕсли Объект.ТекущийДоговор.ТипДоговора = Перечисления.бестТипыДоговоров.РСО Тогда
			
			ЗаполнитьТочками(НовСтрокаОбъекты.IDСтроки,,ТекОбъект);
			
			бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);			

		КонецЕсли;	
		
		энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета, "ТочкиУчета");
		//////////////////////////
		// Потребители ГВС
		ИщемПотребителяГВС		= ВыборкаПотребителиГВС.НайтиСтроки(Новый Структура("ОбъектРасчета", ТекОбъект));
		Для н = 0 по ИщемПотребителяГВС.Вграница() Цикл
			НовСтрокаПотребителиГВС	= ТЧПотребителиГВС.Добавить();	
			НовСтрокаПотребителиГВС.IDСтроки	= IDСтроки;	 
			ЗаполнитьЗначенияСвойств(НовСтрокаПотребителиГВС, ИщемПотребителяГВС[н]);
		КонецЦикла;
		
		// Температурные графики
		ИщемТемпГрафик		= ВыборкаТемператГрафик.НайтиСтроки(Новый Структура("ОбъектРасчета", ТекОбъект));
		Для н = 0 по ИщемТемпГрафик.Вграница() Цикл
			НовСтрокаТемпГрафик	= ТЧТемпГрафик.Добавить();	
			НовСтрокаТемпГрафик.IDСтроки	= IDСтроки;	 
			ЗаполнитьЗначенияСвойств(НовСтрокаТемпГрафик, ИщемТемпГрафик[н]);
		КонецЦикла;  
		
		// Договорные объемы
		ИщемДоговорныеОбъемы		= ВыборкаДоговорныеОбъемы.НайтиСтроки(Новый Структура("ОбъектРасчета", ТекОбъект));
		Для н = 0 по ИщемДоговорныеОбъемы.Вграница() Цикл
			НовСтрокаДогОбъемы	= ТЧДоговорныеОбъемы.Добавить();	
			НовСтрокаДогОбъемы.IDСтроки	= IDСтроки;	 
			ЗаполнитьЗначенияСвойств(НовСтрокаДогОбъемы, ИщемДоговорныеОбъемы[н]);
		КонецЦикла;
		
		// Максимальные нагрузки
		ИщемМаксНагрузки		= ВыборкаМаксимНагрузки.НайтиСтроки(Новый Структура("ОбъектРасчета", ТекОбъект));
		Для н = 0 по ИщемМаксНагрузки.Вграница() Цикл
			НовСтрокаМаксНагрузка	= ТЧМаксимНагрузки.Добавить();	
			НовСтрокаМаксНагрузка.IDСтроки	= IDСтроки;	 
			ЗаполнитьЗначенияСвойств(НовСтрокаМаксНагрузка, ИщемМаксНагрузки[н]);
		КонецЦикла;		
		
		// Тарифные категории
		ИщемТарифныеКатегории		= ВыборкаТарифнеКатегории.НайтиСтроки(Новый Структура("ОбъектРасчета", ТекОбъект));
		Для н = 0 по ИщемТарифныеКатегории.Вграница() Цикл
			НовСтрокаТарифнКатег	= ТЧТарифКатегории.Добавить();	
			НовСтрокаТарифнКатег.IDСтроки	= IDСтроки;	 
			ЗаполнитьЗначенияСвойств(НовСтрокаТарифнКатег, ИщемТарифныеКатегории[н]);
		КонецЦикла;	
		
	КонецЦикла;
	
	// В случе если тарифные категории не заполнились, заполняем их из точек учета
	Если Не ЗначениеЗаполнено(Объект.ТарифныеКатегорииУслуги) Тогда
		Для каждого ТекСтрока Из Объект.ТочкиУчета Цикл
			бестРаботаСТочкамиУчетаНПСервер.ОбновитьГруппыПотребителейУслуги(ЭтотОбъект, ТекСтрока.IDСтрокиВладельца);
		КонецЦикла;
	КонецЕсли;
	
	// Способы распределения оплаты
	ТЧСпособРасперОплаты.Загрузить(ВыборкаСпособРаспрОплаты);
	
	// Сроки оплаты
	ТЧСрокиОплаты.Загрузить(ВыборкаСрокиОплаты);
	
	// Этапы ПИД
	ТЧЭтапыПИД.Загрузить(ВыборкаЭтапыПИД);
	
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,"Поставщик","ПараметрыПоставщиков");
	//энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"СпособРасчетаНорматива","СпособыРасчетаНормативаСоставныхУслуг","ПараметрыСпособовРасчетаНорматива");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТочками(IDСтрокиВладельца,МКД = Неопределено, ОбъектРасчета)
	
	
	
	Если МКД = Неопределено Тогда
		Результат 							= бестРаботаСприборамиУчетаСервер.ПриборыВсехТочекУчетаПоДоговору(Объект.Дата,Объект.Организация,Объект.Район,Объект.ТекущийДоговор,ОбъектРасчета);
	Иначе
		Результат 							= энргРаботаСприборамиУчетаСервер.ПриборыВсехТочекУчетаМКД(Объект.Дата,Объект.Организация,Объект.Район,МКД);
	КонецЕсли;
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	ПоставщикПоУмолчанию	= ЭтаФорма.ПараметрыПоставщиков.ПоставщикПоУмолчанию;
	Пока Выборка.следующий() цикл		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда 			
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
			СтрокаТочкиУчета.IDСтрокиВладельца	= IDСтрокиВладельца;
			СтрокаТочкиУчета.Поставщик			= ПоставщикПоУмолчанию;
			СтрокаТочкиУчета.Расположение		= Выборка.ТочкаУчета.Расположение;
			СтрокаТочкиУчета.Головная			= Выборка.ТочкаУчета.Головная;
			СтрокаТочкиУчета.ЗаводскойНомер		= СтрокаТочкиУчета.ПриборУчета.Код;
			СтрокаТочкиУчета.ТипПрибораУчета	= СтрокаТочкиУчета.ПриборУчета.ТипПрибораУчета;
			СтрокаТочкиУчета.ВидКанальности		= СтрокаТочкиУчета.ПриборУчета.ВидКанальности;
			СтрокаТочкиУчета.НаименованиеТочки  = Выборка.ТочкаУчета.Наименование;
			
			ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(Выборка.Услуга);
			СтрокаТочкиУчета.ЭтоСоставнаяУслуга = ОписаниеУслуги.ЭтоСоставнаяУслуга;
			
			Если СтрокаТочкиУчета.ЭтоСоставнаяУслуга Тогда
				ПредставлениеПоставщика  			= "";
				ПредставлениеСпособРасчета  		= "";
				Для Каждого Строка из ОписаниеУслуги.Услуги Цикл
					СтрокаТЧ  						= ЭтаФорма.Объект.ПоставщикиСоставныхУслуг.Добавить();
					СтрокаТЧ.IDСтроки 				= СтрокаТочкиУчета.IDСтроки;
					СтрокаТЧ.ЧастьСоставнойУслуги 	= Строка;
					СтрокаТЧ.Поставщик 				= ПоставщикПоУмолчанию;
					ПредставлениеПоставщика 		= ПредставлениеПоставщика + ?(ЗначениеЗаполнено(ПредставлениеПоставщика),"/","") +  ПоставщикПоУмолчанию;
					
					СтрокаТЧСпособРасчета  							= ЭтаФорма.Объект.СпособыРасчетаНормативаСоставныхУслуг.Добавить();
					СтрокаТЧСпособРасчета.IDСтроки 					= СтрокаТочкиУчета.IDСтроки;
					СтрокаТЧСпособРасчета.ЧастьСоставнойУслуги 		= Строка;
					СтрокаТЧСпособРасчета.СпособРасчетаНорматива 	= ПолучитьСпособРасчетаНорматива(Строка,Выборка);
					ПредставлениеСпособРасчета 		= ПредставлениеСпособРасчета + ?(ЗначениеЗаполнено(ПредставлениеСпособРасчета),"/","") +  СтрокаТЧСпособРасчета.СпособРасчетаНорматива;
				КонецЦикла;
				
				ДанныеСоставныхУслуг	= ЭтаФорма.ПараметрыПоставщиков.ДанныеСоставныхУслуг;
				IDСтрока				= СтрЗаменить(СтрокаТочкиУчета.IDСтроки,Символы.НПП,"");
				ИмяПоля					= "Поставщик";
				Если ДанныеСоставныхУслуг.Получить(IDСтрока) = Неопределено Тогда
					ДанныеСоставныхУслуг.Вставить(IDСтрока,Новый Структура(ИмяПоля,ПредставлениеПоставщика));
				ИначеЕсли ДанныеСоставныхУслуг[IDСтрока][ИмяПоля] = Неопределено Тогда
					ДанныеСоставныхУслуг[IDСтрока].Вставить(ИмяПоля,ПредставлениеПоставщика);
				Иначе
					ДанныеСоставныхУслуг[IDСтрока][ИмяПоля] 	= ПредставлениеПоставщика; 
				КонецЕсли;
				
				ДанныеСоставныхУслуг	= ЭтаФорма.ПараметрыСпособовРасчетаНорматива.ДанныеСоставныхУслуг;
				IDСтрока				= СтрЗаменить(СтрокаТочкиУчета.IDСтроки,Символы.НПП,"");
				ИмяПоля					= "СпособРасчетаНорматива";
				Если ДанныеСоставныхУслуг.Получить(IDСтрока) = Неопределено Тогда
					ДанныеСоставныхУслуг.Вставить(IDСтрока,Новый Структура(ИмяПоля,ПредставлениеСпособРасчета));
				ИначеЕсли ДанныеСоставныхУслуг[IDСтрока][ИмяПоля] = Неопределено Тогда
					ДанныеСоставныхУслуг[IDСтрока].Вставить(ИмяПоля,ПредставлениеСпособРасчета);
				Иначе
					ДанныеСоставныхУслуг[IDСтрока][ИмяПоля] 	= ПредставлениеСпособРасчета; 
				КонецЕсли;

			Иначе
				СтрокаТочкиУчета.Поставщик 				= ПоставщикПоУмолчанию; 
				СтрокаТочкиУчета.СпособРасчетаНорматива = ПолучитьСпособРасчетаНорматива(Выборка.Услуга, Выборка);
			КонецЕсли;

			Если ЗначениеЗаполнено( Выборка.УзелУчета) Тогда
				СтрокаТочкиУчета.ТипУзлаУчета		= Выборка.УзелУчета.ТипУзлаУчета;
				СтрокаТочкиУчета.ВладелецУзлаУчета = Объект.Контрагент; 
				
			КонецЕсли;
			
			бестРаботаСприборамиУчетаСервер.ПолучитьбестСпособНачисленияНорматива(Объект.Организация,Объект.Район,Объект.Дата,СтрокаТочкиУчета,ОбъектРасчета);
			
			Если МКД = Неопределено Тогда
				бестРаботаСприборамиУчетаСервер.ПолучитьНачалоКонецДействияКоммерческогоУчета(Объект.Организация,Объект.Район,Объект.Дата,СтрокаТочкиУчета,,Объект.ТекущийДоговор,ОбъектРасчета);
			иначе
				бестРаботаСприборамиУчетаСервер.ПолучитьНачалоКонецДействияКоммерческогоУчета(Объект.Организация,Объект.Район,Объект.Дата,СтрокаТочкиУчета,МКД);
			КонецЕсли;
			
			
			//ЗаполнитьДанныеТочки(Выборка.ТочкаУчета);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) и НЕ ТекПрибор = Выборка.ПриборУчета Тогда 			
			
			СтрокаПриборов  					= Объект.ПриборыУзловУчета.Добавить();
			IDСтрокиШкалы						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаПриборов, Выборка);
			СтрокаПриборов.IDСтроки 			= IDСтрокиТочки;
			СтрокаПриборов.IDСтрокиШкалы 		= IDСтрокиШкалы;
			
			СтрокаПриборов.ЗаводскойНомер		= СтрокаПриборов.ПриборУчета.Код;
			СтрокаПриборов.ТипПрибораУчета		= СтрокаПриборов.ПриборУчета.ТипПрибораУчета;
			СтрокаПриборов.ВидКанальности		= СтрокаПриборов.ПриборУчета.ВидКанальности;
			
			ЗаполнитьДанныеПрибора(СтрокаПриборов,Выборка.ПриборУчета,МКД, Выборка);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда //НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиТарифнаяЗона				= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.IDСтрокиТарифнаяЗона 	= IDСтрокиТарифнаяЗона;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидПараметра 			= Выборка.ВидПараметра;			
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтрокиТочкиУчета		= IDСтрокиТочки;
			СтрокаПоказаний.IDСтроки 				= IDСтрокиТарифнаяЗона;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли; 		
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекПрибор 								= Выборка.ПриборУчета;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибора(ТекСтрока, ПриборУчета, МКД, Выборка)
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета.Код КАК ЗаводскойНомер,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета.ТипПрибораУчета КАК ТипПрибораУчета,
	|	энргДатыПоверкиПрибораУчетаСрезПоследних.ПериодРегистрации КАК ДатаВыпуска,
	|	энргДатыПоверкиПрибораУчетаСрезПоследних.ДатаПоверки КАК ДатаПоверкиСчетчика,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.НомерПломбы КАК НомерПломбы,
	|	энргНомерПломбПриборовУчетаМКДСрезПоследних.Период КАК ДатаУстановкиПломбы
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ПриборУчета = &ПриборУчета) КАК энргСостояниеПриборовУзловУчетаМКДСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДатыПоверкиПрибораУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И КлючПомещения.Строение = &МКД
	|					И ПриборУчета = &ПриборУчета) КАК энргДатыПоверкиПрибораУчетаСрезПоследних
	|		ПО энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета = энргДатыПоверкиПрибораУчетаСрезПоследних.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНомерПломбПриборовУчетаМКД.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &МКД
	|					И ПриборУчета = &ПриборУчета) КАК энргНомерПломбПриборовУчетаМКДСрезПоследних
	|		ПО энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета = энргНомерПломбПриборовУчетаМКДСрезПоследних.ПриборУчета
	|ГДЕ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)";
	
	Если НЕ ЗначениеЗаполнено(МКД) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МКД = &МКД", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КлючПомещения.Строение = &МКД", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("МКД"				, МКД);
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("Период"			, Новый Граница(Объект.Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район"			, Объект.Район);
	Запрос.УстановитьПараметр("ПриборУчета"		, ПриборУчета);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	ВыборкаТочкиУчета	= РезультатЗапроса.Выбрать();
	Пока  ВыборкаТочкиУчета.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТекСтрока, ВыборкаТочкиУчета);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МКД) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
		|ИЗ
		|	РегистрСведений.энргДопускПриборовУчетаККоммерческомуУчетуМКД.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета
		|				И ПриборУчета = &ПриборУчета
		|				И МКД = &МКД) КАК энргДопускПриборовУчетаККоммерческомуУчетуМКДСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("МКД", МКД);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПриборУчета", Выборка.ПриборУчета);
		Запрос.УстановитьПараметр("Район", Объект.Район);
		Запрос.УстановитьПараметр("ТочкаУчета", Выборка.ТочкаУчета);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекСтрока.НачалоДействияКоммерскогоУчета = ВыборкаДетальныеЗаписи.НачалоДействияКоммерскогоУчета;
			ТекСтрока.КонецПериодаКоммерскогоУчета = ВыборкаДетальныеЗаписи.КонецПериодаКоммерскогоУчета;
		КонецЦикла;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
		|ИЗ
		|	РегистрСведений.бестДопускПриборовУчетаККоммерческомуУчету.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета
		|				И ПриборУчета = &ПриборУчета
		|				И ОбъектРасчета = &ОбъектРасчета) КАК бестДопускПриборовУчетаККоммерческомуУчетуСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("ОбъектРасчета", Выборка.ОбъектРасчета);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПриборУчета", Выборка.ПриборУчета);
		Запрос.УстановитьПараметр("Район", Объект.Район);
		Запрос.УстановитьПараметр("ТочкаУчета", Выборка.ТочкаУчета);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекСтрока.НачалоДействияКоммерскогоУчета = ВыборкаДетальныеЗаписи.НачалоДействияКоммерскогоУчета;
			ТекСтрока.КонецДействияКоммерскогоУчета = ВыборкаДетальныеЗаписи.КонецПериодаКоммерскогоУчета;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
// энргРаботаСПоставщиками }

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер(); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаУслугПриИзменении(Элемент)
	
	ИмяТаблицыТочек 					= "ТочкиУчета" ;
	ТекДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыФормул 						= "ФормулыРасчетаУслуг" ;
	ТекущиеДанные 							= Элементы[ИмяТаблицыФормул].ТекущиеДанные;
	Если ИмяТаблицыФормул = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыЯнварьПриИзменении(Элемент)
	СуммаПоКварталу()
КонецПроцедуры

&НаКлиенте
Процедура СуммаПоКварталу()
	ТекСтрока 				= Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
	ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
	ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
	ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
	//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
	
	ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
	ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
	ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
	ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
	ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемпературныеГрафикиОбъектовПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители = Элементы.ТемпературныеГрафикиОбъектов.ТекущиеДанные;
	Если ТекДанныеПотребители = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныеНагрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители = Элементы.МаксимальныеНагрузки.ТекущиеДанные;
	Если ТекДанныеПотребители = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораОбъекта(Элемент, ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия, Объект.Дата), Объект.Организация, Объект.Район, Объект.Договор, СтандартнаяОбработка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбъемыИНагрузкиВРазрезеДоговораПриИзменении(Элемент)
	УправлениеВидимостью()
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуПоКварталу()
	Для каждого ТекСтрока из Объект.ГарантированныеОбъемы Цикл
		ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
		ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
		ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
		ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
		//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
		
		ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
		ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
		ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
		
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",ТекДанные.АдресОбъекта,ТекДанные.АдресОбъектаЗначение);
	
	ПараметрыФормыКонтактнойИнформации.Значение 		= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	Оповещение 											= Новый ОписаниеОповещения("ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Истина);
	Оповещение.ДополнительныеПараметры.Вставить("КлючСтроки", 		 Элементы.ОбъектыРасчета.ТекущаяСтрока);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);


КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
		
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 									= Объект.ОбъектыРасчета.НайтиПоИдентификатору(ДополнительныеПараметры.КлючСтроки);	
	
	ТекущиеДанные.АдресОбъекта 						= РезультатЗакрытия.Представление;
	ТекущиеДанные.АдресОбъектаЗначение 				= РезультатЗакрытия.Значение; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;

	ТекДанные.АдресОбъектаЗначение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекДанные.АдресОбъекта, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслугДляВыбора(IDСтрокиОбъекта)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтрокиВладельца", IDСтрокиОбъекта);
	НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	СписокУслуг = Новый СписокЗначений;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		СписокУслуг.Добавить(Стр.Услуга);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)";
	
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаКлиенте
Процедура ГарантированныеОбъемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//ТЧ1 = Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	//ТЧ2 = Элементы.ТочкиУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	//ТЧ3 = Элементы.ТочкиУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	//
	//Если ТЧ1 = Неопределено и ТЧ2 = Неопределено и ТЧ3 = Неопределено Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	//                         
	//Если Отказ Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить табличную часть 'Услуги'!");
	//КонецЕсли;
	
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТЧ1 = Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ТЧ2 = Элементы.ТочкиУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	ТЧ3 = Элементы.ТочкиУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	
	Если ТЧ1 = Неопределено и ТЧ2 = Неопределено и ТЧ3 = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить табличную часть 'Услуги'!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДоговорныхОбъемов()
	ТЧ				= Объект.ГарантированныеОбъемы;
	ТЗ				= ИтогиДоговорныхОбъемов.Выгрузить();
	ТЗ.Очистить(); 
	Для каждого стр из ТЧ Цикл
		НовСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, стр);
		НовСтрока.ЕдиницаИзмерения = стр.Услуга.ЕдиницаИзмерения;
		НовСтрока.ИтогПервыйКвартал = стр.Январь + стр.Февраль + стр.Март;
		НовСтрока.ИтогВторойКвартал = стр.Апрель + стр.Май + стр.Июнь;
		НовСтрока.ИтогТретийКвартал = стр.Июль + стр.Август + стр.Сентябрь;
		НовСтрока.ИтогГод = стр.Январь + стр.Февраль + стр.Март + стр.Апрель + стр.Май + стр.Июнь + стр.Июль + стр.Август + стр.Сентябрь 
						+ стр.Октябрь + стр.Ноябрь + стр.Декабрь;
	КонецЦикла;
	ТЗ.Свернуть("IDСтроки, ЕдиницаИзмерения", "Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь, ИтогПервыйКвартал, ИтогВторойКвартал, ИтогТретийКвартал, ИтогГод");
	ИтогиДоговорныхОбъемов.Загрузить(ТЗ);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДоговорныхОбъемовПоДоговору()
	//Выгрузка = ИтогиДоговорныхОбъемов.Выгрузить();
	//Выгрузка.Свернуть("Услуга","Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь");
	//Для каждого стр из Выгрузка Цикл
	//	стр.ИтогПервыйКвартал = стр.Январь + стр.Февраль + стр.Март;
	//	стр.ИтогВторойКвартал = стр.Апрель + стр.Май + стр.Июнь;
	//	стр.ИтогТретийКвартал = стр.Июль + стр.Август + стр.Сентябрь;
	//	       стр.ИтогГод = стр.Январь + стр.Февраль + стр.Март + стр.Апрель + стр.Май + стр.Июнь + стр.Июль + стр.Август + стр.Сентябрь 
	//					+ стр.Октябрь + стр.Ноябрь + стр.Декабрь;
	//	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь) КАК Январь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль) КАК Февраль,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март) КАК Март,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель) КАК Апрель,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май) КАК Май,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь) КАК Июнь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль) КАК Июль,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август) КАК Август,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь) КАК Сентябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь) КАК Октябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь) КАК Ноябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь) КАК Декабрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь) КАК ИтогГод,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март) КАК ИтогПервыйКвартал,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь) КАК ИтогВторойКвартал,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь) КАК ИтогТретийКвартал
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга.ЕдиницаИзмерения";
	
	Результат = Запрос.Выполнить();
	Выгрузка	= Результат.Выгрузить();

	ИтогиДоговорныхОбъемовПоДоговору.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовНагрузкаПриИзменении(Элемент)
	ТекСтрока = Элементы.УслугиОбъектов.ТекущиеДанные;
	//Если Объект.МаксимальныеНагрузки.Количество() >= 0 Тогда
		ПроверкаЗначенияОбычнойНагрузки("МаксимальныеНагрузки", "Максимальные нагрузки",ТекСтрока.Услуга, ТекСтрока.Нагрузка, ТекСтрока.IDСтроки, ТекСтрока.НомерСтроки);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныеНагрузкиНагрузкаПриИзменении(Элемент)
	ТекСтрока = Элементы.МаксимальныеНагрузки.ТекущиеДанные;
	Если Объект.УслугиОбъектов.Количество() > 0 Тогда
		ПроверкаЗначенияНагрузки("УслугиОбъектов", "Нагрузки",ТекСтрока.Услуга, ТекСтрока.Нагрузка, ТекСтрока.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗначенияНагрузки(ИмяТЧ, ИмяТЧСиноним,ТекУслуга, ТекНагрузка, ТекIDСтроки)
	Отбор 		= Новый Структура("IDСтроки, Услуга", ТекIDСтроки, ТекУслуга);
	ИщемСтроку	= Объект[ИмяТЧ].НайтиСтроки(Отбор);
	Если ИщемСтроку.Количество() > 0 Тогда
		ТекСумма= ИщемСтроку[0].Нагрузка;
	КонецЕсли;
	Если ТекСумма > ТекНагрузка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Максимальная нагрузка не может быть меньше нагрузки в ТЧ '" + ИмяТЧСиноним + "'! Необходимо скорректировать нагрузку!");
		ТекНагрузка	= ТекСумма; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗначенияОбычнойНагрузки(ИмяТЧ, ИмяТЧСиноним, ТекУслуга, ТекНагрузка, ТекIDСтроки, ТекНомерСтроки)
	Отбор 		 = Новый Структура("IDСтроки, Услуга", ТекIDСтроки, ТекУслуга);
	ИщемСтроку	 = Объект[ИмяТЧ].НайтиСтроки(Отбор);
	ТекСумма	 = Неопределено;
	Если ИщемСтроку.Количество() > 0 Тогда
		ТекСумма = ИщемСтроку[0].Нагрузка;
	КонецЕсли;
	Отбор.Вставить("ИмяТЧСиноним", ИмяТЧСиноним);
	Отбор.Вставить("ТекНагрузка", ТекНагрузка);
	Отбор.Вставить("ТекСумма", ТекСумма);
	Отбор.Вставить("ИщемСтроку", ИщемСтроку);
	Отбор.Вставить("ТекНомерСтроки", ТекНомерСтроки);
	ПроверкаИзмененияНагрузки(Отбор);
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаИзмененияНагрузки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросИзмененияНагрузки", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Изменение нагрузки изменит значение Максимальной нагрузки по данной услуге у текущего объекта. Изменить нагрузку?", РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзмененияНагрузки(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ДополнительныеПараметры.Вставить("Изменяем", Истина);
			ИзменитьМаксимальнуюНагрузку(ДополнительныеПараметры);
		Иначе
			ДополнительныеПараметры.Вставить("Изменяем", Ложь);
			ИзменитьМаксимальнуюНагрузку(ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМаксимальнуюНагрузку(ДополнительныеПараметры)
	Если ДополнительныеПараметры.Изменяем Тогда
		Если Не ДополнительныеПараметры.ТекСумма = Неопределено Тогда
			НоваяСТрока = ДополнительныеПараметры.ИщемСтроку[0];
		Иначе
			НоваяСтрока = Объект.МаксимальныеНагрузки.Добавить();
		КонецЕсли;
		
		НоваяСтрока.IDСтроки 	= ДополнительныеПараметры.IDСтроки;
		НоваяСтрока.Услуга 		= ДополнительныеПараметры.Услуга;
		НоваяСтрока.Нагрузка 	= ДополнительныеПараметры.ТекНагрузка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная нагрузка добавлена в ТЧ '" + ДополнительныеПараметры.ИмяТЧСиноним + "'! Скорректируйте значение в ТЧ '" + ДополнительныеПараметры.ИмяТЧСиноним + "', если необходимо!");	
	Иначе
		Если ДополнительныеПараметры.ИщемСтроку <> Неопределено Тогда
			ИзменяемаяСтрока = Объект.УслугиОбъектов[ДополнительныеПараметры.ТекНомерСтроки - 1];
			ИзменяемаяСтрока.Нагрузка =  ДополнительныеПараметры.ИщемСтроку[0].Нагрузка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация,Объект.Контрагент,СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеИтоговДоговорныхИтогов(Команда)
	ИтогиПоДоговору = Не ИтогиПоДоговору;
	ОбновитьЗаголовокКнопкиПереключенияИтогов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКнопкиПереключенияИтогов()
	Если ИтогиПоДоговору Тогда
		Элементы.ПереключениеИтоговДоговорныхИтогов.Заголовок = "Показать итоги по объекту";
		Элементы.ИтогиДоговорныхОбъемовПоДоговору.Видимость = Истина;
		Элементы.ИтогиДоговорныхОбъемов.Видимость = ложь;
	Иначе	
		Элементы.ПереключениеИтоговДоговорныхИтогов.Заголовок = "Показать итоги по договору";
		Элементы.ИтогиДоговорныхОбъемовПоДоговору.Видимость = Ложь;
		Элементы.ИтогиДоговорныхОбъемов.Видимость = Истина;
	КонецЕсли;	              
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда)
	ТекущиеДанные = Элементы["ТочкиУчета"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить тип узла учета!");
		Возврат;		
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	НастроитьВидимостьРеквизитовДоговора();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьРеквизитовДоговора()
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Элементы.Группа19.Видимость = Ложь;
	Иначе
		Элементы.Группа19.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСпособРасчетаНорматива(Услуга, Выборка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестСпособНачисленияНормативаНПСрезПоследних.СпособРасчетаНорматива КАК СпособРасчетаНорматива
		|ИЗ
		|	РегистрСведений.бестСпособНачисленияНормативаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета
		|				И Услуга = &Услуга
		|				И ОбъектРасчета = &ОбъектРасчета) КАК бестСпособНачисленияНормативаНПСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	Запрос.УстановитьПараметр("ТочкаУчета", Выборка.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Запрос.УстановитьПараметр("ОбъектРасчета", Выборка.ОбъектРасчета);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СпособРасчетаНорматива;
	КонецЦикла;

	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ГарантированныеОбъемыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Год = Объект.Дата;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация,Объект.Контрагент,СтандартнаяОбработка);
КонецПроцедуры


#КонецОбласти

#Область НОВАЯ_РАБОТА_С_УЗЛАМИ

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПераметрыОбновления) Экспорт 
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПераметрыОбновления.IDСтроки, ПераметрыОбновления.Результат, ПераметрыОбновления.ДанныеПУ);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()	
	Для Каждого ТекСтрока ИЗ Объект.ТочкиУчета Цикл
		ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
		ТекСтрока.ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(ТекСтрока, Объект.Потери,"ЮЛ");
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстДанныеРасположения(ТекСтрока);
		ТекСтрока.ДанныеРасположения = Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ТекСтрока.СтруктураСети);
	КонецЦикла;	
	
	Для Каждого ТекСтрока ИЗ Объект.ОбъектыРасчета Цикл
		ТекСтрока.ДополнительнаяИнформация = бестРаботаСОбъектамиНПСервер.ЗаполнитьТекстИнформацииОбъекта(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект);
		СтруктураЗаполнения.ПараметрыПередачи.ВходныеПараметры.Вставить("ВызывающаяПодсистема", "ЮЛ");
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения);
	ИначеЕсли Поле.Имя = "ТочкиУчетаТехническиеСвойстваТУ" Тогда
		ОткрытьФормуТехническихСвойствТУ();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(бестРаботаСТочкамиУчетаНПСервер.ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= бестРаботаСТочкамиУчетаНПСервер.СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#Область РаботаСТехническимиСвойствамиТУ

&НаКлиенте
Процедура ОткрытьФормуТехническихСвойствТУ()
	ТекущиеДанные		= Элементы.ТочкиУчета.ТекущиеДанные;
	КлючиДанных			= ПолучитьКлючиДанныхТехСвойств();
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ТехническиеСвойстваТУЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные, КлючиДанных", ТекущиеДанные, КлючиДанных));
	ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаТехническиеСвойстваТУ", ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


/////////////////////////////////////////////
// Получение входных данных

&НаКлиенте
Функция ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных)
	ТехническиеСвойстваТУ 	= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);	
	ЗаполнитьЗначенияСвойств(ТехническиеСвойстваТУ, ТекущиеДанные, КлючиДанных.Реквизиты);
		
	ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, ТекущиеДанные.IDСтроки);
	ТехническиеСвойстваТУ.Вставить("ВызывающаяПодсистема", "ЮЛ");
	
	Возврат Новый Структура("ВходныеПараметры", ТехническиеСвойстваТУ);
КонецФункции

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, IDСтроки)
	ИдентификаторФормы 				= ЭтаФорма.УникальныйИдентификатор;	
	ТехническиеСвойстваТУ.Потери 	= ПоместитьВоВременноеХранилище(Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки)), ИдентификаторФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючиДанныхТехСвойств()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияТехническихСвойствТУ("ЮЛ");
КонецФункции


/////////////////////////////////////////////
// Обработка возврата результата

&НаКлиенте
Процедура ТехническиеСвойстваТУЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	КлючиДанных 	= ДополнительныеПараметры.КлючиДанных;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, КлючиДанных.Реквизиты);
	ТехническиеСвойстваТУ = "";
	ЗаполнитьПотериИзРезультата(ТекущиеДанные.IDСтроки, Результат, ТехническиеСвойстваТУ);
	ТекущиеДанные.ТехническиеСвойстваТУ 		= ТехническиеСвойстваТУ;//энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстТехническихСвойств(Результат, Результат.Потери);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПотериИзРезультата(IDСтроки, Результат, ТехническиеСвойстваТУ)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери, Новый Структура("IDСтроки", IDСтроки));
	
	ПотериРезультат = ПолучитьИзВременногоХранилища(Результат.Потери);
	ПотериРезультат.Колонки.Добавить("IDСтроки");
	ПотериРезультат.ЗаполнитьЗначения(IDСтроки, "IDСтроки");
	Объект.Потери.Загрузить(ПотериРезультат); 	
	
	ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(Результат, ПотериРезультат,"ЮЛ");	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
