#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить простые услуги
//
// Параметры:
//  мУслуги	 - Массив элементов с типом СправочникСсылка.энргВидыУслуг 
// 
// Возвращаемое значение:
//  Массив - Массив элементов с типом СправочникСсылка.энргВидыУслуг
//
Функция ПолучитьПростыеУслуги(мУслуги) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, энргВидыУслуг.Ссылка) КАК Услуга
		|ИЗ
		|	Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО энргВидыУслуг.Ссылка = энргВидыУслугСоставляющиеУслуг.Ссылка
		|ГДЕ
		|	энргВидыУслуг.Ссылка В (&мУслуги)";
	
	Запрос.УстановитьПараметр("мУслуги", мУслуги);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга");
	
КонецФункции  

#КонецОбласти

#КонецЕсли