#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьБППоДоговору(Организация, Район, Договор, ОбъектБП = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЗаключениеДоговора.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.бестЗаключениеДоговора КАК бестЗаключениеДоговора
	|ГДЕ
	|	бестЗаключениеДоговора.Договор = &Договор
	|	И НЕ бестЗаключениеДоговора.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		НовыйБП	= СоздатьБизнесПроцесс();
		НовыйБП.Дата						= ТекущаяДата();
		НовыйБП.ОбъектБП					= ОбъектБП;
		НовыйБП.Договор						= Договор;
		НовыйБП.Организация					= Организация;
		НовыйБП.Район						= Район;
		НовыйБП.Записать();
		НовыйБП.Старт(ТочкиМаршрута.Старт);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запущен бизнес-процесс по заключению договора/ДС.");
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Бизнес-процесс по заключению договора/ДС уже был запущен.");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли