
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НаправленияИспользованияТУ.Параметры.УстановитьЗначениеПараметра("Организация",   Параметры.Организация);
	НаправленияИспользованияТУ.Параметры.УстановитьЗначениеПараметра("Район", 		  Параметры.Район);
	НаправленияИспользованияТУ.Параметры.УстановитьЗначениеПараметра("КлючПомещения", Параметры.КлючПомещения);
	НаправленияИспользованияТУ.Параметры.УстановитьЗначениеПараметра("ТочкаУчета",	  Параметры.ТочкаУчета);
КонецПроцедуры
