#Область ОбработчикиСобытий


&НаСервере
Процедура ПроверитьСинтаксисКода()
	
	СтруктураРезультат = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьРезультатИсполненияМакроса(Запись);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураРезультат.ТекстОшибки);

КонецПроцедуры

Процедура СинтаксическийКонтроль(Команда)

	ПроверитьСинтаксисКода();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти
