#Область СлужебныйПрограммныйИнтерфейс

#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(ДокументОснование, ЗависимыеРеквизиты, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ИмяМетода = "Документы.энргПлатежноеПоручениеВходящие.УстановитьЗависимыеРеквизитыОтДокументаОснования";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Смена зависимых реквизитов оплат'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование, 
		ЗависимыеРеквизиты);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПроведениеОплат

Функция ЗапуститьФоновоеЗаданиеПроведение(ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяЗадания = "Проведение документов оплат по основанию: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Представление");
	ИмяМетода = "Документы.энргПлатежноеПоручениеВходящие.ПровестиДокументыПоДокументуОснованию";
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр(СтрШаблон("ru = '%1'", ИмяЗадания));
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти 

#Область ФоновоеВыполнениеЗадачиОтменаПроведенияОплат

Функция ЗапуститьФоновоеЗаданиеОтменаПроведения(ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяЗадания = "Отмена проведения документов оплат по основанию: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Представление");
	ИмяМетода = "Документы.энргПлатежноеПоручениеВходящие.ОтменитьПроведениеДокументовПоДокументуОснованию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр(СтрШаблон("ru = '%1'", ИмяЗадания));
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПометкаНаУдаление

Функция ЗапуститьФоновоеЗаданиеПометкаНаУдаление(ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИмяЗадания = "Пометка на удаление документов оплат по основанию: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Представление");
	ИмяМетода = "Документы.энргПлатежноеПоручениеВходящие.ПометкаНаУдалениеДокументовПоДокументуОснованию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр(СтрШаблон("ru = '%1'", ИмяЗадания));
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиУстановкаПометкиУдаленияПоказаний

Функция ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаления(ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ИмяМетода = "Документы.энргПлатежноеПоручениеВходящие.УстановитьПометкуУдаленияПоДокументуОснованию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Установка пометки удаления документов оплат'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		ДокументОснование);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти


#Область РаботаСДатойДокумента

Функция ПолучитьДатуОтСвязанныхДокументов(ДокументОснование, ТекущаяДатаДокумента) Экспорт 
	
	Возврат Документы.энргПлатежноеПоручениеВходящие.ПолучитьДатуОтСвязанныхДокументов(ДокументОснование, ТекущаяДатаДокумента);
	
КонецФункции

#КонецОбласти

#Область ПроверкаСвязанныхРеквизитов

Функция НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты) Экспорт 
	
	Возврат Документы.энргПлатежноеПоручениеВходящие.НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты);
	
КонецФункции 

#КонецОбласти  

#Область ОтображениеСвязанныхДокументов

Функция ЕстьСозданныеОплатыОтДокументаОснования(ДокументОснование) Экспорт
	
	Возврат Документы.энргПлатежноеПоручениеВходящие.ЕстьСозданныеОплатыОтДокументаОснования(ДокументОснование);
	
КонецФункции

Функция ЕстьНЕПроведенныеОплатыОтДокументаОснования(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|ГДЕ
	|	НЕ энргПлатежноеПоручениеВходящие.Проведен
	|	И НЕ энргПлатежноеПоручениеВходящие.ПометкаУдаления
	|	И энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Результат = РезультатЗапроса.Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция СуммаОплатПоСвязаннымДокументам(ДокументОснование) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящие.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПроведенныеПлетжныеПоручения
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|ГДЕ
	|	энргПлатежноеПоручениеВходящие.ДокументОснование = &ДокументОснование
	|	И энргПлатежноеПоручениеВходящие.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты) КАК СуммаОплат
	|ИЗ
	|	ПроведенныеПлетжныеПоручения КАК ПроведенныеПлетжныеПоручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|		ПО ПроведенныеПлетжныеПоручения.Ссылка = энргПлатежноеПоручениеВходящиеОплата.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если НЕ Выборка.СуммаОплат = Null Тогда 
			Результат = Выборка.СуммаОплат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	//Результат = 0;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СУММА(энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты) КАК СуммаОплаты
	//	|ИЗ
	//	|	Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	//	|ГДЕ
	//	|	энргПлатежноеПоручениеВходящиеОплата.Ссылка.ДокументОснование = &ДокументОснование
	//	|	И энргПлатежноеПоручениеВходящиеОплата.Ссылка.Проведен";
	//
	//Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат Результат;
	//КонецЕсли;    	
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Выборка.Следующий();
	//
	//Результат = Выборка.СуммаОплаты;
	//Возврат Результат; 
	
КонецФункции

#КонецОбласти


#Область РазборОчередиСозданияДокументов

Процедура ЗапуститьФормированиеДокументов(ДокументОснование, КоличествоПотоков, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ДанныеПотоков = ДополнительныеПараметры.ДанныеПотоков;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗагрузкаОплат.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	РегистрСведений.энргЗагрузкаОплат КАК энргЗагрузкаОплат
		|ГДЕ
		|	энргЗагрузкаОплат.ДокументОснование = &ДокументОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбщееКоличество = Выборка.Количество();		
	Если ОбщееКоличество <= КоличествоПотоков Тогда 
		Порция = ОбщееКоличество;
	Иначе 
		Порция = Цел(ОбщееКоличество / КоличествоПотоков);
		Если (ОбщееКоличество % КоличествоПотоков) > 0 Тогда			
			Порция = Порция + 1;
		КонецЕсли;
	КонецЕсли;	
	
	Итерация = 0;
	ИдентификаторыПотока = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		Если Итерация = Порция Тогда
			
			ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, ИдентификаторыПотока, ДополнительныеПараметры);
			ДанныеПотоков.Добавить(ДлительнаяОперация);
			
			ИдентификаторыПотока = Новый Массив;
			Итерация = 0;
			
		КонецЕсли;
		
		ИдентификаторыПотока.Добавить(Выборка.ИдентификаторСтроки);
		
		Итерация = Итерация + 1;
	КонецЦикла; 
	
	Если ИдентификаторыПотока.Количество() > 0 Тогда 
		ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, ИдентификаторыПотока, ДополнительныеПараметры);
		ДанныеПотоков.Добавить(ДлительнаяОперация); 
	КонецЕсли;
	
	Если ДанныеПотоков.Количество() = 0 Тогда		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Все строки с оплатой обработаны'"));		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗапуститьФормированиеДокументовПоИдентификаторам(ДокументОснование, Идентификаторы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Контекст = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Контекст", Неопределено);
	РежимЗаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "РежимЗаписиДокумента", РежимЗаписиДокумента.Проведение);
	ИмяСобытия = "Создание оплат при загрузке";
	УровеньЖурнала = УровеньЖурналаРегистрации.Примечание;
	Мета = Метаданные.Документы.энргЗагрузкаДанныхИзВнешнихИсточников;
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия, 
		УровеньЖурнала,
		Мета,
		ДокументОснование,
		"Начало");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗагрузкаОплат.ДокументОснование КАК ДокументОснование,
		|	энргЗагрузкаОплат.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	энргЗагрузкаОплат.Абонент КАК Абонент,
		|	энргЗагрузкаОплат.Услуга КАК Услуга,
		|	энргЗагрузкаОплат.ПериодОплаты КАК ПериодОплаты,
		|	энргЗагрузкаОплат.СуммаОплаты КАК СуммаОплаты,
		|	энргЗагрузкаОплат.ФИОПлательщика КАК ФИОПлательщика,
		|	энргЗагрузкаОплат.НазначениеПлатежа КАК НазначениеПлатежа,
		|	энргЗагрузкаОплат.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
		|	энргЗагрузкаОплат.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
		|	энргЗагрузкаОплат.Поставщик КАК Поставщик,
		|	энргЗагрузкаОплат.Примечание КАК Примечание,
		|	энргЗагрузкаОплат.КлючПомещения КАК КлючПомещения,
		|	энргЗагрузкаОплат.IDСтроки КАК IDСтроки,
		|	энргЗагрузкаОплат.СуммаОстаток КАК СуммаОстаток,
		|	энргЗагрузкаОплат.Авизо КАК Авизо,
		|	энргЗагрузкаОплат.СуммаВозвратаПотребителю КАК СуммаВозвратаПотребителю,
		|	энргЗагрузкаОплат.ДатаДокумента КАК ДатаДокумента,
		|	энргЗагрузкаОплат.ПериодНачисления КАК ПериодНачисления,
		|	энргЗагрузкаОплат.Организация КАК Организация,
		|	энргЗагрузкаОплат.Район КАК Район,
		|	энргЗагрузкаОплат.СуммаОплаты КАК СуммаПоДокументу
		|ИЗ
		|	РегистрСведений.энргЗагрузкаОплат КАК энргЗагрузкаОплат
		|ГДЕ
		|	энргЗагрузкаОплат.ДокументОснование = &ДокументОснование
		|	И энргЗагрузкаОплат.ИдентификаторСтроки В(&Идентификаторы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Абонент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗагрузкаОплатЗадолженность.ДокументОснование КАК ДокументОснование,
		|	энргЗагрузкаОплатЗадолженность.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	энргЗагрузкаОплатЗадолженность.Разделитель КАК Разделитель,
		|	энргЗагрузкаОплатЗадолженность.Услуга КАК Услуга,
		|	энргЗагрузкаОплатЗадолженность.СуммаОплаты КАК СуммаОплаты,
		|	энргЗагрузкаОплатЗадолженность.Поставщик КАК Поставщик,
		|	энргЗагрузкаОплатЗадолженность.IDСтроки КАК IDСтроки,
		|	энргЗагрузкаОплатЗадолженность.ВидЗадолженности КАК ВидЗадолженности,
		|	энргЗагрузкаОплатЗадолженность.ПериодНачисления КАК ПериодНачисления,
		|	энргЗагрузкаОплатЗадолженность.ПредставлениеПериодаОплаты КАК ПредставлениеПериодаОплаты,
		|	энргЗагрузкаОплатЗадолженность.Задолженность КАК Задолженность
		|ИЗ
		|	РегистрСведений.энргЗагрузкаОплатЗадолженность КАК энргЗагрузкаОплатЗадолженность
		|ГДЕ
		|	энргЗагрузкаОплатЗадолженность.ДокументОснование = &ДокументОснование
		|	И энргЗагрузкаОплатЗадолженность.ИдентификаторСтроки В(&Идентификаторы)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ОтборЗадолженности = Новый Структура("ИдентификаторСтроки", Неопределено);
	ТаблицаЗадолженности = РезультатЗапроса[1].Выгрузить();
	ЕстьОплатаЗадолженности = ТаблицаЗадолженности.Количество() > 0;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыЗаписи.Вставить("МенеджерОплат", РегистрыСведений.энргЗагрузкаОплат);
	ПараметрыЗаписи.Вставить("МенеджерЗадолженность", РегистрыСведений.энргЗагрузкаОплатЗадолженность);
	ПараметрыЗаписи.Вставить("ИдентификаторСтроки", Неопределено);
	ПараметрыЗаписи.Вставить("РежимЗаписиДокумента", РежимЗаписи);
	ПараметрыЗаписи.Вставить("СсылкаНового", Неопределено);
	ПараметрыЗаписи.Вставить("ДатаРеестра", Контекст.ДатаРеестра);	
	ПараметрыЗаписи.Вставить("СуммаОплаты", 0);
	
	МенеджерДокумента = Документы.энргПлатежноеПоручениеВходящие;
	ДокументОбъект 		= Неопределено;
	Примечание 			= "Создан автоматически";
	
	РеквизитыШапки = ПрочитатьШапкуДокумента(ДокументОснование);
	ИсточникПоступления = ПредопределенноеЗначение("Справочник.энргИсточникиПоступления.Касса");
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, "ИсточникПоступления") Тогда
		ИсточникПоступления = ДокументОснование.ИсточникПоступления;	
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Если КолвоСообщений = 0 Тогда 
		КолвоСообщений = 1;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл 	 			
		
		ДокументОбъект = МенеджерДокумента.СоздатьДокумент();
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПроведениеПлатежногоРазрешено", Истина);
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
		ПараметрыЗаписи.СсылкаНового = МенеджерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ДокументОбъект.УстановитьСсылкуНового(ПараметрыЗаписи.СсылкаНового);
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыШапки);		
		ДокументОбъект.Дата 				= Выборка.ДатаДокумента;
		ДокументОбъект.ИсточникПоступления 	= ИсточникПоступления;
		ДокументОбъект.ДокументОснование 	= ДокументОснование;
		ДокументОбъект.Примечание 			= Примечание;
		ДокументОбъект.СуммаПоДокументу		= Выборка.СуммаПоДокументу;
		
		// ТЧ Оплата
		СтрокаТочкиУчета = ДокументОбъект.Оплата.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
		ПараметрыЗаписи.СуммаОплаты		= Выборка.СуммаОплаты;
		
		// ТЧ Задолженность
		Если ЕстьОплатаЗадолженности Тогда 
			
			ОтборЗадолженности.ИдентификаторСтроки = Выборка.ИдентификаторСтроки;
			СтрокиЗадолженности = ТаблицаЗадолженности.НайтиСтроки(ОтборЗадолженности);
			
			Для Каждого СтрокаЗадолженности из СтрокиЗадолженности Цикл 				
				НоваяСтрокаЗадолженности = ДокументОбъект.Задолженность.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЗадолженности, СтрокаЗадолженности); 				
			КонецЦикла;
			
		КонецЕсли;		
		
		ПараметрыЗаписи.ИдентификаторСтроки = Выборка.ИдентификаторСтроки;
		ЗаписатьДокументОплаты(ПараметрыЗаписи, ДокументОбъект);
		
		КоличествоИтераций = КоличествоИтераций + 1;
		Счетчик = Счетчик + 1;
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент);
			КоличествоИтераций = 0;
		КонецЕсли;
		
	КонецЦикла; 		
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия, 
		УровеньЖурнала,
		Мета,
		ДокументОснование,
		"Завершение");
	
КонецПроцедуры

Функция ПрочитатьШапкуДокумента(ДокументОснование)
	
	ЗапрашиваемыеРеквизиты = Новый Массив;
	
	ПоляШапки = "Организация,Район,АбонентскийОтдел,ПериодНачисления,ФайлДляЧтения";
	РеквизитыЗаполнения = СтрРазделить(ПоляШапки, ",", Ложь);
	Для Каждого РеквизитЗаполнения из РеквизитыЗаполнения Цикл 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, РеквизитЗаполнения) Тогда
			ЗапрашиваемыеРеквизиты.Добавить(РеквизитЗаполнения);	
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, СтрСоединить(ЗапрашиваемыеРеквизиты, ","));
	Возврат Результат;
	
КонецФункции


Процедура ЗаписатьДокументОплаты(ПараметрыЗаписи, ДокументОбъект)
	
	НаборыЗаписей = Новый Массив;
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(ПараметрыЗаписи.МенеджерОплат);
	НаборЗаписей.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборЗаписей.Отбор.ИдентификаторСтроки.Установить(ПараметрыЗаписи.ИдентификаторСтроки);	
	НаборыЗаписей.Добавить(НаборЗаписей);
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(ПараметрыЗаписи.МенеджерЗадолженность);
	НаборЗаписей.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборЗаписей.Отбор.ИдентификаторСтроки.Установить(ПараметрыЗаписи.ИдентификаторСтроки);	
	НаборыЗаписей.Добавить(НаборЗаписей);
	
	ДобавитьНаборыЗаписейПереопределяемый(ПараметрыЗаписи, НаборыЗаписей, ДокументОбъект);
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект.Записать(ПараметрыЗаписи.РежимЗаписиДокумента); 
		Для Каждого НаборЗаписей из НаборыЗаписей Цикл 
			НаборЗаписей.Записать();	
		КонецЦикла;
				
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию(); 
		
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
			"Создание оплат при загрузке", 
			УровеньЖурналаРегистрации.Ошибка,,,
			"Идентификатор строки: " + ПараметрыЗаписи.ИдентификаторСтроки + " причина: " + ПодробноеПредставлениеОшибки(Инфо));	
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьНаборыЗаписейПереопределяемый(ПараметрыЗаписи, НаборыЗаписей, ДокументОбъект)
	// переопределен в расширении
КонецПроцедуры


Функция ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, Идентификаторы, ДополнительныеПараметры)

	Шаблон = "ru = '%1'";
	НаимДок = "Создание оплат. Основание: " + ДокументОснование;
	ИмяФункции = "энргМассовыйВводОплат.ЗапуститьФормированиеДокументовПоИдентификаторам";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр(СтрШаблон(Шаблон, НаимДок));
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяФункции,
		ДокументОснование,
		Идентификаторы,
		ДополнительныеПараметры);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#КонецОбласти