#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацияСПриборомУчетаМКД(ЭтотОбъект);
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		ИспользоватьШкалыПриборовУчета 	= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		
		ЗаполнитьТекстовыеПоля();
		ПоказатьУзлы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда

		ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	иначе
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	КонецЕсли; 
	
	ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета 	= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");

	ЗаполнитьТекстовыеПоля();
	ПоказатьУзлы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ПередЗаписьюНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
	
	
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект, Истина);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект, Истина); 	
		
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаУзловПоПараметрам(ТекущийОбъект,"ПриборыУзловУчета",Отказ);		
		
		НовыеУзлыУчета 						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;				
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			
			// Теперь это для узлов --
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеУзлыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;
			// --Теперь это для узлов					
			
		КонецЦикла;
		
		Для Каждого СтрокаПриборовУчета Из ТекущийОбъект.ПриборыУзловУчета Цикл
			
			Если Не ПустаяСтрока(СтрокаПриборовУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаПриборовУчета.ПриборУчета) Тогда
				СтрокаПриборовУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаПриборовУчета.НомерСтроки);
			КонецЕсли;			
			
		КонецЦикла;      	
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеУзлыУчета", 	НовыеУзлыУчета);
		
		//НовыеПриборыУчета 					= Новый Массив;
		//
		//Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
		//	Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
		//		СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;			
		//КонецЦикла;
		//
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		
		Для каждого СтрТочкиУчета из ТекущийОбъект.ТочкиУчета Цикл 
			Если Не ЗначениеЗаполнено(СтрТочкиУчета.ТочкаУчета) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните табличную часть");
				Отказ=Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		ПриЗаписиНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
		энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
		энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда	
		ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	иначе
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
		энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	КонецЕсли;
	
	ЗаполнитьТекстовыеПоля();
	ПоказатьУзлы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

//УЗЛЫ 

&НаСервере
Процедура ПередЗаписьюНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СоответствиеСтрок 					= Новый Соответствие;
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
					
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 				
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
		
		НовыеПриборыУчета 					= Новый Массив;
		НовыеИзмерители 					= Новый Массив;
		
		СоответвиеПрибора 					= Новый Соответствие;
		Сч 									= 0;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			СтрокаОбъекта 	= Объект.ТочкиУчета[Сч];
			
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответвиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
			КонецЕсли;
			
			Сч = Сч + 1;
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				ПриборУчетаЗначение = СоответвиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;				
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервереУзлы(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда		
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
		
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

//УЗЛЫ

#КонецОбласти

#Область РаботаСТочкамиУчета

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл	
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);		
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПриборамиУчета 

&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета()
	Возврат энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамПрибораУчета()
	Возврат энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
КонецФункции


&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();
	//"
	//|Код,ТипПрибораУчета,ВидКанальности,ТипУзлаУчета,РегистрируетОбъем,
	//|КодАСКУЭ,СобственникАСКУЭ,СобственникСИ,РасположениеИзмерителя,СистемаУчетаЭлектроэнергии";
	СоотвествиеРеквизитовСвойств 	=  СоотвествиеРеквизитовСвойствамПрибораУчета();
	//Новый Структура("ЗаводскойНомер, ТипПрибораУчета, ВидКанальности, РасположениеИзмерителя", "Код", "ТипПрибораУчета", "ВидКанальности", "РасположениеИзмерителя");
		
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,"Объект.ТочкиУчета",СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);
	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ПриборыУзловУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ПриборыУзловУчета,"Объект.ПриборыУзловУчета",СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);

	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, "Объект.Измерители", СвойстваПриборовУчета, ПолучаемыеСвойстваПриборовУчета, СоотвествиеРеквизитовСвойств);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,ПутьКРеквизитуКоллекции ,СвойстваПриборовУчета, ЗаполняемыеСвойства, СоотвествиеРеквизитовСвойств) 
		
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СобытияЭлеметовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	энргРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("энргОперацияСПриборомУчетаМКД",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район 			= ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбщиеСобытияТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	
	//ТекущиеДанные 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	ТекущиеДанные 				= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ТочкаУчета) Тогда
		ТекущиеДанные.Услуга  	= энргРаботаСТочкамиУчетаСервер.УслугаТочкиУчетаМКД(Объект.Организация,Объект.Район,Объект.МКД,ТекущиеДанные.ТочкаУчета,Объект.Дата);
		
		ДанныеУзлаУчета 		= ВернутьУзелУчета(ТекущиеДанные.ТочкаУчета);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеУзлаУчета);
	Иначе
		ТекущиеДанные.Услуга 		= ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка");
		ТекущиеДанные.ПриборУчета 	= ПредопределенноеЗначение("Справочник.энргПриборыУчетаАбонента.ПустаяСсылка");		
		ТекущиеДанные.ТипУзлаУчета 	= ПредопределенноеЗначение("Справочник.энргТипыПриборовУчета.ПустаяСсылка");		
		ТекущиеДанные.НазначениеПУ 	= ПредопределенноеЗначение("Перечисление.энргНазначениеПУ.ПустаяСсылка");		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	
	Отказ = Истина; 
	
	ДопПараметры = новый Структура;
	
	ДопПараметры.Вставить("IDСтроки",ТекущиеДанные.IDСтроки);
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ДополнительныеПараметры.IDСтроки,Объект);
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		//ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		
		ТекущиеДанные.СредстваИзмерения 		= "Не заполнены";
	КонецЕсли;
КонецПроцедуры

#Конецобласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РАБОТА_С_УЗЛАМИ

#Область ДОБАВЛЕНИЕ_ПУ_К_УЗЛАМ

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ВернутьУзелУчета(ТочкаУчета)  	
	
	Ответ = Новый Структура("ПриборУчета, ТипУзлаУчета, НазначениеПУ",Справочники.энргПриборыУчетаАбонента.ПустаяСсылка(),Справочники.энргТипыПриборовУчета.ПустаяСсылка(), Перечисления.энргНазначениеПУ.ПустаяСсылка());
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	Запрос.УстановитьПараметр("Район",			Объект.Район);
	Запрос.УстановитьПараметр("МКД",			Объект.МКД);	
	Запрос.УстановитьПараметр("ТочкаУчета",		ТочкаУчета);
	Запрос.УстановитьПараметр("Период",			?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка) КАК ПриборУчета,
		|	энргПриборыТочекМКДСрезПоследних.ПриборУчета КАК УдалитьПриборУчета,
		|	энргПриборыТочекМКДСрезПоследних.ПриборУчета.ТипУзлаУчета КАК ТипУзлаУчета,
		|	ВЫБОР
		|		КОГДА НЕ энргПриборыМОП.ПриборУчета ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргНазначениеПУ.МОП)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргНазначениеПУ.ОДПУ)
		|	КОНЕЦ КАК НазначениеПУ
		|ИЗ
		|	РегистрСведений.энргПриборыТочекМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД
		|				И ТочкаУчета = &ТочкаУчета) КАК энргПриборыТочекМКДСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПриборыМОП КАК энргПриборыМОП
		|		ПО энргПриборыТочекМКДСрезПоследних.Организация = энргПриборыМОП.Организация
		|			И энргПриборыТочекМКДСрезПоследних.Район = энргПриборыМОП.Район
		|			И энргПриборыТочекМКДСрезПоследних.МКД = энргПриборыМОП.МКД
		|			И энргПриборыТочекМКДСрезПоследних.ТочкаУчета = энргПриборыМОП.ТочкаУчета
		|			И энргПриборыТочекМКДСрезПоследних.ПриборУчета = энргПриборыМОП.ПриборУчета";
	
	РезультатЗапроса 	= Запрос.Выполнить(); 	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ,Выборка); 		
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

#КонецОбласти


#Область РаботаСУзлами 

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект));
	КонецЕсли; 	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПераметрыОбновления) Экспорт 
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПераметрыОбновления.IDСтроки, ПераметрыОбновления.Результат, ПераметрыОбновления.ДанныеПУ);
	//энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект, Объект);
	ПоказатьУзлы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()	
	
	Для Каждого ТекСтрока ИЗ Объект.ТочкиУчета Цикл
		ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
	КонецЦикла;	
	
КонецПроцедуры

// В дальнейшем удалится 
&НаСервере
Процедура ПоказатьУзлы()
	
	Если НЕ энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда
		Возврат
	КонецЕсли;
	
	ПрефиксТочекУчета = "";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаУслуги", "Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаДобавитьПриборыУчета", "Видимость", Ложь);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаЕстьШкалыЕстьТарифныеЗоны", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаНетШкалЕстьТарифныеЗоны", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаЕстьШкалыНетТарифныхЗон", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаНетШкалНетТарифныхЗон", "Видимость", Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент, Новый Структура("ТочкиСПриборами", Ложь));
КонецПроцедуры

#КонецОбласти
