#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ИнтерфейсВзаимодействияСБазойДанных 

// Заполняет набор документов для проведения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НаборДокументовДляПроведения(Схема,Параметры,ТаблицаДляПомещения  = "") Экспорт 
	перем Пакет;
	
	ТаблицаПоследовательности(Схема,Параметры,"ДанныеПоследовательности");
	
	ГраницаНарушенияПоследовательности(Схема,Параметры,"ГраницаНарушенияПоследовательности");
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстНаборДокументовДляПроведения());
	Пакет.ТаблицаДляПомещения 		= "ДокументыДляПроведенияПервичныйНабор";	
			
	Пакет 							= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстНаборДокументовДляПроведенияСвязанныеПомещения());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;	
		
КонецПроцедуры

// Заполняет набор документов для проведения по фактическому периоду.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НаборДокументовДляПроведенияПоФактическомуПериоду(Схема,Параметры,ТаблицаПериодов,ТаблицаДляПомещения  = "") Экспорт 
	перем Пакет;
	
	ТаблицаПоследовательностиПомещенияСРазделеннымиЛС(Схема,Параметры,"ДокументыДляПроведенияРазделенныеЛСПервичныйНабор");
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстНаборДокументовДляПроведенияПерерасчетПоПериодуРегистрации());
	Пакет.ТаблицаДляПомещения 		= "ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации";
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстНаборДокументовДляПроведенияПерерасчетПоДатаРегистратора());
	Пакет.ТаблицаДляПомещения 		= "ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации";
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстНаборДокументовДляПроведенияПерерасчетОбъединение());
	Пакет.ТаблицаДляПомещения 		= "ДокументыДляПроведенияПервичныйНабор";

	Пакет 							= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаборДокументовСвязанныеПомещенияДляПроведенияПоФактическомуПериоду());
	Пакет.ТаблицаДляПомещения 		= "ДокументыДляПроведенияПервичныйНаборСвязанныеПомещения";
			
	Пакет 							= Схема.ПакетЗапросов.Добавить();	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаборДокументовДляПроведенияПоФактическомуПериоду());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;	

	
КонецПроцедуры

#КонецОбласти

// Устанавливает состояние последовательности.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  ЧастныйСектор		-	Булево.
//  Строение			-	СправочникСсылка.энргСтроения.
//  Помещение			-	СправочникСсылка.энргПомещения.
//
Процедура УстановитьСостояниеПоследовательности(Организация,ПериодНачисления,Район,ЧастныйСектор = Неопределено,Строение = Неопределено,Помещение = Неопределено) Экспорт 
	
	ПроведенВПоследовательности 		= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	Набор  								= СоздатьНаборЗаписей();
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Если НЕ ЧастныйСектор = Неопределено Тогда
		Набор.Отбор.ЧастныйСектор.установить(ЧастныйСектор);
	КонецЕсли;
	
	Если НЕ Строение = Неопределено Тогда
		Набор.Отбор.Строение.установить(Строение);
	КонецЕсли;
	
	Если НЕ Помещение = Неопределено Тогда
		Набор.Отбор.Помещение.установить(Помещение);
	КонецЕсли; 	
	
	СтрокиУдалить  						= Новый Массив;
	
	Набор.Прочитать(); 	
	для Каждого СтрокаНабора из Набор цикл
		Если СтрокаНабора.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности Тогда
			СтрокиУдалить.Добавить(СтрокаНабора);
			Продолжить;
		КонецЕсли;		
		СтрокаНабора.СостояниеПроведения = ПроведенВПоследовательности;
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		Набор.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;	
	
	Набор.Записать();				
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ТаблицаПоследовательности(Схема,Параметры,ТаблицаДляПомещения) 
	
	Если Схема = Неопределено Тогда
		Схема  					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстДанныеПоследовательностиПервичныйНабор());
	Пакет.ТаблицаДляПомещения 	= "ДанныеПоследовательностиПервичныйНабор";
	ДоступныеПоляОтбора 		= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"ТаблицаПоследовательности",Параметры, ДоступныеПоляОтбора);
	
	Пакет 					= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(ТекстДанныеПоследовательностиСвязанныеПомещения());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;

КонецПроцедуры

Процедура МинимальныйПериодРегистрацииНарушенияПоследовательности(Схема,Параметры,ТаблицаДляПомещения)
		
	Если Схема = Неопределено Тогда
		Схема  					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
				
	Пакет.УстановитьТекстЗапроса(ТекстМинимальныйПериодРегистрацииНарушенияПоследовательности());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
					
КонецПроцедуры

Процедура МинимальнаяДатаРегистрацииНарушенияПоследовательности(Схема,Параметры,ТаблицаДляПомещения)
	перем Пакет;
	
	МинимальныйПериодРегистрацииНарушенияПоследовательности(Схема,Параметры, "МинПериодРегистрации");
	
	Если Схема = Неопределено Тогда
		Схема  					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстМинимальнаяДатаРегистрацииНарушенияПоследовательности());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения ;
		
КонецПроцедуры

Процедура ГраницаНарушенияПоследовательности(Схема,Параметры,ТаблицаДляПомещения)
	перем Пакет;
	
	МинимальнаяДатаРегистрацииНарушенияПоследовательности(Схема,Параметры, "МинДатаРегистратораРегистрации");
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстГраницаНарушенияПоследовательности());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
			
КонецПроцедуры

Процедура ТаблицаПомещенияСРазделеннымиЛС(Схема,Параметры,ТаблицаДляПомещения) 
	
	Если Схема = Неопределено Тогда
		Схема  					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстПомещенияСРазделеннымиЛС());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
	//ДоступныеПоляОтбора 		= "Строение";
	//энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"ПомещенияСРазделеннымиЛС",Параметры, ДоступныеПоляОтбора);
	
КонецПроцедуры

Процедура ТаблицаПоследовательностиПомещенияСРазделеннымиЛС(Схема,Параметры,ТаблицаДляПомещения) 
	
	ТаблицаПомещенияСРазделеннымиЛС(Схема,Параметры,"ПомещенияСРазделеннымиЛС");
	
	Если Схема = Неопределено Тогда
		Схема  					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстДокументыДляПроведенияРазделенныеЛСПервичныйНабор());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	//ДоступныеПоляОтбора 		= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение";
	//энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"ПомещенияСРазделеннымиЛС",Параметры, ДоступныеПоляОтбора);
	
КонецПроцедуры

Функция ТекстДанныеПоследовательностиПервичныйНабор()
	Текст  =
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	ТаблицаПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора КАК ДатаРегистратора,
	|	ТаблицаПоследовательности.ДокРегистратор КАК ДокРегистратор
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыПоследовательность КАК ТаблицаПоследовательности";
	Возврат Текст;
КонецФункции

Функция ТекстДанныеПоследовательностиСвязанныеПомещения()
	Текст  =
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	ТаблицаПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора КАК ДатаРегистратора,
	|	ТаблицаПоследовательности.ДокРегистратор КАК ДокРегистратор
	|ИЗ
	|	ДанныеПоследовательностиПервичныйНабор КАК ТаблицаПоследовательности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация,
	|	ТаблицаПоследовательности.ПериодНачисления,
	|	ТаблицаПоследовательности.Район,
	|	ТаблицаПоследовательности.СостояниеПроведения,
	|	ТаблицаПоследовательности.ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение,
	|	энргПомещения.Родитель,
	|	ТаблицаПоследовательности.ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора,
	|	ТаблицаПоследовательности.ДокРегистратор
	|ИЗ
	|	ДанныеПоследовательностиПервичныйНабор КАК ТаблицаПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ТаблицаПоследовательности.Помещение = энргПомещения.Ссылка
	|			И (НЕ энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|			И (ВЫРАЗИТЬ(ТаблицаПоследовательности.ДокРегистратор КАК Документ.энргОперацияСУслугами) ЕСТЬ NULL)
	|			И (ВЫРАЗИТЬ(ТаблицаПоследовательности.ДокРегистратор КАК Документ.энргУстановитьДополнительнуюСоциальнуюНорму) ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация,
	|	ТаблицаПоследовательности.ПериодНачисления,
	|	ТаблицаПоследовательности.Район,
	|	ТаблицаПоследовательности.СостояниеПроведения,
	|	ТаблицаПоследовательности.ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение,
	|	энргПомещения.Ссылка,
	|	ТаблицаПоследовательности.ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора,
	|	ТаблицаПоследовательности.ДокРегистратор
	|ИЗ
	|	ДанныеПоследовательностиПервичныйНабор КАК ТаблицаПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ТаблицаПоследовательности.Помещение = энргПомещения.Родитель
	|			И (НЕ ТаблицаПоследовательности.Помещение = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|			И (ВЫРАЗИТЬ(ТаблицаПоследовательности.ДокРегистратор КАК Документ.энргОперацияСУслугами) ЕСТЬ NULL)
	|			И (ВЫРАЗИТЬ(ТаблицаПоследовательности.ДокРегистратор КАК Документ.энргУстановитьДополнительнуюСоциальнуюНорму) ЕСТЬ NULL)";
	Возврат Текст;
	
КонецФункции

Функция ТекстМинимальныйПериодРегистрацииНарушенияПоследовательности() 
	
	Текст 	=
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	ТаблицаПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	МИНИМУМ(ТаблицаПоследовательности.ПериодРегистрации) КАК ПериодРегистрации
	|ИЗ
	|	ДанныеПоследовательности КАК ТаблицаПоследовательности
	|ГДЕ
	|	ТаблицаПоследовательности.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПоследовательности.Организация,
	|	ТаблицаПоследовательности.ПериодНачисления,
	|	ТаблицаПоследовательности.Район,
	|	ТаблицаПоследовательности.ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение,
	|	ТаблицаПоследовательности.Помещение";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстМинимальнаяДатаРегистрацииНарушенияПоследовательности()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	ТаблицаПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	МИНИМУМ(ТаблицаПоследовательности.ДатаРегистратора) КАК ДатаРегистратора
	|ИЗ
	|	ДанныеПоследовательности КАК ТаблицаПоследовательности
	|ГДЕ
	|	(ТаблицаПоследовательности.Организация, ТаблицаПоследовательности.ПериодНачисления, ТаблицаПоследовательности.Район, ТаблицаПоследовательности.ЧастныйСектор, ТаблицаПоследовательности.Строение, ТаблицаПоследовательности.Помещение, ТаблицаПоследовательности.ПериодРегистрации) В
	|			(ВЫБРАТЬ
	|				МинПериодРегистрации.Организация,
	|				МинПериодРегистрации.ПериодНачисления,
	|				МинПериодРегистрации.Район,
	|				МинПериодРегистрации.ЧастныйСектор,
	|				МинПериодРегистрации.Строение,
	|				МинПериодРегистрации.Помещение,
	|				МинПериодРегистрации.ПериодРегистрации
	|			ИЗ
	|				МинПериодРегистрации КАК МинПериодРегистрации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПоследовательности.Организация,
	|	ТаблицаПоследовательности.ПериодНачисления,
	|	ТаблицаПоследовательности.Район,
	|	ТаблицаПоследовательности.ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение,
	|	ТаблицаПоследовательности.Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстГраницаНарушенияПоследовательности() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	ТаблицаПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(ТаблицаПоследовательности.ДокРегистратор) КАК ДокРегистратор
	|ИЗ
	|	ДанныеПоследовательности КАК ТаблицаПоследовательности
	|ГДЕ
	|	(ТаблицаПоследовательности.Организация, ТаблицаПоследовательности.ПериодНачисления, ТаблицаПоследовательности.Район, ТаблицаПоследовательности.ЧастныйСектор, ТаблицаПоследовательности.Строение, ТаблицаПоследовательности.Помещение, ТаблицаПоследовательности.ПериодРегистрации, ТаблицаПоследовательности.ДатаРегистратора) В
	|			(ВЫБРАТЬ
	|				МинДатаРегистратораРегистрации.Организация,
	|				МинДатаРегистратораРегистрации.ПериодНачисления,
	|				МинДатаРегистратораРегистрации.Район,
	|				МинДатаРегистратораРегистрации.ЧастныйСектор,
	|				МинДатаРегистратораРегистрации.Строение,
	|				МинДатаРегистратораРегистрации.Помещение,
	|				МинДатаРегистратораРегистрации.ПериодРегистрации,
	|				МинДатаРегистратораРегистрации.ДатаРегистратора
	|			ИЗ
	|				МинДатаРегистратораРегистрации КАК МинДатаРегистратораРегистрации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПоследовательности.Организация,
	|	ТаблицаПоследовательности.ПериодНачисления,
	|	ТаблицаПоследовательности.Район,
	|	ТаблицаПоследовательности.ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение,
	|	ТаблицаПоследовательности.Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстНаборДокументовДляПроведения() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	ТаблицаПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	ТаблицаПоследовательности.ДатаРегистратора КАК ДатаРегистратора,
	|	ТаблицаПоследовательности.ДокРегистратор КАК ДокРегистратор
	|ИЗ
	|	ДанныеПоследовательности КАК ТаблицаПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницаНарушенияПоследовательности КАК ГраницаНарушенияПоследовательности
	|		ПО ТаблицаПоследовательности.Организация = ГраницаНарушенияПоследовательности.Организация
	|			И ТаблицаПоследовательности.ПериодНачисления = ГраницаНарушенияПоследовательности.ПериодНачисления
	|			И ТаблицаПоследовательности.Район = ГраницаНарушенияПоследовательности.Район
	|			И ТаблицаПоследовательности.ЧастныйСектор = ГраницаНарушенияПоследовательности.ЧастныйСектор
	|			И ТаблицаПоследовательности.Строение = ГраницаНарушенияПоследовательности.Строение
	|			И ТаблицаПоследовательности.Помещение = ГраницаНарушенияПоследовательности.Помещение
	|			И (ВЫБОР
	|				КОГДА ТаблицаПоследовательности.ПериодРегистрации > ГраницаНарушенияПоследовательности.ПериодРегистрации
	|					ТОГДА ИСТИНА
	|				КОГДА ТаблицаПоследовательности.ПериодРегистрации = ГраницаНарушенияПоследовательности.ПериодРегистрации
	|					ТОГДА ВЫБОР
	|							КОГДА ТаблицаПоследовательности.ДатаРегистратора > ГраницаНарушенияПоследовательности.ДатаРегистратора
	|								ТОГДА ИСТИНА
	|							КОГДА ТаблицаПоследовательности.ДатаРегистратора = ГраницаНарушенияПоследовательности.ДатаРегистратора
	|								ТОГДА ТаблицаПоследовательности.ДокРегистратор >= ГраницаНарушенияПоследовательности.ДокРегистратор
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)"; 
	
	Возврат Текст;		
		
КонецФункции

Функция ТекстНаборДокументовДляПроведенияСвязанныеПомещения() 
	
	Текст  = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗАпрос.Организация КАК Организация,
	|	ВложенныйЗАпрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗАпрос.Район КАК Район,
	|	ВложенныйЗАпрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗАпрос.Строение КАК Строение,
	|	ВложенныйЗАпрос.Помещение КАК Помещение,
	|	ВложенныйЗАпрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗАпрос.СостояниеПроведения КАК СостояниеПроведения,
	|	ВложенныйЗАпрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗАпрос.ДокРегистратор КАК ДокРегистратор,
	|	энргКлючПомещений.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведенияПервичныйНабор.Организация КАК Организация,
	|		ДокументыДляПроведенияПервичныйНабор.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведенияПервичныйНабор.Район КАК Район,
	|		ДокументыДляПроведенияПервичныйНабор.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведенияПервичныйНабор.Строение КАК Строение,
	|		ДокументыДляПроведенияПервичныйНабор.Помещение КАК Помещение,
	|		ДокументыДляПроведенияПервичныйНабор.ПериодРегистрации КАК ПериодРегистрации,
	|		ДокументыДляПроведенияПервичныйНабор.СостояниеПроведения КАК СостояниеПроведения,
	|		ДокументыДляПроведенияПервичныйНабор.ДатаРегистратора КАК ДатаРегистратора,
	|		ДокументыДляПроведенияПервичныйНабор.ДокРегистратор КАК ДокРегистратор
	|	ИЗ
	|		ДокументыДляПроведенияПервичныйНабор КАК ДокументыДляПроведенияПервичныйНабор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыДляПроведенияПервичныйНабор.Организация,
	|		ДокументыДляПроведенияПервичныйНабор.ПериодНачисления,
	|		ДокументыДляПроведенияПервичныйНабор.Район,
	|		ДокументыДляПроведенияПервичныйНабор.ЧастныйСектор,
	|		ДокументыДляПроведенияПервичныйНабор.Строение,
	|		энргПомещения.Родитель,
	|		ДокументыДляПроведенияПервичныйНабор.ПериодРегистрации,
	|		ДокументыДляПроведенияПервичныйНабор.СостояниеПроведения,
	|		ДокументыДляПроведенияПервичныйНабор.ДатаРегистратора,
	|		ДокументыДляПроведенияПервичныйНабор.ДокРегистратор
	|	ИЗ
	|		ДокументыДляПроведенияПервичныйНабор КАК ДокументыДляПроведенияПервичныйНабор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|			ПО ДокументыДляПроведенияПервичныйНабор.Помещение = энргПомещения.Ссылка
	|				И (НЕ энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПУстаяСсылка))
	|				И (ВЫРАЗИТЬ(ДокументыДляПроведенияПервичныйНабор.ДокРегистратор КАК Документ.энргОперацияСУслугами) ЕСТЬ NULL)
	|				И (ВЫРАЗИТЬ(ДокументыДляПроведенияПервичныйНабор.ДокРегистратор КАК Документ.энргУстановитьДополнительнуюСоциальнуюНорму) ЕСТЬ NULL)) КАК ВложенныйЗАпрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючПомещений
	|		ПО ВложенныйЗАпрос.Строение = энргКлючПомещений.Строение
	|			И ВложенныйЗАпрос.Помещение = энргКлючПомещений.Помещение"; 
	
	Возврат Текст;		
		
КонецФункции

Функция ТекстЗапросаНаборДокументовДляПроведенияПоФактическомуПериоду()
	Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргКлючПомещений.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.СостояниеПроведения КАК СостояниеПроведения,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|		ДокументыДляПроведения.СостояниеПроведения КАК СостояниеПроведения,
	|		ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор
	|	ИЗ
	|		ДокументыДляПроведенияПервичныйНаборСвязанныеПомещения КАК ДокументыДляПроведения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация,
	|		ДокументыДляПроведения.ПериодНачисления,
	|		ДокументыДляПроведения.Район,
	|		ДокументыДляПроведения.ЧастныйСектор,
	|		ДокументыДляПроведения.Строение,
	|		энргПомещения.Родитель,
	|		ДокументыДляПроведения.ПериодРегистрации,
	|		ДокументыДляПроведения.СостояниеПроведения,
	|		ДокументыДляПроведения.ДатаРегистратора,
	|		ДокументыДляПроведения.ДокРегистратор
	|	ИЗ
	|		ДокументыДляПроведенияПервичныйНаборСвязанныеПомещения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|			ПО ДокументыДляПроведения.Помещение = энргПомещения.Ссылка
	|				И (НЕ энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка))
	|				И (ВЫРАЗИТЬ(ДокументыДляПроведения.ДокРегистратор КАК Документ.энргОперацияСУслугами) ЕСТЬ NULL)
	|				И (ВЫРАЗИТЬ(ДокументыДляПроведения.ДокРегистратор КАК Документ.энргУстановитьДополнительнуюСоциальнуюНорму) ЕСТЬ NULL)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючПомещений
	|		ПО ВложенныйЗапрос.Строение = энргКлючПомещений.Строение
	|			И ВложенныйЗапрос.Помещение = энргКлючПомещений.Помещение";

			
	Возврат Текст;
	
КонецФункции

Функция ТекстПомещенияСРазделеннымиЛС()
	Текст = 
	"ВЫБРАТЬ
	|	энргПомещения.Ссылка КАК Помещение,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения,
	|	энргПомещения.Родитель КАК Родитель,
	|	энргПомещения.Строение КАК Строение
	|ПОМЕСТИТЬ ПомещенияСРазделеннымиЛС
	|ИЗ
	|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				энргПомещения.Ссылка КАК Помещение,
	|				энргПомещения.Строение КАК Строение,
	|				энргПомещения.Родитель КАК Родитель,
	|				энргКлючиПомещенийРодитель.КлючПомещения КАК КлючПомещенияРодитель
	|			ИЗ
	|				Справочник.энргПомещения КАК энргПомещения
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещенийРодитель
	|					ПО (энргКлючиПомещенийРодитель.Помещение = энргПомещения.Родитель)
	|						И энргПомещения.Строение = энргКлючиПомещенийРодитель.Строение
	|			ГДЕ
	|				энргПомещения.Ссылка В(&мПомещения)
	|				И энргПомещения.Строение = &Строение
	|				И энргКлючиПомещенийРодитель.Строение = &Строение
	|				И НЕ энргПомещения.Родитель = ЗНАЧЕНИЕ(справочник.энргпомещения.пустаяссылка)) КАК ВложенныйЗапрос
	|			ПО энргПомещения.Родитель = ВложенныйЗапрос.Родитель
	|		ПО энргКлючиПомещений.Помещение = энргПомещения.Ссылка
	|ГДЕ
	|	НЕ энргПомещения.Ссылка В (&мПомещения)
	|	И энргКлючиПомещений.Строение = &Строение
	|	И энргПомещения.Строение = &Строение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Родитель,
	|	ВложенныйЗапрос.КлючПомещенияРодитель,
	|	ВложенныйЗапрос.Родитель,
	|	ВложенныйЗапрос.Строение
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргПомещения.Ссылка КАК Помещение,
	|		энргПомещения.Строение КАК Строение,
	|		энргПомещения.Родитель КАК Родитель,
	|		энргКлючиПомещенийРодитель.КлючПомещения КАК КлючПомещенияРодитель
	|	ИЗ
	|		Справочник.энргПомещения КАК энргПомещения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещенийРодитель
	|			ПО (энргКлючиПомещенийРодитель.Помещение = энргПомещения.Родитель)
	|				И энргПомещения.Строение = энргКлючиПомещенийРодитель.Строение
	|	ГДЕ
	|		энргПомещения.Ссылка В(&мПомещения)
	|		И энргПомещения.Строение = &Строение
	|		И энргКлючиПомещенийРодитель.Строение = &Строение) КАК ВложенныйЗапрос
	|ГДЕ
	|	НЕ ВложенныйЗапрос.Родитель В (&мПомещения)";
	
	ВОзврат Текст;

КонецФункции

Функция ТекстДокументыДляПроведенияРазделенныеЛСПервичныйНабор()
	Текст  =
	"ВЫБРАТЬ
		|	ТаблицаПоследовательности.Организация КАК Организация,
		|	ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаПоследовательности.Район КАК Район,
		|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
		|	ТаблицаПоследовательности.Строение КАК Строение,
		|	ТаблицаПоследовательности.Помещение КАК Помещение,
		|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
		|	ТаблицаПоследовательности.ДатаРегистратора КАК ДатаРегистратора,
		|	ТаблицаПоследовательности.ДокРегистратор КАК ДокРегистратор,
		|	ТаблицаПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
		|	ПомещенияСРазделеннымиЛС.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ДокументыДляПроведенияРазделенныеЛСПервичныйНабор
		|ИЗ
		|	РегистрСведений.энргСтабильныеПериодыПоследовательность КАК ТаблицаПоследовательности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
		|		ПО ТаблицаПоследовательности.Организация = ТаблицаПериодов.Организация
		|			И ТаблицаПоследовательности.Район = ТаблицаПериодов.Район
		|			И (ТаблицаПоследовательности.ПериодРегистрации МЕЖДУ ТаблицаПериодов.НачалоОП И ТаблицаПериодов.ЗавершениеОП)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПомещенияСРазделеннымиЛС КАК ПомещенияСРазделеннымиЛС
		|		ПО ТаблицаПоследовательности.Строение = ПомещенияСРазделеннымиЛС.Строение
		|			И ТаблицаПоследовательности.Помещение = ПомещенияСРазделеннымиЛС.Помещение
		|ГДЕ
		|	ТаблицаПоследовательности.Организация = &Организация
		|	И ТаблицаПоследовательности.Район = &Район
		|	И ТаблицаПоследовательности.ЧастныйСектор = &ЧастныйСектор
		|	И ТаблицаПоследовательности.Строение = &Строение";
	Возврат Текст;
КонецФункции

Функция ТекстНаборДокументовДляПроведенияПерерасчетПоПериодуРегистрации() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора КАК ДатаРегистратора,
	|	ТаблицаПоследовательности.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыПоследовательность КАК ТаблицаПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|		ПО ТаблицаПоследовательности.Организация = ТаблицаПериодов.Организация
	|			И ТаблицаПоследовательности.Район = ТаблицаПериодов.Район
	|			И (ТаблицаПоследовательности.ПериодРегистрации МЕЖДУ ТаблицаПериодов.НачалоОП И ТаблицаПериодов.ЗавершениеОП)
	|			И ТаблицаПоследовательности.ПериодРегистрации <> ТаблицаПериодов.ЗавершениеОП
	|			И (ТаблицаПоследовательности.ДатаРегистратора < &ОкончаниеПериода)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ТаблицаПоследовательности.Строение = энргКлючиПомещений.Строение
	|			И ТаблицаПоследовательности.Помещение = энргКлючиПомещений.Помещение
	|ГДЕ
	|	ТаблицаПоследовательности.Организация = &Организация
	|	И ТаблицаПоследовательности.Район = &Район
	|	И ТаблицаПоследовательности.ЧастныйСектор = &ЧастныйСектор
	|	И ТаблицаПоследовательности.Строение = &Строение
	|	И ТаблицаПоследовательности.Помещение В(&мПомещения)"; 
	
	
	Возврат Текст;		
		
КонецФункции     

Функция ТекстНаборДокументовДляПроведенияПерерасчетПоДатаРегистратора() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ТаблицаПоследовательности.Организация КАК Организация,
	|	&ПериодНачисленияНачало КАК ПериодНачисления,
	|	ТаблицаПоследовательности.Район КАК Район,
	|	ТаблицаПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПоследовательности.Строение КАК Строение,
	|	ТаблицаПоследовательности.Помещение КАК Помещение,
	|	ТаблицаПоследовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоследовательности.ДатаРегистратора КАК ДатаРегистратора,
	|	ТаблицаПоследовательности.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыПоследовательность КАК ТаблицаПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|		ПО ТаблицаПоследовательности.Организация = ТаблицаПериодов.Организация
	|			И ТаблицаПоследовательности.Район = ТаблицаПериодов.Район
	|			И (ТаблицаПоследовательности.ДатаРегистратора МЕЖДУ ТаблицаПериодов.НачалоОП И ТаблицаПериодов.ЗавершениеОП)
	|			И ТаблицаПоследовательности.ДатаРегистратора <> ТаблицаПериодов.ЗавершениеОП
	|			И (ТаблицаПоследовательности.ДатаРегистратора < &ОкончаниеПериода)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ТаблицаПоследовательности.Строение = энргКлючиПомещений.Строение
	|			И ТаблицаПоследовательности.Помещение = энргКлючиПомещений.Помещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации КАК ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации
	|		ПО ТаблицаПоследовательности.ДокРегистратор = ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.ДокРегистратор
	|ГДЕ
	|	ТаблицаПоследовательности.Организация = &Организация
	|	И ТаблицаПоследовательности.Район = &Район
	|	И ТаблицаПоследовательности.ЧастныйСектор = &ЧастныйСектор
	|	И ТаблицаПоследовательности.Строение = &Строение
	|	И ТаблицаПоследовательности.Помещение В(&мПомещения)
	|	И ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.ДокРегистратор ЕСТЬ NULL"; 
	
	Возврат Текст;		
		
КонецФункции

Функция ТекстНаборДокументовДляПроведенияПерерасчетОбъединение() 
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.Организация КАК Организация,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.Район КАК Район,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.Строение КАК Строение,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.Помещение КАК Помещение,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.СостояниеПроведения КАК СостояниеПроведения,
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации КАК ДокументыДляПроведенияПервичныйНабор_ПоПериодуРегистрации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.Организация,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.Район КАК Район,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.Строение КАК Строение,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.Помещение КАК Помещение,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.СостояниеПроведения КАК СостояниеПроведения,
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации КАК ДокументыДляПроведенияПервичныйНабор_ПоДатеРегистрации"; 
	
	Возврат Текст;		
		
КонецФункции

Функция ТекстЗапросаНаборДокументовСвязанныеПомещенияДляПроведенияПоФактическомуПериоду()
	Текст = 
	"ВЫБРАТЬ
		|		ДокументыДляПроведенияПервичныйНабор.Организация КАК Организация,
		|		ДокументыДляПроведенияПервичныйНабор.ПериодНачисления КАК ПериодНачисления,
		|		ДокументыДляПроведенияПервичныйНабор.Район КАК Район,
		|		ДокументыДляПроведенияПервичныйНабор.ЧастныйСектор КАК ЧастныйСектор,
		|		ДокументыДляПроведенияПервичныйНабор.Строение КАК Строение,
		|		ДокументыДляПроведенияПервичныйНабор.Помещение КАК Помещение,
		|		ДокументыДляПроведенияПервичныйНабор.ПериодРегистрации КАК ПериодРегистрации,
		|		ДокументыДляПроведенияПервичныйНабор.СостояниеПроведения КАК СостояниеПроведения,
		|		ДокументыДляПроведенияПервичныйНабор.ДатаРегистратора КАК ДатаРегистратора,
		|		ДокументыДляПроведенияПервичныйНабор.ДокРегистратор КАК ДокРегистратор
		|	ИЗ
		|		ДокументыДляПроведенияПервичныйНабор КАК ДокументыДляПроведенияПервичныйНабор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.Организация,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.ПериодНачисления,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.Район,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.ЧастныйСектор,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.Строение,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.Помещение,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.ПериодРегистрации,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.СостояниеПроведения,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.ДатаРегистратора,
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор.ДокРегистратор
		|	ИЗ
		|		ДокументыДляПроведенияРазделенныеЛСПервичныйНабор КАК ДокументыДляПроведенияРазделенныеЛСПервичныйНабор";

			
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли