#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период = ТекущаяДатаСеанса();
	УстановитьОтборыДляДолжников();
	ОбновитьДокументыКСогласованиюНаСервере();
	ПринятоВРаботу = Ложь;
	
	ЗадачиМне.Параметры.УстановитьЗначениеПараметра("ТекДата", 			 КонецДня(Объект.Период));
	ЗадачиМне.Параметры.УстановитьЗначениеПараметра("ТекПользователь", 	 ПараметрыСеанса.ТекущийПользователь);
	ЗадачиМне.Параметры.УстановитьЗначениеПараметра("ЗадачиПодчиненных", ЗадачиПодчиненных);
	
	ЗадачиМнеОРП.Параметры.УстановитьЗначениеПараметра("ТекДата", 			 КонецДня(Объект.Период));
	ЗадачиМнеОРП.Параметры.УстановитьЗначениеПараметра("ТекПользователь", 	 ПараметрыСеанса.ТекущийПользователь);
	ЗадачиМнеОРП.Параметры.УстановитьЗначениеПараметра("ЗадачиПодчиненных",  Истина);

	ПеренапраленныеЗадачи.Параметры.УстановитьЗначениеПараметра("НовыйИсполнитель", Исполнитель);	
	ПеренапраленныеЗадачи.Параметры.УстановитьЗначениеПараметра("ПланируемаяДатаВыполнения", Объект.Период);
	ПеренапраленныеЗадачи.Параметры.УстановитьЗначениеПараметра("ТекДата", НачалоДня(Объект.Период));

	Элементы.ДолжникиОтправитьСМС.Видимость = ОтправкаSMS.ДоступнаОтправкаSMS(); 
	
	// Создание команд планировния отправки ЭП
	СпрЭтаповПИД  = Справочники.энргВидыОперацийПИД;
	СписокМакетов = СпрЭтаповПИД.ПолучитьСписокМакетовПечати();
	
	Для каждого ТекМакет Из СписокМакетов Цикл
		Префикс	 = "ПФ_MXL_";
		ИмяЭтапа = СтрЗаменить(ТекМакет.Значение, Префикс, "ЭтапПретензионноИсковойДеятельности_");
		ИмяКмд	 = СтрЗаменить(ТекМакет.Значение, Префикс, "КомандаЭтап_");
		Этап	 = СпрЭтаповПИД[ИмяЭтапа];
		
		// Добавление команды
		Кмд			  = ЭтаФорма.Команды.Добавить(ИмяКмд);
		Кмд.Действие  = "ЗапланироватьОтправку";
		Кмд.Заголовок = Строка(Этап);
		
		// Добавление новой кнопки
		ЭлементКМД			   = Элементы.Добавить(ИмяКмд, Тип("КнопкаФормы"), Элементы.ГрппаКнопкОтправкиЭП);
		ЭлементКМД.Вид		   = ВидКнопкиФормы.ОбычнаяКнопка;
		ЭлементКМД.ИмяКоманды  = ИмяКмд;
		ЭлементКМД.Картинка	   = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо;
		ЭлементКМД.Отображение = ОтображениеКнопки.КартинкаИТекст
	КонецЦикла;
	
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("ДолжникиЗапуститьЗадачу"), Метаданные.Задачи.энргЗадачаПИД);
	
	ИменаКомандНаФорме = Новый Структура("ДолжникиОтправитьСМС");
	Для каждого ТекЭлемент Из Элементы.ГрппаКнопкОтправкиЭП.ПодчиненныеЭлементы Цикл
		ИменаКомандНаФорме.Вставить(ТекЭлемент.Имя);
	КонецЦикла;
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, ИменаКомандНаФорме, Метаданные.Документы.энргСобытие);
	// -- Акимов Д.В.
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УстановитьОтборыДляДолжников();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыЗадачиПИД(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСписки" Тогда
		ОбновитьСписки();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗадачиПИД.Параметры.УстановитьЗначениеПараметра("ТекДата", КонецДня(Объект.Период));
	//Должники.Параметры.УстановитьЗначениеПараметра("ТекДата", КонецДня(Объект.Период));
	//Должники.Параметры.УстановитьЗначениеПараметра("НачалоПериода", КонецДня(НачалоПериода));
	//Должники.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонецПериода));

	ОбновитьДанные(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Схема) Тогда  
		ПроверитьСоответствиеОтборов();
	КонецЕсли;	//ОбновитьДанные(Неопределено);
//Должники.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Схема) Тогда  
		ПроверитьСоответствиеОтборов();
	КонецЕсли;	//Должники.Параметры.УстановитьЗначениеПараметра("МКД", МКД);	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Схема) Тогда  
		ПроверитьСоответствиеОтборов();
	КонецЕсли;//Должники.Параметры.УстановитьЗначениеПараметра("Услуга", Услуга);	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Схема) Тогда  
		ПроверитьСоответствиеОтборов();
	КонецЕсли;//Должники.Параметры.УстановитьЗначениеПараметра("Абонент", Абонент);	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Схема) Тогда  
		ПроверитьСоответствиеОтборов();
	КонецЕсли;//Должники.Параметры.УстановитьЗначениеПараметра("Район",	Объект.Район);
КонецПроцедуры

&НаКлиенте
Процедура ЗапретУдаления(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗапретДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОтборТип = ЗадачиПИД.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	Если ТекущаяСтраница.Имя = "СтраницаДосудебнаяРабота" Тогда
		ОтборТип.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.энргТипыЭтапов.ДосудебнаяРабота");
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаСудебнаяРабота" Тогда
		ОтборТип.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.энргТипыЭтапов.СудебнаяРабота");
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаИсполнительнаяРабота" Тогда
		ОтборТип.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.энргТипыЭтапов.ИсполнительнаяРабота");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПИД_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		ПарамФормы = Новый Структура("Ключ", ВыбраннаяСтрока);
		ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиМнеПриАктивизацииСтроки(Элемент)
	
	// Определение доступности кнопки "Объединить задачи"
	МожноОбъединить = Элементы.ЗадачиМне.ВыделенныеСтроки.Количество() > 1;
	
	Если МожноОбъединить Тогда
		ТекАбонент = Неопределено;
		Для каждого ТекСтрока Из Элементы.ЗадачиМне.ВыделенныеСтроки Цикл
			ТекДанные = Элементы.ЗадачиМне.ДанныеСтроки(ТекСтрока);

			Если ТекАбонент = Неопределено Тогда
			
				ТекАбонент = ТекДанные.Абонент;
			
			ИначеЕсли ТекАбонент <> ТекДанные.Абонент Тогда 
				МожноОбъединить = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Элементы.ЗадачиМнеОбъединитьЗадачи.Доступность = МожноОбъединить;
	
	ТекСтрока = Элементы.ЗадачиМне.ТекущиеДанные;
	Элементы.ЗадачиМнеНазначитьИсполнителя.Доступность = ?(ТекСтрока = Неопределено, Ложь, ТекСтрока.ЗадачаПодчиненным);
	
	ОтборПредЭтапы = ПредыдущиеЭтапы.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	ПолеКомпановки = Новый ПолеКомпоновкиДанных("Ссылка.стартоваяЗадача");
	Для каждого ТекОтбор Из ОтборПредЭтапы Цикл
		Если ТекОтбор.ЛевоеЗначение = ПолеКомпановки Тогда
			Если ТекСтрока = Неопределено Тогда
				ТекОтбор.ПравоеЗначение = Неопределено;
			Иначе
				ТекОтбор.ПравоеЗначение = ТекСтрока.СтартоваяЗадача;
			КонецЕсли;
			
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Элементы.ПредыдущиеЭтапы.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаВыбораПериода(Команда)
	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Показать(ОписаниеОповещенияВыборПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;	
	НачалоПериода 		= ИнтервалУстановлен.ДатаНачала;
	КонецПериода 		= ИнтервалУстановлен.ДатаОкончания;
	
	ЗадачиПИД.Параметры.УстановитьЗначениеПараметра("ТекДата", КонецДня(Объект.Период));
	
	//Должники.Параметры.УстановитьЗначениеПараметра("ТекДата", КонецДня(КонецПериода));
	//Должники.Параметры.УстановитьЗначениеПараметра("НачалоПериода", КонецДня(НачалоПериода));
	//Должники.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонецПериода));
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеСМИ(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОповещениеСМИ"));
КонецПроцедуры

&НаКлиенте
Процедура ЛичныйЗвонок(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.ЛичныйЗвонок"));
КонецПроцедуры

&НаКлиенте
Процедура АвтоЗвонок(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.АвтоЗвонок"));
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействиеСОМС(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОМС"));
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодейтсвиеСРаботодателем(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.Работодатель"));
КонецПроцедуры

&НаКлиенте
Процедура РазмещениеНаСайте(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.РазмещениеНаСайте"));
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьЗадачу(Команда, Этап = Неопределено, СоотДолжникЗадача = Неопределено)
	
	СписокСтрок  = Новый Массив;
	СоотОргСхема = Новый Соответствие;
	МассивЗадач	 = Новый Массив;
	                               
	Для каждого ТекСтрока Из Элементы.ДолжникиНов.ВыделенныеСтроки Цикл
		ТекДанные = Элементы.ДолжникиНов.ДанныеСтроки(ТекСтрока);
		
		НовСтрока = Новый Структура("Организация, МКД, Район, Задолженность, Схема, Этап, Абонент, Услуга, ПериодНачисления");
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекДанные);
		НовСтрока.Вставить("ТекСтрока", ТекСтрока);
		СписокСтрок.Добавить(НовСтрока);
		Если СоотОргСхема.Получить(НовСтрока.Организация) = Неопределено Тогда 
			СоотОргСхема.Вставить(НовСтрока.Организация, Объект.Схема);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Схема) Тогда
		ЗаполнитьСхемыПоУмолчанию(СоотОргСхема);
	КонецЕсли;
	
	СоотСхемаЭтап = Новый Соответствие;
	Для каждого ЭлемСоот Из СоотОргСхема Цикл
		Если СоотСхемаЭтап.Получить(ЭлемСоот.Значение) = Неопределено Тогда 
			СоотСхемаЭтап.Вставить(ЭлемСоот.Значение, Этап);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Этап) Тогда
		ЗаполнитьНачальныеЭтапыСхем(СоотСхемаЭтап);
	КонецЕсли;
	
	
	НачатьПИРНаСервере(СоотОргСхема, СоотСхемаЭтап);
	
	Элементы.ЗадачиПИД_ДосудебнаяРабота.Обновить();
	Элементы.ЗадачиПИД_СудебнаяРабота.Обновить();
	Элементы.ЗадачиПИД_ИсполнительнаяРабота.Обновить();
	

	//
	//СоздатьЗадачи(СписокСтрок, СоотОргСхема, СоотСхемаЭтап, Не ЗначениеЗаполнено(Этап), СоотДолжникЗадача);
КонецПроцедуры

// Начать пир новая процедура 

&НаСервере
Процедура НачатьПИРНаСервере(СоотОргСхема, СоотСхемаЭтап)
	ВыбранныеЭлементы = Элементы.ДолжникиНов.ВыделенныеСтроки;  //ДеревоДолжников.НайтиПоИдентификатору(17)
	
	СоотвествиеЗадачи = Новый Соответствие;
	
	
	Для каждого ИдСтроки Из ВыбранныеЭлементы Цикл
	
		Ветвь = ДолжникиНов.НайтиПоИдентификатору(ИдСтроки);
		
		ТекАбонент = Ветвь.Абонент;
	
		Если Не ЗначениеЗаполнено(ТекАбонент) Тогда
			Продолжить;
		КонецЕсли;

		ПарамЗадачи = СоотвествиеЗадачи.Получить(ТекАбонент);
		Должник = ТекАбонент;
		Если ПарамЗадачи = Неопределено Тогда
		
			ПарамЗадачи = Новый Структура("Абонент, Организация, Район, СуммаЗадолженности,ЛицевойСчет, АдресОбъекта,ПериодНачисления", Должник);
			
			энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Должник, ПарамЗадачи);
			ЗаполнитьЗначенияСвойств(ПарамЗадачи, Ветвь);
			ПарамЗадачи.Вставить("МКД", Ветвь.Дом);
						
			Задолженность = Новый ТаблицаЗначений;
			Задолженность.Колонки.Добавить("Услуга", 			Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
			Задолженность.Колонки.Добавить("ПериодНачисления", 	Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
			Задолженность.Колонки.Добавить("Задолженность",		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
			
			
			ПарамЗадачи.Вставить("Задолженность", Задолженность);
			СоотвествиеЗадачи.Вставить(ТекАбонент, ПарамЗадачи);
		КонецЕсли;
		
		ЗаполнитьЗадолженностьЗадачи(Ветвь, ПарамЗадачи);
	КонецЦикла;
	
	Для каждого ПарамЗадачи Из СоотвествиеЗадачи Цикл
	
		ПарамТекЗадачи = ПарамЗадачи.Значение;
		
		НовЗадача = Задачи.энргЗадачаПИД.СоздатьЗадачу();
		НовЗадача.Схема = Объект.Схема;
		НовЗадача.Дата = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(НовЗадача, ПарамТекЗадачи); 
	    СуммаЗадолженности = 0;
		Для каждого СтрокаЗадол Из ПарамТекЗадачи.Задолженность Цикл
			СтрокаТЧ = НовЗадача.Задолженность.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаЗадол);
		    СуммаЗадолженности = СуммаЗадолженности + СтрокаЗадол.Задолженность;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(НовЗадача.Задолженность) Тогда
		
			НовЗадача.СуммаЗадолженности = СуммаЗадолженности;
			
			Задачи.энргЗадачаПИД.ЗаполнитьНаименованиеИЭтап(НовЗадача);
			Попытка
				НовЗадача.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать задачу для абонента " + ПарамЗадачи.Ключ);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьДерево();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадолженностьЗадачи(Ветвь, ПарамЗадачи)

	Подветви = Ветвь.ПолучитьЭлементы();
	
	Если Подветви.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(Ветвь.Задача) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У абонента " + Ветвь.Абонент + " по за период " + Формат(Ветвь.ПериодНачисления, "ДФ='MMMM гггг'") + " по услуге " + Ветвь.Услуга + " уже начат ПИР ");
		Иначе
			Задолженность = ПарамЗадачи.Задолженность;
			
			ПарамЗадолженности = Новый Структура("Услуга, ПериодНачисления");
			ЗаполнитьЗначенияСвойств(ПарамЗадолженности, Ветвь);
			ЗаписиТЗ = Задолженность.НайтиСтроки(ПарамЗадолженности);
			Если Не ЗначениеЗаполнено(ЗаписиТЗ) Тогда
				СтрокаТЗ = Задолженность.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, Ветвь);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Для каждого Подветвь Из Подветви Цикл
			ЗаполнитьЗадолженностьЗадачи(Подветвь, ПарамЗадачи);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки()
	
	//Элементы.ДолжникиНов.Обновить();
	Элементы.ЗадачиПИД_ДосудебнаяРабота.Обновить();
	Элементы.ЗадачиПИД_ИсполнительнаяРабота.Обновить();
	Элементы.ЗадачиПИД_СудебнаяРабота.Обновить();
	Элементы.ЗадачиМне.Обновить();
	Элементы.ЗадачиМнеОРП.Обновить();
	Элементы.ПредыдущиеЭтапы.Обновить();
	Элементы.ПеренапраленныеЗадачи.Обновить();
	//ОбновитьДанные(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсех(Команда)
	Элементы.ДолжникиНов.ВыделенныеСтроки.Очистить();
	
	Для каждого ТекСтрока Из ДолжникиНов.ПолучитьЭлементы() Цикл
		Элементы.ДолжникиНов.ВыделенныеСтроки.Добавить(ТекСтрока.ПолучитьИдентификатор());  
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту"));
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	СоздатьСобытие(ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаСМС"));
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьОтправку(Команда)
	СоотДолжникЗадача = Новый Соответствие;
	
	ИмяПредЭтапа  = СтрЗаменить(Команда.Имя, "КомандаЭтап", "ЭтапПретензионноИсковойДеятельности");
	Этап		  = ПредопределенноеЗначение("Справочник.энргВидыОперацийПИД." + ИмяПредЭтапа);
	ИмяМакета	  = СтрЗаменить(Команда.Имя, "КомандаЭтап", "ПФ_MXL");
	
	ЕстьДолжникиБезЗадач = Ложь;
	Для каждого ТекСтрока Из Элементы.Должники.ВыделенныеСтроки Цикл
		ТекДанные = Элементы.Должники.ДанныеСтроки(ТекСтрока);
		
		Если ТекДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекДанные.Задача) Тогда
			ЕстьДолжникиБезЗадач = Истина;
			СоотДолжникЗадача.Вставить(ТекСтрока, "");
		КонецЕсли;
	КонецЦикла;

	Если ЕстьДолжникиБезЗадач Тогда
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Пропустить, "Пропустить абонентов");
		Если ЗначениеЗаполнено(Объект.Схема) Тогда
			СписокКнопок.Добавить(КодВозвратаДиалога.ОК, "Создать задачи для абонентов");
		КонецЕсли;
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
		ПарамВопроса = Новый Структура("ИмяМакета, СоотДолжникЗадача, Этап", ИмяМакета, СоотДолжникЗадача, Этап);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаНаСозданиеЗадач", ЭтотОбъект, ПарамВопроса);

		ПоказатьВопрос(ОписаниеОповещения, "Выделены абоненты без задач.", СписокКнопок);
	Иначе
		СоздатьЗапланированнуюОтправку(ИмяМакета, Этап, СоотДолжникЗадача);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПеренаправление(Команда)
	Задача = Элементы.ПеренапраленныеЗадачи.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(Задача) Тогда
	
		ПарамФормы = Новый Структура("ПодтвердитьПеренаправление", Истина);
		ПарамФормы.Вставить("ЗначенияЗаполнения", ПолучитьПараметрыФормыПеренаправления(Задача));

		ОписОпов = Новый ОписаниеОповещения("СменаИсполнителя", ЭтаФорма, Новый Структура("Задача", Задача));
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьИсполнителя(Команда)
	Задача = Элементы.ЗадачиМне.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(Задача) Тогда
		
		ПарамФормы = Новый Структура;
		ПарамФормы.Вставить("ЗначенияЗаполнения", Новый Структура("НазначениеИсполнителя", Истина));
		
		ОписОпов = Новый ОписаниеОповещения("НазначениеИсполнителя", ЭтаФорма, Новый Структура("Задача", Задача));
		ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаСменыИсполнителя", ПарамФормы, ЭтаФорма,,,, ОписОпов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СобытиеПИР(Команда)
	СписокАбонентов = Новый Массив;
	МассивАбонентов	= Новый Массив;
	
	Для каждого ТекСтрока Из Элементы.ДолжникиНов.ВыделенныеСтроки Цикл
		ТекДанные = Элементы.ДолжникиНов.ДанныеСтроки(ТекСтрока);
		
		Если СписокАбонентов.Найти(ТекДанные.Абонент) = Неопределено Тогда
			СписокАбонентов.Добавить(ТекДанные.Абонент);
			
			//СтрокаАбоненты = Новый Структура("Абонент, Основание, IDЭтапа", ТекДанные.Абонент, Задача.Ссылка, IDЭтапа);
			СтрокаАбоненты = Новый Структура("Абонент", ТекДанные.Абонент);
			МассивАбонентов.Добавить(СтрокаАбоненты);
		КонецЕсли;
	КонецЦикла;
	
	//ОткрытьФорму("Обработка.бестГрупповойВводСобытийПИР.Форма",
	//Новый Структура("СписокАбонентов", СписокАбонентов),
	//ЭтаФорма, УникальныйИдентификатор);
	
		
	ПарамФормы = Новый Структура("Организация, Район, Одинарный", Объект.Организация, Объект.Район, Ложь);
	ПарамФормы.Вставить("Абоненты", МассивАбонентов);
	ФормаКакСтрока = энргОбщегоНазначенияКлиент.ПолучитьФормыПИРДляОтображенияКакСтрока();				
	ОткрытьФорму(ФормаКакСтрока.ФормаДокумента, ПарамФормы, ЭтаФорма, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДополнительныеФункцииНаКлиенте

&НаКлиенте
Процедура СоздатьЗадачи(СписокСтрок, СоотОргСхема, СоотСхемаЭтап, ОбновитьСписки = Истина, СоотДолжникЗадача = Неопределено)
	
	// Определение стартовых этапов для используемых схем
	Для каждого ЭлемСоот Из СоотСхемаЭтап Цикл
		
		Если ТипЗнч(ЭлемСоот.Значение) = Тип("Массив") Тогда 
			Схема = ЭлемСоот.Ключ;
			НачальныеЭтапыСхемы = Новый СписокЗначений;
			НачальныеЭтапыСхемы.ЗагрузитьЗначения(ЭлемСоот.Значение);
			
			Этап = Неопределено;
			
			ДополнительныеПараметры = Новый Структура("СоотОргСхема, СоотСхемаЭтап, СписокСтрок, Схема", СоотОргСхема, СоотСхемаЭтап, СписокСтрок, Схема);
			ОписаниеОповещения		= Новый ОписаниеОповещения("ОбработкаВыбораЭтапа", ЭтотОбъект, ДополнительныеПараметры);
			НачальныеЭтапыСхемы.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите начальный этап для схемы """ + Схема + """");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Удаление строк, для которых не удалось установить схему
	УдаляемыеСтроки = Новый Массив;
	Для каждого ТекСтрока Из СписокСтрок Цикл
		Схема = СоотОргСхема.Получить(ТекСтрока.Организация);
		Если Не ЗначениеЗаполнено(Схема) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для абонента " + ТекСтрока.Абонент + " не создана задача, т.к. не определена схема.");
			УдаляемыеСтроки.Добавить(ТекСтрока);
		Иначе
			ТекСтрока.Вставить("Схема", Схема);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьЭлементыИзМасива(СписокСтрок, УдаляемыеСтроки);
	
	// Удаление строк, для которых не удалось установить стартовый этап
	УдаляемыеСтроки = Новый Массив;
	Для каждого ТекСтрока Из СписокСтрок Цикл
		Этап = СоотСхемаЭтап.Получить(ТекСтрока.Схема);
		Если Не ЗначениеЗаполнено(Этап) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для абонента " + ТекСтрока.Абонент + " не создана задача, т.к. не определён стартовый этап.");
			УдаляемыеСтроки.Добавить(ТекСтрока);
		Иначе
			ТекСтрока.Вставить("Этап", Этап);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьЭлементыИзМасива(СписокСтрок, УдаляемыеСтроки);	
	
	СоздатьЗадачиНаСервере(СписокСтрок, СоотДолжникЗадача);
	Если ОбновитьСписки Тогда
		ОбновитьСписки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементыИзМасива(СписокСтрок, УдаляемыеСтроки)
	
	Перем Индекс, УдалСтрока;
	
	Для каждого УдалСтрока Из УдаляемыеСтроки Цикл
		Индекс = СписокСтрок.Найти(УдалСтрока);
		Если Индекс <> Неопределено Тогда
			СписокСтрок.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	УдаляемыеСтроки.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЭтапа(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	СоотОргСхема  = ДополнительныеПараметры.СоотОргСхема;
	СоотСхемаЭтап = ДополнительныеПараметры.СоотСхемаЭтап;
	СписокСтрок   = ДополнительныеПараметры.СписокСтрок;
	Схема		  = ДополнительныеПараметры.Схема;
	
	Этап = ВыбранныйЭлемент;
	Если Этап = Неопределено Тогда
		СоотСхемаЭтап[Схема] = Неопределено;
	Иначе
		СоотСхемаЭтап[Схема] = Этап.Значение;
	КонецЕсли;
	
	СоздатьЗадачи(СписокСтрок, СоотОргСхема, СоотСхемаЭтап);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыЗадачиПИД(Знач ТекСтрока)
	
	Перем ТекАбонент, ТекОрганизация, ТекПоставщик;
	
	ТекАбонент		=?(ТекСтрока = Неопределено, ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка"),	  ТекСтрока.Абонент);
	ТекОрганизация	=?(ТекСтрока = Неопределено, ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"),	  ТекСтрока.Организация);
	//ТекПоставщик	=?(ТекСтрока = Неопределено, ПредопределенноеЗначение("Справочник.энргКонтрагенты.ПустаяСсылка"), ТекСтрока.Поставщик);
	
	ЗадачиПИД.Параметры.УстановитьЗначениеПараметра("Абонент",		ТекАбонент);
	ЗадачиПИД.Параметры.УстановитьЗначениеПараметра("Организация",	ТекОрганизация);
	//ЗадачиПИД.Параметры.УстановитьЗначениеПараметра("Поставщик",	ТекПоставщик);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСобытие(ТипСобытия)
	СписокАбонентов = Новый Массив;
	Организация		= Неопределено;
	СоотАбонЗадач	= Новый Соответствие;
	                               
	Для каждого ТекСтрока Из Элементы.ДолжникиНов.ВыделенныеСтроки Цикл
		//ТекДанные = Элементы.Должники.ДанныеСтроки(ТекСтрока);
		ТекДанные = Элементы.ДолжникиНов.ДанныеСтроки(ТекСтрока);
		Если ТекДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;          
		
		ДобавлениеПодчиненныхЭлементов(ТекДанные, СписокАбонентов, СоотАбонЗадач);
		
		Если ЗначениеЗаполнено(ТекДанные.Организация) И Не ЗначениеЗаполнено(Организация) Тогда
			Организация = ТекДанные.Организация;		
		КонецЕсли;
		//НовСтрока = Новый Структура;
		//НовСтрока.Вставить("Абонент",   ТекДанные.Абонент);
		//НовСтрока.Вставить("Основание", ТекДанные.Задача);
		//СписокАбонентов.Добавить(НовСтрока);
	КонецЦикла;
	
	Если СписокАбонентов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет выделенных строк.");
		Возврат;
	КонецЕсли;
	
	ПарамФормы = Новый Структура;
	ПарамФормы.Вставить("ТипСобытия",  ТипСобытия);
	ПарамФормы.Вставить("Организация", Организация);
	ПарамФормы.Вставить("Абоненты",	   СписокАбонентов);
	
	ОткрытьФорму("Документ.энргСобытие.ФормаОбъекта", ПарамФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеПодчиненныхЭлементов(Ветвь, СписокАбонентов, СоотАбонЗадач)
	Подветви = Ветвь.ПолучитьЭлементы();
	
	Если ЗначениеЗаполнено(Подветви) Тогда
		Для каждого Подветвь Из Подветви Цикл
			ДобавлениеПодчиненныхЭлементов(Подветвь, СписокАбонентов, СоотАбонЗадач);
		КонецЦикла;
	Иначе
		Ключ = ?(ТипЗнч(Ветвь.Задача) = Тип("ЗадачаСсылка.энргЗадачаПИД") И ЗначениеЗаполнено(Ветвь.Задача), Ветвь.Задача, Ветвь.Абонент);
		Если СоотАбонЗадач.Получить(Ключ) = Неопределено Тогда
			СоотАбонЗадач.Вставить(Ключ, Истина);
			
			НовСтрока = Новый Структура("Абонент, Основание", Ветвь.Абонент, Ветвь.Задача);
			СписокАбонентов.Добавить(НовСтрока);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьЗапланированнуюОтправку(ИмяМакета, Этап, СоотДолжникЗадача)
	ДопПарам = Новый Структура("ИмяМакета, СоотДолжникЗадача", ИмяМакета, СоотДолжникЗадача);
	ОписОпов = Новый ОписаниеОповещения("СоздатьЗапланированнуюОтправкуПослеВыбораДаты", ЭтотОбъект, ДопПарам);
	ПоказатьВводДаты(ОписОпов, ТекущаяДата(), "Планируемая дата отправки", ЧастиДаты.Дата);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗапланированнуюОтправкуПослеВыбораДаты(Дата, ДополнительныеПараметры) Экспорт
	
	ИмяМакета = ДополнительныеПараметры.ИмяМакета;
	СоотДолжникЗадача = ДополнительныеПараметры.СоотДолжникЗадача;
	
	Если (Дата <> Неопределено) Тогда 
		СписокАбонентов = Новый Массив;
		Организация		= Неопределено; 
		
		Для каждого ТекСтрока Из Элементы.Должники.ВыделенныеСтроки Цикл
			ТекДанные = Элементы.Должники.ДанныеСтроки(ТекСтрока);
			
			Если ТекДанные = Неопределено Или Не ЗначениеЗаполнено(ТекДанные.Абонент) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗадачаСоот = СоотДолжникЗадача.Получить(ТекСтрока);
			Если ЗадачаСоот = "" Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекДанные.Организация) И Не ЗначениеЗаполнено(Организация) Тогда
				Организация = ТекДанные.Организация;		
			КонецЕсли;
			
			Абонент = ТекДанные.Абонент;
			Основание = ?(ЗадачаСоот = Неопределено, ТекДанные.Задача, ЗадачаСоот);
			Если Не ЗначениеЗаполнено(Основание) Тогда
				Продолжить;
			КонецЕсли;
			
			НовСтрока = Новый Структура;
			НовСтрока.Вставить("Абонент",   ТекДанные.Абонент);
			НовСтрока.Вставить("Основание", Основание);
			СписокАбонентов.Добавить(НовСтрока);
		КонецЦикла;
		
		Если СписокАбонентов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет выделенных строк.");
			Возврат;
		КонецЕсли;
		
		ПарамФормы = Новый Структура;
		ПарамФормы.Вставить("ТипСобытия",				ПредопределенноеЗначение("Справочник.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту"));
		ПарамФормы.Вставить("Организация",				Организация);
		ПарамФормы.Вставить("Абоненты",					СписокАбонентов);
		ПарамФормы.Вставить("ПланируемаяДатаОтправки",	Дата);
		ПарамФормы.Вставить("МакетПечатнойФормы",		ИмяМакета);
		
		ОткрытьФорму("Документ.энргСобытие.ФормаОбъекта", ПарамФормы, ЭтаФорма);
	КонецЕсли;

	ОбновитьСписки();
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОтветаНаСозданиеЗадач(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ИмяМакета = ДополнительныеПараметры.ИмяМакета;
	СоотДолжникЗадача = ДополнительныеПараметры.СоотДолжникЗадача;
	Этап = ДополнительныеПараметры.Этап;
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.ОК Тогда 
		ЗапуститьЗадачу(Неопределено, Этап, СоотДолжникЗадача);
	КонецЕсли;
	СоздатьЗапланированнуюОтправку(ИмяМакета, Этап, СоотДолжникЗадача);
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеФункцииНаСервере
&НаСервере
Процедура ПроверитьСоответствиеОтборов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	энргСхемыПИДОрганизацийСрезПоследних.Организация КАК Организация,
	|	энргСхемыПИДОрганизацийСрезПоследних.Район КАК Район,
	|	энргСхемыПИДОрганизацийСрезПоследних.МКД КАК МКД,
	|	энргСхемыПИДОрганизацийСрезПоследних.Абонент КАК Абонент,
	|	энргСхемыПИДОрганизацийСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.энргСхемыПИДОрганизаций.СрезПоследних(&ТекДата, ) КАК энргСхемыПИДОрганизацийСрезПоследних
	|ГДЕ
	|	энргСхемыПИДОрганизацийСрезПоследних.Схема = &Схема";
	
	Запрос.УстановитьПараметр("Схема", Объект.Схема);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если не Выборка.Район = Объект.Район Тогда 
			объект.Схема = Неопределено;
		КонецЕсли;
		Если не Выборка.Организация = Объект.Организация Тогда 
			объект.Схема = Неопределено;
		КонецЕсли;

		Если не Выборка.МКД = Объект.МКД Тогда 
			объект.Схема = Неопределено;
		КонецЕсли;
		Если не Выборка.Услуга = Объект.Услуга Тогда 
			объект.Схема = Неопределено;
		КонецЕсли;

		Если не Выборка.Абонент = Объект.Абонент Тогда 
			объект.Схема = Неопределено;
		КонецЕсли;

	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДляДолжников()
	ЗадачиПИД.Параметры.УстановитьЗначениеПараметра("ТекДата", КонецДня(Объект.Период));	
	
	//Должники.Параметры.УстановитьЗначениеПараметра("ТекДата", КонецДня(Объект.Период));
	
	//Должники.Параметры.УстановитьЗначениеПараметра("НачалоПериода", КонецДня(НачалоПериода));
	//Должники.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонецПериода));
	
	//Должники.Параметры.УстановитьЗначениеПараметра("Абонент", Абонент);
	//Должники.Параметры.УстановитьЗначениеПараметра("МКД", МКД);
	//Должники.Параметры.УстановитьЗначениеПараметра("Услуга", Услуга);
	
	//Должники.Параметры.УстановитьЗначениеПараметра("Задолженность",			  Объект.МинимальнаяЗадолженность);
	//Должники.Параметры.УстановитьЗначениеПараметра("КоличествоДнейПросрочки", Объект.КоличествоДней);
	//Должники.Параметры.УстановитьЗначениеПараметра("Организация",			  Объект.Организация);
	//Должники.Параметры.УстановитьЗначениеПараметра("Район",					  Объект.Район);
	//Должники.Параметры.УстановитьЗначениеПараметра("Ответственный",			  Объект.Ответственный);
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачиНаСервере(СписокСтрок, СоотДолжникЗадача = Неопределено)
		Исполнитель = Пользователи.ТекущийПользователь();
	Для каждого ТекСтрока Из СписокСтрок Цикл
		
		Должник = ТекСтрока.Абонент;
		ПараметрыОбъекта = Новый Структура("Абонент, МКД, Район, ЛицевойСчет, АдресОбъекта, Организация, Услуга", Должник);
		энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Должник, ПараметрыОбъекта);
		
		ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ТекСтрока);
		ПараметрыОбъекта.Вставить("СуммаЗадолженности",			ТекСтрока.Задолженность);
		ПараметрыОбъекта.Вставить("ПериодНачисления",			Объект.Период);
		ПараметрыОбъекта.Вставить("Схема",						ТекСтрока.Схема);
		ПараметрыОбъекта.Вставить("Ссылка",						Неопределено);
		ПараметрыОбъекта.Вставить("Исполнитель",				Исполнитель);
		ПараметрыОбъекта.Вставить("ПериодНачисления",			ТекСтрока.ПериодНачисления);
		
		Отказ = Ложь;
		НовЗадача = Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, ТекСтрока.Этап, ПараметрыОбъекта);
		Если ТипЗнч(СоотДолжникЗадача) = Тип("Соответствие") Тогда
			СоотДолжникЗадача.Вставить(ТекСтрока.ТекСтрока, НовЗадача);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСхемыПоУмолчанию(СоотОргСхема)

	Организации = Новый Массив;
	Для каждого ТекОрг Из СоотОргСхема Цикл
		Организации.Добавить(ТекОрг.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргСхемыПИДОрганизацийСрезПоследних.Организация КАК Организация,
		|	энргСхемыПИДОрганизацийСрезПоследних.Схема КАК Схема
		|ИЗ
		|	РегистрСведений.энргСхемыПИДОрганизаций.СрезПоследних(, Организация В (&Организации)) КАК энргСхемыПИДОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Организации", Организации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоотОргСхема[Выборка.Организация] = Выборка.Схема;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНачальныеЭтапыСхем(СоотСхемаЭтап)

	Схемы = Новый Массив;
	Для каждого ЭлемСоот Из СоотСхемаЭтап Цикл
		Схемы.Добавить(ЭлемСоот.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	энргСхемыПИДЭтапы.Ссылка КАК Схема,
		|	энргСхемыПИДЭтапы.НомерСтроки КАК НомерСтроки,
		|	энргСхемыПИДЭтапы.Необязательный КАК Необязательный
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|ГДЕ
		|	энргСхемыПИДЭтапы.Ссылка В(&Схемы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	Схема";
	
	Запрос.УстановитьПараметр("Схемы", Схемы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСхема = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСхема.Следующий() Цикл
		ПослЭтап = Ложь;
		Выборка  = ВыборкаСхема.Выбрать();
		
		СписокЭтапов  = Новый Массив;
	
		Пока Выборка.Следующий() Цикл
			ПослЭтап = Не Выборка.Необязательный;
			СписокЭтапов.Добавить(Выборка.Этап);
			
			Если ПослЭтап Тогда 
				Прервать;				
			КонецЕсли;
		КонецЦикла;
		
		Если СписокЭтапов.Количество() = 1 Тогда
			СоотСхемаЭтап[ВыборкаСхема.Схема] = СписокЭтапов[0];
		ИначеЕсли СписокЭтапов.Количество() = 0 Тогда
			СоотСхемаЭтап[ВыборкаСхема.Схема] = Неопределено;
		Иначе
			СоотСхемаЭтап[ВыборкаСхема.Схема] = СписокЭтапов;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ЗаполнитьДерево();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево()
	ДолжникиНов.ПолучитьЭлементы().Очистить();
	
	Отборы = Новый Структура("Организация, Район, МКД, Абонент, Задолженность, КоличествоДнейПросрочки, Услуга, Ответственный, Этап, Поставщик, НаселенныйПункт, Улица");
	ЗаполнитьЗначенияСвойств(Отборы, Объект);
	Отборы.Вставить("ТекДата", КонецДня(объект.Период));

	Запрос = Обработки.энргРаботаСДолжниками.ПолучитьЗапрос(Отборы, Не ОтобразитьЗадолженностьПИР); 
	
	РезультатДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВДанныеФормы(РезультатДерево, ДолжникиНов);
КонецПроцедуры

&НаКлиенте
Процедура ДолжникиНовПриАктивизацииЯчейки(Элемент)
	ТекСтрока = Элементы.ДолжникиНов.ТекущиеДанные;
	УстановитьПараметрыЗадачиПИД(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ДолжникиНовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		ТекДанные = Элементы.ДолжникиНов.ДанныеСтроки(ВыбраннаяСтрока);
		Если (Поле = Элементы.ДолжникиНовЭтап Или Поле = Элементы.ДолжникиНовОтветственный 
				Или Поле = Элементы.ДолжникиНовКолДнейСледЭтапа Или Поле = Элементы.ДолжникиНовЗадача) 
					И ЗначениеЗаполнено(ТекДанные.Задача) И ЗначениеЗаполнено(ТекДанные.КоличествоЗадач < 2)Тогда
			ПарамФормы = Новый Структура("Ключ", ТекДанные.Задача);
			ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли Поле = Элементы.ДолжникиНовАбонент Тогда 
			ПарамФормы = Новый Структура("Ключ", ТекДанные.Абонент);
			ОткрытьФорму("Справочник.энргАбоненты.ФормаОбъекта", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)

	ПеренапраленныеЗадачи.Параметры.УстановитьЗначениеПараметра("НовыйИсполнитель", Исполнитель);	

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПодчиненныхПриИзменении(Элемент)
	ЗадачиМне.Параметры.УстановитьЗначениеПараметра("ЗадачиПодчиненных", ЗадачиПодчиненных);
КонецПроцедуры

&НаКлиенте
Процедура СрокИсполненияПриИзменении(Элемент)
	ПеренапраленныеЗадачи.Параметры.УстановитьЗначениеПараметра("ПланируемаяДатаВыполнения", СрокИсполнения);	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ПеренапраленныеЗадачи.Параметры.УстановитьЗначениеПараметра("ПринятоВРаботу", ПринятоВРаботу);	
КонецПроцедуры

&НаКлиенте
Процедура ДолжникиНовПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.ДолжникиНов.ТекущиеДанные;
	УстановитьПараметрыЗадачиПИД(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренапраленныеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элементы.ЗадачиМне.ДанныеСтроки(ВыбраннаяСтрока).Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиМнеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элементы.ЗадачиМне.ДанныеСтроки(ВыбраннаяСтрока).Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыПеренаправления(Задача)

	Возврат Задачи.энргЗадачаПИД.ПолучитьПараметрыФормыПеренаправления(Задача);
КонецФункции

&НаКлиенте
Процедура СменаИсполнителя(ПарамВыбора, ДополнительныеПараметры) Экспорт
	
	Если ПарамВыбора <> Неопределено Тогда
		ПодтвердитьПеренаправлениеЗадачи(ДополнительныеПараметры.Задача, ПарамВыбора, Истина);
		Элементы.ПеренапраленныеЗадачи.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НазначениеИсполнителя(ПарамВыбора, ДополнительныеПараметры) Экспорт
	
	Если ПарамВыбора <> Неопределено Тогда
		ПодтвердитьПеренаправлениеЗадачи(ДополнительныеПараметры.Задача, ПарамВыбора, Ложь);
		
		ОбновитьСписки();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодтвердитьПеренаправлениеЗадачи(Задача, ПарамПерен, ПодтвердитьПеренаправление)

	Задачи.энргЗадачаПИД.ПодтвердитьПеренаправлениеЗадачи(Задача, ПарамПерен, ПодтвердитьПеренаправление);
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьЗадачи(Команда)
	ВыделенныеСтроки = Элементы.ЗадачиМне.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() <= 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выделить более одной задачи.");
		Возврат;
	КонецЕсли;
	
	ТекАбонент  = Неопределено;
	СписокЗадач = Новый СписокЗначений;
	Для каждого ТекСтрока Из Элементы.ЗадачиМне.ВыделенныеСтроки Цикл
		ТекДанные = Элементы.ЗадачиМне.ДанныеСтроки(ТекСтрока);
		СписокЗадач.Добавить(ТекДанные.Ссылка);
		
		Если ТекАбонент = Неопределено Тогда
			
			ТекАбонент = ТекДанные.Абонент;
			
		ИначеЕсли ТекАбонент <> ТекДанные.Абонент Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Задачи должны быть от одного потребителя.");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	РезультатВыбора = Неопределено;

	ОписОпов = Новый ОписаниеОповещения("ОбработкаВыбораЗадачиДляОбъединения", ЭтотОбъект, Новый Структура("СписокЗадач", СписокЗадач));
	
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокЗадач;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", 	НастройкиКомпоновки);
	ПараметрыВыбора.Вставить("РежимВыбора",				Истина);
	ПараметрыВыбора.Вставить("МножественныйВыбор",		Ложь);

	ОткрытьФорму("Задача.энргЗадачаПИД.Форма.ФормаВыборИзСпискаЗадач", ПараметрыВыбора, ЭтаФорма,,,, ОписОпов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗадачиДляОбъединения(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ОбъединитьЗадачиНаСервере(ДополнительныеПараметры.СписокЗадач, ВыбранныйЭлемент);
		ОбновитьСписки();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбъединитьЗадачиНаСервере(СписокЗадач, Задача)

	Задачи.энргЗадачаПИД.ОбъединитьЗадачиНаСервере(СписокЗадач, Задача);
КонецПроцедуры

#КонецОбласти

#Область РаботаСДокументамиКСогласованию

&НаКлиенте
Процедура ДокументыКСогласованиюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКСогласованиюПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры  

#Область КомандыДокументаКСогласованию

&НаКлиенте
Процедура СогласоватьСобытие(Команда)
	ТекСтрока = Элементы.ДокументыКСогласованию.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		ПоказатьПредупреждение(, "Выберите событие, которое необходимо согласовать");
		Возврат;
	КонецЕсли;
	Если СобытиеСогласовано(ТекСтрока) Тогда 
		ПоказатьПредупреждение(, "Событие уже согласовано");
		Возврат;
	КонецЕсли;
	
	
	ДанныеДляЗаписи = Новый Структура("Организация,Район,ДокРегистратор");
	ЗаполнитьЗначенияСвойств(ДанныеДляЗаписи, ТекСтрока);	
	
	Результат 		= СогласоватьСобытиеНаСервере(ДанныеДляЗаписи);
	ПоказатьПредупреждение(, Результат);
КонецПроцедуры

&НаСервере
Функция СогласоватьСобытиеНаСервере(ДанныеДляЗаписи)
	ТекстУспеха				= "Статус успешно зарегистрирован";	
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= ДанныеДляЗаписи.Организация;
	ОписаниеОжидаемыхДанных.Район 			= ДанныеДляЗаписи.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= ДанныеДляЗаписи.ДокРегистратор;
	ОписаниеОжидаемыхДанных.Исполнитель 	= Пользователи.ТекущийПользователь();
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.Согласовано;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		ОбновитьДокументыКСогласованиюНаСервере();
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ВернутьНаДоработкуСобытие(Команда)
	ТекСтрока = Элементы.ДокументыКСогласованию.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		ПоказатьПредупреждение(, "Выберите событие, которое необходимо согласовать");
		Возврат;
	КонецЕсли; 	
	Если СобытиеСогласовано(ТекСтрока) Тогда 
		ПоказатьПредупреждение(, "Событие уже согласовано");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатЗапросаНаДоработку", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.энргСтатусСогласованияСобытий.Форма.ФормаВернутьНаДоработку",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗапросаНаДоработку(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	          	
	ТекСтрока 				= Элементы.ДокументыКСогласованию.ТекущиеДанные;
	ДанныеДляЗаписи 		= Новый Структура("Организация,Район,ДокРегистратор");
	ЗаполнитьЗначенияСвойств(ДанныеДляЗаписи, ТекСтрока); 	
	РезультатСменыСтатуса 	= ВернутьНаДоработкуСобытиеНаСервере(ДанныеДляЗаписи, Результат);
	ПоказатьПредупреждение(, РезультатСменыСтатуса);
КонецПроцедуры

&НаСервере
Функция ВернутьНаДоработкуСобытиеНаСервере(ДанныеДляЗаписи, СтруктураОтвета)
	ТекстУспеха				= "Статус успешно зарегистрирован";	
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= ДанныеДляЗаписи.Организация;
	ОписаниеОжидаемыхДанных.Район 			= ДанныеДляЗаписи.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= ДанныеДляЗаписи.ДокРегистратор;
	ОписаниеОжидаемыхДанных.Исполнитель 	= СтруктураОтвета.Исполнитель;
	ОписаниеОжидаемыхДанных.Комментарий 	= СтруктураОтвета.Комментарий;
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.ТребуетДоработки;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		ОбновитьДокументыКСогласованиюНаСервере();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбновитьДокументыКСогласованию(Команда)
	ОбновитьДокументыКСогласованиюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументыКСогласованиюНаСервере()
	ДокументыКСогласованию.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтатусСогласованияСобытийСрезПоследних.Организация КАК Организация,
		|	энргСтатусСогласованияСобытийСрезПоследних.Район КАК Район,
		|	энргСтатусСогласованияСобытийСрезПоследних.ДокРегистратор КАК ДокРегистратор,
		|	энргСтатусСогласованияСобытийСрезПоследних.Статус КАК Статус,
		|	энргСтатусСогласованияСобытийСрезПоследних.Исполнитель КАК Исполнитель,
		|	энргСтатусСогласованияСобытийСрезПоследних.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ СтатусыСобытий
		|ИЗ
		|	РегистрСведений.энргСтатусСогласованияСобытий.СрезПоследних(&Период, ) КАК энргСтатусСогласованияСобытийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыСобытий.Организация КАК Организация,
		|	СтатусыСобытий.Район КАК Район,
		|	СтатусыСобытий.ДокРегистратор КАК ДокРегистратор,
		|	СтатусыСобытий.Статус КАК Статус,
		|	СтатусыСобытий.Комментарий КАК Комментарий
		|ИЗ
		|	СтатусыСобытий КАК СтатусыСобытий
		|ГДЕ
		|	СтатусыСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.энргСтатусыСогласованияСобытий.Согласовано)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусыСобытий.Организация,
		|	СтатусыСобытий.Район,
		|	СтатусыСобытий.ДокРегистратор,
		|	СтатусыСобытий.Статус,
		|	СтатусыСобытий.Комментарий
		|ИЗ
		|	СтатусыСобытий КАК СтатусыСобытий
		|ГДЕ
		|	НЕ СтатусыСобытий.Статус = ЗНАЧЕНИЕ(Перечисление.энргСтатусыСогласованияСобытий.Согласовано)
		|	И СтатусыСобытий.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	Запрос.УстановитьПараметр("Исполнитель"	, Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НСтрока = ДокументыКСогласованию.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла; 	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция СобытиеСогласовано(ТекСтрока)
	Возврат ТекСтрока.Статус = ПредопределенноеЗначение("Перечисление.энргСтатусыСогласованияСобытий.Согласовано");
КонецФункции

&НаКлиенте
Процедура ПечатьКвитанций(Команда)
	
	СписокАбонентов = Новый Массив;
	
	Для каждого ТекСтрока Из Элементы.ДолжникиНов.ВыделенныеСтроки Цикл
		ТекДанные = Элементы.ДолжникиНов.ДанныеСтроки(ТекСтрока);
		
		Если СписокАбонентов.Найти(ТекДанные.Абонент) = Неопределено Тогда
			СписокАбонентов.Добавить(ТекДанные.Абонент);	
		КонецЕсли;
	КонецЦикла;
	
	
	ДанныеДляЗаполнения = Новый Структура("НачалоПериода, КонецПериода, Организация, Район",
	НачалоПериода, КонецПериода,  Объект.Организация, Объект.Район); 		
	
	ДанныеДляЗаполнения.Вставить("ФормироватьМакетЕПД"	, Истина);
	ДанныеДляЗаполнения.Вставить("СписокАбонентов"		, СписокАбонентов);
	
	ПараметрыФормы 		= Новый Структура("ДанныеДляЗаполнения", ДанныеДляЗаполнения);
	//ОткрытьФорму("Обработка.рксПечатьКвитанцийАбонентов.Форма.ФормаСозданияЕПД", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
	ОткрытьФорму("Обработка.энргПечатьКвитанций.Форма.Форма", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры

#КонецОбласти

#КонецОбласти