#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ТекстСрезПоследних(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	РегистрыСведений.энргУслугиТочекУчетаМКД.УслугиДействующихТочек(Схема,ПараметрыОтбора,"УслугиДействующихТочек");
	
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСрезПоследних());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	ПараметрПериод 						= Параметры[0];
	ДоступныеПараметры					= "Организация,Район,МКД,ВидПлощади,Услуга";
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	Иначе 
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;	
	
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Отбор, "энргЗначениеПлощадейМКДСрезПоследних", ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСрезПоследних()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргЗначениеПлощадейМКДСрезПоследних.Организация КАК Организация,
	|	энргЗначениеПлощадейМКДСрезПоследних.Район КАК Район,
	|	энргЗначениеПлощадейМКДСрезПоследних.МКД КАК МКД,
	|	энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади КАК ВидПлощади,
	|	энргЗначениеПлощадейМКДСрезПоследних.Услуга КАК Услуга,
	|	энргЗначениеПлощадейМКДСрезПоследних.Площадь КАК Площадь
	|ИЗ
	|	РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
	|			,
	|			(Организация, Район, МКД, Услуга) В
	|				(ВЫБРАТЬ
	|					УслугиДействующихТочек.Организация КАК Организация,
	|					УслугиДействующихТочек.Район КАК Район,
	|					УслугиДействующихТочек.МКД КАК МКД,
	|					УслугиДействующихТочек.Услуга КАК Услуга
	|				ИЗ
	|					УслугиДействующихТочек КАК УслугиДействующихТочек)) КАК энргЗначениеПлощадейМКДСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли