#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестМассовоеИзменениеНагрузок(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьДокументыНаСервере()
	ТЗнагрузок = Нагрузки.Выгрузить(,"ОбъектРасчета,Услуга,НагрузкаДо,НагрузкаПосле");
	ТЗнагрузок.Сортировать("ОбъектРасчета");
	МассивСозданныхДокументов = Обработки.бестМассовоеИзменениеНагрузок.СоздатьДокументыУстановитьНагрузкуПоУслугам(ТЗнагрузок,Новый Структура("Дата,Организация,Район",Период,Организация,Район));
	СозданныеДокументы.ЗагрузитьЗначения(МассивСозданныхДокументов);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Нагрузки.Очистить();
	МВТ = Новый МенеджерВременныхТаблиц;
	бестРаботаСТочкамиУчетаНПСервер.ПолучитьДействующиеТочкиУчета(Период,Организация,Район,Услуга,,ОбъектРасчета,,Договор,ЛС,МВТ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Итог.ОбъектРасчета КАК ОбъектРасчета,
		|	Итог.Услуга КАК Услуга
		|ПОМЕСТИТЬ ИтогУслугаОбъект
		|ИЗ
		|	Итог КАК Итог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогУслугаОбъект.ОбъектРасчета КАК ОбъектРасчета,
		|	ИтогУслугаОбъект.Услуга КАК Услуга,
		|	ЕСТЬNULL(бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка, 0) КАК НагрузкаДо,
		|	бестСезонныеНагрузкиПоУслугамСрезПоследних.Нагрузка КАК НагрузкаПосле
		|ИЗ
		|	ИтогУслугаОбъект КАК ИтогУслугаОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНагрузкаПоУслугамНП.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район) КАК бестНагрузкаПоУслугамНПСрезПоследних
		|		ПО ИтогУслугаОбъект.ОбъектРасчета = бестНагрузкаПоУслугамНПСрезПоследних.ОбъектРасчета
		|			И ИтогУслугаОбъект.Услуга = бестНагрузкаПоУслугамНПСрезПоследних.Услуга
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСезонныеНагрузкиПоУслугам.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И Сезонность = &Сезонность) КАК бестСезонныеНагрузкиПоУслугамСрезПоследних
		|		ПО ИтогУслугаОбъект.ОбъектРасчета = бестСезонныеНагрузкиПоУслугамСрезПоследних.ОбъектРасчета
		|			И ИтогУслугаОбъект.Услуга = бестСезонныеНагрузкиПоУслугамСрезПоследних.Услуга";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Сезонность", Сезонность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Нагрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
