#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ЭтоНовый() Или  НЕ Ссылка.Проведен Тогда
		ПроверитьНаличиеСуществующихЗаписей(Отказ);	
	КонецЕсли;
	ДанныеШапки = ДанныеШапки();
	
	Если ЗначениеЗаполнено(СреднемесячнаяТемпература) Тогда
		бестПроведениеСерверНП.ВыполнитьДвижение(ДанныеШапки, Движения.бестСреднемесячнаяТемператураНаружногоВоздуха);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",						?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",						Район);
	ДанныеШапки.Вставить("Организация",					Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",			Дата);
	ДанныеШапки.Вставить("ПериодНачисления",			ПериодНачисления);
	ДанныеШапки.Вставить("СреднемесячнаяТемпература",	СреднемесячнаяТемпература);
	ДанныеШапки.Вставить("РасчетныйМесяц",			    НачалоМесяца(РасчетныйМесяц));
	ДанныеШапки.Вставить("ВидПериода",			   		ВидПериода);

	Возврат ДанныеШапки; 
КонецФункции

Процедура ПроверитьНаличиеСуществующихЗаписей(Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 				?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия,Дата));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ВидПериода", 		ВидПериода);
	Запрос.УстановитьПараметр("РасчетныйМесяц", 	НачалоМесяца(РасчетныйМесяц));
	Запрос.Текст = "ВЫБРАТЬ
	|	бестСреднемесячнаяТемператураНаружногоВоздуха.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха КАК бестСреднемесячнаяТемператураНаружногоВоздуха
	|ГДЕ
	|	бестСреднемесячнаяТемператураНаружногоВоздуха.Период <= &Дата
	|			И бестСреднемесячнаяТемператураНаружногоВоздуха.Организация = &Организация
	|			И бестСреднемесячнаяТемператураНаружногоВоздуха.Район = &Район
	|			И бестСреднемесячнаяТемператураНаружногоВоздуха.РасчетныйМесяц = &РасчетныйМесяц
	|			И бестСреднемесячнаяТемператураНаружногоВоздуха.ВидПериода = &ВидПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСреднемесячнаяТемператураНаружногоВоздуха.Регистратор";
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные по введенным организации, району, виду периода и расчетному месяцу уже введены! Документ " + Выборка.Регистратор);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли