#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьВходнымиДанными();	
	РаботаСУстановкойСвойствЭлементовФормы();
	НастроитьВидимостьЭлементов();
КонецПроцедуры

#Конецобласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	
	Ошибки = Новый Массив;
	ПроверитьПередЗакрытием(Ошибки);
	Если НЕ Ошибки.Количество() = 0 Тогда
		//ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрСоединить(Ошибки, Символы.ПС));
		Возврат;
	КонецЕсли;
	
	Закрыть(ПолучитьРезультат());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат() 
	
	КлючиДанных 		= ПолучитьКлючиЗаполнения();
	ДанныеЗакрытия		= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);
	
	ЗаполнитьЗначенияСвойств(ДанныеЗакрытия, ЭтаФорма, КлючиДанных.Реквизиты);	
	ЗаписатьПараметрыТочекИПриборовУчета();
	
	ДанныеЗакрытия.Измерители 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(Измерители.Выгрузить());
	ДанныеЗакрытия.ПоказанияПриборовУчета 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(ПоказанияПриборовУчета.Выгрузить());
	ДанныеЗакрытия.ШкалыПриборовУчета 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(Шкалы.Выгрузить());
	ДанныеЗакрытия.ШкалыИзмерителей 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(ШкалыИзмерителей.Выгрузить());
	ДанныеЗакрытия.НомераПломб 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(НомераПломб.Выгрузить()); 
	ДанныеЗакрытия.ФормулыРасчетаУслуг 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(ФормулыРасчетаУслуг.Выгрузить()); 
	
	Возврат ДанныеЗакрытия;
КонецФункции

&НаСервере
Процедура ПроверитьПередЗакрытием(Ошибки)
	
	Ошибки = Новый Массив;
	КолвоНЕВспомОборудования = Измерители.НайтиСтроки(Новый Структура("ВспомогательноеОборудование", Ложь)).Количество();
	Если ЗаменаВспомогательныхПУ Тогда 
		Возврат; 
	ИначеЕсли Измерители.Количество() > 0 И КолвоНЕВспомОборудования = 0 Тогда
		Ошибки.Добавить("Не указан прибор учета");
	ИначеЕсли КолвоНЕВспомОборудования > 1 Тогда
		Ошибки.Добавить("Приборов учетов указано больше, чем один");
	КонецЕсли;
	
	ВалидироватьТаблицы(Ошибки);
	
КонецПроцедуры // ПроверитьПередЗакрытием(Ошибки)()

&НаСервере
Процедура ВалидироватьТаблицы(Ошибки)
	
	ЕстьОшибки = Ложь;
	Шаблон = "Измерители[%1].%2";
	ОтборПломб = Новый Структура("IDСтрокиИзмерителя", Неопределено);
	ОтборШкал = Новый Структура("IDСтроки", Неопределено);
	Индекс = 0;
	Для Каждого СтрокаНабора из Измерители Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ЗаводскойНомер) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните поле Заводской номер",, СтрШаблон(Шаблон, Индекс, "ЗаводскойНомер"));
			//Ошибки.Добавить(НСтр("ru = 'Заполните поле Заводской номер'"));
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ТипПрибораУчета) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните поле Тип средства измерения",, СтрШаблон(Шаблон, Индекс, "ТипПрибораУчета"));
			//Ошибки.Добавить(НСтр("ru = 'Заполните поле Тип средства измерения'"));
			ЕстьОшибки = Истина;
		КонецЕсли;		
		
		Индекс = Индекс + 1;
		//ОбщегоНазначения.СообщитьПользователю(
	КонецЦикла;	
	
	ВалидироватьПломбы(СтрокаНабора, ОтборПломб, Ошибки, ЕстьОшибки);
	ВалидироватьШкалы(Ошибки, ЕстьОшибки);
	
	Если ЕстьОшибки Тогда 
		Ошибки.Добавить(НСтр("ru = 'Заполните поля табличных частей'"));
	КонецЕсли;  	
	
КонецПроцедуры

&НаСервере
Процедура ВалидироватьПломбы(СтрокаПрибора, ОтборСтрок, Ошибки, ЕстьОшибки)
	
	//ОтборСтрок.IDСтрокиИзмерителя = СтрокаПрибора.IDСтроки;
	//НаборСтрок = НомераПломб.НайтиСтроки(ОтборСтрок);
	Шаблон = "НомераПломб[%1].%2";
	Индекс = 0;
	Для Каждого СтрокаНабора из НомераПломб Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.НомерПломбы) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните поле Номер пломбы'",, СтрШаблон(Шаблон, Индекс, "НомерПломбы"));
			ЕстьОшибки = Истина;
			//Ошибки.Добавить(НСтр("ru = 'Заполните поле Номер пломбы'"));
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ВидПломбы) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните поле Вид пломбы",, СтрШаблон(Шаблон, Индекс, "ВидПломбы"));
			ЕстьОшибки = Истина;
			//Ошибки.Добавить(НСтр("ru = 'Заполните поле Вид пломбы'"));
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.КлючСтроки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните поле Место установки пломбы",, СтрШаблон(Шаблон, Индекс, "КлючСтроки"));
			ЕстьОшибки = Истина;
			//Ошибки.Добавить(НСтр("ru = 'Заполните поле Место установки пломбы'"));
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ВалидироватьШкалы(Ошибки, ЕстьОшибки)
	
	Шаблон = "Шкалы[%1].%2";
	Индекс = 0;
	
	Для Каждого СтрокаНабора из Шкалы Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.Шкала) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните поле Шкала",, СтрШаблон(Шаблон, Индекс, "Шкала"));
			ЕстьОшибки = Истина;
			//Ошибки.Добавить(НСтр("ru = 'Заполните поле Шкала'"));
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ВидДифференцированности) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните поле Вид дифференцированности",, СтрШаблон(Шаблон, Индекс, "ВидДифференцированности"));
			ЕстьОшибки = Истина;
			//Ошибки.Добавить(НСтр("ru = 'Заполните поле Вид дифференцированности'"));
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипУзлаУчетаПриИзменении(Элемент)
	ЗаполнитьВидКанальности();
	ОчиститьВсеТаблицы();
	Если Замена Тогда
		ЗаполнитьИзмерителиЗамена();
	Иначе
		ЗаполнитьИзмерители();
	КонецЕсли;
	ЗаполнитьШкалы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмерители()
	
	РезультатЗапроса 	= Справочники.энргТипыУзловУчета.ПолучитьСоставУзлаИШкалы(ТипУзлаУчета);
	Выборка 			= РезультатЗапроса.Выбрать();
	ТекIDСтрокиСостава 	= Неопределено;
	IDСтроки			= Неопределено;			
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ТекIDСтрокиСостава = Выборка.IDСтрокиСостава Тогда
			НоваяСтрока = Измерители.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			//НоваяСтрока.Родитель = Выборка.ТипИзмерителя;
			IDСтроки				= новый УникальныйИдентификатор;
			НоваяСтрока.IDСтроки 	= IDСтроки;
		КонецЕсли;		
		
		Если НЕ Строка(Выборка.IDСтрокиШкалыИзмерителя) = "" Тогда
			НоваяСтрокаШкал 			= ШкалыИзмерителей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШкал, Выборка);
			НоваяСтрокаШкал.IDСтроки 	= IDСтроки;
		КонецЕсли;
		
		
		ТекIDСтрокиСостава = Выборка.IDСтрокиСостава;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмерителиЗамена()
	
	Если ВызывающаяПодсистема = "ЮЛ" Тогда
		ЗаполнитьИзмерителиЗаменаЮЛ();
		Возврат;
	КонецЕсли;	
	
	РезультатЗапроса 	= Справочники.энргТипыУзловУчета.ПолучитьСоставУзлаИШкалы(ТипУзлаУчета);
	Выборка 			= РезультатЗапроса.Выбрать();
	ТекIDСтрокиСостава 	= Неопределено;
	IDСтроки			= Неопределено;			
	Пока Выборка.Следующий() Цикл
		
		Если ВызывающаяПодсистема <> "МКД" Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ТипИзмерителя", Выборка.ТипИзмерителя);
			мНайденныеСтроки = Измерители.НайтиСтроки(ПараметрыОтбора);
			Если мНайденныеСтроки.Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТекIDСтрокиСостава = Выборка.IDСтрокиСостава Тогда
			НоваяСтрока = Измерители.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			IDСтроки				= новый УникальныйИдентификатор;
			НоваяСтрока.IDСтроки 	= IDСтроки;
			НоваяСтрока.Ввод		= Истина;
		КонецЕсли;		
		
		Если НЕ Строка(Выборка.IDСтрокиШкалыИзмерителя) = "" Тогда
			НоваяСтрокаШкал 			= ШкалыИзмерителей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШкал, Выборка);
			НоваяСтрокаШкал.IDСтроки 	= IDСтроки;
		КонецЕсли;		
		
		ТекIDСтрокиСостава = Выборка.IDСтрокиСостава;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмерителиЗаменаЮЛ()
		
	РезультатЗапроса 	= Справочники.энргТипыУзловУчета.ПолучитьСоставУзлаИШкалы(ТипУзлаУчета); 
	Выборка 			= РезультатЗапроса.Выбрать();
	ТекIDСтрокиСостава 	= Неопределено;
	IDСтроки			= Неопределено;
	
	СоставУзла = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка Из Измерители Цикл
		
		Если ЗначениеЗаполнено(Строка.IDСтрокиСостава) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ТипИзмерителя", Строка.ТипИзмерителя);
		Если ЗаменаВспомогательныхПУ И Строка.ВспомогательноеОборудование Тогда
			ПараметрыОтбора.Вставить("Фаза"							, Строка.Фаза);
			ПараметрыОтбора.Вставить("ВспомогательноеОборудование"	, Строка.ВспомогательноеОборудование);
			ПараметрыОтбора.Вставить("РасположениеИзмерителя"		, Строка.РасположениеИзмерителя);
		КонецЕсли;
		
		мСтрокиПоТипуИзмерителя = СоставУзла.НайтиСтроки(ПараметрыОтбора);		
		Если ЗначениеЗаполнено(мСтрокиПоТипуИзмерителя) Тогда
			Строка.IDСтрокиСостава = мСтрокиПоТипуИзмерителя[0].IDСтрокиСостава;  
			СоставУзла.Удалить(мСтрокиПоТипуИзмерителя[0]);
		КонецЕсли;   	
	КонецЦикла;


	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ТипИзмерителя"	, Выборка.ТипИзмерителя);
		ПараметрыОтбора.Вставить("IDСтрокиСостава"	, Выборка.IDСтрокиСостава);
		мНайденныеСтроки = Измерители.НайтиСтроки(ПараметрыОтбора);
		Если мНайденныеСтроки.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекIDСтрокиСостава = Выборка.IDСтрокиСостава Тогда
			НоваяСтрока = Измерители.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			IDСтроки				= новый УникальныйИдентификатор;
			НоваяСтрока.IDСтроки 	= IDСтроки;
			НоваяСтрока.Ввод		= Истина;
		КонецЕсли;		
		
		Если НЕ Строка(Выборка.IDСтрокиШкалыИзмерителя) = "" Тогда
			НоваяСтрокаШкал 			= ШкалыИзмерителей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШкал, Выборка);
			НоваяСтрокаШкал.IDСтроки 	= IDСтроки;
		КонецЕсли;
				
		ТекIDСтрокиСостава = Выборка.IDСтрокиСостава;
		
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ВидКанальностиПриИзменении(Элемент)
	ЗаполнитьШкалы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти 

#Область РаботаСТаблицейИзмерители


#Область СобытияТаблицыИзмерители

&НаКлиенте
Процедура ИзмерителиПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Измерители.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(Элементы.НомераПломб	, "IDСтрокиИзмерителя"			, ТекущиеДанные.IDСтроки); 
	//энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчета	, "IDСтроки"	, ТекущиеДанные.IDСтроки); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоказанияПриборовУчета1ТекущиеПоказания"	, "Видимость"		, НЕ ТекущиеДанные.РегистрируетОбъем);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоказанияПриборовУчета"						, "Видимость"		, НЕ ТекущиеДанные.ВспомогательноеОборудование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИзмерителиФаза"								, "ТолькоПросмотр"	, ТекущиеДанные.ВспомогательноеОборудование);//?(ЗначениеЗаполнено(ТекущиеДанные.Фаза), Истина, Ложь));
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Измерители"							 		, "ТолькоПросмотр"	, Не ТекущиеДанные.ВспомогательноеОборудование И ЗаменаВспомогательныхПУ);
КонецПроцедуры

&НаКлиенте
Процедура ИзмерителиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.IDСтроки = Новый УникальныйИдентификатор;
		Элемент.ТекущиеДанные.Ввод = Замена;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СобытияЭлементовТаблицыИзмерители

&НаКлиенте
Процедура ИзмерителиЗаводскойНомерПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Измерители.ТекущиеДанные;
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ИзмерителиТипПрибораУчетаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Измерители.ТекущиеДанные;
	ЗаполнитьКоэффициентПУПоДаннымТрансформаторов();
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ИзмерителиДатаПоверкиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Измерители.ТекущиеДанные;
	ЗаполнитьКоэфициент(ТекущиеДанные);
	
	МПИ = ПолучитьМежповерочныйИнтервалПоТипуПУ(ТекущиеДанные.ТипПрибораУчета);
	Если МПИ <> 0 Тогда 
		ТекущиеДанные.ДатаОчереднойПоверки = ДобавитьМесяц(ТекущиеДанные.ДатаПоверкиСчетчика, МПИ * 12);
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#КонецОбласти

#Область РаботаСТаблицейНомераПломб

#Область СобытияТаблицыНомераПломб

&НаКлиенте
Процедура НомераПломбПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные 	= Элементы.Измерители.ТекущиеДанные;
	Отказ 			= ТекущиеДанные = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура НомераПломбПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 								= Элементы.Измерители.ТекущиеДанные;
		Элемент.ТекущиеДанные.IDСтрокиИзмерителя 	= ТекущиеДанные.IDСтроки; 			
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаСТаблицейШкалы

#Область СобытияТаблицыШкалы

&НаКлиенте
Процедура ШкалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ИспользоватьШкалыПриборовУчета И Шкалы.Количество() > 0 Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Шкалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(Элементы.ПоказанияПриборовУчета, "IDСтроки", ТекущиеДанные.IDСтроки);
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовТаблицыШкалы

&НаКлиенте
Процедура ПоказанияПриборовУчетаШкалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Шкалы.ТекущиеДанные;
	Если НЕ ИспользоватьТарифныеЗоны Тогда 
		ТекущиеДанные.ВидДифференцированности = ПредопределенноеЗначение("Справочник.энргВидыДифференцированности.Однотарифный");
	КонецЕсли;
	 
	ВидДифференцированности = ТекущиеДанные.ВидДифференцированности;
	Состав 					= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	
	ЗаполнитьТарифныеЗоны(Состав, ТекущиеДанные.IDСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаВидДифференцированностиПриИзменении(Элемент)	
	
	ТекущиеДанные 			= Элементы.Шкалы.ТекущиеДанные;
	Если НЕ ИспользоватьШкалыПриборовУчета Тогда 
		ТекущиеДанные.Шкала = ПредопределенноеЗначение("Справочник.энргШкалыПриборовУчета.Основная");
	КонецЕсли;
	ВидДифференцированности = ТекущиеДанные.ВидДифференцированности;
	Состав 					= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	
	ЗаполнитьТарифныеЗоны(Состав, ТекущиеДанные.IDСтроки);
	
	ПоказанияПриборовУчетаВидДифференцированностиПриИзмененииПереопределяемый(Элемент);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#Область РаботаСТаблицейФормулыРасчетаУслуг

&НаКлиенте
Процедура ФормулыРасчетаФормулаРасчетаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПриборыУчета 				= Новый Массив;
	
	Для Каждого Строка Из Измерители Цикл		
		Если Строка.ВспомогательноеОборудование Тогда
			Продолжить;
		КонецЕсли;
		мШкалы					= Новый Массив;
		
		Для Каждого СтрокаШкалы Из Шкалы Цикл
			мШкалы.Добавить(Новый Структура("Шкала,ВидПараметра",СтрокаШкалы.Шкала,СтрокаШкалы.ВидПараметра));
		КонецЦикла;
		ОписаниеПрибораУчета  	= Новый Структура;
		ОписаниеПрибораУчета.Вставить("ПриборУчета", 		Строка.ПриборУчета);
		ОписаниеПрибораУчета.Вставить("ЗаводскойНомер",		Строка.ЗаводскойНомер);
		ОписаниеПрибораУчета.Вставить("Шкалы", 				мШкалы);
		ПриборыУчета.Добавить(ОписаниеПрибораУчета);		
	КонецЦикла;   	
	Оповещение 					= Новый ОписаниеОповещения("НастройкаФормулыРасчетаЗавершение",ЭтаФорма,Новый Структура("КлючСтроки", Элементы.ФормулыРасчетаУслуг.ТекущаяСтрока));
	ТекущиеДанные 				= Элементы.ФормулыРасчетаУслуг.ТекущиеДанные; 
	мСписокУслуг 				= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(Услуга);
	ПараметрыФормы  			= Новый Структура;
	ПараметрыФормы.Вставить("ПредставлениеФормулы", 	ТекущиеДанные.ФормулаРасчетаПредставление);
	ПараметрыФормы.Вставить("Услуга", 					?(ТекущиеДанные = Неопределено,ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка"),ТекущиеДанные.Услуга));
	ПараметрыФормы.Вставить("УзелУчета", 				Истина);
	ПараметрыФормы.Вставить("СоставУслуги", 			мСписокУслуг);
	ПараметрыФормы.Вставить("ПриборыУчета", 			ПриборыУчета);
	ОткрытьФорму("ОбщаяФорма.энргНастройкаФормулРасчета", ПараметрыФормы,,,,,Оповещение);
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормулыРасчетаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатЗакрытия.Свойство("ПредставлениеФормулы") ИЛИ Не РезультатЗакрытия.Свойство("ФормулаРасчета") Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтроки  											= ДополнительныеПараметры.КлючСтроки;
	
	ТекущиеДанные  										= ФормулыРасчетаУслуг.НайтиПоИдентификатору(КлючСтроки);
	ТекущиеДанные.ФормулаРасчетаПредставление 			= РезультатЗакрытия.ПредставлениеФормулы;
	ТекущиеДанные.ФормулаРасчета 						= РезультатЗакрытия.ФормулаРасчета;
	  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамПрибораУчета()
	Возврат энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
КонецФункции

&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета()
	Возврат энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
КонецФункции

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета()
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Измерители Цикл
		ЗаписываемаяСтрока  								= Измерители[Сч];
		ЗаписываемаяСтрока.КоэффициентПУ 					= ?(ЗаписываемаяСтрока.ВспомогательноеОборудование, 1, КоэффициентПУ);
		ЗаписываемаяСтрока.ТипУзлаУчета 					= ?(ЗаписываемаяСтрока.ВспомогательноеОборудование, Справочники.энргТипыУзловУчета.ПустаяСсылка(), ТипУзлаУчета);
		ЗаписываемаяСтрока.ВидКанальности 					= ВидКанальности;
		
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл	
			Если КлючЗначение.Значение = "ВидКанальности" Тогда
				ДанныеПрибораУчета.ВидКанальности = ВидКанальности;
			Иначе
				ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];
			КонецЕсли;
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);		
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьВходнымиДанными()
	ВходныеПараметры = Параметры.ВходныеПараметры;
	
	Если ВходныеПараметры.Свойство("Замена") Тогда
		Замена = ВходныеПараметры.Замена;
	КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ЗаменаВспомогательныхПУ") Тогда
		ЗаменаВспомогательныхПУ = ВходныеПараметры.ЗаменаВспомогательныхПУ;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ВходныеПараметры, "ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета, Услуга, НаименованиеТочки, ВидКанальности, ТипУзлаУчета, ВидОперации, КоэффициентПУ, ВызывающаяПодсистема");
	
	Если Замена Тогда
		ВходныеПараметры.Измерители 			= Обработки.энргОперацияУзламиУчета.ОбработатьВходнуюТаблицу(ВходныеПараметры.Измерители,"Вывод",Ложь);
		ВходныеПараметры.ШкалыПриборовУчета 	= Обработки.энргОперацияУзламиУчета.ОбработатьВходнуюТаблицу(ВходныеПараметры.ШкалыПриборовУчета,"Вывод",Ложь);
		ВходныеПараметры.ПоказанияПриборовУчета = Обработки.энргОперацияУзламиУчета.ОбработатьВходнуюТаблицу(ВходныеПараметры.ПоказанияПриборовУчета,"Вывод",Ложь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВходныеПараметры.Измерители				, Измерители);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВходныеПараметры.ШкалыПриборовУчета		, Шкалы);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВходныеПараметры.ПоказанияПриборовУчета	, ПоказанияПриборовУчета);	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВходныеПараметры.ШкалыИзмерителей			, ШкалыИзмерителей);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВходныеПараметры.НомераПломб				, НомераПломб);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВходныеПараметры.ФормулыРасчетаУслуг		, ФормулыРасчетаУслуг);
	
	ЗаполнитьВидКанальности();
	Если Замена Тогда
		ЗаполнитьИзмерителиЗамена();
	Иначе
		Если ВходныеПараметры.Измерители.Количество() = 0 Тогда
			ЗаполнитьИзмерители(); 
		КонецЕсли;
	КонецЕсли;
	
	Если ВходныеПараметры.ШкалыПриборовУчета.Количество() = 0 Тогда
		ЗаполнитьШкалы(); 
	КонецЕсли; 	
	
	
	мСписокУслуг 					= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(Услуга);
	ТаблицаФормулыРасчетаУслуг 		= Элементы.ФормулыРасчетаУслуг;
	ПолеУслуга  					= ТаблицаФормулыРасчетаУслуг.ПодчиненныеЭлементы.Найти("ФормулыРасчетаУслуга");
	ПолеУслуга.СписокВыбора.ЗагрузитьЗначения(мСписокУслуг);
КонецПроцедуры

&НаСервере
Процедура РаботаСУстановкойСвойствЭлементовФормы()
	
	Если ВызывающаяПодсистема = "ЮЛ" Тогда
		ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ 	= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ");
		Элементы.СтраницаФормулыРасчетаУслуг.Видимость 	= Истина;
		Элементы.ИзмерителиФаза.Видимость 				= ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ;
		Элементы.ИзмерителиДоступКПУ.Видимость 			= ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ;
		Элементы.ИзмерителиГруппа2.Видимость 			= ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ;
		Элементы.ИзмерителиГруппа1.Видимость 			= ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ;
		Элементы.КоэффициентПУ.Видимость 				= ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ;		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШкалы()
	
	Шкалы.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ТипУзлаУчета) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса 	= Справочники.энргВидыКанальности.ПолучитьШкалыВидаКанальности(ВидКанальности);
	Выборка 			= РезультатЗапроса.Выбрать();
	//Если ВызывающаяПодсистема = "ЮЛ" Тогда
	//	ИспользоватьТарифныеЗоны = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	//Иначе
	//	ИспользоватьТарифныеЗоны = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	//КонецЕсли;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока 			= Шкалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		IDСтрокиШкалы 			= Новый УникальныйИдентификатор;;
		НоваяСтрока.IDСтроки 	= IDСтрокиШкалы;
		Если НЕ ИспользоватьТарифныеЗоны Тогда
			НоваяСтрокаПоказаний 				= ПоказанияПриборовУчета.Добавить();
			НоваяСтрокаПоказаний.ТарифнаяЗона 	= Справочники.энргТарифныеЗоны.БезРазбивки;
			НоваяСтрокаПоказаний.IDСтроки 		= IDСтрокиШкалы;
			НоваяСтрока.ВидДифференцированности = Справочники.энргВидыДифференцированности.Однотарифный;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТарифныеЗоны(Состав, IDСтроки)
	
	ТЗПоказанияПУ = ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
	
	Для Каждого Стр из ТЗПоказанияПУ Цикл
		
		ПоказанияПриборовУчета.Удалить(Стр);
	КонецЦикла;
	
	//ПоказанияПриборовУчета.Очистить();
	
	Для Каждого ТекТарифнаяЗона из Состав Цикл 
		НоваяСтрока = ПоказанияПриборовУчета.Добавить();
		НоваяСтрока.IDСтроки 		= IDСтроки;
		НоваяСтрока.ТарифнаяЗона 	= ТекТарифнаяЗона;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВсеТаблицы()
	Измерители.Очистить();
	ШкалыИзмерителей.Очистить();
	НомераПломб.Очистить();
	ПоказанияПриборовУчета.Очистить();
	ФормулыРасчетаУслуг.Очистить();
	Шкалы.Очистить();
КонецПроцедуры

&НаСервере
Функция  ПолучитьКлючиЗаполнения()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияСредствИзмерений();
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные)
	
	Если КоэффициентПУ = 0 тогда
		Если НЕ ТекущиеДанные.ВспомогательноеОборудование И (ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета)) Тогда
			КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидКанальности()
	
	ВидКанальности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипУзлаУчета, "ВидКанальности");
	
	Если НЕ ЗначениеЗаполнено(ВидКанальности) Тогда
		ВидКанальности = Справочники.энргВидыКанальности.Одноканальный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМежповерочныйИнтервалПоТипуПУ(ТипПрибораУчета)
	Возврат энргРаботаСприборамиУчетаСервер.ПолучитьМежповерочныйИнтервалПоТипуПУ(ТипПрибораУчета);
КонецФункции

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПоказанияПриборовУчетаВидДифференцированности",
		"Видимость",
		ИспользоватьТарифныеЗоны);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПоказанияПриборовУчета1ТарифнаяЗона",
		"Видимость",
		ИспользоватьТарифныеЗоны);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПоказанияПриборовУчетаШкала",
		"Видимость",
		ИспользоватьШкалыПриборовУчета);  
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Страницы",
		"Видимость",
		Не ЗаменаВспомогательныхПУ);  
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ТипУзлаУчета",
		"Доступность",
		Не ЗаменаВспомогательныхПУ);
				
	Если ВызывающаяПодсистема = "ЮЛ" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ТипУзлаУчета",
			"ТолькоПросмотр",
			Замена);			
	КонецЕсли;
			
	//Если ВызывающаяПодсистема = "ЮЛ" Тогда
	//	Элементы.ПоказанияПриборовУчетаШкала.Видимость = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	//Иначе
	//	Элементы.ПоказанияПриборовУчетаШкала.Видимость = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаВидДифференцированностиПриИзмененииПереопределяемый(Элемент)	
	// Переопределяется в расширении
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоэффициентПУПоДаннымТрансформаторов()
	
	МассивТиповПУ = Измерители.Выгрузить().ВыгрузитьКолонку("ТипПрибораУчета");
	КоэффициентПУ = Справочники.энргТипыПриборовУчета.РассчитатьКоэффициентПУПоДаннымТрансформаторов(МассивТиповПУ);	
	
КонецПроцедуры 

#КонецОбласти