#Область ПрограммныйИнтерфейс

// Выполнение регламетные операции НП.
//
// Параметры:
//	 Организация 			 - Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		 - Период начисления, по которому происходит восстановление последовательности.
//   Район					 - район, по которому происходит восстановление последовательности.
//
Процедура ВыполнитьРегламетныеОперацииНП(Организация,ПериодНачисления,Район) Экспорт  	
	//ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ОтложенныеДвиженияДокументовНачисления",ПериодНачисления,Район);
	//ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	//ОтложенныеДвиженияДокументовНачисления(ПериодНачисления,Район);
	//ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
	//
	ПараметрыЗаписиЖурнала  = ПараметрыЗаписиЖурнала("ВосстановитьПоследовательностьСтабильныеПериодыНП",ПериодНачисления,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,ПараметрыЗаписиЖурнала.Уровень,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтарт);
	ВосстановитьПоследовательностьСтабильныеПериодыНП(ПериодНачисления,Организация,Район);
	ЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурнала.ИмяОперации,УровеньЖурналаРегистрации.Информация,ПараметрыЗаписиЖурнала.Метаданные,ПараметрыЗаписиЖурнала.КомментарийСтоп);
КонецПроцедуры

// Восстановить Последовательность Стабильные Периоды юр. лиц.
//
// Параметры:
//	 Организация 			 - Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		 - Период начисления, по которому происходит восстановление последовательности.
//   Район					 - район, по которому происходит восстановление последовательности.
//   МКД					 - МКД, по которому происходит восстановление последовательности.
//	 ИсключаяОтдельностоящие - Исключая отдельностоящие, по которым происходит восстановление последовательности.
//	 мОбъектыРасчета 		 - мОбъектов расчета, по которым происходит восстановление последовательности.
//   МВТ			 		 - МенеджерВременныхТаблиц.
//	 Перерасчет 			 - Перерасчет, по которому происходит восстановление последовательности.
//
Процедура ВосстановитьПоследовательностьСтабильныеПериодыНП(Организация,ПериодНачисления,Район,МКД = Неопределено, ИсключаяОтдельностоящие = Ложь, мОбъектыРасчета = Неопределено, МВТ = Неопределено, Перерасчет = Ложь) Экспорт 
	РС = ПолучитьСтруктуруРегистров(Перерасчет);
	
	
	ГраницыПериода  								= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета								= ГраницыПериода.ЗавершениеОП;
	
	ОтборБлокировка = Новый Структура;
	ОтборБлокировка.Вставить("ПериодНачисления",ПериодНачисления);
	ОтборБлокировка.Вставить("Район",Район);
	ОтборБлокировка.Вставить("Организация",Организация);	
	ОтборБлокировка.Вставить("МКД",МКД);
	
	Отбор = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ОтборБлокировка));
	Отказ = Ложь; 	
	
	//НачатьТранзакцию();
	//УстановитьБлокировкуНабораЗаписейПоследовательностиПоРегистратору(Отбор, РС.РСбестСтабильныеПериодыНП, Отказ);
	
	Отбор.Вставить("НачалоПериодаРасчета",НачалоПериодаРасчета);
	Отбор.Вставить("КонецПериодаРасчета",КонецПериодаРасчета);
	
	Отбор.Вставить("ИсключаяОтдельностоящие",ИсключаяОтдельностоящие);
	Отбор.Вставить("мОбъектыРасчета",мОбъектыРасчета);
	
	Результат 									= РезультатЗапросаСтабильныеПериодыНП(Отбор, МВТ, Перерасчет);
	
	Выборка  									= Результат.Выбрать();
	ТекОбъектРасчета 							= Неопределено;
	
	ПроведенВПоследовательности 				= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	Исключен 									= Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности; 
	ЕстьОшибки 									= Ложь;
	Ошибки 										= "";
	МассивДокументов 							= Новый Массив;
	
	Если Результат.Пустой() тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	//Попытка
	//	УстановитьБлокировкуНабораЗаписейПоследовательностиПоРегистратору(Отбор, РС.РСбестСтабильныеПериодыНП, Отказ);
	//Исключение 
	//	
	//	Отказ = Истина;  
	//	Инфо = ИнформацияОбОшибке();
	//	Ошибки = Ошибки + ПодробноеПредставлениеОшибки(Инфо);
	//				
	//КонецПопытки;
	
	Если Отказ тогда
		
		ОтменитьТранзакцию();
		Если ЗначениеЗаполнено(Ошибки) Тогда 
			ВызватьИсключение Ошибки;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Пока Выборка.следующий() цикл  		
		Если ТекОбъектРасчета <> Выборка.ОбъектРасчета тогда 						
			Если ТекОбъектРасчета <> Неопределено тогда // Это не первая строка.				
				Отказ 							= ПровестиПоСтабильнымПериодамНП(МассивДокументов,Ошибки,НачалоПериодаРасчета,РС);
				Если не Отказ тогда
					// Если все выполнено тогда изменяем состояние в последовательности.
					НаборПоследовательности  	= РегистрыСведений.бестСтабильныеПериодыПоследовательностьНП.СоздатьНаборЗаписей();
					НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
					НаборПоследовательности.Отбор.Организация.установить(Организация);
					НаборПоследовательности.Отбор.Район.установить(Район);
					НаборПоследовательности.Отбор.ОбъектРасчета.установить(ТекОбъектРасчета);
					НаборПоследовательности.Прочитать();
					ТаблицаНабора  				= НаборПоследовательности.Выгрузить();
					НаборПоследовательности.Очистить();
					НаборПоследовательности.Записать();
					для Каждого стр из ТаблицаНабора цикл
						стр.СостояниеПроведения = ПроведенВПоследовательности;
					КонецЦикла;
					НаборПоследовательности  	= РегистрыСведений.бестСтабильныеПериодыПоследовательностьНП.СоздатьНаборЗаписей();
					НаборПоследовательности.Загрузить(ТаблицаНабора);
					НаборПоследовательности.Записать(Ложь); 										
					ЗафиксироватьТранзакцию();
					НачатьТранзакцию();
				иначе
					ЕстьОшибки 					= Истина;
					ОтменитьТранзакцию();
					НачатьТранзакцию();
				КонецЕсли;					
			КонецЕсли;
			МассивДокументов 					= Новый Массив; 			
		КонецЕсли;
		
		ОписаниеСтроки 							= Новый ФиксированнаяСтруктура("ПериодНачисления,Организация,Район,ОбъектРасчета,ПериодРегистрации,Документ,МоментВремени,Дата");
		
		Набор 									= РегистрыСведений[РС.РСбестСтабильныеПериодыНП].СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления); 
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.ОбъектРасчета.установить(Выборка.ОбъектРасчета);
		Набор.Записать();
		
		Набор 									= РегистрыСведений[РС.РСбестСтабильныеПериодыШкалыНП].СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления); 
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.ОбъектРасчета.установить(Выборка.ОбъектРасчета);
		Набор.Записать();
		
		Набор 									= РегистрыСведений[РС.РСбестНомераСтрокСтабильногоПериодаНП].СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления); 
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.ОбъектРасчета.установить(Выборка.ОбъектРасчета);
		Набор.Записать();		
		
		Если Выборка.СостояниеПроведения = Исключен тогда
			
			НаборПоследовательности  	= РегистрыСведений.бестСтабильныеПериодыПоследовательностьНП.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Организация);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.ОбъектРасчета.установить(Выборка.ОбъектРасчета);
			НаборПоследовательности.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
			НаборПоследовательности.Записать();
			
			ТекОбъектРасчета  					= Выборка.ОбъектРасчета;
			
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки  					= Новый Структура(ОписаниеСтроки);
		ДанныеСтроки.ПериодНачисления 	= ПериодНачисления;
		ДанныеСтроки.Организация 		= Организация;
		ДанныеСтроки.Район 				= Район;
		ДанныеСтроки.ОбъектРасчета		= Выборка.ОбъектРасчета;
		ДанныеСтроки.Документ			= Выборка.ДокРегистратор;
		ДанныеСтроки.ПериодРегистрации	= Выборка.ПериодРегистрации;
		ДанныеСтроки.МоментВремени  	= Новый МоментВремени(Выборка.ДатаРегистратора,Выборка.ДокРегистратор);
		ДанныеСтроки.Дата			  	= Выборка.ДатаРегистратора;
		
		МассивДокументов.Добавить(ДанныеСтроки);// Добавляем в набор.			
		ТекОбъектРасчета  					= Выборка.ОбъектРасчета;	
	КонецЦикла; 	
	
	Если ТекОбъектРасчета <> Неопределено тогда
		// Закончили чистку можно проводить документы.
		Отказ 						= ПровестиПоСтабильнымПериодамНП(МассивДокументов,Ошибки,НачалоПериодаРасчета,РС);
		Если не Отказ тогда
			// Если все выполнено тогда изменяем состояние в последовательности.
			НаборПоследовательности  = РегистрыСведений.бестСтабильныеПериодыПоследовательностьНП.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Организация);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.ОбъектРасчета.установить(ТекОбъектРасчета);
			НаборПоследовательности.Прочитать();
			ТаблицаНабора  			= НаборПоследовательности.Выгрузить();
			НаборПоследовательности.Очистить();
			НаборПоследовательности.Записать();
			для Каждого стр из ТаблицаНабора цикл
				стр.СостояниеПроведения = ПроведенВПоследовательности;
			КонецЦикла;
			НаборПоследовательности  = РегистрыСведений.бестСтабильныеПериодыПоследовательностьНП.СоздатьНаборЗаписей();
			НаборПоследовательности.Загрузить(ТаблицаНабора);
			НаборПоследовательности.Записать(Ложь);				
			ЗафиксироватьТранзакцию();
		иначе
			ЕстьОшибки 					= Истина;
			ОтменитьТранзакцию();	
		КонецЕсли; 					
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;
	
КонецПроцедуры

// Восстановить Последовательность Показания ПУ.
//
// Параметры:
//	 Организация 			 - Организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 		 - Период начисления, по которому происходит восстановление последовательности.
//   Район					 - район, по которому происходит восстановление последовательности.
//   МКД					 - МКД, по которому происходит восстановление последовательности.
//	 ИсключаяОтдельностоящие - Исключая отдельностоящие, по которым происходит восстановление последовательности.
//	 мОбъектовРасчета 		 - мОбъектов расчета, по которым происходит восстановление последовательности.
//	 Перерасчет 			 - Перерасчет, по которому происходит восстановление последовательности. 
//
Процедура ВосстановитьПоследовательностьПоказанияПУНП(Организация, ПериодНачисления,Район,МКД = Неопределено, ИсключаяОтдельностоящие = Ложь, мОбъектовРасчета=Неопределено, Перерасчет = Ложь) Экспорт 
	ГраницыПериода  							= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	
	НачалоПериодаРасчета						= ГраницыПериода.НачалоОП;
	
	Отбор 										= Новый Структура;
	Отбор.Вставить("Организация",		Организация);
	Отбор.Вставить("ПериодНачисления",	ПериодНачисления);
	Отбор.Вставить("Район",				Район);
	Отбор.Вставить("ИсключаяОтдельностоящие",	ИсключаяОтдельностоящие);	
	Отбор.Вставить("МКД",				МКД);
	Отбор.Вставить("ОбъектРасчета",		мОбъектовРасчета);
	
	Если Метаданные.РегистрыСведений.Найти("бестПриоритетПередачиПоказанийНП") <> Неопределено Тогда
		ПримененитьПриоритетыПоказанийПУНП(Отбор,НачалоПериодаРасчета);
	КонецЕсли;
	
	Отказ 										= Ложь;
	
	МВТ  										= Новый МенеджерВременныхТаблиц;
	Результат  									= РезультатЗапросаПоказанияПУНП(МВТ, Отбор, НачалоПериодаРасчета, Перерасчет);
	
	ДанныеМаксимальногоПотребления 				= ДанныеМаксимальногоПотребления(НачалоПериодаРасчета);
	
	РезультатСреднийОбъем 						= РезультатСреднийОбъемПотребленияНП(МВТ,Отбор);
	ВыборкаСреднийОбъем 						= РезультатСреднийОбъем.выбрать();
	
	ПроведенСНарушением 						= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
	ПроведенВПоследовательности 				= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	ПредыдущиеМакс 								= 0;
	Выборка  									= Результат.выбрать();
	ТекМКД 										= Неопределено;
	ТекОбъект 									= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала		 							= Неопределено;
	ТекТарифнаяЗона 							= Неопределено;
	МассивДокументов							= Неопределено;
	НомерПозиции 								= Неопределено;
	ДанныеСреднегоОбъема 						= Неопределено;
	ПоказанияС									= Неопределено;
	ПоказанияПО 								= Неопределено;
	НачПокНеЯвляютсяКонечнымиПриУстПрибора		= энргОбщегоНазначения.ЗначениеКонстанты("бестНачальныеПоказанияНеРавныКонечнымВПериодеВводаПУ");
	
	ОписаниеСтроки 								= Новый ФиксированнаяСтруктура("
	|ДокРегистратор,СостояниеПроведения,ПериодРегистрации,ДатаРегистратора,
	|СостояниеПоказаний,Показание,Переворот,МаксПоказания,ПериодМаксПоказаний,	 
	|РегистраторМаксПоказаний,ДатаРегистратораМаксимальных,БылПереворот,Разделитель,НомерСтрокиТЧ,
	|КоэффициентПУ,МаксимальноВозможныеПоказания,ВыводПрибораУчета,ИмяТабЧасти,КС, ТочкаУчета");
	
	Если Выборка.количество() > 0 тогда
		ВыборкаСреднийОбъем.Следующий();
		НачатьТранзакцию();
	КонецЕсли;
	
	Пока Выборка.следующий() цикл
		Если ТекМКД <> Выборка.МКД или ТекОбъект <> Выборка.ОбъектРасчета или ТекПрибор <> Выборка.ПриборУчета Или ТекШкала <> Выборка.Шкала или ТекТарифнаяЗона <> Выборка.ТарифнаяЗона тогда 			  			
			Если ТекМКД <> Неопределено тогда
				
				//	ДанныеСреднегоОбъема 			= ДанныеСреднегоОбъемаНП(ВыборкаСреднийОбъем,ТекДоговор);
				Если Не Отказ Тогда
					
					ПараметрыПроведений  					= Новый Структура("
					|Организация, ПериодНачисления,район,МКД,ОбъектРасчета,ПриборУчета,Шкала,ТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета, НачПокНеЯвляютсяКонечнымиПриУстПрибора",
					Организация, ПериодНачисления,район,ТекМКД,ТекОбъект,ТекПрибор,Текшкала,ТекТарифнаяЗона,НомерПозиции,ПоказанияС,ПоказанияПО,НачалоПериодаРасчета, НачПокНеЯвляютсяКонечнымиПриУстПрибора);
					
					ОтказПоТарифнойЗоне			= Ложь;
					ОтказПоТарифнойЗоне			= ПровестиПоказанияПриборовУчетаНП(ПараметрыПроведений,МассивДокументов,ДанныеСреднегоОбъема,ДанныеМаксимальногоПотребления);
					
					Если ОтказПоТарифнойЗоне Тогда
						Отказ 					= Истина;
					КонецЕсли;
					
				КонецЕсли;
				
				
				Если  ТекОбъект<> Выборка.ОбъектРасчета или ТекПрибор <> Выборка.ПриборУчета тогда
					
					Если не Отказ тогда
						// Если все выполнено тогда изменяем состояние в последовательности.
						НаборПоследовательности  	= РегистрыСведений.бестПоказанияПУНППоследовательность.СоздатьНаборЗаписей();
						НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
						НаборПоследовательности.Отбор.Организация.установить(Организация);
						НаборПоследовательности.Отбор.Район.установить(Район);
						НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
						НаборПоследовательности.Отбор.МКД.установить(ТекМКД);
						НаборПоследовательности.Отбор.ОбъектРасчета.установить(ТекОбъект);
						НаборПоследовательности.Отбор.ПриборУчета.установить(ТекПрибор);
						
						НаборПоследовательности.Прочитать();
						ТаблицаНабора  				= НаборПоследовательности.Выгрузить();
						НаборПоследовательности.Очистить();
						НаборПоследовательности.Записать();
						
						ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности,"СостояниеПроведения");
						
						НаборПоследовательности  	= РегистрыСведений.бестПоказанияПУНППоследовательность.СоздатьНаборЗаписей();
						НаборПоследовательности.Загрузить(ТаблицаНабора);
						НаборПоследовательности.Записать(Ложь); 										
						ЗафиксироватьТранзакцию();
						НачатьТранзакцию(); 
						Отказ					= Ложь;
					иначе
						ОтменитьТранзакцию();
						НачатьТранзакцию();
					КонецЕсли; 				
					
				КонецЕсли;
				МассивДокументов.очистить();
			КонецЕсли;	
			
			Если ТекОбъект <> Выборка.ОбъектРасчета Тогда
				ДанныеСреднегоОбъема 		= ДанныеСреднегоОбъемаНП(ВыборкаСреднийОбъем,ТекОбъект);
			КонецЕсли;
			
			МассивДокументов					= Новый Массив;
			НомерПозиции 						= Выборка.НомерПозици+1;
		КонецЕсли; 	
		
		ДанныеСтроки 							= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,Выборка);
		МассивДокументов.Добавить(ДанныеСтроки); 	
		
		// Очищаем данные
		Набор 									= РегистрыСведений.бестПредоставленныеПоказанияНП.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.периодНачисления.установить(ПериодНачисления);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Отбор.ОбъектРасчета.установить(Выборка.ОбъектРасчета);
		Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
		Набор.Отбор.Шкала.установить(Выборка.Шкала);
		Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
		Набор.Записать();
		
		Набор 										= РегистрыСведений.бестРасчетСреднегоОбъемаНП.СоздатьНаборЗаписей();
		Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.ОбъектРасчета.установить(Выборка.ОбъектРасчета);
		Набор.Отбор.ТочкаУчета.установить(Выборка.ТочкаУчета);
		Набор.Отбор.Шкала.установить(Выборка.Шкала);
		Набор.Отбор.МКД.установить(Выборка.МКД);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
		Набор.Записать();
		
		
		ТекМКД  								= Выборка.МКД;
		ТекОбъект	  							= Выборка.ОбъектРасчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекТарифнаяЗона 						= Выборка.ТарифнаяЗона;
		ПоказанияС								= Выборка.ДатаС;
		ПоказанияПО								= Выборка.ДатаПо;
	КонецЦикла;
	
	Если ТекМКД<> Неопределено  тогда
		
		//ДанныеСреднегоОбъема 					= ДанныеСреднегоОбъемаНП(ВыборкаСреднийОбъем,ТекДоговор);
		
		Если Не Отказ Тогда
			
			ПараметрыПроведений  					= Новый Структура("
			|Организация, ПериодНачисления, Район, МКД, ОбъектРасчета, ПриборУчета, Шкала, ТарифнаяЗона, НомерПозиции, ПоказанияС, ПоказанияПО, НачалоПериодаРасчета, НачПокНеЯвляютсяКонечнымиПриУстПрибора",
			Организация, ПериодНачисления, Район, ТекМКД, ТекОбъект, ТекПрибор, ТекШкала, ТекТарифнаяЗона, НомерПозиции, ПоказанияС, ПоказанияПО, НачалоПериодаРасчета, НачПокНеЯвляютсяКонечнымиПриУстПрибора);
			
			ОтказПоТарифнойЗоне			= Ложь;
			ОтказПоТарифнойЗоне			= ПровестиПоказанияПриборовУчетаНП(ПараметрыПроведений,МассивДокументов,ДанныеСреднегоОбъема,ДанныеМаксимальногоПотребления);
			
			Если ОтказПоТарифнойЗоне Тогда
				Отказ 					= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если не Отказ тогда
			// Если все выполнено тогда изменяем состояние в последовательности.
			НаборПоследовательности  			= РегистрыСведений.бестПоказанияПУНППоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.Организация.установить(Организация);
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
			НаборПоследовательности.Отбор.МКД.установить(ТекМКД);
			НаборПоследовательности.Отбор.ОбъектРасчета.установить(ТекОбъект);
			НаборПоследовательности.Отбор.ПриборУчета.установить(ТекПрибор);
			НаборПоследовательности.Прочитать();
			ТаблицаНабора  						= НаборПоследовательности.Выгрузить();
			НаборПоследовательности.Очистить();
			НаборПоследовательности.Записать();
			
			ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности,"СостояниеПроведения");
			
			НаборПоследовательности  			= РегистрыСведений.бестПоказанияПУНППоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Загрузить(ТаблицаНабора);
			НаборПоследовательности.Записать(Ложь); 
			ЗафиксироватьТранзакцию();
		иначе
			ОтменитьТранзакцию(); 			 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// Примененить приоритеты показаний приборов учета юр. лиц
Процедура ПримененитьПриоритетыПоказанийПУНП(Отбор,НачалоПериодаРасчета)
	
	// Получение списока измерений РС "Показания Приборов учета юр. лиц (последовательность)"
	Измерения = Новый Массив;
	Для каждого ТекИзмерение Из Метаданные.РегистрыСведений.бестПоказанияПУНППоследовательность.Измерения Цикл
		Измерения.Добавить(ТекИзмерение.Имя);
	КонецЦикла;
	
	РС_Последовательность = РегистрыСведений.бестПоказанияПУНППоследовательность;
	ИсключенИзПослед = Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности;
	
	// Получение записей с низким приоритетом
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ
	|	бестПоказанияПУНППоследовательность.Организация КАК Организация,
	|	бестПоказанияПУНППоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	бестПоказанияПУНППоследовательность.Район КАК Район,
	|	бестПоказанияПУНППоследовательность.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПоказанияПУНППоследовательность.ПриборУчета КАК ПриборУчета,
	|	бестПоказанияПУНППоследовательность.МКД КАК МКД
	|ПОМЕСТИТЬ ВТ_НарушенныеЗаписи
	|ИЗ
	|	РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПериодыПриемаПоказаний.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПериодыПриемаПоказанийСрезПоследних
	|		ПО бестПоказанияПУНППоследовательность.Организация = бестПериодыПриемаПоказанийСрезПоследних.Организация
	|			И бестПоказанияПУНППоследовательность.Район = бестПериодыПриемаПоказанийСрезПоследних.Район
	|			И (ВЫБОР
	|				КОГДА бестПоказанияПУНППоследовательность.МКД = ЗНАЧЕНИЕ(Справочник.энргстроения.пустаяссылка)
	|					ТОГДА бестПериодыПриемаПоказанийСрезПоследних.Отдельностоящие = ИСТИНА
	|				ИНАЧЕ бестПериодыПриемаПоказанийСрезПоследних.Отдельностоящие = ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	бестПоказанияПУНППоследовательность.Организация = &Организация
	|	И бестПоказанияПУНППоследовательность.ПериодНачисления = &ПериодНачисления
	|	И бестПоказанияПУНППоследовательность.Район = &Район
	|	И бестПоказанияПУНППоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И бестПоказанияПУНППоследовательность.МКД = &МКД
	|	И (бестПериодыПриемаПоказанийСрезПоследних.ДатаС ЕСТЬ NULL
	|			ИЛИ бестПериодыПриемаПоказанийСрезПоследних.ДатаС <= ДЕНЬ(бестПоказанияПУНППоследовательность.ДатаРегистратора))
	|	И (бестПериодыПриемаПоказанийСрезПоследних.ДатаПо ЕСТЬ NULL
	|			ИЛИ бестПериодыПриемаПоказанийСрезПоследних.ДатаПо = 0
	|			ИЛИ бестПериодыПриемаПоказанийСрезПоследних.ДатаПо >= ДЕНЬ(бестПоказанияПУНППоследовательность.ДатаРегистратора))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПоказанияПУНППоследовательность.Организация КАК Организация,
	|	бестПоказанияПУНППоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	бестПоказанияПУНППоследовательность.Район КАК Район,
	|	бестПоказанияПУНППоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	бестПоказанияПУНППоследовательность.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПоказанияПУНППоследовательность.ПриборУчета КАК ПриборУчета,
	|	бестПоказанияПУНППоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	бестПоказанияПУНППоследовательность.Разделитель КАК Разделитель,
	|	бестПоказанияПУНППоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	бестПоказанияПУНППоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	бестПоказанияПУНППоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	бестПоказанияПУНППоследовательность.ИмяТабЧасти КАК ИмяТабЧасти,
	|	бестПоказанияПУНППоследовательность.МКД КАК МКД,
	|	бестПоказанияПУНППоследовательность.ИсточникПоказаний КАК ИсточникПоказаний,
	|	ЕСТЬNULL(бестПриоритетПередачиПоказанийНПСрезПоследних.Приоритет, 0) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ЗаписиПоледовательности
	|ИЗ
	|	РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПриоритетПередачиПоказанийНП.СрезПоследних(
	|				&КонецПериода,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестПриоритетПередачиПоказанийНПСрезПоследних
	|		ПО бестПоказанияПУНППоследовательность.Организация = бестПриоритетПередачиПоказанийНПСрезПоследних.Организация
	|			И бестПоказанияПУНППоследовательность.Район = бестПриоритетПередачиПоказанийНПСрезПоследних.Район
	|			И бестПоказанияПУНППоследовательность.ИсточникПоказаний = бестПриоритетПередачиПоказанийНПСрезПоследних.ИсточникПоказаний
	|ГДЕ
	|	(бестПоказанияПУНППоследовательность.Организация, бестПоказанияПУНППоследовательность.ПериодНачисления, бестПоказанияПУНППоследовательность.Район, бестПоказанияПУНППоследовательность.ОбъектРасчета, бестПоказанияПУНППоследовательность.ПриборУчета, бестПоказанияПУНППоследовательность.МКД) В
	|			(ВЫБРАТЬ
	|				ВТ_НарушенныеЗаписи.Организация КАК Организация,
	|				ВТ_НарушенныеЗаписи.ПериодНачисления КАК ПериодНачисления,
	|				ВТ_НарушенныеЗаписи.Район КАК Район,
	|				ВТ_НарушенныеЗаписи.ОбъектРасчета КАК ОбъектРасчета,
	|				ВТ_НарушенныеЗаписи.ПриборУчета КАК ПриборУчета,
	|				ВТ_НарушенныеЗаписи.МКД КАК МКД
	|			ИЗ
	|				ВТ_НарушенныеЗаписи КАК ВТ_НарушенныеЗаписи)
	|	И (бестПоказанияПУНППоследовательность.ДокРегистратор ССЫЛКА Документ.бестРегистрацияПоказанийНП
	|			ИЛИ бестПоказанияПУНППоследовательность.ДокРегистратор ССЫЛКА Документ.бестРегистрацияПоказанийНПОбщий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаписиПоледовательности.Организация КАК Организация,
	|	ВТ_ЗаписиПоледовательности.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ЗаписиПоледовательности.МКД КАК МКД,
	|	ВТ_ЗаписиПоледовательности.Район КАК Район,
	|	ВТ_ЗаписиПоледовательности.ПриборУчета КАК ПриборУчета,
	|	ВТ_ЗаписиПоледовательности.ОбъектРасчета КАК ОбъектРасчета,
	|	МАКСИМУМ(ВТ_ЗаписиПоледовательности.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МаксимальныйПриоритет
	|ИЗ
	|	ВТ_ЗаписиПоледовательности КАК ВТ_ЗаписиПоледовательности
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗаписиПоледовательности.Организация,
	|	ВТ_ЗаписиПоледовательности.ПериодНачисления,
	|	ВТ_ЗаписиПоледовательности.МКД,
	|	ВТ_ЗаписиПоледовательности.Район,
	|	ВТ_ЗаписиПоледовательности.ПриборУчета,
	|	ВТ_ЗаписиПоледовательности.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаписиПоледовательности.Организация КАК Организация,
	|	ВТ_ЗаписиПоледовательности.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_ЗаписиПоледовательности.Район КАК Район,
	|	ВТ_ЗаписиПоледовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	ВТ_ЗаписиПоледовательности.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ЗаписиПоледовательности.ПриборУчета КАК ПриборУчета,
	|	ВТ_ЗаписиПоледовательности.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_ЗаписиПоледовательности.Разделитель КАК Разделитель,
	|	ВТ_ЗаписиПоледовательности.ДатаРегистратора КАК ДатаРегистратора,
	|	ВТ_ЗаписиПоледовательности.ДокРегистратор КАК ДокРегистратор,
	|	ВТ_ЗаписиПоледовательности.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ВТ_ЗаписиПоледовательности.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ВТ_ЗаписиПоледовательности.МКД КАК МКД,
	|	ВТ_ЗаписиПоледовательности.ИсточникПоказаний КАК ИсточникПоказаний
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_МаксимальныйПриоритет КАК ВТ_МаксимальныйПриоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаписиПоледовательности КАК ВТ_ЗаписиПоледовательности
	|		ПО ВТ_МаксимальныйПриоритет.Организация = ВТ_ЗаписиПоледовательности.Организация
	|			И ВТ_МаксимальныйПриоритет.ПериодНачисления = ВТ_ЗаписиПоледовательности.ПериодНачисления
	|			И ВТ_МаксимальныйПриоритет.МКД = ВТ_ЗаписиПоледовательности.МКД
	|			И ВТ_МаксимальныйПриоритет.Район = ВТ_ЗаписиПоледовательности.Район
	|			И ВТ_МаксимальныйПриоритет.ПриборУчета = ВТ_ЗаписиПоледовательности.ПриборУчета
	|			И ВТ_МаксимальныйПриоритет.ОбъектРасчета = ВТ_ЗаписиПоледовательности.ОбъектРасчета
	|			И ВТ_МаксимальныйПриоритет.Приоритет > ВТ_ЗаписиПоледовательности.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ДокРегистратор КАК ДокРегистратор,
	|	ВТ_Данные.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ИТОГИ ПО
	|	ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Организация КАК Организация,
	|	ВТ_Данные.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_Данные.Район КАК Район,
	|	ВТ_Данные.СостояниеПроведения КАК СостояниеПроведения,
	|	ВТ_Данные.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_Данные.ПриборУчета КАК ПриборУчета,
	|	ВТ_Данные.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_Данные.Разделитель КАК Разделитель,
	|	ВТ_Данные.ДатаРегистратора КАК ДатаРегистратора,
	|	ВТ_Данные.ДокРегистратор КАК ДокРегистратор,
	|	ВТ_Данные.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ВТ_Данные.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ВТ_Данные.МКД КАК МКД,
	|	ВТ_Данные.ИсточникПоказаний КАК ИсточникПоказаний
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные";
	
	
	Если Отбор.ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"И бестПоказанияПУНППоследовательность.МКД = &МКД","И бестПоказанияПУНППоследовательность.МКД <> &МКД");
	Иначе
		Если Отбор.МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"И бестПоказанияПУНППоследовательность.МКД = &МКД","");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Организация",		  Отбор.Организация);
	Запрос.УстановитьПараметр("Район",				  Отбор.район);
	Запрос.УстановитьПараметр("ПериодНачисления",	  Отбор.ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоПериодаРасчета);	
	Запрос.УстановитьПараметр("КонецПериода",		  КонецМесяца(НачалоПериодаРасчета));
	Запрос.УстановитьПараметр("МКД",	 			  Отбор.МКД);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КолЗапросов = РезультатЗапроса.Количество();
	ВыборкаДок = РезультатЗапроса[КолЗапросов-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДок.Следующий() Цикл
		Попытка
			ДокРегистратор = ВыборкаДок.ДокРегистратор.ПолучитьОбъект();
			Выборка = ВыборкаДок.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестРегистрацияПоказанийНП") Тогда
					
					ОтборПУ = Новый Структура("ПриборУчета", Выборка.ПриборУчета); 
					СтрокиПрибора = ДокРегистратор.ТочкиУчета.НайтиСтроки(ОтборПУ);
					Для каждого СтрокаТУ Из СтрокиПрибора Цикл
						ОтборШкала = Новый Структура("IDСтрокиТочкиУчета", СтрокаТУ.IDСтроки); 
						СтрокиШкал = ДокРегистратор.ШкалыПриборовУчета.НайтиСтроки(ОтборШкала);
						
						Для каждого СтрокаШкалы Из СтрокиШкал Цикл
							ОтборПоказания = Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки); 
							СтрокиПоказания = ДокРегистратор.ПоказанияПриборовУчета.НайтиСтроки(ОтборПоказания);
							
							Для каждого СтрокаПоказания Из СтрокиПоказания Цикл
								СтрокаПоказания.СостояниеПоказаний = Перечисления.энргСостояниеПоказаний.Отклонены;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестРегистрацияПоказанийНПОбщий") Тогда
					
					ОтборПУ = Новый Структура("ПриборУчета", Выборка.ПриборУчета); 
					СтрокиПрибора = ДокРегистратор.ТочкиУчета.НайтиСтроки(ОтборПУ);
					Для каждого СтрокаТУ Из СтрокиПрибора Цикл
						СтрокаТУ.СостояниеПоказаний = Перечисления.энргСостояниеПоказаний.Отклонены;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			ДокРегистратор.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр(ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;
	
	
	Выборка = РезультатЗапроса[КолЗапросов-1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			// Установка статуса "Проведен в последовательности"
			НаборПоследовательности  	= РС_Последовательность.СоздатьНаборЗаписей();
			Для каждого ТекИзмерение Из Измерения Цикл
				НаборПоследовательности.Отбор[ТекИзмерение].Установить(Выборка[ТекИзмерение]);
			КонецЦикла;
			НаборПоследовательности.Записать();
			
			Запись = РС_Последовательность.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности;
			Запись.Записать(Истина);	
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр(ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры

// Восстановить Последовательность По нежилому помещению.
//
// Параметры:
//	 Организация			- Организация, по которой происходит восстановление последовательности. 
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//	 ОбъектРасчета 			- Объект расчета, по которому происходит восстановление последовательности.
//
Процедура ВосстановитьПоследовательностьПоНП(Организация, ПериодНачисления,Район,ОбъектРасчета=Неопределено) Экспорт  
	ПараметрыЗадания  			= Новый Массив;
	мОбъектовРасчета = Новый Массив;
	мОбъектовРасчета.Добавить(ОбъектРасчета);
	
	ПараметрыЗадания.Добавить(Новый Структура("Организация, ПериодНачисления, Район, МКД_НП, ИсключаяОтдельностоящие, мОбъектыРасчета",
		Организация, ПериодНачисления, Район, Неопределено, Ложь, мОбъектовРасчета));
	ПараметрыЗадания.Добавить(мОбъектовРасчета);
	
	ФоновыеЗадания.Выполнить("бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьСтабильныеПериодыНП",		ПараметрыЗадания,Новый УникальныйИдентификатор);
	//ПараметрыЗадания.Вставить(1, ОбъектРасчета);
	ФоновыеЗадания.Выполнить("бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоказанияПУНП",			ПараметрыЗадания,Новый УникальныйИдентификатор);	
	//ФоновыеЗадания.Выполнить("бестРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты",			ПараметрыЗадания);
КонецПроцедуры

// Сбросить Состояние Последовательности.
//
// Параметры:
//   ИмяПоследовательности	- Имя последовательности, по которой происходит сброс состояния.
//	 Организация 			- Организация, по которой происходит сброс состояния.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//   МКД					- МКД, по которому происходит восстановление последовательности.
//
Процедура СброситьСостояниеПоследовательности(ИмяПоследовательности,Организация,ПериодНачисления,Район,МКД=Неопределено) Экспорт 
	
	ПроведенСНарушением 				= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
	ПроведенВПоследовательности  		= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	
	Набор 								= РегистрыСведений[ИмяПоследовательности].СоздатьНаборЗаписей();
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.СостояниеПроведения.установить(ПроведенВПоследовательности);
	Если МКД<>Неопределено тогда
		Набор.Отбор.МКД.установить(МКД);
	КонецЕсли;
	
	Набор.Прочитать();
	ТаблицаНабора 						= Набор.Выгрузить();
	Набор.Очистить();
	Набор.Записать();
	ТаблицаНабора.ЗаполнитьЗначения(ПроведенСНарушением,"СостояниеПроведения");
	Набор 								= РегистрыСведений[ИмяПоследовательности].СоздатьНаборЗаписей();
	Набор.Загрузить(ТаблицаНабора);
	Набор.Записать(Ложь); 
	
КонецПроцедуры

// Восстановить Последовательность Взаиморасчеты НПЭЭ.
//
// Параметры:
//	 Организация			- Организация, по которой происходит восстановление последовательности. 
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- Район, по которому происходит восстановление последовательности.
//	 Договор 				- Договор, по которому происходит восстановление последовательности.
//
Процедура ВосстановитьПоследовательностьВзаиморасчетыНПЭЭ(Организация, ПериодНачисления,Район, Договор=Неопределено) Экспорт
	перем ТекДоговор,Авансы,МассивДокументов,ДанныеЗадолженности;	
	
	ГраницыПериода  									= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	НачалоПериодаРасчета								= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  								= ГраницыПериода.ЗавершениеОП-1;
	
	ПроведенВПоследовательности 						= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	ПроведенСНарушением 								= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
	
	МВТ 												= ЗаполнитьМВТВзаиморасчеты(Организация, ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета);
	
	РезультатЗадолженностьФактическая  					= РезультатЗадолженностьФактическая(Организация, ПериодНачисления,Район,Договор,МВТ,НачалоПериодаРасчета,КонецПериодаРасчета);
	
	РезультатДокументыДляПроведения  					= РезультатДокументыДляПроведения(Организация, ПериодНачисления,Район,Договор,МВТ);
	
	РезультатДанныеНачислений 							= РезультатДанныеНачислений(МВТ);
	ВыборкаДанныеНачислений 							= РезультатДанныеНачислений.выбрать();
	
	РезультатФактическаяПереплата						= РезультатФактическойПереплаты(Организация, ПериодНачисления,Район,Договор,МВТ,НачалоПериодаРасчета,КонецПериодаРасчета);
	ВыборкаФактическаяПереплата  						= РезультатФактическаяПереплата.выбрать();
	
	РезультатОплата										= РезультатОплата(МВТ, НачалоПериодаРасчета);
	ВыборкаОплата  										= РезультатОплата.выбрать();
	
	РезультатКорректировкаОплаченныхНачислений			= РезультатКорректировкаОплаченныхНачислений(МВТ);
	ВыборкаКорректировка								= РезультатКорректировкаОплаченныхНачислений.Выбрать();
	
	ВыборкаДокументы  									= РезультатДокументыДляПроведения.выбрать();
	ВыборкаЗадолженностьФактическая  					= РезультатЗадолженностьФактическая.выбрать();
	
	
	ПустойРезультатНачисления 							= Истина;
	ПустойРезультатОплаты 								= Истина;
	Если ВыборкаДокументы.количество() > 0 тогда
		НачатьТранзакцию();
		ПустойРезультатЗадолженностьФактическая 		= ВыборкаЗадолженностьФактическая.следующий();
		ПустойРезультатАвансы 							= ВыборкаФактическаяПереплата.следующий();
		ПустойРезультатНачисления 						= ВыборкаДанныеНачислений.следующий();
		ПустойРезультатКорректировки					= ВыборкаКорректировка.следующий();
		ПустойРезультатОплаты	 						= НЕ ВыборкаОплата.следующий();
	КонецЕсли;	
	СуммаАванса 										= 0;
	
	ОписаниеСтроки  									= Новый ФиксированнаяСтруктура("
	|Договор,СостояниеПроведения,ДатаРегистратора,ДокРегистратор,ЭтоОплата,ИсточникПоступления");
	НаборыПоТипам 										= НаборыПоТипам();	
	
	ПараметрыПроведения 								= Новый Структура;
	ПараметрыПроведения.Вставить("Организация",					Организация);
	ПараметрыПроведения.Вставить("ПериодНачисления",			ПериодНачисления);
	ПараметрыПроведения.Вставить("район",						Район);
	ПараметрыПроведения.Вставить("МассивДокументов",			МассивДокументов);
	ПараметрыПроведения.Вставить("Авансы",						Авансы);
	ПараметрыПроведения.Вставить("СуммаАванса",					СуммаАванса);
	ПараметрыПроведения.Вставить("ДанныеЗадолженности",			ДанныеЗадолженности);
	ПараметрыПроведения.Вставить("ДанныеНачислений",			Новый Соответствие);
	ПараметрыПроведения.Вставить("ДанныеКорректировки",			Новый Соответствие);
	ПараметрыПроведения.Вставить("ДанныеОплаты",				Новый Соответствие);
	ПараметрыПроведения.Вставить("НаборыПоТипам",				НаборыПоТипам);
	ПараметрыПроведения.Вставить("Сортировка", 					"ПериодРасчета");
	ПараметрыПроведения.Вставить("СтавкаНДС", 					РегистрыСведений.бестСтавкиНДС.ПолучитьСтавкуНДС(НачалоПериодаРасчета, Организация));
	
	МассивДокументовНачисления 							= Новый Соответствие;
	
	Пока ВыборкаДокументы.следующий() цикл 					
		
		Если ТекДоговор <> ВыборкаДокументы.Договор тогда	
			
			Если ТекДоговор <> Неопределено тогда
				
				ДанныеНачислений 						= ДанныеНачислений(ТекДоговор, ВыборкаДанныеНачислений);
				ДанныеАвансы 							= АвансНаГраницу(ТекДоговор, ВыборкаФактическаяПереплата);			
				ДанныеЗадолженности  					= ЗадолженностьНаГраницу(ТекДоговор, ВыборкаЗадолженностьФактическая);			
				ДанныеКорректировки  					= КорректировкаОплаченныхНачислений(ТекДоговор, ВыборкаКорректировка);				
				ПараметрыПроведения.ДанныеОплаты 		= Новый Соответствие;
				Если Не ПустойРезультатОплаты Тогда
					ПараметрыПроведения.ДанныеОплаты 	= ДанныеОплаты(ТекДоговор, ВыборкаОплата); 
				КонецЕсли;
				
				ПараметрыПроведения.МассивДокументов	= МассивДокументов;
				ПараметрыПроведения.Авансы				= ДанныеАвансы.Авансы;
				ПараметрыПроведения.СуммаАванса			= ДанныеАвансы.СуммаАванса;
				ПараметрыПроведения.ДанныеЗадолженности	= ДанныеЗадолженности;
				ПараметрыПроведения.ДанныеНачислений 	= ДанныеНачислений; 
				ПараметрыПроведения.ДанныеКорректировки = ДанныеКорректировки;
				
				Отказ  									= ПровестиВзаиморасчеты(ПараметрыПроведения,МассивДокументовНачисления);
				
				Если не Отказ 
					// и не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") 
					и ИзменитьСостояниеПоследовательности(Организация, ПериодНачисления,район,ПроведенСНарушением,ПроведенВПоследовательности,ТекДоговор) тогда	
					ЗафиксироватьТранзакцию();
					НачатьТранзакцию();
				Иначе
					// Если не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") тогда
					ОтменитьТранзакцию();
					НачатьТранзакцию();
				КонецЕсли;
				
				Если ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") Тогда
					ПараметрыПроведения.Удалить("ЕстьДокументыНачисления");
				КонецЕсли;				
			КонецЕсли;
			
			//Если ТекМКД <> ВыборкаДокументы.МКД и МассивДокументовНачисления.Количество() > 0 тогда
			//	Если ЗаписатьНаборыДокументовНачисления(Организация, ПериодНачисления,район,ТекМКД,ПроведенСНарушением,ПроведенВПоследовательности,МассивДокументовНачисления,Абонент) тогда
			//		ЗафиксироватьТранзакцию();
			//	Иначе
			//		ОтменитьТранзакцию();
			//	КонецЕсли;
			//	НачатьТранзакцию();
			//	МассивДокументовНачисления 				= Новый Соответствие;				
			//КонецЕсли; 	
			
			МассивДокументов  							= Новый Массив;			
		КонецЕсли;  		
		ДанныеСтроки  									= Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ВыборкаДокументы);
		МассивДокументов.Добавить(ДанныеСтроки);		
		ТекДоговор 										= ВыборкаДокументы.Договор;	
	КонецЦикла;
	
	Если ТекДоговор <> Неопределено тогда
		
		ДанныеНачислений 								= ДанныеНачислений(ТекДоговор,ВыборкаДанныеНачислений);
		ДанныеАвансы 									= АвансНаГраницу(ТекДоговор,ВыборкаФактическаяПереплата);				
		ДанныеЗадолженности  							= ЗадолженностьНаГраницу(ТекДоговор,ВыборкаЗадолженностьФактическая);			
		ДанныеКорректировки  							= КорректировкаОплаченныхНачислений(ТекДоговор, ВыборкаКорректировка);
		
		ПараметрыПроведения.МассивДокументов			= МассивДокументов;
		ПараметрыПроведения.Авансы						= ДанныеАвансы.Авансы;
		ПараметрыПроведения.СуммаАванса 				= ДанныеАвансы.СуммаАванса;
		ПараметрыПроведения.ДанныеЗадолженности			= ДанныеЗадолженности;
		ПараметрыПроведения.ДанныеНачислений 			= ДанныеНачислений; 
		ПараметрыПроведения.ДанныеКорректировки 		= ДанныеКорректировки;
		ПараметрыПроведения.ДанныеОплаты 				= Новый Соответствие;
		Если НЕ ПустойРезультатОплаты Тогда
			ПараметрыПроведения.ДанныеОплаты 			= ДанныеОплаты(ТекДоговор, ВыборкаОплата); 
		КонецЕсли;
		
		Отказ  											= ПровестиВзаиморасчеты(ПараметрыПроведения,МассивДокументовНачисления);
		
		Если не Отказ 
			// и не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") 
			и ИзменитьСостояниеПоследовательности(Организация, ПериодНачисления,район,ПроведенСНарушением,ПроведенВПоследовательности,ТекДоговор) тогда	
			ЗафиксироватьТранзакцию();
			//НачатьТранзакцию();
		Иначе
			//Если не ПараметрыПроведения.Свойство("ЕстьДокументыНачисления") тогда  
			ОтменитьТранзакцию();
			//НачатьТранзакцию();
		КонецЕсли; 		
		
		//Если МассивДокументовНачисления.Количество() > 0 тогда
		//	Если ЗаписатьНаборыДокументовНачисления(Организация, ПериодНачисления,район,ТекМКД,ПроведенСНарушением,ПроведенВПоследовательности,МассивДокументовНачисления,Договор) тогда
		//		ЗафиксироватьТранзакцию();
		//	иначе
		//		ОтменитьТранзакцию();
		//	КонецЕсли;							
		//КонецЕсли; 		 		
	КонецЕсли;
КонецПроцедуры

#Область РегламетныеПроцедуры

// Выполнение регламентных процедур.
Процедура РегламетныеПроцедурыБиллинг() Экспорт 
	
	ЗначениеКонстанты  				= Константы.энргДатаНачалаВеденияУчета.Получить();
	
	Запрос  = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоВеденияУчета",ЗначениеКонстанты);
	Запрос.Текст ="ВЫБРАТЬ
	|	МАКСИМУМ(ВложенныйЗапрос.ПериодНачисления) КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Организация КАК Организация
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргЗакрытиеПериодаСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|		энргЗакрытиеПериодаСрезПоследних.Район КАК Район,
	|		энргЗакрытиеПериодаСрезПоследних.Организация КАК Организация
	|	ИЗ
	|		РегистрСведений.энргЗакрытиеПериода.СрезПоследних(, ) КАК энргЗакрытиеПериодаСрезПоследних
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоВеденияУчета, МЕСЯЦ), СЕКУНДА, -1), МЕСЯЦ),
	|		энргЗоныОтвественности.Ссылка,
	|		энргЗоныОтвественности.Организация
	|	ИЗ
	|		Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|	ГДЕ
	|		НЕ энргЗоныОтвественности.ПометкаУдаления) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.Организация";
	
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() цикл 		
		ПараметрыЗадания  			= Новый Массив;
		ПараметрыЗадания.Добавить(КонецМесяца(Выборка.ПериодНачисления)+1);
		ПараметрыЗадания.Добавить(Выборка.Район);
		ПараметрыЗадания.Добавить(Выборка.Организация);
		ФоновыеЗадания.Выполнить("бестРаботаСПоследовательностямиНП.ВыполнитьРегламетныеОперацииНП",ПараметрыЗадания);
	КонецЦикла;	
	
КонецПроцедуры

// Выполнение регламентных процедур.
//
// Параметры:
//   Организация							-	СправочникСсылка.Организации					-	организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 						-	Дата											-	период начисления, по которому происходит восстановление последовательности.
//   Район									-	СправочникСсылка.энргЗоныОтвественности			-	район, по которому происходит восстановление последовательности.
//   МКД									-	СправочникСсылка.энргСтроения					-	МКД, по которому происходит восстановление последовательности.
//   ИсключаяОтдельностоящие				-	Булево											-	исключать отдельностоящие.
//   СбрасыватьСостояниеПоследовательности	-	Булево											-	сбрасывать состояние последовательности.
//   мОбъектыРасчета 						-	Массив из СправочникСсылка.бестОбъектыРасчета	-	объекты расчета, по которым происходит восстановление.
//																									последовательности.
//   Перерасчет 							-	Булево											-	использовать перерасчет.
//   БратьДанныеИзСтандартныхРС				-	Булево											-	брать данные из стандартных РС.
//
Процедура ОтложенныеДвиженияДокументовНачисленияНП(Организация,ПериодНачисления, Район,  МКД = Неопределено, ИсключаяОтдельностоящие = Ложь, СбрасыватьСостояниеПоследовательности=Истина ,мОбъектыРасчета = Неопределено, Перерасчет = Ложь, БратьДанныеИзСтандартныхРС = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ПериодНачисления) или Не ЗначениеЗаполнено(Район) тогда
		Возврат;
	КонецЕсли;
	
	РС = ПолучитьСтруктуруРегистров(Перерасчет);
	
	ГраницыПериода  											= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	
	НачалоПериодаРасчета										= ГраницыПериода.НачалоОП;
	
	МВТ  														= Новый МенеджерВременныхТаблиц;
	
	Результат 													= РезультатНачальныеОстаткиСтабильногоПериодаНП(ПериодНачисления,Организация,Район,НачалоПериодаРасчета,ИсключаяОтдельностоящие,МКД,мОбъектыРасчета,Перерасчет,БратьДанныеИзСтандартныхРС,РС);
	Выборка  													= Результат[1].Выбрать();
	ВыборкаПоказания 											= Результат[2].Выбрать();
	ВыборкаШкалы	 											= Результат[3].Выбрать();
	
	
	ПериодНачисленияПред 										= НачалоМесяца(НачалоМесяца(ПериодНачисления)-1);
	НаборСтабильныеПериоды 										= Неопределено;
	НаборСтабильныеПериодыШкалы									= Неопределено;
	НаборНомерСтрокСтабПериода 									= Неопределено;
	
	НаборОтложенныхДвижений 									= Неопределено;
	НаборМаксимальныеПоказания 									= Неопределено;
	
	ВводНачальныхОстатков 										= Неопределено;
	Если Выборка.Количество() > 0 тогда		
		НачатьТранзакцию();
	Иначе
		Возврат;	
	КонецЕсли;	
	
	ОчиститьНаборыЗаписей(Организация, ПериодНачисления,Район,МКД,РС,Перерасчет);
	
	Если СбрасыватьСостояниеПоследовательности тогда
		СброситьСостояниеПоследовательности("бестСтабильныеПериодыПоследовательностьНП",	Организация,ПериодНачисления,Район,МКД);
		СброситьСостояниеПоследовательности("бестПоказанияПУНППоследовательность", 		Организация,ПериодНачисления,Район,МКД);
	КонецЕсли;
	
	
	НаборСтабильныеПериоды								= РегистрыСведений[РС.РСбестСтабильныеПериодыНП].СоздатьНаборЗаписей();
	НаборСтабильныеПериодыШкалы							= РегистрыСведений[РС.РСбестСтабильныеПериодыШкалыНП].СоздатьНаборЗаписей();
	НаборНомерСтрокСтабПериода 							= РегистрыСведений[РС.РСбестНомераСтрокСтабильногоПериодаНП].СоздатьНаборЗаписей();
	
	
	Пока Выборка.Следующий() цикл		
		СтрокаСтабПериоды  										= НаборСтабильныеПериоды.добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСтабПериоды,Выборка);	
		СтрокаСтабПериоды.ПериодНачисления 						= ПериодНачисления;
		
		СтрокаНомеровСтрок 										= НаборНомерСтрокСтабПериода.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНомеровСтрок,Выборка);
		СтрокаНомеровСтрок.ПериодНачисления 					= ПериодНачисления;
		СтрокаНомеровСтрок.период  								= Выборка.ДатаРегистратора;		
	КонецЦикла;  
	
	Пока ВыборкаШкалы.Следующий() Цикл		
		СтрокаНабора 											= НаборСтабильныеПериодыШкалы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаШкалы);					
	КонецЦикла;	
	
	Если НЕ Перерасчет Тогда
		НаборМаксимальныеПоказанийСрез 						= РегистрыСведений.бестМаксимальныеПоказанияСрезНП.СоздатьНаборЗаписей();
		
		Пока ВыборкаПоказания.Следующий() Цикл		
			СтрокаНабора 											= НаборМаксимальныеПоказанийСрез.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаПоказания);					
		КонецЦикла;
	КонецЕсли;
	
	Попытка 
		ЗаполнитьДанныеПочасовойВедомостиСрез(Организация, Район, МКД, ИсключаяОтдельностоящие, ПериодНачисления, мОбъектыРасчета);
		
		НаборОтложенные 									= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
		НаборОтложенные.отбор.Организация.установить(Организация);
		НаборОтложенные.отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборОтложенные.отбор.Район.установить(Район); 						
		НаборОтложенные.отбор.РазделЗаписи.установить(Перечисления.бестРазделыЗаписиНП.СтабильныеПериодыНП);
		Если МКД <> Неопределено Тогда
			НаборОтложенные.отбор.МКД.установить(МКД);
		КонецЕсли;
		НаборОтложенные.Записать();  
		
		НаборСтабильныеПериоды.записать(Ложь);
		НаборСтабильныеПериодыШкалы.записать(Ложь);
		НаборНомерСтрокСтабПериода.записать(Ложь);	
		Если НЕ Перерасчет Тогда
			НаборМаксимальныеПоказанийСрез.записать(Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию(); 			
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Заполнение начальных остатков по району " +Район + " за период:" + ПериодНачисления ,УровеньЖурналаРегистрации.Ошибка,,,ПредставлениеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПредставлениеОшибки);
		ОтменитьТранзакцию();
	КонецПопытки;
	
	ПересчитатьСреднийОбъемПотребленияНП(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие);
	
	
КонецПроцедуры

// Выполнение регламентных процедур.
//
// Параметры:
//   Организация				-	СправочникСсылка.Организации			-	организация, по которой происходит восстановление последовательности.
//   ПериодНачисления 			-	Дата									-	период начисления, по которому происходит восстановление последовательности.
//   Район						-	СправочникСсылка.энргЗоныОтвественности	-	район, по которому происходит восстановление последовательности.
//   МКД						-	СправочникСсылка.энргСтроения			-	МКД, по которому происходит восстановление последовательности.
//   ИсключаяОтдельностоящие	-	Булево									-	исключать отдельностоящие.
//
Процедура ПересчитатьСреднийОбъемПотребленияНП(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие) Экспорт 
	
	Результат 						= РезультатаЗапросаСреднегоПотребленияНП(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие);
	Выборка  						= Результат.выбрать();
	Набор  							= РегистрыСведений.бестСреднийОбъемПотребленияНП.СоздатьНаборЗаписей();
	
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.район.установить(Организация);
	Набор.Отбор.район.установить(Район);
	Если МКД <> Неопределено Тогда
		Набор.Отбор.МКД.установить(МКД);
	КонецЕсли;
	
	Набор.Записать();
	
	Набор  							= РегистрыСведений.бестСреднийОбъемПотребленияНП.СоздатьНаборЗаписей();				 
	Пока Выборка.следующий() цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(),Выборка);		
	КонецЦикла;
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОтложенныеДвиженияДокументовНачисления

// Заполняет данные почасовой ведомости.
//
// Параметры:
//  Организация				-	СправочникСсылка.Организации.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  МКД						-	СправочникСсылка.энргСтроения.
//  ИсключаяОтдельностоящие	-	Булево.
//  ПериодНачисления		-	Дата.
//  мОбъектыРасчета			-	Массив.
//
Процедура ЗаполнитьДанныеПочасовойВедомостиСрез(Организация, Район, МКД, ИсключаяОтдельностоящие, ПериодНачисления, мОбъектыРасчета = Неопределено) Экспорт
	
	ГраницыПериода  = Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	ОчиститьДанныеПочасовойВедомостиСрез(Организация, ПериодНачисления, Район, МКД, мОбъектыРасчета);
		
	РезультатЗапроса = ПолучитьДанныеПочасовойВедомостиСрез(Организация, ПериодНачисления, Район, МКД, ГраницыПериода,ИсключаяОтдельностоящие, мОбъектыРасчета);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Набор 											= РегистрыСведений.бестДанныеПочасовойВедомостиСрез.СоздатьНаборЗаписей();
	
	КонецПериодаНачисления = КонецМесяца(ПериодНачисления);
	Пока Выборка.Следующий() Цикл
		СтрокаНабора = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
		СтрокаНабора.ПериодНачисления = ПериодНачисления;
		Если Выборка.ЭтоПоследнийДень Тогда
			ПоследнийДень = Выборка.День + 86400;
			Пока ПоследнийДень < КонецПериодаНачисления Цикл
				СтрокаНабора = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка, , "День");
				СтрокаНабора.День = ПоследнийДень;
				ПоследнийДень = ПоследнийДень + 86400;
				СтрокаНабора.ПериодНачисления = ПериодНачисления;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Набор.Записать(Ложь);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает блокировку набора записей последовательности по регистратору.
//
// Параметры:
//  ЗначенияБлокировки		-	Структура.
//  						-	Соответствие.
//  ИмяПоследовательности	-	Строка.
//  Отказ					-	Булево.
//  Заголовок				-	Строка.
//
Процедура УстановитьБлокировкуНабораЗаписейПоследовательностиПоРегистратору(ЗначенияБлокировки,ИмяПоследовательности, Отказ = Ложь, Заголовок = "") Экспорт
	
	ПараметрыБлокировки = Новый Структура();
	ПараметрыБлокировки.Вставить("ТипТаблицы", "РегистрСведений." + ИмяПоследовательности);
	ПараметрыБлокировки.Вставить("ИмяТаблицы", "");
	
	энргОбщегоНазначения.УстановитьУправляемуюБлокировку(ПараметрыБлокировки, ЗначенияБлокировки, , Отказ, Заголовок);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВосстановитьПоследовательностьСтабильныеПериодыНП
Процедура ОчиститьНаборыЗаписей(Организация, ПериодНачисления,Район,МКД,РС,Перерасчет)
	НаборСтабильныеПериоды					= РегистрыСведений[РС.РСбестСтабильныеПериодыНП].СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.Отбор.Организация.установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.установить(Район);
	Если Не МКД = Неопределено  Тогда
		НаборСтабильныеПериоды.Отбор.МКД.установить(МКД);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	
	НаборСтабильныеПериоды					= РегистрыСведений[РС.РСбестСтабильныеПериодыШкалыНП].СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.Отбор.Организация.установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.установить(Район);
	Если Не МКД = Неопределено  Тогда
		НаборСтабильныеПериоды.Отбор.МКД.установить(МКД);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	
	НаборНомерСтрокСтабПериода 				= РегистрыСведений[РС.РСбестНомераСтрокСтабильногоПериодаНП].СоздатьНаборЗаписей();
	НаборНомерСтрокСтабПериода.Отбор.Организация.установить(Организация);
	НаборНомерСтрокСтабПериода.Отбор.ПериодНачисления.установить(ПериодНачисления);
	НаборНомерСтрокСтабПериода.Отбор.Район.установить(Район);
	Если Не МКД = Неопределено  Тогда
		НаборНомерСтрокСтабПериода.Отбор.МКД.установить(МКД);
	КонецЕсли;
	НаборНомерСтрокСтабПериода.Записать();
	
	Если НЕ Перерасчет Тогда
		НаборОтложенныхДвижений  				= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
		НаборОтложенныхДвижений.Отбор.Организация.установить(Организация);
		НаборОтложенныхДвижений.Отбор.ПериодНачисления.установить(ДобавитьМесяц(ПериодНачисления,-1));
		НаборОтложенныхДвижений.Отбор.Район.установить(Район);
		Если Не МКД = Неопределено  Тогда
			НаборОтложенныхДвижений.Отбор.МКД.установить(МКД);
		КонецЕсли;
		НаборОтложенныхДвижений.Отбор.РазделЗаписи.установить(Перечисления.энргРазделыЗаписи.СтабильныеПериодыНП);
		НаборОтложенныхДвижений.Записать();
		
		НаборМаксимальныеПоказанияСрез					= РегистрыСведений.бестМаксимальныеПоказанияСрезНП.СоздатьНаборЗаписей();
		НаборМаксимальныеПоказанияСрез.Отбор.Организация.установить(Организация);
		НаборМаксимальныеПоказанияСрез.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборМаксимальныеПоказанияСрез.Отбор.Район.установить(Район);
		Если Не МКД = Неопределено  Тогда
			НаборМаксимальныеПоказанияСрез.Отбор.МКД.установить(МКД);
		КонецЕсли;
		НаборМаксимальныеПоказанияСрез.записать();
	КонецЕсли;
КонецПроцедуры

Функция ПровестиПоСтабильнымПериодамНП(Документы,Ошибки,НачалоПериодаРасчета, РС)
	
	для Каждого ОписаниеДокумента из Документы цикл
		Организация                             = ОписаниеДокумента.Организация;
		Район  									= ОписаниеДокумента.Район;
		ОбъектРасчета  							= ОписаниеДокумента.ОбъектРасчета;
		МоментВремени  							= ОписаниеДокумента.МоментВремени;
		Документ 								= ОписаниеДокумента.Документ;		
		Дата 									= ОписаниеДокумента.Дата;
		ПериодРегистрации						= ОписаниеДокумента.ПериодРегистрации;
		
		НаборСтабильныеПериоды  				= РегистрыСведений[РС.РСбестСтабильныеПериодыНП].СоздатьНаборЗаписей();
		НаборСтабильныеПериодыШкалы				= РегистрыСведений[РС.РСбестСтабильныеПериодыШкалыНП].СоздатьНаборЗаписей();
		
		НаборПоследнихНомеров           		= РегистрыСведений[РС.РСбестНомераСтрокСтабильногоПериодаНП].СоздатьНаборЗаписей();
		
		ПараметрыЗапроса					= Новый Структура("Организация,Район,ОбъектРасчета,ПериодРегистрации",Организация,Район,ОбъектРасчета,Макс(ПериодРегистрации,НачалоПериодаРасчета));
		Параметры 							= Новый Структура("ПараметрыЗапроса,Отказ,МоментВремени,РазрешенПустойНабор,
		|ссылка,ДатаДок,ПериодНачисления,
		|НаборСтабильныеПериоды,НаборСтабильныеПериодыШкалы,НаборПоследнихНомеров",
		ПараметрыЗапроса,Ложь,МоментВремени,Ложь,
		Документ,Дата,ОписаниеДокумента.ПериодНачисления,
		НаборСтабильныеПериоды,НаборСтабильныеПериодыШкалы,НаборПоследнихНомеров);
		
		Попытка
			бестРаботаСПериодомДействияНП.ПровестиПоСтабильнымПериодамНП(Документ,Параметры);
		Исключение
			ИнформацияОбОшибке  	= ИнформацияОбОшибке();
			Ошибки 					= ?(НЕ ПустаяСтрока(Ошибки),Символы.ПС,"");
			ТекстСообщения 			= НСтр("ru = 'Не удалось восстановить последовательности документов по объекту расчета %1: %2'");
			Ошибки 					= Ошибки + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ОбъектРасчета,Документ);
			Ошибки 					= Ошибки + Символы.ПС + "По причине: " + ИнформацияОбОшибке.Причина.Описание;			
			Возврат истина;
		КонецПопытки;
		
		
		Если не Параметры.РазрешенПустойНабор и НаборСтабильныеПериоды.Количество() =0 тогда
			Ошибки 					= ?(НЕ ПустаяСтрока(Ошибки),Символы.ПС,"");
			ТекстСообщения 			= НСтр("ru = 'Не удалось восстановить последовательности документов по объекту расчета %1: %2 - причина: Обнаружен пустой набор записей'");
			Ошибки 					= Ошибки + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ОбъектРасчета,Документ);
			Возврат истина;
		КонецЕсли; 		
		
		Попытка		
			НаборПоследнихНомеров.Записать(Ложь);
			НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
			НаборСтабильныеПериоды.Записать(Ложь);
			
			НаборСтабильныеПериодыШкалы.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
			НаборСтабильныеПериодыШкалы.Записать(Ложь);
			
		Исключение
			ИнформацияОбОшибке  	= ИнформацияОбОшибке();
			Ошибки 					= ?(НЕ ПустаяСтрока(Ошибки),Символы.ПС,"");
			ТекстСообщения 			= НСтр("ru = 'Не удалось восстановить последовательности документов по объекту расчета %1: %2'");
			Ошибки 					= Ошибки + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ОбъектРасчета,Документ);
			Ошибки 					= Ошибки + Символы.ПС + "По причине: " + ИнформацияОбОшибке.Причина.Описание; 			
			Возврат истина;
		КонецПопытки;				
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция РезультатЗапросаСтабильныеПериодыНП(Отбор, МВТ = Неопределено, Перерасчет = Ложь) 
	Запрос  = Новый Запрос;
	Если НЕ Перерасчет Тогда
		Текст ="ВЫБРАТЬ
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления КАК ПериодНачисления,
		|	бестСтабильныеПериодыПоследовательностьНП.Район КАК Район,
		|	МИНИМУМ(бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации) КАК ПериодРегистрации,
		|	бестСтабильныеПериодыПоследовательностьНП.Организация КАК Организация,
		|	бестСтабильныеПериодыПоследовательностьНП.МКД КАК МКД,
		|	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета КАК ОбъектРасчета
		|ПОМЕСТИТЬ МинПериодРегистрации
		|ИЗ
		|	РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		|ГДЕ
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления
		|	И бестСтабильныеПериодыПоследовательностьНП.Район = &Район
		|	И бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
		|	И бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация
		|	И бестСтабильныеПериодыПоследовательностьНП.МКД = &МКД
		|	И бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета В (&мОбъектыРасчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления,
		|	бестСтабильныеПериодыПоследовательностьНП.Район,
		|	бестСтабильныеПериодыПоследовательностьНП.Организация,
		|	бестСтабильныеПериодыПоследовательностьНП.МКД,
		|	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления КАК ПериодНачисления,
		|	бестСтабильныеПериодыПоследовательностьНП.Район КАК Район,
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации КАК ПериодРегистрации,
		|	МИНИМУМ(бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора) КАК ДатаРегистратора,
		|	бестСтабильныеПериодыПоследовательностьНП.МКД КАК МКД,
		|	бестСтабильныеПериодыПоследовательностьНП.Организация КАК Организация,
		|	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета КАК ОбъектРасчета
		|ПОМЕСТИТЬ МинимальныйПериод
		|ИЗ
		|	МинПериодРегистрации КАК МинПериодРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		|		ПО МинПериодРегистрации.ПериодНачисления = бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления
		|			И МинПериодРегистрации.Район = бестСтабильныеПериодыПоследовательностьНП.Район
		|			И МинПериодРегистрации.ПериодРегистрации = бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		|			И (бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления)
		|			И (бестСтабильныеПериодыПоследовательностьНП.Район = &Район)
		|			И (бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
		|			И МинПериодРегистрации.Организация = бестСтабильныеПериодыПоследовательностьНП.Организация
		|			И МинПериодРегистрации.МКД = бестСтабильныеПериодыПоследовательностьНП.МКД
		|			И (бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация)
		|			И МинПериодРегистрации.ОбъектРасчета = бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления,
		|	бестСтабильныеПериодыПоследовательностьНП.Район,
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации,
		|	бестСтабильныеПериодыПоследовательностьНП.МКД,
		|	бестСтабильныеПериодыПоследовательностьНП.Организация,
		|	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МинимальныйПериод.ПериодНачисления КАК ПериодНачисления,
		|	МинимальныйПериод.Район КАК Район,
		|	МинимальныйПериод.ПериодРегистрации КАК ПериодРегистрации,
		|	МинимальныйПериод.ДатаРегистратора КАК ДатаРегистратора,
		|	МИНИМУМ(бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор) КАК ДокРегистратор,
		|	МинимальныйПериод.МКД КАК МКД,
		|	МинимальныйПериод.Организация КАК Организация,
		|	МинимальныйПериод.ОбъектРасчета КАК ОбъектРасчета
		|ПОМЕСТИТЬ МинимальныйРегистратор
		|ИЗ
		|	МинимальныйПериод КАК МинимальныйПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		|		ПО МинимальныйПериод.ПериодНачисления = бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления
		|			И МинимальныйПериод.Район = бестСтабильныеПериодыПоследовательностьНП.Район
		|			И МинимальныйПериод.ПериодРегистрации = бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		|			И (бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
		|			И МинимальныйПериод.ДатаРегистратора = бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
		|			И (бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления)
		|			И (бестСтабильныеПериодыПоследовательностьНП.Район = &Район)
		|			И МинимальныйПериод.Организация = бестСтабильныеПериодыПоследовательностьНП.Организация
		|			И МинимальныйПериод.МКД = бестСтабильныеПериодыПоследовательностьНП.МКД
		|			И (бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация)
		|			И МинимальныйПериод.ОбъектРасчета = бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	МинимальныйПериод.ПериодНачисления,
		|	МинимальныйПериод.Район,
		|	МинимальныйПериод.ПериодРегистрации,
		|	МинимальныйПериод.ДатаРегистратора,
		|	МинимальныйПериод.МКД,
		|	МинимальныйПериод.Организация,
		|	МинимальныйПериод.ОбъектРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
		|	МинимальныйРегистратор.Район КАК Район,
		|	бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации КАК ПериодРегистрации,
		|	бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения КАК СостояниеПроведения,
		|	бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора КАК ДатаРегистратора,
		|	бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор КАК ДокРегистратор,
		|	МинимальныйРегистратор.МКД КАК МКД,
		|	МинимальныйРегистратор.Организация КАК Организация,
		|	МинимальныйРегистратор.ОбъектРасчета КАК ОбъектРасчета
		|ИЗ
		|	МинимальныйРегистратор КАК МинимальныйРегистратор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		|		ПО МинимальныйРегистратор.ПериодНачисления = бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления
		|			И МинимальныйРегистратор.Район = бестСтабильныеПериодыПоследовательностьНП.Район
		|			И (ВЫБОР
		|				КОГДА МинимальныйРегистратор.ПериодРегистрации < бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		|					ТОГДА ИСТИНА
		|				КОГДА МинимальныйРегистратор.ПериодРегистрации = бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		|					ТОГДА ВЫБОР
		|							КОГДА МинимальныйРегистратор.ДатаРегистратора < бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
		|								ТОГДА ИСТИНА
		|							КОГДА МинимальныйРегистратор.ДатаРегистратора = бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
		|								ТОГДА МинимальныйРегистратор.ДокРегистратор <= бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|			И (бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления)
		|			И (бестСтабильныеПериодыПоследовательностьНП.Район = &Район)
		|			И (бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация)
		|			И МинимальныйРегистратор.МКД = бестСтабильныеПериодыПоследовательностьНП.МКД
		|			И МинимальныйРегистратор.Организация = бестСтабильныеПериодыПоследовательностьНП.Организация
		|			И МинимальныйРегистратор.ОбъектРасчета = бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектРасчета";
		
		Если Отбор.ИсключаяОтдельностоящие тогда
			Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыПоследовательностьНП.МКД = &МКД","И бестСтабильныеПериодыПоследовательностьНП.МКД <> &МКД");
		Иначе
			Если Отбор.МКД = Неопределено Тогда 
				Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыПоследовательностьНП.МКД = &МКД","");
			КонецЕсли;
		КонецЕсли;
		
		Если Отбор.мОбъектыРасчета = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета В (&мОбъектыРасчета)","");
		КонецЕсли;

	Иначе
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Текст ="ВЫБРАТЬ
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления КАК ПериодНачисления,
		       |	бестСтабильныеПериодыПоследовательностьНП.Район КАК Район,
		       |	МИНИМУМ(бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации) КАК ПериодРегистрации,
		       |	бестСтабильныеПериодыПоследовательностьНП.Организация КАК Организация,
		       |	бестСтабильныеПериодыПоследовательностьНП.МКД КАК МКД,
		       |	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета КАК ОбъектРасчета
		       |ПОМЕСТИТЬ МинПериодРегистрации
		       |ИЗ
		       |	РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		       |ГДЕ
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления
		       |	И бестСтабильныеПериодыПоследовательностьНП.Район = &Район
		       |	И бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация
		       |	И бестСтабильныеПериодыПоследовательностьНП.МКД = &МКД
		       |	И бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета В(&мОбъектыРасчета)
		       |
		       |СГРУППИРОВАТЬ ПО
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления,
		       |	бестСтабильныеПериодыПоследовательностьНП.Район,
		       |	бестСтабильныеПериодыПоследовательностьНП.Организация,
		       |	бестСтабильныеПериодыПоследовательностьНП.МКД,
		       |	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		       |;
		       |
		       |////////////////////////////////////////////////////////////////////////////////
		       |ВЫБРАТЬ
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления КАК ПериодНачисления,
		       |	бестСтабильныеПериодыПоследовательностьНП.Район КАК Район,
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации КАК ПериодРегистрации,
		       |	МИНИМУМ(бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора) КАК ДатаРегистратора,
		       |	бестСтабильныеПериодыПоследовательностьНП.МКД КАК МКД,
		       |	бестСтабильныеПериодыПоследовательностьНП.Организация КАК Организация,
		       |	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета КАК ОбъектРасчета
		       |ПОМЕСТИТЬ МинимальныйПериод
		       |ИЗ
		       |	МинПериодРегистрации КАК МинПериодРегистрации
		       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		       |		ПО МинПериодРегистрации.ПериодНачисления = бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления
		       |			И МинПериодРегистрации.Район = бестСтабильныеПериодыПоследовательностьНП.Район
		       |			И МинПериодРегистрации.ПериодРегистрации = бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		       |			И (бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления)
		       |			И (бестСтабильныеПериодыПоследовательностьНП.Район = &Район)
		       |			И (бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
		       |			И МинПериодРегистрации.Организация = бестСтабильныеПериодыПоследовательностьНП.Организация
		       |			И МинПериодРегистрации.МКД = бестСтабильныеПериодыПоследовательностьНП.МКД
		       |			И (бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация)
		       |			И МинПериодРегистрации.ОбъектРасчета = бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		       |
		       |СГРУППИРОВАТЬ ПО
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления,
		       |	бестСтабильныеПериодыПоследовательностьНП.Район,
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации,
		       |	бестСтабильныеПериодыПоследовательностьНП.МКД,
		       |	бестСтабильныеПериодыПоследовательностьНП.Организация,
		       |	бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		       |;
		       |
		       |////////////////////////////////////////////////////////////////////////////////
		       |ВЫБРАТЬ
		       |	МинимальныйПериод.ПериодНачисления КАК ПериодНачисления,
		       |	МинимальныйПериод.Район КАК Район,
		       |	МинимальныйПериод.ПериодРегистрации КАК ПериодРегистрации,
		       |	МинимальныйПериод.ДатаРегистратора КАК ДатаРегистратора,
		       |	МИНИМУМ(бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор) КАК ДокРегистратор,
		       |	МинимальныйПериод.МКД КАК МКД,
		       |	МинимальныйПериод.Организация КАК Организация,
		       |	МинимальныйПериод.ОбъектРасчета КАК ОбъектРасчета
		       |ПОМЕСТИТЬ МинимальныйРегистратор
		       |ИЗ
		       |	МинимальныйПериод КАК МинимальныйПериод
		       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		       |		ПО МинимальныйПериод.ПериодНачисления = бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления
		       |			И МинимальныйПериод.Район = бестСтабильныеПериодыПоследовательностьНП.Район
		       |			И МинимальныйПериод.ПериодРегистрации = бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		       |			И (бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
		       |			И МинимальныйПериод.ДатаРегистратора = бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
		       |			И (бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления)
		       |			И (бестСтабильныеПериодыПоследовательностьНП.Район = &Район)
		       |			И МинимальныйПериод.Организация = бестСтабильныеПериодыПоследовательностьНП.Организация
		       |			И МинимальныйПериод.МКД = бестСтабильныеПериодыПоследовательностьНП.МКД
		       |			И (бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация)
		       |			И МинимальныйПериод.ОбъектРасчета = бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		       |
		       |СГРУППИРОВАТЬ ПО
		       |	МинимальныйПериод.ПериодНачисления,
		       |	МинимальныйПериод.Район,
		       |	МинимальныйПериод.ПериодРегистрации,
		       |	МинимальныйПериод.ДатаРегистратора,
		       |	МинимальныйПериод.МКД,
		       |	МинимальныйПериод.Организация,
		       |	МинимальныйПериод.ОбъектРасчета
		       |;
		       |
		       |////////////////////////////////////////////////////////////////////////////////
		       |ВЫБРАТЬ
		       |	МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
		       |	МинимальныйРегистратор.Район КАК Район,
		       |	бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации КАК ПериодРегистрации,
		       |	бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения КАК СостояниеПроведения,
		       |	бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора КАК ДатаРегистратора,
		       |	бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор КАК ДокРегистратор,
		       |	МинимальныйРегистратор.МКД КАК МКД,
		       |	МинимальныйРегистратор.Организация КАК Организация,
		       |	МинимальныйРегистратор.ОбъектРасчета КАК ОбъектРасчета
		       |ИЗ
		       |	МинимальныйРегистратор КАК МинимальныйРегистратор
		       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
		       |		ПО МинимальныйРегистратор.ПериодНачисления = бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления
		       |			И МинимальныйРегистратор.Район = бестСтабильныеПериодыПоследовательностьНП.Район
		       |			И (ВЫБОР
		       |				КОГДА МинимальныйРегистратор.ПериодРегистрации < бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		       |					ТОГДА ИСТИНА
		       |				КОГДА МинимальныйРегистратор.ПериодРегистрации = бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
		       |					ТОГДА ВЫБОР
		       |							КОГДА МинимальныйРегистратор.ДатаРегистратора < бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
		       |								ТОГДА ИСТИНА
		       |							КОГДА МинимальныйРегистратор.ДатаРегистратора = бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
		       |								ТОГДА МинимальныйРегистратор.ДокРегистратор <= бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор
		       |							ИНАЧЕ ЛОЖЬ
		       |						КОНЕЦ
		       |				ИНАЧЕ ЛОЖЬ
		       |			КОНЕЦ)
		       |			И (бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления)
		       |			И (бестСтабильныеПериодыПоследовательностьНП.Район = &Район)
		       |			И (бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация)
		       |			И МинимальныйРегистратор.МКД = бестСтабильныеПериодыПоследовательностьНП.МКД
		       |			И МинимальныйРегистратор.Организация = бестСтабильныеПериодыПоследовательностьНП.Организация
		       |			И МинимальныйРегистратор.ОбъектРасчета = бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
		       |
		       |ОБЪЕДИНИТЬ ВСЕ
		       |
		       |ВЫБРАТЬ
		       |	ДанныеПерерасчета.ПериодНачисления,
		       |	ДанныеПерерасчета.Район,
		       |	ДанныеПерерасчета.ПериодРегистрации,
		       |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности),
		       |	ДанныеПерерасчета.ПериодРегистрации,
		       |	ДанныеПерерасчета.ДокРегистратор,
		       |	ДанныеПерерасчета.МКД,
		       |	ДанныеПерерасчета.Организация,
		       |	ДанныеПерерасчета.ОбъектРасчета
		       |ИЗ
		       |	ДанныеПерерасчета КАК ДанныеПерерасчета
		       |ГДЕ
		       |	ДанныеПерерасчета.ОбъектРасчета В(&мОбъектыРасчета)
		       |	И ДанныеПерерасчета.ПериодНачисления = &ПериодНачисления
		       |
		       |УПОРЯДОЧИТЬ ПО
		       |	ОбъектРасчета";

			   
			   
			   
			   
			   //|ВЫБРАТЬ
			   //|	МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
			   //|	МинимальныйРегистратор.Район КАК Район,
			   //|	ЕСТЬNULL(бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации, МинимальныйРегистратор.ПериодРегистрации) КАК ПериодРегистрации,
			   //|	ЕСТЬNULL(бестСтабильныеПериодыПоследовательностьНП.СостояниеПроведения, ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)) КАК СостояниеПроведения,
			   //|	ЕСТЬNULL(бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора, МинимальныйРегистратор.ДатаРегистратора) КАК ДатаРегистратора,
			   //|	ЕСТЬNULL(бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор, МинимальныйРегистратор.ДокРегистратор) КАК ДокРегистратор,
			   //|	МинимальныйРегистратор.МКД КАК МКД,
			   //|	МинимальныйРегистратор.Организация КАК Организация,
			   //|	МинимальныйРегистратор.ОбъектРасчета КАК ОбъектРасчета
			   //|ИЗ
			   //|	МинимальныйРегистратор КАК МинимальныйРегистратор
			   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыПоследовательностьНП КАК бестСтабильныеПериодыПоследовательностьНП
			   //|		ПО МинимальныйРегистратор.ПериодНачисления = бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления
			   //|			И МинимальныйРегистратор.Район = бестСтабильныеПериодыПоследовательностьНП.Район
			   //|			И (ВЫБОР
			   //|				КОГДА МинимальныйРегистратор.ПериодРегистрации < бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
			   //|					ТОГДА ИСТИНА
			   //|				КОГДА МинимальныйРегистратор.ПериодРегистрации = бестСтабильныеПериодыПоследовательностьНП.ПериодРегистрации
			   //|					ТОГДА ВЫБОР
			   //|							КОГДА МинимальныйРегистратор.ДатаРегистратора < бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
			   //|								ТОГДА ИСТИНА
			   //|							КОГДА МинимальныйРегистратор.ДатаРегистратора = бестСтабильныеПериодыПоследовательностьНП.ДатаРегистратора
			   //|								ТОГДА МинимальныйРегистратор.ДокРегистратор <= бестСтабильныеПериодыПоследовательностьНП.ДокРегистратор
			   //|							ИНАЧЕ ЛОЖЬ
			   //|						КОНЕЦ
			   //|				ИНАЧЕ ЛОЖЬ
			   //|			КОНЕЦ)
			   //|			И (бестСтабильныеПериодыПоследовательностьНП.ПериодНачисления = &ПериодНачисления)
			   //|			И (бестСтабильныеПериодыПоследовательностьНП.Район = &Район)
			   //|			И (бестСтабильныеПериодыПоследовательностьНП.Организация = &Организация)
			   //|			И МинимальныйРегистратор.МКД = бестСтабильныеПериодыПоследовательностьНП.МКД
			   //|			И МинимальныйРегистратор.Организация = бестСтабильныеПериодыПоследовательностьНП.Организация
			   //|			И МинимальныйРегистратор.ОбъектРасчета = бестСтабильныеПериодыПоследовательностьНП.ОбъектРасчета
			   //|
			   //|УПОРЯДОЧИТЬ ПО
			   //|	ОбъектРасчета";
		
	КонецЕсли;
	 	
		
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Организация",		 Отбор.Организация);
	Запрос.УстановитьПараметр("Район",				 Отбор.район);
	Запрос.УстановитьПараметр("ПериодНачисления",	 Отбор.ПериодНачисления);
	Запрос.УстановитьПараметр("КонецПериодаРасчета", Отбор.КонецПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",Отбор.НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("МКД",				 Отбор.МКД);
	Запрос.УстановитьПараметр("мОбъектыРасчета",	 Отбор.мОбъектыРасчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область ВосстановитьПоследовательностьПоказанияПУНП

Процедура ОбновитьДанныеВДокументеНП(ПериодНачисления,ДокРегистратор,ПараметрыОперации)
	
	ПоказанияПриняты 									= Перечисления.энргСостояниеПоказаний.Приняты;
	
	ДокОбъект  											= ДокРегистратор.получитьОбъект();
	ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
	
	Если ЗначениеЗаполнено(ПараметрыОперации.ИмяТабЧасти) тогда
		ИмяТЧ 											= ПараметрыОперации.ИмяТабЧасти;
	иначе
		ИмяТЧ 											= ИмяТабличнойЧастиПоказанийНП(ДокРегистратор);
	КонецЕсли;
	
	тчТочкиУчета 										= ДокОбъект["ТочкиУчета"];
	тчШкалыПриборов 									= ДокОбъект["ШкалыПриборовУчета"];
	тчПоказания 										= ДокОбъект["ПоказанияПриборовУчета"];
	
	Если ПараметрыОперации.НомерСтрокиТЧ > 0 тогда
		СтрокаПоказаний									= тчПоказания[ПараметрыОперации.НомерСтрокиТЧ-1];
		СтрокиШкал										= тчШкалыПриборов.НайтиСтроки(Новый Структура("IDСтроки", СтрокаПоказаний.IDСтроки));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;		
		СтрокаШкалы 									= СтрокиШкал[0];
		СтрокиТочки										= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтрокиТочкиУчета));
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;
		СтрокаТочки 									= СтрокиТочки[0];
	иначе		
		СтрокиТочки		 								= тчТочкиУчета.найтиСтроки(Новый Структура("ПриборУчета",ПараметрыОперации.ПриборУчета));
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;		
		СтрокаТочки  									= СтрокиТочки[0];
		
		СтрокиШкал 										= тчШкалыПриборов.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета, Шкала",СтрокаТочки.IDСтроки, ПараметрыОперации.Шкала));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаШкалы                                    	= СтрокиШкал[0];
		СтрокиПоказаний 								= тчПоказания.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", СтрокаШкалы.IDСтроки, ПараметрыОперации.ТарифнаяЗона));
		Если СтрокиПоказаний.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета " +  ПараметрыОперации.ПриборУчета + " и тарифной зоны " +  ПараметрыОперации.ТарифнаяЗона  + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаПоказаний 								= СтрокиПоказаний[0];
		
	КонецЕсли;
	
	ДанныеСреднегоОбъема 								= ПараметрыОперации.ДанныеСреднегоОбъема;
	
	Если СтрокаТочки = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли  ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала] = Неопределено тогда
		СреднийОбъема 									= 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона] = Неопределено тогда
		СреднийОбъема 									= 0;
	иначе
		СреднийОбъема 									= ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона];
	КонецЕсли;
	
	ДанныеМаксимальногоПотребления 						= ПараметрыОперации.ДанныеМаксимальногоПотребления;
	Если ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга] = Неопределено тогда
		МаксимальноВозможныйОбъемПотребления 			= 1000;
	иначе 
		СтрокаСоотвествия 								= ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга];
		МаксимальноВозможныйОбъемПотребления 			= СтрокаСоотвествия.ПовышающийКоэффициент * СтрокаСоотвествия.МаксимальноеПотребления;	
	КонецЕсли;
	
	ДанныеСтроки 										= бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ДанныеСтрокиПоказаний();
	ДанныеСтрокиДляСравнения 							= бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ДанныеСтрокиПоказаний();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиДляСравнения, СтрокаПоказаний);
	
	СтруктураСтрокаПоказаний = Новый Структура("ТекущиеПоказания, Разница, ПереворотИзмененПользователем, СтатусИзмененПользователем, ДопустимыйОбъемОтклонений, РасходЗаПредМесяц, РасходЗаАналогичныйПериодПредГода");
	ЗаполнитьЗначенияСвойств(СтруктураСтрокаПоказаний, ДанныеСтроки);
	ЗаполнитьЗначенияСвойств(СтруктураСтрокаПоказаний, СтрокаПоказаний);
	//ДанныеСтроки.Сумма				 					= СтрокаТЧ.Сумма;
	
	ДанныеСтроки.ПредыдущиеПоказания 					= ПараметрыОперации.ПредыдущиеМакс;
	ДанныеСтроки.ДатаПоследнихПоказаний 				= НачалоДня(ПараметрыОперации.ПериодПредыдущихМаксПок);
	ДанныеСтроки.СостояниеПоказаний 					= ПараметрыОперации.СостояниеПоказаний; 	
	ДанныеСтроки.СреднийОбъемПотребления 				= СреднийОбъема;
	ДанныеСтроки.МаксимальноВозможныеПоказания			= ПараметрыОперации.МаксимальноВозможныеПоказания;
	ДанныеСтроки.МаксимальноВозможныйОбъемПотребления	= МаксимальноВозможныйОбъемПотребления; 
	ДанныеСтроки.КоэффициентПУ							= ПараметрыОперации.КоэффициентПУ; 	
	ДанныеСтроки.Переворот 								= ПараметрыОперации.Переворот;
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтруктураСтрокаПоказаний);
	//ДанныеСтроки.ЗначениеТарифа				 			= СтрокаТЧ.ЗначениеТарифа;		
	КонтрольныйСъем 									= ПараметрыОперации.КС;
	
	бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(ДанныеСтроки,ПериодНачисления,КонтрольныйСъем);
	
	Если ДанныеСтрокиИзмененыНП(ДанныеСтроки, ДанныеСтрокиДляСравнения) Тогда
		// Если что то изменилось в документе.
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, ДанныеСтроки);				
		ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности",Истина);
		ДокОбъект.записать();
	КонецЕсли;
	
	Если ДанныеСтроки.СостояниеПоказаний <> ПараметрыОперации.СостояниеПоказаний или ДанныеСтроки.Переворот <> ПараметрыОперации.Переворот тогда
		// Если данные изменились записываем их.
		НаборПоказаний 								= РегистрыСведений.бестПоказанияПриборовУчетаНП.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Прочитать();
		ТаблицаПоказаний  							= НаборПоказаний.Выгрузить();
		для Каждого стр из ТаблицаПоказаний цикл
			стр.активность 							= истина;
		КонецЦикла;   			
		НаборПоказаний.Очистить();
		НаборПоказаний.Записать();
		СтрокиПоказаний  							= ТаблицаПоказаний.НайтиСтроки(Новый Структура("ОбъектРасчета,ПриборУчета,ТарифнаяЗона,Разделитель",ПараметрыОперации.ОбъектРасчета,ПараметрыОперации.ПриборУчета,ПараметрыОперации.ТарифнаяЗона,ПараметрыОперации.Разделитель)); 
		Если СтрокиПоказаний.Количество() = 0 тогда 	
			// Движений по данному пу нету.	
			Если СтрокаПоказаний.ТекущиеПоказания > 0 тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
			КонецЕсли;				
		иначеЕсли СтрокиПоказаний.Количество() > 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПараметрыОперации.ПриборУчета);
		иначе
			СтрокаПоказаний  						= СтрокиПоказаний[0];
			СтрокаПоказаний.Показание 				= ДанныеСтроки.ТекущиеПоказания;
			СтрокаПоказаний.Переворот 				= ДанныеСтроки.Переворот;
			СтрокаПоказаний.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
			СтрокаПоказаний.Разница 				= ДанныеСтроки.Разница;
		КонецЕсли;			
		
		// Записываем новый набор показаний.
		НаборПоказаний 								= РегистрыСведений.бестПоказанияПриборовУчетаНП.СоздатьНаборЗаписей();
		НаборПоказаний.Отбор.регистратор.установить(ДокРегистратор);
		НаборПоказаний.Загрузить(ТаблицаПоказаний);
		НаборПоказаний.Записать(Ложь);			
		ПараметрыОперации.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
		ПараметрыОперации.Переворот 				= ДанныеСтроки.Переворот;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеСреднегоОбъемаНП(ВыборкаСреднийОбъем,ТекОбъект) 
	
	ТекТочкаУчета					= Неопределено;
	ТекШкала 						= Неопределено;
	СоотвествиеТочек 				= Новый Соответствие;
	СоответствиеЗоны 				= Неопределено;
	СоотвествиеШкал 				= Неопределено;
	Пока ВыборкаСреднийОбъем.ОбъектРасчета  = ТекОбъект цикл		
		Если ЗначениеЗаполнено(ВыборкаСреднийОбъем.Шкала) и ЗначениеЗаполнено(ВыборкаСреднийОбъем.ТарифнаяЗона) Тогда
			Если ТекШкала <> ВыборкаСреднийОбъем.Шкала Тогда
				Если ТекШкала <> Неопределено тогда
					СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли;
			
			Если ТекТочкаУчета <> ВыборкаСреднийОбъем.ТочкаУчета тогда
				Если ТекТочкаУчета <> Неопределено тогда
					СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли; 	
			
			СоответствиеЗоны.Вставить(ВыборкаСреднийОбъем.ТарифнаяЗона,ВыборкаСреднийОбъем.СреднееПотребление);
		КонецЕсли;
		
		Если не ВыборкаСреднийОбъем.следующий() тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Если ТекШкала <> Неопределено тогда
		СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
	КонецЕсли;		
	
	Если ТекТочкаУчета <> Неопределено тогда
		СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
	КонецЕсли;	  
	
	Возврат СоотвествиеТочек;
	
КонецФункции

Функция РезультатСреднийОбъемПотребленияНП(МВТ,Отбор)
	
	Запрос 	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц =МВТ;
	Текст 	=
	"ВЫБРАТЬ
	|	бестСреднийОбъемПотребленияНП.Организация КАК Организация,
	|	бестСреднийОбъемПотребленияНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСреднийОбъемПотребленияНП.Район КАК Район,
	|	бестСреднийОбъемПотребленияНП.МКД КАК МКД,
	|	бестСреднийОбъемПотребленияНП.ТочкаУчета КАК ТочкаУчета,
	|	бестСреднийОбъемПотребленияНП.Шкала КАК Шкала,
	|	бестСреднийОбъемПотребленияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестСреднийОбъемПотребленияНП.Объем КАК Объем,
	|	бестСреднийОбъемПотребленияНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ СреднийОбъем
	|ИЗ
	|	РегистрСведений.бестСреднийОбъемПотребленияНП КАК бестСреднийОбъемПотребленияНП
	|ГДЕ
	|	бестСреднийОбъемПотребленияНП.Организация = &Организация
	|	И бестСреднийОбъемПотребленияНП.ПериодНачисления = &ПериодНачисления
	|	И бестСреднийОбъемПотребленияНП.Район = &Район
	|	И бестСреднийОбъемПотребленияНП.МКД = &МКД
	|	И бестСреднийОбъемПотребленияНП.ОбъектРасчета В(&ОбъектРасчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Граница.Организация КАК Организация,
	|	Граница.ПериодНачисления КАК ПериодНачисления,
	|	Граница.Район КАК Район,
	|	Граница.МКД КАК МКД,
	|	ЕСТЬNULL(СреднийОбъем.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчета,
	|	ЕСТЬNULL(СреднийОбъем.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СреднийОбъем.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(СреднийОбъем.Объем, 0) КАК СреднееПотребление,
	|	СреднийОбъем.ОбъектРасчета КАК ОбъектРасчета
	|ИЗ
	|	Граница КАК Граница
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъем КАК СреднийОбъем
	|		ПО Граница.Организация = СреднийОбъем.Организация
	|			И Граница.ПериодНачисления = СреднийОбъем.ПериодНачисления
	|			И Граница.Район = СреднийОбъем.Район
	|			И Граница.ОбъектРасчета = СреднийОбъем.ОбъектРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	ОбъектРасчета,
	|	Шкала,
	|	ТарифнаяЗона"; 
	
	
	Запрос.УстановитьПараметр("Район",				Отбор.район);
	Запрос.УстановитьПараметр("Организация",		Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	Отбор.ПериодНачисления);
	Запрос.УстановитьПараметр("МКД",				Отбор.МКД);
	Запрос.УстановитьПараметр("ОбъектРасчета",		Отбор.ОбъектРасчета);
	
	Если Отбор.ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"И бестСреднийОбъемПотребленияНП.МКД = &МКД","И бестСреднийОбъемПотребленияНП.МКД <> &МКД");
	Иначе
		Если Отбор.МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"И бестСреднийОбъемПотребленияНП.МКД = &МКД","");
		КонецЕсли;
	КонецЕсли;
	
	Если Отбор.ОбъектРасчета = Неопределено Тогда 
		Текст = СтрЗаменить(Текст,"бестСреднийОбъемПотребленияНП.ОбъектРасчета В(&ОбъектРасчета)","ИСТИНА");
	КонецЕсли;

	
	Запрос.Текст 	= Текст;
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДанныеМаксимальногоПотребления(НачалоПериодаРасчета)
	МаксПотреб		 = Новый Соответствие;
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",КонецМесяца(НачалоПериодаРасчета)+1);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.Услуга,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ТарифнаяЗона,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.ПовышающийКоэффициент,
	|	энргМаксимальныеПоказателиПотребленияСрезПоследних.МаксимальноеПотребления
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказателиПотребления.СрезПоследних(&Период, ) КАК энргМаксимальныеПоказателиПотребленияСрезПоследних";
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		МаксПотреб.Вставить(Выборка.Услуга,Новый Структура("ПовышающийКоэффициент,МаксимальноеПотребления",Выборка.ПовышающийКоэффициент,Выборка.МаксимальноеПотребления));
	КонецЦикла;
	
	Возврат МаксПотреб;
КонецФункции

Функция ДанныеСтрокиИзмененыНП(Источник,Приемник)	
	
	Для Каждого КлючЗначение Из Источник Цикл
		Если Источник[КлючЗначение.ключ] <> Приемник[КлючЗначение.ключ] Тогда
			Возврат Истина;
			Прервать;				
		КонецЕсли;  		
	КонецЦикла; 	
	Возврат Ложь;
	
КонецФункции

Функция РезультатЗапросаПоказанияПУНП(МВТ, Отбор, НачалоПериодаРасчета, Перерасчет) 
	
	Запрос  = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Текст ="ВЫБРАТЬ
	       |	бестПоказанияПУНППоследовательность.Организация КАК Организация,
	       |	бестПоказанияПУНППоследовательность.ПериодНачисления КАК ПериодНачисления,
	       |	бестПоказанияПУНППоследовательность.Район КАК Район,
	       |	бестПоказанияПУНППоследовательность.МКД КАК МКД,
	       |	бестПоказанияПУНППоследовательность.ПриборУчета КАК ПриборУчета,
	       |	МИНИМУМ(бестПоказанияПУНППоследовательность.ПериодРегистрации) КАК ПериодРегистрации,
	       |	бестПоказанияПУНППоследовательность.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МинимальныйПериод
	       |ИЗ
	       |	РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	       |ГДЕ
	       |	бестПоказанияПУНППоследовательность.Организация = &Организация
	       |	И бестПоказанияПУНППоследовательность.ПериодНачисления = &ПериодНачисления
	       |	И бестПоказанияПУНППоследовательность.Район = &Район
	       |	И бестПоказанияПУНППоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	       |	И бестПоказанияПУНППоследовательность.МКД = &МКД
	       |	И бестПоказанияПУНППоследовательность.ОбъектРасчета В(&ОбъектРасчета)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	бестПоказанияПУНППоследовательность.Организация,
	       |	бестПоказанияПУНППоследовательность.ПериодНачисления,
	       |	бестПоказанияПУНППоследовательность.МКД,
	       |	бестПоказанияПУНППоследовательность.Район,
	       |	бестПоказанияПУНППоследовательность.ПриборУчета,
	       |	бестПоказанияПУНППоследовательность.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	МинимальныйПериод.Организация КАК Организация,
	       |	МинимальныйПериод.ПериодНачисления КАК ПериодНачисления,
	       |	МинимальныйПериод.Район КАК Район,
	       |	МинимальныйПериод.МКД КАК МКД,
	       |	МинимальныйПериод.ПриборУчета КАК ПриборУчета,
	       |	МинимальныйПериод.ПериодРегистрации КАК ПериодРегистрации,
	       |	МИНИМУМ(бестПоказанияПУНППоследовательность.ДатаРегистратора) КАК ДатаРегистратора,
	       |	МинимальныйПериод.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МинимальнаяДатаРегистратора
	       |ИЗ
	       |	МинимальныйПериод КАК МинимальныйПериод
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	       |		ПО МинимальныйПериод.Организация = бестПоказанияПУНППоследовательность.Организация
	       |			И МинимальныйПериод.ПериодНачисления = бестПоказанияПУНППоследовательность.ПериодНачисления
	       |			И МинимальныйПериод.Район = бестПоказанияПУНППоследовательность.Район
	       |			И (бестПоказанияПУНППоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	       |			И МинимальныйПериод.ПриборУчета = бестПоказанияПУНППоследовательность.ПриборУчета
	       |			И МинимальныйПериод.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |			И (бестПоказанияПУНППоследовательность.Организация = &Организация)
	       |			И (бестПоказанияПУНППоследовательность.ПериодНачисления = &ПериодНачисления)
	       |			И (бестПоказанияПУНППоследовательность.Район = &Район)
	       |			И МинимальныйПериод.ОбъектРасчета = бестПоказанияПУНППоследовательность.ОбъектРасчета
	       |			И (бестПоказанияПУНППоследовательность.МКД = &МКД)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	МинимальныйПериод.Организация,
	       |	МинимальныйПериод.ПериодНачисления,
	       |	МинимальныйПериод.Район,
	       |	МинимальныйПериод.МКД,
	       |	МинимальныйПериод.ПриборУчета,
	       |	МинимальныйПериод.ПериодРегистрации,
	       |	МинимальныйПериод.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	МинимальнаяДатаРегистратора.Организация КАК Организация,
	       |	МинимальнаяДатаРегистратора.ПериодНачисления КАК ПериодНачисления,
	       |	МинимальнаяДатаРегистратора.Район КАК Район,
	       |	МинимальнаяДатаРегистратора.МКД КАК МКД,
	       |	МинимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	       |	МинимальнаяДатаРегистратора.ПериодРегистрации КАК ПериодРегистрации,
	       |	МинимальнаяДатаРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	       |	МИНИМУМ(бестПоказанияПУНППоследовательность.ДокРегистратор) КАК ДокРегистратор,
	       |	МинимальнаяДатаРегистратора.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МинимальныйРегистратор
	       |ИЗ
	       |	МинимальнаяДатаРегистратора КАК МинимальнаяДатаРегистратора
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	       |		ПО МинимальнаяДатаРегистратора.Организация = бестПоказанияПУНППоследовательность.Организация
	       |			И МинимальнаяДатаРегистратора.ПериодНачисления = бестПоказанияПУНППоследовательность.ПериодНачисления
	       |			И МинимальнаяДатаРегистратора.Район = бестПоказанияПУНППоследовательность.Район
	       |			И (бестПоказанияПУНППоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	       |			И МинимальнаяДатаРегистратора.ОбъектРасчета = бестПоказанияПУНППоследовательность.ОбъектРасчета
	       |			И МинимальнаяДатаРегистратора.ПриборУчета = бестПоказанияПУНППоследовательность.ПриборУчета
	       |			И МинимальнаяДатаРегистратора.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |			И (бестПоказанияПУНППоследовательность.Организация = &Организация)
	       |			И (бестПоказанияПУНППоследовательность.ПериодНачисления = &ПериодНачисления)
	       |			И (бестПоказанияПУНППоследовательность.Район = &Район)
	       |			И (бестПоказанияПУНППоследовательность.МКД = &МКД)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	МинимальнаяДатаРегистратора.Организация,
	       |	МинимальнаяДатаРегистратора.ПериодНачисления,
	       |	МинимальнаяДатаРегистратора.Район,
	       |	МинимальнаяДатаРегистратора.МКД,
	       |	МинимальнаяДатаРегистратора.ПриборУчета,
	       |	МинимальнаяДатаРегистратора.ПериодРегистрации,
	       |	МинимальнаяДатаРегистратора.ДатаРегистратора,
	       |	МинимальнаяДатаРегистратора.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВложенныйЗапрос.Организация КАК Организация,
	       |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	       |	ВложенныйЗапрос.Район КАК Район,
	       |	ВложенныйЗапрос.МКД КАК МКД,
	       |	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	       |	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	       |	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	       |	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	       |	ВложенныйЗапрос.Разделитель КАК Разделитель,
	       |	ВЫБОР
	       |		КОГДА ВложенныйЗапрос.ПериодРегистрации < &НачалоПериодаРасчета
	       |			ТОГДА &НачалоПериодаРасчета
	       |		ИНАЧЕ ВложенныйЗапрос.ПериодРегистрации
	       |	КОНЕЦ КАК ПериодРегистрацииПоказаний,
	       |	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ Граница
	       |ИЗ
	       |	(ВЫБРАТЬ
	       |		МинимальныйРегистратор.Организация КАК Организация,
	       |		МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
	       |		МинимальныйРегистратор.Район КАК Район,
	       |		МинимальныйРегистратор.МКД КАК МКД,
	       |		МинимальныйРегистратор.ПриборУчета КАК ПриборУчета,
	       |		МинимальныйРегистратор.ПериодРегистрации КАК ПериодРегистрации,
	       |		МинимальныйРегистратор.ДатаРегистратора КАК ДатаРегистратора,
	       |		МинимальныйРегистратор.ДокРегистратор КАК ДокРегистратор,
	       |		МИНИМУМ(бестПоказанияПУНППоследовательность.Разделитель) КАК Разделитель,
	       |		МинимальныйРегистратор.ОбъектРасчета КАК ОбъектРасчета
	       |	ИЗ
	       |		МинимальныйРегистратор КАК МинимальныйРегистратор
	       |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	       |			ПО МинимальныйРегистратор.Организация = бестПоказанияПУНППоследовательность.Организация
	       |				И МинимальныйРегистратор.ПериодНачисления = бестПоказанияПУНППоследовательность.ПериодНачисления
	       |				И МинимальныйРегистратор.Район = бестПоказанияПУНППоследовательность.Район
	       |				И МинимальныйРегистратор.ПриборУчета = бестПоказанияПУНППоследовательность.ПриборУчета
	       |				И МинимальныйРегистратор.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |				И МинимальныйРегистратор.ДатаРегистратора = бестПоказанияПУНППоследовательность.ДатаРегистратора
	       |				И (бестПоказанияПУНППоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	       |				И (бестПоказанияПУНППоследовательность.Организация = &Организация)
	       |				И (бестПоказанияПУНППоследовательность.ПериодНачисления = &ПериодНачисления)
	       |				И (бестПоказанияПУНППоследовательность.Район = &Район)
	       |				И МинимальныйРегистратор.ПриборУчета = бестПоказанияПУНППоследовательность.ПриборУчета
	       |				И МинимальныйРегистратор.ОбъектРасчета = бестПоказанияПУНППоследовательность.ОбъектРасчета
	       |	
	       |	СГРУППИРОВАТЬ ПО
	       |		МинимальныйРегистратор.Организация,
	       |		МинимальныйРегистратор.ПериодНачисления,
	       |		МинимальныйРегистратор.Район,
	       |		МинимальныйРегистратор.МКД,
	       |		МинимальныйРегистратор.ПриборУчета,
	       |		МинимальныйРегистратор.ПериодРегистрации,
	       |		МинимальныйРегистратор.ДатаРегистратора,
	       |		МинимальныйРегистратор.ДокРегистратор,
	       |		МинимальныйРегистратор.ОбъектРасчета) КАК ВложенныйЗапрос
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	бестПоказанияПУНППоследовательность.Организация КАК Организация,
	       |	бестПоказанияПУНППоследовательность.ПериодНачисления КАК ПериодНачисления,
	       |	бестПоказанияПУНППоследовательность.Район КАК Район,
	       |	бестПоказанияПУНППоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	       |	бестПоказанияПУНППоследовательность.МКД КАК МКД,
	       |	бестПоказанияПУНППоследовательность.ПриборУчета КАК ПриборУчета,
	       |	бестПоказанияПУНППоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	       |	бестПоказанияПУНППоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	       |	бестПоказанияПУНППоследовательность.ДокРегистратор КАК ДокРегистратор,
	       |	бестПоказанияПУНППоследовательность.Разделитель КАК Разделитель,
	       |	бестПоказанияПУНППоследовательность.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ НаборПроведенныхВПоследовательности
	       |ИЗ
	       |	Граница КАК Граница
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	       |		ПО Граница.Организация = бестПоказанияПУНППоследовательность.Организация
	       |			И Граница.ПериодНачисления = бестПоказанияПУНППоследовательность.ПериодНачисления
	       |			И Граница.Район = бестПоказанияПУНППоследовательность.Район
	       |			И Граница.ПриборУчета = бестПоказанияПУНППоследовательность.ПриборУчета
	       |			И (ВЫБОР
	       |				КОГДА Граница.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |						И Граница.ДатаРегистратора = бестПоказанияПУНППоследовательность.ДатаРегистратора
	       |						И Граница.ДокРегистратор = бестПоказанияПУНППоследовательность.ДокРегистратор
	       |						И Граница.Разделитель > бестПоказанияПУНППоследовательность.Разделитель
	       |					ТОГДА ИСТИНА
	       |				КОГДА Граница.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |						И Граница.ДатаРегистратора = бестПоказанияПУНППоследовательность.ДатаРегистратора
	       |						И Граница.ДокРегистратор > бестПоказанияПУНППоследовательность.ДокРегистратор
	       |					ТОГДА ИСТИНА
	       |				КОГДА Граница.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |						И Граница.ДатаРегистратора > бестПоказанияПУНППоследовательность.ДатаРегистратора
	       |					ТОГДА ИСТИНА
	       |				ИНАЧЕ Граница.ПериодРегистрации > бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |			КОНЕЦ)
	       |			И (бестПоказанияПУНППоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности))
	       |			И (бестПоказанияПУНППоследовательность.Организация = &Организация)
	       |			И (бестПоказанияПУНППоследовательность.ПериодНачисления = &ПериодНачисления)
	       |			И (бестПоказанияПУНППоследовательность.Район = &Район)
	       |			И (бестПоказанияПУНППоследовательность.МКД = &МКД)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	НаборПроведенныхВПоследовательности.Организация КАК Организация,
	       |	НаборПроведенныхВПоследовательности.ПериодНачисления КАК ПериодНачисления,
	       |	НаборПроведенныхВПоследовательности.Район КАК Район,
	       |	НаборПроведенныхВПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	       |	НаборПроведенныхВПоследовательности.МКД КАК МКД,
	       |	НаборПроведенныхВПоследовательности.ПриборУчета КАК ПриборУчета,
	       |	МАКСИМУМ(НаборПроведенныхВПоследовательности.ПериодРегистрации) КАК ПериодРегистрации,
	       |	НаборПроведенныхВПоследовательности.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МаксимальныйПериодРегистрацииПроведенных
	       |ИЗ
	       |	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	НаборПроведенныхВПоследовательности.Организация,
	       |	НаборПроведенныхВПоследовательности.ПериодНачисления,
	       |	НаборПроведенныхВПоследовательности.Район,
	       |	НаборПроведенныхВПоследовательности.СостояниеПроведения,
	       |	НаборПроведенныхВПоследовательности.МКД,
	       |	НаборПроведенныхВПоследовательности.ПриборУчета,
	       |	НаборПроведенныхВПоследовательности.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	МаксимальныйПериодРегистрацииПроведенных.Организация КАК Организация,
	       |	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления КАК ПериодНачисления,
	       |	МаксимальныйПериодРегистрацииПроведенных.Район КАК Район,
	       |	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	       |	МаксимальныйПериодРегистрацииПроведенных.МКД КАК МКД,
	       |	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета КАК ПриборУчета,
	       |	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	       |	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДатаРегистратора) КАК ДатаРегистратора,
	       |	МаксимальныйПериодРегистрацииПроведенных.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МаксимальнаяДатаПроведенных
	       |ИЗ
	       |	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериодРегистрацииПроведенных КАК МаксимальныйПериодРегистрацииПроведенных
	       |		ПО НаборПроведенныхВПоследовательности.Организация = МаксимальныйПериодРегистрацииПроведенных.Организация
	       |			И НаборПроведенныхВПоследовательности.ПериодНачисления = МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления
	       |			И НаборПроведенныхВПоследовательности.Район = МаксимальныйПериодРегистрацииПроведенных.Район
	       |			И НаборПроведенныхВПоследовательности.СостояниеПроведения = МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения
	       |			И НаборПроведенныхВПоследовательности.ОбъектРасчета = МаксимальныйПериодРегистрацииПроведенных.ОбъектРасчета
	       |			И НаборПроведенныхВПоследовательности.ПриборУчета = МаксимальныйПериодРегистрацииПроведенных.ПриборУчета
	       |			И НаборПроведенныхВПоследовательности.ПериодРегистрации = МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	МаксимальныйПериодРегистрацииПроведенных.Организация,
	       |	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления,
	       |	МаксимальныйПериодРегистрацииПроведенных.Район,
	       |	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения,
	       |	МаксимальныйПериодРегистрацииПроведенных.МКД,
	       |	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета,
	       |	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации,
	       |	МаксимальныйПериодРегистрацииПроведенных.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	МаксимальнаяДатаПроведенных.Организация КАК Организация,
	       |	МаксимальнаяДатаПроведенных.ПериодНачисления КАК ПериодНачисления,
	       |	МаксимальнаяДатаПроведенных.Район КАК Район,
	       |	МаксимальнаяДатаПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	       |	МаксимальнаяДатаПроведенных.МКД КАК МКД,
	       |	МаксимальнаяДатаПроведенных.ПриборУчета КАК ПриборУчета,
	       |	МаксимальнаяДатаПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	       |	МаксимальнаяДатаПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	       |	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДокРегистратор) КАК ДокРегистратор,
	       |	МаксимальнаяДатаПроведенных.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МаксимальныйРегистраторПроведенных
	       |ИЗ
	       |	МаксимальнаяДатаПроведенных КАК МаксимальнаяДатаПроведенных
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	       |		ПО МаксимальнаяДатаПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	       |			И МаксимальнаяДатаПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	       |			И МаксимальнаяДатаПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	       |			И МаксимальнаяДатаПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	       |			И МаксимальнаяДатаПроведенных.ОбъектРасчета = НаборПроведенныхВПоследовательности.ОбъектРасчета
	       |			И МаксимальнаяДатаПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	       |			И МаксимальнаяДатаПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	       |			И МаксимальнаяДатаПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	МаксимальнаяДатаПроведенных.Организация,
	       |	МаксимальнаяДатаПроведенных.ПериодНачисления,
	       |	МаксимальнаяДатаПроведенных.Район,
	       |	МаксимальнаяДатаПроведенных.СостояниеПроведения,
	       |	МаксимальнаяДатаПроведенных.МКД,
	       |	МаксимальнаяДатаПроведенных.ПриборУчета,
	       |	МаксимальнаяДатаПроведенных.ПериодРегистрации,
	       |	МаксимальнаяДатаПроведенных.ДатаРегистратора,
	       |	МаксимальнаяДатаПроведенных.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	МаксимальныйРегистраторПроведенных.Организация КАК Организация,
	       |	МаксимальныйРегистраторПроведенных.ПериодНачисления КАК ПериодНачисления,
	       |	МаксимальныйРегистраторПроведенных.Район КАК Район,
	       |	МаксимальныйРегистраторПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	       |	МаксимальныйРегистраторПроведенных.МКД КАК МКД,
	       |	МаксимальныйРегистраторПроведенных.ПриборУчета КАК ПриборУчета,
	       |	МаксимальныйРегистраторПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	       |	МаксимальныйРегистраторПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	       |	МаксимальныйРегистраторПроведенных.ДокРегистратор КАК ДокРегистратор,
	       |	МАКСИМУМ(НаборПроведенныхВПоследовательности.Разделитель) КАК Разделитель,
	       |	МаксимальныйРегистраторПроведенных.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МаксимальныйРазделительПроведенных
	       |ИЗ
	       |	МаксимальныйРегистраторПроведенных КАК МаксимальныйРегистраторПроведенных
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	       |		ПО МаксимальныйРегистраторПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	       |			И МаксимальныйРегистраторПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	       |			И МаксимальныйРегистраторПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	       |			И МаксимальныйРегистраторПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	       |			И МаксимальныйРегистраторПроведенных.ОбъектРасчета = НаборПроведенныхВПоследовательности.ОбъектРасчета
	       |			И МаксимальныйРегистраторПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	       |			И МаксимальныйРегистраторПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	       |			И МаксимальныйРегистраторПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	       |			И МаксимальныйРегистраторПроведенных.ДокРегистратор = НаборПроведенныхВПоследовательности.ДокРегистратор
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	МаксимальныйРегистраторПроведенных.Организация,
	       |	МаксимальныйРегистраторПроведенных.ПериодНачисления,
	       |	МаксимальныйРегистраторПроведенных.Район,
	       |	МаксимальныйРегистраторПроведенных.СостояниеПроведения,
	       |	МаксимальныйРегистраторПроведенных.МКД,
	       |	МаксимальныйРегистраторПроведенных.ПриборУчета,
	       |	МаксимальныйРегистраторПроведенных.ПериодРегистрации,
	       |	МаксимальныйРегистраторПроведенных.ДатаРегистратора,
	       |	МаксимальныйРегистраторПроведенных.ДокРегистратор,
	       |	МаксимальныйРегистраторПроведенных.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	МаксимальныйРазделительПроведенных.Организация КАК Организация,
	       |	МаксимальныйРазделительПроведенных.ПериодНачисления КАК ПериодНачисления,
	       |	МаксимальныйРазделительПроведенных.Район КАК Район,
	       |	МаксимальныйРазделительПроведенных.МКД КАК МКД,
	       |	МаксимальныйРазделительПроведенных.ПриборУчета КАК ПриборУчета,
	       |	бестПредоставленныеПоказанияНП.Шкала КАК Шкала,
	       |	бестПредоставленныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	МаксимальныйРазделительПроведенных.Разделитель КАК Разделитель,
	       |	бестПредоставленныеПоказанияНП.НомерПозиции КАК НомерПозиции,
	       |	МаксимальныйРазделительПроведенных.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ ПоследниеНомераПозиции
	       |ИЗ
	       |	МаксимальныйРазделительПроведенных КАК МаксимальныйРазделительПроведенных
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПредоставленныеПоказанияНП КАК бестПредоставленныеПоказанияНП
	       |		ПО МаксимальныйРазделительПроведенных.Организация = бестПредоставленныеПоказанияНП.Организация
	       |			И МаксимальныйРазделительПроведенных.ПериодНачисления = бестПредоставленныеПоказанияНП.ПериодНачисления
	       |			И МаксимальныйРазделительПроведенных.Район = бестПредоставленныеПоказанияНП.Район
	       |			И МаксимальныйРазделительПроведенных.ОбъектРасчета = бестПредоставленныеПоказанияНП.ОбъектРасчета
	       |			И МаксимальныйРазделительПроведенных.ДокРегистратор = бестПредоставленныеПоказанияНП.ДокРегистратор
	       |			И МаксимальныйРазделительПроведенных.Разделитель = бестПредоставленныеПоказанияНП.Разделитель
	       |			И (бестПредоставленныеПоказанияНП.Организация = &Организация)
	       |			И (бестПредоставленныеПоказанияНП.ПериодНачисления = &ПериодНачисления)
	       |			И (бестПредоставленныеПоказанияНП.Район = &Район)
	       |			И МаксимальныйРазделительПроведенных.ПериодРегистрации = бестПредоставленныеПоказанияНП.ДатаРегистратора
	       |			И МаксимальныйРазделительПроведенных.ПриборУчета = бестПредоставленныеПоказанияНП.ПриборУчета
	       |			И (бестПредоставленныеПоказанияНП.МКД = &МКД)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	бестМаксимальныеПоказанияНП.Организация КАК Организация,
	       |	бестМаксимальныеПоказанияНП.Район КАК Район,
	       |	бестМаксимальныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	       |	бестМаксимальныеПоказанияНП.Шкала КАК Шкала,
	       |	бестМаксимальныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	Граница.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	       |	Граница.ДокРегистратор КАК ДокРегистратор,
	       |	Граница.Разделитель КАК Разделитель,
	       |	МАКСИМУМ(бестМаксимальныеПоказанияНП.Период) КАК ПериодМаксПоказаний,
	       |	бестМаксимальныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ МаксПерПоказаний
	       |ИЗ
	       |	Граница КАК Граница
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестМаксимальныеПоказанияНП КАК бестМаксимальныеПоказанияНП
	       |		ПО Граница.Организация = бестМаксимальныеПоказанияНП.Организация
	       |			И Граница.Район = бестМаксимальныеПоказанияНП.Район
	       |			И Граница.ПриборУчета = бестМаксимальныеПоказанияНП.ПриборУчета
	       |			И (ВЫБОР
	       |				КОГДА Граница.ПериодРегистрацииПоказаний = бестМаксимальныеПоказанияНП.Период
	       |						И Граница.ДокРегистратор = бестМаксимальныеПоказанияНП.Регистратор
	       |						И Граница.Разделитель > бестМаксимальныеПоказанияНП.Разделитель
	       |					ТОГДА ИСТИНА
	       |				КОГДА Граница.ПериодРегистрацииПоказаний = бестМаксимальныеПоказанияНП.Период
	       |						И Граница.ДокРегистратор > бестМаксимальныеПоказанияНП.Регистратор
	       |					ТОГДА ИСТИНА
	       |				ИНАЧЕ Граница.ПериодРегистрацииПоказаний > бестМаксимальныеПоказанияНП.Период
	       |			КОНЕЦ)
	       |			И (бестМаксимальныеПоказанияНП.Организация = &Организация)
	       |			И (бестМаксимальныеПоказанияНП.Район = &Район)
	       |			И (бестМаксимальныеПоказанияНП.МКД = &МКД)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	бестМаксимальныеПоказанияНП.Организация,
	       |	бестМаксимальныеПоказанияНП.Район,
	       |	бестМаксимальныеПоказанияНП.ПриборУчета,
	       |	бестМаксимальныеПоказанияНП.Шкала,
	       |	бестМаксимальныеПоказанияНП.ТарифнаяЗона,
	       |	Граница.ПериодРегистрацииПоказаний,
	       |	Граница.ДокРегистратор,
	       |	Граница.Разделитель,
	       |	бестМаксимальныеПоказанияНП.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	бестМаксимальныеПоказанияНП.Организация КАК Организация,
	       |	бестМаксимальныеПоказанияНП.Район КАК Район,
	       |	бестМаксимальныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	       |	бестМаксимальныеПоказанияНП.Шкала КАК Шкала,
	       |	бестМаксимальныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	МаксПерПоказаний.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	       |	МаксПерПоказаний.ДокРегистратор КАК ДокРегистратор,
	       |	МаксПерПоказаний.Разделитель КАК Разделитель,
	       |	МаксПерПоказаний.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	       |	МАКСИМУМ(бестМаксимальныеПоказанияНП.Регистратор) КАК РегистраторМаксПоказаний,
	       |	бестМаксимальныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ РегМакПок
	       |ИЗ
	       |	МаксПерПоказаний КАК МаксПерПоказаний
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестМаксимальныеПоказанияНП КАК бестМаксимальныеПоказанияНП
	       |		ПО МаксПерПоказаний.Организация = бестМаксимальныеПоказанияНП.Организация
	       |			И МаксПерПоказаний.Район = бестМаксимальныеПоказанияНП.Район
	       |			И МаксПерПоказаний.ПриборУчета = бестМаксимальныеПоказанияНП.ПриборУчета
	       |			И МаксПерПоказаний.Шкала = бестМаксимальныеПоказанияНП.Шкала
	       |			И МаксПерПоказаний.ТарифнаяЗона = бестМаксимальныеПоказанияНП.ТарифнаяЗона
	       |			И МаксПерПоказаний.ПериодМаксПоказаний = бестМаксимальныеПоказанияНП.Период
	       |			И (ВЫБОР
	       |				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = бестМаксимальныеПоказанияНП.Период
	       |						И МаксПерПоказаний.ДокРегистратор = бестМаксимальныеПоказанияНП.Регистратор
	       |						И МаксПерПоказаний.Разделитель > бестМаксимальныеПоказанияНП.Разделитель
	       |					ТОГДА ИСТИНА
	       |				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = бестМаксимальныеПоказанияНП.Период
	       |						И МаксПерПоказаний.ДокРегистратор > бестМаксимальныеПоказанияНП.Регистратор
	       |					ТОГДА ИСТИНА
	       |				ИНАЧЕ МаксПерПоказаний.ПериодРегистрацииПоказаний > бестМаксимальныеПоказанияНП.Период
	       |			КОНЕЦ)
	       |			И (бестМаксимальныеПоказанияНП.Организация = &Организация)
	       |			И (бестМаксимальныеПоказанияНП.Район = &Район)
	       |			И МаксПерПоказаний.ОбъектРасчета = бестМаксимальныеПоказанияНП.ОбъектРасчета
	       |			И (бестМаксимальныеПоказанияНП.МКД = &МКД)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	бестМаксимальныеПоказанияНП.Организация,
	       |	бестМаксимальныеПоказанияНП.Район,
	       |	бестМаксимальныеПоказанияНП.ПриборУчета,
	       |	бестМаксимальныеПоказанияНП.Шкала,
	       |	бестМаксимальныеПоказанияНП.ТарифнаяЗона,
	       |	МаксПерПоказаний.ПериодРегистрацииПоказаний,
	       |	МаксПерПоказаний.ДокРегистратор,
	       |	МаксПерПоказаний.Разделитель,
	       |	МаксПерПоказаний.ПериодМаксПоказаний,
	       |	бестМаксимальныеПоказанияНП.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	бестМаксимальныеПоказанияНП.Организация КАК Организация,
	       |	бестМаксимальныеПоказанияНП.Район КАК Район,
	       |	бестМаксимальныеПоказанияНП.ПриборУчета КАК ПриборУчета,
	       |	бестМаксимальныеПоказанияНП.Шкала КАК Шкала,
	       |	бестМаксимальныеПоказанияНП.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	РегМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	       |	РегМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	       |	МАКСИМУМ(ЕСТЬNULL(бестМаксимальныеПоказанияНП.Разделитель, 0)) КАК РазделительМаксПоказаний,
	       |	бестМаксимальныеПоказанияНП.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ РазделительМакПок
	       |ИЗ
	       |	РегМакПок КАК РегМакПок
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестМаксимальныеПоказанияНП КАК бестМаксимальныеПоказанияНП
	       |		ПО РегМакПок.Организация = бестМаксимальныеПоказанияНП.Организация
	       |			И РегМакПок.Район = бестМаксимальныеПоказанияНП.Район
	       |			И РегМакПок.ПриборУчета = бестМаксимальныеПоказанияНП.ПриборУчета
	       |			И РегМакПок.Шкала = бестМаксимальныеПоказанияНП.Шкала
	       |			И РегМакПок.ТарифнаяЗона = бестМаксимальныеПоказанияНП.ТарифнаяЗона
	       |			И РегМакПок.ПериодМаксПоказаний = бестМаксимальныеПоказанияНП.Период
	       |			И РегМакПок.РегистраторМаксПоказаний = бестМаксимальныеПоказанияНП.Регистратор
	       |			И (ВЫБОР
	       |				КОГДА РегМакПок.ПериодРегистрацииПоказаний = бестМаксимальныеПоказанияНП.Период
	       |						И РегМакПок.ДокРегистратор = бестМаксимальныеПоказанияНП.Регистратор
	       |						И РегМакПок.Разделитель > бестМаксимальныеПоказанияНП.Разделитель
	       |					ТОГДА ИСТИНА
	       |				КОГДА РегМакПок.ПериодРегистрацииПоказаний = бестМаксимальныеПоказанияНП.Период
	       |						И РегМакПок.ДокРегистратор > бестМаксимальныеПоказанияНП.Регистратор
	       |					ТОГДА ИСТИНА
	       |				ИНАЧЕ РегМакПок.ПериодРегистрацииПоказаний > бестМаксимальныеПоказанияНП.Период
	       |			КОНЕЦ)
	       |			И (бестМаксимальныеПоказанияНП.Организация = &Организация)
	       |			И (бестМаксимальныеПоказанияНП.Район = &Район)
	       |			И РегМакПок.ОбъектРасчета = бестМаксимальныеПоказанияНП.ОбъектРасчета
	       |			И (бестМаксимальныеПоказанияНП.МКД = &МКД)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	бестМаксимальныеПоказанияНП.Организация,
	       |	бестМаксимальныеПоказанияНП.Район,
	       |	бестМаксимальныеПоказанияНП.ПриборУчета,
	       |	бестМаксимальныеПоказанияНП.Шкала,
	       |	бестМаксимальныеПоказанияНП.ТарифнаяЗона,
	       |	РегМакПок.ПериодМаксПоказаний,
	       |	РегМакПок.РегистраторМаксПоказаний,
	       |	бестМаксимальныеПоказанияНП.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	РазделительМакПок.Организация КАК Организация,
	       |	РазделительМакПок.Район КАК Район,
	       |	РазделительМакПок.ПриборУчета КАК ПриборУчета,
	       |	РазделительМакПок.Шкала КАК Шкала,
	       |	РазделительМакПок.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	РазделительМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	       |	РазделительМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	       |	бестМаксимальныеПоказанияНП.ДатаРегистратора КАК ДатаРегистратораМаксимальных,
	       |	бестМаксимальныеПоказанияНП.Показание КАК МаксПоказания,
	       |	РазделительМакПок.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ ДанныеМаксПоказаний
	       |ИЗ
	       |	РазделительМакПок КАК РазделительМакПок
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестМаксимальныеПоказанияНП КАК бестМаксимальныеПоказанияНП
	       |		ПО РазделительМакПок.Организация = бестМаксимальныеПоказанияНП.Организация
	       |			И РазделительМакПок.Район = бестМаксимальныеПоказанияНП.Район
	       |			И РазделительМакПок.ПриборУчета = бестМаксимальныеПоказанияНП.ПриборУчета
	       |			И РазделительМакПок.Шкала = бестМаксимальныеПоказанияНП.Шкала
	       |			И РазделительМакПок.ТарифнаяЗона = бестМаксимальныеПоказанияНП.ТарифнаяЗона
	       |			И РазделительМакПок.ПериодМаксПоказаний = бестМаксимальныеПоказанияНП.Период
	       |			И РазделительМакПок.РегистраторМаксПоказаний = бестМаксимальныеПоказанияНП.Регистратор
	       |			И РазделительМакПок.РазделительМаксПоказаний = бестМаксимальныеПоказанияНП.Разделитель
	       |			И (бестМаксимальныеПоказанияНП.Организация = &Организация)
	       |			И (бестМаксимальныеПоказанияНП.Район = &Район)
	       |			И РазделительМакПок.ОбъектРасчета = бестМаксимальныеПоказанияНП.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	бестПоказанияПУНППоследовательность.Организация КАК Организация,
	       |	бестПоказанияПУНППоследовательность.ПериодНачисления КАК ПериодНачисления,
	       |	бестПоказанияПУНППоследовательность.Район КАК Район,
	       |	бестПоказанияПУНППоследовательность.МКД КАК МКД,
	       |	бестПоказанияПУНППоследовательность.ПриборУчета КАК ПриборУчета,
	       |	бестПоказанияПУНППоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	       |	бестПоказанияПУНППоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	       |	бестПоказанияПУНППоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	       |	бестПоказанияПУНППоследовательность.ДокРегистратор КАК ДокРегистратор,
	       |	бестПоказанияПУНППоследовательность.Разделитель КАК Разделитель,
	       |	бестПоказанияПУНППоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	       |	бестПоказанияПУНППоследовательность.ИмяТабЧасти КАК ИмяТабЧасти,
	       |	бестПоказанияПУНППоследовательность.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ НаборДокументов
	       |ИЗ
	       |	Граница КАК Граница
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоказанияПУНППоследовательность КАК бестПоказанияПУНППоследовательность
	       |		ПО Граница.Организация = бестПоказанияПУНППоследовательность.Организация
	       |			И Граница.ПериодНачисления = бестПоказанияПУНППоследовательность.ПериодНачисления
	       |			И Граница.Район = бестПоказанияПУНППоследовательность.Район
	       |			И Граница.ПриборУчета = бестПоказанияПУНППоследовательность.ПриборУчета
	       |			И (ВЫБОР
	       |				КОГДА Граница.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |						И Граница.ДатаРегистратора = бестПоказанияПУНППоследовательность.ДатаРегистратора
	       |						И Граница.ДокРегистратор = бестПоказанияПУНППоследовательность.ДокРегистратор
	       |						И Граница.Разделитель <= бестПоказанияПУНППоследовательность.Разделитель
	       |					ТОГДА ИСТИНА
	       |				КОГДА Граница.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |						И Граница.ДатаРегистратора = бестПоказанияПУНППоследовательность.ДатаРегистратора
	       |						И Граница.ДокРегистратор < бестПоказанияПУНППоследовательность.ДокРегистратор
	       |					ТОГДА ИСТИНА
	       |				КОГДА Граница.ПериодРегистрации = бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |						И Граница.ДатаРегистратора < бестПоказанияПУНППоследовательность.ДатаРегистратора
	       |					ТОГДА ИСТИНА
	       |				ИНАЧЕ Граница.ПериодРегистрации < бестПоказанияПУНППоследовательность.ПериодРегистрации
	       |			КОНЕЦ)
	       |			И (бестПоказанияПУНППоследовательность.Организация = &Организация)
	       |			И (бестПоказанияПУНППоследовательность.ПериодНачисления = &ПериодНачисления)
	       |			И (бестПоказанияПУНППоследовательность.Район = &Район)
	       |			И (бестПоказанияПУНППоследовательность.МКД = &МКД)
	       |			И Граница.ОбъектРасчета = бестПоказанияПУНППоследовательность.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	бестПоказанияПриборовУчетаНП.Организация КАК Организация,
	       |	бестПоказанияПриборовУчетаНП.Район КАК Район,
	       |	бестПоказанияПриборовУчетаНП.ПриборУчета КАК ПриборУчета,
	       |	бестПоказанияПриборовУчетаНП.Шкала КАК Шкала,
	       |	бестПоказанияПриборовУчетаНП.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	МАКСИМУМ(ВЫБОР
	       |			КОГДА бестПоказанияПриборовУчетаНП.Переворот
	       |				ТОГДА 1
	       |			ИНАЧЕ 0
	       |		КОНЕЦ) КАК БылПереворот,
	       |	бестПоказанияПриборовУчетаНП.ОбъектРасчета КАК ОбъектРасчета
	       |ПОМЕСТИТЬ ДанныеПоПереворотам
	       |ИЗ
	       |	НаборДокументов КАК НаборДокументов
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоказанияПриборовУчетаНП КАК бестПоказанияПриборовУчетаНП
	       |		ПО НаборДокументов.Организация = бестПоказанияПриборовУчетаНП.Организация
	       |			И НаборДокументов.Район = бестПоказанияПриборовУчетаНП.Район
	       |			И НаборДокументов.ПриборУчета = бестПоказанияПриборовУчетаНП.ПриборУчета
	       |			И (бестПоказанияПриборовУчетаНП.Период МЕЖДУ НаборДокументов.ДатаРегистратора И НаборДокументов.ПериодРегистрации)
	       |			И (бестПоказанияПриборовУчетаНП.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
	       |			И НаборДокументов.ДокРегистратор <> бестПоказанияПриборовУчетаНП.Регистратор
	       |			И (бестПоказанияПриборовУчетаНП.Организация = &Организация)
	       |			И НаборДокументов.ОбъектРасчета = бестПоказанияПриборовУчетаНП.ОбъектРасчета
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	бестПоказанияПриборовУчетаНП.Организация,
	       |	бестПоказанияПриборовУчетаНП.Район,
	       |	бестПоказанияПриборовУчетаНП.ПриборУчета,
	       |	бестПоказанияПриборовУчетаНП.Шкала,
	       |	бестПоказанияПриборовУчетаНП.ТарифнаяЗона,
	       |	бестПоказанияПриборовУчетаНП.ОбъектРасчета
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	НаборДокументов.Организация КАК Организация,
	       |	НаборДокументов.ПериодНачисления КАК ПериодНачисления,
	       |	НаборДокументов.Район КАК Район,
	       |	НаборДокументов.МКД КАК МКД,
	       |	НаборДокументов.ПриборУчета КАК ПриборУчета,
	       |	бестПоказанияПриборовУчетаНП.Шкала КАК Шкала,
	       |	бестПоказанияПриборовУчетаНП.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	НаборДокументов.СостояниеПроведения КАК СостояниеПроведения,
	       |	НаборДокументов.ПериодРегистрации КАК ПериодРегистрации,
	       |	НаборДокументов.ДатаРегистратора КАК ДатаРегистратора,
	       |	НаборДокументов.ДокРегистратор КАК ДокРегистратор,
	       |	НаборДокументов.Разделитель КАК Разделитель,
	       |	НаборДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	       |	НаборДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	       |	бестПоказанияПриборовУчетаНП.Показание КАК Показание,
	       |	бестПоказанияПриборовУчетаНП.СостояниеПоказаний КАК СостояниеПоказаний,
	       |	бестПоказанияПриборовУчетаНП.Переворот КАК Переворот,
	       |	бестПоказанияПриборовУчетаНП.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	       |	бестПоказанияПриборовУчетаНП.КС КАК КС,
	       |	НаборДокументов.ОбъектРасчета КАК ОбъектРасчета,
	       |	бестПоказанияПриборовУчетаНП.ТочкаУчета КАК ТочкаУчета
	       |ПОМЕСТИТЬ ДанныеДокументов
	       |ИЗ
	       |	НаборДокументов КАК НаборДокументов
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоказанияПриборовУчетаНП КАК бестПоказанияПриборовУчетаНП
	       |		ПО НаборДокументов.ДокРегистратор = бестПоказанияПриборовУчетаНП.Регистратор
	       |			И НаборДокументов.Организация = бестПоказанияПриборовУчетаНП.Организация
	       |			И НаборДокументов.ПриборУчета = бестПоказанияПриборовУчетаНП.ПриборУчета
	       |			И НаборДокументов.Разделитель = бестПоказанияПриборовУчетаНП.Разделитель
	       |			И (НЕ НаборДокументов.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	       |			И (бестПоказанияПриборовУчетаНП.Организация = &Организация)
	       |			И (бестПоказанияПриборовУчетаНП.Район = &Район)
	       |			И НаборДокументов.ОбъектРасчета = бестПоказанияПриборовУчетаНП.ОбъектРасчета
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	НаборДокументов.Организация,
	       |	НаборДокументов.ПериодНачисления,
	       |	НаборДокументов.Район,
	       |	НаборДокументов.МКД,
	       |	НаборДокументов.ПриборУчета,
	       |	ДанныеМаксПоказаний.Шкала,
	       |	ДанныеМаксПоказаний.ТарифнаяЗона,
	       |	НаборДокументов.СостояниеПроведения,
	       |	НаборДокументов.ПериодРегистрации,
	       |	НаборДокументов.ДатаРегистратора,
	       |	НаборДокументов.ДокРегистратор,
	       |	НаборДокументов.Разделитель,
	       |	НаборДокументов.ВыводПрибораУчета,
	       |	НаборДокументов.ИмяТабЧасти,
	       |	0,
	       |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены),
	       |	ЛОЖЬ,
	       |	0,
	       |	ЛОЖЬ,
	       |	НаборДокументов.ОбъектРасчета,
	       |	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	       |ИЗ
	       |	НаборДокументов КАК НаборДокументов
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	       |		ПО НаборДокументов.Организация = ДанныеМаксПоказаний.Организация
	       |			И НаборДокументов.Район = ДанныеМаксПоказаний.Район
	       |			И НаборДокументов.ОбъектРасчета = ДанныеМаксПоказаний.ОбъектРасчета
	       |			И НаборДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	       |			И (НаборДокументов.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ДанныеДокументов.Организация КАК Организация,
	       |	ДанныеДокументов.ПериодНачисления КАК ПериодНачисления,
	       |	ДанныеДокументов.Район КАК Район,
	       |	ДанныеДокументов.МКД КАК МКД,
	       |	ДанныеДокументов.ПриборУчета КАК ПриборУчета,
	       |	ДанныеДокументов.Шкала КАК Шкала,
	       |	ДанныеДокументов.ТарифнаяЗона КАК ТарифнаяЗона,
	       |	ДанныеДокументов.СостояниеПроведения КАК СостояниеПроведения,
	       |	ДанныеДокументов.ПериодРегистрации КАК ПериодРегистрации,
	       |	ДанныеДокументов.ДатаРегистратора КАК ДатаРегистратора,
	       |	ДанныеДокументов.ДокРегистратор КАК ДокРегистратор,
	       |	ДанныеДокументов.Разделитель КАК Разделитель,
	       |	ДанныеДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	       |	ДанныеДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	       |	ДанныеДокументов.Показание КАК Показание,
	       |	ДанныеДокументов.СостояниеПоказаний КАК СостояниеПоказаний,
	       |	ДанныеДокументов.Переворот КАК Переворот,
	       |	ДанныеДокументов.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	       |	ДанныеДокументов.КС КАК КС,
	       |	ДанныеДокументов.ТочкаУчета КАК ТочкаУчета,
	       |	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможныеПоказания,
	       |	1 КАК коэффициентПУ,
	       |	ЕСТЬNULL(ПоследниеНомераПозиции.НомерПозиции, -1) КАК НомерПозици,
	       |	ЕСТЬNULL(ДанныеПоПереворотам.БылПереворот, 0) КАК БылПереворот,
	       |	ЕСТЬNULL(ДанныеМаксПоказаний.ПериодМаксПоказаний, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодМаксПоказаний,
	       |	ЕСТЬNULL(ДанныеМаксПоказаний.МаксПоказания, -1) КАК МаксПоказания,
	       |	ЕСТЬNULL(ДанныеМаксПоказаний.РегистраторМаксПоказаний, ЗНАЧЕНИЕ(Документ.энргРегистрацияПоказанийАбонента.ПустаяСсылка)) КАК РегистраторМаксПоказаний,
	       |	ЕСТЬNULL(ДанныеМаксПоказаний.ДатаРегистратораМаксимальных, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратораМаксимальных,
	       |	ДанныеДокументов.ОбъектРасчета КАК ОбъектРасчета,
	       |	ЕСТЬNULL(бестПериодыПриемаПоказанийСрезПоследних.ДатаС, 0) КАК ДатаС,
	       |	ЕСТЬNULL(бестПериодыПриемаПоказанийСрезПоследних.ДатаПо, 0) КАК ДатаПо
	       |ИЗ
	       |	ДанныеДокументов КАК ДанныеДокументов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	       |		ПО ДанныеДокументов.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	       |		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеНомераПозиции КАК ПоследниеНомераПозиции
	       |		ПО ДанныеДокументов.Организация = ПоследниеНомераПозиции.Организация
	       |			И ДанныеДокументов.ПериодНачисления = ПоследниеНомераПозиции.ПериодНачисления
	       |			И ДанныеДокументов.Район = ПоследниеНомераПозиции.Район
	       |			И ДанныеДокументов.МКД = ПоследниеНомераПозиции.МКД
	       |			И ДанныеДокументов.ПриборУчета = ПоследниеНомераПозиции.ПриборУчета
	       |			И ДанныеДокументов.Шкала = ПоследниеНомераПозиции.Шкала
	       |			И ДанныеДокументов.ТарифнаяЗона = ПоследниеНомераПозиции.ТарифнаяЗона
	       |			И ДанныеДокументов.ОбъектРасчета = ПоследниеНомераПозиции.ОбъектРасчета
	       |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПереворотам КАК ДанныеПоПереворотам
	       |		ПО ДанныеДокументов.Организация = ДанныеПоПереворотам.Организация
	       |			И ДанныеДокументов.Район = ДанныеПоПереворотам.Район
	       |			И ДанныеДокументов.ПриборУчета = ДанныеПоПереворотам.ПриборУчета
	       |			И ДанныеДокументов.Шкала = ДанныеПоПереворотам.Шкала
	       |			И ДанныеДокументов.ТарифнаяЗона = ДанныеПоПереворотам.ТарифнаяЗона
	       |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	       |		ПО ДанныеДокументов.Организация = ДанныеМаксПоказаний.Организация
	       |			И ДанныеДокументов.Район = ДанныеМаксПоказаний.Район
	       |			И ДанныеДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	       |			И ДанныеДокументов.ОбъектРасчета = ДанныеМаксПоказаний.ОбъектРасчета
	       |			И ДанныеДокументов.ТарифнаяЗона = ДанныеМаксПоказаний.ТарифнаяЗона
	       |			И ДанныеДокументов.Шкала = ДанныеМаксПоказаний.Шкала
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПериодыПриемаПоказаний.СрезПоследних(
	       |				&НачалоПериодаРасчета,
	       |				Организация = &Организация
	       |					И Район = &Район) КАК бестПериодыПриемаПоказанийСрезПоследних
	       |		ПО ДанныеДокументов.Организация = бестПериодыПриемаПоказанийСрезПоследних.Организация
	       |			И ДанныеДокументов.Район = бестПериодыПриемаПоказанийСрезПоследних.Район
	       |			И (ВЫБОР
	       |				КОГДА ДанныеДокументов.МКД = ЗНАЧЕНИЕ(Справочник.энргстроения.пустаяссылка)
	       |					ТОГДА бестПериодыПриемаПоказанийСрезПоследних.Отдельностоящие = ИСТИНА
	       |				ИНАЧЕ бестПериодыПриемаПоказанийСрезПоследних.Отдельностоящие = ЛОЖЬ
	       |			КОНЕЦ)
	       |
	       |УПОРЯДОЧИТЬ ПО
	       |	Организация,
	       |	ПериодНачисления,
	       |	Район,
	       |	МКД,
	       |	ПриборУчета,
	       |	Шкала,
	       |	ТарифнаяЗона,
	       |	ПериодРегистрации,
	       |	ДатаРегистратора,
	       |	ДокРегистратор,
	       |	Разделитель";
	
	
	Если Отбор.ИсключаяОтдельностоящие тогда
		Текст = СтрЗаменить(Текст,"И бестПоказанияПУНППоследовательность.МКД = &МКД","И бестПоказанияПУНППоследовательность.МКД <> &МКД");
		Текст = СтрЗаменить(Текст,"И (бестПоказанияПУНППоследовательность.МКД = &МКД)","И (бестПоказанияПУНППоследовательность.МКД <> &МКД)");
		Текст = СтрЗаменить(Текст,"И (бестПредоставленныеПоказанияНП.МКД = &МКД)","И (бестПредоставленныеПоказанияНП.МКД <> &МКД)");
		Текст = СтрЗаменить(Текст,"И (бестМаксимальныеПоказанияНП.МКД = &МКД)","И (бестМаксимальныеПоказанияНП.МКД <> &МКД)");
		
	Иначе
		Если Отбор.МКД = Неопределено Тогда 
			Текст = СтрЗаменить(Текст,"И бестПоказанияПУНППоследовательность.МКД = &МКД","");
			Текст = СтрЗаменить(Текст,"И (бестПоказанияПУНППоследовательность.МКД = &МКД)","");
			Текст = СтрЗаменить(Текст,"И (бестПредоставленныеПоказанияНП.МКД = &МКД)","");
			Текст = СтрЗаменить(Текст,"И (бестМаксимальныеПоказанияНП.МКД = &МКД)","");
			
		КонецЕсли;
	КонецЕсли;
	
	Если Отбор.ОбъектРасчета = Неопределено Тогда 
		Текст = СтрЗаменить(Текст,"И бестПоказанияПУНППоследовательность.ОбъектРасчета В(&ОбъектРасчета)","");
	КонецЕсли;
	
	Если Перерасчет Тогда
		Текст = СтрЗаменить(Текст, "И бестПоказанияПУНППоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))", ""); 
	КонецЕсли;
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Организация",		Отбор.Организация);
	Запрос.УстановитьПараметр("Район",				Отбор.район);
	Запрос.УстановитьПараметр("ПериодНачисления",	Отбор.ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("МКД",				Отбор.МКД);
	Запрос.УстановитьПараметр("ОбъектРасчета",		Отбор.ОбъектРасчета);	 
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПровестиПоказанияПриборовУчетаНП(ПараметрыПроведений,МассивДокументов,ДанныеСреднегоОбъема,ДанныеМаксимальногоПотребления)
	
	ПериодНачисления 								= ПараметрыПроведений.ПериодНачисления;
	Организация 									= ПараметрыПроведений.Организация;
	Район 											= ПараметрыПроведений.Район;
	МКД 											= ПараметрыПроведений.МКД;
	ОбъектРасчета 									= ПараметрыПроведений.ОбъектРасчета;
	ПриборУчета 									= ПараметрыПроведений.ПриборУчета;
	Шкала		 									= ПараметрыПроведений.Шкала;
	ТарифнаяЗона 									= ПараметрыПроведений.ТарифнаяЗона;
	НомерПозиции 									= ПараметрыПроведений.НомерПозиции;
	ПоказанияС 										= ПараметрыПроведений.ПоказанияС;
	ПоказанияПО 									= ПараметрыПроведений.ПоказанияПО;
	НачалоПериодаРасчета 							= ПараметрыПроведений.НачалоПериодаРасчета;
	НачПокНеЯвляютсяКонечнымиПриУстПрибора			= ПараметрыПроведений.НачПокНеЯвляютсяКонечнымиПриУстПрибора;
	ЗаписыватьВМаксСрез 							= Ложь;
	Попытка
		Исключен  									= Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности;
		ПроведенВПоследоватености  					= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
		
		ПоказанияОтклонены 							= Перечисления.энргСостояниеПоказаний.Отклонены;
		ПоказанияПриняты 							= Перечисления.энргСостояниеПоказаний.Приняты;
		ПустоеСостояниеПоказаний					= Перечисления.энргСостояниеПоказаний.ПустаяСсылка();
		ТекНомерПозиции 							= НомерПозиции;
		
		ПредыдущиеМакс 								= Макс(МассивДокументов[0].МаксПоказания,0);
		ПериодПредыдущихМаксПок 					= МассивДокументов[0].ПериодМаксПоказаний;
		РегистраторМаксимальных 					= МассивДокументов[0].РегистраторМаксПоказаний;
		ДатаРегистратораМаксимальных 				= МассивДокументов[0].ДатаРегистратораМаксимальных;
		
		МаксимальныеПоказания  						= Новый Соответствие; 		
		
		для Каждого Выборка из МассивДокументов цикл
			
			Если Выборка.состояниепроведения  = Исключен тогда 			
				// Очищаем данные.
				НаборПоследовательности 			= РегистрыСведений.бестПоказанияПУНППоследовательность.СоздатьНаборЗаписей();
				НаборПоследовательности.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
				НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
				НаборПоследовательности.Отбор.Организация.установить(Организация);
				НаборПоследовательности.Отбор.Район.установить(Район);
				НаборПоследовательности.Отбор.СостояниеПроведения.установить(Выборка.СостояниеПроведения);
				НаборПоследовательности.Отбор.МКД.установить(МКД);
				НаборПоследовательности.Отбор.ОбъектРасчета.установить(ОбъектРасчета);
				НаборПоследовательности.Отбор.ПриборУчета.установить(ПриборУчета);
				НаборПоследовательности.Отбор.ПериодРегистрации.установить(Выборка.ПериодРегистрации);
				НаборПоследовательности.Отбор.ДатаРегистратора.установить(Выборка.ДатаРегистратора);
				НаборПоследовательности.Записать();
				
				// Получаем таблицу максимальных показаний по регистратору.
				НаборМаксПоказаний  				= РегистрыСведений.бестМаксимальныеПоказанияНП.СоздатьНаборЗаписей();
				НаборМаксПоказаний.Отбор.регистратор.установить(Выборка.ДокРегистратор);
				НаборМаксПоказаний.Записать();
				
				НаборПредоставленных 				= РегистрыСведений.бестПредоставленныеПоказанияНП.СоздатьНаборЗаписей();
				НаборПредоставленных.Отбор.Докрегистратор.установить(Выборка.ДокРегистратор);
				НаборПредоставленных.Записать();
				
				Продолжить;
			КонецЕсли;
			
			ЗаписыватьВМаксСрез 					= Истина;
			СостояниеПоказаний  					= Выборка.состояниеПоказаний;
			Переворот  								= Выборка.Переворот;
			
			ОбновлятьДанные 						= Истина;
			ЭтоОткрытие 							= Ложь;
			// Обновляем показания в документа.
			Если ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами") тогда
				Если Выборка.ДокРегистратор.Видоперации  = Перечисления.бестВидыОпераций.ОперацияСДоговором_ОткрытиеДоговора
					ИЛИ Выборка.ДокРегистратор.Видоперации  = Перечисления.бестВидыОпераций.ОперацияСДоговором_РегистрацияОбъекта тогда
					ОбновлятьДанные 				= Ложь;
					ЭтоОткрытие 					= Истина;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестАктированиеНедопускаДопускаЮЛ") тогда
				ОбновлятьДанные 				= Ложь;
				ЭтоОткрытие 					= Истина;
			ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестОперацияСУслугамиНП")	тогда
				Если Выборка.ДокРегистратор.Видоперации  = Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги тогда
					ОбновлятьДанные 				= Ложь;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестОперацияСПриборомУчетаНП")	тогда
				Если Выборка.ДокРегистратор.Видоперации  = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВводПУ тогда
					ОбновлятьДанные 				= Ложь;
					//ИначеЕсли Выборка.ДокРегистратор.Видоперации  = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ тогда
					//	ТабЧасть  						= Выборка.ДокРегистратор["ПриборыУчетаЗамена"];
					//	СтрокиПрибора 					= ТабЧасть.найтиСтроки(Новый Структура("ПриборУчета",ПриборУчета));
					//	Если СтрокиПрибора.количество() = 0 тогда
					//		ОбновлятьДанные 			= Ложь;
					//	КонецЕсли;
				КонецЕсли; 	
			ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестРегистрацияПоказанийНПОбщий") тогда
				
				ОбновлятьДанные 				= Ложь;
					
			ИначеЕсли ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.бестРегистрацияПоказанийНП")
				И ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ДокРегистратор, "ДатаФактическогоСобытия")) тогда
					
				ОбновлятьДанные 				= Ложь;
					
				ЭтоМаксимальные 					= Истина;
			КонецЕсли;
			
			Если ОбновлятьДанные тогда
				ПараметрыОперации  					= Новый Структура("
				|МКД,ОбъектРасчета,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,ПериодПредыдущихМаксПок,СостояниеПоказаний,ДанныеМаксимальногоПотребления,
				|Переворот,НомерСтрокиТЧ,Разделитель,ДанныеСреднегоОбъема,МаксимальноВозможныеПоказания,КоэффициентПУ,ИмяТабЧасти,КС",
				МКД,ОбъектРасчета,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,ПериодПредыдущихМаксПок,СостояниеПоказаний,ДанныеМаксимальногоПотребления,
				Переворот,Выборка.НомерСтрокиТЧ,Выборка.разделитель,ДанныеСреднегоОбъема,Выборка.МаксимальноВозможныеПоказания,Выборка.КоэффициентПУ,Выборка.ИмяТабЧасти,Выборка.КС);
				
				ОбновитьДанныеВДокументеНП(ПериодНачисления,Выборка.ДокРегистратор,ПараметрыОперации);
				
				СостояниеПоказаний 					= ПараметрыОперации.СостояниеПоказаний;
				Переворот 							= ПараметрыОперации.Переворот;
			КонецЕсли;	
			
			// Получаем таблицу максимальных показаний по регистратору.
			НаборМаксПоказаний  					= РегистрыСведений.бестМаксимальныеПоказанияНП.СоздатьНаборЗаписей();
			НаборМаксПоказаний.Отбор.регистратор.установить(Выборка.ДокРегистратор);
			НаборМаксПоказаний.Прочитать();
			ТаблицаМаксимальных 					= НаборМаксПоказаний.Выгрузить();
			
			НаборМаксПоказаний.Очистить(); 
			НаборМаксПоказаний.Записать(); 
			
			Текущие  								= Выборка.Показание;
			
			ЭтоМаксимальные 						= ПредыдущиеМакс <=  Текущие или Переворот;
			
			Если Выборка.ДатаРегистратора < Выборка.ПериодРегистрации тогда
				// Может быть либо у потерянной квитанции или у контрольного съема который НЕ с 23-26.
				Если Выборка.БылПереворот = 1 тогда
					ЭтоМаксимальные 					= Ложь;			 
				КонецЕсли; 			 
			КонецЕсли;
			
			Если СостояниеПоказаний<> ПоказанияПриняты тогда
				ЭтоМаксимальные 						= ложь;
			КонецЕсли;
			
			ПараметрыСтрокиМаксимальных  				= Новый Структура("Период,Активность,Организация,Район,МКД,ОбъектРасчета,ПриборУчета,Шкала,ТарифнаяЗона,Разделитель",Выборка.ПериодРегистрации,истина,Организация,Район,МКД,ОбъектРасчета,ПриборУчета,Шкала,ТарифнаяЗона,Выборка.Разделитель);
			СтрокиТаблицыМаксимальных					= ТаблицаМаксимальных.НайтиСтроки(ПараметрыСтрокиМаксимальных);
			ПоказанияТекущегоПериода 					= ?(ЭтоОткрытие, Истина, Выборка.ПериодРегистрации >= НачалоПериодаРасчета);
			ВСрок 										= ?(ЭтоОткрытие, Истина, Выборка.ПериодРегистрации >= НачалоПериодаРасчета И День(Выборка.ПериодРегистрации) >= ПоказанияС И День(Выборка.ПериодРегистрации) <= ПоказанияПО);
			
			Если НачПокНеЯвляютсяКонечнымиПриУстПрибора И ЭтоОткрытие И ВСрок Тогда 
				// Показания ввода прибора учета не должны учитываться как конечные при непредоставлении показаний
				ВСрок = Ложь;
			КонецЕсли;
			
			Если СостояниеПоказаний = ПоказанияПриняты и Не ЭтоОткрытие Тогда
				НаборРасчетСреднего 					= РегистрыСведений.бестРасчетСреднегоОбъемаНП.СоздатьНаборЗаписей();
				НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
				СтрокаНабор  							= НаборРасчетСреднего.Добавить();
				СтрокаНабор.Организация 	 			= Организация;
				СтрокаНабор.Район						= Район;
				СтрокаНабор.ОбъектРасчета				= ОбъектРасчета;
				СтрокаНабор.МКД							= ОбъектРасчета.МКД;
				СтрокаНабор.ТочкаУчета					= Выборка.ТочкаУчета;
				СтрокаНабор.Шкала						= Шкала;
				СтрокаНабор.ТарифнаяЗона				= ТарифнаяЗона;
				СтрокаНабор.ПериодНачисления			= ПериодНачисления;
				СтрокаНабор.ДокРегистратор  			= Выборка.ДокРегистратор;
				СтрокаНабор.Разделитель 				= Выборка.Разделитель;
				СтрокаНабор.ОбъемУслуги 				= Текущие - ПредыдущиеМакс;
				НаборРасчетСреднего.Записать(Ложь);
			КонецЕсли;
			
			Если ЭтоМаксимальные или ВСрок тогда 				
				Если ЭтоМаксимальные тогда
					ПериодПредыдущихМаксПок 			= Выборка.ПериодРегистрации;
					ПредыдущиеМакс 						= Текущие;				
					РегистраторМаксимальных 			= Выборка.ДокРегистратор;
					ДатаРегистратораМаксимальных 		= Выборка.ДатаРегистратора
				КонецЕсли;
				
				Если СтрокиТаблицыМаксимальных.Количество() = 0 и ЭтоМаксимальные тогда
					// Строки такой нет значит добавляем.
					СтрокаМаксимальных  				= ТаблицаМаксимальных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаМаксимальных,ПараметрыСтрокиМаксимальных);
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				ИначеЕсли СтрокиТаблицыМаксимальных.Количество() = 1 и ЭтоМаксимальные тогда
					// Меняем показания.
					СтрокаМаксимальных  				= СтрокиТаблицыМаксимальных[0];
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				ИначеЕсли ЭтоМаксимальные тогда
					// Удаляем строки по прибору учета.
					для Каждого СтрокаТаблицыМаксимальных из СтрокиТаблицыМаксимальных цикл
						ТаблицаМаксимальных.Удалить(СтрокаТаблицыМаксимальных)
					КонецЦикла;
					// Добавляем новую.
					СтрокаМаксимальных  				= ТаблицаМаксимальных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаМаксимальных,ПараметрыСтрокиМаксимальных);
					СтрокаМаксимальных.Показание 		= Выборка.Показание;
					СтрокаМаксимальных.ДатаРегистратора = Выборка.ДатаРегистратора;
				иначе
					Если СтрокиТаблицыМаксимальных.Количество() > 0 тогда
						// Удаляем строку из максимальных показаний.
						ТаблицаМаксимальных.Удалить(СтрокиТаблицыМаксимальных[0]);
					КонецЕсли;  // Иначе ничего не деляем там и так не никаких данных.
				КонецЕсли; // Иначе ничего не делаем оставляем строку так как она уже есть.
			иначе
				Если СтрокиТаблицыМаксимальных.Количество() > 0 тогда
					// Удаляем строку из максимальных показаний.
					ТаблицаМаксимальных.Удалить(СтрокиТаблицыМаксимальных[0]);
				КонецЕсли;  // Иначе ничего не деляем там и так не никаких данных.
			КонецЕсли; 			
			
			Если СостояниеПоказаний = ПоказанияПриняты Тогда
				//Если  Выборка.СостояниеПоказаний = ПоказанияПриняты или ВСрок тогда
				
				// Записываем набор.
				НаборПредоставленных 					= РегистрыСведений.бестПредоставленныеПоказанияНП.СоздатьНаборЗаписей();
				НаборПредоставленных.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
				СтрокаНабор  							= НаборПредоставленных.Добавить();
				СтрокаНабор.ПериодНачисления 			= ПериодНачисления;
				СтрокаНабор.Организация					= Организация;
				СтрокаНабор.Район						= Район;
				СтрокаНабор.ОбъектРасчета				= ОбъектРасчета;
				СтрокаНабор.ПриборУчета					= ПриборУчета;
				СтрокаНабор.Шкала						= Шкала;
				СтрокаНабор.ТарифнаяЗона				= ТарифнаяЗона;
				СтрокаНабор.НомерПозиции  				= ТекНомерПозиции;
				СтрокаНабор.ДатаРегистратора  			= Выборка.ПериодРегистрации;
				СтрокаНабор.ДокРегистратор  			= Выборка.ДокРегистратор;
				СтрокаНабор.Разделитель		  			= Выборка.Разделитель;
				СтрокаНабор.Показания  					= ?(ПредыдущиеМакс<0,0,ПредыдущиеМакс);
				СтрокаНабор.ВСрок  						= ВСрок;
				СтрокаНабор.ПоказанияТекущегоПериода	= ПоказанияТекущегоПериода;
				СтрокаНабор.МКД							= МКД;
				НаборПредоставленных.Записать(Ложь); 				     			
				
				ТекНомерПозиции 						= ТекНомерПозиции +1;			
			КонецЕсли;   
			
			// Записываем максимальные показаний.
			НаборМаксПоказаний.Загрузить(ТаблицаМаксимальных);
			НаборМаксПоказаний.Записать(Ложь);			
		КонецЦикла;
		Набор 											= РегистрыСведений.бестМаксимальныеПоказанияСрезНП.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.установить(Организация);
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
		Набор.Отбор.Район.установить(Район);
		Набор.Отбор.МКД.установить(МКД);
		Набор.Отбор.ОбъектРасчета.установить(ОбъектРасчета);
		Набор.Отбор.ПриборУчета.установить(ПриборУчета);
		Если ЗначениеЗаполнено(Шкала) Тогда
			Набор.Отбор.Шкала.установить(Шкала);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТарифнаяЗона) Тогда
			Набор.Отбор.ТарифнаяЗона.установить(ТарифнаяЗона);
		КонецЕсли;
		Набор.Записать();
		
		Если ЗаписыватьВМаксСрез Тогда
			Набор 											= РегистрыСведений.бестМаксимальныеПоказанияСрезНП.СоздатьНаборЗаписей();
			СтрокаНабора 									= Набор.Добавить();
			СтрокаНабора.Организация 						= Организация;
			СтрокаНабора.ПериодНачисления 					= ПериодНачисления;
			СтрокаНабора.Район								= Район;
			СтрокаНабора.ОбъектРасчета						= ОбъектРасчета;
			СтрокаНабора.ПриборУчета						= ПриборУчета;
			СтрокаНабора.Шкала								= Шкала;
			СтрокаНабора.ТарифнаяЗона						= ТарифнаяЗона;
			СтрокаНабора.Показания 							= ПредыдущиеМакс;
			СтрокаНабора.ДокРегистратор 					= РегистраторМаксимальных;
			СтрокаНабора.ДатаРегистратора 					= ДатаРегистратораМаксимальных;
			СтрокаНабора.МКД 								= МКД;
			Набор.Записать(Ложь);
		КонецЕсли;
		Возврат Ложь;
	Исключение
		Представление  								= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Представление);
		Возврат Истина;
	КонецПопытки;
КонецФункции

Функция ИмяТабличнойЧастиПоказанийНП(Регистратор)
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСДоговором_ОткрытиеДоговора тогда
			Возврат "ПоказанияПриборовУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСДоговором_ЗакрытиеДоговора тогда
			Возврат "ТочкиУчетаЗакрытие";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли  ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестОперацияСПриборомУчетаНП")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ тогда
			Возврат "ПоказанияПриборовУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ тогда
			Возврат "ПоказанияПриборовУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ тогда
			Возврат "ПоказанияПриборовУчета";	
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестОперацияСУслугамиНП")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда
			Возврат "ПоказанияПриборовУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги тогда
			Возврат "ПоказанияПриборовУчета";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестРегистрацияПоказанийНП")	тогда	
		Возврат "ПоказанияПриборовУчета";			
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
	КонецЕсли; 	
КонецФункции

#КонецОбласти

#Область ОтложенныеДвиженияДокументовНачисления

Функция РезультатНачальныеОстаткиСтабильногоПериодаНП(ПериодНачисления,Организация,Район,ПериодРегистрации,ИсключаяОтдельностоящие = Ложь, МКД,мОбъектыРасчета,Перерасчет,БратьДанныеИзСтандартныхРС,РС)
	
	Разделить = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Если Перерасчет Тогда
		Текст 	=
		"ВЫБРАТЬ
		|	&Периодначисления КАК ПериодНачисления,
		|	&Район КАК Район,
		|	Значение(Документ.бестНачислениеНП.ПустаяСсылка) КАК ДокРегистратор,
		|	&ПериодРегистрации КАК ДатаРегистратора,
		|	&Организация КАК Организация,
		|	&МКД КАК МКД
		|ПОМЕСТИТЬ ДокументыДляПроведенияНП";
	Иначе
		Текст 	=
		"ВЫБРАТЬ
		|	бестОтложенныеДвиженияДокументовНП.ПериодНачисления КАК ПериодНачисления,
		|	бестОтложенныеДвиженияДокументовНП.Район КАК Район,
		|	бестОтложенныеДвиженияДокументовНП.ДокРегистратор КАК ДокРегистратор,
		|	бестОтложенныеДвиженияДокументовНП.ДатаРегистратора КАК ДатаРегистратора,
		|	бестОтложенныеДвиженияДокументовНП.Организация КАК Организация,
		|	бестОтложенныеДвиженияДокументовНП.МКД КАК МКД
		|ПОМЕСТИТЬ ДокументыДляПроведенияНП
		|ИЗ
		|	РегистрСведений.бестОтложенныеДвиженияДокументовНП КАК бестОтложенныеДвиженияДокументовНП
		|ГДЕ
		|	бестОтложенныеДвиженияДокументовНП.ПериодНачисления = &Периодначисления
		|	И бестОтложенныеДвиженияДокументовНП.Район = &Район
		|	И бестОтложенныеДвиженияДокументовНП.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.бестРазделыЗаписиНП.СтабильныеПериодыНП)
		|	И бестОтложенныеДвиженияДокументовНП.Организация = &Организация
		|	И бестОтложенныеДвиженияДокументовНП.МКД = &МКД";
	КонецЕсли;
	
	Текст 	= Текст + Разделить;	
	
	Текст 	= Текст + СтабильныеПериодыДокументыНачисления();
	
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"И бестСтабильныеПериодыНП.МКД = &МКД","И бестСтабильныеПериодыНП.МКД <> &МКД");
		Текст 		= СтрЗаменить(Текст,"И бестОтложенныеДвиженияДокументовНП.МКД = &МКД","И бестОтложенныеДвиженияДокументовНП.МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"И бестОтложенныеДвиженияДокументовНП.МКД = &МКД","");
			Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыНП.МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Если мОбъектыРасчета = Неопределено Тогда
		Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыНП.ОбъектРасчета В(&мОбъектыРасчета)","ИСТИНА");
	КонецЕсли;
	
	Если Перерасчет И НЕ БратьДанныеИзСтандартныхРС Тогда  
		Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыНП",				РС.РСбестСтабильныеПериодыНП);
		Текст 		= СтрЗаменить(Текст,"бестСтабильныеПериодыШкалыНП",			РС.РСбестСтабильныеПериодыШкалыНП);
		Текст 		= СтрЗаменить(Текст,"бестНомераСтрокСтабильногоПериодаНП",	РС.РСбестНомераСтрокСтабильногоПериодаНП);
	КонецЕсли;
	
	МВТ 							= Новый МенеджерВременныхТаблиц;
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодРегистрации",		ПериодРегистрации);
	Запрос.УстановитьПараметр("ПредыдущийПериод",		НачалоМесяца(ПериодНачисления-1));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Периодначисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Период",					КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("МКД",					МКД);
	Запрос.УстановитьПараметр("мОбъектыРасчета",		мОбъектыРасчета);
	
	Запрос.Выполнить();
	
	
	Текст 							=	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредоставленныеПоказания.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ПредоставленныеПоказания.Район КАК Район,
	|	ПредоставленныеПоказания.ОбъектРасчета КАК ОбъектРасчета,
	|	ПредоставленныеПоказания.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПредоставленныеПоказания
	|ИЗ
	|	РегистрСведений.бестПредоставленныеПоказанияНП КАК ПредоставленныеПоказания
	|ГДЕ
	|	ПредоставленныеПоказания.Организация = &Организация
	|	И ПредоставленныеПоказания.ПериодНачисления = &ПредыдущийПериод
	|	И ПредоставленныеПоказания.Район = &Район
	|	И ПредоставленныеПоказания.ПоказанияТекущегоПериода
	|	И ПредоставленныеПоказания.МКД = &МКД";
	
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"И ПредоставленныеПоказания.МКД = &МКД","И ПредоставленныеПоказания.МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"И ПредоставленныеПоказания.МКД = &МКД","");
		КонецЕсли;
	КонецЕсли;
	
	
	Текст 	= Текст + Разделить;
	
	Текст 	= Текст +  "
	|ВЫБРАТЬ
	|	ДокументыНачальныхОстатков.Организация КАК Организация,
	|	ДокументыНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыНачальныхОстатков.Район КАК Район,
	|	ДокументыНачальныхОстатков.Договор КАК Договор,
	|	ДокументыНачальныхОстатков.МКД КАК МКД,
	|	ДокументыНачальныхОстатков.ОбъектРасчета КАК ОбъектРасчета,
	|	ДокументыНачальныхОстатков.Услуга КАК Услуга,
	|	ДокументыНачальныхОстатков.ТочкаУчета КАК ТочкаУчета,
	|	ДокументыНачальныхОстатков.ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыНачальныхОстатков.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыНачальныхОстатков.ДоговорЗаключен КАК ДоговорЗаключен,
	|	ДокументыНачальныхОстатков.ОбъектРасчетаПодключен КАК ОбъектРасчетаПодключен,
	|	ДокументыНачальныхОстатков.УслугаПодключена КАК УслугаПодключена,
	|	ДокументыНачальныхОстатков.ПриборВведен КАК ПриборВведен,
	|	ДокументыНачальныхОстатков.ПриборУчета КАК ПриборУчета,
	|	ДокументыНачальныхОстатков.ЗначениеНагрузки КАК ЗначениеНагрузки,
	|	ДокументыНачальныхОстатков.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ДокументыНачальныхОстатков.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ДокументыНачальныхОстатков.ДатаПоверки КАК ДатаПоверки,
	|	ДокументыНачальныхОстатков.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ДокументыНачальныхОстатков.КоэффициентРасчета КАК КоэффициентРасчета,
	|	ДокументыНачальныхОстатков.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ДокументыНачальныхОстатков.ЗначениеНормативаЗаДень КАК ЗначениеНормативаЗаДень,
	|	ДокументыНачальныхОстатков.ОбъектУчаствуетВРаспределенииМКД КАК ОбъектУчаствуетВРаспределенииМКД,
	|	ДокументыНачальныхОстатков.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДокументыНачальныхОстатков.ТепловаяСоставляющая КАК ТепловаяСоставляющая,
	|	ДокументыНачальныхОстатков.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ДокументыНачальныхОстатков.КлючНорматива КАК КлючНорматива,
	|	ДокументыНачальныхОстатков.Поставщик КАК Поставщик,
	|	ДокументыНачальныхОстатков.Шкала КАК Шкала,
	|	ДокументыНачальныхОстатков.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ДокументыНачальныхОстатков.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДокументыНачальныхОстатков.ФормулаРасчета КАК ФормулаРасчета,
	|	ДокументыНачальныхОстатков.ТипСхемыГВС КАК ТипСхемыГВС,
	|	ДокументыНачальныхОстатков.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ДокументыНачальныхОстатков.УчаствуетВДолевойСхеме КАК УчаствуетВДолевойСхеме,
	|	ДокументыНачальныхОстатков.СпособРаспределенияОбъемаДолевойТУ КАК СпособРаспределенияОбъемаДолевойТУ,
	|	ДокументыНачальныхОстатков.СпособРаспределенияОстаткаДолевыеСхемы КАК СпособРаспределенияОстаткаДолевыеСхемы,
	|	ДокументыНачальныхОстатков.РасчетИндивидуальногоПотребления КАК РасчетИндивидуальногоПотребления,
	|	ДокументыНачальныхОстатков.КоличествоЧасовРаботы КАК КоличествоЧасовРаботы,
	|	ДокументыНачальныхОстатков.КоэффициентДолевогоРаспределения КАК КоэффициентДолевогоРаспределения,
	|	ДокументыНачальныхОстатков.СхемаРасчетаПриВыходеПУ КАК СхемаРасчетаПриВыходеПУ,
	|	ДокументыНачальныхОстатков.ИндивидуальнаяНастройкаУслуги КАК ИндивидуальнаяНастройкаУслуги,
	|	ДокументыНачальныхОстатков.РасчетПоФактическомуПотреблению КАК РасчетПоФактическомуПотреблению,
	|	ДокументыНачальныхОстатков.ДиаметрСечения КАК ДиаметрСечения,
	|	ДокументыНачальныхОстатков.ДоговорнойКоэффициент КАК ДоговорнойКоэффициент,
	|	ДокументыНачальныхОстатков.КоэффициентПУ КАК КоэффициентПУ,
	|	ДокументыНачальныхОстатков.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП,
	|	ДокументыНачальныхОстатков.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ДокументыНачальныхОстатков.КоличествоНедопусков КАК КоличествоНедопусков,
	|	ДокументыНачальныхОстатков.ПериодНачальногоНедопуска КАК ПериодНачальногоНедопуска,
	|	0 КАК НомерПозиции,
	|	0 КАК ФиксированныйОбъем,
	|	ЛОЖЬ КАК МенялосьСостояниеПУ,
	|	ЛОЖЬ КАК МенялосьСостояниеФормулы,
	|	ЛОЖЬ КАК ВводНачальныхОстатков
	|ИЗ
	|	ДокументыНачальныхОстатков КАК ДокументыНачальныхОстатков
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыНачальныхОстатков.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДокументыНачальныхОстатков.Район КАК Район,
	|	ДокументыНачальныхОстатков.МКД КАК МКД,
	|	ДокументыНачальныхОстатков.ОбъектРасчета КАК ОбъектРасчета,
	|	бестМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	бестМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	бестМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестМаксимальныеПоказанияСрез.Показания КАК Показания,
	|	бестМаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	бестМаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора
	|ИЗ
	|	ДокументыНачальныхОстатков КАК ДокументыНачальныхОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестМаксимальныеПоказанияСрезНП КАК бестМаксимальныеПоказанияСрез
	|		ПО ДокументыНачальныхОстатков.Организация = бестМаксимальныеПоказанияСрез.Организация
	|			И (ДокументыНачальныхОстатков.ПериодНачисления = ДОБАВИТЬКДАТЕ(бестМаксимальныеПоказанияСрез.ПериодНачисления, МЕСЯЦ, 1))
	|			И ДокументыНачальныхОстатков.Район = бестМаксимальныеПоказанияСрез.Район
	|			И ДокументыНачальныхОстатков.ОбъектРасчета = бестМаксимальныеПоказанияСрез.ОбъектРасчета
	|			И ДокументыНачальныхОстатков.ПриборУчета = бестМаксимальныеПоказанияСрез.ПриборУчета
	|			И (ДокументыНачальныхОстатков.ПриборВведен)
	|			И (бестМаксимальныеПоказанияСрез.Организация = &Организация)
	|			И (бестМаксимальныеПоказанияСрез.ПериодНачисления = &ПредыдущийПериод)
	|			И (бестМаксимальныеПоказанияСрез.Район = &Район)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыНачальныхОстатков.Организация КАК Организация,
	|	ДокументыНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыНачальныхОстатков.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|	0 КАК НомерПозиции,
	|	ПараметрыШкалСтаблиногоПериода.Район КАК Район,
	|	ПараметрыШкалСтаблиногоПериода.МКД КАК МКД,
	|	ПараметрыШкалСтаблиногоПериода.ОбъектРасчета КАК ОбъектРасчета,
	|	ПараметрыШкалСтаблиногоПериода.ТочкаУчета КАК ТочкаУчета,
	|	ПараметрыШкалСтаблиногоПериода.Шкала КАК Шкала,
	|	ПараметрыШкалСтаблиногоПериода.ВидДифференцированности КАК ВидДифференцированности
	|ИЗ
	|	ДокументыНачальныхОстатков КАК ДокументыНачальныхОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыШкалСтаблиногоПериода КАК ПараметрыШкалСтаблиногоПериода
	|		ПО ДокументыНачальныхОстатков.Организация = ПараметрыШкалСтаблиногоПериода.Организация
	|			И ДокументыНачальныхОстатков.ПериодНачисления = ПараметрыШкалСтаблиногоПериода.ПериодНачисления
	|			И ДокументыНачальныхОстатков.Район = ПараметрыШкалСтаблиногоПериода.Район
	|			И ДокументыНачальныхОстатков.ОбъектРасчета = ПараметрыШкалСтаблиногоПериода.ОбъектРасчета
	|			И ДокументыНачальныхОстатков.ТочкаУчета = ПараметрыШкалСтаблиногоПериода.ТочкаУчета
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД"; 
	
	
	Запрос.Текст 			= Текст;
	
	Возврат Запрос.ВыполнитьПакет();
	
	
КонецФункции

Функция СтабильныеПериодыДокументыНачисления()
	
	Текст 	=  
	"ВЫБРАТЬ
	|	бестСтабильныеПериодыНП.ПериодНачисления КАК ПериодНачисления,
	|	бестСтабильныеПериодыНП.Район КАК Район,
	|	бестСтабильныеПериодыНП.МКД КАК МКД,
	|	бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|	бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(бестСтабильныеПериодыНП.НомерПозиции) КАК НомерПозиции,
	|	бестСтабильныеПериодыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ НомерСтрок
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|ГДЕ
	|	бестСтабильныеПериодыНП.ПериодНачисления = &ПредыдущийПериод
	|	И бестСтабильныеПериодыНП.Район = &Район
	|	И бестСтабильныеПериодыНП.Организация = &Организация
	|	И бестСтабильныеПериодыНП.МКД = &МКД
	|	И бестСтабильныеПериодыНП.ОбъектРасчета В(&мОбъектыРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСтабильныеПериодыНП.ПериодНачисления,
	|	бестСтабильныеПериодыНП.Район,
	|	бестСтабильныеПериодыНП.МКД,
	|	бестСтабильныеПериодыНП.Услуга,
	|	бестСтабильныеПериодыНП.ТочкаУчета,
	|	бестСтабильныеПериодыНП.Организация,
	|	бестСтабильныеПериодыНП.ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	0 КАК НомерПозиции,
	| "+ бестНачисленияНП.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","СтабильныеПериоды","Организация,ПериодНачисления,НомерПозиции") + "
	|ПОМЕСТИТЬ ПараметрыСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК СтабильныеПериоды
	|		ПО НомерСтрок.ПериодНачисления = СтабильныеПериоды.ПериодНачисления
	|			И НомерСтрок.Организация = СтабильныеПериоды.Организация
	|			И НомерСтрок.Район = СтабильныеПериоды.Район
	|			И НомерСтрок.ОбъектРасчета = СтабильныеПериоды.ОбъектРасчета
	|			И НомерСтрок.МКД = СтабильныеПериоды.МКД
	|			И НомерСтрок.Услуга = СтабильныеПериоды.Услуга
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериоды.ТочкаУчета
	|			И НомерСтрок.НомерПозиции = СтабильныеПериоды.НомерПозиции
	|			И (СтабильныеПериоды.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериоды.Район = &Район)
	|			И (СтабильныеПериоды.Организация = &Организация)
	|;
	|ВЫБРАТЬ
	| "+ энргНачисления.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыНП","ПараметрыСтаблиногоПериода","ПериодРегистрации,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведенияНП.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведенияНП.ДокРегистратор КАК ДокРегистратор
	|ПОМЕСТИТЬ ДокументыНачальныхОстатков
	|ИЗ
	|	ПараметрыСтаблиногоПериода КАК ПараметрыСтаблиногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляПроведенияНП КАК ДокументыДляПроведенияНП
	|		ПО ПараметрыСтаблиногоПериода.Организация = ДокументыДляПроведенияНП.Организация
	|			И ПараметрыСтаблиногоПериода.ПериодНачисления = ДокументыДляПроведенияНП.ПериодНачисления
	|			И ПараметрыСтаблиногоПериода.Район = ДокументыДляПроведенияНП.Район
	|			И ПараметрыСтаблиногоПериода.МКД = ДокументыДляПроведенияНП.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("бестСтабильныеПериодыШкалыНП","СтабильныеПериодыШкалы","Организация,ПериодНачисления,НомерПозиции,ДатаРегистратора,ДокРегистратор") + "		
	|ПОМЕСТИТЬ ПараметрыШкалСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыШкалыНП КАК СтабильныеПериодыШкалы
	|		ПО НомерСтрок.Организация = СтабильныеПериодыШкалы.Организация
	|			И НомерСтрок.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И НомерСтрок.Район = СтабильныеПериодыШкалы.Район
	|			И НомерСтрок.ОбъектРасчета = СтабильныеПериодыШкалы.ОбъектРасчета
	|			И НомерСтрок.МКД = СтабильныеПериодыШкалы.МКД
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (СтабильныеПериодыШкалы.Организация = &Организация)
	|			И (СтабильныеПериодыШкалы.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериодыШкалы.Район = &Район)";	
	
	Возврат Текст;
	
КонецФункции  

Процедура ОчиститьДанныеПочасовойВедомостиСрез(Организация, ПериодНачисления, Район, МКД, мОбъектыРасчета)
	Если ЗначениеЗаполнено(мОбъектыРасчета) Тогда
		Для каждого ОбъектРасчета из мОбъектыРасчета Цикл
			НаборДанныеПочасовойВедомостиСрез					= РегистрыСведений.бестДанныеПочасовойВедомостиСрез.СоздатьНаборЗаписей();
			НаборДанныеПочасовойВедомостиСрез.Отбор.Организация.установить(Организация);
			НаборДанныеПочасовойВедомостиСрез.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборДанныеПочасовойВедомостиСрез.Отбор.Район.установить(Район);
			НаборДанныеПочасовойВедомостиСрез.Отбор.ОбъектРасчета.установить(ОбъектРасчета);
			НаборДанныеПочасовойВедомостиСрез.записать();
		КонецЦикла;
	Иначе
		НаборДанныеПочасовойВедомостиСрез					= РегистрыСведений.бестДанныеПочасовойВедомостиСрез.СоздатьНаборЗаписей();
		НаборДанныеПочасовойВедомостиСрез.Отбор.Организация.установить(Организация);
		НаборДанныеПочасовойВедомостиСрез.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборДанныеПочасовойВедомостиСрез.Отбор.Район.установить(Район);
		Если Не МКД = Неопределено  Тогда
			НаборДанныеПочасовойВедомостиСрез.Отбор.МКД.установить(МКД);
		КонецЕсли;
		НаборДанныеПочасовойВедомостиСрез.записать();
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьДанныеПочасовойВедомостиСрез(Организация, ПериодНачисления, Район, МКД, ГраницыПериода, ИсключаяОтдельностоящие, мОбъектыРасчета)
	Запрос = Новый Запрос; 
	Запрос.Текст = ТекстЗапросаЗамещающийПрофиль();	
		
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", 					ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("КонецПериодаРасчета", 					ГраницыПериода.ЗавершениеОП);
	Запрос.УстановитьПараметр("ПериодНачисления", 						ПериодНачисления);
	
	Запрос.УстановитьПараметр("НачалоПериодаРасчетаПредыдущийГод", 		ДобавитьМесяц(ГраницыПериода.НачалоОП, -12));
	Запрос.УстановитьПараметр("КонецПериодаРасчетаПредыдущийГод", 		ДобавитьМесяц(ГраницыПериода.ЗавершениеОП, -12));
	Запрос.УстановитьПараметр("ПериодНачисленияПредыдущийГод", 			ДобавитьМесяц(ПериодНачисления, -12));
	
	Запрос.УстановитьПараметр("Организация", 							Организация);	
	Запрос.УстановитьПараметр("Район", 									Район);
	Запрос.УстановитьПараметр("мОбъектыРасчета", 						мОбъектыРасчета);
	Запрос.УстановитьПараметр("МКД", 									МКД);  
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", 				КалендарныеГрафики.ОсновнойПроизводственныйКалендарь());
	
	Если НЕ ЗначениеЗаполнено(мОбъектыРасчета) Тогда
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"бестДанныеПочасовойВедомости.ОбъектРасчета В(&мОбъектыРасчета)","ИСТИНА");
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"бестПочасоваяВедомость.ОбъектРасчета В(&мОбъектыРасчета)","ИСТИНА");
	КонецЕсли;
	
	Если ИсключаяОтдельностоящие тогда
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"бестДанныеПочасовойВедомости.МКД = &МКД","бестДанныеПочасовойВедомости.МКД <> &МКД");
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"бестОбъектыРасчета.МКД = &МКД","бестОбъектыРасчета.МКД <> &МКД")
	Иначе
		Если МКД = Неопределено Тогда 
			Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"бестДанныеПочасовойВедомости.МКД = &МКД","ИСТИНА");
			Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"бестОбъектыРасчета.МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ТекстЗапросаЗамещающийПрофиль()
	Возврат "ВЫБРАТЬ
	        |	бестПочасоваяВедомость.Организация КАК Организация,
	        |	бестПочасоваяВедомость.Район КАК Район,
	        |	бестОбъектыРасчета.МКД КАК МКД,
	        |	бестПочасоваяВедомость.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестПочасоваяВедомость.ТочкаУчета КАК ТочкаУчета,
	        |	МАКСИМУМ(бестПочасоваяВедомость.ПериодНачисления) КАК ПоследнийПериодНачисления
	        |ПОМЕСТИТЬ ПоследнийПериодПредоставленияПочасовойВедомости
	        |ИЗ
	        |	Документ.бестПочасоваяВедомость КАК бестПочасоваяВедомость
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	        |		ПО бестПочасоваяВедомость.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	        |ГДЕ
	        |	бестПочасоваяВедомость.Проведен
	        |	И бестПочасоваяВедомость.Организация = &Организация
	        |	И бестПочасоваяВедомость.Район = &Район
	        |	И бестОбъектыРасчета.МКД = &МКД
	        |	И бестПочасоваяВедомость.ОбъектРасчета В(&мОбъектыРасчета)
	        |	И бестПочасоваяВедомость.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПочасоваяВедомость_ФактическоеПотребление)
	        |	И бестПочасоваяВедомость.ПериодНачисления <= &ПериодНачисления
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестПочасоваяВедомость.ОбъектРасчета,
	        |	бестПочасоваяВедомость.ТочкаУчета,
	        |	бестПочасоваяВедомость.Район,
	        |	бестПочасоваяВедомость.Организация,
	        |	бестОбъектыРасчета.МКД
	        |
	        |ИМЕЮЩИЕ
	        |	МАКСИМУМ(бестПочасоваяВедомость.ПериодНачисления) <> &ПериодНачисления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестДанныеПочасовойВедомости.Организация КАК Организация,
	        |	бестДанныеПочасовойВедомости.Район КАК Район,
	        |	бестДанныеПочасовойВедомости.МКД КАК МКД,
	        |	бестДанныеПочасовойВедомости.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестДанныеПочасовойВедомости.ТочкаУчета КАК ТочкаУчета,
	        |	бестДанныеПочасовойВедомости.Час КАК Час,
	        |	бестДанныеПочасовойВедомости.Объем КАК Объем,
	        |	ДЕНЬ(бестДанныеПочасовойВедомости.День) КАК ДеньЧисло,
	        |	бестДанныеПочасовойВедомости.День КАК ИзначальныйДень,
	        |	бестДанныеПочасовойВедомости.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ПочасоваяВедомостьЗаПредыдущийГод
	        |ИЗ
	        |	РегистрСведений.бестДанныеПочасовойВедомости КАК бестДанныеПочасовойВедомости
	        |ГДЕ
	        |	бестДанныеПочасовойВедомости.ПериодНачисления = &ПериодНачисленияПредыдущийГод
	        |	И бестДанныеПочасовойВедомости.День >= &НачалоПериодаРасчетаПредыдущийГод
	        |	И бестДанныеПочасовойВедомости.День <= &КонецПериодаРасчетаПредыдущийГод
	        |	И НЕ бестДанныеПочасовойВедомости.План
	        |	И (бестДанныеПочасовойВедомости.Организация, бестДанныеПочасовойВедомости.Район, бестДанныеПочасовойВедомости.МКД, бестДанныеПочасовойВедомости.ОбъектРасчета, бестДанныеПочасовойВедомости.ТочкаУчета) В
	        |			(ВЫБРАТЬ
	        |				ПоследнийПериодПредоставленияПочасовойВедомости.Организация КАК Организация,
	        |				ПоследнийПериодПредоставленияПочасовойВедомости.Район КАК Район,
	        |				ПоследнийПериодПредоставленияПочасовойВедомости.МКД КАК МКД,
	        |				ПоследнийПериодПредоставленияПочасовойВедомости.ОбъектРасчета КАК ОбъектРасчета,
	        |				ПоследнийПериодПредоставленияПочасовойВедомости.ТочкаУчета КАК ТочкаУчета
	        |			ИЗ
	        |				ПоследнийПериодПредоставленияПочасовойВедомости КАК ПоследнийПериодПредоставленияПочасовойВедомости)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестДанныеПочасовойВедомости.Организация КАК Организация,
	        |	бестДанныеПочасовойВедомости.Район КАК Район,
	        |	бестДанныеПочасовойВедомости.МКД КАК МКД,
	        |	бестДанныеПочасовойВедомости.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестДанныеПочасовойВедомости.ТочкаУчета КАК ТочкаУчета,
	        |	бестДанныеПочасовойВедомости.Час КАК Час,
	        |	бестДанныеПочасовойВедомости.Объем КАК Объем,
	        |	ДЕНЬ(бестДанныеПочасовойВедомости.День) КАК ДеньЧисло,
	        |	бестДанныеПочасовойВедомости.День КАК ИзначальныйДень,
	        |	бестДанныеПочасовойВедомости.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ПоследняяПредоставленнаяПочасоваяВедомость
	        |ИЗ
	        |	РегистрСведений.бестДанныеПочасовойВедомости КАК бестДанныеПочасовойВедомости
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПочасоваяВедомостьЗаПредыдущийГод КАК ПочасоваяВедомостьЗаПредыдущийГод
	        |		ПО бестДанныеПочасовойВедомости.Организация = ПочасоваяВедомостьЗаПредыдущийГод.Организация
	        |			И бестДанныеПочасовойВедомости.Район = ПочасоваяВедомостьЗаПредыдущийГод.Район
	        |			И бестДанныеПочасовойВедомости.МКД = ПочасоваяВедомостьЗаПредыдущийГод.МКД
	        |			И бестДанныеПочасовойВедомости.ОбъектРасчета = ПочасоваяВедомостьЗаПредыдущийГод.ОбъектРасчета
	        |			И бестДанныеПочасовойВедомости.ТочкаУчета = ПочасоваяВедомостьЗаПредыдущийГод.ТочкаУчета
	        |			И (ДЕНЬ(бестДанныеПочасовойВедомости.День) = ПочасоваяВедомостьЗаПредыдущийГод.ДеньЧисло)
	        |			И бестДанныеПочасовойВедомости.Час = ПочасоваяВедомостьЗаПредыдущийГод.Час
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследнийПериодПредоставленияПочасовойВедомости КАК ПоследнийПериодПредоставленияПочасовойВедомости
	        |		ПО бестДанныеПочасовойВедомости.Организация = ПоследнийПериодПредоставленияПочасовойВедомости.Организация
	        |			И бестДанныеПочасовойВедомости.Район = ПоследнийПериодПредоставленияПочасовойВедомости.Район
	        |			И бестДанныеПочасовойВедомости.МКД = ПоследнийПериодПредоставленияПочасовойВедомости.МКД
	        |			И бестДанныеПочасовойВедомости.ОбъектРасчета = ПоследнийПериодПредоставленияПочасовойВедомости.ОбъектРасчета
	        |			И бестДанныеПочасовойВедомости.ТочкаУчета = ПоследнийПериодПредоставленияПочасовойВедомости.ТочкаУчета
	        |			И бестДанныеПочасовойВедомости.ПериодНачисления = ПоследнийПериодПредоставленияПочасовойВедомости.ПоследнийПериодНачисления
	        |ГДЕ
	        |	НЕ бестДанныеПочасовойВедомости.План
	        |	И ПочасоваяВедомостьЗаПредыдущийГод.Организация ЕСТЬ NULL
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПочасоваяВедомостьЗаПредыдущийГод.Организация КАК Организация,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.Район КАК Район,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.МКД КАК МКД,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.ТочкаУчета КАК ТочкаУчета,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.Час КАК Час,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.Объем КАК Объем,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.ДеньЧисло КАК ДеньЧисло,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.ИзначальныйДень КАК ИзначальныйДень,
	        |	ПочасоваяВедомостьЗаПредыдущийГод.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ПочасоваяВедомостьИтог
	        |ИЗ
	        |	ПочасоваяВедомостьЗаПредыдущийГод КАК ПочасоваяВедомостьЗаПредыдущийГод
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.Организация,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.Район,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.МКД,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.ОбъектРасчета,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.ТочкаУчета,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.Час,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.Объем,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.ДеньЧисло,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.ИзначальныйДень,
	        |	ПоследняяПредоставленнаяПочасоваяВедомость.УчитыватьКоэффициентПУ
	        |ИЗ
	        |	ПоследняяПредоставленнаяПочасоваяВедомость КАК ПоследняяПредоставленнаяПочасоваяВедомость
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестПоставщикиУслугНПСрезПоследних.Организация КАК Организация,
	        |	бестПоставщикиУслугНПСрезПоследних.Район КАК Район,
	        |	бестПоставщикиУслугНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	МАКСИМУМ(энргКонтрагенты.бестЗамещениеПоПоследнейРабочейНеделе) КАК бестЗамещениеПоПоследнейРабочейНеделе
	        |ПОМЕСТИТЬ ТУСЗамещениемПоПоследнейНеделе
	        |ИЗ
	        |	РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
	        |			&КонецПериодаРасчета,
	        |			(Организация, Район, ТочкаУчета) В
	        |				(ВЫБРАТЬ
	        |					ПочасоваяВедомостьИтог.Организация КАК Организация,
	        |					ПочасоваяВедомостьИтог.Район КАК Район,
	        |					ПочасоваяВедомостьИтог.ТочкаУчета КАК ТочкаУчета
	        |				ИЗ
	        |					ПочасоваяВедомостьИтог КАК ПочасоваяВедомостьИтог)) КАК бестПоставщикиУслугНПСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	        |		ПО бестПоставщикиУслугНПСрезПоследних.Поставщик = энргКонтрагенты.Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестПоставщикиУслугНПСрезПоследних.Организация,
	        |	бестПоставщикиУслугНПСрезПоследних.Район,
	        |	бестПоставщикиУслугНПСрезПоследних.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПочасоваяВедомостьИтог.Организация КАК Организация,
	        |	ПочасоваяВедомостьИтог.Район КАК Район,
	        |	ПочасоваяВедомостьИтог.МКД КАК МКД,
	        |	ПочасоваяВедомостьИтог.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПочасоваяВедомостьИтог.ТочкаУчета КАК ТочкаУчета,
	        |	ДОБАВИТЬКДАТЕ(&НачалоПериодаРасчета, ДЕНЬ, ПочасоваяВедомостьИтог.ДеньЧисло - 1) КАК День,
	        |	ПочасоваяВедомостьИтог.Час КАК Час,
	        |	ПочасоваяВедомостьИтог.Объем КАК Объем,
	        |	ПочасоваяВедомостьИтог.ДеньЧисло КАК ДеньЧисло,
	        |	ПочасоваяВедомостьИтог.ИзначальныйДень КАК ИзначальныйДень,
	        |	ПочасоваяВедомостьИтог.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ПочасоваяВедомостьИтогСопоставленная
	        |ИЗ
	        |	ПочасоваяВедомостьИтог КАК ПочасоваяВедомостьИтог
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТУСЗамещениемПоПоследнейНеделе КАК ТУСЗамещениемПоПоследнейНеделе
	        |		ПО ПочасоваяВедомостьИтог.Организация = ТУСЗамещениемПоПоследнейНеделе.Организация
	        |			И ПочасоваяВедомостьИтог.Район = ТУСЗамещениемПоПоследнейНеделе.Район
	        |			И ПочасоваяВедомостьИтог.ТочкаУчета = ТУСЗамещениемПоПоследнейНеделе.ТочкаУчета
	        |ГДЕ
	        |	НЕ ТУСЗамещениемПоПоследнейНеделе.бестЗамещениеПоПоследнейРабочейНеделе
	        |	И ДЕНЬ(ПочасоваяВедомостьИтог.ИзначальныйДень) >= ДЕНЬ(&ПериодНачисления)
	        |	И ДЕНЬ(ПочасоваяВедомостьИтог.ИзначальныйДень) <= ДЕНЬ(КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПочасоваяВедомостьИтогСопоставленная.Организация КАК Организация,
	        |	ПочасоваяВедомостьИтогСопоставленная.Район КАК Район,
	        |	ПочасоваяВедомостьИтогСопоставленная.МКД КАК МКД,
	        |	ПочасоваяВедомостьИтогСопоставленная.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПочасоваяВедомостьИтогСопоставленная.ТочкаУчета КАК ТочкаУчета,
	        |	МАКСИМУМ(ПочасоваяВедомостьИтогСопоставленная.День) КАК ПоследнийДень,
	        |	ПочасоваяВедомостьИтогСопоставленная.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ВТПоследнийДень
	        |ИЗ
	        |	ПочасоваяВедомостьИтогСопоставленная КАК ПочасоваяВедомостьИтогСопоставленная
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПочасоваяВедомостьИтогСопоставленная.Организация,
	        |	ПочасоваяВедомостьИтогСопоставленная.Район,
	        |	ПочасоваяВедомостьИтогСопоставленная.МКД,
	        |	ПочасоваяВедомостьИтогСопоставленная.ОбъектРасчета,
	        |	ПочасоваяВедомостьИтогСопоставленная.ТочкаУчета,
	        |	ПочасоваяВедомостьИтогСопоставленная.УчитыватьКоэффициентПУ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПочасоваяВедомостьИтог.Организация КАК Организация,
	        |	ПочасоваяВедомостьИтог.Район КАК Район,
	        |	ПочасоваяВедомостьИтог.МКД КАК МКД,
	        |	ПочасоваяВедомостьИтог.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПочасоваяВедомостьИтог.ТочкаУчета КАК ТочкаУчета,
	        |	ПочасоваяВедомостьИтог.Час КАК Час,
	        |	ПочасоваяВедомостьИтог.Объем КАК Объем,
	        |	ПочасоваяВедомостьИтог.ДеньЧисло КАК ДеньЧисло,
	        |	ПочасоваяВедомостьИтог.ИзначальныйДень КАК ИзначальныйДень,
	        |	ПочасоваяВедомостьИтог.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ДанныеДляРасчетаПоПоследнейНеделе
	        |ИЗ
	        |	ПочасоваяВедомостьИтог КАК ПочасоваяВедомостьИтог
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТУСЗамещениемПоПоследнейНеделе КАК ТУСЗамещениемПоПоследнейНеделе
	        |		ПО ПочасоваяВедомостьИтог.Организация = ТУСЗамещениемПоПоследнейНеделе.Организация
	        |			И ПочасоваяВедомостьИтог.Район = ТУСЗамещениемПоПоследнейНеделе.Район
	        |			И ПочасоваяВедомостьИтог.ТочкаУчета = ТУСЗамещениемПоПоследнейНеделе.ТочкаУчета
	        |ГДЕ
	        |	ТУСЗамещениемПоПоследнейНеделе.бестЗамещениеПоПоследнейРабочейНеделе
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляРасчетаПоПоследнейНеделе.Организация КАК Организация,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.Район КАК Район,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.МКД КАК МКД,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.ОбъектРасчета КАК ОбъектРасчета,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.ТочкаУчета КАК ТочкаУчета,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.Час КАК Час,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.Объем КАК Объем,
	        |	ДЕНЬНЕДЕЛИ(ДанныеДляРасчетаПоПоследнейНеделе.ИзначальныйДень) КАК ДеньНеделиЧисло,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.ДеньЧисло КАК ДеньЧисло,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.ИзначальныйДень КАК ИзначальныйДень,
	        |	ДанныеДляРасчетаПоПоследнейНеделе.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ОбъемыПоследнейНедели
	        |ИЗ
	        |	ДанныеДляРасчетаПоПоследнейНеделе КАК ДанныеДляРасчетаПоПоследнейНеделе
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНеделиЗамещения КАК бестНеделиЗамещения
	        |		ПО ДанныеДляРасчетаПоПоследнейНеделе.ИзначальныйДень >= бестНеделиЗамещения.НачалоНедели
	        |			И ДанныеДляРасчетаПоПоследнейНеделе.ИзначальныйДень <= бестНеделиЗамещения.КонецНедели
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	        |	ВЫБОР
	        |		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
	        |			ТОГДА 7
	        |		ИНАЧЕ ДЕНЬНЕДЕЛИ(ДанныеПроизводственногоКалендаря.Дата)
	        |	КОНЕЦ КАК ДеньНеделиЧисло
	        |ПОМЕСТИТЬ КалендарьЗаМесяцРасчета
	        |ИЗ
	        |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	        |ГДЕ
	        |	ДанныеПроизводственногоКалендаря.Дата >= &НачалоПериодаРасчета
	        |	И ДанныеПроизводственногоКалендаря.Дата < &КонецПериодаРасчета
	        |	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбъемыПоследнейНедели.Организация КАК Организация,
	        |	ОбъемыПоследнейНедели.Район КАК Район,
	        |	ОбъемыПоследнейНедели.МКД КАК МКД,
	        |	ОбъемыПоследнейНедели.ОбъектРасчета КАК ОбъектРасчета,
	        |	ОбъемыПоследнейНедели.ТочкаУчета КАК ТочкаУчета,
	        |	ОбъемыПоследнейНедели.Час КАК Час,
	        |	ОбъемыПоследнейНедели.Объем КАК Объем,
	        |	КалендарьЗаМесяцРасчета.Дата КАК Дата,
	        |	ДЕНЬ(КалендарьЗаМесяцРасчета.Дата) КАК ДеньЧисло,
	        |	ОбъемыПоследнейНедели.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ОбновленныйПрофильЗамещения
	        |ИЗ
	        |	КалендарьЗаМесяцРасчета КАК КалендарьЗаМесяцРасчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыПоследнейНедели КАК ОбъемыПоследнейНедели
	        |		ПО КалендарьЗаМесяцРасчета.ДеньНеделиЧисло = ОбъемыПоследнейНедели.ДеньНеделиЧисло
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеДляРасчетаПоПоследнейНеделе.ТочкаУчета КАК ТочкаУчета,
	        |	СУММА(ДанныеДляРасчетаПоПоследнейНеделе.Объем) КАК Объем,
	        |	МАКСИМУМ(ДанныеДляРасчетаПоПоследнейНеделе.ДеньЧисло) КАК ДеньЧисло
	        |ПОМЕСТИТЬ СуммаОбъемовИзначальногоПрофиля
	        |ИЗ
	        |	ДанныеДляРасчетаПоПоследнейНеделе КАК ДанныеДляРасчетаПоПоследнейНеделе
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеДляРасчетаПоПоследнейНеделе.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбновленныйПрофильЗамещения.ТочкаУчета КАК ТочкаУчета,
	        |	СУММА(ОбновленныйПрофильЗамещения.Объем) КАК Объем,
	        |	МАКСИМУМ(ОбновленныйПрофильЗамещения.ДеньЧисло) КАК ДеньЧисло
	        |ПОМЕСТИТЬ СуммаОбъемовОбновленногоПрофиля
	        |ИЗ
	        |	ОбновленныйПрофильЗамещения КАК ОбновленныйПрофильЗамещения
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОбновленныйПрофильЗамещения.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СуммаОбъемовИзначальногоПрофиля.ТочкаУчета КАК ТочкаУчета,
	        |	ВЫБОР
	        |		КОГДА СуммаОбъемовОбновленногоПрофиля.Объем = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ СуммаОбъемовИзначальногоПрофиля.Объем / СуммаОбъемовИзначальногоПрофиля.ДеньЧисло * СуммаОбъемовОбновленногоПрофиля.ДеньЧисло / СуммаОбъемовОбновленногоПрофиля.Объем
	        |	КОНЕЦ КАК ДоляОбъемовПрофилей
	        |ПОМЕСТИТЬ ДолиПрофилей
	        |ИЗ
	        |	СуммаОбъемовИзначальногоПрофиля КАК СуммаОбъемовИзначальногоПрофиля
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммаОбъемовОбновленногоПрофиля КАК СуммаОбъемовОбновленногоПрофиля
	        |		ПО СуммаОбъемовИзначальногоПрофиля.ТочкаУчета = СуммаОбъемовОбновленногоПрофиля.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ОбновленныйПрофильЗамещения.Организация КАК Организация,
	        |	ОбновленныйПрофильЗамещения.Район КАК Район,
	        |	ОбновленныйПрофильЗамещения.МКД КАК МКД,
	        |	ОбновленныйПрофильЗамещения.ОбъектРасчета КАК ОбъектРасчета,
	        |	ОбновленныйПрофильЗамещения.ТочкаУчета КАК ТочкаУчета,
	        |	ОбновленныйПрофильЗамещения.Час КАК Час,
	        |	ОбновленныйПрофильЗамещения.Объем * ДолиПрофилей.ДоляОбъемовПрофилей КАК Объем,
	        |	ОбновленныйПрофильЗамещения.Дата КАК Дата,
	        |	ОбновленныйПрофильЗамещения.ДеньЧисло КАК ДеньЧисло,
	        |	ОбновленныйПрофильЗамещения.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ПОМЕСТИТЬ ИтогРасчетаПоПоследнейНеделе
	        |ИЗ
	        |	ОбновленныйПрофильЗамещения КАК ОбновленныйПрофильЗамещения
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДолиПрофилей КАК ДолиПрофилей
	        |		ПО ОбновленныйПрофильЗамещения.ТочкаУчета = ДолиПрофилей.ТочкаУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПочасоваяВедомостьИтогСопоставленная.Организация КАК Организация,
	        |	ПочасоваяВедомостьИтогСопоставленная.Район КАК Район,
	        |	ПочасоваяВедомостьИтогСопоставленная.МКД КАК МКД,
	        |	ПочасоваяВедомостьИтогСопоставленная.ОбъектРасчета КАК ОбъектРасчета,
	        |	ПочасоваяВедомостьИтогСопоставленная.ТочкаУчета КАК ТочкаУчета,
	        |	ПочасоваяВедомостьИтогСопоставленная.День КАК День,
	        |	ПочасоваяВедомостьИтогСопоставленная.Час КАК Час,
	        |	ПочасоваяВедомостьИтогСопоставленная.Объем КАК Объем,
	        |	ПочасоваяВедомостьИтогСопоставленная.ДеньЧисло КАК ДеньЧисло,
	        |	ПочасоваяВедомостьИтогСопоставленная.День = ВТПоследнийДень.ПоследнийДень КАК ЭтоПоследнийДень,
	        |	ПочасоваяВедомостьИтогСопоставленная.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ИЗ
	        |	ПочасоваяВедомостьИтогСопоставленная КАК ПочасоваяВедомостьИтогСопоставленная
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследнийДень КАК ВТПоследнийДень
	        |		ПО ПочасоваяВедомостьИтогСопоставленная.Организация = ВТПоследнийДень.Организация
	        |			И ПочасоваяВедомостьИтогСопоставленная.Район = ВТПоследнийДень.Район
	        |			И ПочасоваяВедомостьИтогСопоставленная.МКД = ВТПоследнийДень.МКД
	        |			И ПочасоваяВедомостьИтогСопоставленная.ОбъектРасчета = ВТПоследнийДень.ОбъектРасчета
	        |			И ПочасоваяВедомостьИтогСопоставленная.ТочкаУчета = ВТПоследнийДень.ТочкаУчета
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ИтогРасчетаПоПоследнейНеделе.Организация,
	        |	ИтогРасчетаПоПоследнейНеделе.Район,
	        |	ИтогРасчетаПоПоследнейНеделе.МКД,
	        |	ИтогРасчетаПоПоследнейНеделе.ОбъектРасчета,
	        |	ИтогРасчетаПоПоследнейНеделе.ТочкаУчета,
	        |	ИтогРасчетаПоПоследнейНеделе.Дата,
	        |	ИтогРасчетаПоПоследнейНеделе.Час,
	        |	ИтогРасчетаПоПоследнейНеделе.Объем,
	        |	ИтогРасчетаПоПоследнейНеделе.ДеньЧисло,
	        |	ЛОЖЬ,
	        |	ИтогРасчетаПоПоследнейНеделе.УчитыватьКоэффициентПУ
	        |ИЗ
	        |	ИтогРасчетаПоПоследнейНеделе КАК ИтогРасчетаПоПоследнейНеделе";	
КонецФункции

#КонецОбласти

#Область СреднийОбъемПотребленияНП

Функция РезультатаЗапросаСреднегоПотребленияНП(Организация, ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие)
	
	ГраницыПериода  								= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				МКД);
	Запрос.УстановитьПараметр("Период",				НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("ПериодВвода",		ДобавитьМесяц(ПериодНачисления,-2));
	Запрос.УстановитьПараметр("НачалоПериода",		ДобавитьМесяц(НачалоМесяца(ПериодНачисления),-6));
	Запрос.УстановитьПараметр("КонецПериода",		НачалоМесяца(ПериодНачисления)-1);
	Текст 			= ТекстЗапросаСреднийОбъемНП();
	
	Если ИсключаяОтдельностоящие тогда
		Текст 		= СтрЗаменить(Текст,"(бестСтабильныеПериодыНП.МКД = &МКД)","(бестСтабильныеПериодыНП.МКД <> &МКД)");
	Иначе
		Если МКД = Неопределено Тогда 
			Текст 		= СтрЗаменить(Текст,"(бестСтабильныеПериодыНП.МКД = &МКД)","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст 	= Текст;
	Результат  		= Запрос.Выполнить();
	Возврат результат;
КонецФункции

Функция ТекстЗапросаСреднийОбъемНП()
	
	текст  = "ВЫБРАТЬ
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.Организация КАК Организация,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.Услуга КАК Услуга,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПоказаний КАК КоличествоПоказаний,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПериодов КАК КоличествоПериодов,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|	бестНастройкиРасчетаСреднегоПотребленияСрезПоследних.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный
	|ПОМЕСТИТЬ НастройкиРасчетаСреднегоПотребления
	|ИЗ
	|	РегистрСведений.бестНастройкиРасчетаСреднегоПотребления.СрезПоследних(&ПериодНачисления, Организация = &Организация) КАК бестНастройкиРасчетаСреднегоПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасчетСреднегоОбъемаНП.Район КАК Район,
	|	бестРасчетСреднегоОбъемаНП.МКД КАК МКД,
	|	бестРасчетСреднегоОбъемаНП.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	бестРасчетСреднегоОбъемаНП.Шкала КАК Шкала,
	|	бестРасчетСреднегоОбъемаНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления) КАК КонецПериода,
	|	МАКСИМУМ(СтабильныеПериоды.КоличествоПериодов) КАК КоличествоПериодов,
	|	МАКСИМУМ(СтабильныеПериоды.ЗаПрошлыйГод) КАК ЗаПрошлыйГод,
	|	МАКСИМУМ(СтабильныеПериоды.ПоВсемНачислениям) КАК ПоВсемНачислениям,
	|	бестРасчетСреднегоОбъемаНП.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ТочкиДляРасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		бестСтабильныеПериодыНП.Район КАК Район,
	|		бестСтабильныеПериодыНП.МКД КАК МКД,
	|		бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|		бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|		НастройкиРасчетаСреднегоПотребления.КоличествоПериодов КАК КоличествоПериодов,
	|		НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|		НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|		бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета
	|	ИЗ
	|		РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|			ПО бестСтабильныеПериодыНП.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга
	|				И (бестСтабильныеПериодыНП.Организация = &Организация)
	|				И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|				И (бестСтабильныеПериодыНП.Район = &Район)
	|				И (бестСтабильныеПериодыНП.МКД = &МКД)
	|				И (бестСтабильныеПериодыНП.НомерПозиции = 0)
	|				И (бестСтабильныеПериодыНП.УслугаПодключена)) КАК СтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетСреднегоОбъемаНП КАК бестРасчетСреднегоОбъемаНП
	|		ПО СтабильныеПериоды.Район = бестРасчетСреднегоОбъемаНП.Район
	|			И СтабильныеПериоды.МКД = бестРасчетСреднегоОбъемаНП.МКД
	|			И СтабильныеПериоды.ТочкаУчета = бестРасчетСреднегоОбъемаНП.ТочкаУчета
	|			И (бестРасчетСреднегоОбъемаНП.ПериодНачисления < &ПериодНачисления)
	|			И СтабильныеПериоды.ОбъектРасчета = бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	бестРасчетСреднегоОбъемаНП.Район,
	|	бестРасчетСреднегоОбъемаНП.МКД,
	|	бестРасчетСреднегоОбъемаНП.ТочкаУчета,
	|	СтабильныеПериоды.Услуга,
	|	бестРасчетСреднегоОбъемаНП.Шкала,
	|	бестРасчетСреднегоОбъемаНП.ТарифнаяЗона,
	|	бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(бестРасчетСреднегоОбъемаНП.ПериодНачисления, МЕСЯЦ)) >= МАКСИМУМ(СтабильныеПериоды.КоличествоПериодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Строение КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.КоличествоПредоставленных КАК КоличествоПредоставленных,
	|	ВложенныйЗапрос.СрокНеПредоставления КАК СрокНеПредоставления,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.КоличествоПоказаний КАК КоличествоПоказаний,
	|	ВложенныйЗапрос.КоличествоПериодов КАК КоличествоПериодов,
	|	ВложенныйЗапрос.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	ВложенныйЗапрос.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ТочкиДляРасчета2
	|ИЗ
	|	(ВЫБРАТЬ
	|		бестРасчетСреднегоОбъемаНП.Район КАК Район,
	|		бестРасчетСреднегоОбъемаНП.МКД КАК Строение,
	|		бестРасчетСреднегоОбъемаНП.ТочкаУчета КАК ТочкаУчета,
	|		СтабильныеПериоды.Услуга КАК Услуга,
	|		бестРасчетСреднегоОбъемаНП.Шкала КАК Шкала,
	|		бестРасчетСреднегоОбъемаНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(бестРасчетСреднегоОбъемаНП.ПериодНачисления, МЕСЯЦ)) КАК КоличествоПредоставленных,
	|		РАЗНОСТЬДАТ(МАКСИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления), &ПериодНачисления, МЕСЯЦ) КАК СрокНеПредоставления,
	|		МАКСИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления) КАК КонецПериода,
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПоказаний) КАК КоличествоПоказаний,
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПериодов) КАК КоличествоПериодов,
	|		МАКСИМУМ(СтабильныеПериоды.ЗаПрошлыйГод) КАК ЗаПрошлыйГод,
	|		МАКСИМУМ(СтабильныеПериоды.НачислятьСреднийОбъемНеБолееМесяцев) КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|		ЛОЖЬ КАК ЭтоОбъемПотребленный,
	|		СтабильныеПериоды.ОбъектРасчета КАК ОбъектРасчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			бестСтабильныеПериодыНП.Район КАК Район,
	|			бестСтабильныеПериодыНП.МКД КАК Строение,
	|			бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПоказаний КАК КоличествоПоказаний,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПериодов КАК КоличествоПериодов,
	|			НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|			НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|			НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|			бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета
	|		ИЗ
	|			НастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|				ПО 
	|					(бестСтабильныеПериодыНП.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга)
	|					И (бестСтабильныеПериодыНП.Организация = &Организация)
	|					И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|					И (бестСтабильныеПериодыНП.Район = &Район)
	|					И (бестСтабильныеПериодыНП.МКД = &МКД)
	|					И (бестСтабильныеПериодыНП.НомерПозиции = 0)
	|					И (бестСтабильныеПериодыНП.УслугаПодключена)) КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетСреднегоОбъемаНП КАК бестРасчетСреднегоОбъемаНП
	|			ПО СтабильныеПериоды.Район = бестРасчетСреднегоОбъемаНП.Район
	|				И СтабильныеПериоды.Строение = бестРасчетСреднегоОбъемаНП.МКД
	|				И СтабильныеПериоды.ТочкаУчета = бестРасчетСреднегоОбъемаНП.ТочкаУчета
	|				И СтабильныеПериоды.ОбъектРасчета = бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|				И (бестРасчетСреднегоОбъемаНП.ПериодНачисления < ВЫБОР
	|					КОГДА СтабильныеПериоды.ЗаПрошлыйГод
	|						ТОГДА НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД)
	|					ИНАЧЕ &ПериодНачисления
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериоды.Услуга,
	|		СтабильныеПериоды.ОбъектРасчета,
	|		бестРасчетСреднегоОбъемаНП.Район,
	|		бестРасчетСреднегоОбъемаНП.МКД,
	|		бестРасчетСреднегоОбъемаНП.ТочкаУчета,
	|		бестРасчетСреднегоОбъемаНП.Шкала,
	|		бестРасчетСреднегоОбъемаНП.ТарифнаяЗона
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		бестРасчетСреднегоОбъемаНП.Район,
	|		бестРасчетСреднегоОбъемаНП.МКД,
	|		бестРасчетСреднегоОбъемаНП.ТочкаУчета,
	|		СтабильныеПериоды.Услуга,
	|		бестРасчетСреднегоОбъемаНП.Шкала,
	|		бестРасчетСреднегоОбъемаНП.ТарифнаяЗона,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(бестРасчетСреднегоОбъемаНП.ПериодНачисления, МЕСЯЦ)),
	|		РАЗНОСТЬДАТ(МАКСИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления), &ПериодНачисления, МЕСЯЦ),
	|		МАКСИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления),
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПоказанийОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПериодовОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.ЗаПрошлыйГодОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный),
	|		ИСТИНА,
	|		СтабильныеПериоды.ОбъектРасчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			бестСтабильныеПериодыНП.Район КАК Район,
	|			бестСтабильныеПериодыНП.МКД КАК Строение,
	|			бестСтабильныеПериодыНП.ТочкаУчета КАК ТочкаУчета,
	|			бестСтабильныеПериодыНП.Услуга КАК Услуга,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|			бестСтабильныеПериодыНП.ОбъектРасчета КАК ОбъектРасчета
	|		ИЗ
	|			НастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|				ПО 
	|					(бестСтабильныеПериодыНП.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга)
	|					И (бестСтабильныеПериодыНП.Организация = &Организация)
	|					И (бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления)
	|					И (бестСтабильныеПериодыНП.Район = &Район)
	|					И (бестСтабильныеПериодыНП.МКД = &МКД)
	|					И (бестСтабильныеПериодыНП.НомерПозиции = 0)
	|					И (бестСтабильныеПериодыНП.УслугаПодключена)) КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетСреднегоОбъемаНП КАК бестРасчетСреднегоОбъемаНП
	|			ПО (бестРасчетСреднегоОбъемаНП.ПериодНачисления < ВЫБОР
	|					КОГДА СтабильныеПериоды.ЗаПрошлыйГодОбъемПотребленный
	|						ТОГДА НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД)
	|					ИНАЧЕ &ПериодНачисления
	|				КОНЕЦ)
	|				И СтабильныеПериоды.Район = бестРасчетСреднегоОбъемаНП.Район
	|				И СтабильныеПериоды.Строение = бестРасчетСреднегоОбъемаНП.МКД
	|				И СтабильныеПериоды.ТочкаУчета = бестРасчетСреднегоОбъемаНП.ТочкаУчета
	|				И СтабильныеПериоды.ОбъектРасчета = бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериоды.Услуга,
	|		СтабильныеПериоды.ОбъектРасчета,
	|		бестРасчетСреднегоОбъемаНП.Район,
	|		бестРасчетСреднегоОбъемаНП.МКД,
	|		бестРасчетСреднегоОбъемаНП.ТочкаУчета,
	|		бестРасчетСреднегоОбъемаНП.Шкала,
	|		бестРасчетСреднегоОбъемаНП.ТарифнаяЗона) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЗаПрошлыйГод
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВложенныйЗапрос.КоличествоПредоставленных >= ВложенныйЗапрос.КоличествоПоказаний
	|					И ВложенныйЗапрос.СрокНеПредоставления <= ВложенныйЗапрос.НачислятьСреднийОбъемНеБолееМесяцев
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	МИНИМУМ(ВложенныйЗапрос.НачалоПериода) КАК НачалоПериода,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	РАЗНОСТЬДАТ(МИНИМУМ(ВложенныйЗапрос.НачалоПериода), ВложенныйЗапрос.КонецПериода, МЕСЯЦ) + 1 КАК КоличествоМесяцев,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный
	|ПОМЕСТИТЬ ПериодыРасчетаСреднего
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТочкиДляРасчета2.Район КАК Район,
	|		ТочкиДляРасчета2.МКД КАК МКД,
	|		ТочкиДляРасчета2.ОбъектРасчета КАК ОбъектРасчета,
	|		ТочкиДляРасчета2.Услуга КАК Услуга,
	|		ТочкиДляРасчета2.ТочкаУчета КАК ТочкаУчета,
	|		ТочкиДляРасчета2.Шкала КАК Шкала,
	|		ТочкиДляРасчета2.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ТочкиДляРасчета2.КонецПериода КАК КонецПериода,
	|		МАКСИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления) КАК НачалоПериода,
	|		ТочкиДляРасчета2.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный
	|	ИЗ
	|		ТочкиДляРасчета2 КАК ТочкиДляРасчета2
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетСреднегоОбъемаНП КАК бестРасчетСреднегоОбъемаНП
	|			ПО ТочкиДляРасчета2.Район = бестРасчетСреднегоОбъемаНП.Район
	|				И ТочкиДляРасчета2.ОбъектРасчета = бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|				И ТочкиДляРасчета2.ТочкаУчета = бестРасчетСреднегоОбъемаНП.ТочкаУчета
	|				И ТочкиДляРасчета2.Шкала = бестРасчетСреднегоОбъемаНП.Шкала
	|				И ТочкиДляРасчета2.ТарифнаяЗона = бестРасчетСреднегоОбъемаНП.ТарифнаяЗона
	|				И (бестРасчетСреднегоОбъемаНП.ПериодНачисления <= ДОБАВИТЬКДАТЕ(ТочкиДляРасчета2.КонецПериода, МЕСЯЦ, -ТочкиДляРасчета2.КоличествоПериодов + 1))
	|				И (бестРасчетСреднегоОбъемаНП.Организация = &Организация)
	|				И (бестРасчетСреднегоОбъемаНП.Район = &Район)
	|				И (НЕ ТочкиДляРасчета2.ЗаПрошлыйГод)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТочкиДляРасчета2.Район,
	|		ТочкиДляРасчета2.МКД,
	|		ТочкиДляРасчета2.ОбъектРасчета,
	|		ТочкиДляРасчета2.Услуга,
	|		ТочкиДляРасчета2.ТочкаУчета,
	|		ТочкиДляРасчета2.Шкала,
	|		ТочкиДляРасчета2.ТарифнаяЗона,
	|		ТочкиДляРасчета2.КонецПериода,
	|		ТочкиДляРасчета2.ЭтоОбъемПотребленный
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТочкиДляРасчета2.Район,
	|		ТочкиДляРасчета2.МКД,
	|		ТочкиДляРасчета2.ОбъектРасчета,
	|		ТочкиДляРасчета2.Услуга,
	|		ТочкиДляРасчета2.ТочкаУчета,
	|		ТочкиДляРасчета2.Шкала,
	|		ТочкиДляРасчета2.ТарифнаяЗона,
	|		ТочкиДляРасчета2.КонецПериода,
	|		МИНИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления),
	|		ТочкиДляРасчета2.ЭтоОбъемПотребленный
	|	ИЗ
	|		ТочкиДляРасчета2 КАК ТочкиДляРасчета2
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетСреднегоОбъемаНП КАК бестРасчетСреднегоОбъемаНП
	|			ПО ТочкиДляРасчета2.Район = бестРасчетСреднегоОбъемаНП.Район
	|				И ТочкиДляРасчета2.ОбъектРасчета = бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|				И ТочкиДляРасчета2.ТочкаУчета = бестРасчетСреднегоОбъемаНП.ТочкаУчета
	|				И ТочкиДляРасчета2.Шкала = бестРасчетСреднегоОбъемаНП.Шкала
	|				И ТочкиДляРасчета2.ТарифнаяЗона = бестРасчетСреднегоОбъемаНП.ТарифнаяЗона
	|				И (бестРасчетСреднегоОбъемаНП.ПериодНачисления <= ДОБАВИТЬКДАТЕ(ТочкиДляРасчета2.КонецПериода, МЕСЯЦ, -ТочкиДляРасчета2.КоличествоПоказаний + 1))
	|				И (бестРасчетСреднегоОбъемаНП.ПериодНачисления >= ДОБАВИТЬКДАТЕ(ТочкиДляРасчета2.КонецПериода, МЕСЯЦ, -ТочкиДляРасчета2.КоличествоПериодов + 1 + 1))
	|				И (бестРасчетСреднегоОбъемаНП.Организация = &Организация)
	|				И (бестРасчетСреднегоОбъемаНП.Район = &Район)
	|				И (НЕ ТочкиДляРасчета2.ЗаПрошлыйГод)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТочкиДляРасчета2.Район,
	|		ТочкиДляРасчета2.МКД,
	|		ТочкиДляРасчета2.ОбъектРасчета,
	|		ТочкиДляРасчета2.Услуга,
	|		ТочкиДляРасчета2.ТочкаУчета,
	|		ТочкиДляРасчета2.Шкала,
	|		ТочкиДляРасчета2.ТарифнаяЗона,
	|		ТочкиДляРасчета2.КонецПериода,
	|		ТочкиДляРасчета2.ЭтоОбъемПотребленный
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТочкиДляРасчета2.Район,
	|		ТочкиДляРасчета2.МКД,
	|		ТочкиДляРасчета2.ОбъектРасчета,
	|		ТочкиДляРасчета2.Услуга,
	|		ТочкиДляРасчета2.ТочкаУчета,
	|		ТочкиДляРасчета2.Шкала,
	|		ТочкиДляРасчета2.ТарифнаяЗона,
	|		ТочкиДляРасчета2.КонецПериода,
	|		МИНИМУМ(бестРасчетСреднегоОбъемаНП.ПериодНачисления),
	|		ТочкиДляРасчета2.ЭтоОбъемПотребленный
	|	ИЗ
	|		ТочкиДляРасчета2 КАК ТочкиДляРасчета2
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетСреднегоОбъемаНП КАК бестРасчетСреднегоОбъемаНП
	|			ПО ТочкиДляРасчета2.Район = бестРасчетСреднегоОбъемаНП.Район
	|				И ТочкиДляРасчета2.ОбъектРасчета = бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|				И ТочкиДляРасчета2.ТочкаУчета = бестРасчетСреднегоОбъемаНП.ТочкаУчета
	|				И ТочкиДляРасчета2.Шкала = бестРасчетСреднегоОбъемаНП.Шкала
	|				И ТочкиДляРасчета2.ТарифнаяЗона = бестРасчетСреднегоОбъемаНП.ТарифнаяЗона
	|				И (бестРасчетСреднегоОбъемаНП.ПериодНачисления < НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД))
	|				И (бестРасчетСреднегоОбъемаНП.ПериодНачисления >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД), ГОД, -1))
	|				И (бестРасчетСреднегоОбъемаНП.Организация = &Организация)
	|				И (бестРасчетСреднегоОбъемаНП.Район = &Район)
	|				И (ТочкиДляРасчета2.ЗаПрошлыйГод)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТочкиДляРасчета2.Район,
	|		ТочкиДляРасчета2.МКД,
	|		ТочкиДляРасчета2.ОбъектРасчета,
	|		ТочкиДляРасчета2.Услуга,
	|		ТочкиДляРасчета2.ТочкаУчета,
	|		ТочкиДляРасчета2.Шкала,
	|		ТочкиДляРасчета2.ТарифнаяЗона,
	|		ТочкиДляРасчета2.КонецПериода,
	|		ТочкиДляРасчета2.ЭтоОбъемПотребленный) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.КонецПериода,
	|	ВложенныйЗапрос.ОбъектРасчета,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|				И НЕ МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный)
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемУслуги)
	|		КОГДА НЕ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемУслуги)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК Объем,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|				И МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный)
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемПотребленный)
	|		КОГДА НЕ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемПотребленный)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ОбъемПотребленный,
	|	МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный) КАК ЭтоОбъемПотребленный,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) КАК КоличествоРасчитанныхОбъемов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПериодыРасчетаСреднего.Район КАК Район,
	|		ПериодыРасчетаСреднего.МКД КАК МКД,
	|		ПериодыРасчетаСреднего.Услуга КАК Услуга,
	|		ПериодыРасчетаСреднего.ТочкаУчета КАК ТочкаУчета,
	|		ПериодыРасчетаСреднего.Шкала КАК Шкала,
	|		ПериодыРасчетаСреднего.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВЫБОР
	|			КОГДА НЕ ПериодыРасчетаСреднего.ЭтоОбъемПотребленный
	|				ТОГДА СУММА(бестРасчетСреднегоОбъемаНП.ОбъемУслуги) / ПериодыРасчетаСреднего.КоличествоМесяцев
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОбъемУслуги,
	|		ПериодыРасчетаСреднего.ОбъектРасчета КАК ОбъектРасчета,
	|		ВЫБОР
	|			КОГДА ПериодыРасчетаСреднего.ЭтоОбъемПотребленный
	|				ТОГДА СУММА(бестРасчетСреднегоОбъемаНП.ОбъемУслуги) / ПериодыРасчетаСреднего.КоличествоМесяцев
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОбъемПотребленный,
	|		ПериодыРасчетаСреднего.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный
	|	ИЗ
	|		ПериодыРасчетаСреднего КАК ПериодыРасчетаСреднего
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетСреднегоОбъемаНП КАК бестРасчетСреднегоОбъемаНП
	|			ПО ПериодыРасчетаСреднего.Район = бестРасчетСреднегоОбъемаНП.Район
	|				И ПериодыРасчетаСреднего.ТочкаУчета = бестРасчетСреднегоОбъемаНП.ТочкаУчета
	|				И ПериодыРасчетаСреднего.Шкала = бестРасчетСреднегоОбъемаНП.Шкала
	|				И ПериодыРасчетаСреднего.ТарифнаяЗона = бестРасчетСреднегоОбъемаНП.ТарифнаяЗона
	|				И (бестРасчетСреднегоОбъемаНП.ПериодНачисления МЕЖДУ ПериодыРасчетаСреднего.НачалоПериода И ПериодыРасчетаСреднего.КонецПериода)
	|				И (бестРасчетСреднегоОбъемаНП.Организация = &Организация)
	|				И (бестРасчетСреднегоОбъемаНП.Район = &Район)
	|				И ПериодыРасчетаСреднего.ОбъектРасчета = бестРасчетСреднегоОбъемаНП.ОбъектРасчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПериодыРасчетаСреднего.Район,
	|		ПериодыРасчетаСреднего.МКД,
	|		ПериодыРасчетаСреднего.Услуга,
	|		ПериодыРасчетаСреднего.ТочкаУчета,
	|		ПериодыРасчетаСреднего.Шкала,
	|		ПериодыРасчетаСреднего.ТарифнаяЗона,
	|		ПериодыРасчетаСреднего.ОбъектРасчета,
	|		ПериодыРасчетаСреднего.ЭтоОбъемПотребленный,
	|		ПериодыРасчетаСреднего.КоличествоМесяцев) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.ОбъектРасчета"; 
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция ПараметрыЗаписиЖурнала(ИмяОперации,ПериодНачисления,Район)
	ПараметрыЗаписиЖурнала  = Новый Структура();
	
	СоотвествиеОпераций  	= Новый Структура;	
	СоотвествиеОпераций.Вставить("ОтложенныеДвиженияДокументовНачисленияМКД",			"Работа с последовательностями (биллинг). Чтение данных на начало периода расчета");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьСтабильныеПериодыМКД",	"Работа с последовательностями (биллинг). События мкд");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьПоказанияПУМКД",		"Работа с последовательностями (биллинг). Показания мкд");
	СоотвествиеОпераций.Вставить("ОтложенныеДвиженияДокументовНачисления",				"Работа с последовательностями (биллинг). Чтение данных на начало периода расчета (мкд)");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьСтабильныеПериоды",		"Работа с последовательностями (биллинг). События абонентов");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностьПоказанияПУ",			"Работа с последовательностями (биллинг). Показания абонентов");
	СоотвествиеОпераций.Вставить("ВосстановитьПоследовательностиВзаиморасчетов",		"Работа с последовательностями (биллинг). Взаиморасчеты с абонентами");
	СоотвествиеОпераций.Вставить("ПерерасчетСреднихНачислений",							"Работа с начислениями (биллинг). Перерасчет средних начислений");
	
	ПараметрыЗаписиЖурнала.Вставить("ИмяОперации",СоотвествиеОпераций[ИмяОперации]);
	ПараметрыЗаписиЖурнала.Вставить("Уровень",УровеньЖурналаРегистрации.Информация);
	ПараметрыЗаписиЖурнала.Вставить("Метаданные",РегистрыСведений.энргСтабильныеПериодыМКД);
	ПараметрыЗаписиЖурнала.Вставить("КомментарийСтарт","Запуск по району " 		+ Район + " за период" + Формат(ПериодНачисления,"ДФ='ММММ гггг'"));
	ПараметрыЗаписиЖурнала.Вставить("КомментарийСтоп","Завершение по району " 	+ Район + " за период" + Формат(ПериодНачисления,"ДФ='ММММ гггг'"));
	Возврат ПараметрыЗаписиЖурнала;
КонецФункции

Функция ПолучитьСтруктуруРегистров(Перерасчет)
	РС = Новый Структура;
	РС.Вставить("РСбестСтабильныеПериодыНП", 				?(Перерасчет, "бестСтабильныеПериодыНППерерасчет", "бестСтабильныеПериодыНП")); 
	РС.Вставить("РСбестСтабильныеПериодыШкалыНП", 			?(Перерасчет, "бестСтабильныеПериодыШкалыНППерерасчет", "бестСтабильныеПериодыШкалыНП"));
	РС.Вставить("РСбестНомераСтрокСтабильногоПериодаНП", 	?(Перерасчет, "бестНомераСтрокСтабильногоПериодаНППерерасчет", "бестНомераСтрокСтабильногоПериодаНП"));
	Возврат РС;
КонецФункции

#КонецОбласти

#Область ВосстановитьПоследовательностьВзаиморасчетыЭЭ

Функция ЗаполнитьМВТВзаиморасчеты(Организация, ПериодНачисления,Район,Договор,НачалоПериодаРасчета,КонецПериодаРасчета)
	МВТ 							= Новый МенеджерВременныхТаблиц;	
	Запрос  						= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Текст 							= ТекстМВТ_Взаиморасчеты();	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Текст = СтрЗаменить(Текст, "бестВзаиморасчетыПоследовательность.Договор = &Договор", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Договор",				Договор);
	КонецЕсли;
	Запрос.Текст 					= Текст;
	Запрос.Выполнить();
	Возврат МВТ;
КонецФункции

Функция РезультатДокументыДляПроведения(Организация,ПериодНачисления,Район,Договор,МВТ)
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Текст 							= ТекстДокументыДляПроведения();
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Текст = СтрЗаменить(Текст, "бестВзаиморасчетыПоследовательность.Договор = &Договор", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Договор",				Договор);
	КонецЕсли;
	
	Запрос.Текст 					= Текст;
	Возврат Запрос.Выполнить();	
КонецФункции

Функция НаборыПоТипам()
	
	Соотвествие  			= Новый Соответствие;	
	МассивРегистров  		= Новый Массив;
	МассивРегистров.Добавить("бестАвансыЭЭ");
	МассивРегистров.Добавить("бестВзаиморасчетыПоМесяцамЭЭ");
	МассивРегистров.Добавить("бестВзаиморасчетыПоАвансовымСчетам");
	МассивРегистров.Добавить("бестАвансыИспользованныеЭЭ");
	МассивРегистров.Добавить("бестВзаиморасчетыПоПениЭЭ");
	
	для Каждого Регистр из  МассивРегистров цикл
		Типы 					= Метаданные.РегистрыНакопления[Регистр].СтандартныеРеквизиты.Регистратор.Тип.типы();		
		Для Каждого ТипРегистратора из Типы цикл			
			Если Соотвествие.Получить(ТипРегистратора) = Неопределено тогда
				Массив 			= Новый Массив;
				Массив.Добавить(Регистр);
				Соотвествие.Вставить(ТипРегистратора,Массив);
			иначе
				Соотвествие[ТипРегистратора].добавить(Регистр);
			КонецЕсли;  			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат Соотвествие;
	
КонецФункции

Функция ИзменитьСостояниеПоследовательности(Организация, ПериодНачисления,Район,ПроведенСНарушением,ПроведенВПоследовательности,Договор)
	Попытка
		НаборПоследовательности  					= РегистрыСведений.бестВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
		НаборПоследовательности.Отбор.Организация.установить(Организация);
		НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
		НаборПоследовательности.Отбор.Район.установить(Район);
		НаборПоследовательности.Отбор.СостояниеПроведения.установить(ПроведенСНарушением);
		Если Договор <> Неопределено тогда
			НаборПоследовательности.Отбор.Договор.установить(Договор);
		КонецЕсли;
		НаборПоследовательности.Прочитать();
		ТаблицаНабора  								= НаборПоследовательности.Выгрузить();
		НаборПоследовательности.Очистить();
		НаборПоследовательности.Записать();
		
		ТаблицаНабора.ЗаполнитьЗначения(ПроведенВПоследовательности,"СостояниеПроведения");
		
		НаборПоследовательности  					= РегистрыСведений.бестВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
		НаборПоследовательности.Загрузить(ТаблицаНабора);
		НаборПоследовательности.Записать(Ложь);
		Возврат Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ПровестиВзаиморасчеты(ПараметрыПроведения,МассивДокументовНачисления)
	
	Организация 								= ПараметрыПроведения.Организация;
	ПериодНачисления							= ПараметрыПроведения.ПериодНачисления;
	Район										= ПараметрыПроведения.Район;
	МассивДокументов							= ПараметрыПроведения.МассивДокументов;
	ДанныеЗадолженности							= ПараметрыПроведения.ДанныеЗадолженности;
	Исключен  									= Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности;
	ПроведенВПоследоватености  					= Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности;
	Начисления									= ПараметрыПроведения.ДанныеНачислений;
	Оплата										= ПараметрыПроведения.ДанныеОплаты;
	текДокРегистратор 							= Неопределено;
	
	Параметры 									= Новый Структура("
	|Организация, ПериодНачисления, Район,
	|Авансы, СуммаАванса, ДанныеЗадолженности, СтавкаНДС, ДанныеКорректировки",
	Организация, ПериодНачисления, Район,
	ПараметрыПроведения.Авансы, ПараметрыПроведения.СуммаАванса, ДанныеЗадолженности, ПараметрыПроведения.СтавкаНДС, ПараметрыПроведения.ДанныеКорректировки);
	
	для Каждого Документ из МассивДокументов цикл  		
		ОчищатьСтроки 							= Истина;
		Если текДокРегистратор = Документ.ДокРегистратор Тогда
			ОчищатьСтроки 						= Ложь;
		КонецЕсли;
		
		Если Документ.состояниепроведения  = Исключен тогда 			
			// Очищаем данные.
			НаборПоследовательности 			= РегистрыСведений.бестВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
			НаборПоследовательности.Отбор.ДокРегистратор.установить(Документ.ДокРегистратор);
			НаборПоследовательности.Отбор.Организация.установить(Организация);
			НаборПоследовательности.Отбор.ПериодНачисления.установить(ПериодНачисления);
			НаборПоследовательности.Отбор.Район.установить(Район);
			НаборПоследовательности.Отбор.СостояниеПроведения.установить(Документ.СостояниеПроведения);
			НаборПоследовательности.Отбор.Договор.установить(Документ.Договор);
			НаборПоследовательности.Записать();		
			Продолжить;
		КонецЕсли;
		
		текДокРегистратор 						= Документ.ДокРегистратор;
		
		ДанныеДокумента  						= Новый Структура;
		ДанныеДокумента.Вставить("Договор", 				Документ.Договор);				
		ДанныеДокумента.Вставить("Период",					Документ.ДатаРегистратора);
		ДанныеДокумента.Вставить("ИсточникПоступления",		Документ.ИсточникПоступления);		
		ДанныеДокумента.Вставить("Регистратор",				текДокРегистратор);
		ДанныеДокумента.Вставить("ЭтоОплата",				Документ.ЭтоОплата);
		
		
		СтруктураТаблицНаборов 					= СтруктураТаблицНаборов(МассивДокументовНачисления, ОчищатьСтроки, ДанныеДокумента, ПараметрыПроведения, текДокРегистратор);
		
		ДанныеДокумента.Вставить("НаборТаблиц",							СтруктураТаблицНаборов.НаборТаблиц);
		ДанныеДокумента.Вставить("НаборыЗаписей",						СтруктураТаблицНаборов.НаборыЗаписей);
		
		
		Если Не Документ.ЭтоОплата тогда
			ДанныеНачисления					= Начисления[текДокРегистратор];									
			Если ДанныеНачисления <> Неопределено тогда				
				УвеличитьЗадолженность(Параметры, ДанныеДокумента, ДанныеНачисления);
			КонецЕсли;		
		Иначе	
			ДанныеОплаты						= Оплата[текДокРегистратор];
			РасшифровкаОплаты 					= ДанныеОплаты.Расшифровка;
			Для Каждого СтрокаОплаты Из РасшифровкаОплаты Цикл
				Если ЗначениеЗаполнено(СтрокаОплаты.МассивПД) Тогда
					Для каждого СтруктураПД из СтрокаОплаты.МассивПД Цикл
						СписатьЗадолженность(Параметры, ДанныеДокумента, СтрокаОплаты.Сумма, СтрокаОплаты.IDСтрокиОплаты, СтруктураПД.ПД, СтруктураПД.СуммаОплатыРаспределенная);
						Если СтрокаОплаты.Сумма <= 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					СписатьЗадолженность(Параметры, ДанныеДокумента, СтрокаОплаты.Сумма, СтрокаОплаты.IDСтрокиОплаты);
				КонецЕсли;
				Если СтрокаОплаты.Сумма > 0 Тогда
					УвеличитьАванс(Параметры,ДанныеДокумента,СтрокаОплаты.Сумма, СтрокаОплаты.IDСтрокиОплаты, Параметры.ПериодНачисления);
				КонецЕсли;				
			КонецЦикла;			 
		КонецЕсли;
		
		// Удаляем не нужные параметры.
		МассивПараметров  						= ПараметрыВзаиморасчетов();
		для Каждого УдаляемыйПараметр из МассивПараметров цикл
			Если Параметры.Свойство(УдаляемыйПараметр) тогда
				Параметры.Удалить(УдаляемыйПараметр);
			КонецЕсли;			
		КонецЦикла;
		
		// Не будем выполнять запись сразу, сначало пройдем все договоры.
		//Если ТипЗнч(текДокРегистратор) = Тип("ДокументСсылка.бестРеализацияЮрЛица")
		//	или ТипЗнч(текДокРегистратор) = Тип("ДокументСсылка.бестПлатежноеПоручениеВходящееЮрЛица") тогда
		//	
		//	НаборыЗаписей 				= Новый Структура("бестВзаиморасчётыПоУслугамЮрЛица,бестАвансы,бестАвансыИспользованные");			
		//	НаборТаблиц 				= Новый Структура("бестАвансы,бестАвансыИспользованные,бестВзаиморасчётыПоУслугамЮрЛица"); 			
		//	 									
		//	Если ТипЗнч(текДокРегистратор) = Тип("ДокументСсылка.бестПлатежноеПоручениеВходящееЮрЛица") Тогда				
		//		НаборыЗаписей.Вставить("бестОплатаУслуг",		 	Неопределено);
		//		НаборыЗаписей.Вставить("бестАвансыПоступившие",	Неопределено);				
		//		НаборТаблиц.Вставить("бестОплатаУслуг",				Неопределено);
		//		НаборТаблиц.Вставить("бестАвансыПоступившие",		Неопределено);
		//	КонецЕсли;  	
		//	ЗаполнитьЗначенияСвойств(НаборыЗаписей,ДанныеДокумента.НаборыЗаписей);
		//	ЗаполнитьЗначенияСвойств(НаборТаблиц,ДанныеДокумента.НаборТаблиц);
		//	
		//	НаборыОтложеннаяЗапись		= Новый Структура("НаборыЗаписей, НаборТаблиц", НаборыЗаписей, НаборТаблиц);
		//				
		//	Если МассивДокументовНачисления.получить(текДокРегистратор) = Неопределено тогда				
		//		МассивДокументовНачисления.вставить(текДокРегистратор,НаборыОтложеннаяЗапись);
		//	иначе
		//		МассивДокументовНачисления[текДокРегистратор] = НаборыОтложеннаяЗапись;
		//	КонецЕсли;
		//	ПараметрыПроведения.вставить("ЕстьДокументыНачисления",Истина); 
		//	Продолжить;
		//иначе
		НаборыЗаписей 				= ДанныеДокумента.НаборыЗаписей;
		НаборТаблиц 				= ДанныеДокумента.НаборТаблиц;
		для Каждого  СтрокаНабора из НаборыЗаписей цикл
			СтрокаНабора.Значение.загрузить(НаборТаблиц[СтрокаНабора.ключ]);
		КонецЦикла;			 			
		//КонецЕсли;   	
		
		Попытка
			для Каждого СтрокаНаборов из НаборыЗаписей цикл
				СтрокаНаборов.Значение.записать();
			КонецЦикла;		
		Исключение                      
			Представление 				= "Не восстановлена последоватеность по договору: " + Документ.Договор;
			Представление  				= Представление +Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Представление);
			Возврат Истина;
		КонецПопытки;
	КонецЦикла; 
	
	Возврат Ложь;
КонецФункции

Функция СтруктураТаблицНаборов(МассивДокументовНачисления, ОчищатьСтроки, ДанныеДокумента, ПараметрыПроведения, ДокРегистратор)
	
	НаборТаблиц  					= Новый Структура;
	НаборыЗаписей 					= Новый Структура;		
	
	МассивИмен  					= ПараметрыПроведения.НаборыПоТипам.получить(ТипЗнч(ДокРегистратор));
	для Каждого ИмяРегистра из МассивИмен цикл
		Набор  						= РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		Набор.Отбор.регистратор.установить(ДокРегистратор);
		Набор.Прочитать();
		
		Таблица 					= Набор.выгрузить();
		Набор.Очистить();
		НаборыЗаписей.Вставить(ИмяРегистра,Набор);
		НаборТаблиц.Вставить(ИмяРегистра,Таблица);
	КонецЦикла;							
	//КонецЕсли;
	
	Если ОчищатьСтроки  Тогда
		для Каждого СтрокаТаблиц из НаборТаблиц цикл
			Строки 						= СтрокаТаблиц.Значение.НайтиСтроки(Новый Структура("Договор",ДанныеДокумента.Договор));
			для Каждого Строка из Строки цикл
				СтрокаТаблиц.Значение.Удалить(Строка);
			КонецЦикла;  			
		КонецЦикла; 		
	КонецЕсли;
	
	Возврат Новый Структура("НаборТаблиц,НаборыЗаписей",НаборТаблиц,НаборыЗаписей);
	
КонецФункции

Функция ПараметрыВзаиморасчетов()
	
	МассивКлючей  = Новый Массив;
	МассивКлючей.Добавить("СнятьТекущие");
	МассивКлючей.Добавить("ВозвратАванса");
	МассивКлючей.Добавить("ДанныеНачисления");
	МассивКлючей.Добавить("ИсточникПоступления");
	Возврат МассивКлючей;	
КонецФункции

#Область РаботаСАвансами

Процедура ДобавитьРасходАванса(ПараметрыОперации, ДанныеДокумента, Сумма, ПараметрыИспользованияАванса)
	
	ТаблицаАвансы 										= ДанныеДокумента.НаборТаблиц.бестАвансыЭЭ;
	ТаблицаАвансыИспользованные 						= ДанныеДокумента.НаборТаблиц.бестАвансыИспользованныеЭЭ;
	
	Авансы 												= ПараметрыОперации.Авансы;
	ОсталосьСписать 									= Сумма;
	УдаляемыеСтроки 									= Новый Массив;
	
	Для Сч = 0 По Авансы.ВГраница() Цикл	
		
		Списываем 										= Мин(Авансы[Сч].СуммаАванса,ОсталосьСписать);
		ОсталосьСписать 								= ОсталосьСписать - Списываем;
		Авансы[Сч].СуммаАванса 							= Авансы[Сч].СуммаАванса - Списываем;
		
		Если Авансы[Сч].СуммаАванса = 0 Тогда
			УдаляемыеСтроки.Добавить(Сч);
		КонецЕсли;
		
		ЗаписьАвансы  									= ТаблицаАвансы.добавить();
		ЗаписьАвансы.ВидДвижения 						= ВидДвиженияНакопления.Расход;
		ЗаписьАвансы.Активность  						= истина;
		ЗаписьАвансы.Период  							= ДанныеДокумента.Период;			
		ЗаписьАвансы.Договор  							= ДанныеДокумента.Договор;
		ЗаписьАвансы.Сумма 								= Списываем;
		ЗаписьАвансы.СуммаНДС 							= Списываем - Списываем / (1 + ПараметрыОперации.СтавкаНДС/100);
		ЗаписьАвансы.ПериодНачисления 					= Авансы[Сч].ПериодНачисления;
		ЗаписьАвансы.ПериодРасчета 						= ПараметрыИспользованияАванса.ПериодРасчета;
		ЗаписьАвансы.Организация 						= ПараметрыОперации.Организация;
		ЗаписьАвансы.Район  							= ПараметрыОперации.Район;
		ЗаписьАвансы.ДокументОплаты 					= Авансы[Сч].ДокументОплаты;
		ЗаписьАвансы.IDСтрокиОплаты 					= Авансы[Сч].IDСтрокиОплаты;
		
		
		ЗаписьАвансыИспользованые					= ТаблицаАвансыИспользованные.добавить();
		ЗаписьАвансыИспользованые.Активность		= Истина;
		ЗаписьАвансыИспользованые.Период  			= ДанныеДокумента.Период;		
		ЗаписьАвансыИспользованые.Договор			= ДанныеДокумента.Договор;
		ЗаписьАвансыИспользованые.Сумма 			= Списываем;
		ЗаписьАвансыИспользованые.СуммаНДС 			= Списываем - Списываем / (1 + ПараметрыОперации.СтавкаНДС/100);
		ЗаписьАвансыИспользованые.ПериодНачисления 	= ПараметрыИспользованияАванса.ПериодНачисления;
		ЗаписьАвансыИспользованые.ПериодРасчета 	= ПараметрыИспользованияАванса.ПериодРасчета;
		ЗаписьАвансыИспользованые.Организация		= ПараметрыОперации.Организация;
		ЗаписьАвансыИспользованые.Район  			= ПараметрыОперации.Район;
		ЗаписьАвансыИспользованые.ДокументОплаты	= Авансы[Сч].ДокументОплаты;
		ЗаписьАвансыИспользованые.IDСтрокиОплаты 	= Авансы[Сч].IDСтрокиОплаты; 
		ЗаписьАвансыИспользованые.ПлатежныйДокумент = ДанныеДокумента.Регистратор;
		
		
		
		Если ОсталосьСписать = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Смещение 											= 0;
	
	Для Индекс = 0 По УдаляемыеСтроки.ВГраница() Цикл
		Авансы.Удалить(УдаляемыеСтроки[Индекс - Смещение]);
		Смещение 										= Смещение + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура УвеличитьАванс(ПараметрыОперации,ДанныеДокумента,Сумма,IDСтрокиОплаты,ПериодВзаиморасчетов)
	
	ТаблицаАвансы 									= ДанныеДокумента.НаборТаблиц.бестАвансыЭЭ;
	мАвансы 										= ПараметрыОперации.Авансы;
	Если ТипЗнч(ДанныеДокумента.Регистратор) = Тип("ДокументСсылка.бестПлатежныйДокумент") 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Регистратор, "ВидОперации") = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Корректировка Тогда
		ДанныеКорректировки = ПараметрыОперации.ДанныеКорректировки;
		СуммаОплаты = ДанныеКорректировки.СуммаОплаты;
		Оплаты = ДанныеКорректировки.Оплаты;
		Индекс = 0;
		КоличествоОплат = Оплаты.Количество();
		Пока Сумма > 0 И Не Индекс = КоличествоОплат Цикл
			Оплата 											= Оплаты[Индекс];
			ЗаписьАвансы  									= ТаблицаАвансы.добавить();
			ЗаписьАвансы.ВидДвижения 						= ВидДвиженияНакопления.Приход;
			ЗаписьАвансы.Активность  						= Истина;
			ЗаписьАвансы.Период  							= ДанныеДокумента.Период;	
			ЗаписьАвансы.Договор  							= ДанныеДокумента.Договор;
			ЗаписьАвансы.ДокументОплаты						= Оплата.ДокументОплаты;
			ЗаписьАвансы.Сумма 								= Мин(Сумма, Оплата.Сумма);
			ЗаписьАвансы.СуммаНДС 							= ЗаписьАвансы.Сумма - ЗаписьАвансы.Сумма / (1 + ПараметрыОперации.СтавкаНДС / 100);
			ЗаписьАвансы.Район  							= ПараметрыОперации.Район;
			ЗаписьАвансы.ПериодНачисления					= ПараметрыОперации.ПериодНачисления;
			ЗаписьАвансы.Организация						= ПараметрыОперации.Организация;
			ЗаписьАвансы.IDСтрокиОплаты						= Оплата.IDСтрокиОплаты;
			ЗаписьАвансы.ПериодРасчета						= ПараметрыОперации.ПериодНачисления;	
			
			ОписаниеАванса 									= ОписаниеАванса();
			ОписаниеАванса.СуммаАванса 						= ЗаписьАвансы.Сумма;
			ОписаниеАванса.ДокументОплаты 					= Оплата.ДокументОплаты;
			ОписаниеАванса.IDСтрокиОплаты					= Оплата.IDСтрокиОплаты;
			ПараметрыОперации.СуммаАванса					= ПараметрыОперации.СуммаАванса + ЗаписьАвансы.Сумма;
			мАвансы.Добавить(ОписаниеАванса);
			
			Индекс											= Индекс + 1;
			Сумма											= Сумма - ЗаписьАвансы.Сумма;
		КонецЦикла;
	Иначе
		ЗаписьАвансы  									= ТаблицаАвансы.добавить();
		ЗаписьАвансы.ВидДвижения 						= ВидДвиженияНакопления.Приход;
		ЗаписьАвансы.Активность  						= Истина;
		ЗаписьАвансы.Период  							= ДанныеДокумента.Период;	
		ЗаписьАвансы.Договор  							= ДанныеДокумента.Договор;
		ЗаписьАвансы.ДокументОплаты						= ДанныеДокумента.Регистратор;
		ЗаписьАвансы.Сумма 								= Сумма;
		ЗаписьАвансы.СуммаНДС 							= Сумма - Сумма / (1 + ПараметрыОперации.СтавкаНДС/100);
		ЗаписьАвансы.Район  							= ПараметрыОперации.Район;
		ЗаписьАвансы.ПериодНачисления					= ПериодВзаиморасчетов;
		ЗаписьАвансы.Организация						= ПараметрыОперации.Организация;
		ЗаписьАвансы.IDСтрокиОплаты						= IDСтрокиОплаты;
		ЗаписьАвансы.ПериодРасчета						= ПараметрыОперации.ПериодНачисления;
		
		Если ПериодВзаиморасчетов <= ПараметрыОперации.ПериодНачисления Тогда
			ОписаниеАванса 									= ОписаниеАванса();
			ОписаниеАванса.СуммаАванса 						= Сумма;
			ОписаниеАванса.ДокументОплаты 					= ДанныеДокумента.Регистратор;
			ОписаниеАванса.IDСтрокиОплаты					= IDСтрокиОплаты;
			ОписаниеАванса.ПериодНачисления					= ПериодВзаиморасчетов; 
			
			ПараметрыОперации.СуммаАванса					= ПараметрыОперации.СуммаАванса + Сумма;
			мАвансы.Добавить(ОписаниеАванса);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УменьшитьАванс(ПараметрыОперации, ДанныеДокумента,ДанныеНачислений)	
	
	яДанныеНачислений	 									= ДанныеНачислений.Расшифровка;
	ОсталосьСписать											= ПараметрыОперации.СуммаАванса;
	ПериодыЗадолженности 									= яДанныеНачислений.Скопировать();
	Для Каждого ТекСтрока Из ПериодыЗадолженности Цикл
		ТекСтрока.СуммаНачислений = Макс(0, ТекСтрока.СуммаНачислений);	
	КонецЦикла;
	ПериодыЗадолженности.Свернуть("ПериодРасчета","СуммаНачислений");
	ПериодыЗадолженности.Сортировать("ПериодРасчета");	
	
	ТаблицаАвансыИспользованные								= ДанныеДокумента.НаборТаблиц.бестАвансыИспользованныеЭЭ;
	
	Для Сч = 0 По ПериодыЗадолженности.Количество() - 1 Цикл
		
		СтрокиВПериоде 										= яДанныеНачислений.НайтиСтроки(Новый Структура("ПериодРасчета", ПериодыЗадолженности[Сч].ПериодРасчета));
		
		Для ИндексСтроки = 0 По СтрокиВПериоде.ВГраница() Цикл			
			ОбщаяСуммаЗаПериод								= ПериодыЗадолженности[Сч].СуммаНачислений;
			
			Если ОбщаяСуммаЗаПериод = 0 Тогда 
				Продолжить;
			КонецЕсли;			
			
			Если СтрокиВПериоде[ИндексСтроки].СуммаНачислений < 0 ИЛИ СтрокиВПериоде[ИндексСтроки].ТипЗадолженности = Перечисления.бестВидыРасчета.Авансовый Тогда 
				Продолжить;
			КонецЕсли;
			
			Списываем 										= Мин(ОсталосьСписать, СтрокиВПериоде[ИндексСтроки].СуммаНачислений);
			ОсталосьСписать 								= ОсталосьСписать - Списываем;
			СтрокиВПериоде[ИндексСтроки].СуммаНачислений	= СтрокиВПериоде[ИндексСтроки].СуммаНачислений - Списываем;
			СтрокиВПериоде[ИндексСтроки].СуммаНачисленийНДС	= СтрокиВПериоде[ИндексСтроки].СуммаНачислений * ПараметрыОперации.СтавкаНДС / (100 + ПараметрыОперации.СтавкаНДС);
			ПараметрыИспользованияАванса  					= Новый Структура("ТипЗадолженности,ПериодРасчета,ПериодНачисления", СтрокиВПериоде[ИндексСтроки].ТипЗадолженности,СтрокиВПериоде[ИндексСтроки].ПериодРасчета,СтрокиВПериоде[ИндексСтроки].ПериодНачисления);
			ДобавитьРасходАванса(ПараметрыОперации, ДанныеДокумента, Списываем,ПараметрыИспользованияАванса);
		КонецЦикла;
	КонецЦикла;
	
	ПараметрыОперации.СуммаАванса 							= ОсталосьСписать;
	
КонецПроцедуры

Функция АвансНаГраницу(Договор,ВыборкаАванс)
	
	Авансы  				= Новый Массив;
	СуммаАванса 			= 0;
	Если Договор  = ВыборкаАванс.Договор тогда		
		Пока Договор = ВыборкаАванс.Договор цикл 			
			ОписаниеАванса 	= ОписаниеАванса();
			ЗаполнитьЗначенияСвойств(ОписаниеАванса, ВыборкаАванс);
			Авансы.Добавить(ОписаниеАванса);
			СуммаАванса 	= СуммаАванса + ВыборкаАванс.СуммаАванса;
			Если не ВыборкаАванс.следующий() тогда
				Прервать;
			КонецЕсли;  				
		КонецЦикла;				  
	КонецЕсли; 			
	
	Возврат Новый Структура("Авансы, СуммаАванса", Авансы, СуммаАванса);
	
КонецФункции

Функция КорректировкаОплаченныхНачислений(Договор, ВыборкаКорректировка)
	
	Оплаты  				= Новый Массив;
	СуммаОплаты 			= 0;
	Если Договор  = ВыборкаКорректировка.Договор тогда		
		Пока Договор = ВыборкаКорректировка.Договор цикл 			
			ОписаниеОплаты 	= ОписаниеОплаты();
			ЗаполнитьЗначенияСвойств(ОписаниеОплаты, ВыборкаКорректировка);
			Оплаты.Добавить(ОписаниеОплаты);
			СуммаОплаты 	= СуммаОплаты + ВыборкаКорректировка.Сумма;
			Если не ВыборкаКорректировка.следующий() тогда
				Прервать;
			КонецЕсли;  				
		КонецЦикла;				  
	КонецЕсли; 			
	
	Возврат Новый Структура("Оплаты, СуммаОплаты", Оплаты, СуммаОплаты);
	
КонецФункции

Функция ОписаниеАванса()
	Возврат Новый Структура("IDСтрокиОплаты,ДокументОплаты,ПериодНачисления, СуммаАванса");	
КонецФункции

Функция ОписаниеОплаты()
	Возврат Новый Структура("IDСтрокиОплаты,ДокументОплаты, Сумма");	
КонецФункции

Функция РезультатКорректировкаОплаченныхНачислений(МВТ)
	Текст 	=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.Договор КАК Договор,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	бестВзаиморасчетыПоМесяцамЭЭ.Регистратор КАК ДокументОплаты,
	|	бестВзаиморасчетыПоМесяцамЭЭ.IDСтрокиОплаты КАК IDСтрокиОплаты,
	|	бестВзаиморасчетыПоМесяцамЭЭ.Сумма КАК Сумма,
	|	бестВзаиморасчетыПоМесяцамЭЭ.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокументКорректировка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ КАК бестВзаиморасчетыПоМесяцамЭЭ
	|				ПО бестПлатежныйДокумент.Ссылка = бестВзаиморасчетыПоМесяцамЭЭ.ПлатежныйДокумент
	|					И (бестВзаиморасчетыПоМесяцамЭЭ.Регистратор ССЫЛКА Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица)
	|			ПО бестПлатежныйДокументКорректировка.ДокументИсточник = бестПлатежныйДокумент.Ссылка
	|		ПО ДокументыДляПроведения.ДокРегистратор = бестПлатежныйДокументКорректировка.Ссылка
	|			И (бестПлатежныйДокументКорректировка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПлатежныйДокумент_Корректировка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.Район,
	|	ДокументыДляПроведения.Договор,
	|	ДокументыДляПроведения.ДокРегистратор,
	|	бестАвансыЭЭ.ДокументОплаты,
	|	бестАвансыЭЭ.IDСтрокиОплаты,
	|	бестАвансыЭЭ.Сумма,
	|	бестАвансыЭЭ.СуммаНДС
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокументКорректировка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестАвансыЭЭ КАК бестАвансыЭЭ
	|				ПО бестПлатежныйДокумент.Ссылка = бестАвансыЭЭ.Регистратор
	|			ПО бестПлатежныйДокументКорректировка.ДокументИсточник = бестПлатежныйДокумент.Ссылка
	|		ПО ДокументыДляПроведения.ДокРегистратор = бестПлатежныйДокументКорректировка.Ссылка
	|			И (бестПлатежныйДокументКорректировка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПлатежныйДокумент_Корректировка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Район,
	|	Договор,
	|	ДокРегистратор,
	|	Сумма УБЫВ";
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#Область РаботаСЗадолженностью

Процедура УвеличитьЗадолженность(ПараметрыОперации, ДанныеДокумента, ДанныеНачислений)
	
	Если ПараметрыОперации.СуммаАванса > 0 тогда
		УменьшитьАванс(ПараметрыОперации, ДанныеДокумента,ДанныеНачислений);
	КонецЕсли;
	
	Район  												= ПараметрыОперации.Район;
	Договор  											= ДанныеДокумента.Договор;	
	ДанныеЗадолженности 								= ПараметрыОперации.ДанныеЗадолженности;
	ТаблицаВзаиморасчетыПоМесяцам 						= ДанныеДокумента.НаборТаблиц.бестВзаиморасчетыПоМесяцамЭЭ;
	//ТаблицаВзаиморасчетыПоАвансовымСчетам 				= ДанныеДокумента.НаборТаблиц.бестВзаиморасчетыПоАвансовымСчетам;
	
	ТаблицаЗадолженности  								= ДанныеЗадолженности.Расшифровка;
	РасшифровкаНачислений 								= ДанныеНачислений.Расшифровка;
	
	РасшифровкаНачислений.Сортировать("СуммаНачислений,ПериодРасчета");
	// сначала отрицательные строки записываем в аванс
	для Каждого СтрокаНачисления из РасшифровкаНачислений цикл
		
		Если СтрокаНачисления.СуммаНачислений = 0 тогда
			Продолжить;
		ИначеЕсли  СтрокаНачисления.СуммаНачислений < 0 тогда
			//ОтрицательнаяСуммаНачислений(ПараметрыОперации,ДанныеДокумента,-СтрокаНачисления.СуммаНачислений,СтрокаНачисления.Услуга,СтрокаНачисления.Поставщик,СтрокаНачисления.ПериодРасчета);
			//СтрокаНачисления.СуммаНачислений = 0;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если отрицательные строки дали аванс, то закрываем им положительнве строки из этого же документа
	Если ПараметрыОперации.СуммаАванса > 0 тогда
		УменьшитьАванс(ПараметрыОперации, ДанныеДокумента,ДанныеНачислений);
	КонецЕсли;
	
	РасшифровкаНачислений 								= ДанныеНачислений.Расшифровка;
	БылиИзменения 										= Ложь;
	
	для Каждого СтрокаНачисления из РасшифровкаНачислений цикл
		
		Если СтрокаНачисления.СуммаНачислений = 0 тогда
			Продолжить;
		ИначеЕсли  СтрокаНачисления.СуммаНачислений < 0 тогда
			//ОтрицательнаяСуммаНачислений(ПараметрыОперации,ДанныеДокумента,-СтрокаНачисления.СуммаНачислений,СтрокаНачисления.Услуга,СтрокаНачисления.Поставщик,СтрокаНачисления.ПериодРасчета);
			Продолжить;
		КонецЕсли;
		
		БылиИзменения 									= Истина;
		
		СтрокаЗадолженности  							= ТаблицаЗадолженности.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗадолженности, СтрокаНачисления);
		СтрокаЗадолженности.СуммаЗадолженности			= СтрокаНачисления.СуммаНачислений;
		
		//СтрокаВзаиморасчеты 							= ?(СтрокаНачисления.ТипЗадолженности = Перечисления.бестВидыРасчета.Фактический, ТаблицаВзаиморасчетыПоМесяцам.Добавить(), ТаблицаВзаиморасчетыПоАвансовымСчетам.Добавить());
		СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчетыПоМесяцам.Добавить();
		СтрокаВзаиморасчеты.Организация					= ПараметрыОперации.Организация;	
		СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
		СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Приход;
		СтрокаВзаиморасчеты.Активность					= Истина;
		СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;
		СтрокаВзаиморасчеты.Договор 					= ДанныеДокумента.Договор; 		
		СтрокаВзаиморасчеты.Сумма 						= СтрокаНачисления.СуммаНачислений;
		СтрокаВзаиморасчеты.СуммаНДС 					= СтрокаНачисления.СуммаНачисленийНДС;
		СтрокаВзаиморасчеты.ПлатежныйДокумент 			= ?(ТипЗнч(СтрокаНачисления.ПлатежныйДокумент) = Тип("ДокументСсылка.бестПлатежныйДокумент"),СтрокаНачисления.ПлатежныйДокумент,Документы.бестПлатежныйДокумент.ПустаяСсылка());
		СтрокаВзаиморасчеты.ПериодРасчета				= СтрокаНачисления.ПериодРасчета;
		СтрокаВзаиморасчеты.ПериодНачисления			= СтрокаНачисления.ПериодНачисления;
	КонецЦикла; 
	
	Если БылиИзменения Тогда
		ТаблицаЗадолженности.Свернуть("ПериодРасчета,ПериодНачисления,ПлатежныйДокумент,ТипЗадолженности","СуммаЗадолженности");
		ТаблицаЗадолженности.Сортировать("ПериодРасчета");
		ДанныеЗадолженности.СуммаЗадолженности 			= ТаблицаЗадолженности.Итог("СуммаЗадолженности");
	КонецЕсли;
	
КонецПроцедуры

Процедура СписатьЗадолженность(ПараметрыОперации,ДанныеДокумента,Сумма, IDСтрокиОплаты, ПлатежныйДокумент = Неопределено, СуммаОплатыРаспределенная = 0)
	
	Если Сумма <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПлатежныйДокумент = Неопределено И ЗначениеЗаполнено(ПлатежныйДокумент) Тогда
		яПлатежныйДокумент 							= ПлатежныйДокумент;
	КонецЕсли;
	
	Если яПлатежныйДокумент <> Неопределено Тогда
		СписатьЗадолженностьПоПД(ПараметрыОперации,ДанныеДокумента,Сумма,IDСтрокиОплаты,яПлатежныйДокумент, СуммаОплатыРаспределенная);
	Иначе
		СписатьСамуюРаннююЗадолженность(ПараметрыОперации, ДанныеДокумента, Сумма, IDСтрокиОплаты);
	КонецЕсли;
	
КонецПроцедуры 

Процедура СписатьСамуюРаннююЗадолженность(ПараметрыОперации,ДанныеДокумента,НадоСписать,IDСтрокиОплаты)
	
	ТаблицаВзаиморасчетыПоМесяцам 						= ДанныеДокумента.НаборТаблиц.бестВзаиморасчетыПоМесяцамЭЭ;
	
	ДанныеЗадолженности 								= ПараметрыОперации.ДанныеЗадолженности;
	Расшифровка 										= ДанныеЗадолженности.Расшифровка;
	
	МассивУдаляемых										= Новый Массив;
	
	для Каждого СтрокаЗадолженности из Расшифровка цикл
		Если СтрокаЗадолженности.ТипЗадолженности = Перечисления.бестВидыРасчета.Фактический Тогда
			Списываем 										= Мин(СтрокаЗадолженности.СуммаЗадолженности,НадоСписать);
			
			СтрокаЗадолженности.СуммаЗадолженности 			= СтрокаЗадолженности.СуммаЗадолженности - Списываем;
			
			Если СтрокаЗадолженности.СуммаЗадолженности = 0 тогда
				МассивУдаляемых.Добавить(СтрокаЗадолженности);
			КонецЕсли;
			
			СтрокаВзаиморасчеты 							= ТаблицаВзаиморасчетыПоМесяцам.Добавить();
			СтрокаВзаиморасчеты.Организация		 			= ПараметрыОперации.Организация;
			СтрокаВзаиморасчеты.Район 						= ПараметрыОперации.Район;
			СтрокаВзаиморасчеты.ПериодНачисления 			= СтрокаЗадолженности.ПериодНачисления;
			СтрокаВзаиморасчеты.ПериодРасчета 				= СтрокаЗадолженности.ПериодРасчета;
			СтрокаВзаиморасчеты.ВидДвижения					= ВидДвиженияНакопления.Расход;
			СтрокаВзаиморасчеты.Активность					= Истина;
			СтрокаВзаиморасчеты.Период 						= ДанныеДокумента.Период;		
			СтрокаВзаиморасчеты.Договор 					= ДанныеДокумента.Договор;
			СтрокаВзаиморасчеты.Сумма 						= Списываем;
			СтрокаВзаиморасчеты.СуммаНДС 					= Списываем - Списываем / (1 + ПараметрыОперации.СтавкаНДС/100);
			СтрокаВзаиморасчеты.ПлатежныйДокумент			= СтрокаЗадолженности.ПлатежныйДокумент;
			СтрокаВзаиморасчеты.IDСтрокиОплаты      		= IDСтрокиОплаты;
			
			
			НадоСписать										= НадоСписать - Списываем;
			Если НадоСписать = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	для Каждого УдаляемаяСтрока из МассивУдаляемых цикл
		Расшифровка.удалить(УдаляемаяСтрока);
	КонецЦикла;
		
КонецПроцедуры

Процедура СписатьЗадолженностьПоПД(ПараметрыОперации,ДанныеДокумента,НадоСписать,IDСтрокиОплаты, ПлатежныйДокумент, СуммаОплатыРаспределенная)
	перем яПлатежныйДокумент;
	ДанныеЗадолженности 						= ПараметрыОперации.ДанныеЗадолженности.Расшифровка;		
	
	ТаблицаВзаиморасчетыПоМесяцам 				= ДанныеДокумента.НаборТаблиц.бестВзаиморасчетыПоМесяцамЭЭ;
	ТаблицаВзаиморасчетыПоАвансовымСчетам 		= ДанныеДокумента.НаборТаблиц.бестВзаиморасчетыПоАвансовымСчетам;
	ТаблицаВзаиморасчетыПоПени 					= ДанныеДокумента.НаборТаблиц.бестВзаиморасчетыПоПениЭЭ;
	ЭтоОплата 									= Истина;
	
	СтруктураПоиска  							= Новый Структура("ПлатежныйДокумент");
	СтруктураПоиска.ПлатежныйДокумент 			= ПлатежныйДокумент;
	
	СтрокиЗадолженности 						= ДанныеЗадолженности.НайтиСтроки(СтруктураПоиска);
	
	МассивУдаляемых 							= Новый Массив;
	
	НадоСписатьВсего 							= НадоСписать;
	для Каждого СтрокаЗадолженности из СтрокиЗадолженности цикл
		Если СуммаОплатыРаспределенная <> 0 Тогда
			Списываем 								= Мин(СуммаОплатыРаспределенная,СтрокаЗадолженности.СуммаЗадолженности);
		Иначе
			Списываем 								= Мин(НадоСписатьВсего,СтрокаЗадолженности.СуммаЗадолженности);
		КонецЕсли;
		
		// Уменьшаем задолженность по месяцам.
		Если СтрокаЗадолженности.ТипЗадолженности = Перечисления.бестВидыРасчета.Фактический Тогда
			СтрокаВзаиморасчеты 					= ТаблицаВзаиморасчетыПоМесяцам.Добавить();
		ИначеЕсли СтрокаЗадолженности.ТипЗадолженности = Перечисления.бестВидыРасчета.Авансовый Тогда
			СтрокаВзаиморасчеты 					= ТаблицаВзаиморасчетыПоАвансовымСчетам.Добавить();
		ИначеЕсли СтрокаЗадолженности.ТипЗадолженности = Перечисления.бестВидыРасчета.Пеня Тогда
			СтрокаВзаиморасчеты 					= ТаблицаВзаиморасчетыПоПени.Добавить();
		КонецЕсли;
				
		СтрокаВзаиморасчеты.Активность	 		= Истина;
		СтрокаВзаиморасчеты.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		СтрокаВзаиморасчеты.Организация 		= ПараметрыОперации.Организация;
		СтрокаВзаиморасчеты.Район		 		= ПараметрыОперации.Район;
		СтрокаВзаиморасчеты.Договор				= ДанныеДокумента.Договор;
		СтрокаВзаиморасчеты.Период	 			= ДанныеДокумента.период;
		СтрокаВзаиморасчеты.Сумма				= Списываем;
		СтрокаВзаиморасчеты.ПлатежныйДокумент   = СтрокаЗадолженности.ПлатежныйДокумент;
		СтрокаВзаиморасчеты.ПериодНачисления    = СтрокаЗадолженности.ПериодНачисления;
		СтрокаВзаиморасчеты.ПериодРасчета    	= СтрокаЗадолженности.ПериодРасчета;
		СтрокаВзаиморасчеты.IDСтрокиОплаты      = IDСтрокиОплаты;
		
		Если СтрокаЗадолженности.ТипЗадолженности <> Перечисления.бестВидыРасчета.Пеня Тогда
			СтрокаВзаиморасчеты.СуммаНДС 			= Списываем - Списываем / (1 + ПараметрыОперации.СтавкаНДС / 100);
		КонецЕсли;
		
		Если СтрокаЗадолженности.ТипЗадолженности = Перечисления.бестВидыРасчета.Авансовый Тогда
			УвеличитьАванс(ПараметрыОперации,ДанныеДокумента,Списываем,IDСтрокиОплаты, СтрокаЗадолженности.ПериодНачисления);
			СтрокаЗадолженности.СуммаЗадолженности = 0;
			//НадоСписать = 0; 
			НадоСписать 							= НадоСписать - Списываем;
		Иначе
			СтрокаЗадолженности.СуммаЗадолженности 	= СтрокаЗадолженности.СуммаЗадолженности - Списываем; 		
			НадоСписать 							= НадоСписать - Списываем;
		КонецЕсли;		
		
		Если СтрокаЗадолженности.СуммаЗадолженности = 0 тогда
			МассивУдаляемых.Добавить(СтрокаЗадолженности);
		КонецЕсли;  		
		
		Если НадоСписать = 0 Тогда
			Прервать;
		КонецЕсли; 		
		
	КонецЦикла;
	
	для Каждого УдаляемаяСтрока из МассивУдаляемых цикл
		ДанныеЗадолженности.Удалить(УдаляемаяСтрока);				
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеЗадолженности()
	Возврат Новый ФиксированнаяСтруктура("СуммаЗадолженности,Расшифровка");	
КонецФункции

Функция ЗадолженностьНаГраницу(Договор,ВыборкаЗадолженность)
	перем ТекПериодыЗадолженность,ТекУслуга,ЗадолженностьУслуга;
	
	РасшифровкаЗадолженности						= ТаблицаРасшифровкиЗадолженности();
	
	ОписаниеЗадолженности  							= ОписаниеЗадолженности();
	
	ЗадолженностьВсего  							= 0;
	
	Если Договор  = ВыборкаЗадолженность.Договор тогда		
		Пока Договор = ВыборкаЗадолженность.Договор цикл 			
			Если ЗначениеЗаполнено(ВыборкаЗадолженность.ПериодРасчета) Тогда 				
				СтрокаЗадолженности  					= РасшифровкаЗадолженности.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗадолженности, ВыборкаЗадолженность);
				СтрокаЗадолженности.СуммаЗадолженности	= ВыборкаЗадолженность.ЗадолженностьНачалоПериода;
				ЗадолженностьВсего 						= ЗадолженностьВсего + ВыборкаЗадолженность.ЗадолженностьНачалоПериода;
			КонецЕсли;
			Если не ВыборкаЗадолженность.следующий() тогда
				Прервать;
			КонецЕсли;  				
		КонецЦикла;				  
	КонецЕсли; 	
	
	Результат  										= Новый Структура(ОписаниеЗадолженности);
	Результат.СуммаЗадолженности 					= ЗадолженностьВсего;
	Результат.Расшифровка 							= РасшифровкаЗадолженности;
	
	Возврат Результат;
КонецФункции

Функция ТаблицаРасшифровкиЗадолженности()
	
	ПериодыЗадолженности  							= Новый ТаблицаЗначений;
	Колонки  										= ПериодыЗадолженности.Колонки;	
	Колонки.Добавить("ПериодРасчета",				Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Колонки.Добавить("ПериодНачисления",			Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Колонки.Добавить("СуммаЗадолженности",			Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	Колонки.Добавить("ПлатежныйДокумент",			Новый ОписаниеТипов("ДокументСсылка.бестПлатежныйДокумент"));
	Колонки.Добавить("ТипЗадолженности",			Новый ОписаниеТипов("ПеречислениеСсылка.бестВидыРасчета"));
	
	Возврат ПериодыЗадолженности;
КонецФункции 

Функция РезультатЗадолженностьФактическая(Организация, ПериодНачисления,Район,Договор,МВТ,НачалоПериодаРасчета,КонецПериодаРасчета)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);
	
	Текст 							= ТекстЗадолженностьНаГраницу();
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Текст = СтрЗаменить(Текст, "Договор = &Договор", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Договор",				Договор);
	КонецЕсли;
	
	Запрос.Текст 					= Текст;
	Возврат Запрос.Выполнить();	
КонецФункции

Функция РезультатДанныеНачислений(МВТ)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.Текст 		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ПериодРасчета КАК ПериодРасчета,
	|	ВложенныйЗапрос.СуммаНачислений КАК СуммаНачислений,
	|	ВложенныйЗапрос.ТипЗадолженности КАК ТипЗадолженности,
	|	ВложенныйЗапрос.СуммаНачисленийНДС КАК СуммаНачисленийНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.Договор КАК Договор,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодРасчета,
	|		бестПлатежныйДокумент.ИтоговаяСумма - ЕСТЬNULL(ПДДокументИсточник.ИтоговаяСумма, 0) КАК СуммаНачислений,
	|		бестПлатежныйДокумент.ТипЗадолженности КАК ТипЗадолженности,
	|		бестПлатежныйДокумент.ИтоговаяСуммаНДС - ЕСТЬNULL(ПДДокументИсточник.ИтоговаяСуммаНДС, 0) КАК СуммаНачисленийНДС
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК ПДДокументИсточник
	|				ПО бестПлатежныйДокумент.ДокументИсточник = ПДДокументИсточник.Ссылка
	|			ПО ДокументыДляПроведения.ДокРегистратор = бестПлатежныйДокумент.Ссылка
	|	ГДЕ
	|		НЕ ДокументыДляПроведения.ЭтоОплата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыДляПроведения.ПериодНачисления,
	|		ДокументыДляПроведения.Район,
	|		ДокументыДляПроведения.Договор,
	|		ДокументыДляПроведения.ДокРегистратор,
	|		ДокументыДляПроведения.ПериодНачисления,
	|		СУММА(бестКорректировкаЗадолженностиВозвратОплаты.СуммаВозврата),
	|		ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический),
	|		СУММА(бестКорректировкаЗадолженностиВозвратОплаты.СуммаВозвратаНДС)
	|	ИЗ
	|		Документ.бестКорректировкаЗадолженности.ВозвратОплаты КАК бестКорректировкаЗадолженностиВозвратОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляПроведения КАК ДокументыДляПроведения
	|				ПО (ДокументыДляПроведения.ДокРегистратор = бестКорректировкаЗадолженности.Ссылка)
	|			ПО бестКорректировкаЗадолженностиВозвратОплаты.Ссылка = бестКорректировкаЗадолженности.Ссылка
	|	ГДЕ
	|		бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ВозвратПлатежа)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументыДляПроведения.ПериодНачисления,
	|		ДокументыДляПроведения.Договор,
	|		ДокументыДляПроведения.Район,
	|		ДокументыДляПроведения.ДокРегистратор,
	|		ДокументыДляПроведения.ПериодНачисления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыДляПроведения.ПериодНачисления,
	|		ДокументыДляПроведения.Район,
	|		ДокументыДляПроведения.Договор,
	|		ДокументыДляПроведения.ДокРегистратор,
	|		ДокументыДляПроведения.ПериодНачисления,
	|		СУММА(бестКорректировкаЗадолженностиПереносОплаты.Сумма),
	|		ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический),
	|		СУММА(бестКорректировкаЗадолженностиПереносОплаты.СуммаНДС)
	|	ИЗ
	|		Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляПроведения КАК ДокументыДляПроведения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
	|				ПО ДокументыДляПроведения.ДокРегистратор = бестКорректировкаЗадолженностиПереносОплаты.Ссылка
	|			ПО (ДокументыДляПроведения.ДокРегистратор = бестКорректировкаЗадолженности.Ссылка)
	|	ГДЕ
	|		бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДокументыДляПроведения.ПериодНачисления,
	|		ДокументыДляПроведения.Договор,
	|		ДокументыДляПроведения.Район,
	|		ДокументыДляПроведения.ДокРегистратор,
	|		ДокументыДляПроведения.ПериодНачисления) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.СуммаНачислений <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Район,
	|	Договор,
	|	ТипЗадолженности,
	|	ДокРегистратор";	
	
	Возврат Запрос.Выполнить(); 	
КонецФункции

Функция ДанныеНачислений(Договор,ВыборкаДанныеНачислений)
	перем ТекРасшифровкаНачислений;	
	
	РасшифровкаНачислений  									= Новый ТаблицаЗначений;
	РасшифровкаНачислений.Колонки.Добавить("ПериодРасчета",				Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РасшифровкаНачислений.Колонки.Добавить("ПериодНачисления",			Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РасшифровкаНачислений.Колонки.Добавить("СуммаНачислений",			Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	РасшифровкаНачислений.Колонки.Добавить("СуммаНачисленийНДС",		Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	СписокТипов = Новый Массив;
	СписокТипов.Добавить("ДокументСсылка.бестПлатежныйДокумент");
	СписокТипов.Добавить("ДокументСсылка.бестКорректировкаЗадолженности");
	РасшифровкаНачислений.Колонки.Добавить("ПлатежныйДокумент",			Новый ОписаниеТипов(СписокТипов));
	РасшифровкаНачислений.Колонки.Добавить("ТипЗадолженности",			Новый ОписаниеТипов("ПеречислениеСсылка.бестВидыРасчета"));
	
	
	ОписаниеНачислений  									= Новый ФиксированнаяСтруктура("СуммаНачислений,Расшифровка");
	СуммаНачислений 										= 0;
	ТекДокументНачисления 									= Неопределено;
	
	Результат  												= Новый Соответствие;
	
	Если Договор  = ВыборкаДанныеНачислений.Договор тогда		
		Пока Договор = ВыборкаДанныеНачислений.Договор цикл 			
			
			Если НЕ ТекДокументНачисления = ВыборкаДанныеНачислений.ДокРегистратор Тогда
				Если НЕ ТекДокументНачисления = Неопределено Тогда
					текОписаниеНачислений 					= Новый Структура(ОписаниеНачислений);
					текОписаниеНачислений.СуммаНачислений 	= СуммаНачислений;
					текОписаниеНачислений.Расшифровка 		= ТекРасшифровкаНачислений;
					Результат.Вставить(ТекДокументНачисления, текОписаниеНачислений);
				КонецЕсли;				
				ТекРасшифровкаНачислений 					= РасшифровкаНачислений.Скопировать();
			КонецЕсли;
			
			СтрокаНачисления	  							= ТекРасшифровкаНачислений.Добавить();
			СтрокаНачисления.ПериодРасчета 					= ВыборкаДанныеНачислений.ПериодРасчета;
			СтрокаНачисления.ПериодНачисления 				= ВыборкаДанныеНачислений.ПериодНачисления;
			СтрокаНачисления.СуммаНачислений				= ВыборкаДанныеНачислений.СуммаНачислений;
			СтрокаНачисления.СуммаНачисленийНДС				= ВыборкаДанныеНачислений.СуммаНачисленийНДС;
			СтрокаНачисления.ПлатежныйДокумент				= ВыборкаДанныеНачислений.ДокРегистратор;
			СтрокаНачисления.ТипЗадолженности				= ВыборкаДанныеНачислений.ТипЗадолженности;
			СуммаНачислений 								= СуммаНачислений + ВыборкаДанныеНачислений.СуммаНачислений;
			ТекДокументНачисления 							= ВыборкаДанныеНачислений.ДокРегистратор;
			
			Если не ВыборкаДанныеНачислений.следующий() тогда
				Прервать;
			КонецЕсли;  				
		КонецЦикла;				  
	КонецЕсли; 	
	
	Если НЕ ТекДокументНачисления = Неопределено Тогда
		текОписаниеНачислений 								= Новый Структура(ОписаниеНачислений);
		текОписаниеНачислений.СуммаНачислений 				= СуммаНачислений;
		текОписаниеНачислений.Расшифровка 					= ТекРасшифровкаНачислений;
		Результат.Вставить(ТекДокументНачисления, текОписаниеНачислений);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

#КонецОбласти

#Область Оплата

Функция РезультатФактическойПереплаты(Организация, ПериодНачисления,район,Договор,МВТ,НачалоПериодаРасчета,КонецПериодаРасчета)
	
	Запрос  						= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ПериодНачисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецПериодаРасчета",	КонецПериодаРасчета);
	Текст 							= ТекстФактическаяПереплатаНаГраницу();
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Текст = СтрЗаменить(Текст, "Договор = &Договор", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Договор",				Договор);
	КонецЕсли;	
	Запрос.Текст 					= Текст;
	Возврат Запрос.Выполнить();	
	
КонецФункции

Функция РезультатОплата(МВТ, НачалоПериодаРасчета)
	
	Текст 	=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.Договор КАК Договор,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.СуммаОплаты КАК Сумма,
	|	ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления, ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.пустаяссылка)) КАК ПлатежныйДокумент,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки КАК IDСтрокиОплаты,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ПериодНачисления КАК ПериодВзаиморасчетов,
	|	бестПлатежныйДокумент.ТипЗадолженности КАК ТипЗадолженности,
	|	бестПлатежныйДокумент.ВидОперации КАК ВидОперации,
	|	ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.СуммаОплаты, 0) КАК СуммаОплатыРаспределенная
	|ПОМЕСТИТЬ ВходящееПоручение
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.ДокументыНачисления КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|				ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.ДокументНачисления = бестПлатежныйДокумент.Ссылка
	|			ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.Ссылка
	|				И бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.IDСтроки
	|		ПО ДокументыДляПроведения.ДокРегистратор = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка
	|			И ДокументыДляПроведения.Договор = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящееПоручение.ПериодНачисления КАК ПериодНачисления,
	|	ВходящееПоручение.Район КАК Район,
	|	ВходящееПоручение.Договор КАК Договор,
	|	ВходящееПоручение.ДокРегистратор КАК ДокРегистратор,
	|	ВходящееПоручение.Сумма КАК Сумма,
	|	ВходящееПоручение.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ВходящееПоручение.IDСтрокиОплаты КАК IDСтрокиОплаты,
	|	ВходящееПоручение.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВходящееПоручение.ТипЗадолженности КАК ТипЗадолженности,
	|	ВходящееПоручение.СуммаОплатыРаспределенная КАК СуммаОплатыРаспределенная
	|ПОМЕСТИТЬ ПлатежноеПоручениеСчетаНаОстаток
	|ИЗ
	|	ВходящееПоручение КАК ВходящееПоручение
	|ГДЕ
	|	(ВходящееПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПлатежныйДокумент_Расчетный)
	|			ИЛИ ВходящееПоручение.ПлатежныйДокумент = ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.пустаяссылка)
	|			ИЛИ ВходящееПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПлатежныйДокумент_Пеня))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВходящееПоручение.ПериодНачисления,
	|	ВходящееПоручение.Район,
	|	ВходящееПоручение.Договор,
	|	ВходящееПоручение.ДокРегистратор,
	|	ВходящееПоручение.Сумма,
	|	бестПлатежныйДокумент.Ссылка,
	|	ВходящееПоручение.IDСтрокиОплаты,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.ТипЗадолженности,
	|	ВходящееПоручение.СуммаОплатыРаспределенная
	|ИЗ
	|	ВходящееПоручение КАК ВходящееПоручение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент.НеоплаченныеСчета КАК бестПлатежныйДокументНеоплаченныеСчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|			ПО бестПлатежныйДокументНеоплаченныеСчета.ПлатежныйДокумент = бестПлатежныйДокумент.Ссылка
	|		ПО ВходящееПоручение.ПлатежныйДокумент = бестПлатежныйДокументНеоплаченныеСчета.Ссылка
	|ГДЕ
	|	ВходящееПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПлатежныйДокумент_СчетНаОстаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.Договор КАК Договор,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	бестКорректировкаЗадолженностиПереносОплаты.Сумма КАК Сумма,
	|	ЕСТЬNULL(бестКорректировкаЗадолженностиДокументыНачисления.ДокументНачисления, ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.пустаяссылка)) КАК ПлатежныйДокумент,
	|	бестКорректировкаЗадолженностиПереносОплаты.IDСтрокиОплата КАК IDСтрокиОплаты,
	|	бестКорректировкаЗадолженностиДокументыНачисления.ПериодНачисления КАК ПериодВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический) КАК ТипЗадолженности,
	|	0 КАК СуммаОплатыРаспределенная
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности.ДокументыНачисления КАК бестКорректировкаЗадолженностиДокументыНачисления
	|			ПО бестКорректировкаЗадолженностиПереносОплаты.Ссылка = бестКорректировкаЗадолженностиДокументыНачисления.Ссылка
	|				И бестКорректировкаЗадолженностиПереносОплаты.IDСтрокиОплата = бестКорректировкаЗадолженностиДокументыНачисления.IDСтрокиОплата
	|		ПО ДокументыДляПроведения.ДокРегистратор = бестКорректировкаЗадолженностиПереносОплаты.Ссылка
	|			И ДокументыДляПроведения.Договор = бестКорректировкаЗадолженностиПереносОплаты.Договор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
	|		ПО ДокументыДляПроведения.ДокРегистратор = бестКорректировкаЗадолженности.Ссылка
	|ГДЕ
	|	бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежноеПоручениеСчетаНаОстаток.ПериодНачисления,
	|	ПлатежноеПоручениеСчетаНаОстаток.Район,
	|	ПлатежноеПоручениеСчетаНаОстаток.Договор,
	|	ПлатежноеПоручениеСчетаНаОстаток.ДокРегистратор,
	|	ПлатежноеПоручениеСчетаНаОстаток.Сумма,
	|	ПлатежноеПоручениеСчетаНаОстаток.ПлатежныйДокумент,
	|	ПлатежноеПоручениеСчетаНаОстаток.IDСтрокиОплаты,
	|	ПлатежноеПоручениеСчетаНаОстаток.ПериодВзаиморасчетов,
	|	ПлатежноеПоручениеСчетаНаОстаток.ТипЗадолженности,
	|	ПлатежноеПоручениеСчетаНаОстаток.СуммаОплатыРаспределенная
	|ИЗ
	|	ПлатежноеПоручениеСчетаНаОстаток КАК ПлатежноеПоручениеСчетаНаОстаток
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.Район,
	|	ДокументыДляПроведения.Договор,
	|	ДокументыДляПроведения.ДокРегистратор,
	|	ЕСТЬNULL(ПДДокументИсточник.ИтоговаяСумма, 0) - бестПлатежныйДокумент.ИтоговаяСумма,
	|	ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.пустаяссылка),
	|	"""",
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический),
	|	0
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК ПДДокументИсточник
	|			ПО бестПлатежныйДокумент.ДокументИсточник = ПДДокументИсточник.Ссылка
	|		ПО ДокументыДляПроведения.ДокРегистратор = бестПлатежныйДокумент.Ссылка
	|ГДЕ
	|	ДокументыДляПроведения.ЭтоОплата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Район,
	|	Договор,
	|	ДокРегистратор";
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", НачалоПериодаРасчета);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДанныеОплаты(Договор, ВыборкаОплата)
	перем ТекРасшифровкаОплаты;
	
	Результат  								= Новый Соответствие;
	
	РасшифровкаОплаты  						= Новый ТаблицаЗначений;
	РасшифровкаОплаты.Колонки.Добавить("ПериодВзаиморасчетов",	Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РасшифровкаОплаты.Колонки.Добавить("Сумма",					Новый ОписаниеТипов("Число"));
	РасшифровкаОплаты.Колонки.Добавить("IDСтрокиОплаты",		Новый ОписаниеТипов("Строка"));
	РасшифровкаОплаты.Колонки.Добавить("МассивПД",				Новый ОписаниеТипов("Массив"));
	
	ТекIDСтроки								= Неопределено;
	ТекДокументОплаты 						= Неопределено;
	ОписаниеОплаты  						=	 Новый ФиксированнаяСтруктура("Сумма,Расшифровка");
	Сумма 									= 0;
	Если Договор  = ВыборкаОплата.Договор тогда	
		Пока Договор = ВыборкаОплата.Договор цикл			
			Если НЕ ТекДокументОплаты = ВыборкаОплата.ДокРегистратор Тогда
				Если НЕ ТекДокументОплаты = Неопределено Тогда
					текОписание 			= Новый Структура(ОписаниеОплаты);
					текОписание.Сумма 		= Сумма;
					текОписание.Расшифровка = ТекРасшифровкаОплаты;
					Результат.Вставить(ТекДокументОплаты, текОписание);
				КонецЕсли;				
				ТекРасшифровкаОплаты 		= РасшифровкаОплаты.Скопировать();
			КонецЕсли;
			
			
			Если ТекIDСтроки <> ВыборкаОплата.IDСтрокиОплаты ИЛИ НЕ ЗначениеЗаполнено(ВыборкаОплата.ПлатежныйДокумент) Тогда
				СтрокаНачисления	  			= ТекРасшифровкаОплаты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисления,ВыборкаОплата);
				
				
				Сумма 							= Сумма + ВыборкаОплата.Сумма;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаОплата.ПлатежныйДокумент) Тогда
				СтрокаНачисления.МассивПД.Добавить(
					Новый Структура("ПД, СуммаОплатыРаспределенная", ВыборкаОплата.ПлатежныйДокумент, ВыборкаОплата.СуммаОплатыРаспределенная));
			КонецЕсли;
			
			ТекДокументОплаты 				= ВыборкаОплата.ДокРегистратор;
			ТекIDСтроки						= ВыборкаОплата.IDСтрокиОплаты;
			
			Если не ВыборкаОплата.следующий() тогда
				Прервать;
			КонецЕсли;  				
		КонецЦикла;				  
	КонецЕсли;
	
	Если НЕ ТекДокументОплаты = Неопределено Тогда
		текОписание 						= Новый Структура(ОписаниеОплаты);
		текОписание.Сумма 					= Сумма;
		текОписание.Расшифровка 			= ТекРасшифровкаОплаты;
		Результат.Вставить(ТекДокументОплаты, текОписание);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстМВТ_Взаиморасчеты()
	
	Текст 	=
	"ВЫБРАТЬ
	|	бестВзаиморасчетыПоследовательность.Организация КАК Организация,
	|	бестВзаиморасчетыПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчетыПоследовательность.Район КАК Район,
	|	бестВзаиморасчетыПоследовательность.Договор КАК Договор,
	|	МИНИМУМ(бестВзаиморасчетыПоследовательность.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МинимумДатаРегистратора
	|ИЗ
	|	РегистрСведений.бестВзаиморасчетыПоследовательность КАК бестВзаиморасчетыПоследовательность
	|ГДЕ
	|	бестВзаиморасчетыПоследовательность.Организация = &Организация
	|	И бестВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления
	|	И бестВзаиморасчетыПоследовательность.Район = &Район
	|	И бестВзаиморасчетыПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И бестВзаиморасчетыПоследовательность.Договор = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыПоследовательность.Организация,
	|	бестВзаиморасчетыПоследовательность.ПериодНачисления,
	|	бестВзаиморасчетыПоследовательность.Район,
	|	бестВзаиморасчетыПоследовательность.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимумДатаРегистратора.Организация КАК Организация,
	|	МинимумДатаРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимумДатаРегистратора.Район КАК Район,
	|	МинимумДатаРегистратора.Договор КАК Договор,
	|	МинимумДатаРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА бестВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.бестПерерасчетНП
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ДопПорядок
	|ПОМЕСТИТЬ МинимумДопПорядокРегистратора
	|ИЗ
	|	МинимумДатаРегистратора КАК МинимумДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестВзаиморасчетыПоследовательность КАК бестВзаиморасчетыПоследовательность
	|		ПО (бестВзаиморасчетыПоследовательность.Организация = &Организация)
	|			И (бестВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (бестВзаиморасчетыПоследовательность.Район = &Район)
	|			И (бестВзаиморасчетыПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимумДатаРегистратора.Организация = бестВзаиморасчетыПоследовательность.Организация
	|			И МинимумДатаРегистратора.ПериодНачисления = бестВзаиморасчетыПоследовательность.ПериодНачисления
	|			И МинимумДатаРегистратора.Район = бестВзаиморасчетыПоследовательность.Район
	|			И МинимумДатаРегистратора.Договор = бестВзаиморасчетыПоследовательность.Договор
	|			И МинимумДатаРегистратора.ДатаРегистратора = бестВзаиморасчетыПоследовательность.ДатаРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимумДатаРегистратора.Организация,
	|	МинимумДатаРегистратора.ПериодНачисления,
	|	МинимумДатаРегистратора.Район,
	|	МинимумДатаРегистратора.Договор,
	|	МинимумДатаРегистратора.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимумДопПорядокРегистратора.Организация КАК Организация,
	|	МинимумДопПорядокРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимумДопПорядокРегистратора.Район КАК Район,
	|	МинимумДопПорядокРегистратора.Договор КАК Договор,
	|	МинимумДопПорядокРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МинимумДопПорядокРегистратора.ДопПорядок КАК ДопПорядок,
	|	МИНИМУМ(бестВзаиморасчетыПоследовательность.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МинимумРегистратор
	|ИЗ
	|	МинимумДопПорядокРегистратора КАК МинимумДопПорядокРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестВзаиморасчетыПоследовательность КАК бестВзаиморасчетыПоследовательность
	|		ПО (бестВзаиморасчетыПоследовательность.Организация = &Организация)
	|			И (бестВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (бестВзаиморасчетыПоследовательность.Район = &Район)
	|			И (бестВзаиморасчетыПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимумДопПорядокРегистратора.Организация = бестВзаиморасчетыПоследовательность.Организация
	|			И МинимумДопПорядокРегистратора.ПериодНачисления = бестВзаиморасчетыПоследовательность.ПериодНачисления
	|			И МинимумДопПорядокРегистратора.Район = бестВзаиморасчетыПоследовательность.Район
	|			И МинимумДопПорядокРегистратора.Договор = бестВзаиморасчетыПоследовательность.Договор
	|			И МинимумДопПорядокРегистратора.ДатаРегистратора = бестВзаиморасчетыПоследовательность.ДатаРегистратора
	|			И (ВЫБОР
	|				КОГДА МинимумДопПорядокРегистратора.ДопПорядок = 0
	|					ТОГДА бестВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.бестПерерасчетНП
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимумДопПорядокРегистратора.Организация,
	|	МинимумДопПорядокРегистратора.ПериодНачисления,
	|	МинимумДопПорядокРегистратора.Район,
	|	МинимумДопПорядокРегистратора.Договор,
	|	МинимумДопПорядокРегистратора.ДатаРегистратора,
	|	МинимумДопПорядокРегистратора.ДопПорядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МинимумРегистратор.Организация КАК Организация,
	|	МинимумРегистратор.ПериодНачисления КАК ПериодНачисления,
	|	МинимумРегистратор.Район КАК Район,
	|	МинимумРегистратор.Договор КАК Договор
	|ПОМЕСТИТЬ РазличныеДоговоры
	|ИЗ
	|	МинимумРегистратор КАК МинимумРегистратор";	
	Возврат Текст;
КонецФункции

Функция ТекстФактическаяПереплатаНаГраницу()
	
	Текст  =
	"ВЫБРАТЬ
	|	бестАвансыЭЭОстатки.Район КАК Район,
	|	бестАвансыЭЭОстатки.Договор КАК Договор,
	|	бестАвансыЭЭОстатки.ДокументОплаты КАК ДокументОплаты,
	|	бестАвансыЭЭОстатки.СуммаОстаток КАК СуммаОстаток,
	|	бестАвансыЭЭОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	бестАвансыЭЭОстатки.IDСтрокиОплаты КАК IDСтрокиОплаты,
	|	бестАвансыЭЭОстатки.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ АвансыОстатки
	|ИЗ
	|	РегистрНакопления.бестАвансыЭЭ.Остатки(
	|			&НачалоПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор
	|				И ПериодНачисления <= &ПериодНачисления) КАК бестАвансыЭЭОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестАвансыЭЭОбороты.Период КАК Период,
	|	бестАвансыЭЭОбороты.Регистратор КАК Регистратор,
	|	бестАвансыЭЭОбороты.Район КАК Район,
	|	бестАвансыЭЭОбороты.Договор КАК Договор,
	|	бестАвансыЭЭОбороты.ДокументОплаты КАК ДокументОплаты,
	|	бестАвансыЭЭОбороты.СуммаОборот КАК СуммаОборот,
	|	бестАвансыЭЭОбороты.СуммаНДСОборот КАК СуммаНДСОборот,
	|	бестАвансыЭЭОбороты.IDСтрокиОплаты КАК IDСтрокиОплаты,
	|	бестАвансыЭЭОбороты.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ АвансыОбороты
	|ИЗ
	|	РегистрНакопления.бестАвансыЭЭ.Обороты(
	|			&НачалоПериодаРасчета,
	|			&КонецПериодаРасчета,
	|			Регистратор,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор
	|				И ПериодНачисления <= &ПериодНачисления) КАК бестАвансыЭЭОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.ДокументОплаты КАК ДокументОплаты,
	|	СУММА(ВложенныйЗапрос.СуммаАванса) КАК СуммаАванса,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.IDСтрокиОплаты КАК IDСтрокиОплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		РазличныеДоговоры.Организация КАК Организация,
	|		АвансыОстатки.ПериодНачисления КАК ПериодНачисления,
	|		РазличныеДоговоры.Район КАК Район,
	|		РазличныеДоговоры.Договор КАК Договор,
	|		АвансыОстатки.ДокументОплаты КАК ДокументОплаты,
	|		АвансыОстатки.СуммаОстаток КАК СуммаАванса,
	|		АвансыОстатки.СуммаНДСОстаток КАК СуммаНДС,
	|		АвансыОстатки.IDСтрокиОплаты КАК IDСтрокиОплаты
	|	ИЗ
	|		РазличныеДоговоры КАК РазличныеДоговоры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОстатки КАК АвансыОстатки
	|			ПО РазличныеДоговоры.Район = АвансыОстатки.Район
	|				И РазличныеДоговоры.Договор = АвансыОстатки.Договор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МинимумРегистратор.Организация,
	|		АвансыОбороты.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.Договор,
	|		АвансыОбороты.ДокументОплаты,
	|		СУММА(АвансыОбороты.СуммаОборот),
	|		СУММА(АвансыОбороты.СуммаНДСОборот),
	|		АвансыОбороты.IDСтрокиОплаты
	|	ИЗ
	|		МинимумРегистратор КАК МинимумРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОбороты КАК АвансыОбороты
	|			ПО МинимумРегистратор.Район = АвансыОбороты.Район
	|				И МинимумРегистратор.Договор = АвансыОбороты.Договор
	|				И (ВЫБОР
	|					КОГДА МинимумРегистратор.ДатаРегистратора > АвансыОбороты.Период
	|						ТОГДА ИСТИНА
	|					КОГДА МинимумРегистратор.ДатаРегистратора = АвансыОбороты.Период
	|						ТОГДА ВЫБОР
	|								КОГДА МинимумРегистратор.ДопПорядок = 0
	|										И АвансыОбороты.Регистратор ССЫЛКА Документ.бестПлатежныйДокумент
	|									ТОГДА ЛОЖЬ
	|								ИНАЧЕ МинимумРегистратор.ДокРегистратор > АвансыОбороты.Регистратор
	|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимумРегистратор.Организация,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.Договор,
	|		АвансыОбороты.ДокументОплаты,
	|		АвансыОбороты.IDСтрокиОплаты,
	|		АвансыОбороты.ПериодНачисления) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.ДокументОплаты,
	|	ВложенныйЗапрос.СуммаНДС,
	|	ВложенныйЗапрос.IDСтрокиОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	Договор,
	|	ПериодНачисления,
	|	ДокументОплаты";
	Возврат Текст;
КонецФункции

Функция ТекстДокументыДляПроведения()
	
	Текст  =
	"ВЫБРАТЬ
	|	бестВзаиморасчетыПоследовательность.Организация КАК Организация,
	|	бестВзаиморасчетыПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчетыПоследовательность.Район КАК Район,
	|	бестВзаиморасчетыПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	бестВзаиморасчетыПоследовательность.Договор КАК Договор,
	|	бестВзаиморасчетыПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	бестВзаиморасчетыПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	бестВзаиморасчетыПоследовательность.ЭтоОплата КАК ЭтоОплата,
	|	бестВзаиморасчетыПоследовательность.ИсточникПоступления КАК ИсточникПоступления
	|ПОМЕСТИТЬ ДокументыДляПроведения
	|ИЗ
	|	МинимумРегистратор КАК МинимумРегистратор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестВзаиморасчетыПоследовательность КАК бестВзаиморасчетыПоследовательность
	|		ПО (бестВзаиморасчетыПоследовательность.Организация = &Организация)
	|			И (бестВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (бестВзаиморасчетыПоследовательность.Район = &Район
	|				И бестВзаиморасчетыПоследовательность.Договор = &Договор)
	|			И (ВЫБОР
	|				КОГДА МинимумРегистратор.ДатаРегистратора < бестВзаиморасчетыПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				КОГДА МинимумРегистратор.ДатаРегистратора = бестВзаиморасчетыПоследовательность.ДатаРегистратора
	|					ТОГДА ВЫБОР
	|							КОГДА МинимумРегистратор.ДопПорядок = 0
	|									И бестВзаиморасчетыПоследовательность.ДокРегистратор ССЫЛКА Документ.бестРеализацияЮрЛица
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ МинимумРегистратор.ДокРегистратор <= бестВзаиморасчетыПоследовательность.ДокРегистратор
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И МинимумРегистратор.Организация = бестВзаиморасчетыПоследовательность.Организация
	|			И МинимумРегистратор.ПериодНачисления = бестВзаиморасчетыПоследовательность.ПериодНачисления
	|			И МинимумРегистратор.Район = бестВзаиморасчетыПоследовательность.Район
	|			И МинимумРегистратор.Договор = бестВзаиморасчетыПоследовательность.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	бестВзаиморасчетыПоследовательность.Организация,
	|	бестВзаиморасчетыПоследовательность.ПериодНачисления,
	|	бестВзаиморасчетыПоследовательность.Район,
	|	бестВзаиморасчетыПоследовательность.СостояниеПроведения,
	|	бестВзаиморасчетыПоследовательность.Договор,
	|	бестВзаиморасчетыПоследовательность.ДатаРегистратора,
	|	бестВзаиморасчетыПоследовательность.ДокРегистратор,
	|	бестВзаиморасчетыПоследовательность.ЭтоОплата,
	|	бестВзаиморасчетыПоследовательность.ИсточникПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.СостояниеПроведения КАК СостояниеПроведения,
	|	ДокументыДляПроведения.Договор КАК Договор,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ВЫБОР
	|		КОГДА ДокументыДляПроведения.ДокРегистратор ССЫЛКА Документ.бестПерерасчетНП
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ДопПорядок,
	|	ДокументыДляПроведения.ЭтоОплата КАК ЭтоОплата,
	|	ДокументыДляПроведения.ИсточникПоступления КАК ИсточникПоступления
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	Договор,
	|	ДатаРегистратора,
	|	ДопПорядок,
	|	ДокРегистратор";
	Возврат Текст; 
КонецФункции

Функция ТекстЗадолженностьНаГраницу()
	
	Текст 	=
	"ВЫБРАТЬ
	|	бестВзаиморасчетыЭЭОстатки.Район КАК Район,
	|	бестВзаиморасчетыЭЭОстатки.Договор КАК Договор,
	|	бестВзаиморасчетыЭЭОстатки.СуммаОстаток КАК СуммаОстаток,
	|	бестВзаиморасчетыЭЭОстатки.Организация КАК Организация,
	|	бестВзаиморасчетыЭЭОстатки.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчетыЭЭОстатки.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический) КАК ТипЗадолженности
	|ПОМЕСТИТЬ ОстатокНачалоПериода
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
	|			&НачалоПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыЭЭОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестВзаиморасчетыПоПениЭЭОстатки.Район,
	|	бестВзаиморасчетыПоПениЭЭОстатки.Договор,
	|	бестВзаиморасчетыПоПениЭЭОстатки.СуммаОстаток,
	|	бестВзаиморасчетыПоПениЭЭОстатки.Организация,
	|	бестВзаиморасчетыПоПениЭЭОстатки.ПериодНачисления,
	|	бестВзаиморасчетыПоПениЭЭОстатки.ПлатежныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Пеня)
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ.Остатки(
	|			&НачалоПериодаРасчета,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыПоПениЭЭОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВзаиморасчетыЭЭОбороты.Район КАК Район,
	|	бестВзаиморасчетыЭЭОбороты.Период КАК Период,
	|	бестВзаиморасчетыЭЭОбороты.Регистратор КАК Регистратор,
	|	бестВзаиморасчетыЭЭОбороты.Договор КАК Договор,
	|	бестВзаиморасчетыЭЭОбороты.СуммаОборот КАК СуммаОборот,
	|	бестВзаиморасчетыЭЭОбороты.Организация КАК Организация,
	|	бестВзаиморасчетыЭЭОбороты.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчетыЭЭОбороты.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический) КАК ТипЗадолженности
	|ПОМЕСТИТЬ ВзаиморасчетыОбороты
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Обороты(
	|			&НачалоПериодаРасчета,
	|			&КонецПериодаРасчета,
	|			Регистратор,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыЭЭОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестВзаиморасчетыПоПениЭЭОбороты.Район,
	|	бестВзаиморасчетыПоПениЭЭОбороты.Период,
	|	бестВзаиморасчетыПоПениЭЭОбороты.Регистратор,
	|	бестВзаиморасчетыПоПениЭЭОбороты.Договор,
	|	бестВзаиморасчетыПоПениЭЭОбороты.СуммаОборот,
	|	бестВзаиморасчетыПоПениЭЭОбороты.Организация,
	|	бестВзаиморасчетыПоПениЭЭОбороты.ПериодНачисления,
	|	бестВзаиморасчетыПоПениЭЭОбороты.ПлатежныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Пеня)
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ.Обороты(
	|			&НачалоПериодаРасчета,
	|			&КонецПериодаРасчета,
	|			Регистратор,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыПоПениЭЭОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.Район КАК Район,
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.Период КАК Период,
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.Регистратор КАК Регистратор,
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.Договор КАК Договор,
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаОборот КАК СуммаОборот,
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.Организация КАК Организация,
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчетыПоАвансовымСчетамОбороты.ПлатежныйДокумент КАК ПлатежныйДокумент
	|ПОМЕСТИТЬ ВзаиморасчетыПоАвансовымСчетамОбороты
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоАвансовымСчетам.Обороты(
	|			&НачалоПериодаРасчета,
	|			&КонецПериодаРасчета,
	|			Регистратор,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестВзаиморасчетыПоАвансовымСчетамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодРасчета КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	СУММА(ВложенныйЗапрос.ЗадолженностьНачалоПериода) КАК ЗадолженностьНачалоПериода,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодРасчета,
	|	ВложенныйЗапрос.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ВложенныйЗапрос.ТипЗадолженности КАК ТипЗадолженности
	|ИЗ
	|	(ВЫБРАТЬ
	|		РазличныеДоговоры.ПериодНачисления КАК ПериодНачисления,
	|		РазличныеДоговоры.Район КАК Район,
	|		РазличныеДоговоры.Договор КАК Договор,
	|		ЕСТЬNULL(ОстатокНачалоПериода.СуммаОстаток, 0) КАК ЗадолженностьНачалоПериода,
	|		ОстатокНачалоПериода.Организация КАК Организация,
	|		ЕСТЬNULL(ОстатокНачалоПериода.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодРасчета,
	|		ОстатокНачалоПериода.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|		ОстатокНачалоПериода.ТипЗадолженности КАК ТипЗадолженности
	|	ИЗ
	|		РазличныеДоговоры КАК РазличныеДоговоры
	|			ЛЕВОЕ СОЕДИНЕНИЕ ОстатокНачалоПериода КАК ОстатокНачалоПериода
	|			ПО РазличныеДоговоры.Район = ОстатокНачалоПериода.Район
	|				И РазличныеДоговоры.Договор = ОстатокНачалоПериода.Договор
	|				И РазличныеДоговоры.Организация = ОстатокНачалоПериода.Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.Договор,
	|		МАКСИМУМ(ЕСТЬNULL(ВзаиморасчетыОбороты.СуммаОборот, 0)),
	|		ВзаиморасчетыОбороты.Организация,
	|		ЕСТЬNULL(ВзаиморасчетыОбороты.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)),
	|		ВзаиморасчетыОбороты.ПлатежныйДокумент,
	|		ВзаиморасчетыОбороты.ТипЗадолженности
	|	ИЗ
	|		МинимумРегистратор КАК МинимумРегистратор
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыОбороты КАК ВзаиморасчетыОбороты
	|			ПО МинимумРегистратор.Район = ВзаиморасчетыОбороты.Район
	|				И МинимумРегистратор.Договор = ВзаиморасчетыОбороты.Договор
	|				И (ВЫБОР
	|					КОГДА МинимумРегистратор.ДатаРегистратора > ВзаиморасчетыОбороты.Период
	|						ТОГДА ИСТИНА
	|					КОГДА МинимумРегистратор.ДатаРегистратора = ВзаиморасчетыОбороты.Период
	|						ТОГДА МинимумРегистратор.ДокРегистратор > ВзаиморасчетыОбороты.Регистратор
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|				И МинимумРегистратор.Организация = ВзаиморасчетыОбороты.Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.Договор,
	|		ВзаиморасчетыОбороты.Организация,
	|		ЕСТЬNULL(ВзаиморасчетыОбороты.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)),
	|		ВзаиморасчетыОбороты.ПлатежныйДокумент,
	|		ВзаиморасчетыОбороты.ТипЗадолженности
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.Договор,
	|		МАКСИМУМ(ЕСТЬNULL(ВзаиморасчетыПоАвансовымСчетамОбороты.СуммаОборот, 0)),
	|		ВзаиморасчетыПоАвансовымСчетамОбороты.Организация,
	|		ЕСТЬNULL(ВзаиморасчетыПоАвансовымСчетамОбороты.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)),
	|		ВзаиморасчетыПоАвансовымСчетамОбороты.ПлатежныйДокумент,
	|		ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Авансовый)
	|	ИЗ
	|		МинимумРегистратор КАК МинимумРегистратор
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВзаиморасчетыПоАвансовымСчетамОбороты КАК ВзаиморасчетыПоАвансовымСчетамОбороты
	|			ПО МинимумРегистратор.Район = ВзаиморасчетыПоАвансовымСчетамОбороты.Район
	|				И МинимумРегистратор.Договор = ВзаиморасчетыПоАвансовымСчетамОбороты.Договор
	|				И (ВЫБОР
	|					КОГДА МинимумРегистратор.ДатаРегистратора > ВзаиморасчетыПоАвансовымСчетамОбороты.Период
	|						ТОГДА ИСТИНА
	|					КОГДА МинимумРегистратор.ДатаРегистратора = ВзаиморасчетыПоАвансовымСчетамОбороты.Период
	|						ТОГДА МинимумРегистратор.ДокРегистратор > ВзаиморасчетыПоАвансовымСчетамОбороты.Регистратор
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|				И МинимумРегистратор.Организация = ВзаиморасчетыПоАвансовымСчетамОбороты.Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.Договор,
	|		ВзаиморасчетыПоАвансовымСчетамОбороты.Организация,
	|		ЕСТЬNULL(ВзаиморасчетыПоАвансовымСчетамОбороты.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)),
	|		ВзаиморасчетыПоАвансовымСчетамОбороты.ПлатежныйДокумент) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.ЗадолженностьНачалоПериода <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПлатежныйДокумент,
	|	ВложенныйЗапрос.ТипЗадолженности,
	|	ВложенныйЗапрос.ПериодРасчета,
	|	ВложенныйЗапрос.ПериодНачисления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	ПериодНачисления,
	|	Организация,
	|	Район,
	|	ПериодРасчета,
	|	ТипЗадолженности";
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти