#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограмныйИнтерфейс

Функция ПолучитьЗначенияЛьготнойКатегории(Категория, Организация, Район, Период) Экспорт 
	
	 Данные 	= Новый Структура;
	 
	 Запрос  					= Новый Запрос(ТекстЗапросаЗначенийЛьготныхКатегорий());
	 Запрос.УстановитьПараметр("Категория", Категория);
	 Запрос.УстановитьПараметр("Организация", Организация);
	 Запрос.УстановитьПараметр("Район", Район);
	 Запрос.УстановитьПараметр("Период", Период);
	 Результат 					= Запрос.Выполнить();
	 Для Каждого КолонкаРезультата Из Результат.Колонки Цикл
		Данные.Вставить(КолонкаРезультата.Имя, КолонкаРезультата.ТипЗначения.ПривестиЗначение());
	 КонецЦикла;
	
	 Если Не Результат.Пустой() Тогда
		Выборка 				= Результат.Выбрать(); 
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Данные,Выборка);
	 КонецЕсли;
	 
	 Возврат Данные;	 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначенийЛьготныхКатегорий()
	
	Текст  = 
	"ВЫБРАТЬ
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Период КАК Период,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Организация КАК Организация,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Район КАК Район,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.ПроцентОтНачислений КАК ПроцентОтНачислений,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.энргЗначенияЛьготныхКатегорий.СрезПоследних(
	|			&Период,
	|			ЛьготнаяКатегория = &Категория
	|				И Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияЛьготныхКатегорийСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли