#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Взыскание", Взыскание);
	
	Элементы.ПричинаОтказа.Видимость = Ложь;
	Если Взыскание Тогда
		ОтветНаПритензию = "БезОтвета";
	Иначе
		Элементы.ОтветНаПритензию.Видимость = Ложь;
	КонецЕсли;
	
	Объект = Неопределено;
	Если Параметры.Свойство("Объект", Объект) Тогда
		Юрист = Объект.Юрист;
		Если ЗначениеЗаполнено(Юрист) Тогда
			СтрокаТЗ = Приложения.Добавить();
			//СтрокаТЗ.ПрикрепляемыйДокумент = "Доверенность юриста " + Объект.Юрист + " " + Объект.ДоверенностьЮриста;
			Если Не ПустаяСтрока(Юрист.бестФамилия) Тогда
				ФИО = Юрист.бестФамилия + ?(ЗначениеЗаполнено(Юрист.бестИмя), " " + Юрист.бестИмя, "")
								+ ?(ЗначениеЗаполнено(Юрист.бестОтчество), " " + Юрист.бестОтчество, "");
			Иначе
				ФИО = Юрист.Наименование;
			КонецЕсли;
			ФИО = СклонениеПредставленийОбъектов.ПросклонятьФИО(ФИО, 2);
			СтрокаТЗ.ПрикрепляемыйДокумент = "Доверенность №" + Объект.НомерДоверенностиЮриста + " от " 
								+ Формат(Объект.ДатаДоверенностиЮриста, "ДФ=dd.MM.yyyy") + " на " + ФИО;
		КонецЕсли;
		
		Для каждого СтрокаТЧ Из Объект.СудебныеИнстанции Цикл
			СтрокаТЗ = Приложения.Добавить();
			СтрокаТЗ.ПрикрепляемыйДокумент = Строка(СтрокаТЧ.Статус) + " от " + Формат(СтрокаТЧ.Дата, "ДФ=dd.MM.yyyy") + " №" + СтрокаТЧ.Номер;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтветНаПритензиюПриИзменении(Элемент)
	Элементы.ПричинаОтказа.Видимость = ОтветНаПритензию = "ЕстьПричина";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	СписокДок = Новый Массив;
	Для каждого СтрокаТЗ Из Приложения Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.ПрикрепляемыйДокумент) Тогда
			СписокДок.Добавить(СтрокаТЗ.ПрикрепляемыйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Если Взыскание Тогда
		Если ОтветНаПритензию = "БезОтвета" Тогда
			ОтветНаПритензию = "не предоставил ответа на данную претензию";
		Иначе
		    ОтветНаПритензию = "отказывается погасить задолженность, ссылаясь на " + ПричинаОтказа;
		КонецЕсли;
		Результат = Новый Структура("СписокДок, ОтветНаПритензию", СписокДок, ОтветНаПритензию);
	Иначе
		Результат = СписокДок;
	КонецЕсли;
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти
