#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает подчиненные элементы.
//
// Параметры:
//  РодительскийЭлемент	-	СправочникСсылка.энргНаправлениеИспользованияТочекУчета.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ВернутьПодчиненныеЭлементы(РодительскийЭлемент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	энргНаправлениеИспользованияТочекУчета.Ссылка КАК НаправлениеИспользованияТУ
		|ИЗ
		|	Справочник.энргНаправлениеИспользованияТочекУчета КАК энргНаправлениеИспользованияТочекУчета
		|ГДЕ
		|	энргНаправлениеИспользованияТочекУчета.Родитель = &Родитель
		|	И НЕ энргНаправлениеИспользованияТочекУчета.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Родитель", РодительскийЭлемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Обновляет ТЧ значения измерителей.
//
// Параметры:
//  ТЧ					-	ДокументТабличнаяЧасть.энргОперацияСЛицевымСчетом.ПоказанияПриборовУчета.
//  IDСтроки			-	УникальныйИдентификатор.
//  РодительскийЭлемент	-	СправочникСсылка.энргНаправлениеИспользованияТочекУчета.
//  ОчищатьТЧ			-	Булево.
//
Процедура ОбновитьТЧЗначенияИзмерителей(ТЧ,IDСтроки,РодительскийЭлемент,ОчищатьТЧ) Экспорт
	
	Если ОчищатьТЧ Тогда
		
		СтрокиТЧ = ТЧ.найтиСтроки(Новый Структура("IDСтроки",IDСтроки));
		Для Каждого СтрокаТЧ из СтрокиТЧ Цикл 
			ТЧ.удалить(СтрокаТЧ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если РодительскийЭлемент = Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление или не ЗначениеЗаполнено(РодительскийЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	
	РезультатЗапроса 	= ВернутьПодчиненныеЭлементы(РодительскийЭлемент);
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если не ОчищатьТЧ и ТЧ.НайтиСтроки(Новый Структура("IDСтроки,НаправлениеИспользованияТУ",IDСтроки,Выборка.НаправлениеИспользованияТУ)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;		
		
		НоваяСтрока 							= ТЧ.Добавить();
		НоваяСтрока.IDСтроки 					= IDСтроки;
		НоваяСтрока.НаправлениеИспользованияТУ = Выборка.НаправлениеИспользованияТУ;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли