#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//энргЛокализацияСервер.ПриСозданииНаСервере_энргОбходнойЛист(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ОпределитьПериодНачисления();
		КонецЕсли;
	КонецЕсли;
	УстановитьСвойстваЭлементовФормы();
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьЗначениеСвойстваСкрытьСтроку();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборТарифныхЗонПоУмолчанию();
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов(); 
	УстановитьОтборЗагруженныхДанных();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(ТекущийОбъект.Ссылка);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ЗаполнитьТаблицуПоказанийИзФайла();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьТаблицуПоказанийИзФайла();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ОпределитьПериодНачисления();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ОпределитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПоказанийПриИзменении(Элемент)
	УстановитьСвойстваЭлементовФормы();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗагруженныеДанныеЗагруженныеПУ

&НаКлиенте
Процедура ЗагруженныеДанныеЗагруженныеПУПриАктивизацииСтроки(Элемент)
	
	ТаблицаФормыПоказанияИзФайла = Элементы["ЗагруженныеПоказанияИзФайла"];
	ТаблицаФормыПоказанияИзБазы	= Элементы["ЗагруженныеПоказанияИзБазы"];
	
	ТекущиеДанные = Элементы["ЗагруженныеДанныеЗагруженныеПУ"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыПоказанияИзФайла.ОтборСтрок = Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);
	ТаблицаФормыПоказанияИзБазы.ОтборСтрок = Новый ФиксированнаяСтруктура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТекущиеПоказанияПриборовУчета

&НаКлиенте
Процедура ТекущиеПоказанияПриборовУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеПоказанияНезагруженные = Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания.ТекущиеДанные; 
		Элемент.ТекущиеДанные.IDСтроки = ТекущиеПоказанияНезагруженные.IDСтроки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНеЗагруженныеДанныеНеЗагруженныеПоказания

&НаКлиенте
Процедура НеЗагруженныеДанныеНеЗагруженныеПоказанияПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСтрокПоказаний();
	// ОбновитьАктуальныеПриборыУчетаКлючаПомещенияКВыбору(); тест закоментил
	
КонецПроцедуры

&НаКлиенте
Процедура НеЗагруженныеДанныеНеЗагруженныеПоказанияНомерПрибораУчетаСталоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания.ТекущиеДанные;
	ОпределитьАктуальныеПриборыУчета(ТекДанные);
КонецПроцедуры 

&НаКлиенте
Процедура НеЗагруженныеДанныеНеЗагруженныеПоказанияПриИзменении(Элемент)
	ТекДанные = Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания.ТекущиеДанные;
	СтрокаЗаполнена = ЗначениеЗаполнено(ТекДанные.Договор) И ЗначениеЗаполнено(ТекДанные.ОбъектРасчета) И ЗначениеЗаполнено(ТекДанные.НомерПрибораУчетаСтало);   
	Если СтрокаЗаполнена Тогда        
		ТекДанные.Исправлен = Истина;
		ОбновитьДанныеПрибораУчета(ТекДанные); 
	Иначе
		ТекДанные.Исправлен = Ложь;
		ОчиститьТЧ(ТекДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеСвойстваСкрытьСтроку()
	Для Каждого ТекСтрока Из Объект.НеЗагруженныеДанныеНеЗагруженныеПоказания Цикл		
		ТекСтрока.СкрытьСтроку = ТекСтрока.ОписаниеОшибки = "ПУ не найден";
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ВводНаОсновании

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

#КонецОбласти

#Область ПодключаемыеКомандыФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ЗагрузкаДанных

&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	
	Ошибки = ПроверитьВозможностьЗагрузки();
	Если НЕ ПустаяСтрока(Ошибки) Тогда 
		НовоеОписаниеОповощение = Новый ОписаниеОповещения("ЗаполнитьПоказанияПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(НовоеОписаниеОповощение,Ошибки,РежимДиалогаВопрос.ДаНет,,,,);
		Возврат;
	КонецЕсли;
	Если ЕстьНеЗагруженныеДанные() Тогда 
		НовоеОписаниеОповощение = Новый ОписаниеОповещения("ЗаполнитьПоказанияПослеВопросаОчистки", ЭтотОбъект);
		ПоказатьВопрос(НовоеОписаниеОповощение, "Данные табличных частей документа будут очищены. Продолжить загрузку?", РежимДиалогаВопрос.ДаНет,,, "Очистка данных");
	Иначе 
		ОчиститьТЧ();
		ЗагрузитьПоказания(); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументов(Команда)
	ОткрытьФормуЗапускаСозданияДокументовВФоне();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодборПрибораУчета

&НаКлиенте
Процедура ОпределитьАктуальныеПриборыУчета(ТекДанные)
	
	ОбъектРасчета = ТекДанные.ОбъектРасчета;
	
	ИдентификаторСтроки = ТекДанные.IDСтроки;
	
	ПараметрыОтбораПрибораУчета = НовыеПараметрыОтбораПрибораУчета();
	ПараметрыОтбораПрибораУчета.Организация				= Объект.Организация;
	ПараметрыОтбораПрибораУчета.Вставить("Период",		Объект.Дата);
	ПараметрыОтбораПрибораУчета.НомерПрибораУчетаСтало 	= ТекДанные.НомерПрибораУчетаСтало;
	ПараметрыОтбораПрибораУчета.Район 					= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Договор, "Район");		
	ПараметрыОтбораПрибораУчета.ОбъектРасчета			= ТекДанные.ОбъектРасчета;
		
	ПредставлениеПриборыУчета = Новый СписокЗначений;// Обратная совместимость
	АктуальныеПриборыУчета(ПараметрыОтбораПрибораУчета, ПредставлениеПриборыУчета);
	ДополнитьАктуальныеПриборыУчетаКВыбору(ПредставлениеПриборыУчета);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДополнитьАктуальныеПриборыУчетаКВыбору(мПриборыУчета)
	
	Если ТипЗнч(мПриборыУчета) = Тип("СписокЗначений") Тогда
		
		ЭлементФомы = Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказанияНомерПрибораУчетаСтало;
		ЭлементФомы.СписокВыбора.Очистить();
		Для Каждого ТекКлючЗначение из мПриборыУчета Цикл
			ЭлементФомы.СписокВыбора.Добавить(ТекКлючЗначение.Значение, ТекКлючЗначение.Представление);
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	мПриборыУчета = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мПриборыУчета);
	Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказанияНомерПрибораУчетаСтало.СписокВыбора.ЗагрузитьЗначения(мПриборыУчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АктуальныеПриборыУчета(ПараметрыОтбораПрибораУчета, НаборПриборов)

	РезультатЗапроса	= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчетаСПоказаниями(КонецДня(ПараметрыОтбораПрибораУчета.Период), ПараметрыОтбораПрибораУчета.Организация, ПараметрыОтбораПрибораУчета.Район, ПараметрыОтбораПрибораУчета.ОбъектРасчета); 
	
	//РезультатЗапроса = энргРаботаСПоказаниямиПриборовУчетаСервер.РезультатЗапросаАктуальныхПриборовМКДИхПоказаний(
	//	КонецДня(ПараметрыОтбораПрибораУчета.Период),
	//	ПараметрыОтбораПрибораУчета);
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекПриборУчета 	= Неопределено;
	ТекЗавНомер 	= Неопределено;
	Выборка  		= РезультатЗапроса.Выбрать(); 	
	
	СтрокаПрибора = "";
	ШаблонПоказаний = "%1:%2";	
	
	Пока Выборка.Следующий() цикл		
		
		Если НЕ ТекПриборУчета = Выборка.ПриборУчета Тогда
			
			Если НЕ ТекПриборУчета = Неопределено Тогда
				СтрокаПрибораИтог = СокрЛП(ТекЗавНомер) + " (" + СокрЛП(СтрокаПрибора) + ")" ; 				
				НаборПриборов.Добавить(СокрЛП(ТекЗавНомер), СтрокаПрибораИтог);
			КонецЕсли;
			
			СтрокаПрибора = "";
					
		КонецЕсли;	
		
		СтрокаПрибора 	= СтрокаПрибора + " " + СтрШаблон(ШаблонПоказаний, Выборка.ТарифнаяЗона, Формат(Выборка.Показание, "ЧГ=0"));
		ТекПриборУчета 	= Выборка.ПриборУчета;
		ТекЗавНомер 	= Выборка.ЗаводскойНомерПриборУчета;
		
	КонецЦикла;
	
	Если НЕ ТекПриборУчета = Неопределено Тогда
		СтрокаПрибораИтог = СокрЛП(ТекЗавНомер) + " (" + СокрЛП(СтрокаПрибора) + ")" ; 				
		НаборПриборов.Добавить(СокрЛП(ТекЗавНомер), СтрокаПрибораИтог);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыеПараметрыОтбораПрибораУчета()
	
	Результат = Новый Структура;
	Результат.Вставить("НомерПрибораУчетаСтало"		, "");
	Результат.Вставить("Район"						, ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка"));
	Результат.Вставить("ОбъектРасчета"				, ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка")); 
	Результат.Вставить("Договор"					, ПредопределенноеЗначение("Справочник.энргДоговорыКонтрагентов.ПустаяСсылка"));
	Результат.Вставить("Организация"				, ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуПоказанийИзФайла()
	
	ЗагруженныеПоказанияИзФайла.Очистить();
	Для Каждого ЗагруженныйПУ Из Объект.ТочкиУчета Цикл 
		Если ЗагруженныйПУ.СостояниеИсправления = 1 Тогда
			Продолжить;
		КонецЕсли;
				
		СтрокаПоказанияИзФайла = ЗагруженныеПоказанияИзФайла.Добавить();
		СтрокаПоказанияИзФайла.IDСтроки = ЗагруженныйПУ.IDСтроки; 
		
		СтрокаБылаИсправлена = Объект.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.НайтиСтроки(Новый Структура("IDСтроки", ЗагруженныйПУ.IDСтроки));
		СтрокаСразуЗагружена = Объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ЗагруженныйПУ.IDСтроки)); 
		Если СтрокаБылаИсправлена.Количество() > 0 Тогда
			СтрокаПоказанияИзФайла.ТарифнаяЗона = СтрокаБылаИсправлена[0].ТарифнаяЗона;
			СтрокаПоказанияИзФайла.ТекущиеПоказания = СтрокаБылаИсправлена[0].ТекущиеПоказания;
		ИначеЕсли СтрокаСразуЗагружена.Количество() > 0 Тогда
			СтрокаПоказанияИзФайла.ТарифнаяЗона = СтрокаСразуЗагружена[0].ТарифнаяЗона;
			СтрокаПоказанияИзФайла.ТекущиеПоказания = СтрокаСразуЗагружена[0].ТекущиеПоказания;
		КонецЕсли;
	КонецЦикла;   

КонецПроцедуры 

#КонецОбласти

#Область ОбновлениеДанныхПередИсправлением

&НаКлиенте
Процедура ОбновитьДанныеПрибораУчета(ТекДанные)
		
	ИдентификаторСтроки = ТекДанные.IDСтроки;
	
	ПараметрыОтбораПрибораУчета = НовыеПараметрыОтбораПрибораУчета();
	ПараметрыОтбораПрибораУчета.НомерПрибораУчетаСтало 	= ТекДанные.НомерПрибораУчетаСтало;
	ПараметрыОтбораПрибораУчета.Район 					= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Договор, "Район");
	ПараметрыОтбораПрибораУчета.ОбъектРасчета 			= ТекДанные.ОбъектРасчета;
	ПараметрыОтбораПрибораУчета.Договор		 			= ТекДанные.Договор;
	ПараметрыОтбораПрибораУчета.Организация 			= Объект.Организация;
	
	мПриборыУчета = Новый Массив;	
	ЗаполнитьДанныеПриборовУчета(ИдентификаторСтроки, ПараметрыОтбораПрибораУчета, мПриборыУчета);
	
	//ДополнитьАктуальныеПриборыУчетаКВыбору(мПриборыУчета);
	//ТекДанные.НомерПрибораУчетаСтало = "";
	
	УстановитьОтборСтрокПоказаний();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДанныеПриборовУчета(ИдентификаторСтроки, ПараметрыОтбораПрибораУчета, мПриборыУчета)
	
	ОчиститьТЧ(ИдентификаторСтроки);	
	Если НЕ ЗначениеЗаполнено(ПараметрыОтбораПрибораУчета.НомерПрибораУчетаСтало) Тогда
		Возврат;
	КонецЕсли;  	
	
	ТаблицаТочек 		= Объект.ТочкиУчета;
	ТаблицаШкалы 		= Объект.ШкалыПриборовУчета;
	ТаблицаПоказания 	= Объект.ПоказанияПриборовУчета;		
	
	Результат	= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(КонецДня(Объект.Дата), ПараметрыОтбораПрибораУчета.Организация, ПараметрыОтбораПрибораУчета.Район, ПараметрыОтбораПрибораУчета.ОбъектРасчета); 
		
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	ПоказанияИзФайла	= Объект.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.НайтиСтроки(Новый Структура("IDСтроки", ИдентификаторСтроки));
	ПриборУчетаИзФайла	= Объект.НеЗагруженныеДанныеНеЗагруженныеПоказания.НайтиСтроки(Новый Структура("IDСтроки", ИдентификаторСтроки));
	
	ПриборУчетаБыло	= ПриборУчетаИзФайла[0].НомерПрибораУчетаБыло;
	ПриборУчетаСтало = ПриборУчетаИзФайла[0].НомерПрибораУчетаСтало;
	ДатаПоказаний = ПриборУчетаИзФайла[0].ДатаПоказаний; 
	НомерПоказаний = ПриборУчетаИзФайла[0].НомерПоказаний;
	
	Выборка  		= Результат.выбрать();  
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл 
		Если мПриборыУчета.Найти(Выборка.ЗаводскойНомерПриборУчета) = Неопределено Тогда
			// Заполняем приборами для отображения выбора из списка пользователю
			мПриборыУчета.Добавить(Выборка.ЗаводскойНомерПриборУчета);
		КонецЕсли;
		
		Если НЕ ПараметрыОтбораПрибораУчета.НомерПрибораУчетаСтало = Выборка.ЗаводскойНомерПриборУчета Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= ТаблицаТочек.Добавить();
			IDСтрокиТочки 						= ИдентификаторСтроки;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.ДатаПоказаний      = ДатаПоказаний;
			СтрокаТочкиУчета.Договор			= ПараметрыОтбораПрибораУчета.Договор; 
			СтрокаТочкиУчета.СостояниеИсправления = 1;
			СтрокаТочкиУчета.ПриборУчетаИзФайла = ПриборУчетаБыло; 
			СтрокаТочкиУчета.НомерПоказаний = НомерПоказаний;
		КонецЕсли;
		
		Если НоваяТочка ИЛИ НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= ТаблицаШкалы.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= ТаблицаПоказания.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.IDСтрокиТочкиУчета		= IDСтрокиТочки;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона; 
		Для Каждого ТекСтрокаПоказанийФайла из ПоказанияИзФайла Цикл 
			Если СтрокаПоказаний.ТарифнаяЗона = ТекСтрокаПоказанийФайла.ТарифнаяЗона Тогда
				СтрокаПоказаний.ТекущиеПоказания = ТекСтрокаПоказанийФайла.ТекущиеПоказания;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
	КонецЦикла;

	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета, ДатаПоказаний, Объект.Организация,ПараметрыОтбораПрибораУчета.Район,Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзВнешнихИсточников

&НаКлиенте
Процедура ЗаполнитьПоказанияПослеВопросаОчистки(Результат, ДопПараметры) Экспорт
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьТЧ();
	ЗагрузитьПоказания();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказанияПослеВопроса(Результат, ДопПараметры) Экспорт
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать();    
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоказания()
	
	ЭтотОбъект.Модифицированность = Истина;
	АдресВХ = УпаковатьВоВременноеХранилище(объект.ФайлДляЧтения);
	ОбработатьФайлНаСервере(АдресВХ);
	Записать();
	УстановитьЗначениеСвойстваСкрытьСтроку();
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	ОткрытьФормуЗапускаСозданияДокументовВФоне();
	
КонецПроцедуры

&НаКлиенте
Функция УпаковатьВоВременноеХранилище(ФайлДляЧтения)
	Файл 	= Новый ДвоичныеДанные(ФайлДляЧтения);
	Адрес 	= ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат Адрес;
КонецФункции 

&НаСервере
Процедура ОбработатьФайлНаСервере(АдресВХ)
	ОбработкаЗагрузки 	= ПолучитьОбработкуЗагрузки();
	ОбработкаЗагрузки.ЗагрузитьПоказания(Объект, АдресВХ);
КонецПроцедуры 

#КонецОбласти

#Область ИсправлениеДанныхЗагруженныхИзВнешнихИсточников

&НаКлиенте
Процедура ИсправитьДанные(Команда)
	Ошибки = ПроверитьВозможностьЗагрузки(Истина);
	Если НЕ ПустаяСтрока(Ошибки) Тогда 
		НовоеОписаниеОповощение = Новый ОписаниеОповещения("ИсправитьДанныеПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(НовоеОписаниеОповощение,Ошибки,РежимДиалогаВопрос.ДаНет,,,,);
		Возврат;
	КонецЕсли;
	
	ИсправитьДанныеНаСервере();
	ЭтотОбъект.Модифицированность = Истина;
	Записать();
КонецПроцедуры 

&НаКлиенте
Процедура ИсправитьДанныеПослеВопроса(Результат, ДопПараметры) Экспорт
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИсправитьДанныеНаСервере();
	Записать();    
КонецПроцедуры

&НаСервере   
Процедура ИсправитьДанныеНаСервере()
	
	МассивID = Новый Массив;
	Для Каждого СтрокаПрибора Из Объект.НеЗагруженныеДанныеНеЗагруженныеПоказания Цикл 
		
		Если Не СтрокаПрибора.Исправлен Тогда 
			Продолжить;
		КонецЕсли;	
		
		МассивID.Добавить(СтрокаПрибора.IDСтроки);
	КонецЦикла;
	
	Успешно 			= Ложь;
	РезультатЗапроса 	= ТаблицаДанныхКПереносу(МассивID);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ОбработкаЗагрузки = ПолучитьОбработкуЗагрузки();
	ОбработкаЗагрузки.ОбработатьИсправленныеДанные(Объект, РезультатЗапроса, Успешно, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры.Свойство("МассивID") Тогда 
		УстановитьПризнакИсправленияСтрок(ДополнительныеПараметры.МассивID);
		Возврат;
	КонецЕсли;
		
	Если НЕ Успешно Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПризнакИсправленияСтрок(МассивID); 
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакИсправленияСтрок(МассивID)
	
	Для Каждого СтрокаИдентификатор Из МассивID Цикл
		
		СвязаныеСтроки = Объект.НеЗагруженныеДанныеНеЗагруженныеПоказания.НайтиСтроки(Новый Структура("IDСтроки", СтрокаИдентификатор)); 
		Для Каждого СтрокаОшибочныхДанных Из СвязаныеСтроки Цикл	
			Объект.НеЗагруженныеДанныеНеЗагруженныеПоказания.Удалить(СтрокаОшибочныхДанных); 
		КонецЦикла;
		
		ПоказанияИзФайла = Объект.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.НайтиСтроки(Новый Структура("IDСтроки", СтрокаИдентификатор));
		
		СвязаныеСтрокиТУ = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаИдентификатор)); 			
		Для Каждого СтрокаТУ Из СвязаныеСтрокиТУ Цикл
			СтрокаТУ.СостояниеИсправления = 0;
			
			СтрокиПоказанияИзФайла = ЗагруженныеПоказанияИзФайла.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", СтрокаТУ.IDСтроки, ПоказанияИзФайла[0].ТарифнаяЗона));  
			Если СтрокиПоказанияИзФайла.Количество() > 0 Тогда
				СтрокиПоказанияИзФайла[0].ТекущиеПоказания = ПоказанияИзФайла[0].ТекущиеПоказания;
			Иначе
				ЗагруженноеПоказание = ЗагруженныеПоказанияИзФайла.Добавить();
				ЗагруженноеПоказание.ТарифнаяЗона = ПоказанияИзФайла[0].ТарифнаяЗона;
				ЗагруженноеПоказание.ТекущиеПоказания = ПоказанияИзФайла[0].ТекущиеПоказания;
				ЗагруженноеПоказание.IDСтроки = СтрокаИдентификатор;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ТаблицаДанныхКПереносу(МассивID)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.IDСтроки КАК IDСтроки,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.Договор КАК Договор,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.Услуга КАК Услуга,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.ДатаПоказаний КАК ДатаПоказаний
	|ПОМЕСТИТЬ ТаблицаТочкиУчета
	|ИЗ
	|	&ТаблицаТочкиУчета КАК энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета
	|ГДЕ
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковТочкиУчета.IDСтроки В(&МассивID)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковШкалыПриборовУчета.Шкала КАК Шкала
	|ПОМЕСТИТЬ ТаблицаШкалыПриборовУчета
	|ИЗ
	|	&ТаблицаШкалыПриборовУчета КАК энргЗагрузкаПоказанийИзВнешнихИсточниковШкалыПриборовУчета
	|ГДЕ
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковШкалыПриборовУчета.IDСтрокиТочкиУчета В(&МассивID)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковПоказанияПриборовУчета.IDСтроки КАК IDСтроки,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковПоказанияПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковПоказанияПриборовУчета.ПредыдущиеПоказания КАК ПредыдущиеПоказания
	|ПОМЕСТИТЬ ТаблицаПоказанияПриборовУчета
	|ИЗ
	|	&ТаблицаПоказанияПриборовУчета КАК энргЗагрузкаПоказанийИзВнешнихИсточниковПоказанияПриборовУчета
	|ГДЕ
	|	энргЗагрузкаПоказанийИзВнешнихИсточниковПоказанияПриборовУчета.IDСтрокиТочкиУчета В(&МассивID)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
	|	ТаблицаТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ТаблицаТочкиУчета.Договор КАК Договор,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочкиУчета.Услуга КАК Услуга,
	|	ТаблицаШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	ТаблицаШкалыПриборовУчета.Шкала КАК Шкала,
	|	ТаблицаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказанияФайла,
	|	ТаблицаПоказанияПриборовУчета.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	энргДоговорыКонтрагентов.Район КАК Район,
	|	ТаблицаТочкиУчета.ДатаПоказаний КАК ДатаПоказаний
	|ИЗ
	|	ТаблицаТочкиУчета КАК ТаблицаТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК ТаблицаШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|			ПО ТаблицаШкалыПриборовУчета.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки
	|		ПО ТаблицаТочкиУчета.IDСтроки = ТаблицаШкалыПриборовУчета.IDСтрокиТочкиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО ТаблицаТочкиУчета.Договор = энргДоговорыКонтрагентов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	ОбъектРасчета,
	|	ТочкаУчета,
	|	ПриборУчета,
	|	Шкала";
	
	Запрос.УстановитьПараметр("ТаблицаТочкиУчета"				, Объект.ТочкиУчета.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаШкалыПриборовУчета"		, Объект.ШкалыПриборовУчета.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаПоказанияПриборовУчета"	, Объект.ПоказанияПриборовУчета.Выгрузить());
	Запрос.УстановитьПараметр("МассивID"						, МассивID);
	Запрос.УстановитьПараметр("Организация"						, Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#Область ОперацииСОбработкойЗагрузки

&НаСервереБезКонтекста
Функция СсылкаНаОбработкуЗагрузки(ИсточникПоказаний)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникПоказаний, "ОбработкаЗагрузки");
КонецФункции

&НаСервере
Функция ПолучитьОбработкуЗагрузки()
	СсылкаНаОбработкуЗагрузки = СсылкаНаОбработкуЗагрузки(Объект.ИсточникПоказаний);
	Возврат Обработки[СсылкаНаОбработкуЗагрузки.Имя].Создать();
КонецФункции

&НаСервере
Функция ПолучитьФильтрФайлов()
	ОбработкаЗагрузки = ПолучитьОбработкуЗагрузки();
	Возврат ОбработкаЗагрузки.ФильтрФайлов();
КонецФункции

#КонецОбласти

#Область ПроверкаДанных

&НаКлиенте
Функция ПроверитьВозможностьЗагрузки(ПроверятьМодифицированность = Ложь)
	Результат = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Результат.Добавить("Перед загрузкой необходимо записать документ. Записать данный документ?");
	КонецЕсли;
	Если ПроверятьМодифицированность И Модифицированность Тогда 
		Результат.Добавить("Документ изменен. Перед исправлением данных необходимо записать документ. Записать данный документ?");
	КонецЕсли;		
	
	ПроверитьОбработкуЗагрузки(Результат);
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлДляЧтения) Тогда
		Результат.Добавить("Укажите файл для чтения");
	КонецЕсли; 	
	
	Возврат СтрСоединить(Результат, ". ");
КонецФункции

&НаКлиенте
Функция ПроверитьОбработкуЗагрузки(Результат)
	Если ЗначениеЗаполнено(Объект.ИсточникПоказаний) Тогда 		
		ОбработкаЗагрузки = СсылкаНаОбработкуЗагрузки(Объект.ИсточникПоказаний);
		Если ОбработкаЗагрузки = ПредопределенноеЗначение("Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка") Тогда 
			Результат.Добавить("У источника показаний не указана обработка загрузки");
		КонецЕсли;
	Иначе 
		Результат.Добавить("Укажите источник показаний");
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область УправлениеСвойствамиЭлементовФормы

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	//ИмяГруппы = "ДанныеАбонента";
	//ПолучитьИмяГруппыДляОтображения(ИмяГруппы);
	
	//Если ИмяГруппы = "ДанныеАбонентаЕИРЦ" Тогда 		
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаЕИРЦ", "Видимость", Истина);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонента", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаПолитариф", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаГИСЖКХ", "Видимость", Ложь);
	////ИначеЕсли ИмяГруппы = "ДанныеАбонента"  Тогда 
	////	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаЕИРЦ", "Видимость", Ложь);
	////	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаПолитариф", "Видимость", Ложь);
	////	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонента", "Видимость", Истина);
	////	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаГИСЖКХ", "Видимость", Ложь);
	//ИначеЕсли ИмяГруппы = "ДанныеАбонентаПолитариф"  Тогда 
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонента", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаЕИРЦ", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаПолитариф", "Видимость", Истина);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаГИСЖКХ", "Видимость", Ложь);
	//ИначеЕсли ИмяГруппы = "ДанныеАбонентаГИСЖКХ"  Тогда 
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонента", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаЕИРЦ", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаПолитариф", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаГИСЖКХ", "Видимость", Истина);
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонента", "Видимость", Истина);		
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаЕИРЦ", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаПолитариф", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеАбонентаГИСЖКХ", "Видимость", Ложь);		
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РаботаСОтборами

&НаКлиенте
Процедура УстановитьОтборТарифныхЗонПоУмолчанию() 
	ИмяТаблицыПоказаний						= "НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона";
	ИмяТаблицыОригинальныхЗон				= "ТекущиеПоказанияПриборовУчета";
	ТаблицаФормыПоказаний	 				= Элементы[ИмяТаблицыПоказаний];
	ТаблицаФормыОригинальныхЗон				= Элементы[ИмяТаблицыОригинальныхЗон];
	
	ТаблицаФормыПоказаний.ОтборСтрок		= Новый ФиксированнаяСтруктура("ОригинальнаяТарифнаяЗона", Ложь);
	//	ТаблицаФормыОригинальныхЗон.ОтборСтрок	= Новый ФиксированнаяСтруктура("ОригинальнаяТарифнаяЗона", Истина); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокПоказаний()
	
	ИмяТаблицыТочек 						= "НеЗагруженныеДанныеНеЗагруженныеПоказания";
	ИмяТаблицыПоказаний						= "НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона";
	ИмяТаблицыОригинальныхЗон				= "ТекущиеПоказанияПриборовУчета";
	ТаблицаФормыПоказаний	 				= Элементы[ИмяТаблицыПоказаний];
	ТаблицаФормыОригинальныхЗон				= Элементы[ИмяТаблицыОригинальныхЗон];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыПоказаний.ОтборСтрок		= Новый ФиксированнаяСтруктура("IDСтроки, ОригинальнаяТарифнаяЗона", ТекущиеДанные.IDСтроки, Ложь);
	ТаблицаФормыОригинальныхЗон.ОтборСтрок	= Новый ФиксированнаяСтруктура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборЗагруженныхДанных() 
	Элементы.ЗагруженныеДанныеЗагруженныеПУ.ОтборСтрок = Новый ФиксированнаяСтруктура("СостояниеИсправления", 0);
КонецПроцедуры

#КонецОбласти

#Область РаботаСФоновымСозданиемДокументов

&НаКлиенте
Процедура ОткрытьФормуЗапускаСозданияДокументовВФоне()
	
	Если НЕ ОбработкаРаботаетВФоне() Тогда
		ЗаполнитьТаблицуПоказанийИзФайла();
		Возврат;
	КонецЕсли;
	
	ПараметрыПередачи = Новый Структура("ДокументСсылка", Объект.Ссылка);
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормыРаботыВФоне", ЭтотОбъект);
	ОткрытьФорму(
		"Документ.бестЗагрузкаПоказанийИзВнешнихИсточников.Форма.ФормаСозданияДокументовВФоне",
		ПараметрыПередачи,,,,,ОповещениеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗакрытияФормыРаботыВФоне(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	ЗаполнитьТаблицуПоказанийИзФайла();
		
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОпераций(Команда)
	
	ОбновитьНадписьВыполненияДлительныхОперацийКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВыполненияДлительныхОперацийКлиент()
	
	ОсталосьСоздатьДокументовДлительныхОпераций = КоличествоОсталосьСоздатьДокументовРегистратора(Объект.Ссылка);
	ЗаполнитьКоличествоАктивныхДлительныхОпераций();
	ПоказатьНадписьСозданияДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНадписьСозданияДокументов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НадписьВыполненияДлительныхОпераций",
			"ЦветТекста",
			Новый Цвет(255,0,0));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ОбновитьНадписьВыполненияДлительныхОпераций",
			"Видимость",
			Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ОткрытьФормуЗапускаСозданияДокументов",
			"Видимость",
			Ложь);
			
	Если НЕ ОбработкаРаботаетВФоне() Тогда 
		Возврат;
	КонецЕсли;
			
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 Тогда 
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НадписьВыполненияДлительныхОпераций",
			"Заголовок",
			"Документы созданы");
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НадписьВыполненияДлительныхОпераций",
			"ЦветТекста",
			Новый Цвет(0,150,70));
			
		Возврат;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ОбновитьНадписьВыполненияДлительныхОпераций",
			"Видимость",
			Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ОткрытьФормуЗапускаСозданияДокументов",
			"Видимость",
			Истина);		
	
	Если КоличествоАктивныхДлительныхОпераций > 0 Тогда
		
		ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов %2";
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НадписьВыполненияДлительныхОпераций",
			"Заголовок",
			СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций, КоличествоАктивныхДлительныхОпераций));
			
		Возврат;
		
	КонецЕсли;	
	
	ШаблонСтроки = "%1 документов осталось создать. Активных фоновых процессов нет, необходимо повторно запустить процесс создания документов.";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьВыполненияДлительныхОпераций",
		"Заголовок",
		СтрШаблон(ШаблонСтроки, ОсталосьСоздатьДокументовДлительныхОпераций));
	
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка)	
	
	Возврат	РегистрыСведений.бестЗагрузкаПоказанийТочкиУчета.КоличествоОсталосьСоздатьДокументовРегистратора(ДокументСсылка);
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьКоличествоАктивныхДлительныхОпераций()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ОсталосьСоздатьДокументовДлительныхОпераций = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КоличествоАктивныхДлительныхОпераций = 0;
	Активные = ДлительныеОперацииКлиент.АктивныеДлительныеОперации();
	
	Для Каждого КлючЗначение Из Активные.Список Цикл
		Попытка
			
			Если КлючЗначение.Значение.ОповещениеОЗавершении.ДополнительныеПараметры.ДокументСсылка = Объект.Ссылка Тогда
				КоличествоАктивныхДлительныхОпераций = КоличествоАктивныхДлительныхОпераций + 1;					
			КонецЕсли; 			
			
		Исключение
			
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Функция ОбработкаРаботаетВФоне()
	
	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.ИсточникПоказаний) Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ОбработкаЗагрузки = СсылкаНаОбработкуЗагрузки(Объект.ИсточникПоказаний);
	Если НЕ ЗначениеЗаполнено(ОбработкаЗагрузки) Тогда 
		Возврат Результат;
	КонецЕсли; 
	
	ИмяОбработки = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбработкаЗагрузки, "Имя");
	Если ИмяОбработки = "рксИнтеграцияСМобильнымПриложениемКонтролера" 
		Или ИмяОбработки = "рксЗагрузкаПоказанийИнтеллектуальныхПУ"
		Или ИмяОбработки = "энргЗагрузкаПоказанийГИСЖКХ"
		Или ИмяОбработки = "энргЗагрузкаПоказанийПирамидаЧерезExcel" 
		Или ИмяОбработки = "бестЗагрузкаПоказанийПирамидаЧерезExcel" Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Ошибки = Новый Массив;
	ПроверитьОбработкуЗагрузки(Ошибки); 	
	Если Ошибки.Количество() > 0 Тогда
		ТекстПредупреждение = СтрСоединить(Ошибки, ". ");
		ПоказатьПредупреждение(, ТекстПредупреждение);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка 		= Ложь;
	Диалог 						= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр 				= ПолучитьФильтрФайлов();
	Если Диалог.Выбрать() тогда
		Объект.ФайлДляЧтения 	= Диалог.ПолноеИмяФайла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПериодНачисления()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры

&НаСервере
Процедура ОчиститьТЧ(ИдентификаторСтроки = Неопределено)
	
	ТаблицаТочек 		= Объект.ТочкиУчета;
	ТаблицаШкалы 		= Объект.ШкалыПриборовУчета;
	ТаблицаПоказания 	= Объект.ПоказанияПриборовУчета;
	
	Если ИдентификаторСтроки = Неопределено Тогда
		ТаблицаТочек.Очистить();
		ТаблицаШкалы.Очистить();
		ТаблицаПоказания.Очистить();
	Иначе
		ОтборыУдаления = Новый Структура("IDСтрокиТочкиУчета", ИдентификаторСтроки);
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТаблицаТочек		, Новый Структура("IDСтроки", ИдентификаторСтроки));
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТаблицаШкалы		, ОтборыУдаления);
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТаблицаПоказания	, ОтборыУдаления);
	КонецЕсли;    
	
КонецПроцедуры

&НаСервере
Функция ЕстьНеЗагруженныеДанные()
	Возврат Объект.НеЗагруженныеДанныеНеЗагруженныеПоказания.Количество() > 0;
КонецФункции 

#Область РаботаСКомандойЗаменаПриборовУчета

&НаКлиенте
Процедура ЗаменаПриборовУчета(Команда)
	
	ТекДанные = Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания.ТекущиеДанные;
	ПараметрыЛицевогоСчета = Неопределено;/////ОпределитьАктуальныеПараметрыЛицевогоСчета(ТекДанные);
	
	Абонент 	= НайтиАбонента(ПараметрыЛицевогоСчета.ЛицевойСчет);
	ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ");
	ЭлементыОтбора = Новый Структура("Абонент, ВидОперации", Абонент, ВидОперации);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Документ.энргОперацияСПриборомУчета.Форма.ФормаДокументаЗаменаПУ",ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиАбонента(ЛицевойСчет)
	Абонент = Справочники.энргАбоненты.НайтиПоРеквизиту("ЛицевойСчет", ЛицевойСчет);
	Возврат Абонент;
КонецФункции

#КонецОбласти  

#Область РаботаСКомандойИсключитьНенайденныеПУ

&НаКлиенте
Процедура ИсключитьПоказатьНенайденныеПУ(Команда)	
	
	ЭлементФормы = Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания;
	
	Скрыть 	= ЭлементФормы.ОтборСтрок = Неопределено;
	Префикс = "Скрыть";	
	Если Скрыть Тогда
		Префикс = "Показать";
		ЭлементФормы.ОтборСтрок = Новый ФиксированнаяСтруктура("СкрытьСтроку", Ложь);
	Иначе 
		ЭлементФормы.ОтборСтрок	= Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НеЗагруженныеДанныеНеЗагруженныеПоказанияИсключитьПоказатьНенайденныеПУ",
			"Заголовок",
			Префикс + " не найденные ПУ");
	
	//Если Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания.ОтборСтрок = Неопределено  Тогда
	//	Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания.ОтборСтрок	= Новый ФиксированнаяСтруктура("СкрытьСтроку", Ложь);	
	//Иначе
	//	Элементы.НеЗагруженныеДанныеНеЗагруженныеПоказания.ОтборСтрок	= Неопределено;	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти