#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ЭтоОплата",			Ложь);
	
	Ответственный 			= Пользователи.ТекущийПользователь();	
	энргДатаПоследнегоИзменения	= ТекущаяДата();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеЗадолженность 					= ПолучитьЗадолженность();
	
	ВыборкаЗадолженность  					= ДанныеЗадолженность.выбрать();
	
	Пока ВыборкаЗадолженность.следующий() цикл
		Запись 						= Движения.бестСуммаРеализации.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаЗадолженность);			
	КонецЦикла; 
				
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗадолженность()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестРеализацияЮрЛицаУслуги.Услуга КАК Услуга,
		|	СУММА(бестРеализацияЮрЛицаУслуги.Сумма) КАК Сумма,
		|	СУММА(бестРеализацияЮрЛицаУслуги.СуммаНДС) КАК СуммаНДС,
		|	бестРеализацияЮрЛицаУслуги.Поставщик КАК Поставщик,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Договор КАК Договор,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Организация КАК Организация,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Район КАК Район,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.ПериодНачисления КАК ПериодНачисления,
		|	бестРеализацияЮрЛицаУслуги.СтавкаНДС КАК СтавкаНДС,
		|	бестРеализацияЮрЛицаУслуги.НДСВнутри КАК НДСВнутри,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.бестРеализацияЮрЛица.Услуги КАК бестРеализацияЮрЛицаУслуги
		|ГДЕ
		|	бестРеализацияЮрЛицаУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бестРеализацияЮрЛицаУслуги.Поставщик,
		|	бестРеализацияЮрЛицаУслуги.Услуга,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Договор,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.ПериодНачисления,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Район,
		|	бестРеализацияЮрЛицаУслуги.СтавкаНДС,
		|	бестРеализацияЮрЛицаУслуги.НДСВнутри,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Организация,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли