
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьВходнымиДанными(); 
	РаботаСУстановкойСвойствЭлементовФормы();
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДиаметрСеченияВмм = ДиаметрСечения;
КонецПроцедуры

#Конецобласти 

#Область КомандыФормы

&НаКлиенте
Процедура Завершить(Команда)
	Закрыть(ПолучитьРезультат());
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат()
	КлючиДанных 		= ПолучитьКлючиЗаполнения();
	Результат 			= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, КлючиДанных.Реквизиты);
	ИдентификаторФормы 	= ЭтаФорма.УникальныйИдентификатор;
	Если Не РассчитыватьПотери Тогда
		Потери.Очистить();
	КонецЕсли;
	Результат.Потери 	= ПоместитьВоВременноеХранилище(Потери.Выгрузить(), ИдентификаторФормы);
	//Результат.Потери	= ОбщегоНазначения.ТаблицаЗначенийВМассив(Потери.Выгрузить());
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВходнымиДанными()
	ВызывающаяПодсистема 	= Параметры.ВходныеПараметры.ВызывающаяПодсистема;
	КлючиДанных 			= ПолучитьКлючиЗаполнения();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ВходныеПараметры, КлючиДанных.Реквизиты);
	Параметры.ВходныеПараметры.Свойство("ИспользоватьТарифныеЗоны", ИспользоватьТарифныеЗоны);
	ПотериРезультат = ПолучитьИзВременногоХранилища(Параметры.ВходныеПараметры.Потери);
	Потери.Загрузить(ПотериРезультат);
	//ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Параметры.ВходныеПараметры.Потери, Потери);
КонецПроцедуры

&НаСервере
Процедура РаботаСУстановкойСвойствЭлементовФормы()
	Если ВызывающаяПодсистема = "МКД" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НетВозможностиУстановкиПУ", "Заголовок", "Нет возможности установки ОДПУ");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Техническая", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетТолькоПоПоказаниям", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РассчитыватьПоДиаметру", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДиаметрСечения", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НазначениеПУ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетПоГрафикуГП", "Видимость", Ложь);
	ИначеЕсли ВызывающаяПодсистема = "ЮЛ" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетТолькоПоПоказаниям", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РассчитыватьПоДиаметру", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "tgφ", "Видимость", РассчитыватьРеактивнуюЭнергию);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НазначениеПУ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДлинаТрубы", "Видимость", Истина);
		Если ИспользоватьТарифныеЗоны Тогда
			//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПотериВидПотерь", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РассчитыватьПотери", "Видимость", Потери.Количество() > 0);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПотериТарифнаяЗона", "Видимость", Истина);
			Элементы.Потери.КоманднаяПанель.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Потери", "Видимость", РассчитыватьПотери);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючиЗаполнения()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияТехническихСвойствТУ(ВызывающаяПодсистема);
КонецФункции

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура РассчитыватьПотериПриИзменении(Элемент)
	Элементы.Потери.Видимость = РассчитыватьПотери;
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьРеактивнуюЭнергиюПриИзменении(Элемент)
	Элементы.tgφ.Видимость = РассчитыватьРеактивнуюЭнергию;
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ

&НаКлиенте
Процедура ПотериФиксированныйОбъемПотерьПриИзменении(Элемент)
	Если Не (ВызывающаяПодсистема = "ЮЛ" И ИспользоватьТарифныеЗоны) Тогда
		ТекСтрока = Элементы.Потери.ТекущиеДанные;
		ТекСтрока.ПроцентПотерь = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотериПроцентПотерьПриИзменении(Элемент)
	Если Не (ВызывающаяПодсистема = "ЮЛ" И ИспользоватьТарифныеЗоны) Тогда
		ТекСтрока = Элементы.Потери.ТекущиеДанные;
		ТекСтрока.ФиксированныйОбъемПотерь = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотериПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ВызывающаяПодсистема = "ЮЛ" И ИспользоватьТарифныеЗоны Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотериПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не (ВызывающаяПодсистема = "ЮЛ" И ИспользоватьТарифныеЗоны) И НоваяСтрока Тогда
		ТекСтрока = Элементы.Потери.ТекущиеДанные;
		ТекСтрока.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
