
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 	
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Для Каждого ТекСтрокаЗначенияНорм Из ЗначенияНормВода Цикл
		Движение 						= Движения.энргЗначениеНормПотребления.Добавить();
		Движение.Организация 			= Организация;
		Движение.Период 				= Дата;
		Движение.ВидБлагоустройства 	= ТекСтрокаЗначенияНорм.ВидБлагоустройства;
		Движение.ВидУслуги 				= ТекСтрокаЗначенияНорм.Услуга;
		Движение.ЗначениеНормы 			= ТекСтрокаЗначенияНорм.ЗначениеНормы;
	КонецЦикла;
	 	
	Для Каждого ТекСтрокаЗначенияНорм Из ЗначенияНормЭлектроэнергия Цикл
		Движение 						= Движения.энргЗначениеНормПотребленияЭлектроэнергия.Добавить();
		Движение.Период 				= Дата;
		Движение.Организация 			= Организация;
		Движение.ВидБлагоустройства 	= ТекСтрокаЗначенияНорм.ВидБлагоустройства;
		Движение.ВидУслуги 				= ТекСтрокаЗначенияНорм.Услуга;
		Движение.КоличествоКомнат 		= ТекСтрокаЗначенияНорм.КоличествоКомнат;
		Движение.КоличествоПрописанных	= ТекСтрокаЗначенияНорм.КоличествоПрописанных;
		Движение.ЗначениеНормы 			= ТекСтрокаЗначенияНорм.ЗначениеНормы;
	КонецЦикла;
	
	Для Каждого ТекСтрокаЗначенияНорм Из ЗначениеНормМКДВода Цикл
		Движение 						= Движения.энргЗначениеНормПотребленияМКД.Добавить();
		Движение.Период 				= Дата;
		Движение.Организация 			= Организация;
		Движение.ВидБлагоустройства 	= ТекСтрокаЗначенияНорм.ВидБлагоустройства;
		Движение.ВидУслуги 				= ТекСтрокаЗначенияНорм.Услуга;
		Движение.ЗначениеНормы 			= ТекСтрокаЗначенияНорм.ЗначениеНормы;
	КонецЦикла;

	Для Каждого ТекСтрокаЗначенияНорм Из ЗначениеНормМКДЭлектроэнергия Цикл
		Движение 						= Движения.энргЗначениеНормПотребленияМКДЭлектроэнергия.Добавить();
		Движение.Период 				= Дата;
		Движение.Организация 			= Организация;
		Движение.ВидБлагоустройства 	= ТекСтрокаЗначенияНорм.ВидБлагоустройства;
		Движение.ВидУслуги 				= ТекСтрокаЗначенияНорм.Услуга;
		Движение.Этажность 				= ТекСтрокаЗначенияНорм.Этажность;
		Движение.ЗначениеНормы 			= ТекСтрокаЗначенияНорм.ЗначениеНормы;
	КонецЦикла;  	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры

#КонецОбласти

#КонецЕсли