#Область ОбработчикиСобытий

Процедура ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета) Экспорт 
	
	ПараметрыОтрытия  	= Новый Структура;
	Если ДанныеДляПерерасчета.свойство("Ключ") тогда
		ПараметрыОтрытия.Вставить("Ключ",ДанныеДляПерерасчета.ключ);
	КонецЕсли;
	ПараметрыОтрытия.вставить("ЗаполнитьДокумент",			Истина);
	ПараметрыОтрытия.Вставить("ЗначенияЗаполнения",			ДанныеДляПерерасчета.ДанныеЗаполнения);
	ПараметрыОтрытия.Вставить("ДополнительныеПараметры",	ДанныеДляПерерасчета.ДополнительныеПараметры);
	ФормаФормулы  		= ОткрытьФорму("Документ.энргПерерасчет.ФормаОбъекта",ПараметрыОтрытия);	
	
КонецПроцедуры

Процедура ОткрытьФормуДокументаУстановкаФормулыРасчета(ДанныеДляФормулы) Экспорт 
	
	ПараметрыОтрытия  	= Новый Структура;
	Если ДанныеДляФормулы.свойство("Ключ") тогда
		ПараметрыОтрытия.Вставить("Ключ",ДанныеДляФормулы.ключ);
	КонецЕсли;
	ПараметрыОтрытия.вставить("ЗаполнитьДокумент",Истина);
	ПараметрыОтрытия.Вставить("ЗначенияЗаполнения",ДанныеДляФормулы.ДанныеЗаполнения);		
	ФормаФормулы  		= ОткрытьФорму("Документ.энргУстановитьФормулуРасчетаТочекУчета.Форма.ФормаДокумента",ПараметрыОтрытия);	
	
КонецПроцедуры


#КонецОбласти

#Область КонтрольИзмененияДатыФактическогоСобытия

Процедура ПроверитьКорректностьДатыФактическогоСобытияКлиент(Организация, Район, Дата, ДатаФактическогоСобытия) Экспорт
	
	КорректностьДатыФактическогоСобытия = энргРаботаСПериодомДействия.ПолучитьКорректностьДатыФактическогоСобытия(Организация, Район, Дата, ДатаФактическогоСобытия);
	
	Если Не КорректностьДатыФактическогоСобытия Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период даты факта должен быть меньше периода даты документа");	
		
	КонецЕсли;

	КонецПроцедуры

#КонецОбласти
