#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии Тогда 
		ПроверяемыеРеквизиты.Добавить("ТочкаУчета");
	ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии Тогда    
		ПроверяемыеРеквизиты.Добавить("ТочкиУчета");
	КонецЕсли;	
КонецПроцедуры
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы.энргРегистрацияПретензийОтПотребителяИсполнителя.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	//Документы.энргОперацияСПриборомУчета.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	//энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли