#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборЭлементов();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТипСИ = Перечисления.энргТипыСИ.ПУ;
	КонецЕсли;    
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТипСИ = Справочники.энргМаркиПриборовУчета.ПолучитьТипСИ(Объект.МаркаПУ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура бестМаркаПУПриИзменении(Элемент)
	бестМаркаПУПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипСИПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОтборЭлементов()
	ВидыЭнергииСредствИзмерения.Отбор.Элементы.Очистить();
	ЭлементОтбора 					= ВидыЭнергииСредствИзмерения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТипПрибораУчета");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	ПУ 		= (ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.ПУ"));
	ТТ 		= (ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.ТТ"));
	ТН 		= (ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.ТН"));
	УСПД 	= (ТипСИ = ПредопределенноеЗначение("Перечисление.энргТипыСИ.УСПД")); 
	
	ЭтоТрансформатор = ТН Или ТТ;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассТочности", "Видимость", НЕ ПУ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрПУ", "Видимость", ПУ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Примечание", "Видимость", ПУ ИЛИ УСПД);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрВидыЭнергииСИ", "Видимость", ПУ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрПУТех", "Видимость", ПУ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрТТ", "Видимость", ТН);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрТН", "Видимость", ТН);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДопустимаяНагрузкаВКлассеТочности", "Видимость", ЭтоТрансформатор);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РазрядностьДоЗапятой", "Видимость", НЕ ЭтоТрансформатор); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РазрядностьПослеЗапятой", "Видимость", НЕ ЭтоТрансформатор);
	//Элементы.ГруппаПУУСПД.Видимость 										= (ПУ ИЛИ УСПД);
	//Элементы.ГруппаУСПД.Видимость 										= УСПД;
	//Элементы.КлассТочности.Видимость 										= (ТТ ИЛИ ТН);
	//Элементы.рксДополнительныеРеквизитыНаименованиеПрибораУчета.Видимость = ПУ;
	//Элементы.Максимальный.Видимость 										= НЕ ПУ;
	//Элементы.рксДополнительныеРеквизитыМаксимальноеНапряжение.Видимость 	= НЕ ПУ;
КонецПроцедуры

&НаСервере
Процедура бестМаркаПУПриИзмененииНаСервере()
	МежповерочныйИнтервал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МаркаПУ, "МежповерочныйИнтервал"); 
	Объект.бестМежповерочныйИнтервал = ?(МежповерочныйИнтервал = Неопределено, 0, МежповерочныйИнтервал) * 12;
КонецПроцедуры

#КонецОбласти