#Область СобытияСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
			
	ТекСтрока = Элементы.Список.ТекущиеДанные;

	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	
	УстановитьОтборПоВсемДинамическимСпискам(ТекСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоВсемДинамическимСпискам(ТекСтрока)
	
	Если Не ТекСтрока.Свойство("Ссылка") Тогда
		ОбъектРасчета 	= Справочники.бестОбъектыРасчета.ПустаяСсылка(); 
	Иначе
		ОбъектРасчета = ТекСтрока.Ссылка;
	КонецЕсли;

	СтруктураДоговорОбъект	= Новый Структура("ОбъектРасчета", ОбъектРасчета);
	
	// состояние договора
	//ДобавитьОтбор(СостояниеДоговора, СтруктураДоговор);
	
	// состояние объекта
	ДобавитьОтбор(СостояниеОбъекта, СтруктураДоговорОбъект);
	
	// услуги
	ДобавитьОтбор(Услуги, СтруктураДоговорОбъект);
	
	// точки учета
	ДобавитьОтбор(ТочкиУчета, СтруктураДоговорОбъект);
	
	// приботы учета
	ДобавитьОтбор(ПриборыУчета, СтруктураДоговорОбъект);
	
	 // нагрузки
	ДобавитьОтбор(Нагрузки, СтруктураДоговорОбъект);
		
	// потребители ГВС
	ДобавитьОтбор(ПотребителиГВС, СтруктураДоговорОбъект);
	
	

КонецПроцедуры

Процедура ДобавитьОтбор(РеквизитФормы, СтруктураОтбора)
	РеквизитФормы.Отбор.Элементы.Очистить();
	Для Каждого ТекОтбор Из СтруктураОтбора Цикл
		ЭлементОтбора = РеквизитФормы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ТекОтбор.Ключ);
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ПравоеЗначение 	= ТекОтбор.Значение;
		ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти
