#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Задача", 						Задача);
	Параметры.Свойство("СледующийЭтап", 				СледующийЭтап);
	Параметры.Свойство("Абонент", 						Абонент);
	Параметры.Свойство("Организация", 					Организация);
	Параметры.Свойство("Договор", 						Договор);
	Параметры.Свойство("Район", 						Район);
	Если Параметры.Свойство("ПериодЗадолженностиКонец", ПериодЗадолженностиКонец) Тогда 
		ПериодЗадолженностиКонец = КонецДня(ПериодЗадолженностиКонец);
	КонецЕсли;
	
	ДатаЗадачи = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(Задача) Тогда
		ОбъектЗадача = Задача.ПолучитьОбъект();
		ЗначениеВРеквизитФормы(ОбъектЗадача, "Объект");
	КонецЕсли;
	ЗаполнитьТЗ_ПросроченнаяЗадолженность();
	ЗаполнитьТЗ_ФайлыДокументов();
	РольСледЭтапа = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(СледующийЭтап, "Роль");
	ЗаполнитьПользователей(Задача, РольСледЭтапа);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователей(Задача, РольСледЭтапа)
	//ЕстьСледЗадача = Истина;
	
	Если ЗначениеЗаполнено(Задача) Тогда
		СледЗадачаПомеченная 	= Задачи.энргЗадачаПИД.ПолучитьЗадачуПоОснованию(Задача);
		
		Если ЗначениеЗаполнено(СледЗадачаПомеченная) Тогда
			Пользователь		= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(СледЗадачаПомеченная, "Исполнитель");		
		КонецЕсли;
	КонецЕсли;  	
	
	//Элементы.Пользователь.Видимость 			= не ЕстьСледЗадача;	
	//Элементы.СрокВыполненияЗадачи.Видимость 	= ЕстьСледЗадача;	
	Элементы.Пользователь.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРолиПользователей.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.энргРолиПользователей КАК энргРолиПользователей
		|ГДЕ
		|	энргРолиПользователей.Роль = &Роль
		|	И энргРолиПользователей.Организация = &Организация
		|	И энргРолиПользователей.Район = &Район";
	
	Запрос.УстановитьПараметр("Роль", 			РольСледЭтапа);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Пользователь.СписокВыбора.Добавить(Выборка.Пользователь, Выборка.Пользователь);
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ПросроченнаяЗадолженностьПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПросроченнаяЗадолженностьПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	Для каждого СтрокаТЗ Из ПросроченнаяЗадолженность Цикл
		СтрокаТЗ.Флаг = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	Для каждого СтрокаТЗ Из ПросроченнаяЗадолженность Цикл
		СтрокаТЗ.Флаг = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДокументовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ФайлыДокументовНаименованиеФайла Тогда
		ТекСтрока = Элементы.ФайлыДокументов.ДанныеСтроки(ВыбраннаяСтрока);

		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекСтрока.Справочник, Неопределено, Этаформа.УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработкиКомандФормы
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьДосудебнуюРаботу(Команда) 
	
	ПарамЗактрытия		= Новый Структура("СледующийЭтап", СледующийЭтап);
	
	Если Элементы.Пользователь.Видимость Тогда
		Если не ЗначениеЗаполнено(Пользователь) Тогда
			ПоказатьПредупреждение(,"Заполните ""Пользователя"".");
			Возврат;
		КонецЕсли;
		ПарамЗактрытия.Вставить("Исполнитель"			, Пользователь);		 
	КонецЕсли;
	Если Элементы.СрокВыполненияЗадачи.Видимость Тогда		
		Если СрокВыполненияЗадачи = Дата(1,1,1) Тогда
			ПоказатьПредупреждение(,"Заполните ""Срок выполнения задачи"".");
			Возврат;
		КонецЕсли; 		
		ПарамЗактрытия.Вставить("ДатаСледЭтапа"	, СрокВыполненияЗадачи);
	КонецЕсли;
	
	ПериодЗадолженностиНачало = Неопределено;
	ПериодЗадолженностиКонец  = Неопределено;
	СуммаЗадолженности  = 0;
	МассивРегистраторов = Новый Массив;
	Для каждого СтрокаТЗ Из ПросроченнаяЗадолженность Цикл
		Если СтрокаТЗ.Флаг Тогда
			ЭлемМассива = Новый Структура("Услуга, ПериодНачисления, Задолженность");
			ЗаполнитьЗначенияСвойств(ЭлемМассива, СтрокаТЗ);
			МассивРегистраторов.Добавить(ЭлемМассива);
			СуммаЗадолженности = СуммаЗадолженности + СтрокаТЗ.Задолженность;
			
			НачМесяца = НачалоМесяца(СтрокаТЗ.ПериодНачисления);
			КонМесяца = КонецМесяца(СтрокаТЗ.ПериодНачисления);
			Если Не ЗначениеЗаполнено(ПериодЗадолженностиНачало) Тогда
				ПериодЗадолженностиНачало = НачМесяца;
				ПериодЗадолженностиКонец  = КонМесяца;
			ИначеЕсли ПериодЗадолженностиКонец < КонМесяца Тогда 
				ПериодЗадолженностиКонец  = КонМесяца;
			ИначеЕсли ПериодЗадолженностиНачало > НачМесяца Тогда 
				ПериодЗадолженностиНачало = НачМесяца;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПрикрепляемыеФайлы = Новый Массив;
	Для каждого СтрокаТЗ Из ФайлыДокументов Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.Справочник) И СтрокаТЗ.Прикрепить Тогда
			ПрикрепляемыеФайлы.Добавить(СтрокаТЗ.Справочник);
		КонецЕсли;
	КонецЦикла;
	
	ПарамЗактрытия.Вставить("Задолженность", 	 		 МассивРегистраторов);
	ПарамЗактрытия.Вставить("СуммаЗадолженности",		 СуммаЗадолженности);
	ПарамЗактрытия.Вставить("ПериодЗадолженностиНачало", ПериодЗадолженностиНачало);
	ПарамЗактрытия.Вставить("ПериодЗадолженностиКонец",  ПериодЗадолженностиКонец);
	ПарамЗактрытия.Вставить("ПрикрепляемыеФайлы",		 ПрикрепляемыеФайлы);
	ПарамЗактрытия.Вставить("ДатаУчётаНачислений",		 ДатаЗадачи);
	ПарамЗактрытия.Вставить("ЗавершитьДосудебнуюРаботу", Истина);
	Закрыть(ПарамЗактрытия);
КонецПроцедуры
#КонецОбласти

#Область ДополнительныеФункцииНаСервере
&НаСервере
Процедура ЗаполнитьТЗ_ПросроченнаяЗадолженность()
	ПросроченнаяЗадолженность.Очистить();
	
	СписокДолгов = Новый Массив;
	
	Для каждого СтрокаТЧ Из Объект.Задолженность Цикл
		СписокДолгов.Добавить(Новый Структура("ПериодНачисления, Услуга", СтрокаТЧ.ПериодНачисления, СтрокаТЧ.Услуга));
	КонецЦикла;
	
	ОсновПарам	 = "Организация, Район" + ?(ЗначениеЗаполнено(Договор), ", Договор", ", МКД, Абонент");
	ПарамЗапроса = Новый Структура(ОсновПарам);
	ЗаполнитьЗначенияСвойств(ПарамЗапроса, Объект);
	
	Если Объект.ЗадачаЮЛ Тогда
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьПоПериодам(Объект.Организация, Объект.Район, Объект.Договор, НачалоМесяца(Объект.ПериодЗадолженностиНачало), НачалоМесяца(Объект.ПериодЗадолженностиКонец));
	Иначе
		Результат = Задачи.энргЗадачаПИД.ПолучитьЗадолженность(СписокДолгов, ПарамЗапроса, Ложь);
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		ТаблицаЗадолженности = Результат.Выгрузить();
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из ТаблицаЗадолженности Цикл
		СтрокаТЗ = ПросроченнаяЗадолженность.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ);
		СтрокаТЗ.Флаг = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗ_ФайлыДокументов()
	
	Если ЗначениеЗаполнено(Абонент) Тогда 
		
		ИменаДокументов = Новый Структура;
		
		ПолучитьСписокДокументовСФайлами(ИменаДокументов);
		
		ФайлыДокументов.Очистить();
		
		СтартоваяЗадача = ?(ЗначениеЗаполнено(Задача.СтартоваяЗадача), Задача.СтартоваяЗадача, Задача);
		СписокДокументовЗадачи = ПолучитьСписокФайлов(СтартоваяЗадача);
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаДляПолученияФайловДокументов(ИменаДокументов);
		
		Запрос.УстановитьПараметр("Абонент", Абонент);
		Запрос.УстановитьПараметр("СписокОперацийМКД", ПолучитьСписокОперацийМКДПоАбоненту(Абонент));
		
		РезультатЗапроса 			= Запрос.Выполнить();	
		Выборка 					= РезультатЗапроса.Выбрать();
		
		// Влияет на начальное предупреждение!
		ЕстьДокументыОткрытияМКД 	= Ложь;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоДокументОткрытияМКД Тогда
				ЕстьДокументыОткрытияМКД 			= Истина;
				
				// Добавлено для начального предупреждения!
				Если Выборка.Обязательный Тогда
					ЕстьОбязательныеФайлыВОткрытииМКД 	= Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			// Проверка на 
			Отбор = Новый Структура("Размер, Расширение");
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			ХранилищеЗначений = Выборка.ДвоичныеДанныеФайла.Получить();
			Данные = Base64Строка(ХранилищеЗначений);
			СписокПохожихФайлов = СписокДокументовЗадачи.НайтиСтроки(Отбор);
			Дубль = Ложь;
			Для каждого ВозможныйАналог Из СписокПохожихФайлов Цикл
				Если ВозможныйАналог.Данные = Данные Тогда
					Дубль = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Дубль Тогда
				
				Продолжить;
				
			КонецЕсли;
			СтрокаФайла = СписокДокументовЗадачи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаФайла, Выборка);
			СтрокаФайла.Данные = Данные;
			
			СтрокаТЗ = ФайлыДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
			СтрокаТЗ.НаименованиеФайла = Выборка.Наименование + ?(ЗначениеЗаполнено(Выборка.Расширение),  "." + Выборка.Расширение, ""); 
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ТекстЗапросаДляПолученияФайловДокументов(Знач ИменаДокументов)
	
	Перем ИмяДок, ПрефиксДок, ПрефиксОбъединение, ТекстДок, ТекстЗапроса, ТекстЗапросовДокументов, ТекстЗапросовОбъединение, ТекстОбъед;
	
	ТекстЗапросовДокументов = "";
	ПрефиксДок = "";
	ТекстЗапросовОбъединение = "";
	ПрефиксОбъединение = "";
	Для каждого ИмяДок Из ИменаДокументов Цикл
		ТекстДок = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_энргОперацияСЛицевымСчетом
		|ИЗ
		|	Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
		|ГДЕ
		|	энргОперацияСЛицевымСчетом.Абонент = &Абонент
		|	И НЕ энргОперацияСЛицевымСчетом.ПометкаУдаления";
		
		ТекстДок = СтрЗаменить(ТекстДок, "Документ.энргОперацияСЛицевымСчетом", "Документ." + ИмяДок.Ключ);
		ТекстДок = СтрЗаменить(ТекстДок, "ВТ_энргОперацияСЛицевымСчетом", "ВТ_" + ИмяДок.Ключ);
		
		ТекстЗапросовДокументов = ТекстЗапросовДокументов + ПрефиксДок + ТекстДок;
		
		Если ПустаяСтрока(ПрефиксОбъединение) Тогда
			ТекстОбъед =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Ссылка КАК Справочник,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Наименование КАК Наименование,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Расширение КАК Расширение,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
			|	ВТ_Документ.Ссылка КАК Документ,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ИндексКартинки КАК ИндексКартинки,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Размер КАК Размер,
			|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла,
			|	ЛОЖЬ КАК ЭтоДокументОткрытияМКД,
			|	ЛОЖЬ КАК Обязательный
			|ИЗ
			|	ВТ_энргОперацияСЛицевымСчетом КАК ВТ_Документ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргОперацияСЛицевымСчетомПрисоединенныеФайлы КАК энргОперацияСЛицевымСчетомПрисоединенныеФайлы
			|		ПО ВТ_Документ.Ссылка = энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ВладелецФайла
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
			|		ПО (энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Ссылка = ДвоичныеДанныеФайлов.Файл)
			|ГДЕ
			|	НЕ энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ПометкаУдаления";
		Иначе
			ТекстОбъед =
			"ВЫБРАТЬ
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Ссылка КАК Ссылка,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Наименование КАК Наименование,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Расширение КАК Расширение,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
			|	ВТ_Документ.Ссылка КАК Ссылка1,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ИндексКартинки КАК ИндексКартинки,
			|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Размер КАК Размер,
			|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла,
			|	ЛОЖЬ КАК Поле1,
			|	ЛОЖЬ КАК Обязательный
			|ИЗ
			|	ВТ_энргОперацияСЛицевымСчетом КАК ВТ_Документ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргОперацияСЛицевымСчетомПрисоединенныеФайлы КАК энргОперацияСЛицевымСчетомПрисоединенныеФайлы
			|		ПО ВТ_Документ.Ссылка = энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ВладелецФайла
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
			|		ПО (энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Ссылка = ДвоичныеДанныеФайлов.Файл)
			|ГДЕ
			|	НЕ энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ПометкаУдаления";		
			
			
		КонецЕсли;
		
		ТекстОбъед = СтрЗаменить(ТекстОбъед, "Справочник.энргОперацияСЛицевымСчетомПрисоединенныеФайлы", "Справочник." + ИмяДок.Значение);
		ТекстОбъед = СтрЗаменить(ТекстОбъед, "ВТ_энргОперацияСЛицевымСчетом", "ВТ_" + ИмяДок.Ключ);
		
		ТекстЗапросовОбъединение = ТекстЗапросовОбъединение + ПрефиксОбъединение + ТекстОбъед;
		
		ПрефиксДок = 
		"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		ПрефиксОбъединение =
		"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////
	// Добавляем файлы из документа "Операции с МКД" в случае, если абонент привязан к МКД 
	ТекстЗапросовОбъединение = ТекстЗапросовОбъединение + ПрефиксОбъединение + ПолучитьТекстЗапросаДляПолученияФайлов_энргОткрытиеМКД();
	
	ТекстЗапроса = ТекстЗапросовДокументов + ПрефиксДок + ТекстЗапросовОбъединение;
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Процедура ПолучитьСписокДокументовСФайлами(ИменаДокументов)
	
	Перем МетаданныеДокумента, МетаданныеСправочника, МетаДок, МетаСпр, Реквизит, РеквизитДок, Тип;
	
	Тип = Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип;
	МетаСпр = Метаданные.Справочники;
	МетаДок = Метаданные.Документы;
	Для каждого МетаданныеСправочника Из МетаСпр Цикл
		
		Если Тип.СодержитТип(Тип("СправочникСсылка." + МетаданныеСправочника.Имя)) Тогда
			Реквизит = МетаданныеСправочника.Реквизиты.Найти("ВладелецФайла");
			Если Реквизит = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого МетаданныеДокумента Из МетаДок Цикл
				Если Реквизит.Тип.СодержитТип(Тип("ДокументСсылка." + МетаданныеДокумента.Имя)) Тогда
					РеквизитДок = МетаданныеДокумента.Реквизиты.Найти("Абонент");
					
					Если РеквизитДок <> Неопределено Тогда
						ИменаДокументов.Вставить(МетаданныеДокумента.Имя, МетаданныеСправочника.Имя);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокФайлов(СтартоваяЗадача)
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Расширение");
	Результат.Колонки.Добавить("Размер");
	Результат.Колонки.Добавить("Данные");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДПрисоединенныеФайлы.Расширение КАК Расширение,
		|	энргЗадачаПИДПрисоединенныеФайлы.Размер КАК Размер,
		|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
		|ИЗ
		|	Справочник.энргЗадачаПИДПрисоединенныеФайлы КАК энргЗадачаПИДПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|		ПО энргЗадачаПИДПрисоединенныеФайлы.Ссылка = ДвоичныеДанныеФайлов.Файл
		|ГДЕ
		|	энргЗадачаПИДПрисоединенныеФайлы.ВладелецФайла = &СтартоваяЗадача";
	
	Запрос.УстановитьПараметр("СтартоваяЗадача", СтартоваяЗадача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
		
		ХранилищеЗначений = Выборка.ДвоичныеДанныеФайла.Получить();
		СтрокаТЗ.Данные = Base64Строка(ХранилищеЗначений);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Для каждого ИмяФайла Из УдаляемыеФайлы Цикл
		Попытка
			УдалитьФайлы(ИмяФайла.Значение);
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаДляПолученияФайлов_энргОткрытиеМКД()
	
	Возврат 
	"ВЫБРАТЬ
	|	энргОткрытиеМКДПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	энргОткрытиеМКДПрисоединенныеФайлы.Наименование КАК Наименование,
	|	энргОткрытиеМКДПрисоединенныеФайлы.Расширение КАК Расширение,
	|	энргОткрытиеМКДПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	энргОткрытиеМКД.Ссылка КАК Ссылка1,
	|	энргОткрытиеМКДПрисоединенныеФайлы.ИндексКартинки КАК ИндексКартинки,
	|	энргОткрытиеМКДПрисоединенныеФайлы.Размер КАК Размер,
	|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла,
	|	ИСТИНА КАК Поле1,
	|	энргОткрытиеМКДПрисоединенныеФайлы.Обязательный КАК Обязательный
	|ИЗ
	|	Документ.энргОткрытиеМКД КАК энргОткрытиеМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргОткрытиеМКДПрисоединенныеФайлы КАК энргОткрытиеМКДПрисоединенныеФайлы
	|		ПО энргОткрытиеМКД.Ссылка = энргОткрытиеМКДПрисоединенныеФайлы.ВладелецФайла
	|			И (энргОткрытиеМКДПрисоединенныеФайлы.Обязательный)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
	|		ПО (энргОткрытиеМКДПрисоединенныеФайлы.Ссылка = ДвоичныеДанныеФайлов.Файл)
	|ГДЕ
	|	НЕ энргОткрытиеМКДПрисоединенныеФайлы.ПометкаУдаления
	|	И энргОткрытиеМКД.Ссылка В(&СписокОперацийМКД)";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокОперацийМКДПоАбоненту(Абонент)
	
	МассивДокументов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Строение КАК Строение
		|ПОМЕСТИТЬ СписокСтроенийПоКлючу
		|ИЗ
		|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.КлючПомещения = &КлючПомещения
		|	И энргКлючиПомещений.Строение.ТипСтроения = ЗНАЧЕНИЕ(Перечисление.энргТипыСтроений.МКД)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(энргСостояниеМКДСрезПоследних.Регистратор КАК Документ.энргОткрытиеМКД) КАК Ссылка
		|ИЗ
		|	РегистрСведений.энргСостояниеМКД.СрезПоследних(
		|			,
		|			МКД В
		|				(ВЫБРАТЬ
		|					СписокСтроенийПоКлючу.Строение
		|				ИЗ
		|					СписокСтроенийПоКлючу КАК СписокСтроенийПоКлючу)) КАК энргСостояниеМКДСрезПоследних
		|ГДЕ
		|	энргСостояниеМКДСрезПоследних.Состояние";
	
	Запрос.УстановитьПараметр("КлючПомещения", Абонент.КлючПомещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

#КонецОбласти
