
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаАнализаТекущейЗадолженности = ТекущаяДата();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ФактическаяЗадолженность,"Организация", 	Объект.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ФактическаяЗадолженность,"Район", 		Объект.Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ФактическаяЗадолженность,"Период", 		ДатаАнализаТекущейЗадолженности);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АвансоваяЗадолженность,"Организация", 	Объект.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АвансоваяЗадолженность,"Район", 			Объект.Район);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АвансоваяЗадолженность,"Период", 		ДатаАнализаТекущейЗадолженности);
	УстановитьПериодНачисления();
	
	бестЛокализацияСервер.ПриСозданииНаСервере_энргЗадачаПИД(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ДатаАнализаТекущейЗадолженностиПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ФактическаяЗадолженность,"Период", 	ДатаАнализаТекущейЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АвансоваяЗадолженность,"Период", 	ДатаАнализаТекущейЗадолженности);
	УстановитьПериодНачисления();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПериодНачисления()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АвансоваяЗадолженность,"ПериодНачисления", 		Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДатаАнализаТекущейЗадолженности, Объект.Организация,Объект.Район));
КонецПроцедуры

#КонецОбласти
