#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьНаСервереМодуль(Текст, ТекПараметры) Экспорт
	
	Запрос	= Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Текпараметры.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	БанковскиеСчета.НомерСчета КАК НомерСчета
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ПО БанковскиеСчета.Владелец = Организации.Ссылка
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	БанковскиеСчета.НомерСчета,
	|	Организации.Ссылка,
	|	Организации.ИНН,
	|	Организации.КПП";
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	Выборка.Следующий();
	Текпараметры.Вставить("ИНН", Выборка.ИНН);
	Текпараметры.Вставить("НомерСчета", Выборка.НомерСчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Текпараметры.Организация);
	Запрос.УстановитьПараметр("Дата", 		Текпараметры.ПериодНачисления);
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Ссылка,
	               |	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	               |	энргАбонентыКонтактнаяИнформация.Представление КАК Представление,
	               |	энргАбоненты.Организация КАК Организация,
	               |	энргАбоненты.Район КАК Район,
	               |	энргАбоненты.Наименование КАК Наименование,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение
	               |ПОМЕСТИТЬ ВрТ0
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	               |		ПО (энргАбонентыКонтактнаяИнформация.Ссылка = энргАбоненты.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
	               |ГДЕ
	               |	НЕ энргАбоненты.ПометкаУдаления
	               |	И энргАбоненты.Организация = &Организация
	               |	И НЕ энргАбоненты.ЭтоГруппа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргАбоненты.Ссылка,
	               |	энргАбоненты.ЛицевойСчет,
	               |	энргАбонентыКонтактнаяИнформация.Представление,
	               |	энргАбоненты.Организация,
	               |	энргАбоненты.Район,
	               |	энргАбоненты.Наименование,
	               |	энргКлючиПомещений.Строение,
	               |	энргКлючиПомещений.Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ0.Ссылка КАК Абонент,
	               |	ВрТ0.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВЫРАЗИТЬ(ВрТ0.Представление КАК СТРОКА(300)) КАК Адрес,
	               |	ВрТ0.Организация КАК Организация,
	               |	ВрТ0.Район КАК Район,
	               |	ВрТ0.Наименование КАК Наименование,
	               |	ВрТ0.Строение КАК Строение,
	               |	ВрТ0.Помещение КАК Помещение
	               |ПОМЕСТИТЬ ВрТ1
	               |ИЗ
	               |	ВрТ0 КАК ВрТ0
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеЛС.СрезПоследних(&Дата, ) КАК энргСостояниеЛССрезПоследних
	               |		ПО ВрТ0.Ссылка = энргСостояниеЛССрезПоследних.Абонент
	               |			И ВрТ0.Организация = энргСостояниеЛССрезПоследних.Организация
	               |			И ВрТ0.Район = энргСостояниеЛССрезПоследних.Район
	               |			И (энргСостояниеЛССрезПоследних.Состояние)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТ0.Ссылка,
	               |	ВрТ0.ЛицевойСчет,
	               |	ВЫРАЗИТЬ(ВрТ0.Представление КАК СТРОКА(300)),
	               |	ВрТ0.Организация,
	               |	ВрТ0.Район,
	               |	ВрТ0.Наименование,
	               |	ВрТ0.Строение,
	               |	ВрТ0.Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.Абонент КАК Абонент,
	               |	ВрТ1.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВрТ1.Адрес КАК Адрес,
	               |	ЕСТЬNULL(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток, 0) КАК Сумма,
	               |	ВрТ1.Наименование КАК АбонентСтрока,
	               |	ВрТ1.Строение КАК Строение,
	               |	ВрТ1.Помещение КАК Помещение
	               |ПОМЕСТИТЬ ВрТ2
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(&Дата, ) КАК энргВзаиморасчетыПоМесяцамОстатки
	               |		ПО ВрТ1.Абонент = энргВзаиморасчетыПоМесяцамОстатки.Абонент
	               |			И ВрТ1.Организация = энргВзаиморасчетыПоМесяцамОстатки.Организация
	               |			И ВрТ1.Район = энргВзаиморасчетыПоМесяцамОстатки.Район
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ2.Абонент КАК Абонент,
	               |	ВрТ2.ЛицевойСчет КАК ЛицевойСчет,
	               |	СУММА(ВрТ2.Сумма) КАК Сумма,
	               |	ВрТ2.АбонентСтрока КАК АбонентСтрока,
	               |	ВЫБОР
	               |		КОГДА ВрТ2.Адрес = """"
	               |				ИЛИ ВрТ2.Адрес ЕСТЬ NULL
	               |			ТОГДА ЕСТЬNULL(энргСтроения.Наименование, """") + "", "" + ЕСТЬNULL(энргПомещения.Наименование, """")
	               |		ИНАЧЕ ВрТ2.Адрес
	               |	КОНЕЦ КАК Адрес,
	               |	энргСтроения.ДомДляСортировки КАК ДомДляСортировки,
	               |	энргПомещения.НомерДляСортировки КАК НомерДляСортировки,
	               |	энргПомещения.Ссылка КАК Ссылка,
	               |	энргСтроения.Ссылка КАК Ссылка1
	               |ИЗ
	               |	ВрТ2 КАК ВрТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	               |		ПО ВрТ2.Строение = энргСтроения.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	               |		ПО ВрТ2.Помещение = энргПомещения.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргСтроения.ДомДляСортировки,
	               |	ВрТ2.АбонентСтрока,
	               |	ВрТ2.Абонент,
	               |	ВрТ2.ЛицевойСчет,
	               |	энргПомещения.НомерДляСортировки,
	               |	энргПомещения.Ссылка,
	               |	энргСтроения.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ВрТ2.Адрес = """"
	               |				ИЛИ ВрТ2.Адрес ЕСТЬ NULL
	               |			ТОГДА ЕСТЬNULL(энргСтроения.Наименование, """") + "", "" + ЕСТЬNULL(энргПомещения.Наименование, """")
	               |		ИНАЧЕ ВрТ2.Адрес
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДомДляСортировки,
	               |	НомерДляСортировки
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Тело		= "";
	Пока Выборка.Следующий() ЦИкл
		Тело = Тело + Строка(Выборка.ЛицевойСчет) + ";" + СОКРЛ(Строка(Выборка.АбонентСтрока)) + ";" + Строка(Выборка.Адрес) + ";" + Строка(Формат(ТекПараметры.ПериодНачисления, "ДФ=MMyy")) + ";" + СтрЗаменить(Строка(Выборка.Сумма), Символы.НПП, "") + ";" + Символы.ПС; 		
	КонецЦикла;
	
	Тело		= СОКРЛП(Тело);
	
	Текст.ДобавитьСтроку(Тело);	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли