#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуНаборомЗаписей(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуНаборомЗаписей());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Период, Организация,Район,Строение,Помещение,ЧастныйСектор,Абонент,ТочкаУчета";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ВыводыПУБезПоказаний",Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуНаборомЗаписей()
	
	Текст =
	"ВЫБРАТЬ
	|	ВыводыПУБезПоказаний.*
	|ИЗ
	|	РегистрСведений.энргВыводыПУБезПоказаний КАК ВыводыПУБезПоказаний";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли