#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

// Заполняет стабильные периоды.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СтабильныеПериоды(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтабильныеПериоды());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= Новый Структура("СтабильныеПериоды", "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, НомерПозиции, ПериодРегистрации, ДатаРегистратора, ДокРегистратор");
		ДоступныеПараметры.Вставить("энргКлючиПомещений", "КлючПомещения");
		ИмяТаблицы 					= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет стабильные периоды шкалы.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СтабильныеПериодыШкалы(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтабильныеПериодыШкалы());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];
	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;

	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, ТочкаУчета, НомерПозиции";
		ИмяТаблицы 					= "СтабильныеПериодыШкалы";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет стабильные периоды измерители направлений.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СтабильныеПериодыИзмерителиНаправлений(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтабильныеПериодыИзмерители());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];
	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, ТочкаУчета, НомерПозиции";
		ИмяТаблицы 					= "СтабильныеПериодыИзмерители";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет состояние на границу нарушения послеледовательности.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СостояниеНаГраницуНарушенияПослеледовательности(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт 
	перем Пакет;
	
	НомераПозицийНаГраницуНарушенияПоследовательности(Схема,Параметры,"НомерПозицийГраница");
	
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСостояниеНаГраницуНарушенияПоследовательности());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	
	ДоступныеПоляОтбора 					= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Услуга,ТочкаУчета";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"СтабильныеПериоды",Параметры, ДоступныеПоляОтбора);		
	   	                           	
	ДоступныеПоляОтбора 					= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,ТочкаУчета";
	ПакетШкалы								= Схема.ПакетЗапросов.Добавить();	
	ПакетШкалы.УстановитьТекстЗапроса(ТекстЗапросаСостояниеШкалНаГраницуНарушенияПоследовательности());
	ПакетШкалы.ТаблицаДляПомещения 			= ТаблицаДляПомещения + "Шкалы";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ПакетШкалы.Операторы[0].Отбор,"СтабильныеПериодыШкалы",Параметры, ДоступныеПоляОтбора);
	
	ДоступныеПоляОтбора 					= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,ТочкаУчета";
	ПакетИзмерители							= Схема.ПакетЗапросов.Добавить();	
	ПакетИзмерители.УстановитьТекстЗапроса(ТекстЗапросаСостояниеИзмерителейНаГраницуНарушенияПоследовательности());
	ПакетИзмерители.ТаблицаДляПомещения 	= ТаблицаДляПомещения + "ИзмерителиНаправлений";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ПакетИзмерители.Операторы[0].Отбор,"СтабильныеПериодыИзмерители",Параметры, ДоступныеПоляОтбора);
	
КонецПроцедуры

// Заполняет состояние на начало периода начисления.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СостояниеНаНачалоПериодаНачисления(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт 
	перем Пакет;
		
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСостояниеНаНачалоПериодаНачисления());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	
	ДоступныеПоляОтбора 					= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Услуга,ТочкаУчета";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"СтабильныеПериоды",Параметры, ДоступныеПоляОтбора);		
	   	                           	
	ДоступныеПоляОтбора 					= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,ТочкаУчета";
	ПакетШкалы								= Схема.ПакетЗапросов.Добавить();	
	ПакетШкалы.УстановитьТекстЗапроса(ТекстЗапросаСостояниеШкалНаНачалоПериодаНачисления());
	ПакетШкалы.ТаблицаДляПомещения 			= ТаблицаДляПомещения + "Шкалы";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ПакетШкалы.Операторы[0].Отбор,"СтабильныеПериодыШкалы",Параметры, ДоступныеПоляОтбора);
	
	ДоступныеПоляОтбора 					= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,ТочкаУчета";
	ПакетИзмерители							= Схема.ПакетЗапросов.Добавить();	
	ПакетИзмерители.УстановитьТекстЗапроса(ТекстЗапросаСостояниеИзмерителейНаНачалоПериодаНачисления());
	ПакетИзмерители.ТаблицаДляПомещения 	= ТаблицаДляПомещения + "ИзмерителиНаправлений";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ПакетИзмерители.Операторы[0].Отбор,"СтабильныеПериодыИзмерители",Параметры, ДоступныеПоляОтбора);
	
КонецПроцедуры

// Очищает наборы.
//
// Параметры:
//  Параметры	-	Структура.
//
Процедура ОчиститьНаборы(Параметры) Экспорт 
	
	Набор 							= РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
	Набор.Отбор.ДокРегистратор.Установить(Параметры.ДокРегистратор);
	Набор.Отбор.Организация.Установить(Параметры.Организация);
	Набор.Отбор.ПериодНачисления.Установить(Параметры.ПериодНачисления);
	Набор.Отбор.Район.Установить(Параметры.Район);
	Набор.Отбор.ЧастныйСектор.Установить(Параметры.ЧастныйСектор);
	Набор.Отбор.Строение.Установить(Параметры.Строение);
	Набор.Отбор.Помещение.Установить(Параметры.Помещение);
	Набор.Записать();
	
	НаборШкалы 						= РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
	НаборШкалы.Отбор.ДокРегистратор.Установить(Параметры.ДокРегистратор);
	НаборШкалы.Отбор.Организация.Установить(Параметры.Организация);
	НаборШкалы.Отбор.ПериодНачисления.Установить(Параметры.ПериодНачисления);
	НаборШкалы.Отбор.Район.Установить(Параметры.Район);
	НаборШкалы.Отбор.ЧастныйСектор.Установить(Параметры.ЧастныйСектор);
	НаборШкалы.Отбор.Строение.Установить(Параметры.Строение);
	НаборШкалы.Отбор.Помещение.Установить(Параметры.Помещение);
	НаборШкалы.Записать();
	
	НаборИзмерители 					= РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
	НаборИзмерители.Отбор.ДокРегистратор.Установить(Параметры.ДокРегистратор);
	НаборИзмерители.Отбор.Организация.Установить(Параметры.Организация);
	НаборИзмерители.Отбор.ПериодНачисления.Установить(Параметры.ПериодНачисления);
	НаборИзмерители.Отбор.Район.Установить(Параметры.Район);
	НаборИзмерители.Отбор.ЧастныйСектор.Установить(Параметры.ЧастныйСектор);
	НаборИзмерители.Отбор.Строение.Установить(Параметры.Строение);
	НаборИзмерители.Отбор.Помещение.Установить(Параметры.Помещение);
	НаборИзмерители.Записать(); 

КонецПроцедуры

// Заполняет номера позиций на границу нарушения последовательности.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НомераПозицийНаГраницуНарушенияПоследовательности(Схема,Параметры,ТаблицаДляПомещения)
	перем Пакет;
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНомераПозицийНаГраницуНарушенияПоследовательности());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
	ДоступныеПоляОтбора 			= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Услуга,ТочкаУчета";
	энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"СтабильныеПериоды",Параметры,ДоступныеПоляОтбора);		
		
КонецПроцедуры

// Заполняет значение индивидуальных площадей МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеИндивидуальныхПлощадейМКД(Схема, Параметры, ТаблицаДляПомещения="") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначениеИндивидуальныхПлощадейМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		
		ДоступныеПараметры 	= "Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Услуга";
		ИмяТаблицы 			= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(
			ОператорВыбора.Отбор,
			ИмяТаблицы,
			Параметры.ПараметрыВТ,
			ДоступныеПараметры);
		
		// Определить свойство МКД	
		Для Сч = 0 По Параметры.ПараметрыВТ.ВГраница() Цикл
			
			Если Параметры.ПараметрыВТ[Сч].СоотвествиеПолей.Свойство("МКД") Тогда				
				СоотвествиеПолей 	= Новый Структура("Строение", Параметры.ПараметрыВТ[Сч].СоотвествиеПолей["МКД"]);
				ОтборМКД 			= Новый Структура("ТипПараметра,СоотвествиеПолей", Параметры.ПараметрыВТ[Сч].ТипПараметра, СоотвествиеПолей);
							
				МассивОтбора = Новый Массив;
				МассивОтбора.Добавить(ОтборМКД);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(
					ОператорВыбора.Отбор,
					ИмяТаблицы,
					МассивОтбора,
					ДоступныеПараметры);
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;				
		
		// Отбор значения площадей
		ДоступныеПараметры = "Организация, Район, КлючПомещения, ВидПлощади";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			ОператорВыбора.Источники[2].Источник.Параметры[1],
			Параметры.ПараметрыВТ,
			ДоступныеПараметры);		
		
	КонецЕсли;

КонецПроцедуры

// Заполняет наличие приборов учета с начала года.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НаличиеПриборовУчетаСНачалаГода(Схема,Параметры,ТаблицаДляПомещения="") Экспорт 
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаличиеПриборовУчетаСНачалаГода());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ЕстьОтборПоКлючамПомещений") И Параметры.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район,ЧастныйСектор,Строение,Помещение,Услуга";
		ИмяТаблицы 					= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
КонецПроцедуры

// Заполняет значение индивидуальных площадей коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеИндивидуальныхПлощадейКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт  
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначениеИндивидуальныхПлощадейКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Услуга";
		ИмяТаблицы 					= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
			
КонецПроцедуры

// Заполняет точки учета с изменившимся состояние прибора учета.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТочкиУчетаСИзменившимсяСостояниеПрибораУчета(Схема,Параметры,ТаблицаДляПомещения="") Экспорт  
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАбонентыНаНачалоПериодаРасчета());
	Пакет.ТаблицаДляПомещения 		= "АбонентыНаНачалоПериодаРасчета";
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
		
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета";
		ИмяТаблицы 					= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли; 	
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТочкиУчетаСИзменившимсяСостояниемПрибораУчета());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
		
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета";
		ИмяТаблицы 					= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет ключи нормативов на конец периода расчета.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура КлючиНормативовНаКонецПериодаРасчета(Схема,Параметры,ТаблицаДляПомещения="") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаМаксимальныеНомераПозицийВПериодеНачисления());
	Пакет.ТаблицаДляПомещения 		= "МаксимальныеНомераПозиций";
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
		
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, НомерПозиции, ПериодРегистрации, ДатаРегистратора, ДокРегистратор";
		ИмяТаблицы 					= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКлючиНормативовНаКонецПериодаРасчета());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаСостояниеНаГраницуНарушенияПоследовательности()
	Текст  = 	
	"ВЫБРАТЬ
	|*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|ГДЕ
	|	(СтабильныеПериоды.Организация, СтабильныеПериоды.ПериодНачисления, СтабильныеПериоды.Район, СтабильныеПериоды.ЧастныйСектор, СтабильныеПериоды.Строение, СтабильныеПериоды.Помещение, СтабильныеПериоды.Услуга, СтабильныеПериоды.ТочкаУчета, СтабильныеПериоды.НомерПозиции) В
	|			(ВЫБРАТЬ
	|				НомерПозицийГраница.Организация,
	|				НомерПозицийГраница.ПериодНачисления,
	|				НомерПозицийГраница.Район,
	|				НомерПозицийГраница.ЧастныйСектор,
	|				НомерПозицийГраница.Строение,
	|				НомерПозицийГраница.Помещение,
	|				НомерПозицийГраница.Услуга,
	|				НомерПозицийГраница.ТочкаУчета,
	|				НомерПозицийГраница.НомерПозиции
	|			ИЗ
	|				НомерПозицийГраница КАК НомерПозицийГраница)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСостояниеШкалНаГраницуНарушенияПоследовательности() 
	
	Текст  = 	
	"ВЫБРАТЬ
	|*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|ГДЕ
	|	(СтабильныеПериодыШкалы.Организация, СтабильныеПериодыШкалы.ПериодНачисления, СтабильныеПериодыШкалы.Район, СтабильныеПериодыШкалы.ЧастныйСектор, СтабильныеПериодыШкалы.Строение, СтабильныеПериодыШкалы.Помещение, СтабильныеПериодыШкалы.ТочкаУчета, СтабильныеПериодыШкалы.НомерПозиции) В
	|			(ВЫБРАТЬ
	|				НомерПозицийГраница.Организация,
	|				НомерПозицийГраница.ПериодНачисления,
	|				НомерПозицийГраница.Район,
	|				НомерПозицийГраница.ЧастныйСектор,
	|				НомерПозицийГраница.Строение,
	|				НомерПозицийГраница.Помещение,
	|				НомерПозицийГраница.ТочкаУчета,
	|				НомерПозицийГраница.НомерПозиции
	|			ИЗ
	|				НомерПозицийГраница КАК НомерПозицийГраница)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСостояниеИзмерителейНаГраницуНарушенияПоследовательности() 
	
	Текст  = 	
	"ВЫБРАТЬ
	|*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК СтабильныеПериодыИзмерители
	|ГДЕ
	|	(СтабильныеПериодыИзмерители.Организация, СтабильныеПериодыИзмерители.ПериодНачисления, СтабильныеПериодыИзмерители.Район, СтабильныеПериодыИзмерители.ЧастныйСектор, СтабильныеПериодыИзмерители.Строение, СтабильныеПериодыИзмерители.Помещение, СтабильныеПериодыИзмерители.ТочкаУчета, СтабильныеПериодыИзмерители.НомерПозиции) В
	|			(ВЫБРАТЬ
	|				НомерПозицийГраница.Организация,
	|				НомерПозицийГраница.ПериодНачисления,
	|				НомерПозицийГраница.Район,
	|				НомерПозицийГраница.ЧастныйСектор,
	|				НомерПозицийГраница.Строение,
	|				НомерПозицийГраница.Помещение,
	|				НомерПозицийГраница.ТочкаУчета,
	|				НомерПозицийГраница.НомерПозиции
	|			ИЗ
	|				НомерПозицийГраница КАК НомерПозицийГраница)";
	
	Возврат Текст;

	
КонецФункции

Функция ТекстЗапросаСтабильныеПериоды() 
	
	Текст = 
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериоды.НомерПозиции КАК НомерПозиции,
	|	ВЫБОР
	|		КОГДА СтабильныеПериоды.ПериодРегистрации < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ СтабильныеПериоды.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации,
	|	СтабильныеПериоды.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериоды.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериоды.УдалитьАбонент КАК УдалитьАбонент,
	|	СтабильныеПериоды.Абонент КАК Абонент,
	|	СтабильныеПериоды.БлокировочныйАкт КАК БлокировочныйАкт,
	|	СтабильныеПериоды.ВидБлагоустройства КАК ВидБлагоустройства,
	|	СтабильныеПериоды.ВидСобственности КАК ВидСобственности,
	|	СтабильныеПериоды.ДатаПоверки КАК ДатаПоверки,
	|	СтабильныеПериоды.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	СтабильныеПериоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	СтабильныеПериоды.ДиаметрСечения КАК ДиаметрСечения,
	|	СтабильныеПериоды.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	СтабильныеПериоды.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	СтабильныеПериоды.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	СтабильныеПериоды.ЗначениеПлощади КАК ЗначениеПлощади,
	|	СтабильныеПериоды.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	СтабильныеПериоды.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериоды.КлючСоцНорматива КАК КлючСоцНорматива,
	|	СтабильныеПериоды.КоличествоЖильцов КАК КоличествоЖильцов,
	|	СтабильныеПериоды.КоличествоКомнат КАК КоличествоКомнат,
	|	СтабильныеПериоды.КоличествоПроживающих КАК КоличествоПроживающих,
	|	СтабильныеПериоды.КоличествоПрописанных КАК КоличествоПрописанных,
	|	СтабильныеПериоды.КоличествоСобственников КАК КоличествоСобственников,
	|	СтабильныеПериоды.КоэффициентПУ КАК КоэффициентПУ,
	|	СтабильныеПериоды.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	СтабильныеПериоды.КоэффициентФормула КАК КоэффициентФормула,
	|	СтабильныеПериоды.ЛСОткрыт КАК ЛСОткрыт,
	|	СтабильныеПериоды.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	СтабильныеПериоды.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	СтабильныеПериоды.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	СтабильныеПериоды.Поставщик КАК Поставщик,
	|	СтабильныеПериоды.Плательщик КАК Плательщик,
	|	СтабильныеПериоды.ПриборВведен КАК ПриборВведен,
	|	СтабильныеПериоды.ПриборУчета КАК ПриборУчета,
	|	СтабильныеПериоды.РасчетПоФормуле КАК РасчетПоФормуле,
	|	СтабильныеПериоды.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	СтабильныеПериоды.СоставЖильцов КАК СоставЖильцов,
	|	СтабильныеПериоды.СоставнаяУслуга КАК СоставнаяУслуга,
	|	СтабильныеПериоды.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	СтабильныеПериоды.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	СтабильныеПериоды.Техническая КАК Техническая,
	|	СтабильныеПериоды.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	СтабильныеПериоды.УслугаПодключена КАК УслугаПодключена,
	|	СтабильныеПериоды.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	СтабильныеПериоды.Шкала КАК Шкала,
	|	СтабильныеПериоды.ЯвляетсяПомещениемСРазделеннымиЛС КАК ЯвляетсяПомещениемСРазделеннымиЛС,
	|	СтабильныеПериоды.КоличествоЭтажей КАК КоличествоЭтажей,
	|	СтабильныеПериоды.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	СтабильныеПериоды.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|	СтабильныеПериоды.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|	СтабильныеПериоды.ПотериОбъем КАК ПотериОбъем,
	|	СтабильныеПериоды.ПотериПроцент КАК ПотериПроцент,
	|	ЕСТЬNULL(энргАбоненты.ФизЛицо, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА энргАбонентыПлательщик.Организация ЕСТЬ NULL
	|			ТОГДА СтабильныеПериоды.Организация
	|		КОГДА энргАбонентыПлательщик.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА СтабильныеПериоды.Организация
	|		ИНАЧЕ энргАбонентыПлательщик.Организация
	|	КОНЕЦ КАК ОрганизацияПлательщика,
	|	ЕСТЬNULL(энргВидыУслуг.НеПрименятьЗависимостьЕслиБольшеОднойТочки, ЛОЖЬ) КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощадиУслуги,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	|		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УмножатьНаНормуРодительскойУслуги,
	|	энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты КАК ИспользоватьКоэффициентСдерживанияРостаПлаты,
	|	энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	ВЫБОР
	|		КОГДА СтабильныеПериоды.ЧастныйСектор
	|				И энргПомещения.Родитель ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|		КОГДА СтабильныеПериоды.ЧастныйСектор
	|				И энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|			ТОГДА СтабильныеПериоды.Помещение
	|		КОГДА энргПомещения.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|			ТОГДА СтабильныеПериоды.Помещение
	|		ИНАЧЕ энргПомещения.Родитель
	|	КОНЕЦ КАК ПомещениеРодитель,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения,
	|	СтабильныеПериоды.ДопСоциальнаяНормаПотребления КАК ДопСоциальнаяНормаПотребления,
	|	ЕСТЬNULL(энргСтроения.Наименование, """") КАК СтроениеПредставление,
	|	ЕСТЬNULL(энргПомещения.Наименование, """") КАК ПомещениеПредставление,
	|	СтабильныеПериоды.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	СтабильныеПериоды.КоличествоНедопусков КАК КоличествоНедопусков,
	|	СтабильныеПериоды.ПериодНачальногоНедопуска КАК ПериодНачальногоНедопуска,
	|	СтабильныеПериоды.УслугаОграничена КАК УслугаОграничена,
	|	ТИПЗНАЧЕНИЯ(СтабильныеПериоды.ДокРегистратор) КАК ТипЗначенияДокРегистратора,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтабильныеПериоды.ДокРегистратор) = ТИП(Документ.энргОперацияСУслугами)
	|			ТОГДА ВЫРАЗИТЬ(СтабильныеПериоды.ДокРегистратор КАК Документ.энргОперацияСУслугами).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(СтабильныеПериоды.ДокРегистратор) = ТИП(Документ.энргАктированиеНедопускаДопускаВПомещение)
	|			ТОГДА ВЫРАЗИТЬ(СтабильныеПериоды.ДокРегистратор КАК Документ.энргАктированиеНедопускаДопускаВПомещение).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(СтабильныеПериоды.ДокРегистратор) = ТИП(Документ.энргОперацияСЛицевымСчетом)
	|			ТОГДА ВЫРАЗИТЬ(СтабильныеПериоды.ДокРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ВидОперации
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидОперации,
	|	СтабильныеПериоды.ВладелецЗависимойТочкиУчета КАК ВладелецЗависимойТочкиУчета,
	|	СтабильныеПериоды.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО СтабильныеПериоды.Помещение = энргПомещения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСтроения КАК энргСтроения
	|		ПО СтабильныеПериоды.Строение = энргСтроения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО СтабильныеПериоды.Абонент = энргАбоненты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбонентыПлательщик
	|		ПО СтабильныеПериоды.Плательщик = энргАбонентыПлательщик.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО СтабильныеПериоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.ЗависимыеУслуги КАК энргВидыУслугЗависимыеУслуги
	|		ПО СтабильныеПериоды.СоставнаяУслуга = энргВидыУслугЗависимыеУслуги.Ссылка
	|			И СтабильныеПериоды.Услуга = энргВидыУслугЗависимыеУслуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО СтабильныеПериоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО СтабильныеПериоды.Строение = энргКлючиПомещений.Строение
	|			И СтабильныеПериоды.Помещение = энргКлючиПомещений.Помещение";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСтабильныеПериодыШкалы() 
	
	Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСтабильныеПериодыИзмерители() 
	
	Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК СтабильныеПериодыИзмерители";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНомераПозицийНаГраницуНарушенияПоследовательности()
	
	Текст  = 
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомерПозицийГраница
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|ГДЕ
	|	(СтабильныеПериоды.Организация, СтабильныеПериоды.ПериодНачисления, СтабильныеПериоды.Район, СтабильныеПериоды.ЧастныйСектор, СтабильныеПериоды.Строение, СтабильныеПериоды.Помещение) В
	|			(ВЫБРАТЬ
	|				ДокументыДляПроведения.Организация,
	|				ДокументыДляПроведения.ПериодНачисления,
	|				ДокументыДляПроведения.Район,
	|				ДокументыДляПроведения.ЧастныйСектор,
	|				ДокументыДляПроведения.Строение,
	|				ДокументыДляПроведения.Помещение
	|			ИЗ
	|				ДокументыДляПроведения КАК ДокументыДляПроведения)
	|	И НЕ СтабильныеПериоды.ДокРегистратор В
	|				(ВЫБРАТЬ
	|					ДокументыДляПроведения.ДокРегистратор
	|				ИЗ
	|					ДокументыДляПроведения КАК ДокументыДляПроведения)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.ПериодНачисления,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.ЧастныйСектор,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.Услуга,
	|	СтабильныеПериоды.ТочкаУчета";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСостояниеНаНачалоПериодаНачисления()
	
	Текст  = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|ГДЕ
	|	СтабильныеПериоды.НомерПозиции = 0
	|	И ВЫБОР
	|			КОГДА СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргВводНачальныхОстатков
	|					ИЛИ СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргНачисление
	|				ТОГДА ИСТИНА
	//|			КОГДА (СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргОперацияСЛицевымСчетом
	//|					ИЛИ СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргОперацияСУслугами)
	//|					И СтабильныеПериоды.ДатаРегистратора <> СтабильныеПериоды.ПериодРегистрации
	//|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	//|	И (СтабильныеПериоды.Организация, СтабильныеПериоды.ПериодНачисления, СтабильныеПериоды.Район, СтабильныеПериоды.ЧастныйСектор, СтабильныеПериоды.Строение, СтабильныеПериоды.Помещение) В
	//|		(ВЫБРАТЬ
	//|			ДокументыДляПроведения.Организация,
	//|			ДокументыДляПроведения.ПериодНачисления,
	//|			ДокументыДляПроведения.Район,
	//|			ДокументыДляПроведения.ЧастныйСектор,
	//|			ДокументыДляПроведения.Строение,
	//|			ДокументыДляПроведения.Помещение
	//|		ИЗ
	//|			ДокументыДляПроведения КАК ДокументыДляПроведения)
	|";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСостояниеШкалНаНачалоПериодаНачисления()
	
	Текст  = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|ГДЕ
	|	СтабильныеПериодыШкалы.НомерПозиции = 0
	|	И (СтабильныеПериодыШкалы.ДокРегистратор ССЫЛКА Документ.энргВводНачальныхОстатков
	|			ИЛИ СтабильныеПериодыШкалы.ДокРегистратор ССЫЛКА Документ.энргНачисление)
	//|	И (СтабильныеПериодыШкалы.Организация, СтабильныеПериодыШкалы.ПериодНачисления, СтабильныеПериодыШкалы.Район, СтабильныеПериодыШкалы.ЧастныйСектор, СтабильныеПериодыШкалы.Строение, СтабильныеПериодыШкалы.Помещение) В
	//|			(ВЫБРАТЬ
	//|				ДокументыДляПроведения.Организация,
	//|				ДокументыДляПроведения.ПериодНачисления,
	//|				ДокументыДляПроведения.Район,
	//|				ДокументыДляПроведения.ЧастныйСектор,
	//|				ДокументыДляПроведения.Строение,
	//|				ДокументыДляПроведения.Помещение
	//|			ИЗ
	//|				ДокументыДляПроведения КАК ДокументыДляПроведения)
	|";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСостояниеИзмерителейНаНачалоПериодаНачисления() 

	Текст  = 
	"ВЫБРАТЬ 
	|* 
	|ИЗ РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК СтабильныеПериодыИзмерители 
	|ГДЕ
	|	СтабильныеПериодыИзмерители.НомерПозиции = 0
	|	И (СтабильныеПериодыИзмерители.ДокРегистратор ССЫЛКА Документ.энргВводНачальныхОстатков
	|			ИЛИ СтабильныеПериодыИзмерители.ДокРегистратор ССЫЛКА Документ.энргНачисление)
	//|	И (СтабильныеПериодыИзмерители.Организация, СтабильныеПериодыИзмерители.ПериодНачисления, СтабильныеПериодыИзмерители.Район, СтабильныеПериодыИзмерители.ЧастныйСектор, СтабильныеПериодыИзмерители.Строение, СтабильныеПериодыИзмерители.Помещение) В
	//|			(ВЫБРАТЬ
	//|				ДокументыДляПроведения.Организация,
	//|				ДокументыДляПроведения.ПериодНачисления,
	//|				ДокументыДляПроведения.Район,
	//|				ДокументыДляПроведения.ЧастныйСектор,
	//|				ДокументыДляПроведения.Строение,
	//|				ДокументыДляПроведения.Помещение
	//|			ИЗ
	//|				ДокументыДляПроведения КАК ДокументыДляПроведения)
	|";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗначениеИндивидуальныхПлощадейМКД()
	Текст  =
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.Строение КАК МКД,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	МАКСИМУМ(ВложенныйЗапрос.Площадь) КАК ПлощадьАбонента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.Поставщик = СтабильныеПериоды.Абонент.ФизЛицо
	|				ТОГДА СтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериоды.Организация КАК Организация,
	|		СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериоды.Район КАК Район,
	|		СтабильныеПериоды.Строение КАК МКД,
	|		СтабильныеПериоды.Помещение КАК Помещение,
	|		СтабильныеПериоды.Услуга КАК Услуга,
	|		СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(СтабильныеПериоды.НомерПозиции) КАК НомерПозиции,
	|		энргЗначенияПлощадейСрезПоследних.Площадь КАК Площадь
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей.СрезПоследних() КАК энргЗначенияПлощадейСрезПоследних
	|				ПО энргКлючиПомещений.КлючПомещения = энргЗначенияПлощадейСрезПоследних.КлючПомещения
	|					И (энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))
	|			ПО СтабильныеПериоды.Строение = энргКлючиПомещений.Строение
	|				И СтабильныеПериоды.Помещение = энргКлючиПомещений.Помещение
	|	ГДЕ
	|		НЕ СтабильныеПериоды.ЧастныйСектор
	|		И СтабильныеПериоды.Помещение.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериоды.Организация,
	|		СтабильныеПериоды.ПериодНачисления,
	|		СтабильныеПериоды.Район,
	|		СтабильныеПериоды.Строение,
	|		СтабильныеПериоды.Помещение,
	|		СтабильныеПериоды.Услуга,
	|		СтабильныеПериоды.ТочкаУчета,
	|		энргЗначенияПлощадейСрезПоследних.Площадь) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|		ПО ВложенныйЗапрос.Организация = СтабильныеПериоды.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериоды.ПериодНачисления
	|			И ВложенныйЗапрос.Район = СтабильныеПериоды.Район
	|			И ВложенныйЗапрос.МКД = СтабильныеПериоды.Строение
	|			И ВложенныйЗапрос.Помещение = СтабильныеПериоды.Помещение
	|			И ВложенныйЗапрос.Услуга = СтабильныеПериоды.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериоды.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = СтабильныеПериоды.НомерПозиции
	|			И (НЕ СтабильныеПериоды.ЧастныйСектор)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.ПериодНачисления,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.Услуга";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗначениеИндивидуальныхПлощадейКоллекцияПериодов()
	Текст =
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.Строение КАК МКД,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	МАКСИМУМ(ВложенныйЗапрос.Площадь) КАК ПлощадьАбонента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СтабильныеПериоды.Поставщик = СтабильныеПериоды.Абонент.ФизЛицо
	|				ТОГДА СтабильныеПериоды.ЗначениеПлощади
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПлощадьСобственнаяПоставка
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериоды.Организация КАК Организация,
	|		СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериоды.Район КАК Район,
	|		СтабильныеПериоды.Строение КАК МКД,
	|		СтабильныеПериоды.Помещение КАК Помещение,
	|		СтабильныеПериоды.Услуга КАК Услуга,
	|		СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(СтабильныеПериоды.НомерПозиции) КАК НомерПозиции,
	|		энргЗначенияПлощадейСрезПоследних.Площадь КАК Площадь
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей.СрезПоследних() КАК энргЗначенияПлощадейСрезПоследних
	|				ПО энргКлючиПомещений.КлючПомещения = энргЗначенияПлощадейСрезПоследних.КлючПомещения
	|					И (энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))
	|			ПО СтабильныеПериоды.Строение = энргКлючиПомещений.Строение
	|				И СтабильныеПериоды.Помещение = энргКлючиПомещений.Помещение
	|	ГДЕ
	|		НЕ СтабильныеПериоды.ЧастныйСектор
	|		И СтабильныеПериоды.Помещение.Родитель = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериоды.Организация,
	|		СтабильныеПериоды.ПериодНачисления,
	|		СтабильныеПериоды.Район,
	|		СтабильныеПериоды.Строение,
	|		СтабильныеПериоды.Помещение,
	|		СтабильныеПериоды.Услуга,
	|		СтабильныеПериоды.ТочкаУчета,
	|		энргЗначенияПлощадейСрезПоследних.Площадь) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|		ПО ВложенныйЗапрос.Организация = СтабильныеПериоды.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериоды.ПериодНачисления
	|			И ВложенныйЗапрос.Район = СтабильныеПериоды.Район
	|			И ВложенныйЗапрос.МКД = СтабильныеПериоды.Строение
	|			И ВложенныйЗапрос.Помещение = СтабильныеПериоды.Помещение
	|			И ВложенныйЗапрос.Услуга = СтабильныеПериоды.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериоды.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = СтабильныеПериоды.НомерПозиции
	|			И (НЕ СтабильныеПериоды.ЧастныйСектор)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.ПериодНачисления,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.Услуга";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНаличиеПриборовУчетаСНачалаГода()
	Текст  = 
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	МАКСИМУМ(СтабильныеПериоды.ПриборВведен) КАК ПриборВведен
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|ГДЕ
	|	СтабильныеПериоды.ПериодНачисления МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД) И &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.ЧастныйСектор,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.Услуга,
	|	СтабильныеПериоды.НаправлениеИспользованияТУ";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаАбонентыНаНачалоПериодаРасчета()
	Текст  =
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериоды.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|ГДЕ
	|	СтабильныеПериоды.НомерПозиции = 0
	|	И СтабильныеПериоды.УслугаПодключена
	|	И НЕ СтабильныеПериоды.ПриборВведен
	|	И (СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргНачисление
	|			ИЛИ СтабильныеПериоды.ДокРегистратор ССЫЛКА Документ.энргВводНачальныхОстатков)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаТочкиУчетаСИзменившимсяСостояниемПрибораУчета()
	Текст  =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	ВЫБОР
	|		КОГДА СтабильныеПериоды.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ СтабильныеПериоды.Строение
	|	КОНЕЦ КАК МКД,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериоды.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АбонентыНаНачалоПериодаРасчета КАК АбонентыНаНачалоПериодаРасчета
	|		ПО СтабильныеПериоды.Организация = АбонентыНаНачалоПериодаРасчета.Организация
	|			И СтабильныеПериоды.ПериодНачисления = АбонентыНаНачалоПериодаРасчета.ПериодНачисления
	|			И СтабильныеПериоды.Район = АбонентыНаНачалоПериодаРасчета.Район
	|			И СтабильныеПериоды.ЧастныйСектор = АбонентыНаНачалоПериодаРасчета.ЧастныйСектор
	|			И СтабильныеПериоды.Строение = АбонентыНаНачалоПериодаРасчета.Строение
	|			И СтабильныеПериоды.Помещение = АбонентыНаНачалоПериодаРасчета.Помещение
	|			И СтабильныеПериоды.Услуга = АбонентыНаНачалоПериодаРасчета.Услуга
	|			И СтабильныеПериоды.ТочкаУчета = АбонентыНаНачалоПериодаРасчета.ТочкаУчета
	|			И СтабильныеПериоды.НаправлениеИспользованияТУ = АбонентыНаНачалоПериодаРасчета.НаправлениеИспользованияТУ
	|			И (СтабильныеПериоды.ПриборВведен)
	|			И (СтабильныеПериоды.УслугаПодключена)
	|			И (НЕ СтабильныеПериоды.НомерПозиции = 0)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаМаксимальныеНомераПозицийВПериодеНачисления() 
	Текст  = 
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.ПериодНачисления,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.ЧастныйСектор,
	|	СтабильныеПериоды.ТочкаУчета,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.Услуга";
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаКлючиНормативовНаКонецПериодаРасчета()
	Текст  =
	"ВЫБРАТЬ
	|	МаксимальныеНомераПозиций.Организация КАК Организация,
	|	МаксимальныеНомераПозиций.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныеНомераПозиций.Район КАК Район,
	|	МаксимальныеНомераПозиций.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныеНомераПозиций.Строение КАК Строение,
	|	МаксимальныеНомераПозиций.Помещение КАК Помещение,
	|	МаксимальныеНомераПозиций.ТочкаУчета КАК ТочкаУчета,
	|	СтабильныеПериоды.КлючНорматива КАК КлючНорматива,
	|	СтабильныеПериоды.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка) КАК Измеритель
	|ИЗ
	|	МаксимальныеНомераПозиций КАК МаксимальныеНомераПозиций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|		ПО МаксимальныеНомераПозиций.Организация = СтабильныеПериоды.Организация
	|			И МаксимальныеНомераПозиций.ПериодНачисления = СтабильныеПериоды.ПериодНачисления
	|			И МаксимальныеНомераПозиций.Район = СтабильныеПериоды.Район
	|			И МаксимальныеНомераПозиций.ЧастныйСектор = СтабильныеПериоды.ЧастныйСектор
	|			И МаксимальныеНомераПозиций.Строение = СтабильныеПериоды.Строение
	|			И МаксимальныеНомераПозиций.Помещение = СтабильныеПериоды.Помещение
	|			И МаксимальныеНомераПозиций.Услуга = СтабильныеПериоды.Услуга
	|			И МаксимальныеНомераПозиций.ТочкаУчета = СтабильныеПериоды.ТочкаУчета
	|			И МаксимальныеНомераПозиций.НомерПозиции = СтабильныеПериоды.НомерПозиции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.КлючНорматива,
	|	энргНаправлениеИспользованияТочекУчета.Родитель,
	|	ВложенныйЗапрос.Измеритель
	|ИЗ
	|	(ВЫБРАТЬ
	|		МаксимальныеНомераПозиций.Организация КАК Организация,
	|		МаксимальныеНомераПозиций.ПериодНачисления КАК ПериодНачисления,
	|		МаксимальныеНомераПозиций.Район КАК Район,
	|		МаксимальныеНомераПозиций.ЧастныйСектор КАК ЧастныйСектор,
	|		МаксимальныеНомераПозиций.Строение КАК Строение,
	|		МаксимальныеНомераПозиций.Помещение КАК Помещение,
	|		МаксимальныеНомераПозиций.Услуга КАК Услуга,
	|		МаксимальныеНомераПозиций.ТочкаУчета КАК ТочкаУчета,
	|		МаксимальныеНомераПозиций.НомерПозиции КАК НомерПозиции,
	|		СтабильныеПериодыИзмерителиНаправлени.КлючНорматива КАК КлючНорматива,
	|		СтабильныеПериодыИзмерителиНаправлени.Измеритель КАК Измеритель
	|	ИЗ
	|		МаксимальныеНомераПозиций КАК МаксимальныеНомераПозиций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК СтабильныеПериодыИзмерителиНаправлени
	|			ПО МаксимальныеНомераПозиций.Организация = СтабильныеПериодыИзмерителиНаправлени.Организация
	|				И МаксимальныеНомераПозиций.ПериодНачисления = СтабильныеПериодыИзмерителиНаправлени.ПериодНачисления
	|				И МаксимальныеНомераПозиций.Район = СтабильныеПериодыИзмерителиНаправлени.Район
	|				И МаксимальныеНомераПозиций.ЧастныйСектор = СтабильныеПериодыИзмерителиНаправлени.ЧастныйСектор
	|				И МаксимальныеНомераПозиций.Строение = СтабильныеПериодыИзмерителиНаправлени.Строение
	|				И МаксимальныеНомераПозиций.Помещение = СтабильныеПериодыИзмерителиНаправлени.Помещение
	|				И МаксимальныеНомераПозиций.ТочкаУчета = СтабильныеПериодыИзмерителиНаправлени.ТочкаУчета
	|				И МаксимальныеНомераПозиций.НомерПозиции = СтабильныеПериодыИзмерителиНаправлени.НомерПозиции) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргНаправлениеИспользованияТочекУчета КАК энргНаправлениеИспользованияТочекУчета
	|		ПО ВложенныйЗапрос.Измеритель = энргНаправлениеИспользованияТочекУчета.Ссылка";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли