#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргСтроения(ЭтотОбъект);
	
	СписокСтроений = Неопределено;
	Если Параметры.Свойство("СписокСтроений") Тогда
		СписокСтроений	= Параметры.СписокСтроений;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("бестБиллингПроект") Тогда
		Модуль  = ОбщегоНазначения.ОбщийМодуль("бестПользовательскийВводСервер");
		Модуль.ЗаполнитьСписокСсылок(ЭтаФорма, СписокСтроений, "МКД");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СписокСтроений)  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокСтроений,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти