#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);	
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеТУ(),	Движения.бестТУРассчитываемыеПоГрафикуГП);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеТУ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестИзменитьРасчетТУПоГрафикуГП.Организация КАК Организация,
		|	бестИзменитьРасчетТУПоГрафикуГП.Район КАК Район,
		|	бестИзменитьРасчетТУПоГрафикуГП.ОбъектРасчета КАК ОбъектРасчета,
		|	бестИзменитьРасчетТУПоГрафикуГПТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	бестИзменитьРасчетТУПоГрафикуГПТочкиУчета.РасчетПоГрафикуГП КАК РасчетПоГрафикуГП,
		|	бестИзменитьРасчетТУПоГрафикуГП.Дата КАК Период,
		|	бестОбъектыРасчета.МКД КАК МКД
		|ИЗ
		|	Документ.бестИзменитьРасчетТУПоГрафикуГП.ТочкиУчета КАК бестИзменитьРасчетТУПоГрафикуГПТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьРасчетТУПоГрафикуГП КАК бестИзменитьРасчетТУПоГрафикуГП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|			ПО бестИзменитьРасчетТУПоГрафикуГП.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|		ПО бестИзменитьРасчетТУПоГрафикуГПТочкиУчета.Ссылка = бестИзменитьРасчетТУПоГрафикуГП.Ссылка
		|ГДЕ
		|	бестИзменитьРасчетТУПоГрафикуГП.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли