#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область РегистрацияДанных

// Регистрирует запись.
//
// Параметры:
//  ДанныеДляЗаписи	-	Структура.
//
Процедура ЗарегистрироватьЗапись(ДанныеДляЗаписи) Экспорт 	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеДляЗаписи);
	МенеджерЗаписи.Записать();		
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных 

// Получает сведения о файлах.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПолучитьСведенияОФайлах(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 	
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСведенияОФайлах());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения; 
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
		
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		ДоступныеПараметры 					= "Файл";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргСведенияОФайлахДополнительныеРеквизиты", ПараметрыОтбора.Отбор, ДоступныеПараметры);		
	КонецЕсли;		
КонецПроцедуры  

#КонецОбласти

#Область ВспомогательныеМетоды

// Получает описание объекта.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ПолучитьОписаниеОбъекта() Экспорт
	Возврат энргОбщегоНазначения.ПолучитьОписаниеСвойствРегистра(Метаданные.РегистрыСведений.энргСведенияОФайлахДополнительныеРеквизиты);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСведенияОФайлах()	
	Текст  =
	"ВЫБРАТЬ
	|	энргСведенияОФайлахДополнительныеРеквизиты.Файл КАК Файл,
	|	энргСведенияОФайлахДополнительныеРеквизиты.ТипФайла КАК ТипФайла,
	|	энргСведенияОФайлахДополнительныеРеквизиты.Номер КАК Номер,
	|	энргСведенияОФайлахДополнительныеРеквизиты.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.энргСведенияОФайлахДополнительныеРеквизиты КАК энргСведенияОФайлахДополнительныеРеквизиты";
	
	Возврат Текст;	
КонецФункции

#КонецОбласти

#КонецЕсли