#Область ПрограммныйИнтерфейс

Процедура ПриЧтенииНаСервере(Форма, ИмяКоллекции) Экспорт 
		
	Коллекция 				= Форма.Объект[ИмяКоллекции];
	Запрос 					= Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеТабЧасти",Коллекция.Выгрузить()); 
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|	ДанныеТабЧасти.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|ГДЕ
	|	НЕ ДанныеТабЧасти.ТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|	энргТочкиУчета.Наименование КАК НаименованиеТочки,
	|	энргТочкиУчета.Головная КАК Головная,
	|	энргТочкиУчета.Расположение КАК Расположение
	|ИЗ
	|	ДанныеТабЧасти КАК ДанныеТабЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|		ПО ДанныеТабЧасти.ТочкаУчета = энргТочкиУчета.Ссылка";
	
	Результат  									= Запрос.Выполнить();
	Выборка 									= Результат.Выбрать();
	                       	
	Пока Выборка.Следующий() Цикл
		СтрокаДляЗаполнения 					= Коллекция[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка,,"НомерСтроки");
	КонецЦикла;
	
	Для Каждого СтрокаТочки Из Коллекция Цикл
		Если ЗначениеЗаполнено(СтрокаТочки.ТочкаУчета) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТочки.ОписаниеТочки) Тогда
			Продолжить;
		КонецЕсли;
		
		Чтение 									= Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(СтрокаТочки.ОписаниеТочки);
		ОписаниеТочки 							= ПрочитатьJSON(Чтение);
		Для Каждого КлючЗначение Из ОписаниеТочки Цикл
			Если КлючЗначение.Ключ = "Расположение" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "Наименование" Тогда
				СтрокаТочки.НаименованиеТочки 	= КлючЗначение.Значение;
			Иначе
				СтрокаТочки[КлючЗначение.Ключ] 	= КлючЗначение.Значение;
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;	
	
КонецПроцедуры

#Область РаботаСНаборамиЗаписей

Процедура УстановитьВладельцаТочкиУчета(ДанныеШапки,Движения,ИмяКоллекции) Экспорт 
	
	Набор  							= Движения.энргВладельцыТочекУчета;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.ТочкаУчета 			= стр.ТочкаУчета;
		Запись.АбонентВладелец 		= ДанныеШапки.КлючПомещения;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
	КонецЦикла;  
	
КонецПроцедуры

Процедура УстановитьВладельцаТочкиУчетаРезультатЗапроса(Результат,Движения) Экспорт  
	
	Набор  							= Движения.энргВладельцыТочекУчета;
	Выборка  						= Результат.выбрать();
	Пока Выборка.следующий() цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= Выборка.Период;
		Запись.Район  				= Выборка.район;
		Запись.Организация  		= Выборка.Организация;
		Запись.ТочкаУчета 			= Выборка.ТочкаУчета;
		Запись.АбонентВладелец 		= Выборка.КлючПомещения;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	КонецЦикла;  

КонецПроцедуры

Процедура УстановитьФормулуРасчетаТУ(ДанныеШапки,Движения) Экспорт 
	Набор  							= Движения.энргРасчетныеСпособыТочекУчета;
	Запись  						= Набор.добавить();
	Запись.Период  					= ДанныеШапки.Дата;
	Запись.Район					= ДанныеШапки.Район;
	Запись.Организация				= ДанныеШапки.Организация;
	Запись.КлючПомещения			= ДанныеШапки.КлючПомещения;
	Запись.РасчетныйСпособ			= Истина;
	Запись.ПрименятьФормулуВсегда 	= ДанныеШапки.ПрименятьФормулуВсегда;
	Запись.ТочкаУчета 				= ДанныеШапки.ТочкаУчета; 
	Запись.ПериодРегистрации		= ДанныеШапки.ПериодРегистрации;
	Запись.ПериодНачисления			= ДанныеШапки.ПериодНачисления;
	
КонецПроцедуры

#Область АктивностьТочекУчета

Процедура УстановитьАктивностьТочекАбонента(ДанныеШапки, Движения, ИмяКоллекции, ЗначениеСостояния) Экспорт 
	Набор  						= Движения.энргАктивностьТочекУчета;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Если ЗначениеЗаполнено(стр.ТочкаУчета) тогда
			Запись  					= Набор.добавить();
			Запись.Период  				= ДанныеШапки.Дата;
			Запись.Район  				= ДанныеШапки.район;
			Запись.Организация  		= ДанныеШапки.Организация;
			Запись.КлючПомещения		= ДанныеШапки.КлючПомещения;
			Запись.ТочкаУчета 			= стр.ТочкаУчета;
			Запись.Состояние 			= ЗначениеСостояния;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
		КонецЕсли;
	КонецЦикла;  

КонецПроцедуры

Процедура УстановитьАктивностьТочекАбонентаРезультатЗапроса(Результат,Движения) Экспорт  
	
	Набор  							= Движения.энргАктивностьТочекУчета;
	Выборка  						= Результат.выбрать();
	Пока Выборка.следующий() цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= Выборка.Период;
		Запись.Район  				= Выборка.Район;
		Запись.Организация  		= Выборка.Организация;
		Запись.КлючПомещения 		= Выборка.КлючПомещения;
		Запись.ТочкаУчета 			= Выборка.ТочкаУчета;
		Запись.Состояние 			= Выборка.Состояние;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления; 		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьАктивностьТочекМКД(Движения, ДанныеШапки,ИмяКоллекции, Состояние) Экспорт
	Набор 					= Движения.энргАктивностьТочекУчетаМКД;
	Для каждого стр из ДанныеШапки[ИмяКоллекции] Цикл
		Запись				= Набор.Добавить();
		Запись.Период		= ДанныеШапки.Дата;
		Запись.Район		= ДанныеШапки.Район;
		Запись.Организация	= ДанныеШапки.Организация;
		Запись.МКД			= ДанныеШапки.МКД;
		Запись.ТочкаУчета	= стр.ТочкаУчета;
		Запись.Состояние	= Состояние;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьАктивностьТочекТеплоисточника(Движения, ДанныеШапки,ИмяКоллекции, Состояние) Экспорт
	Набор 					= Движения.энргАктивностьТочекУчетаТеплоисточников;
	Для каждого стр из ДанныеШапки[ИмяКоллекции] Цикл
		Запись					= Набор.Добавить();
		Запись.Период			= ДанныеШапки.Дата;
		Запись.Район			= ДанныеШапки.Район;
		Запись.Организация		= ДанныеШапки.Организация;
		Запись.Теплоисточник	= ДанныеШапки.Теплоисточник;
		Запись.ТочкаУчета		= стр.ТочкаУчета;
		Запись.Состояние		= Состояние;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьФормулуРасчетаУслугТочкиУчетаМКД(Движения, ДанныеШапки, РезультатЗапроса) Экспорт 
	
	Набор  							= Движения.энргФормулыРасчетаУслугМКД;
	Выборка  						= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.МКД			  		= Выборка.МКД;
		Запись.ТочкаУчета	 		= Выборка.ТочкаУчета;
		Запись.Услуга	 			= Выборка.Услуга;
		Запись.ФормулаРасчета	 	= Выборка.ФормулаРасчета;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ПриборыТочекУчета

Процедура УстановитьПриборыТочекУчетаМКД(ДанныеШапки,Движения,ИмяКоллекции,СоотвествиеКолонок) Экспорт
	Набор 						= Движения.энргПриборыТочекМКД;
	Для каждого стр из ДанныеШапки[ИмяКоллекции] Цикл
		Если ЗначениеЗаполнено(стр[СоотвествиеКолонок.ПриборУчета]) или ДанныеШапки.Отключение тогда
			Запись				= Набор.Добавить();
			Запись.Период		= ДанныеШапки.Дата;
			Запись.Район		= ДанныеШапки.Район;
			Запись.Организация	= ДанныеШапки.Организация;
			Запись.МКД			= ДанныеШапки.МКД;
			Запись.ТочкаУчета	= стр[СоотвествиеКолонок.ТочкаУчета];
			
			Запись.ПриборУчета	= ?(ДанныеШапки.Отключение,Справочники.энргПриборыУчетаАбонента.ПустаяСсылка(),стр[СоотвествиеКолонок.ПриборУчета]) ;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура УстановитьПриборыТочекУчетаТеплоисточников(ДанныеШапки,Движения,ИмяКоллекции,СоотвествиеКолонок) Экспорт
	Набор 						= Движения.энргПриборыТочекТеплоисточников;
	Для каждого стр из ДанныеШапки[ИмяКоллекции] Цикл
		Если ЗначениеЗаполнено(стр[СоотвествиеКолонок.ПриборУчета]) или ДанныеШапки.Отключение тогда
			Запись					= Набор.Добавить();
			Запись.Период			= ДанныеШапки.Дата;
			Запись.Район			= ДанныеШапки.Район;
			Запись.Организация		= ДанныеШапки.Организация;
			Запись.Теплоисточник	= ДанныеШапки.Теплоисточник;
			Запись.ТочкаУчета		= стр[СоотвествиеКолонок.ТочкаУчета];
			Запись.ПриборУчета		= ?(ДанныеШапки.Отключение,Справочники.энргПриборыУчетаАбонента.ПустаяСсылка(),стр[СоотвествиеКолонок.ПриборУчета]) ;
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область УслугиТочекУчета

Процедура УстановитьУслугиТочекУчетаМКД(Движения,ДанныеШапки,ИмяКоллекции,СоотвествиеКолонок) Экспорт 
	Набор  						= Движения.энргУслугиТочекУчетаМКД;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Если ЗначениеЗаполнено(стр[СоотвествиеКолонок.точкаУчета]) тогда
			Запись  			= Набор.добавить();
			Запись.Период  		= ДанныеШапки.Дата;
			Запись.Район  		= ДанныеШапки.Район;
			Запись.Организация  = ДанныеШапки.Организация;
			Запись.МКД 			= ДанныеШапки.МКД;
			Запись.ТочкаУчета 	= стр[СоотвествиеКолонок.точкаУчета];
			Запись.Услуга 		= ?(ДанныеШапки.Отключение,Справочники.энргВидыУслуг.ПустаяСсылка(),стр[СоотвествиеКолонок.Услуга]);
		КонецЕсли;
	КонецЦикла;    	
КонецПроцедуры

Процедура УстановитьУслугиТочекУчетаТеплоисточника(Движения,ДанныеШапки,ИмяКоллекции,СоотвествиеКолонок) Экспорт 
	Набор  						= Движения.энргУслугиТочекУчетаТеплоисточников;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Если ЗначениеЗаполнено(стр[СоотвествиеКолонок.точкаУчета]) тогда
			Запись  				= Набор.добавить();
			Запись.Период  			= ДанныеШапки.Дата;
			Запись.Район  			= ДанныеШапки.Район;
			Запись.Организация  	= ДанныеШапки.Организация;
			Запись.Теплоисточник	= ДанныеШапки.Теплоисточник;
			Запись.ТочкаУчета 		= стр[СоотвествиеКолонок.точкаУчета];
			Запись.Услуга 			= ?(ДанныеШапки.Отключение,Справочники.энргВидыУслуг.ПустаяСсылка(),стр[СоотвествиеКолонок.Услуга]);
			Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;		
		КонецЕсли;
	КонецЦикла;    	
КонецПроцедуры

#КонецОбласти

#Область состояние

Процедура УстановитьСостояниеМКД(Движения,ДанныеШапки, Состояние) Экспорт
	Набор 						= Движения.энргСостояниеМКД;
	Запись						= Набор.Добавить();
	Запись.Период  				= ДанныеШапки.Дата; 
	Запись.Район  				= ДанныеШапки.Район;
	Запись.Организация  		= ДанныеШапки.Организация;
	Запись.МКД  				= ДанныеШапки.МКД;
	Запись.Состояние 			= Состояние;
	Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
	Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
КонецПроцедуры

Процедура УстановитьСостояниеЛицевогоСчетаРезультатЗапроса(Результат,Движения)  Экспорт 
	Выборка  						= Результат.выбрать();
	Пока Выборка.следующий() цикл
		Набор 						= Движения.энргСостояниеЛС;
		Запись  					= Набор.добавить(); 	
		Запись.Период  				= Выборка.Период;
		Запись.Район  				= Выборка.Район;
		Запись.Организация  		= Выборка.Организация;
		Запись.Абонент 				= Выборка.Абонент;
		Запись.Состояние 			= Выборка.Состояние;
		Запись.ПериодРегистрации	= Выборка.ПериодРегистрации;
		Запись.ПериодНачисления		= Выборка.ПериодНачисления;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОперацииОтключения

Процедура СнятьАктивностьВсехТочекУчетаМКД(Движения,Период,ДанныеШапки) Экспорт 
	
	Запрос  						= Новый Запрос;
	Если ДанныеШапки.свойство("МВТ") тогда
		Запрос.МенеджерВременныхТаблиц 	= ДанныеШапки.МВТ;
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Район",ДанныеШапки.Район);
	Запрос.УстановитьПараметр("Организация",ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("МКД",ДанныеШапки.МКД);
	Запрос.Текст 	="ВЫБРАТЬ
	             	 |	энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета
	             	 |ПОМЕСТИТЬ АктивныеТочки
	             	 |ИЗ
	             	 |	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	             	 |			&Период,
	             	 |			Район = &Район
	             	 |				И МКД = &МКД
	             	 |				И Организация = &Организация) КАК энргАктивностьТочекУчетаМКДСрезПоследних
	             	 |ГДЕ
	             	 |	энргАктивностьТочекУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	             	 |;
	             	 |
	             	 |////////////////////////////////////////////////////////////////////////////////
	             	 |ВЫБРАТЬ
	             	 |	АктивныеТочки.ТочкаУчета КАК ТочкаУчета
	             	 |ИЗ
	             	 |	АктивныеТочки КАК АктивныеТочки";
	Результат 				= Запрос.Выполнить();
	Выборка  				= Результат.Выбрать();
	
	Набор  					= Движения.энргАктивностьТочекУчетаМКД;
	
	Пока Выборка.Следующий() цикл
		Запись 				= Набор.добавить();
		Запись.Период  		= ДанныеШапки.Дата;
		Запись.Район  		= ДанныеШапки.Район;
		Запись.Организация  = ДанныеШапки.Организация;
		Запись.МКД  		= ДанныеШапки.МКД;
		Запись.ТочкаУчета  	= Выборка.ТочкаУчета;
		Запись.Состояние  	= Перечисления.энргСостояниеТочекУчета.Отключена;		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СнятьАктивностьВсехТочекУчетаАбонента(Движения,Период,ДанныеШапки) Экспорт 
	
	Запрос  						= Новый Запрос;
	Если ДанныеШапки.свойство("МВТ") тогда
		Запрос.МенеджерВременныхТаблиц 	= ДанныеШапки.МВТ;
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Район",ДанныеШапки.Район);
	Запрос.УстановитьПараметр("Организация",ДанныеШапки.Организация);
	Запрос.УстановитьПараметр("КлючПомещения",ДанныеШапки.КлючПомещения);
		
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочки
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|			&Период,
	|			Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И Организация = &Организация) КАК энргАктивностьТочекУчетаСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочки.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	АктивныеТочки КАК АктивныеТочки";
	
	Результат 						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	
	Набор  							= Движения.энргАктивностьТочекУчета;
	
	Пока Выборка.Следующий() цикл
		Запись 						= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.КлючПомещения  		= ДанныеШапки.КлючПомещения;
		Запись.ТочкаУчета  			= Выборка.ТочкаУчета;
		Запись.Состояние  			= Перечисления.энргСостояниеТочекУчета.Отключена;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область РазделенныеЛС

Процедура УстановитьСпособРаспределенияОбъемаПомещения(ДанныеШапки,Движения,ИмяКоллекции) Экспорт 
	
	Набор  					= Движения.энргСпособыРаспределенияОбъемаПомещения;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Период;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.КлючПомещения  		= стр.КлючПомещения;
		Запись.Услуга 				= ДанныеШапки.Услуга;
		Запись.ТочкаУчета 			= стр.ТочкаУчета;
		Запись.СпособРаспределения	= стр.СпособРаспределения;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьКоэффициентыРаспределенияОстатка(ДанныеШапки,Движения,ИмяКоллекции) Экспорт 
	
	Набор  					= Движения.энргКоэффициентыРаспределенияОстакаПоРазделеннымЛС;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Период;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.КлючПомещения  		= стр.КлючПомещения;
		Запись.Услуга 				= ДанныеШапки.Услуга;
		Запись.ТочкаУчета 			= стр.ТочкаУчета;
		Запись.КоэффициентРаспределенияОстатка	= стр.КоэффициентРаспределенияОстатка;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьСпособФиксированныйОбъемРазделенныхЛС(ДанныеШапки,Движения) Экспорт 
	
	Набор  								= Движения["энргФиксированныеОбъемыРазделенныхЛС"];
	Результат 							= ФиксированныеОбъемыРазделенныхЛС(ДанныеШапки.Документ);
	Выборка  							= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Период;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.КлючПомещения  		= Выборка.КлючПомещения;
		Запись.Услуга 				= ДанныеШапки.Услуга;
		Запись.ТочкаУчета 			= Выборка.ТочкаУчета;
		Запись.ОбъемПотребления		= Выборка.ОбъемПотребления;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления; 

	КонецЦикла;

КонецПроцедуры

Процедура УстановитьДолиПотребленияРазделенныхЛС(ДанныеШапки,Движения) Экспорт 
		
	Набор  								= Движения["энргДолиПотребленияРазделенныхЛС"];
	Результат 							= ДолиПотребленияРазделенныхЛС(ДанныеШапки.Документ);
	Выборка  							= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Запись  							= Набор.добавить();
		Запись.Период  						= ДанныеШапки.Период;
		Запись.Район  						= ДанныеШапки.район;
		Запись.Организация  				= ДанныеШапки.Организация;
		Запись.КлючПомещения  				= Выборка.КлючПомещения;
		Запись.Услуга 						= ДанныеШапки.Услуга;
		Запись.ТочкаУчета 					= Выборка.ТочкаУчета;
		Запись.ДоляПотребленияЧислитель		= Выборка.ДоляПотребленияЧислитель;
		Запись.ДоляПотребленияЗнаменатель	= Выборка.ДоляПотребленияЗнаменатель;
		Запись.ПериодРегистрации			= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления				= ДанныеШапки.ПериодНачисления; 
	КонецЦикла; 

	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьСпособРаспределенияОбъемаМКД(ДанныеШапки,Движения,ИмяКоллекции) Экспорт 
	
	Набор  					= Движения.энргСпособРаспределенияОбъемаМКДНаАбонентов;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.МКД	 				= ДанныеШапки.МКД;
		Запись.ТочкаУчета 			= стр.ТочкаУчета;
		Запись.Распределять			= стр.РаспределятьНаАбонентов;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьИсториюСоглашенийОРаспределенииСверхнормативногоОДН(ДанныеШапки,Движения,ИмяКоллекции) Экспорт 
	
	Набор  					= Движения.энргИсторияСоглашенийОРаспределенииСверхнормативногоОДН;
	Для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,ДанныеШапки);
		ЗаполнитьЗначенияСвойств(Запись,стр);		
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьБездоговорноеПотребление(ДанныеШапки,Движения,ИмяКоллекции) Экспорт 
	
	Набор  					= Движения.энргБездоговорноеПотребление;
	Для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,ДанныеШапки);
		ЗаполнитьЗначенияСвойств(Запись,стр);		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ВидыДифференцированности

Функция СоставВидаДифференцированности(ВидДифференцированности, Услуга = Неопределено) Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ВидДифференцированности",ВидДифференцированности);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ИЗ
	|	Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|ГДЕ
	|	энргВидыДифференцированностиТарифныеЗоны.Ссылка = &ВидДифференцированности";
	
	Результат  				= Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("ТарифнаяЗона");  	
	
КонецФункции

Функция СоставКанальности(ВидКанальности) Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ВидКанальности",ВидКанальности);
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала
	|ИЗ
	|	Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|ГДЕ
	|	энргВидыКанальностиШкалы.Ссылка = &ВидКанальности";
	
	Результат  				= Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Шкала");  	
	
КонецФункции

#КонецОбласти

#Область РаботаСЭлементамиСправочков

Процедура СоздатьТочкиУчета(ТекущийОбъект,ИмяКоллекции,Отказ) Экспорт 
	
	НовыеТочкиУчета 						= Новый Массив;
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеТочкиУчета") Тогда
		НовыеТочкиУчета 						= ТекущийОбъект.ДополнительныеСвойства.НовыеТочкиУчета; 
	КонецЕсли;
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ИзмененныеТУ") Тогда
		ИзмененныеТУ							= ТекущийОбъект.ДополнительныеСвойства.ИзмененныеТУ;
	КонецЕсли;
	
	ЗаписываемаяКоллекция 					= ТекущийОбъект[ИмяКоллекции];
	для Каждого стр из ТекущийОбъект[ИмяКоллекции] цикл
		
		Если ПустаяСтрока(стр.ОписаниеТочки) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоНоваяТУ							= Не НовыеТочкиУчета.Найти(стр.НомерСтроки) = Неопределено;
		
		Если Не ЭтоНоваяТУ И ТекущийОбъект.ДополнительныеСвойства.Свойство("ИзмененныеТУ") И ИзмененныеТУ.Найти(стр.ТочкаУчета) = Неопределено Тогда
			// эту ТУ не изменяли, перезаписывать не надо
			Продолжить;
		КонецЕсли;
		
		//Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ИзмененныеТУ") И ИзмененныеТУ.Найти(стр.ТочкаУчета) = Неопределено  Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Чтение  							= Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(стр.ОписаниеТочки);		
		Описание							= ПрочитатьJSON(Чтение);
		
		ДанныеТочки 						= Новый Структура("Головная,Расположение,Наименование,ДлинаТрубы",Ложь,Справочники.энргМестаРасположенияТочекУчета.ПустаяСсылка(),"",0);
		ЗаполнитьЗначенияСвойств(ДанныеТочки, стр);
		
		Если  Описание.Свойство("Расположение") тогда
			Ключ 							= Новый УникальныйИдентификатор(Описание.Расположение);
			ДанныеТочки.Расположение 		= Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Ключ);
		КонецЕсли;
		
		Если  Описание.Свойство("НаименованиеТочки") тогда
			ДанныеТочки.Наименование		= Описание.НаименованиеТочки;
		ИначеЕсли  Описание.Свойство("Наименование") тогда	
			ДанныеТочки.Наименование		= Описание.Наименование;
		КонецЕсли;
		
		Если  Описание.Свойство("Головная") тогда
			ДанныеТочки.Головная 			= ДанныеТочки.Головная;
		КонецЕсли;
		
		Если ЭтоНоваяТУ Тогда
			ТочкаОбъект 					= Справочники.энргТочкиУчета.СоздатьЭлемент();
		    ТочкаОбъект.УстановитьСсылкуНового(стр.ТочкаУчета);
		Иначе
			ТочкаОбъект  					= стр.ТочкаУчета.получитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЭлемент(ТочкаОбъект,ДанныеТочки);		
	КонецЦикла;	
КонецПроцедуры

Функция СформироватьИдентификаторТочекУчета(Организация, ВидКонтрагента) Экспорт
	Идентификатор  				= "";
	ДлинаИдентификатора = 16;
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	ЭтоМКД = Ложь;
	
	Если ВидКонтрагента = Перечисления.бестЮрФизЛицо.ЮрЛицо Тогда
		ЮрФизЛицо = Ложь;
	ИначеЕсли ВидКонтрагента = Перечисления.бестЮрФизЛицо.ФизЛицо Тогда
		ЮрФизЛицо = Истина;
	Иначе
		ЭтоМКД = Истина;
		ЮрФизЛицо = Ложь;
	КонецЕсли;

	//Если ВидКонтрагента = Неопределено Тогда
	//	ЭтоМКД = Истина;
	//	ЮрФизЛицо = Ложь;
	//ИначеЕсли ВидКонтрагента = Тип("СправочникСсылка.Организации") Тогда
	//	ЮрФизЛицо = Ложь;
	//Иначе
	//	ЮрФизЛицо = Контрагент.ЮрФизЛицо = Перечисления.бестЮрФизЛицо.ФизЛицо;
	//КонецЕсли;
	Запрос.УстановитьПараметр("ФизЛицо",	ЮрФизЛицо);//Контрагент.ЮрФизЛицо = Перечисления.бестЮрФизЛицо.ФизЛицо);
	Запрос.УстановитьПараметр("ЭтоМКД",		ЭтоМКД);
	Запрос.Текст  ="ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Идентификатор, ""00000000"") = """"
	               |			ТОГДА ""00000000""
	               |		ИНАЧЕ ЕСТЬNULL(ВложенныйЗапрос.Идентификатор, ""00000000"")
	               |	КОНЕЦ КАК МаксНомер
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(ПОДСТРОКА(энргТочкиУчета.IDТочкиУчета, 9, 16)) КАК Идентификатор
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			энргАктивностьТочекУчета.ТочкаУчета КАК ТочкаУчета
	               |		ИЗ
	               |			РегистрСведений.энргАктивностьТочекУчета КАК энргАктивностьТочекУчета
	               |		ГДЕ
	               |			энргАктивностьТочекУчета.Организация = &Организация
	               |			И &ФизЛицо
	               |			И НЕ &ЭтоМКД
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			энргАктивностьТочекУчета.ТочкаУчета
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			бестАктивностьТочекУчетаНП.ТочкаУчета
	               |		ИЗ
	               |			РегистрСведений.бестАктивностьТочекУчетаНП КАК бестАктивностьТочекУчетаНП
	               |		ГДЕ
	               |			бестАктивностьТочекУчетаНП.Организация = &Организация
	               |			И НЕ &ФизЛицо
	               |			И НЕ &ЭтоМКД
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			бестАктивностьТочекУчетаНП.ТочкаУчета
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			энргАктивностьТочекУчетаМКД.ТочкаУчета
	               |		ИЗ
	               |			РегистрСведений.энргАктивностьТочекУчетаМКД КАК энргАктивностьТочекУчетаМКД
	               |		ГДЕ
	               |			энргАктивностьТочекУчетаМКД.Организация = &Организация
	               |			И &ЭтоМКД
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			энргАктивностьТочекУчетаМКД.ТочкаУчета) КАК ВложенныйЗапрос
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	               |			ПО ВложенныйЗапрос.ТочкаУчета = энргТочкиУчета.Ссылка) КАК ВложенныйЗапрос";
	//Текст 			= СтрЗаменить(Текст,"%%ДлинаЛС%%",Строка(ДлинаЛС));
	//Запрос.Текст 	= Текст;
	Результат 		= Запрос.Выполнить();
	Выборка  		= Результат.выбрать();
	Выборка.следующий();
	МаксНомер  		= Выборка.МаксНомер;
	
	Сч = 1;
	Пока Сч<=ДлинаИдентификатора цикл
		Если Сред(МаксНомер,ДлинаИдентификатора-(Сч-1),1) = "9" тогда
			Сч = Сч +1;	
		иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОкончаниеКода  				= СтрЗаменить(Число(Прав(МаксНомер,Сч)) + 1,Символы.НПП,"");
	КодАбонента 				= Формат(Число(МаксНомер)+1,"ЧЦ=8; ЧВН=; ЧГ=0");
	КодТипаПотребителя			= ?(ЮрФизЛицо, "1", "2");
	Идентификатор 				= ?(ЗначениеЗаполнено(Организация.бестКодВнутриРосатом), Организация.бестКодВнутриРосатом, "0000") + ?(ЗначениеЗаполнено(Организация.бестКодОрганизацииВнутриГоловнойОрганизации), Организация.бестКодОрганизацииВнутриГоловнойОрганизации, "00") + КодТипаПотребителя + КодАбонента;
	Возврат Идентификатор;	
КонецФункции		

#КонецОбласти

#Область ФункцииЗаполненияТабличныхЧастей

Функция ДанныеДляОплатыАбонента(Период,Организация, ПериодНачисления,Район,Дом,Абонент, ОтборПоДому = Истина) Экспорт  
	Запрос   		= Новый Запрос;
	Граница = Новый Граница(Период, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период" ,			Граница);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				Дом);
	Запрос.УстановитьПараметр("Абонент",			Абонент);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг) КАК ВидЗадолженности,
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК Задолженность,
	|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик,
	|	0 КАК ЗадолженностьПени
	|ПОМЕСТИТЬ ВТ_Задолженности
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоМесяцамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления,
	|	энргВзаиморасчетыПоПениОстатки.Услуга,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня),
	|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка),
	|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоПениОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Услуга КАК Услуга,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Поставщик КАК Поставщик,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.ПросуженнаяБлокированная КАК ПросуженнаяБлокированная,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Период КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_Просуженная
	|ИЗ
	|	РегистрСведений.энргПросуженнаяЗадолженностьАбонентов.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргПросуженнаяЗадолженностьАбонентовСрезПоследних
	|ГДЕ
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.ПросуженнаяБлокированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задолженности.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_Задолженности.Услуга КАК Услуга,
	|	ВТ_Задолженности.ВидЗадолженности КАК ВидЗадолженности,
	|	ВТ_Задолженности.Задолженность КАК Задолженность,
	|	ВТ_Задолженности.Поставщик КАК Поставщик,
	|	ВТ_Задолженности.ЗадолженностьПени КАК ЗадолженностьПени,
	|	ВТ_Просуженная.ПросуженнаяБлокированная КАК ПросуженнаяБлокированная,
	|	ВТ_Просуженная.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ВТ_Задолженности КАК ВТ_Задолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Просуженная КАК ВТ_Просуженная
	|		ПО ВТ_Задолженности.ПериодНачисления = ВТ_Просуженная.ПериодНачисления
	|			И ВТ_Задолженности.Услуга = ВТ_Просуженная.Услуга
	|			И ВТ_Задолженности.Поставщик = ВТ_Просуженная.Поставщик"; 

	Если НЕ ОтборПоДому Тогда
		Запрос.Текст 	= СтрЗаменить(Запрос.Текст,"И МКД = &МКД", "");
	КонецЕсли;
	
	Результат  		= Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

Функция ДействующиеТочкиУчета(Период, Организация,Район,КлючПомещения,ОбъектРасчета = Неопределено, ТочкиСПриборами = Неопределено, НаименованиеТочки = "", ПараметрыОтбора = Неопределено) Экспорт  
	
	Схема  							= Неопределено;
	ПараметрыОтбор  				= Новый Массив;
	
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("АбонентВладелец", "КлючПомещения"),	Неопределено));
	
	Если ПараметрыОтбора = Неопределено Тогда
		//ПараметрыВыбора	 				= Новый Структура("ПараметрыВТ,ВыбратьВсеСостояния", ПараметрыВТ,ВыбратьВсеСостояния);
		ПараметрыВыбора	 				= Новый Структура("ПараметрыВТ,Отбор", ПараметрыВТ,ПараметрыОтбор);
	Иначе
		ПараметрыВыбора 				= ПараметрыОтбора;
		ПараметрыВыбора.Вставить("ПараметрыВТ", ПараметрыВТ);
		ПараметрыВыбора.Вставить("Отбор", 		ПараметрыОтбор);
		
		Если ПараметрыОтбора.Свойство("ТочкиОРП") Тогда
			ПараметрыВыбора.Вставить("ТочкиОРП", Истина);
		КонецЕсли;	
		Если ПараметрыОтбора.Свойство("ВключаяОРП") Тогда
			ПараметрыВыбора.Вставить("ВключаяОРП", Истина);
		КонецЕсли;	
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыВыбора.Вставить("Период", Новый Структура("ИмяПараметра","Период"));
	КонецЕсли;
	
	Если Не ПустаяСтрока(НаименованиеТочки) Тогда
		 ПараметрыОтбор.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраПодобно", Новый Структура("ТочкаУчета", НаименованиеТочки), Неопределено)); 
	КонецЕсли;
	   	
	Если ТочкиСПриборами = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыВыбора);
	ИначеЕсли ТочкиСПриборами Тогда
		РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, ПараметрыВыбора);
	Иначе
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещенияБезПУ(Схема,ПараметрыВыбора);		
	КонецЕсли;
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			КонецДня(Период));
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);  
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргРаботаСТочкамиУчетаСервер.ДействующиеТочкиУчета";
		ПараметрыМетода 			= Новый Структура("Период,Организация,Район,КлючПомещения,ОбъектРасчета,ТочкиСПриборами,НаименованиеТочки,ПараметрыОтбора", Период, Организация,Район,КлючПомещения,ОбъектРасчета, ТочкиСПриборами, НаименованиеТочки, ПараметрыОтбора);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);		
	КонецЕсли;
	
	Возврат РезультатЗапроса;
		
КонецФункции

Функция СвойстваДействующихТочекУчета(Период, Организация,Район,КлючПомещения,ПолучаемыеСвойства,ТочкиСПриборами = Неопределено) Экспорт  
	
	Схема  							= Неопределено;
	
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("АбонентВладелец", "КлючПомещения"),	Неопределено));
	
	Параметры 						= Новый Структура;
		
	Если ЗначениеЗаполнено(Период) Тогда
		Параметры.Вставить("Период", Новый Структура("ИмяПараметра","Период"));
	КонецЕсли;
	
	ПараметрыОтбор  				= Новый Массив;
		
	Параметры.Вставить("ПараметрыВТ", 	ПараметрыВТ);
	Параметры.Вставить("Отбор", 		ПараметрыОтбор);
	
	Если ТочкиСПриборами = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,Параметры,"ДействующиеТочки");
	ИначеЕсли ТочкиСПриборами Тогда
		РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, Параметры,"ДействующиеТочки");
	Иначе
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещенияБезПУ(Схема,Параметры,"ДействующиеТочки");		
	КонецЕсли;
	
	мПолучаемыеСвойстваТочекУчета 		= СтрРазделить(ПолучаемыеСвойства,",");
	
	Если НЕ мПолучаемыеСвойстваТочекУчета.Найти("РасчетТолькоПоПоказаниям") = Неопределено Тогда
		РегистрыСведений.энргСвойствоРасчетТолькоПоПоказаниямТочекУчета.ЗначениеСвойстваРасчетТолькоПоПоказаниямТочекУчета(Схема,Параметры,"СвойствоРасчетТолькоПоПоказаниямТочекУчета");
	КонецЕсли;
	
	ТекстЗапроса = 	"ВЫБРАТЬ
	               	|	ДействующиеТочки.Организация КАК Организация,
	               	|	ДействующиеТочки.Район КАК Район,
	               	|	ДействующиеТочки.КлючПомещения КАК КлючПомещения,
	               	|	ДействующиеТочки.ТочкаУчета КАК ТочкаУчета
	               	|ИЗ
	               	|	ДействующиеТочки КАК ДействующиеТочки
	               	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПриборыТочекУчета.СрезПоследних(&Период, ) КАК энргПриборыТочекУчетаСрезПоследних
	               	|		ПО ДействующиеТочки.Организация = энргПриборыТочекУчетаСрезПоследних.Организация
	               	|			И ДействующиеТочки.Район = энргПриборыТочекУчетаСрезПоследних.Район
	               	|			И ДействующиеТочки.КлючПомещения = энргПриборыТочекУчетаСрезПоследних.КлючПомещения
	               	|			И ДействующиеТочки.ТочкаУчета = энргПриборыТочекУчетаСрезПоследних.ТочкаУчета
	               	|ГДЕ
	               	|	энргПриборыТочекУчетаСрезПоследних.ПриборУчета ЕСТЬ НЕ NULL";
	
	Пакет 								= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(ТекстЗапроса);
	ОператорВыбора 						= Пакет.Операторы[0];
	Если НЕ мПолучаемыеСвойстваТочекУчета.Найти("РасчетТолькоПоПоказаниям") = Неопределено Тогда
		Источник 						= ОператорВыбора.Источники.Добавить("СвойствоРасчетТолькоПоПоказаниямТочекУчета");
		
		УсловиеСоединения 				= Новый Массив;
		УсловиеСоединения.Добавить("ДействующиеТочки.Организация = СвойствоРасчетТолькоПоПоказаниямТочекУчета.Организация");
		УсловиеСоединения.Добавить("ДействующиеТочки.Район = СвойствоРасчетТолькоПоПоказаниямТочекУчета.Район");
		УсловиеСоединения.Добавить("ДействующиеТочки.КлючПомещения = СвойствоРасчетТолькоПоПоказаниямТочекУчета.КлючПомещения");
		УсловиеСоединения.Добавить("ДействующиеТочки.ТочкаУчета = СвойствоРасчетТолькоПоПоказаниямТочекУчета.ТочкаУчета");
		
		ОператорВыбора.Источники[0].Соединения.Добавить(Источник, СтрСоединить(УсловиеСоединения, Символы.ПС + " И "));
		
		ОператорВыбора.ВыбираемыеПоля.Добавить("ЕСТЬNULL(СвойствоРасчетТолькоПоПоказаниямТочекУчета.РасчетТолькоПоПоказаниям, ЛОЖЬ)");
		КолонкаЗапроса 					= Пакет.Колонки[Пакет.Колонки.Количество()-1];
		КолонкаЗапроса.Псевдоним 		= "РасчетТолькоПоПоказаниям"; 
	КонецЕсли;  	
	
	ПараметрыЗапроса 					= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			Период);
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);  
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);	
	
	РезультатЗапроса 					= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 						= "энргРаботаСТочкамиУчетаСервер.СвойстваДействующихТочекУчета";
		ПараметрыМетода 				= Новый Структура("Период, Организация,Район,КлючПомещения,ПолучаемыеСвойства,ТочкиСПриборами", Период, Организация,Район,КлючПомещения,ПолучаемыеСвойства,ТочкиСПриборами);
		слжОбщегоНазначенияМодуль 		= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);
	КонецЕсли;
	
	Возврат РезультатЗапроса
		
КонецФункции

Процедура АвтоПодборТочкиУчета(Период, Организация,Район,КлючПомещения, Текст, ДанныеВыбора, СтандартнаяОбработка) Экспорт 
	СтандартнаяОбработка	= Ложь;
	Результат  				= ДействующиеТочкиУчета(Период, Организация,Район,КлючПомещения,,,Текст);
	ДанныеВыбора 			= Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"));	
КонецПроцедуры

Функция ДействующиеТочкиУчетаМКД(Период, Организация,Район,МКД,ТочкиСПриборами = Неопределено, НаименованиеТочки = "") Экспорт  
	
	Схема  							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("МКД", 			"МКД"), 		Неопределено));
			
	ПараметрыВыбора	 				= Новый Структура("ПараметрыВТ", ПараметрыВТ);
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыВыбора.Вставить("Период", Новый Структура("ИмяПараметра","Период"));
	КонецЕсли;
	
	Если Не ПустаяСтрока(НаименованиеТочки) Тогда
		 ПараметрыВыбора.Вставить("Отбор", Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраПодобно", Новый Структура("ТочкаУчета", НаименованиеТочки), Неопределено)); 
	КонецЕсли;
	
	Если ТочкиСПриборами = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыВыбора);
	ИначеЕсли ТочкиСПриборами Тогда
		РегистрыСведений.энргСостояниеПриборовМКД.ДействующиеПриборыУчетаМКД(Схема, ПараметрыВыбора);
	Иначе
		РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчетаБезПУ(Схема,ПараметрыВыбора);
	КонецЕсли;
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			Период);
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);  
	ПараметрыЗапроса.Вставить("МКД",			МКД);
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргРаботаСТочкамиУчетаСервер.ДействующиеТочкиУчетаМКД";
		ПараметрыМетода 			= Новый Структура("Период, Организация,Район,МКД,ТочкиСПриборами, НаименованиеТочки", Период, Организация,Район,МКД,ТочкиСПриборами, НаименованиеТочки);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);	
	КонецЕсли;
	
	Возврат РезультатЗапроса;
		
КонецФункции

Функция ДанныеОбАвансеАбонента(Период, Организация, Район, Абонент) Экспорт 
	Граница = Новый Граница(Период, ВидГраницы.Включая);
	Запрос   		= Новый Запрос;
	Запрос.УстановитьПараметр("Период" ,			Граница);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Абонент",			Абонент);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргАвансыОстатки.СуммаОстаток КАК Аванс
	|ИЗ
	|	РегистрНакопления.энргАвансы.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент = &Абонент) КАК энргАвансыОстатки"; 

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Аванс) Тогда
		Возврат Выборка.Аванс; 
	Иначе	
		Возврат 0;
	КонецЕсли;
КонецФункции

Процедура УдалитьНезначащиеСтрокиВТочкахПоставок(ТекущийОбъект) Экспорт
	ТЧТочкиПоставок = ТекущийОбъект.ТочкиПоставок;
	ДанныеоТП 		= ТЧТочкиПоставок.Выгрузить();
	ТЧТочкиПоставок.Очистить();
	
	Для Каждого ТекСтрокаТУ из ТекущийОбъект.ТочкиУчета Цикл
		МассивТП = ДанныеоТП.НайтиСтроки(Новый Структура("IDСтроки", ТекСтрокаТУ.IDСтроки));
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(МассивТП, ТЧТочкиПоставок);		
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область ЗначениеПлощадей

Процедура УстановитьЗначениеПлощадиМКД(Движения,ДанныеШапки,ИмяКоллекции) Экспорт
	Набор  						= Движения.энргЗначениеПлощадейМКД;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  				= Набор.добавить();
		Запись.Период  			= ДанныеШапки.Дата;
		Запись.МКД  			= ДанныеШапки.МКД;
		Запись.ВидПлощади 		= стр.ВидПлощади;
		Запись.ЗначениеПлощади 	= стр.ЗначениеПлощади;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область ВидыБлагоустройства

Процедура УстановитьВидБлагоУстройстваМКД(Движения,ДанныеШапки) Экспорт
	Набор  							= Движения.энргВидБлагоустройствМКД;
	// для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.МКД  				= ДанныеШапки.МКД;
		Запись.ВидБлагоустройства	= ДанныеШапки.ВидБлагоустройства;
	// КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область ФормыУправления

Процедура УстановитьФормуУправленияМКД(Движения,ДанныеШапки) Экспорт
	Набор  							= Движения.энргФормыУправленияМКД;
	// для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Район  				= ДанныеШапки.район;
		Запись.Организация  		= ДанныеШапки.Организация;
		Запись.МКД  				= ДанныеШапки.МКД;
		Запись.ФормаУправления		= ДанныеШапки.ФормаУправления;
	// КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область Направление_Использования_Точек_Учета

Процедура УстановитьНаправлениеИспользованияТочекУчетаПоУмолчанию(Коллекция,Свойство  = Неопределено) Экспорт 
	
	//Если энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьНаправленияИспользованияТУ") Тогда
	//	 Возврат;
	//КонецЕсли;	
	//
	//НаправлениеИспользованияТУ 							= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
	//
	//Если Не Свойство = Неопределено Тогда
	//	Свойство 										= НаправлениеИспользованияТУ;
	//КонецЕсли;
	//
	//Если Не Коллекция = Неопределено Тогда
	//	Для Каждого СтрокаКоллекции Из Коллекция Цикл
	//		СтрокаКоллекции.НаправлениеИспользованияТУ 	= НаправлениеИспользованияТУ;
	//	КонецЦикла;	
	//КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗначенияИзмерителейТочекУчета(Движения,ДанныеШапки,ИмяКоллекции) Экспорт
	Набор  							= Движения.энргЗначенияИзмерителейТочекУчета;
	Выборка  						= ДанныеШапки[ИмяКоллекции].выбрать();
	Пока Выборка.следующий() цикл
		Запись 			= Набор.добавить();
		Запись.Период 	= ДанныеШапки.Дата;
		ЗаполнитьЗначенияСвойств(Запись,ДанныеШапки);
		ЗаполнитьЗначенияСвойств(Запись,Выборка); 		
	КонецЦикла; 
КонецПроцедуры

Процедура УстановитьНаправлениеИспользованияТочекУчета(Движения,ДанныеШапки,ИмяКоллекции) Экспорт
	
	НаправлениеИспользованияТУ = Неопределено;	
	Если НЕ энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьНаправленияИспользованияТУ") Тогда
		НаправлениеИспользованияТУ 				= Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление;
	КонецЕсли;
		
	Набор  										= Движения.энргНаправлениеИспользованияТочекУчета;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Если ЗначениеЗаполнено(стр.ТочкаУчета) тогда
			Запись  							= Набор.добавить();
			Запись.Период  						= ДанныеШапки.Дата;
			Запись.Район  						= ДанныеШапки.район;
			Запись.Организация  				= ДанныеШапки.Организация;
			Запись.КлючПомещения				= ДанныеШапки.КлючПомещения;
			Запись.ТочкаУчета 					= стр.ТочкаУчета;
			Запись.НаправлениеИспользованияТУ 	= ?(НаправлениеИспользованияТУ = Неопределено,стр.НаправлениеИспользованияТУ, НаправлениеИспользованияТУ);
			Запись.ПериодРегистрации			= ДанныеШапки.ПериодРегистрации;
			Запись.ПериодНачисления				= ДанныеШапки.ПериодНачисления;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область Диаметр_Сечения_Точек_Учета

Процедура УстановитьДиаметрСеченияТочекУчета(Движения, ДанныеШапки, ИмяКоллекции = "ТочкиУчета", ИгнорироватьПустые = "Истина") Экспорт
	Набор = Движения.энргДиаметрСеченияТочекУчета;
	Для Каждого Стр Из ДанныеШапки[ИмяКоллекции] Цикл
		Если ЗначениеЗаполнено(Стр.ТочкаУчета) И (Не ИгнорироватьПустые Или ЗначениеЗаполнено(Стр.ДиаметрСечения)) тогда
			Запись = Набор.добавить();
			ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);
			ЗаполнитьЗначенияСвойств(Запись, Стр);
			Запись.Период		= ДанныеШапки.Дата;        
			Запись.Использовать = Стр.РассчитыватьПоДиаметруСечения;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область ДанныеСтроения

&НаСервере
Функция УслугиМКД(Организация, Район, МКД, Период = '0001-01-01') Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И МКД = &МКД
	|				И Район = &Район) КАК энргАктивностьТочекУчетаМКДСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаМКД.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД)) КАК энргВладельцыТочекУчетаСрезПоследних
	|ГДЕ
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУчетаМКД.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ДействующиеТочкиУчета
	|ИЗ
	|	АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиУчетаМКД КАК ТочкиУчетаМКД
	|		ПО АктивныеТочкиУчетаМКД.ТочкаУчета = ТочкиУчетаМКД.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргУслугиТочекУчетаМКДСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиМКД
	|ИЗ
	|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И МКД = &МКД
	|					И Район = &Район
	|					И ТочкаУчета В
	|						(ВЫБРАТЬ
	|							ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета
	|						ИЗ
	|							ДействующиеТочкиУчета КАК ДействующиеТочкиУчета)) КАК энргУслугиТочекУчетаМКДСрезПоследних
	|		ПО ДействующиеТочкиУчета.ТочкаУчета = энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	энргСтроенияВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройства,
	|	энргСтроенияВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиМКД.Услуга КАК Услуга
	|	ИЗ
	|		УслугиМКД КАК УслугиМКД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО УслугиМКД.Услуга = энргВидыУслуг.Ссылка
	|				И (НЕ энргВидыУслуг.СоставнаяУслуга)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргВидыУслугСоставляющиеУслуг.Услуга
	|	ИЗ
	|		УслугиМКД КАК УслугиМКД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|			ПО УслугиМКД.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.ВидыБлагоустройстваТарифныеКатегории КАК энргСтроенияВидыБлагоустройстваТарифныеКатегории
	|		ПО ВложенныйЗапрос.Услуга = энргСтроенияВидыБлагоустройстваТарифныеКатегории.Услуга
	|			И (энргСтроенияВидыБлагоустройстваТарифныеКатегории.Ссылка = &МКД)";
	
	Запрос 				= Новый Запрос(Текст); 		
	Запрос.УстановитьПараметр("Организация"	,Организация);
	Запрос.УстановитьПараметр("Район"		,Район);
	Запрос.УстановитьПараметр("МКД"			,МКД);
	Запрос.УстановитьПараметр("Период"		,Период);
	
	УслугиМКД  			= Новый Соответствие;
	
	Результат		 	= Запрос.Выполнить();
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		УслугиМКД.Вставить(Выборка.Услуга, Новый Структура("ВидБлагоустройства, ТарифнаяКатегория", Выборка.ВидБлагоустройства, Выборка.ТарифнаяКатегория));
	КонецЦикла;
	
	Возврат УслугиМКД;
	
КонецФункции

Процедура УстановитьТУМКДНаСтруктуруСети(ДанныеШапки,Движения,ИмяКоллекции) Экспорт
	Набор  							= Движения.энргТУМКДНаСтруктуреСети;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Организация 			= ДанныеШапки.Организация;
		Запись.Район 				= ДанныеШапки.Район;
		Запись.Строение		 		= ДанныеШапки.МКД;
		Запись.ТочкаУчета 			= стр.ТочкаУчета;
		Запись.СтруктураСети		= стр.СтруктураСети;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления; 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедуры

Функция ВсеУслугиТочкиУчета(Организация, Район, КлючПомещения, ТочкаУчета) Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	энргВидыУслуг.СоставнаяУслуга КАК СоставнаяУслуга
	|ПОМЕСТИТЬ УслугиТочек
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		энргУслугиТочекУчета.Услуга КАК Услуга
	|	ИЗ
	|		РегистрСведений.энргУслугиТочекУчета КАК энргУслугиТочекУчета
	|	ГДЕ
	|		энргУслугиТочекУчета.Организация = &Организация
	|		И энргУслугиТочекУчета.Район = &Район
	|		И энргУслугиТочекУчета.КлючПомещения = &КлючПомещения
	|		И энргУслугиТочекУчета.ТочкаУчета = &ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	УслугиТочек КАК УслугиТочек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО УслугиТочек.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|			И (УслугиТочек.СоставнаяУслуга)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиТочек.Услуга
	|ИЗ
	|	УслугиТочек КАК УслугиТочек";
	
	Запрос  	= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("КлючПомещения", 	КлючПомещения);
	Запрос.УстановитьПараметр("ТочкаУчета", 	ТочкаУчета);
	
	Результат  = Запрос.Выполнить();
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Услуга");
	
КонецФункции

Функция УслугаТочкиУчета(Организация, Район, КлючПомещения, ТочкаУчета, Период = '0001-01-01') Экспорт 
	
	Текст  =
	"ВЫБРАТЬ
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И ТочкаУчета = &ТочкаУчета) КАК энргУслугиТочекУчетаСрезПоследних";
	
	Запрос 			= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("КлючПомещения", 	КлючПомещения);
	Запрос.УстановитьПараметр("ТочкаУчета",		ТочкаУчета);
	Результат  		= Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.энргВидыУслуг.ПустаяСсылка();
	КонецЕсли;
	
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Услуга;
	
КонецФункции

Функция ВидыОперацийСПриборомУчета() Экспорт 
	
	Результат  = Новый Массив;
	Результат.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ);
	Результат.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ);
	Результат.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ);
	Возврат Результат;
	
КонецФункции

Функция УслугаТочкиУчетаМКД(Организация, Район, МКД, ТочкаУчета, Период = '0001-01-01') Экспорт 
	
	Текст  =
	"ВЫБРАТЬ
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И ТочкаУчета = &ТочкаУчета) КАК энргУслугиТочекУчетаСрезПоследних";
	
	Запрос 			= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("МКД", 			МКД);
	Запрос.УстановитьПараметр("ТочкаУчета",		ТочкаУчета);
	Результат  		= Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.энргВидыУслуг.ПустаяСсылка();
	КонецЕсли;
	
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Услуга;
	
КонецФункции

Функция УслугиТочекОтлючены(ПараметрыОперации) Экспорт 
	Запрос  =		Новый Запрос;
	Запрос.установитьПараметр("МоментВремени",		ПараметрыОперации.МоментВремени);
	Запрос.установитьПараметр("Район",				ПараметрыОперации.Район);
	Запрос.установитьПараметр("КлючПомещения",		ПараметрыОперации.КлючПомещения);
	Запрос.установитьПараметр("МассивТочекУчета",	ПараметрыОперации.МассивТочекУчета);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|			&МоментВремени,
	|			Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И ТочкаУчета В (&МассивТочекУчета)) КАК энргАктивностьТочекУчетаСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)";
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
КонецФункции

Функция ПриборыВыведены(ПараметрыОперации) Экспорт 
	Запрос  =		Новый Запрос;
	Запрос.установитьПараметр("МоментВремени",			ПараметрыОперации.МоментВремени);
	Запрос.установитьПараметр("Район",					ПараметрыОперации.Район);
	Запрос.установитьПараметр("Организация",			ПараметрыОперации.Организация);
	Запрос.установитьПараметр("КлючПомещения",			ПараметрыОперации.КлючПомещения);
	Запрос.установитьПараметр("МассивТочекУчета",		ПараметрыОперации.МассивТочекУчета);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргПриборыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргПриборыТочекУчетаСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочек
	|ИЗ
	|	РегистрСведений.энргПриборыТочекУчета.СрезПоследних(
	|			&МоментВремени,
	|			Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И Организация = &Организация
	|				И ТочкаУчета В (&МассивТочекУчета)) КАК энргПриборыТочекУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.ПриборУчета КАК ПриборУчета
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовУчетаАбонента.СрезПоследних(
	|			&МоментВремени,
	|			Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И Организация = &Организация
	|				И ТочкаУчета В (&МассивТочекУчета)
	|				И (ТочкаУчета, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ПриборыТочек.ТочкаУчета,
	|						ПриборыТочек.ПриборУчета
	|					ИЗ
	|						ПриборыТочек КАК ПриборыТочек)) КАК энргСостояниеПриборовУчетаАбонентаСрезПоследних
	|ГДЕ
	|	энргСостояниеПриборовУчетаАбонентаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеприборовУчета.Ввод)";
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
КонецФункции

Функция ФормулыРасчетаТочекУчета(ТочкиПоФормуле,Организация,Район,КлючПомещения,Период) Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",				Период);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("КлючПомещения",		КлючПомещения);
	Запрос.УстановитьПараметр("ТочкиПоФормуле",		ТочкиПоФормуле);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ТочкиПоФормуле.НомерСтроки КАК НомерСтроки,
	|	ТочкиПоФормуле.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиПоФормуле
	|ИЗ
	|	&ТочкиПоФормуле КАК ТочкиПоФормуле
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Коэффициент КАК Коэффициент
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТочкиПоФормуле.НомерСтроки КАК НомерСтроки,
	|		энргФормулыРасчетаТочекУчетаСрезПоследних.КлючПомещенияИсточник КАК КлючПомещения,
	|		энргФормулыРасчетаТочекУчетаСрезПоследних.ТочкаИсточник КАК ТочкаУчета,
	|		энргФормулыРасчетаТочекУчетаСрезПоследних.Коэффициент КАК Коэффициент
	|	ИЗ
	|		ТочкиПоФормуле КАК ТочкиПоФормуле
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета.СрезПоследних(
	|					&Период,
	|					Организация = &Организация
	|						И Район = &Район
	|						И КлючПомещения = &КлючПомещения
	|						И РассчитываемаяТочка В
	|							(ВЫБРАТЬ
	|								ТочкиПоФормуле.ТочкаУчета
	|							ИЗ
	|								ТочкиПоФормуле КАК ТочкиПоФормуле)) КАК энргФормулыРасчетаТочекУчетаСрезПоследних
	|			ПО ТочкиПоФормуле.ТочкаУчета = энргФормулыРасчетаТочекУчетаСрезПоследних.РассчитываемаяТочка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ЗаполнитьДанныеДляФормулРасчета(ДокументОбъект) Экспорт  
		Запрос  										= Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументОбъект.Ссылка);
	Запрос.Текст 									= 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргОперацияСЛицевымСчетомТочкиУчета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	|		ПО энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета = энргТочкиУчета.Ссылка
	|			И (энргТочкиУчета.Головная)
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка = &ДокументСсылка)";
	Результат 										= Запрос.Выполнить();
	
	Если Не Результат.Пустой() тогда
		ДокументыПоОснованию 						= КритерииОтбора.СвязанныеДокументы.Найти(ДокументОбъект.ссылка);		
		
		ФормулаПоОснованию 							= Новый Массив;
		
		Для Каждого документ из  ДокументыПоОснованию цикл
			Если ТипЗнч(документ) = Тип("ДокументСсылка.энргУстановитьФормулуРасчетаТочекУчета") тогда
				ФормулаПоОснованию.Добавить(документ);
			КонецЕсли;		
		КонецЦикла; 	
		
		УстановкаФормулыРасчета 					= Новый Структура;
		ДанныеЗаполнения  							= Новый Структура("Район,МКД,Абонент,АдресОбъекта,ЛицевойСчет,Дата,ДатаФактическогоСобытия,ПериодНачисления");
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ДокументОбъект);
		ДанныеЗаполнения.Дата 						= ДокументОбъект.Дата + 1;
		ДанныеЗаполнения.Вставить("ДокументОснование",ДокументОбъект.ссылка);		
		Если ФормулаПоОснованию.Количество() > 1 тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено более одного документа установки формулы расчета");
		ИначеЕсли ФормулаПоОснованию.Количество() = 0 тогда
			УстановкаФормулыРасчета.Вставить("ДанныеЗаполнения",	ДанныеЗаполнения);
		иначе
			УстановкаФормулыРасчета.Вставить("Ключ",				ФормулаПоОснованию[0]);
			УстановкаФормулыРасчета.Вставить("ДанныеЗаполнения",	ДанныеЗаполнения);
		КонецЕсли;
		ДокументОбъект.ДополнительныеСвойства.вставить("УстановкаФормулыРасчета",УстановкаФормулыРасчета);		
	КонецЕсли;
КонецПроцедуры

Функция ЗадолженностьАбонента(Период,Организация,Район,Дом,Абонент) Экспорт  
	Запрос   		= Новый Запрос;
	Запрос.УстановитьПараметр("Период" ,Период);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Район",Район);
	Запрос.УстановитьПараметр("МКД",Дом);
	Запрос.УстановитьПараметр("Абонент",Абонент);
	Запрос.Текст 	="ВЫБРАТЬ
	             	 |	энргВзаиморасчетыОстатки.СуммаОстаток КАК Задолженность
	             	 |ИЗ
	             	 |	РегистрНакопления.энргВзаиморасчеты.Остатки(
	             	 |			&Период,
	             	 |			Организация = &Организация
	             	 |				И Район = &Район
	             	 |				И МКД = &МКД
	             	 |				И Абонент = &Абонент) КАК энргВзаиморасчетыОстатки";
	
	Результат  = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Задолженность = Выборка.Задолженность;
	Иначе
		Задолженность = 0;
	КонецЕсли;
	
	Возврат Задолженность;
	
КонецФункции

Функция ФиксированныеОбъемыРазделенныхЛС(ДокументСсылка)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ТаблицаАбоненты.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаФиксОбъемы.ФиксированныйОбъемПотребления КАК ОбъемПотребления,
	|	ТаблицаАбоненты.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	Документ.энргСоглашениеОПотребленииВПомещении.Абоненты КАК ТаблицаАбоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСоглашениеОПотребленииВПомещении.ФиксированныеОбъемы КАК ТаблицаФиксОбъемы
	|		ПО ТаблицаАбоненты.Ссылка = ТаблицаФиксОбъемы.Ссылка
	|			И (ТаблицаАбоненты.Ссылка = &ДокументСсылка)
	|			И (ТаблицаФиксОбъемы.Ссылка = &ДокументСсылка)
	|			И ТаблицаАбоненты.IDСтроки = ТаблицаФиксОбъемы.IDСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДолиПотребленияРазделенныхЛС(ДокументСсылка)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ТаблицаАбоненты.ТочкаУчета КАК ТочкаУчета,
	|	ДолиРаспределения.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	ДолиРаспределения.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	ТаблицаАбоненты.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	Документ.энргСоглашениеОПотребленииВПомещении.Абоненты КАК ТаблицаАбоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСоглашениеОПотребленииВПомещении.ДолиРаспределенияОбъемаПомещения КАК ДолиРаспределения
	|		ПО ТаблицаАбоненты.Ссылка = ДолиРаспределения.Ссылка
	|			И (ТаблицаАбоненты.Ссылка = &ДокументСсылка)
	|			И (ДолиРаспределения.Ссылка = &ДокументСсылка)
	|			И ТаблицаАбоненты.IDСтроки = ДолиРаспределения.IDСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура УстановитьТУНаСтруктуруСети(ДанныеШапки,Движения,ИмяКоллекции) Экспорт
	Набор  					= Движения.бестТУНаСтруктуреСети;
	для Каждого стр из ДанныеШапки[ИмяКоллекции] цикл
		Запись  					= Набор.добавить();
		Запись.Период  				= ДанныеШапки.Дата;
		Запись.Организация 			= ДанныеШапки.Организация;
		Запись.Район 				= ДанныеШапки.Район;
		Запись.КлючПомещения 		= ДанныеШапки.КлючПомещения;
		Запись.ТочкаУчета 			= стр.ТочкаУчета;
		Запись.СтруктураСети		= стр.СтруктураСети;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления; 
	КонецЦикла; 
КонецПроцедуры

Функция ТочкиУчетаИВозможностьУстановкиПУ(Граница, Организация, Район, КлючПомещения, мТочкиУчета = Неопределено) Экспорт
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("АбонентВладелец", "КлючПомещения"),	Неопределено));
	
	Если НЕ мТочкиУчета = Неопределено и ТипЗнч(мТочкиУчета) = Тип("Массив") Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВСписке", Новый Структура("ТочкаУчета", "мТочкиУчета"), 	Неопределено));
	ИначеЕсли НЕ мТочкиУчета = Неопределено и ТипЗнч(мТочкиУчета) = Тип("СправочникСписок.энргТочкиУчета") Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета", 	"мТочкиУчета"), 	Неопределено));
	КонецЕсли;
	
	Параметры 		= Новый Структура;	
	Параметры.Вставить("Период", 			Новый Структура("ТипПараметра,ИмяПараметра", "ТипПараметраГраницаИсключая", "Период"));
	Параметры.Вставить("Граница", 			Новый Структура("ТипПараметра,ИмяПараметра", "ТипПараметраГраницаИсключая", "Граница"));
	Если ТипЗнч(Граница) = Тип("Дата") и НЕ ЗначениеЗаполнено(Граница) Тогда
		 Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);		
		
	РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещенияБезПУ(Схема, Параметры, "ДействующиеТочкиБезПУ");
	РегистрыСведений.энргТехническаяВозможностьУстановкиПУ.ТехническаяВозможностьУстановкиПУТочекУчета(Схема,Параметры,"ТехническаяВозможностьУстановкиПУТочекУчета");
		
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДействующиеТочки.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(ТехническаяВозможностьУстановкиПУТочекУчета.НетВозможностьУстановкиПУ, ЛОЖЬ) КАК НетВозможностьУстановкиПУ	
	|ИЗ
	|	ДействующиеТочкиБезПУ КАК ДействующиеТочки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТехническаяВозможностьУстановкиПУТочекУчета КАК ТехническаяВозможностьУстановкиПУТочекУчета
	|		ПО ДействующиеТочки.ТочкаУчета = ТехническаяВозможностьУстановкиПУТочекУчета.ТочкаУчета
	|			И ДействующиеТочки.КлючПомещения = ТехническаяВозможностьУстановкиПУТочекУчета.КлючПомещения
	|			И ДействующиеТочки.Район = ТехническаяВозможностьУстановкиПУТочекУчета.Район
	|			И ДействующиеТочки.Организация = ТехническаяВозможностьУстановкиПУТочекУчета.Организация");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("Район", 			Район);
	ПараметрыЗапроса.Вставить("КлючПомещения", 	КлючПомещения);	
	ПараметрыЗапроса.Вставить("мТочкиУчета"	, 	мТочкиУчета);	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",				?(ТипЗнч(Граница) = Тип("Граница"), Граница.Значение.Дата, Граница));
	Иначе
		ПараметрыЗапроса.Вставить("Период",				ТекущаяДата());
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Граница",				Граница);
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргРаботаСТочкамиУчетаСервер.ТочкиУчетаИВозможностьУстановкиПУ";
		ПараметрыМетода 			= Новый Структура("Период, Организация, Район, КлючПомещения, мТочкиУчета", Граница, Организация, Район, КлючПомещения, мТочкиУчета);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);
	КонецЕсли;	
	
	Возврат РезультатЗапроса;  	

КонецФункции

Функция НаправлениеИспользованияТочкиУчета(Организация, Район, КлючПомещения, ТочкаУчета, Период = '0001-01-01') Экспорт 
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНаправлениеИспользованияТочекУчетаСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ИЗ
	|	РегистрСведений.энргНаправлениеИспользованияТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И ТочкаУчета = &ТочкаУчета) КАК энргНаправлениеИспользованияТочекУчетаСрезПоследних";
	
	Запрос 			= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("КлючПомещения", 	КлючПомещения);
	Запрос.УстановитьПараметр("ТочкаУчета",		ТочкаУчета);
	Результат  		= Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.НаправлениеИспользованияТУ;
	
КонецФункции

Функция УслугиИТехническаяТочекУчета(Организация, Район, КлючПомещения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга,
		|	энргУслугиТочекУчетаСрезПоследних.Техническая КАК Техническая,
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргУслугиТочекУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И Район = &Район
		|					И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|		ПО энргУслугиТочекУчетаСрезПоследних.ТочкаУчета = энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = &Включена";
	
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Включена", Перечисления.энргСостояниеТочекУчета.Включена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ТочкиУчетаНаСтруктуреСети(Организация, Район, КлючПомещения, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивТУ.Организация КАК Организация,
		|	АктивТУ.Район КАК Район,
		|	АктивТУ.КлючПомещения КАК КлючПомещения,
		|	АктивТУ.ТочкаУчета КАК ТочкаУчета,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВТ_ТочкиУчетаАбонента
		|ИЗ
		|	(ВЫБРАТЬ
		|		энргАктивностьТочекУчетаСрезПоследних.Организация КАК Организация,
		|		энргАктивностьТочекУчетаСрезПоследних.Район КАК Район,
		|		энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|		энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|	ИЗ
		|		РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|				&Период,
		|				КлючПомещения = &КлючПомещения
		|					И Организация = &Организация
		|					И Район = &Район) КАК энргАктивностьТочекУчетаСрезПоследних
		|	ГДЕ
		|		энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(перечисление.энргСостояниеТочекУчета.включена)) КАК АктивТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|				&Период,
		|				КлючПомещения = &КлючПомещения
		|					И Организация = &Организация
		|					И Район = &Район) КАК энргУслугиТочекУчетаСрезПоследних
		|		ПО АктивТУ.Организация = энргУслугиТочекУчетаСрезПоследних.Организация
		|			И АктивТУ.Район = энргУслугиТочекУчетаСрезПоследних.Район
		|			И АктивТУ.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
		|			И АктивТУ.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТочкиУчетаАбонента.Организация КАК Организация,
		|	ВТ_ТочкиУчетаАбонента.Район КАК Район,
		|	ВТ_ТочкиУчетаАбонента.КлючПомещения КАК КлючПомещения,
		|	ВТ_ТочкиУчетаАбонента.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТочкиУчетаАбонента.Услуга КАК Услуга,
		|	бестТУНаСтруктуреСетиСрезПоследних.СтруктураСети КАК СтруктураСети
		|ИЗ
		|	ВТ_ТочкиУчетаАбонента КАК ВТ_ТочкиУчетаАбонента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТУНаСтруктуреСети.СрезПоследних(
		|				&Период,
		|				КлючПомещения = &КлючПомещения
		|					И Организация = &Организация
		|					И Район = &Район) КАК бестТУНаСтруктуреСетиСрезПоследних
		|		ПО ВТ_ТочкиУчетаАбонента.Организация = бестТУНаСтруктуреСетиСрезПоследних.Организация
		|			И ВТ_ТочкиУчетаАбонента.Район = бестТУНаСтруктуреСетиСрезПоследних.Район
		|			И ВТ_ТочкиУчетаАбонента.КлючПомещения = бестТУНаСтруктуреСетиСрезПоследних.КлючПомещения
		|			И ВТ_ТочкиУчетаАбонента.ТочкаУчета = бестТУНаСтруктуреСетиСрезПоследних.ТочкаУчета";
	
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область РаботаСУзламиФизЛиц 

Функция ИспользоватьУзлыФизЛиц() Экспорт
	Возврат энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргУзлыУчетаФизическихЛиц");
КонецФункции

Функция ИспользоватьУзлыМКД() Экспорт
	
	Возврат Истина;
	
	//ЗаголовокСистемы = энргОбщегоНазначения.ЗначениеКонстанты("ЗаголовокСистемы");
	//Результат = СтрНачинаетсяС(ЗаголовокСистемы, "УзлыМКД");
	//Возврат Результат;
	
КонецФункции

Процедура ПолучитьВходныеДанныеТабЧастейУзла(ПараметрыПередачи, ТекущийОбъект, СоответствиеТаблиц) Экспорт	
	ИдентификаторФормы = ПараметрыПередачи.ИдентификаторФормы;	
	
	Для Каждого ТекКлючЗначение из СоответствиеТаблиц Цикл
		Если ТекКлючЗначение.Значение = "" тогда
			ПараметрыПередачи[ТекКлючЗначение.Ключ]	= "";
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийОбъект,ТекКлючЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
				
		ПараметрыПередачи[ТекКлючЗначение.Ключ]	= ПоместитьВоВременноеХранилище(ТекущийОбъект[ТекКлючЗначение.Значение].Выгрузить(), ИдентификаторФормы);
	КонецЦикла; 	
КонецПроцедуры

Процедура ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, ТекущийОбъект, ВидОперации) Экспорт	
	ПараметрыПередачи.ТочкиУчета 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.ТочкиУчета.Выгрузить());
	ПараметрыПередачи.Измерители 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.Измерители.Выгрузить());
	ПараметрыПередачи.ШкалыИзмерителей			= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.ШкалыИзмерителей.Выгрузить());
	ПараметрыПередачи.ШкалыПриборовУчета 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.ШкалыПриборовУчета.Выгрузить());
	ПараметрыПередачи.ПоказанияПриборовУчета 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.ПоказанияПриборовУчета.Выгрузить());	
	ПараметрыПередачи.НомераПломб 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.НомераПломб.Выгрузить());	
	
	ПараметрыПередачи.ЗначенияИзмерителей 		= Новый Массив;	
	ПараметрыПередачи.ПоставщикиСоставныхУслуг 	= Новый Массив;
	ПараметрыПередачи.Потери 					= Новый Массив;
	
	Если НЕ ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ Тогда
		ПараметрыПередачи.ЗначенияИзмерителей 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.ЗначенияИзмерителей.Выгрузить());	
		ПараметрыПередачи.ПоставщикиСоставныхУслуг 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.ПоставщикиСоставныхУслуг.Выгрузить());
		ПараметрыПередачи.Потери 					= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТекущийОбъект.Потери.Выгрузить());
	КонецЕсли;
		
КонецПроцедуры

#Область ВспомогательныеМетоды 

Функция ПолучитьКлючиЗаполненияТочекУчета() Экспорт
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияТочекУчета();
КонецФункции

Функция СоответствиеТаблицЗаполненияОбщая() Экспорт
	Соответствие = Новый Структура;
	
	Соответствие.Вставить("ТочкиУчета"				, "ТочкиУчета");
	Соответствие.Вставить("Измерители"				, "Измерители");
	Соответствие.Вставить("ШкалыИзмерителей"		, "ШкалыИзмерителей");
	Соответствие.Вставить("ШкалыПриборовУчета"		, "ШкалыПриборовУчета");
	Соответствие.Вставить("ПоказанияПриборовУчета"	, "ПоказанияПриборовУчета");
	Соответствие.Вставить("ЗначенияИзмерителей"		, "ЗначенияИзмерителей");
	Соответствие.Вставить("Потери"					, "Потери");
	Соответствие.Вставить("ПоставщикиСоставныхУслуг", "ПоставщикиСоставныхУслуг");
	Соответствие.Вставить("НомераПломб"				, "НомераПломб");
		
	Возврат Соответствие;
КонецФункции

Функция СоответствиеТаблицЗаполненияМКД(ВидОперации) Экспорт
	Соответствие = СоответствиеТаблицЗаполненияОбщая();
	Соответствие.ЗначенияИзмерителей 	= "";
		
	Если НЕ ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ") Тогда
		//Соответствие.ПоставщикиСоставныхУслуг = "";
		// при выборе составной услуги в Открытие МКД была ошибка и не заполнялись поставщики
	КонецЕсли;	
	
	Возврат Соответствие;
КонецФункции

Функция ПолучитьПризнакРаспределения(Период, ДанныеСтроения, ФормаУправления) Экспорт 
	Возврат	РегистрыСведений.энргФормыУправленияМКД.ПолучитьПризнакРаспределения(Период, ДанныеСтроения, ФормаУправления);
КонецФункции

#Область РаботаССредствамиИзмерений

Функция ПолучитьКлючиЗаполненияСредствИзмерений() Экспорт 
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияСредствИзмерений();
КонецФункции

Функция ПолучитьОписаниеСтруктурыДанныхПУ() Экспорт 	
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьОписаниеСтруктурыДанныхПУ();
КонецФункции

Процедура ДополнитьТаблицыВВходныеДанныеСредствИзмерений(Объект, СредстваИзмерений, IDСтроки) Экспорт 
	СредстваИзмерений.Измерители 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Измерители.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	СредстваИзмерений.ШкалыПриборовУчета 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ШкалыПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	СредстваИзмерений.ПоказанияПриборовУчета 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ПоказанияПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));	
	СредстваИзмерений.ШкалыИзмерителей 			= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ШкалыИзмерителей.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	СредстваИзмерений.НомераПломб 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.НомераПломб.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	Если Объект.Свойство("ФормулыРасчетаУслуг") Тогда
		СредстваИзмерений.ФормулыРасчетаУслуг 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ФормулыРасчетаУслуг.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	Иначе
		СредстваИзмерений.ФормулыРасчетаУслуг 		= Новый Массив;
	КонецЕсли;
КонецПроцедуры

// Обработка результата

Процедура ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, IDСтрокиТочкиУчета, Результат, ДанныеПУ, ДанныеОчистки = Неопределено) Экспорт 
	
	
	ДополнитьТаблицуПоID(Объект.Измерители				, Результат.Измерители				, IDСтрокиТочкиУчета	, ДанныеПУ, ?(ДанныеОчистки <> Неопределено И ДанныеОчистки.Свойство("Измерители"),ДанныеОчистки.Измерители,Неопределено));
	ДополнитьТаблицуПоID(Объект.ШкалыПриборовУчета		, Результат.ШкалыПриборовУчета		, IDСтрокиТочкиУчета,,?(ДанныеОчистки <> Неопределено И ДанныеОчистки.Свойство("ШкалыПриборовУчета"),ДанныеОчистки.ШкалыПриборовУчета,Неопределено));
	ДополнитьТаблицуПоID(Объект.ШкалыИзмерителей		, Результат.ШкалыИзмерителей		, IDСтрокиТочкиУчета,,?(ДанныеОчистки <> Неопределено И ДанныеОчистки.Свойство("ШкалыИзмерителей"),ДанныеОчистки.ШкалыИзмерителей,Неопределено));
	ДополнитьТаблицуПоID(Объект.ПоказанияПриборовУчета	, Результат.ПоказанияПриборовУчета	, IDСтрокиТочкиУчета,,?(ДанныеОчистки <> Неопределено И ДанныеОчистки.Свойство("ПоказанияПриборовУчета"),ДанныеОчистки.ПоказанияПриборовУчета,Неопределено));
	ДополнитьТаблицуПоID(Объект.НомераПломб				, Результат.НомераПломб				, IDСтрокиТочкиУчета,,?(ДанныеОчистки <> Неопределено И ДанныеОчистки.Свойство("НомераПломб"),ДанныеОчистки.НомераПломб,Неопределено));
	Если Объект.Свойство("ФормулыРасчетаУслуг") Тогда
		ДополнитьТаблицуПоID(Объект.ФормулыРасчетаУслуг				, Результат.ФормулыРасчетаУслуг				, IDСтрокиТочкиУчета,,?(ДанныеОчистки <> Неопределено И ДанныеОчистки.Свойство("ФормулыРасчетаУслуг"),ДанныеОчистки.ФормулыРасчетаУслуг,Неопределено));
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьТаблицуПоID(ТаблицаПриемник, ТаблицаИсточник, IDСтроки, ДанныеПУ = Неопределено, ДанныеОчистки = Неопределено)
	Если ДанныеОчистки = Неопределено Тогда 
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТаблицаПриемник, Новый Структура("IDСтрокиТочкиУчета", IDСтроки)); 
	Иначе
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(ТаблицаПриемник, ДанныеОчистки);
	КонецЕсли;
	
	ДанныеПУЗаполнены = Ложь;
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		НоваяСтрока 					= ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник);
		
		Если НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаТаблицыИсточник,"IDСтрокиТочкиУчета") = Неопределено Тогда
			СтрокаТаблицыИсточник.IDСтрокиТочкиУчета = IDСтроки;
		КонецЕсли; 		
		
		НоваяСтрока.IDСтрокиТочкиУчета 	= IDСтроки;
				
		Если НЕ ДанныеПУ = Неопределено И НЕ ДанныеПУЗаполнены И НЕ НоваяСтрока.ВспомогательноеОборудование Тогда
			ЗаполнитьЗначенияСвойств(ДанныеПУ, НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти  

#Область СтруктураДанныхЗаполненияТекстовПолей

Функция ПолучитьСтруктуруДанныхУслуги() Экспорт	
	Возврат Новый Структура("Услуга, Поставщик");	
КонецФункции

Функция ПолучитьСтруктуруДанныеРасположения() Экспорт
	Возврат Новый Структура("СтруктураСети, Расположение, НаименованиеТочки");	
КонецФункции

Функция ПолучитьСтруктуруТехническиеСвойства() Экспорт
	Возврат Новый Структура("IDСтроки, Техническая, НетВозможностьУстановкиПУ, РасчетТолькоПоПоказаниям, РассчитыватьПоДиаметруСечения, ДиаметрСечения");	
КонецФункции

#КонецОбласти

#Область ЗаполнениеТекстовПолей

Процедура ЗаполнитьТекстовыеПоляКоллекцииМКД(Форма) Экспорт   	
	ТочкиУчета	= Форма.Объект["ТочкиУчета"];	
	Измерители 	= Форма.Объект["Измерители"];
	Потери 		= Форма.Объект["Потери"]; 	
	
	Для Каждого ТекСтрока из ТочкиУчета Цикл
		Если ТекСтрока.Услуга.СоставнаяУслуга Тогда
			ПредставлениеПоставщика  								= "";
			СтрокиТЧ 	=  Форма.Объект["ПоставщикиСоставныхУслуг"].НайтиСтроки(Новый Структура("IDСтроки",ТекСтрока.IDСтроки));
			Для Каждого Строка Из СтрокиТЧ Цикл
				Представление = Строка.Поставщик;
				ПредставлениеПоставщика 							= ПредставлениеПоставщика + ?(ЗначениеЗаполнено(ПредставлениеПоставщика),"/","") + Представление;
			КонецЦикла;
			Поставщик = ПредставлениеПоставщика;
			ТекСтрока.ДанныеУслуги 			= ЗаполнитьТекстДанныеУслуги(ТекСтрока, Поставщик);
		Иначе
			ТекСтрока.ДанныеУслуги 			= ЗаполнитьТекстДанныеУслуги(ТекСтрока);
		КонецЕсли;
		
		ТекСтрока.ДанныеРасположения 	= ЗаполнитьТекстДанныеРасположения(ТекСтрока); 		
		ТекСтрока.ТехническиеСвойстваТУ	= ЗаполнитьТекстТехническихСвойств(ТекСтрока, Потери.НайтиСтроки(Новый Структура("IDСтроки", ТекСтрока.IDСтроки)), "МКД");
		
		ДанныеИзмерителей = Новый Структура("Измерители", Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
		
		ОбновитьТекстовыеПоляКоллекцииМКДПереопределяемый(ТекСтрока);		 		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьТекстовыеПоляКоллекцииМКДПереопределяемый(ТекСтрока)
	
КонецПроцедуры

Функция ЗаполнитьТекстДанныеУслуги(ТекущиеДанные, Поставщик = Неопределено) Экспорт 	
	Текст = "Услуга = " + ТекущиеДанные.Услуга + Символы.ПС;
	Текст = Текст + "Ед.изм = " + энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Услуга, "ЕдиницаИзмерения") + Символы.ПС;
	Если Поставщик = Неопределено Тогда
		Текст = Текст + "Поставщик = " + ТекущиеДанные.Поставщик.Наименование;
	Иначе
		Текст = Текст + "Поставщик = " + Поставщик;
	КонецЕсли;
	
	Возврат Текст; 	
КонецФункции

Функция ЗаполнитьТекстДанныеРасположения(ТекущиеДанные) Экспорт
	СтруктураСети = "";
	Если ТекущиеДанные.свойство("СтруктураСети") Тогда
		СтруктураСети = ТекущиеДанные.СтруктураСети;
	ИначеЕсли ТекущиеДанные.свойство("бестСтруктураСети") Тогда
		СтруктураСети = ТекущиеДанные.бестСтруктураСети;
	КонецЕсли; 	
	
	Текст = "Структура сети = " + СтруктураСети + Символы.ПС;
	Текст = Текст + "Расположение = " + ТекущиеДанные.Расположение + Символы.ПС;
	Текст = Текст + "Наименование точки = " + ТекущиеДанные.НаименованиеТочки;	 	
	
	Возврат Текст;
КонецФункции

Функция ПолучитьСхемуРасположения(ТекущиеДанные) Экспорт
	СтруктураСети = "";
	Если ТекущиеДанные.свойство("СтруктураСети") Тогда
		СтруктураСети = ТекущиеДанные.СтруктураСети;
	ИначеЕсли ТекущиеДанные.свойство("бестСтруктураСети") Тогда
		СтруктураСети = ТекущиеДанные.бестСтруктураСети;
	КонецЕсли; 	
	
	Текст = "" + СтруктураСети;
	Возврат Текст;
КонецФункции

Функция ЗаполнитьТекстТехническихСвойств(ТекущиеДанные, Потери, ВызывающаяПодсистема = "") Экспорт 
	
	Если ВызывающаяПодсистема = "МКД" Тогда
		Возврат	ЗаполнитьТекстТехническихСвойствМКД(ТекущиеДанные, Потери);
	КонецЕсли;	
	
	Текст = "Техническая = " + ТекущиеДанные.Техническая + Символы.ПС;
	Текст = Текст + "Нет возможности установки ПУ = " + ТекущиеДанные.НетВозможностьУстановкиПУ + Символы.ПС;
	Текст = Текст + "Диаметр сечения(мм) = " + ТекущиеДанные.ДиаметрСечения + Символы.ПС;
	
	Если ВызывающаяПодсистема <> "ЮЛ" Тогда	
		Текст = Текст + "Расчет только по показаниям = " + ТекущиеДанные.РасчетТолькоПоПоказаниям + Символы.ПС;
		Текст = Текст + "Рассчитывать по диаметру = " + ТекущиеДанные.РассчитыватьПоДиаметруСечения + Символы.ПС;
		Если ТекущиеДанные.Свойство("НазначениеПУ") Тогда
			Текст = Текст + "Назначение ПУ = " + ?(ЗначениеЗаполнено(ТекущиеДанные.НазначениеПУ), ТекущиеДанные.НазначениеПУ, "не заполнено") + Символы.ПС;
		КонецЕсли;
	Иначе
		Текст = Текст + "Длина трубы(м) = " + ТекущиеДанные.ДлинаТрубы + Символы.ПС;
		Текст = Текст + "Расчет по графику ГП = " + ТекущиеДанные.РасчетПоГрафикуГП + Символы.ПС;
	КонецЕсли;
	
	Если Потери.Количество() = 0 Тогда
		Текст = Текст + "Потери не заполнены";		
	иначе
		Текст = Текст + "Потери:" + Символы.ПС;
		Для Каждого ТекСтр из Потери Цикл
			ЧислоПотерь = ?(ТекСтр.ФиксированныйОбъемПотерь > 0 , ТекСтр.ФиксированныйОбъемПотерь, "" + ТекСтр.ПроцентПотерь + "%");
			Текст 		= Текст + ТекСтр.ВидПотерь + " = " + ЧислоПотерь + Символы.ПС;
		КонецЦикла; 		
	КонецЕсли;	
	
	Возврат СокрЛП(Текст);
КонецФункции

Функция ЗаполнитьТекстТехническихСвойствМКД(ТекущиеДанные, Потери) Экспорт 		
	Текст = "Нет возможности установки ОДПУ = " + ТекущиеДанные.НетВозможностьУстановкиОДПУ + Символы.ПС;
	
	Если Потери.Количество() = 0 Тогда
		Текст = Текст + "Потери не заполнены";		
	иначе
		Текст = Текст + "Потери:" + Символы.ПС;
		Для Каждого ТекСтр из Потери Цикл
			ЧислоПотерь = ?(ТекСтр.ФиксированныйОбъемПотерь > 0 , ТекСтр.ФиксированныйОбъемПотерь, "" + ТекСтр.ПроцентПотерь + "%");
			Текст 		= Текст + ТекСтр.ВидПотерь + " = " + ЧислоПотерь + Символы.ПС;
		КонецЦикла; 		
	КонецЕсли;	
	
	Возврат СокрЛП(Текст);
КонецФункции

Функция ЗаполнитьТекстСредствИзмерений(ТекущиеДанные, Результат) Экспорт
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "Измерители") Тогда
		Текст = ?(Результат.Измерители.Количество() = 0 , "Не заполнены", "Заполнены");
	Иначе
		Текст = "Не заполнены";
	КонецЕсли;
	
	ТекущиеДанные.СредстваИзмерения = Текст;
	//Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область РаботаСПотерями

//////////////////////////
// Работа с БД

Функция ПолучитьАктуальныеЗначенияПотерь(Период, Организация, Район, КлючПомещения = Неопределено, ТочкаУчета = Неопределено) Экспорт 
	
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	
	Если НЕ КлючПомещения = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения", 	"КлючПомещения"), 		Неопределено));
	КонецЕсли;
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета", 	"ТочкаУчета"), 		Неопределено));
	КонецЕсли;
	
	ПараметрыПередачи 		= Новый Структура;
	
	ПараметрыПередачи.Вставить("Период", Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		 ПараметрыПередачи.Удалить("Период");
	КонецЕсли;
	ПараметрыПередачи.Вставить("ПараметрыВТ", ПараметрыВТ);
			
	РегистрыСведений.энргЗначенияПотерь.АктуальныеЗначенияПотерь(Схема, ПараметрыПередачи);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Район",					Район);
	ПараметрыЗапроса.Вставить("Организация",			Организация);
	Если ПараметрыПередачи.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",				Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",				ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("КлючПомещения",		КлючПомещения);
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",			ТочкаУчета);
	КонецЕсли; 	
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргРаботаСТочкамиУчетаСервер.ПолучитьАктуальныеЗначенияПотерь";
		ПараметрыМетода 			= Новый Структура("Период, Организация, Район, КлючПомещения, ТочкаУчета", Период, Организация, Район, КлючПомещения, ТочкаУчета);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);
	КонецЕсли;
	
	Возврат РезультатЗапроса
	
КонецФункции

//////////////////////////
// Вспомогательные методы

Процедура ОчиститьДанныеПоПотерям(Потери) Экспорт
	Для Каждого ТекСтрока из Потери Цикл
		ТекСтрока.ДанныеПотерь = "";		
	КонецЦикла; 	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоПотерям(Потери) Экспорт	
	Потери.Сортировать("IDСтроки");
	
	ТекIDСтроки = Неопределено;
	Для Каждого ТекСтрока из Потери Цикл
		Если НЕ ТекIDСтроки = ТекСтрока.IDСтроки тогда
			МассивСтрок 			= Потери.НайтиСтроки(Новый Структура("IDСтроки", ТекСтрока.IDСтроки));
			ТекСтрока.ДанныеПотерь 	= ПреобразоватьПотериВJSON(МассивСтрок);
		КонецЕсли;
		
		ТекIDСтроки = ТекСтрока.IDСтроки;
	КонецЦикла;
КонецПроцедуры

Функция ПреобразоватьПотериВJSON(Потери) Экспорт
	
	ДанныеПотерь 		= Новый Массив;
	ОписаниеСтроки		= "ВидПотерь, СпособРасчетаПотерь, Значение";		
		
	Для Каждого ТекСтрока из Потери Цикл
		НоваяСтрока 					= Новый Структура(ОписаниеСтроки);
		НоваяСтрока.ВидПотерь 			= "" + ТекСтрока.ВидПотерь.УникальныйИдентификатор();
		НоваяСтрока.СпособРасчетаПотерь = ?(ТекСтрока.ПроцентПотерь > 0, "Процент", "ФиксированныйОбъем");
		НоваяСтрока.Значение 			= ?(ТекСтрока.ПроцентПотерь > 0, ТекСтрока.ПроцентПотерь, ТекСтрока.ФиксированныйОбъемПотерь);	
		
		ДанныеПотерь.Добавить(НоваяСтрока);
	КонецЦикла;	
	
	Если НЕ ДанныеПотерь.Количество() = 0 Тогда
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();  
		ЗаписатьJSON(ЗаписьJSON, ДанныеПотерь);            
		Результат = ЗаписьJSON.Закрыть();
	Иначе 
		Результат = "";
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

Функция ПолучитьПотериИзJSON(СтрокаJSON) Экспорт	
	Чтение 		= Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	Описание 	= ПрочитатьJSON(Чтение);
	
	Возврат Описание;
КонецФункции

Функция ПолучитьОбъемПотерь(ОбщийОбъем, Потери, СтруктураОтбора = Неопределено) Экспорт
	ОбъемПотерь 		= 0;
	МенеджерСпособов 	= Перечисления.энргСпособыРасчетаПотерь;
	Процент 			= МенеджерСпособов.Процент;
	
	Если СтруктураОтбора = Неопределено	Тогда
		Для Каждого ТекСтрока из Потери Цикл
			ОбъемПотерь = ОбъемПотерь + РассчитатьОбъемПотерьПоСтроке(ОбщийОбъем, ТекСтрока, МенеджерСпособов);
		КонецЦикла;
	Иначе 
		ТекСтрока = Потери.Выбрать();
		Пока ТекСтрока.НайтиСледующий(СтруктураОтбора) Цикл
			ОбъемПотерь = ОбъемПотерь + РассчитатьОбъемПотерьПоСтроке(ОбщийОбъем, ТекСтрока, МенеджерСпособов);
		КонецЦикла; 		
	КонецЕсли;
	
	Возврат ОбъемПотерь;
КонецФункции

#КонецОбласти

Процедура ЗначенияТарифовУслугАбонентовВоВременную(МВТ, Схема,Параметры,Организация,МоментВремени,мРайоны,мКлючиПомещений) Экспорт 
	
	яСхема 												= Новый СхемаЗапроса;
	
	ЕстьГруппыПотребителейАбонентов	 					= Ложь;
	Если НЕ Схема = Неопределено Тогда
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ГруппыПотребителейАбонентов" Тогда
				ЕстьУслугиТочекУчета 					= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЕстьГруппыПотребителейАбонентов Тогда
		РегистрыСведений.энргГруппыПотребителейАбонентов.ГруппыПотребителейАбонентов(яСхема, Параметры,"ГруппыПотребителейАбонентов");
	КонецЕсли;
	
	ЕстьПоставщикиУслугАбонента 						= Ложь;
	Если НЕ Схема = Неопределено Тогда
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПоставщикиУслугАбонента" Тогда
				ЕстьУслугиТочекУчета 					= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЕстьГруппыПотребителейАбонентов Тогда
		РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиУслугАбонента(яСхема, Параметры,"ПоставщикиУслугАбонента");
	КонецЕсли;
	 	
	ЕстьЗначенияТарифовНабор	 						= Ложь;
	Если НЕ Схема = Неопределено Тогда
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ЗначенияТарифовНабор" Тогда
				ЕстьУслугиТочекУчета 					= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЕстьЗначенияТарифовНабор Тогда
		РегистрыСведений.энргЗначенияТарифов.ЗначенияТарифов(яСхема, Параметры,"ЗначенияТарифовНабор");
	КонецЕсли;
		
	Пакет  												= яСхема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияТарифовУслугАбонентов());
	
	Запрос  											= Новый Запрос(яСхема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("Период",					МоментВремени);
	Если мРайоны.Количество() = 1 Тогда
		Запрос.УстановитьПараметр("мРайоны",			мРайоны[0]);
	Иначе
		Запрос.УстановитьПараметр("мРайоны",			мРайоны);
	КонецЕсли;
	
	Если мКлючиПомещений.Количество() = 1 Тогда
		Запрос.УстановитьПараметр("мКлючПомещений",		мКлючиПомещений[0]);
	Иначе
		Запрос.УстановитьПараметр("мКлючПомещений",		мКлючиПомещений);
	КонецЕсли;
	
	ТаблицаЗначенийТарифовТочекУчета  					= Новый ТаблицаЗначений;
	ТаблицаЗначенийТарифовТочекУчета.Колонки.Добавить("Организация", 					Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаЗначенийТарифовТочекУчета.Колонки.Добавить("Район", 							Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	ТаблицаЗначенийТарифовТочекУчета.Колонки.Добавить("КлючПомещения", 					Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	ТаблицаЗначенийТарифовТочекУчета.Колонки.Добавить("ТочкаУчета", 					Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	ТаблицаЗначенийТарифовТочекУчета.Колонки.Добавить("ТарифнаяЗона", 					Новый ОписаниеТипов("СправочникСсылка.энргТарифныеЗоны"));
	ТаблицаЗначенийТарифовТочекУчета.Колонки.Добавить("ЗначениеТарифа", 				Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	ТаблицаЗначенийТарифовТочекУчета.Колонки.Добавить("ПредставлениеЗначениеТарифа", 	Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(15)));
	 	
	Результат  												= Запрос.Выполнить();
	Выборка 												= Результат.Выбрать();
	ТекОрганизация 											= Неопределено;
	ТекРайон 												= Неопределено;
	ТекКлючПомещения 										= Неопределено;
	ТекТочкаУчета 											= Неопределено;	
	ТекТарифнаяЗона											= Неопределено;
	ЗначениеТарифа 											= 0;
	ПредставлениеЗначениеТарифа 							= "";
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ТекОрганизация = Выборка.Организация
			ИЛИ НЕ ТекРайон = Выборка.Район
			ИЛИ НЕ ТекКлючПомещения = Выборка.КлючПомещения 
			ИЛИ НЕ ТекТочкаУчета = Выборка.ТочкаУчета 
			ИЛИ НЕ ТекТарифнаяЗона = Выборка.ТарифнаяЗона Тогда
				
			Если Не ТекОрганизация = Неопределено Тогда
				СтрокаЗначения 								= ТаблицаЗначенийТарифовТочекУчета.Добавить();
				СтрокаЗначения.Организация 					= ТекОрганизация;
				СтрокаЗначения.Район 						= ТекРайон;
				СтрокаЗначения.КлючПомещения 				= ТекКлючПомещения;
				СтрокаЗначения.ТочкаУчета 					= ТекТочкаУчета;
				СтрокаЗначения.ТарифнаяЗона 				= ТекТарифнаяЗона;
				СтрокаЗначения.ЗначениеТарифа 				= ЗначениеТарифа;
				СтрокаЗначения.ПредставлениеЗначениеТарифа 	= ПредставлениеЗначениеТарифа;				
			КонецЕсли;
						
			ЗначениеТарифа 									= 0;
			ПредставлениеЗначениеТарифа 					= "";			
		КонецЕсли;
		
		ЗначениеТарифа 										= ЗначениеТарифа + Выборка.Значение;
		ПредставлениеЗначениеТарифа 						= ПредставлениеЗначениеТарифа + ?(ПустаяСтрока(ПредставлениеЗначениеТарифа),"","/") + Формат(Выборка.Значение,"ЧРГ=; ЧГ=0");
		
		ТекОрганизация 										= Выборка.Организация;
		ТекРайон 											= Выборка.Район;
		ТекКлючПомещения 									= Выборка.КлючПомещения;
		ТекТочкаУчета	 									= Выборка.ТочкаУчета;
		ТекТарифнаяЗона										= Выборка.ТарифнаяЗона;
	КонецЦикла;
	
	Если Не ТекОрганизация = Неопределено Тогда
		СтрокаЗначения 										= ТаблицаЗначенийТарифовТочекУчета.Добавить();
		СтрокаЗначения.Организация 							= ТекОрганизация;
		СтрокаЗначения.Район 								= ТекРайон;
		СтрокаЗначения.КлючПомещения 						= ТекКлючПомещения;
		СтрокаЗначения.ТочкаУчета 							= ТекТочкаУчета;
		СтрокаЗначения.ТарифнаяЗона 						= ТекТарифнаяЗона;
		СтрокаЗначения.ЗначениеТарифа 						= ЗначениеТарифа;
		СтрокаЗначения.ПредставлениеЗначениеТарифа 			= ПредставлениеЗначениеТарифа;				
	КонецЕсли;
		
	Запрос  												= Новый Запрос();
	Запрос.МенеджерВременныхТаблиц 							= МВТ;
	Запрос.УстановитьПараметр("ТаблицаЗначенийТарифовТочекУчета", ТаблицаЗначенийТарифовТочекУчета);
	Запрос.Текст 											=
	"ВЫБРАТЬ
	|	ТаблицаЗначенийТарифовТочекУчета.Организация КАК Организация,
	|	ТаблицаЗначенийТарифовТочекУчета.Район КАК Район,
	|	ТаблицаЗначенийТарифовТочекУчета.КлючПомещения КАК КлючПомещения,
	|	ТаблицаЗначенийТарифовТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаЗначенийТарифовТочекУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаЗначенийТарифовТочекУчета.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ТаблицаЗначенийТарифовТочекУчета.ПредставлениеЗначениеТарифа КАК ПредставлениеЗначениеТарифа
	|ПОМЕСТИТЬ ТаблицаЗначенийТарифовТочекУчета
	|ИЗ
	|	&ТаблицаЗначенийТарифовТочекУчета КАК ТаблицаЗначенийТарифовТочекУчета";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РассчитатьОбъемПотерьПоСтроке(ОбщийОбъем, ТекСтрока, МенеджерСпособов)
	Возврат ?(ТекСтрока.СпособРасчетаПотерь = МенеджерСпособов.Процент, ОбщийОбъем * (ТекСтрока.Значение / 100), ТекСтрока.Значение);
КонецФункции

Функция ЗаполнитьЭлемент(ТочкаОбъект,ДанныеТочки)
	ЗаполнитьЗначенияСвойств(ТочкаОбъект,ДанныеТочки);
	ТочкаОбъект.Записать();
	Возврат ТочкаОбъект.Ссылка;
КонецФункции

Функция ТекстЗапросаЗначенияТарифовУслугАбонентов() 
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ЗначенияТарифовНабор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЗначенияТарифовНабор.Значение КАК Значение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоставщикиУслугАбонента.Организация КАК Организация,
	|		ПоставщикиУслугАбонента.Район КАК Район,
	|		ПоставщикиУслугАбонента.КлючПомещения КАК КлючПомещения,
	|		ПоставщикиУслугАбонента.ТочкаУчета КАК ТочкаУчета,
	|		ПоставщикиУслугАбонента.Услуга КАК Услуга,
	|		ПоставщикиУслугАбонента.ЧастьСоставной КАК ЧастьСоставной,
	|		ПоставщикиУслугАбонента.Поставщик КАК Поставщик,
	|		ГруппыПотребителейАбонентов.ГруппаПотребителей КАК ГруппаПотребителей
	|	ИЗ
	|		ПоставщикиУслугАбонента КАК ПоставщикиУслугАбонента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыПотребителейАбонентов КАК ГруппыПотребителейАбонентов
	|			ПО ПоставщикиУслугАбонента.Организация = ГруппыПотребителейАбонентов.Организация
	|				И ПоставщикиУслугАбонента.Район = ГруппыПотребителейАбонентов.Район
	|				И ПоставщикиУслугАбонента.КлючПомещения = ГруппыПотребителейАбонентов.КлючПомещения
	|				И ПоставщикиУслугАбонента.Услуга = ГруппыПотребителейАбонентов.Услуга) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифовНабор КАК ЗначенияТарифовНабор
	|		ПО ВложенныйЗапрос.Организация = ЗначенияТарифовНабор.Организация
	|			И ВложенныйЗапрос.Район = ЗначенияТарифовНабор.Район
	|			И ВложенныйЗапрос.ГруппаПотребителей = ЗначенияТарифовНабор.ГруппаПотребителей
	|			И ВложенныйЗапрос.Услуга = ЗначенияТарифовНабор.Услуга
	|			И ВложенныйЗапрос.Поставщик = ЗначенияТарифовНабор.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	КлючПомещения,
	|	ТочкаУчета,
	|	ТарифнаяЗона";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти