#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Отбор  							= Параметры.отбор;
	Если Параметры.свойство("МКД") тогда
		СтандартнаяОбработка 		= Ложь;
		ДанныеВыбора 				= Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.энргВидыПлощадей.ПлощадьМОП);
	ИначеЕсли  Параметры.свойство("Абонент") тогда
		СтандартнаяОбработка 		= Ложь;
		ДанныеВыбора 				= Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.энргВидыПлощадей.ОбщаяПлощадь);
		ДанныеВыбора.Добавить(Перечисления.энргВидыПлощадей.НеОтопливаемаяПлощадь);
		ДанныеВыбора.Добавить(Перечисления.энргВидыПлощадей.Поливная);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
