#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Точки учета
//////////////////////////////

Функция ПолучитьКлючиЗаполненияТочекУчета() Экспорт
	Возврат Новый Структура("Реквизиты, Таблицы", "ЗаполнитьФорму", "ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета, ЗначенияИзмерителей, ПоставщикиСоставныхУслуг, ШкалыИзмерителей, Измерители, Потери, НомераПломб");
КонецФункции


// Технические свойства
//////////////////////////////

Функция ПолучитьКлючиЗаполненияТехническихСвойствТУ(ВызывающаяПодсистема = "") Экспорт
	Если ВызывающаяПодсистема = "ЮЛ" Тогда
		Возврат Новый Структура("Реквизиты, Таблицы", "ДиаметрСечения, НетВозможностьУстановкиПУ, Техническая, РасчетТолькоПоПоказаниям, РассчитыватьРеактивнуюЭнергию, РассчитыватьПотери, tgφ, РасчетПоГрафикуГП, ДлинаТрубы", "Потери");
	КонецЕсли;
	Возврат Новый Структура("Реквизиты, Таблицы", "ДиаметрСечения, НетВозможностьУстановкиПУ, Техническая, РассчитыватьПоДиаметруСечения, РасчетТолькоПоПоказаниям, НазначениеПУ", "Потери");
КонецФункции


// Направления использования
//////////////////////////////

Функция ПолучитьКлючиЗаполненияИзмерителиНаправлений() Экспорт
	Возврат Новый Структура("Реквизиты, Таблицы", "НаправлениеИспользованияТУ", "ЗначенияИзмерителей");
КонецФункции


// Средства измерений
//////////////////////////////

Функция ПолучитьКлючиЗаполненияСредствИзмерений() Экспорт
	Возврат Новый Структура("Реквизиты, Таблицы", "ТипУзлаУчета, ВидКанальности, Услуга, НаименованиеТочки, КоэффициентПУ", "Измерители, ПоказанияПриборовУчета, ШкалыПриборовУчета, ШкалыИзмерителей, НомераПломб, ФормулыРасчетаУслуг");
КонецФункции

Функция ПолучитьОписаниеСтруктурыДанныхПУ() Экспорт 
	Текст = "ЗаводскойНомер, ДатаВыпуска, ДатаПоверкиСчетчика, НомерПломбы, НачалоДействияКоммерскогоУчета
	|,КонецДействияКоммерскогоУчета, ДатаУстановкиПломбы, КоэффициентПУ, РегистрируетОбъем
	|,УдалитьВидПараметра, РасположениеИзмерителя, ТипПрибораУчета, СобственникСИ, ДатаВыпуска, СистемаУчетаЭлектроэнергии, БалансоваяПринадлежность, ДатаУстановки";
	
	Возврат Новый Структура(Текст);
КонецФункции

Функция ПолучитьМассивДоступныхШкал(ПолныйСписокШкалИзВидаКанальности, МассивШкалДляВычитания) Экспорт 	
	МассивШкал = энргОбщегоНазначения.ВернутьНовыйМассивСЗаполненнымиДанными(ПолныйСписокШкалИзВидаКанальности, "Шкала");
	
	Если НЕ МассивШкалДляВычитания.Количество() = 0 Тогда
		ВыбранныеШкалы 	= энргОбщегоНазначения.ВернутьНовыйМассивСЗаполненнымиДанными(МассивШкалДляВычитания, "Шкала");
		МассивШкал 		= ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивШкал, ВыбранныеШкалы);		
	КонецЕсли; 
	
	Возврат МассивШкал;
КонецФункции

Функция ОбработатьВходнуюТаблицу(Таблица, ПолеУсловие, ЗначениеУсловия) Экспорт
	НоваяТаблица = Новый Массив;
	Для каждого стр из Таблица Цикл
		Если стр[ПолеУсловие] = ЗначениеУсловия Тогда
			НоваяТаблица.Добавить(стр);
		КонецЕсли;
	КонецЦикла;
	Возврат НоваяТаблица;
КонецФункции

// Потери
//////////////////////////////
Функция ПолучитьТаблицуПотерь(Шкалы, Потери) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Шкалы.ВидДифференцированности КАК ВидДифференцированности
	               |ПОМЕСТИТЬ ВТ_Шкалы
	               |ИЗ
	               |	&Шкалы КАК Шкалы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Потери.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	Потери.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
	               |	Потери.ПроцентПотерь КАК ПроцентПотерь
	               |ПОМЕСТИТЬ ВТ_Потери
	               |ИЗ
	               |	&Потери КАК Потери
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери) КАК ВидПотерь,
	               |	ЕСТЬNULL(ВТ_Потери.ФиксированныйОбъемПотерь, 0) КАК ФиксированныйОбъемПотерь,
	               |	ЕСТЬNULL(ВТ_Потери.ПроцентПотерь, 0) КАК ПроцентПотерь
	               |ИЗ
	               |	ВТ_Шкалы КАК ВТ_Шкалы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потери КАК ВТ_Потери
	               |			ПО энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона = ВТ_Потери.ТарифнаяЗона
	               |		ПО ВТ_Шкалы.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка";
	Запрос.УстановитьПараметр("Шкалы", Шкалы);
	Запрос.УстановитьПараметр("Потери", Потери);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#КонецЕсли