

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_УдалитьэнргОперацияСРазделеннымиЛС(ЭтотОбъект);
//{{MRG[ <-> ]
//	энргОбщегоНазначения.УстановитьСписокРайонов(Объект.Район,Элементы.Район); 
//}}MRG[ <-> ]
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
//{{MRG[ <-> ]
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);
//}}MRG[ <-> ]
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// МенюОтчеты
	//МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
//{{MRG[ <-> ]
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
//}}MRG[ <-> ]
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Помещение) тогда
		бестПользовательскийВводКлиент.ПриИзмененииПомещения(Объект); 
		ЗаполнитьСписокАбонентовСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораПомещения(Элемент,Объект.Организация,Объект.Район,СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты

// Конец МенюОтчеты

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокАбонентовСервер()
	
	Объект.Абоненты.Очистить();
	
	//Результат 								= бестРаботаСПараметрамиРасчетаПомещенийСервер.ЗарегистрированныеАбонентыПомещения(Объект.Дата,Объект.Организация,Объект.Район,Объект.Помещение); 
	//Выборка  								= Результат.выбрать();
	//
	//Пока Выборка.следующий() цикл
	//	
	//	НовСтр  					= Объект.Абоненты.Добавить();
	//	НовСтр.Абонент 				= Выборка.Абонент;			
	//КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
