#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Район") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(БезнадежнаяЗадолженность,"Район", Параметры.Район);
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(БезнадежнаяЗадолженность,"Организация", Параметры.Организация);
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(БезнадежнаяЗадолженность,"Договор", Параметры.Договор);
	КонецЕсли;
	Если Параметры.Свойство("КонецПериода") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(БезнадежнаяЗадолженность,"КонецПериода", Параметры.КонецПериода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БезнадежнаяЗадолженностьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.бестПлатежныйДокумент.ФормаОбъекта", Новый Структура("Ключ", Элементы.БезнадежнаяЗадолженность.ТекущиеДанные.ПлатежныйДокумент));
КонецПроцедуры

#КонецОбласти
