////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Оповестить("ИзменениеЛичныхДанных", Запись.ФизическоеЛицо);
	НовоеПредставление = Запись.Фамилия + " " + Запись.Имя + " " + Запись.Отчество;
	Структура 	= Новый Структура;
	Структура.Вставить("ФизическоеЛицо", Запись.ФизическоеЛицо);
	Структура.Вставить("НовоеИмяАбонента", НовоеПредставление);
	Оповестить("ИзменениеЛичныхДанных", Структура);
КонецПроцедуры


#КонецОбласти
