#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период  					= Параметры.СтруктураОтбора.Период;
	Район 						= Параметры.СтруктураОтбора.Район;
	ПериодНачисления 			= Параметры.СтруктураОтбора.ПериодНачисления;
	Организация 				= Параметры.СтруктураОтбора.Организация;
	Абонент 					= Параметры.СтруктураОтбора.Абонент;
	МКД							= Параметры.СтруктураОтбора.Строение;
	Услуга						= Параметры.СтруктураОтбора.Услуга;
	
	МассивЗагруженныхПериодов   = Параметры.ЗагруженныеПериоды;
	
	// выводим данные по подключенным услугам и задолженности
	Граница  		= Новый Граница(Параметры.СтруктураОтбора.Период, ВидГраницы.Исключая);	
	Результат 		= ДанныеДляОплатыАбонента(Граница,Организация,ПериодНачисления,Район,МКД,Абонент, Услуга);
	Выборка  		= Результат.выбрать();
	Пока Выборка.следующий() цикл
		
		НайденоСоответствие 		= Ложь;
		
		Для Каждого Стр Из МассивЗагруженныхПериодов Цикл
			Если Стр.ВидЗадолженности = Выборка.ВидЗадолженности И Стр.ПериодНачисления = Выборка.ПериодНачисления Тогда
				НайденоСоответствие = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не НайденоСоответствие Тогда
			СтрокаУслуги  								= ТаблицаЗадолженность.Добавить();
			СтрокаУслуги.ПредставлениеПериодаОплаты 	= Формат(Выборка.периодНачисления,"ДФ='ММММ гггг'");
			ЗаполнитьЗначенияСвойств(СтрокаУслуги,Выборка);
		КонецЕсли;
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивСтрок = Элементы.ТаблицаЗадолженность.ВыделенныеСтроки;
	
	Массив = Новый Массив;
	
	Для Каждого Стр Из МассивСтрок Цикл
		НовСтр = ТаблицаЗадолженность.НайтиПоИдентификатору(Стр);    
		Массив.Добавить(ТаблицаЗадолженность.НайтиПоИдентификатору(Стр));
		
	КонецЦикла;
	
	ЗакрытьФорму(Массив);
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Массив)
	Если Массив <> Неопределено Тогда
		Закрыть(Массив);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

&НаСервере
Функция ДанныеДляОплатыАбонента(Период,Организация, ПериодНачисления,Район,Строение,Абонент,Услуга)   
	Запрос   		= Новый Запрос;
	Запрос.УстановитьПараметр("Период" ,			Период);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				Строение);
	Запрос.УстановитьПараметр("Абонент",			Абонент);
	Запрос.УстановитьПараметр("ТекДата",			ТекущаяДатаСеанса());
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг) КАК ВидЗадолженности,
	|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК Задолженность,
	|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ТекущиеОстатки
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&Период,
	|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоМесяцамОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления,
	|	энргВзаиморасчетыПоПениОстатки.Услуга,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня),
	|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток,
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
	|			&Период,
	|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоПениОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргЗабалансоваяЗадолженностьОстатки.ПериодНачисления,
	|	энргЗабалансоваяЗадолженностьОстатки.Услуга,
	|	энргЗабалансоваяЗадолженностьОстатки.ВидЗадолженности,
	|	энргЗабалансоваяЗадолженностьОстатки.СуммаЗадолженностиОстаток,
	|	энргЗабалансоваяЗадолженностьОстатки.Поставщик
	|ИЗ
	|	РегистрНакопления.энргЗабалансоваяЗадолженность.Остатки(
	|			&Период,
	|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))) КАК энргЗабалансоваяЗадолженностьОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргРеструктуризацияДолгаСрезПоследних.Организация КАК Организация,
	|	энргРеструктуризацияДолгаСрезПоследних.Район КАК Район,
	|	энргРеструктуризацияДолгаСрезПоследних.Строение КАК Строение,
	|	энргРеструктуризацияДолгаСрезПоследних.Абонент КАК Абонент,
	|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты КАК ДатаОплаты,
	|	энргРеструктуризацияДолгаСрезПоследних.Документ КАК Документ,
	|	СУММА(ВЫБОР
	|			КОГДА энргВзаиморасчеты.ВидДвижения ЕСТЬ NULL
	|				ТОГДА 0
	|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА энргВзаиморасчеты.Сумма
	|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И энргВзаиморасчеты.Сумма < 0
	|				ТОГДА -энргВзаиморасчеты.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая КАК СуммаОбщая
	|ПОМЕСТИТЬ Реструктуризация
	|ИЗ
	|	РегистрСведений.энргРеструктуризацияДолга.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	//|				И Район = &Район
	//|				И Строение = &МКД
	|				И Абонент = &Абонент) КАК энргРеструктуризацияДолгаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
	|		ПО энргРеструктуризацияДолгаСрезПоследних.Организация = энргВзаиморасчеты.Организация
	|			И энргРеструктуризацияДолгаСрезПоследних.Район = энргВзаиморасчеты.Район
	|			И энргРеструктуризацияДолгаСрезПоследних.Строение = энргВзаиморасчеты.МКД
	|			И энргРеструктуризацияДолгаСрезПоследних.Абонент = энргВзаиморасчеты.Абонент
	|			И энргРеструктуризацияДолгаСрезПоследних.ДатаНачала <= энргВзаиморасчеты.Период
	|			И энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты >= энргВзаиморасчеты.Период
	|ГДЕ
	|	энргРеструктуризацияДолгаСрезПоследних.ДатаПредыдущегоЭтапа <= &ТекДата
	|
	|СГРУППИРОВАТЬ ПО
	|	энргРеструктуризацияДолгаСрезПоследних.Организация,
	|	энргРеструктуризацияДолгаСрезПоследних.Район,
	|	энргРеструктуризацияДолгаСрезПоследних.Строение,
	|	энргРеструктуризацияДолгаСрезПоследних.Абонент,
	|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты,
	|	энргРеструктуризацияДолгаСрезПоследних.Документ,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом,
	|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реструктуризация.Документ КАК Документ,
	|	Реструктуризация.СуммаОбщая КАК СуммаОбщая,
	|	МИНИМУМ(Реструктуризация.Сумма >= Реструктуризация.СуммаНарастающимИтогом) КАК ОтметкаВыполненного
	|ПОМЕСТИТЬ ВыполненныеРеструктуризации
	|ИЗ
	|	Реструктуризация КАК Реструктуризация
	|
	|СГРУППИРОВАТЬ ПО
	|	Реструктуризация.Документ,
	|	Реструктуризация.СуммаОбщая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Услуга КАК Услуга,
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Поставщик КАК Поставщик,
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.СуммаЗадолженностиКонечныйОстаток КАК Задолженность
	|ПОМЕСТИТЬ СуммыЗабаланса
	|ИЗ
	|	РегистрНакопления.энргЗабалансоваяЗадолженность.ОстаткиИОбороты(
	|			,
	|			&Период,
	|			Регистратор,
	|			,
	|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	|				И Абонент = &Абонент
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))) КАК энргЗабалансоваяЗадолженностьОстаткиИОбороты
	|ГДЕ
	|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Регистратор В
	|			(ВЫБРАТЬ
	|				ВыполненныеРеструктуризации.Документ
	|			ИЗ
	|				ВыполненныеРеструктуризации КАК ВыполненныеРеструктуризации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеОстатки.ПериодНачисления КАК ПериодНачисления,
	|	ТекущиеОстатки.Услуга КАК Услуга,
	|	ТекущиеОстатки.ВидЗадолженности КАК ВидЗадолженности,
	|	ТекущиеОстатки.Задолженность - ЕСТЬNULL(СуммыЗабаланса.Задолженность, 0) КАК Задолженность,
	|	ТекущиеОстатки.Поставщик КАК Поставщик
	|ИЗ
	|	ТекущиеОстатки КАК ТекущиеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыЗабаланса КАК СуммыЗабаланса
	|		ПО ТекущиеОстатки.ПериодНачисления = СуммыЗабаланса.ПериодНачисления
	|			И ТекущиеОстатки.Услуга = СуммыЗабаланса.Услуга
	|			И ТекущиеОстатки.Поставщик = СуммыЗабаланса.Поставщик
	|			И (ТекущиеОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг))
	|ГДЕ
	|	ТекущиеОстатки.Задолженность - ЕСТЬNULL(СуммыЗабаланса.Задолженность, 0) > 0"; 
	
	
	
	Результат  		= Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции


