#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДоступныеКВыборуШкалы") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ДоступныеКВыборуШкалы, Параметры.ДоступныеКВыборуШкалы, "Шкала");
	КонецЕсли;	
	
	Если Параметры.Свойство("ЗаполненныеШкалы") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ШкалыТипаИзмерителя, Параметры.ЗаполненныеШкалы, "Шкала");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыТипаИзмерителя

&НаКлиенте
Процедура ШкалыТипаИзмерителяШкалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ФормаВыбора 			= ПолучитьФорму("Справочник.энргШкалыПриборовУчета.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список,"Ссылка", ПолучитьМассивДоступныхШкал(), ВидСравненияКомпоновкиДанных.ВСписке);
	ФормаВыбора.Открыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	Закрыть(ЗавершитьНаСервере());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗавершитьНаСервере()	
	МассивСтрок = ШкалыТипаИзмерителя.НайтиСтроки(Новый Структура("Шкала", Справочники.энргШкалыПриборовУчета.ПустаяСсылка()));
	Для Каждого ТекСтрокаДляУдаления Из МассивСтрок  Цикл
		ШкалыТипаИзмерителя.Удалить(ТекСтрокаДляУдаления);
	КонецЦикла; 	
	
	Возврат Новый Структура("ВыбранныеШкалы", ОбщегоНазначения.ТаблицаЗначенийВМассив(ШкалыТипаИзмерителя.Выгрузить()));
КонецФункции

&НаСервере
Функция ПолучитьМассивДоступныхШкал()	
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьМассивДоступныхШкал(ДоступныеКВыборуШкалы, ШкалыТипаИзмерителя);
КонецФункции

#КонецОбласти