#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
			Автор 		= Пользователи.ТекущийПользователь();

			Набор 							= РегистрыСведений.энргИсторияДоговоровАбонента.СоздатьНаборЗаписей();
			Запись 							= Набор.Добавить();
			Запись.Организация 				= Организация;
			//Запись.Район					= Район;
			Запись.Абонент					= Владелец;
			//Запись.Действующий 				= Истина;
			Запись.ДатаДоговора				= НачалоДействия;
			Запись.НомерДоговора			= НомерДоговора;
			Запись.Отвественный				= Автор; 
			
			Запись.Период					= ДатаПодписания;
			Попытка
				Набор.Записать();
			Исключение
				ВызватьИсключение "Запись в регистр сведений «История договоров абонента» не добавлена";
			КонецПопытки;
						
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
