#Область ОбработчикиСобытий

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ) 	
	Отказ = ПроверитьНаличиеАдминскойРоли(отказ);
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеАдминскойРоли(отказ)
	Возврат не РольДоступна("АдминистраторСистемы");
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	текСтрока  = Элементы.Список.ТекущиеДанные;
	ТекИмяФормы = ИмяФормыСервер(текСтрока.ДокРегистратор);
	ОткрытьФорму("Документ." + ТекИмяФормы + ".ФормаОбъекта" ,Новый Структура("Ключ",текСтрока.ДокРегистратор)); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ИмяФормыСервер(ссылка)
	Возврат ссылка.метаданные().имя;
КонецФункции

#КонецОбласти