#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Задача", Задача);
	Параметры.Свойство("ТипСообщения", ТипСообщения);
	
	Если ТипСообщения = Справочники.энргСпособСвязи.ОтправкаПисьмаНаЭлектроннуюПочту Тогда
		Элементы.ФормаОтправитьСообщение.Видимость		   = Истина;
		Элементы.ФормаОтправитьСообщение.КнопкаПоУмолчанию = Истина;
		Элементы.ПрикрепитьФайлы.Видимость				   = Истина;
		Справочники.энргШаблоныСообщений.ДобавлениеКомандПараметров(ЭтаФорма, "КомандыПараметрыТемы", "КомТемы", "ВставитьПараметр");
	ИначеЕсли ТипСообщения = Справочники.энргСпособСвязи.ОтправкаСМС Тогда
		Элементы.ФормаОтправитьSMS.Видимость		 = Истина;
		Элементы.ФормаОтправитьSMS.КнопкаПоУмолчанию = Истина;
		Элементы.Тема.Видимость						 = Ложь;
	КонецЕсли;
	
	Справочники.энргШаблоныСообщений.ДобавлениеКомандПараметров(ЭтаФорма, "КомандыПараметрыТекста", "КомТекста", "ВставитьПараметр");
КонецПроцедуры
#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ТемаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.энргШаблоныСообщений.ФормаВыбора",, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТемаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Тема = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТекстШаблона"); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСообщенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекстСообщения = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТекстШаблона"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыАдресФайлаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекЭлем = Элементы.ПрикрепитьФайлы.ТекущиеДанные;
	Если ТекЭлем <> Неопределено И ЗначениеЗаполнено(ТекЭлем.АдресФайла)  Тогда
		ЗапуститьПриложение(СокрЛП(ТекЭлем.АдресФайла)); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	
	Диалог.Показать(Новый ОписаниеОповещения("ДобавитьВыбранныйФайл", ЭтотОбъект, Новый Структура("Диалог", Диалог)));	
КонецПроцедуры
#КонецОбласти

#Область ДействияКоманд
&НаКлиенте
Процедура ВставитьПараметр(Команда)
	Если Лев(Команда.Имя, 7) = "КомТемы" Тогда
		Элемент = Элементы.Тема;
	Иначе
		Элемент = Элементы.ТекстСообщения
	КонецЕсли;
	
	Элемент.ВыделенныйТекст = ВставитьПараметрНаСервере(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьШаблон(Команда)
	ОткрытьФорму("Справочник.энргШаблоныСообщений.ФормаВыбора",, Элементы.ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	Если ПустаяСтрока(Тема) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена тема сообщения.");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен текст сообщения.");
		Возврат;
	КонецЕсли;
	
	МассивФайлов = Новый Массив;
	
	Для каждого СтрокаТЗ Из ПрикрепитьФайлы Цикл
		Если ПустаяСтрока(СтрокаТЗ.АдресФайла) Тогда
			Продолжить;
		КонецЕсли;
		
		Файл = Новый Файл(СтрокаТЗ.АдресФайла);
		Если Файл.Существует() Тогда
			
			Двоичное = Новый ДвоичныеДанные(СтрокаТЗ.АдресФайла);
			Адрес = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор);
			
			МассивФайлов.Добавить(Новый Структура("Адрес, Расширение, Имя", Адрес, Файл.Расширение, Файл.ИмяБезРасширения));
		КонецЕсли;
	КонецЦикла;
	
	Если ОтправитьСообщениеНаСервере(МассивФайлов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение доставлено.");
		Оповестить("УстановитьДатуЭП");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMS(Команда)
	Если ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен текст сообщения.");
		Возврат;
	КонецЕсли;
	
	Если ОтправитьSMSНаСервере() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение доставлено.");
		Оповестить("УстановитьДатуSMS");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции
&НаСервере
Функция ВставитьПараметрНаСервере(ИмяКоманды)
	Префикс = ?(Лев(ИмяКоманды, 7) = "КомТемы", "КомТемы", "КомТекста");
	Возврат Справочники.энргШаблоныСообщений.ЗаменаКоманды(ИмяКоманды, Префикс); 
КонецФункции

&НаСервере
Функция ОтправитьСообщениеНаСервере(МассивФайлов)
	Возврат Документы.энргСобытие.СоздатьИВыполнитьСобытиеНаОсновеЗадачи(Задача, ТипСообщения, ТекстСообщения, Тема, ,МассивФайлов);
КонецФункции

&НаСервере
Функция ОтправитьSMSНаСервере()
	Возврат Документы.энргСобытие.СоздатьИВыполнитьСобытиеНаОсновеЗадачи(Задача, ТипСообщения, ТекстСообщения);
КонецФункции

&НаКлиенте
Процедура ДобавитьВыбранныйФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Для каждого ПутьКФайлу Из ВыбранныеФайлы Цикл
			СтрокаТЗ = ПрикрепитьФайлы.Добавить();
			СтрокаТЗ.АдресФайла = ПутьКФайлу;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 
#КонецОбласти



