#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Период,Район,Организация,АбонентВладелец,ОбъектРасчета,ТочкиСПриборами;
	
	Если Параметры.Свойство("Период") Тогда
		Период 					= Параметры.Период;
	ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("Период") Тогда
		Период 					= Параметры.ДополнительныеПараметры.Период;
	Иначе
		Период					= ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Район") Тогда
		Район 					= Параметры.Район;
	ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("Район") Тогда
		Район 					= Параметры.ДополнительныеПараметры.Район;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация 			= Параметры.Организация;
	ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("Организация") Тогда
		Организация 			= Параметры.ДополнительныеПараметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("АбонентВладелец") Тогда
		АбонентВладелец 		= Параметры.АбонентВладелец;
	ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("АбонентВладелец") Тогда
		АбонентВладелец 			= Параметры.ДополнительныеПараметры.АбонентВладелец;
	ИначеЕсли Параметры.Свойство("Строение") И Параметры.Свойство("Помещение") И Параметры.Свойство("ЧастныйСектор") Тогда
		АбонентВладелец 		= Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Параметры.Строение,Параметры.Помещение).КлючПомещения;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектРасчета") Тогда
		ОбъектРасчета 			= Параметры.ОбъектРасчета;
	ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("ОбъектРасчета") Тогда
		ОбъектРасчета 			= Параметры.ДополнительныеПараметры.ОбъектРасчета;
	КонецЕсли;
	
	Если Параметры.Свойство("ТочкиСПриборами") Тогда
		ТочкиСПриборами 		= Параметры.ТочкиСПриборами;
	ИначеЕсли Параметры.ДополнительныеПараметры.Свойство("ТочкиСПриборами") Тогда
		ТочкиСПриборами 		= Параметры.ДополнительныеПараметры.ТочкиСПриборами;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура();
	
	//ВыбратьВсеСостояния = Истина;
	Если Параметры.Свойство("ВыбратьВсеСостояния") Тогда
		ВызватьИсключение "Справочник.энргТочкиУчета.ФормаВыбора параметр ВыбратьВсеСостояния не реализован"; 
		//ВыбратьВсеСостояния		= Параметры.ВыбратьВсеСостояния;
		ПараметрыОтбора.Вставить("ВыбратьВсеСостояния", Параметры.ВыбратьВсеСостояния);
	КонецЕсли;	
	
	Если Параметры.Свойство("ВыбратьТУСрезНаДату") Тогда
		ПараметрыОтбора.Вставить("ВыбратьТУСрезНаДату", Параметры.ВыбратьТУСрезНаДату);
	КонецЕсли;
	
	Если Параметры.Свойство("ТочкиОРП") ИЛИ Параметры.ДополнительныеПараметры.Свойство("ТочкиОРП") Тогда
		ПараметрыОтбора.Вставить("ТочкиОРП", Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ВключаяОРП") ИЛИ Параметры.ДополнительныеПараметры.Свойство("ВключаяОРП") Тогда
		ПараметрыОтбора.Вставить("ВключаяОРП", Истина);
	КонецЕсли;

	Если АбонентВладелец = Неопределено ИЛИ НЕ ЗначениеЗаполнено(АбонентВладелец) тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(АбонентВладелец) = Тип("СправочникСсылка.энргКлючиПомещений") Тогда		
		Результат  				= энргРаботаСТочкамиУчетаСервер.ДействующиеТочкиУчета(Период, Организация, Район,АбонентВладелец, ОбъектРасчета, ТочкиСПриборами,,ПараметрыОтбора);
	ИначеЕсли ТипЗнч(АбонентВладелец) = Тип("СправочникСсылка.энргСтроения") Тогда
		Результат  				= энргРаботаСТочкамиУчетаСервер.ДействующиеТочкиУчетаМКД(Период, Организация, Район,АбонентВладелец, ОбъектРасчета, ТочкиСПриборами);
	Иначе
		ВызватьИсключение "Владелец точки учета не определен";
	КонецЕсли;
	
	Выборка  					= Результат.выбрать();
	
	СписокТУ  					= Новый СписокЗначений;
	
	Пока Выборка.следующий() цикл
		СписокТУ.Добавить(Выборка.ТочкаУчета);
	КонецЦикла;  	

	// накладываем отбор на точки динамический список
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокТУ,ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры


#КонецОбласти
