#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает значения реквизитов объекта.
//
// Параметры:
//  КонтрагентСсылка	-	СправочникСсылка.
//  ПолучаемыеСвойства	-	Строка.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияРеквизитовОбъекта(КонтрагентСсылка, ПолучаемыеСвойства) Экспорт 
		
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжКонтрагентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжКонтрагентыМенеджер"].ЗначенияРеквизитовОбъекта(КонтрагентСсылка, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Результат 						= Новый Структура(ПолучаемыеСвойства);
	Схема  							= Неопределено;
	мПолучаемыеСвойстваОбъекта 		= Новый Массив;
	мПолучаемыеСвойства 			= СтрРазделить(ПолучаемыеСвойства,",",Ложь);
	
	ИсточникиПолей 					= Новый Структура;	
	
	Если НЕ мПолучаемыеСвойства.Найти("ПаспортРФ") = Неопределено Тогда
		ПараметрыСхемы  			= Новый Структура;
		ПараметрыВТ 				= Новый Массив;
		СоотвествиеПолей 			= Новый Структура("Контрагент,ВидДокумента","КонтрагентСсылка","ВидДокументаПаспортРФ");
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
		ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
		РегистрыСведений.энргДокументыФизическихЛиц.ЗаполнитьСхемуСрезПоследних(Схема,ПараметрыСхемы,"");
		ИсточникиПолей.Вставить("ПаспортРФ", Схема.ПакетЗапросов.Количество());
	КонецЕсли;
		
	Если НЕ мПолучаемыеСвойства.Найти("СНИЛС") = Неопределено Тогда
		мПолучаемыеСвойстваОбъекта.Добавить("СНИЛС");
	КонецЕсли;
	
	Если НЕ мПолучаемыеСвойства.Найти("ДатаРождения") = Неопределено Тогда
		мПолучаемыеСвойстваОбъекта.Добавить("ДатаРождения");
	КонецЕсли;
	
	Если НЕ мПолучаемыеСвойства.Найти("ДомашнийТелефон") = Неопределено Тогда
		мПолучаемыеСвойстваОбъекта.Добавить("ДомашнийТелефон");
	КонецЕсли;
	
	Если НЕ мПолучаемыеСвойства.Найти("РабочийТелефон") = Неопределено Тогда
		мПолучаемыеСвойстваОбъекта.Добавить("РабочийТелефон");
	КонецЕсли;
	
	Если НЕ мПолучаемыеСвойства.Найти("АдресЮридический") = Неопределено Тогда
		мПолучаемыеСвойстваОбъекта.Добавить("АдресЮридический");
	КонецЕсли;
	
	Если НЕ мПолучаемыеСвойства.Найти("АдресФактический") = Неопределено Тогда
		мПолучаемыеСвойстваОбъекта.Добавить("АдресФактический");
	КонецЕсли;
	
	Если НЕ мПолучаемыеСвойства.Найти("ЭлектроннаяПочта") = Неопределено Тогда
		мПолучаемыеСвойстваОбъекта.Добавить("ЭлектроннаяПочта");
	КонецЕсли;

	Если НЕ мПолучаемыеСвойстваОбъекта.Количество() = 0 Тогда
		ПараметрыСхемы  						= Новый Структура;
		ПараметрыВТ 							= Новый Массив;
		СоотвествиеПолей 						= Новый Структура("Ссылка","КонтрагентСсылка");
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
		ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
		Справочники.энргКонтрагенты.ЗаполнитьСхемуЗначенияРеквизитов(Схема,ПараметрыВТ,"");	
		
		Для Индекс = 0 По мПолучаемыеСвойстваОбъекта.ВГраница() Цикл
			ИсточникиПолей.Вставить(мПолучаемыеСвойстваОбъекта[Индекс],  Схема.ПакетЗапросов.Количество());
		КонецЦикла;		
	КонецЕсли;
	
	ПараметрыЗапроса 							= Новый Структура;
	ПараметрыЗапроса.Вставить("КонтрагентСсылка", 		КонтрагентСсылка);
	ПараметрыЗапроса.Вставить("ВидДокументаПаспортРФ", 	Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
	РезультатПакет  							= энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса);
	
	Для Индекс = 0 По РезультатПакет.ВГраница() Цикл
		РезультатЗапроса						= РезультатПакет[Индекс];
		
		Если Не РезультатЗапроса.Пустой() Тогда			
			Выборка 							= РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Для Каждого КлючЗначение Из ИсточникиПолей Цикл
				Если КлючЗначение.Значение = Индекс Тогда
					Результат[КлючЗначение.Ключ] = Выборка[КлючЗначение.Ключ];
				КонецЕсли;			
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 	
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "КонтрагентыМенеджер.ЗначенияРеквизитовОбъекта";
		ПараметрыМетода 			= Новый Структура("КонтрагентСсылка, ПолучаемыеСвойства",КонтрагентСсылка, ПолучаемыеСвойства); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли