#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьПоставщикаУслуг(ДанныеШапки,Движения,ИмяПоляПоставщик = Неопределено) Экспорт  
	Набор 			= Движения.бестПоставщикиУслугНП;
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Документ",ДанныеШапки.Документ);

	Текст 			="
	|ВЫБРАТЬ
	|	ДанныеШапки.Ссылка,
	|	ДанныеШапки.Район,
	|	ДанныеШапки.Организация,
	|	ДанныеТабличнойЧасти.ТочкаУчета,
	|	ДанныеТабличнойЧасти.Услуга,
	|	ДанныеТабличнойЧасти.ЭтоСоставнаяУслуга,
	|	ДанныеТабличнойЧасти.IDСтроки,
	|	ДанныеТабличнойЧасти.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ДанныеТочекУчета
	|ИЗ
	|	Документ.%%ИмяТаблицыШапка%%.ТочкиУчета КАК ДанныеТабличнойЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.%%ИмяТаблицыШапка%% КАК ДанныеШапки
	|		ПО ДанныеТабличнойЧасти.Ссылка = ДанныеШапки.Ссылка
	|			И (ДанныеТабличнойЧасти.Ссылка = &Документ)
	|			И (ДанныеШапки.Ссылка = &Документ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТочекУчета.Район,
	|	ДанныеТочекУчета.Организация,
	|	ДанныеТочекУчета.ТочкаУчета,
	|	ДанныеТочекУчета.Услуга Услуга,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL 
	|			ТОГДА ДанныеТочекУчета.Поставщик
	|		ИНАЧЕ ДанныеТабличнойЧастиПоставщики.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL 
	|			ТОГДА ДанныеТочекУчета.Услуга
	|		ИНАЧЕ ДанныеТабличнойЧастиПоставщики.ЧастьСоставнойУслуги
	|	КОНЕЦ КАК ЧастьСоставной
	|ИЗ
	|	ДанныеТочекУчета КАК ДанныеТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.%%ИмяТаблицыШапка%%.ПоставщикиСоставныхУслуг КАК ДанныеТабличнойЧастиПоставщики
	|		ПО ДанныеТочекУчета.Ссылка = ДанныеТабличнойЧастиПоставщики.Ссылка
	|			И (ДанныеТочекУчета.ЭтоСоставнаяУслуга)
	|			И ДанныеТочекУчета.IDСтроки = ДанныеТабличнойЧастиПоставщики.IDСтроки";
	
	Если НЕ ИмяПоляПоставщик = Неопределено тогда
		 Текст 			= СтрЗаменить(Текст,"ДанныеТабличнойЧастиПоставщики.Поставщик","ДанныеТабличнойЧастиПоставщики."  + ИмяПоляПоставщик + "");
		 Текст 			= СтрЗаменить(Текст,"ДанныеТабличнойЧасти.Поставщик","ДанныеТабличнойЧасти."  + ИмяПоляПоставщик + "");	 
	КонецЕсли;
	    	
	Запрос.Текст 					= СтрЗаменить(Текст,"%%ИмяТаблицыШапка%%",ДанныеШапки.ИмяДокумента);
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		Запись 						= Набор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.период 				= ДанныеШапки.Дата;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
	КонецЦикла; 	
КонецПроцедуры

#КонецОбласти
