#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет значения дополнительных социальных норм потребления коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ИмяТаблицыПериодов	-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначенияДополнительныхСоциальныхНормПотребленияКоллекцияПериодов(Схема,ПараметрыОтбора,ИмяТаблицыПериодов,ТаблицаДляПомещения) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса")); 		
	КонецЕсли;

	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияСоциальныхНормативовКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
		
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ЧастныйСектор, Строение, Помещение, Услуга, НаправлениеИспользованияТУ";
		ИмяТаблицы 					= "ЗначенияДополнительныхСоциальныхНормативов";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет значения текущих дополнительных социальных норм потребления.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ЗначенияТекущихДополнительныхСоциальныхНормПотребления(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияСоциальныхНормативов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ЧастныйСектор, Строение, Помещение, Услуга, НаправлениеИспользованияТУ";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргЗначенияДополнительныхСоциальныхНормативовСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначенияСоциальныхНормативов() 
	
	Текст = 
	"ВЫБРАТЬ
	|	ЗначенияДополнительныхСоциальныхНормативов.Организация КАК Организация,
	|	ЗначенияДополнительныхСоциальныхНормативов.Район КАК Район,
	|	ЗначенияДополнительныхСоциальныхНормативов.ЧастныйСектор КАК ЧастныйСектор,
	|	ЗначенияДополнительныхСоциальныхНормативов.Строение КАК Строение,
	|	ЗначенияДополнительныхСоциальныхНормативов.Помещение КАК Помещение,
	|	ЗначенияДополнительныхСоциальныхНормативов.Услуга КАК Услуга,
	|	ЗначенияДополнительныхСоциальныхНормативов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЗначенияДополнительныхСоциальныхНормативов.ЗначениеНорматива КАК ЗначениеНорматива
	|ИЗ
	|	РегистрСведений.энргЗначенияДополнительныхСоциальныхНормативов.СрезПоследних КАК ЗначенияДополнительныхСоциальныхНормативов";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗначенияСоциальныхНормативовКоллекцияПериодов() 
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ЗначенияДополнительныхСоциальныхНормативов.Услуга КАК Услуга,
	|	ЗначенияДополнительныхСоциальныхНормативов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЗначенияДополнительныхСоциальныхНормативов.ЗначениеНорматива КАК ЗначениеНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ЗначенияДополнительныхСоциальныхНормативов.Организация КАК Организация,
	|		ЗначенияДополнительныхСоциальныхНормативов.Район КАК Район,
	|		ЗначенияДополнительныхСоциальныхНормативов.ЧастныйСектор КАК ЧастныйСектор,
	|		ЗначенияДополнительныхСоциальныхНормативов.Строение КАК Строение,
	|		ЗначенияДополнительныхСоциальныхНормативов.Помещение КАК Помещение,
	|		ЗначенияДополнительныхСоциальныхНормативов.Услуга КАК Услуга,
	|		ЗначенияДополнительныхСоциальныхНормативов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		МАКСИМУМ(ЗначенияДополнительныхСоциальныхНормативов.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргЗначенияДополнительныхСоциальныхНормативов КАК ЗначенияДополнительныхСоциальныхНормативов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ЗначенияДополнительныхСоциальныхНормативов.Организация = ТаблицаПериодов.Организация
	|				И ЗначенияДополнительныхСоциальныхНормативов.Район = ТаблицаПериодов.Район
	|				И ЗначенияДополнительныхСоциальныхНормативов.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ЗначенияДополнительныхСоциальныхНормативов.Организация,
	|		ЗначенияДополнительныхСоциальныхНормативов.Район,
	|		ЗначенияДополнительныхСоциальныхНормативов.ЧастныйСектор,
	|		ЗначенияДополнительныхСоциальныхНормативов.Строение,
	|		ЗначенияДополнительныхСоциальныхНормативов.Помещение,
	|		ЗначенияДополнительныхСоциальныхНормативов.Услуга,
	|		ЗначенияДополнительныхСоциальныхНормативов.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияДополнительныхСоциальныхНормативов КАК ЗначенияДополнительныхСоциальныхНормативов
	|		ПО ВложенныйЗапрос.Организация = ЗначенияДополнительныхСоциальныхНормативов.Организация
	|			И ВложенныйЗапрос.Район = ЗначенияДополнительныхСоциальныхНормативов.Район
	|			И ВложенныйЗапрос.ЧастныйСектор = ЗначенияДополнительныхСоциальныхНормативов.ЧастныйСектор
	|			И ВложенныйЗапрос.Строение = ЗначенияДополнительныхСоциальныхНормативов.Строение
	|			И ВложенныйЗапрос.Помещение = ЗначенияДополнительныхСоциальныхНормативов.Помещение
	|			И ВложенныйЗапрос.Услуга = ЗначенияДополнительныхСоциальныхНормативов.Услуга
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = ЗначенияДополнительныхСоциальныхНормативов.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.Период = ЗначенияДополнительныхСоциальныхНормативов.Период";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли