
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройку();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим 								= РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия 						= Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог 				= "";	
	ДиалогОткрытия.МножественныйВыбор 	= Ложь; 
	ДиалогОткрытия.Заголовок 			= "Выберите каталог";	
	Если ДиалогОткрытия.Выбрать() Тогда  		
		КаталогФайлов = ДиалогОткрытия.Каталог; 
	КонецЕсли;	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	СохранитьНастройкуНаСервере();
КонецПроцедуры 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КонстантаНастроек()
	Возврат энргИнтеграцияСПирамидой.ОбъектНастроекОбмена();
КонецФункции

&НаСервере
Процедура ПрочитатьНастройку()
	КаталогФайлов = энргИнтеграцияСПирамидой.ДанныеНастроек();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуНаСервере()
	КонстантаНастроек 	= КонстантаНастроек();
	ДанныеНастроек 		= Новый ХранилищеЗначения(КаталогФайлов);
	КонстантаНастроек.Установить(ДанныеНастроек);
КонецПроцедуры

#КонецОбласти



