
//&НаКлиенте
//Процедура ЗаполнитьПоСтруктуреСети(Команда)
//	ЗаполнитьПоСтруктуреСетиНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПоСтруктуреСетиНаСервере()
//	ДанныеПоСтруктуре = Документы.бестУстановитьФормулуРасчетаТочекУчетаНП.ПолучитьДанныеСтруктурыСетиПоТочке(ДолеваяТочкаУчета,Услуга,ОбъектРасчета,Район,Организация,Дата);
//	
//	Если ДанныеПоСтруктуре <> Неопределено Тогда
//		ВыборкаДетальныеЗаписи = ДанныеПоСтруктуре.Выбрать();
//		
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			НовСтр = Субабоненты.Добавить();
//			ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи); 
//		КонецЦикла;
//	КонецЕсли;
//КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	IDСтроки 						= Параметры.IDСтроки;
	ДолеваяТочкаУчета 				= Параметры.ДолеваяТочкаУчета;
	Район 							= Параметры.Район;
	Организация 					= Параметры.Организация;
	Дата 							= Параметры.Дата;
	Транзит 						= Параметры.Транзит;
	Если Транзит Тогда
		СвязьПарВыбора = Новый СвязьПараметраВыбора("Отбор.Организация", "Организация");
		НоваяСвязь = Новый Массив();
  		НоваяСвязь.Добавить(СвязьПарВыбора);
		Элементы.СубабонентыДоговор.СвязиПараметровВыбора = Новый ФиксированныйМассив(НоваяСвязь); 
	КонецЕсли;
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСубабоненты

&НаКлиенте
Процедура СубабонентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Субабоненты.ТекущиеДанные.IDСтроки	= IDСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СубабонентыОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	
	ПараметрыВыбораФормы = Новый Структура("Период, Организация, Район, Договор", ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), ДатаСеанса()));
	Если Транзит Тогда
		ПараметрыВыбораФормы.Удалить("Район");
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ПараметрыВыбораФормы, ЭтотОбъект);
	ПараметрыВыбораФормы.Договор = ТекДанные.Договор;
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ОбъектРасчетаОкончаниеВыбора", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("Справочник.бестОбъектыРасчета.ФормаВыбора", ПараметрыВыбораФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СубабонентыУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элемент.Родитель.ТекущиеДанные;   
	Если ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда	
		ВыборУслугиИТочкиУчета(ТекДанные, Элемент);
	ИначеЕсли ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргАбоненты") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("Район", Район);
		ПараметрыФормы.Вставить("КлючПомещения", энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Договор, "КлючПомещения"));
		ПараметрыФормы.Вставить("Период", Дата);
		ПараметрыФормы.Вставить("ТочкаУчета", ТекДанные.ТочкаУчета);
		
		ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", ПараметрыФормы, Элемент);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле не заполнено.",, "СубабонентыДоговор");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СубабонентыТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элемент.Родитель.ТекущиеДанные;   
	Если ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда	
		ВыборУслугиИТочкиУчета(ТекДанные, Элемент);
	ИначеЕсли ТипЗнч(ТекДанные.Договор) = Тип("СправочникСсылка.энргАбоненты") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Организация);
		ПараметрыФормы.Вставить("Район", Район);
		ПараметрыФормы.Вставить("АбонентВладелец", энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.Договор, "КлючПомещения"));
		ПараметрыФормы.Вставить("Период", Дата);
		
		ОткрытьФорму("Справочник.энргТочкиУчета.ФормаВыбора", ПараметрыФормы, Элемент);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле не заполнено.",, "СубабонентыДоговор");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Субабоненты", Субабоненты);
	
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период,ПростыеУслуги,Организация,Район,ОбъектРасчета",?(ЗначениеЗаполнено(Дата),КонецДня(Дата), ТекущаяДата()), Истина);
	Если Транзит Тогда
		СтруктураОтбора.Удалить("Район");
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ЭтотОбъект);
	СтруктураОтбора.ОбъектРасчета = ТекДанные.ОбъектРасчета;
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца", СтруктураОтбора, "НП");
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		ТекДанные.ТочкаУчета = РезультатЗакрытия.ТочкаУчета;
		ТекДанные.Услуга = РезультатЗакрытия.Услуга;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаОкончаниеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	Если Не РезультатЗакрытия = Неопределено Тогда 
		Модифицированность = Истина;
		ТекДанные = ДополнительныеПараметры.ТекДанные;
		ТекДанные.ОбъектРасчета = РезультатЗакрытия;
	КонецЕсли;
	ОбъектРасчетаОкончаниеВыбораПереопределяемый(РезультатЗакрытия, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	ЗаполнитьТЧИзПараметров(Параметры.Субабоненты			, Субабоненты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаОкончаниеВыбораПереопределяемый(РезультатЗакрытия, ДополнительныеПараметры)
	// Переопределяется в расширении
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧИзПараметров(ТабЧастьИзДокумента, Таблица)
	
	Если ТабЧастьИзДокумента.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСубабонентов = Таблица.Выгрузить().СкопироватьКолонки();
	Для Каждого СтруктураСтроки Из ТабЧастьИзДокумента Цикл
		НоваяСтрока = ТаблицаСубабонентов.Добавить(); 
		НоваяСтрока.Договор = Справочники.энргАбоненты.ПустаяСсылка();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
	КонецЦикла;  
	
	ПараметрыЗапроса = Новый Структура("Период, Организация, Район, ТаблицаСубабонентов", ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), ТекущаяДатаСеанса()), Организация, Район, ТаблицаСубабонентов);
	РезультатЗапроса = РезультатЗапросаОтборПоДоговору(ПараметрыЗапроса);  
	ДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДетальныеЗаписи);
	КонецЦикла; 

КонецПроцедуры 

&НаСервере
Функция РезультатЗапросаОтборПоДоговору(ПараметрыЗапроса)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаСубабонентов.ОбъектРасчета КАК ОбъектРасчета,
	                      |	ТаблицаСубабонентов.ТочкаУчета КАК ТочкаУчета,
	                      |	ТаблицаСубабонентов.Коэффициент КАК Коэффициент,
	                      |	ТаблицаСубабонентов.Услуга КАК Услуга,
	                      |	ТаблицаСубабонентов.IDСтроки КАК IDСтроки,
	                      |	ТаблицаСубабонентов.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	                      |	ТаблицаСубабонентов.Договор КАК Абонент
	                      |ПОМЕСТИТЬ ВТ_Абоненты
	                      |ИЗ
	                      |	&ТаблицаСубабонентов КАК ТаблицаСубабонентов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	                      |	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	                      |	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	                      |	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	                      |ПОМЕСТИТЬ ВТ_ОбъектыРасчета
	                      |ИЗ
	                      |	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	                      |			&Период,
	                      |			Организация = &Организация
	                      |				И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	                      |				&Период,
	                      |				Организация = &Организация
	                      |					И Район = &Район) КАК бестАктивностьТочекУчетаНПСрезПоследних
	                      |		ПО бестДоговорыТочекУчетаСрезПоследних.Организация = бестАктивностьТочекУчетаНПСрезПоследних.Организация
	                      |			И бестДоговорыТочекУчетаСрезПоследних.Район = бестАктивностьТочекУчетаНПСрезПоследних.Район
	                      |			И бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета
	                      |			И бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета = бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета
	                      |			И (НЕ бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП))
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Абоненты КАК ВТ_Абоненты
	                      |		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = ВТ_Абоненты.ОбъектРасчета
	                      |			И бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета = ВТ_Абоненты.ТочкаУчета
	                      |			И бестДоговорыТочекУчетаСрезПоследних.Услуга = ВТ_Абоненты.Услуга
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Абоненты.ОбъектРасчета КАК ОбъектРасчета,
	                      |	ВТ_Абоненты.ТочкаУчета КАК ТочкаУчета,
	                      |	ВТ_Абоненты.Коэффициент КАК Коэффициент,
	                      |	ВТ_Абоненты.Услуга КАК Услуга,
	                      |	ВТ_Абоненты.IDСтроки КАК IDСтроки,
	                      |	ВТ_Абоненты.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Абоненты.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	                      |			ТОГДА ЕСТЬNULL(ВТ_ОбъектыРасчета.Договор, ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка))
	                      |		ИНАЧЕ ВТ_Абоненты.Абонент
	                      |	КОНЕЦ КАК Договор
	                      |ИЗ
	                      |	ВТ_Абоненты КАК ВТ_Абоненты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъектыРасчета КАК ВТ_ОбъектыРасчета
	                      |		ПО ВТ_Абоненты.ОбъектРасчета = ВТ_ОбъектыРасчета.ОбъектРасчета
	                      |			И ВТ_Абоненты.ТочкаУчета = ВТ_ОбъектыРасчета.ТочкаУчета
	                      |			И ВТ_Абоненты.Услуга = ВТ_ОбъектыРасчета.Услуга");
	
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("Район", ПараметрыЗапроса.Район);
	Запрос.УстановитьПараметр("Период", ПараметрыЗапроса.Период);
	Запрос.УстановитьПараметр("ТаблицаСубабонентов", ПараметрыЗапроса.ТаблицаСубабонентов);
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти