#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Проведение

#Область ИнициализацияДанныхДокумента

// Процедура - Инициализировать данные документа
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка.бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК 
//  ДополнительныеСвойства	 - Структура 
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт 
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
		
	ДобавитьТекстЗапросабестДанныеДляРасчетаНерегулируемойЦеныПервойЦК(Схема, 
		"бестДанныеДляРасчетаНерегулируемойЦеныПервойЦК");
		
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ДобавитьТекстЗапросабестДанныеДляРасчетаНерегулируемойЦеныПервойЦК(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Поставщик КАК Поставщик,
	|	Шапка.Услуга КАК Услуга,
	|	Шапка.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Шапка.НочнаяЗонаСуток КАК НочнаяЗонаСуток,
	|	Шапка.ПолупиковаяЗонаСуток КАК ПолупиковаяЗонаСуток,
	|	Шапка.ПиковаяЗонаСуток КАК ПиковаяЗонаСуток,
	|	Шапка.ДневнаяЗонаСуток КАК ДневнаяЗонаСуток,
	|	Шапка.ЦенаНаМощность КАК ЦенаНаМощность,
	|	Шапка.ЦенаНаЭлектроэнергию КАК ЦенаНаЭлектроэнергию,
	|	Шапка.ВеличинаИзмененияЦены КАК ВеличинаИзмененияЦены,
	|	Шапка.ОбъемПиковогоПотребления КАК ОбъемПиковогоПотребления,
	|	Шапка.ОбъемПокупки КАК ОбъемПокупки,
	|	Шапка.ОбъемПотребленияМощностиНаселением КАК ОбъемПотребленияМощностиНаселением,
	|	Шапка.ОбъемПотребленияЭлектроэнергии КАК ОбъемПотребленияЭлектроэнергии,
	|	Шапка.ОбъемПокупкиЭлектроэнергии КАК ОбъемПокупкиЭлектроэнергии,
	|	Шапка.ОбъемПотребленияЭлектроэнергииНаселением КАК ОбъемПотребленияЭлектроэнергииНаселением
	|ИЗ
	|	Документ.бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли