#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект); 
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);   
	Документы.бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	бестПроведениеСерверНП.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры
   
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли