#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьДокументыУстановитьНагрузкуПоУслугам(ТЗОбъектов,ДопПараметры) Экспорт
	МассивСозданныхДокументов = Новый Массив;
	НачатьТранзакцию();
	ТекОбъектРасчета = Неопределено;
	НовыйДокумент = Неопределено;
	Отказ = Ложь;
	Для каждого стр из ТЗОбъектов Цикл
		Если ТекОбъектРасчета <> стр.ОбъектРасчета  Тогда
			Если ТекОбъектРасчета <> Неопределено Тогда
				Попытка
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					МассивСозданныхДокументов.Добавить(НовыйДокумент.Ссылка);
				Исключение
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЕсли;
			НовыйДокумент = Документы.бестУстановитьНагрузкуПоУслугам.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокумент,ДопПараметры);
			НовыйДокумент.ОбъектРасчета = стр.ОбъектРасчета;
			НовыйДокумент.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(НовыйДокумент.Дата, НовыйДокумент.Организация,НовыйДокумент.Район);
		КонецЕсли;
		
		НовСтр = НовыйДокумент.Нагрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,стр);
		НовСтр.Нагрузка = стр.НагрузкаПосле;
	КонецЦикла;
	
	Если НовыйДокумент <> Неопределено Тогда
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			МассивСозданныхДокументов.Добавить(НовыйДокумент.Ссылка);
		Исключение
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При проведении документов возникла ошибка, документы не созданы.");
		МассивСозданныхДокументов = Новый Массив;
	Иначе
		ЗафиксироватьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документы созданы.");
	КонецЕсли;
	Возврат МассивСозданныхДокументов;
КонецФункции

#КонецОбласти

#КонецЕсли