
#Область СлужебныйПрограммныйИнтерфейс

#Область УстановкаОтборов

Процедура УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметр, ПараметрыВТ, ДоступныеПараметры) Экспорт	
	
	Если ТипЗнч(ПараметрыВТ) = Тип("Структура") Тогда
		УстановитьПараметрВременнойТаблицы(Параметр, ПараметрыВТ, ДоступныеПараметры);
	Иначе
		Для Сч = 0 По ПараметрыВТ.ВГраница() Цикл
			УстановитьПараметрВременнойТаблицы(Параметр, ПараметрыВТ[Сч], ДоступныеПараметры);
		КонецЦикла;
	КонецЕсли;	
	 	
КонецПроцедуры

Процедура УстановитьПараметрыТаблицыПодмены(Запрос, ТаблицыПодмены) Экспорт 
	
	Для Каждого КлючЗначение Из ТаблицыПодмены Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;	
	
КонецПроцедуры 

Процедура УстановитьОтборТаблицы(ОтборСхемыЗапроса, ИмяТаблицы, Параметры, ДоступныеПоляОтбора, ИсточникиПолей = "", ОператорыВыбора = Неопределено) Экспорт 
	Если НЕ ДоступныеПоляОтбора = Неопределено И ТипЗнч(ДоступныеПоляОтбора) = Тип("Строка") Тогда
		врДоступныеПоляОтбора 						= Новый Структура(ИмяТаблицы, ДоступныеПоляОтбора);
	Иначе
		врДоступныеПоляОтбора 						= ДоступныеПоляОтбора;
	КонецЕсли;
	
	стДоступныеПоляОтбора 							= Новый Структура;
	Для Каждого КлючЗначение Из врДоступныеПоляОтбора Цикл
		врмДоступныеПоляОтбора 						= СтрРазделить(СтрЗаменить(ВРег(КлючЗначение.Значение)," ",""),",");
		стДоступныеПоляОтбора.Вставить(КлючЗначение.Ключ, врмДоступныеПоляОтбора);
	КонецЦикла;
		
	Для Сч = 0 По Параметры.ВГраница() Цикл
		ПараметрОтбор = Параметры[Сч];	
		Если ПараметрОтбор.ТипПараметра = "ТипПараметраГруппаИли" Тогда
			Для Индекс = 0 По ПараметрОтбор.Значение.ВГраница() Цикл
				УстановитьОтборОператора(ОператорыВыбора[Индекс].Отбор,ПараметрОтбор.Значение[Индекс],стДоступныеПоляОтбора);
				Если НЕ Индекс = ПараметрОтбор.Значение.ВГраница() Тогда
					НовыйОператор 					= ОператорыВыбора.Добавить(ОператорыВыбора[Индекс]);
					НовыйОператор.ТипОбъединения 	= ТипОбъединенияСхемыЗапроса.Объединить;
					НовыйОператор.Отбор.Удалить(НовыйОператор.Отбор.Количество()-1);
				КонецЕсли;
			КонецЦикла;
			
		Иначе 
			УстановитьОтборОператора(ОтборСхемыЗапроса, ПараметрОтбор, стДоступныеПоляОтбора);	
		КонецЕсли;
	КонецЦикла;

	////Для Сч = 0 По Параметры.ВГраница() Цикл
	////	ПараметрОтбор = Параметры[Сч];
	////	УстановитьОтборОператора(ОтборСхемыЗапроса, ПараметрОтбор, стДоступныеПоляОтбора); 		
	////КонецЦикла;
	
	//Если НЕ ДоступныеПоляОтбора = Неопределено И ТипЗнч(ДоступныеПоляОтбора) = Тип("Строка") Тогда
	//	врДоступныеПоляОтбора 			= Новый Структура(ИмяТаблицы, ДоступныеПоляОтбора);
	//Иначе
	//	врДоступныеПоляОтбора 			= ДоступныеПоляОтбора;
	//КонецЕсли;
	//
	//стДоступныеПоляОтбора 				= Новый Структура;
	//Для Каждого КлючЗначение Из врДоступныеПоляОтбора Цикл
	//	врмДоступныеПоляОтбора 			= СтрРазделить(СтрЗаменить(ВРег(КлючЗначение.Значение)," ",""),",");
	//	стДоступныеПоляОтбора.Вставить(КлючЗначение.Ключ, врмДоступныеПоляОтбора);
	//КонецЦикла;
	//	
	//Для Сч = 0 По Параметры.ВГраница() Цикл
	//	ПараметрОтбор 					= Параметры[Сч];
	//	Если ПараметрОтбор.ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
	//		Шаблон 						= "(%1) В (ВЫБРАТЬ %2 ИЗ %3 КАК %3)";
	//		ПоляТаблицы 				= "";
	//		ПоляВременнойТаблицы 		= "";
	//		ИмяТаблицы 					= ИмяТаблицы;
	//		ШаблонПоля 					= "%1.%2";
	//		ТаблицаИсточник 			= ПараметрОтбор.ТаблицаИсточник;
	//		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
	//			ЕстьПолеОтбора 			= Ложь;
	//			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
	//				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
	//					ЕстьПолеОтбора 	= Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;				
	//			
	//			Если НЕ ЕстьПолеОтбора Тогда
	//				Продолжить;
	//			КонецЕсли;
	//							
	//			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),",","") +  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ);
	//			ПоляВременнойТаблицы	= ПоляВременнойТаблицы + ?(НЕ ПустаяСтрока(ПоляВременнойТаблицы),",","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,ТаблицаИсточник,КлючЗначение.Значение)
	//		КонецЦикла;
	//		
	//		Если ПустаяСтрока(ПоляТаблицы) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ОтборСхемыЗапроса.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ПоляТаблицы,ПоляВременнойТаблицы,ТаблицаИсточник));
	//	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраРавно" Тогда
	//		ПоляТаблицы 				= "";
	//		ШаблонПоля 					= "%1.%2 =&%3";           
	//		
	//		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
	//			ЕстьПолеОтбора 			= Ложь;
	//			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
	//				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
	//					ЕстьПолеОтбора 	= Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;				
	//			
	//			Если НЕ ЕстьПолеОтбора Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
	//		КонецЦикла;
	//		
	//		Если ПустаяСтрока(ПоляТаблицы) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
	//		
	//	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраМеньшеРавно" Тогда
	//		ПоляТаблицы 				= "";
	//		ШаблонПоля 					= "%1.%2 <=&%3";           
	//		
	//		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
	//			ЕстьПолеОтбора 			= Ложь;
	//			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
	//				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
	//					ЕстьПолеОтбора 	= Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;				
	//			
	//			Если НЕ ЕстьПолеОтбора Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
	//		КонецЦикла;
	//		
	//		Если ПустаяСтрока(ПоляТаблицы) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
	//		
	//	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраПодобно" Тогда
	//		ПоляТаблицы 				= "";
	//		ШаблонПоля 					= "%1.Наименование ПОДОБНО ""%2%""";           
	//		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
	//			ЕстьПолеОтбора 			= Ложь;
	//			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
	//				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
	//					ЕстьПолеОтбора 	= Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;				
	//			
	//			Если НЕ ЕстьПолеОтбора Тогда
	//				Продолжить;
	//			КонецЕсли;			
	//							
	//			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") +  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Значение);			
	//		КонецЦикла;
	//		
	//		Если ПустаяСтрока(ПоляТаблицы) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
	//	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраВСписке" Тогда
	//		ПоляТаблицы 				= "";
	//		ШаблонПоля 					= "%1.%2 В (&%3)";           
	//		
	//		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
	//			ЕстьПолеОтбора 			= Ложь;
	//			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
	//				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
	//					ЕстьПолеОтбора 	= Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;				
	//			
	//			Если НЕ ЕстьПолеОтбора Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
	//		КонецЦикла;
	//		
	//		Если ПустаяСтрока(ПоляТаблицы) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
	//	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраМежду" Тогда
	//		СоотвествиеПолей 			= ПараметрОтбор.СоотвествиеПолей;
	//		ПоляТаблицы 				= "";
	//		ШаблонПоля 					= "%1.%2 между (&%3) и (&%4)";           
	//		ЕстьПолеОтбора 				= Ложь;
	//		Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
	//			Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(ПараметрОтбор.ИмяПараметра)) = Неопределено Тогда
	//				ЕстьПолеОтбора 	= Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//		Если НЕ ЕстьПолеОтбора Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		ПоляТаблицы 				= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,ПараметрОтбор.ИмяПараметра,СоотвествиеПолей.НачалоПериода,СоотвествиеПолей.КонецПериода);	
	//		Если ПустаяСтрока(ПоляТаблицы) Тогда
	//			Продолжить;
	//		КонецЕсли;			
	//		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);					
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

Процедура УстановитьИсточникЗапроса(Источник1, Источник2, ТипСоединения, МассивУсловий) Экспорт 
	
	ШаблонПоля	= "%1.%2 = %3.%4";           
	
	Для Каждого ПараметрУсловия Из МассивУсловий Цикл
		Если ПараметрУсловия.ТипУсловия = "ТипУсловияРавно" Тогда
			
			Для Каждого КлючЗначение Из ПараметрУсловия.СоотвествиеУсловий Цикл	
				
				ТекстУсловия	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля, Источник1.Источник.Псевдоним, КлючЗначение.Ключ, Источник2.Источник.Псевдоним, КлючЗначение.Значение);	
				Источник1.Соединения.Добавить(Источник2, ТекстУсловия);
				
			КонецЦикла;
			
			НачальнаяПозиция	=  Источник1.Соединения.Количество() - ПараметрУсловия.СоотвествиеУсловий.Количество();
			
			Для Сч = НачальнаяПозиция По Источник1.Соединения.Количество()-1 Цикл
				Источник1.Соединения[Сч].ТипСоединения = ТипСоединения;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область УстановкаПерехватов

Процедура УстановитьПерехватОбращенияКТаблицам(СхемаЗапроса,ТаблицыПодмены, ПараметрыЗапроса) Экспорт 
	
	Если СхемаЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИменаТаблицПодмены  		= ТаблицыПерехватаВДоступныеТаблицы(СхемаЗапроса, ТаблицыПодмены, ПараметрыЗапроса);	
	Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
		СоотвествиеЗамен 		= Новый Соответствие;
		Для Каждого Оператор Из Пакет.Операторы Цикл
			Для Каждого Источник Из Оператор.Источники Цикл
				УстановитьПерехватОбращенияКТаблицамРекурсия(Источник,СоотвествиеЗамен,ИменаТаблицПодмены);
			КонецЦикла;			
		КонецЦикла;
		Если СоотвествиеЗамен.Количество() > 0 Тогда
			ТекстЗапроса 		= Пакет.ПолучитьТекстЗапроса();
			Для Каждого КлючЗначение Из СоотвествиеЗамен Цикл
				ТекстЗапроса 	= СтрЗаменить(ТекстЗапроса,КлючЗначение.Ключ,КлючЗначение.Значение);
			КонецЦикла;
			Пакет.УстановитьТекстЗапроса(ТекстЗапроса);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьДополнительныеПоляИзИсточника(Пакет, ИмяТаблицы, ПсевдонимТаблицы, УсловияСоединения, ВыбираемыеПоля) Экспорт 
	
	Схема  							= Новый СхемаЗапроса;
	Результат 						= Схема.ПакетЗапросов[0];
	Результат.УстановитьТекстЗапроса(Пакет.ПолучитьТекстЗапроса());
	
	Результат.Операторы[0].Источники.Добавить(ИмяТаблицы,ПсевдонимТаблицы);
	Если Результат.Операторы[0].Источники[0].Соединения.Добавить(ИмяТаблицы,СтрСоединить(УсловияСоединения,Символы.ПС + " И ")) Тогда			 
		Соединение					= Результат.Операторы[0].Источники[0].Соединения[Результат.Операторы[0].Источники[0].Соединения.Количество() -1];
		Соединение.ТипСоединения 	= ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ВыбираемыеПоля Цикл
		Результат.Операторы[0].ВыбираемыеПоля.Добавить(КлючЗначение.Значение);
		Колонка 					= Результат.Колонки[Пакет.Колонки.Количество()-1];
		Колонка.Псевдоним 			= КлючЗначение.Ключ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСПараметрамиСравнения

Функция ПараметрТипРавно(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", СоотвествиеПолей);
	
КонецФункции

Функция ПараметрТипНеРавно(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраНеРавно", СоотвествиеПолей);
	
КонецФункции

Функция ПараметрТипБольше(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраБольше", СоотвествиеПолей);
	
КонецФункции 

Функция ПараметрТипБольшеРавно(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраБольшеРавно", СоотвествиеПолей);
	
КонецФункции

Функция ПараметрТипМеньшеРавно(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраМеньшеРавно", СоотвествиеПолей);
	
КонецФункции

Функция ПараметрТипВыражение(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраВыражение", СоотвествиеПолей);
	
КонецФункции

Функция ПараметрТипВременнаяТаблица(ТаблицаИсточник, СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, ТаблицаИсточник, СоотвествиеПолей", "ТипПараметраВременнаяТаблица", ТаблицаИсточник, СоотвествиеПолей);
	
КонецФункции

Функция ПараметрТипВСписке(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраВСписке", СоотвествиеПолей);
	
КонецФункции

Функция ПараметрТипНеВСписке(СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраНеВСписке", СоотвествиеПолей);
	
КонецФункции

Функция ПараметрГруппаИли(СоставГруппы) Экспорт 
	
	Возврат Новый Структура("Значение,ТипПараметра", СоставГруппы ,"ТипПараметраГруппаИли");
	
КонецФункции

Функция ПараметрПериодРавно(ИмяПараметра) Экспорт 
	
	Возврат Новый Структура("ИмяПараметра,ТипПараметра", ИмяПараметра ,"ТипПараметраРавно");
	
КонецФункции

Функция ПараметрПериодМеньше(ИмяПараметра) Экспорт 
	
	Возврат Новый Структура("ИмяПараметра,ТипПараметра", ИмяПараметра ,"ТипПараметраМеньше");
	
КонецФункции

Функция ПараметрПериодМежду(ИмяПараметра, СоотвествиеПолей) Экспорт 
	
	Возврат Новый Структура("ИмяПараметра,ТипПараметра, СоотвествиеПолей", ИмяПараметра ,"ТипПараметраМежду", СоотвествиеПолей);
	
КонецФункции

#КонецОбласти

Процедура ДобавитьПолеУпорядочивания(ПорядокСхемы, ДоступныеПоля, ИмяПоля) Экспорт 
	НайденноеПоле = ДоступныеПоля.Найти(ИмяПоля);
	Если НайденноеПоле = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПорядокСхемы.Добавить(НайденноеПоле);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УстановкаОтборов

Процедура УстановитьОтборОператора(ОтборСхемыЗапроса, ПараметрОтбор, стДоступныеПоляОтбора)
	
	Если ПараметрОтбор.ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
		Шаблон 						= "(%1) В (ВЫБРАТЬ %2 ИЗ %3 КАК %3)";
		ПоляТаблицы 				= "";
		ПоляВременнойТаблицы 		= "";
		ИмяТаблицы 					= ИмяТаблицы;
		ШаблонПоля 					= "%1.%2";
		ТаблицаИсточник 			= ПараметрОтбор.ТаблицаИсточник;
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),",","") +  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ);
			ПоляВременнойТаблицы	= ПоляВременнойТаблицы + ?(НЕ ПустаяСтрока(ПоляВременнойТаблицы),",","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,ТаблицаИсточник,КлючЗначение.Значение)
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ПоляТаблицы,ПоляВременнойТаблицы,ТаблицаИсточник));
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраРавно" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1.%2 =&%3";           
		
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраМеньше" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1.%2 <&%3";           
		
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);	
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраНеРавно" Тогда
		
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1.%2 <>&%3";           
		
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраБольше" Тогда
		
		ПоляТаблицы = "";
		ШаблонПоля 	= "%1.%2 > %3";           
		
		ДобавитьУсловие(ПоляТаблицы, ШаблонПоля, стДоступныеПоляОтбора, ПараметрОтбор);
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраБольшеРавно" Тогда
		
		ПоляТаблицы = "";
		ШаблонПоля 	= "%1.%2 >= %3";           
		
		ДобавитьУсловие(ПоляТаблицы, ШаблонПоля, стДоступныеПоляОтбора, ПараметрОтбор);
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);	
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраПодобно" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1.Наименование ПОДОБНО ""%2%""";           
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;			
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") +  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Значение);			
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);   		 			
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраВСписке" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1.%2 В (&%3)";           
		
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);
		
	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраНеВСписке" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "НЕ %1.%2 В (&%3)";           
		
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,КлючЗначение.Значение);			
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы);

	ИначеЕсли ПараметрОтбор.ТипПараметра = "ТипПараметраМежду" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1.%2 между (&%3) и (&%4)";           
		
		Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
			ЕстьПолеОтбора 			= Ложь;
			Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
				Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено или  Не КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(ПараметрОтбор.ИмяПараметра)) = Неопределено Тогда
					ЕстьПолеОтбора 	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;				
			
			Если НЕ ЕстьПолеОтбора Тогда
				Продолжить;
			КонецЕсли;

			Если КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда  				
				
				ПоляТаблицы 				= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,ПараметрОтбор.ИмяПараметра,ПараметрОтбор.СоотвествиеПолей.НачалоПериода,ПараметрОтбор.СоотвествиеПолей.КонецПериода);	

			иначе 
				ПоляСПо					= КлючЗначение.Значение;
				ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначениеИмяТаблицы.Ключ,КлючЗначение.Ключ,ПоляСПо.ГраницаС, ПоляСПо.ГраницаПо);			
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		ОтборСхемыЗапроса.Добавить(ПоляТаблицы); 
		 	
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьУсловие(ПоляТаблицы, ШаблонПоля, стДоступныеПоляОтбора, ПараметрОтбор)
	
	Для Каждого КлючЗначение Из ПараметрОтбор.СоотвествиеПолей Цикл				
		
		ЕстьПолеОтбора = Ложь;
		
		Для Каждого КлючЗначениеИмяТаблицы Из стДоступныеПоляОтбора Цикл
			Если НЕ КлючЗначениеИмяТаблицы.Значение.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
				ЕстьПолеОтбора = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;				
		
		Если НЕ ЕстьПолеОтбора Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляТаблицы = ПоляТаблицы + 
		?(НЕ ПустаяСтрока(ПоляТаблицы), Символы.ПС + "И ", "") + 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонПоля, 
			КлючЗначениеИмяТаблицы.Ключ, 
			КлючЗначение.Ключ, 
			КлючЗначение.Значение);	
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область УстановкаПерехватов

Процедура УстановитьПерехватОбращенияКТаблицамРекурсия(Источник,СоотвествиеЗамен,ИменаТаблицПодмены)
	
	Если ТипЗнч(Источник.Источник) = Тип("ТаблицаСхемыЗапроса") Тогда
		Если НЕ ИменаТаблицПодмены[Источник.Источник.ИмяТаблицы] = Неопределено Тогда 			
			СоотвествиеЗамен.Вставить(Источник.Источник.ИмяТаблицы + " КАК " + Источник.Источник.Псевдоним, ИменаТаблицПодмены[Источник.Источник.ИмяТаблицы] + " КАК " + Источник.Источник.Псевдоним);
		КонецЕсли;		
	ИначеЕсли ТипЗнч(Источник.Источник) = Тип("ВложенныйЗапросСхемыЗапроса") Тогда
		Для Каждого яОператор Из Источник.Источник.Запрос.Операторы Цикл
			Для Каждого яИсточник Из яОператор.Источники Цикл
				УстановитьПерехватОбращенияКТаблицамРекурсия(яИсточник,СоотвествиеЗамен,ИменаТаблицПодмены);
			КонецЦикла;			
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник.Источник) = Тип("ОписаниеВременнойТаблицыСхемыЗапроса") Тогда
		Ат = 0;
	Иначе
		ВызватьИсключение "Ой, что то пошло не так";
	КонецЕсли;
		
	
КонецПроцедуры

Процедура УстановитьПараметрВременнойТаблицы(Параметр, ПараметрыВТ, ДоступныеПараметры)
	
	мДоступныеПараметры 			= СтрРазделить(СтрЗаменить(ВРег(ДоступныеПараметры)," ",""),",",);
	Если ПараметрыВТ.ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
		Шаблон 						= "(%1) В (ВЫБРАТЬ %2 ИЗ %3 КАК %3)";
		ПоляТаблицы 				= "";
		ПоляВременнойТаблицы 		= "";		
		ШаблонПоля 					= "%1";
		ШаблонПоляВыбора			= "%1.%2";
		ТаблицаИсточник 			= ПараметрыВТ.ТаблицаИсточник;
		Для Каждого КлючЗначение Из ПараметрыВТ.СоотвествиеПолей Цикл				
			Если ПустаяСтрока(ДоступныеПараметры) ИЛИ мДоступныеПараметры.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),",","") +  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначение.Ключ);
			ПоляВременнойТаблицы	= ПоляВременнойТаблицы + ?(НЕ ПустаяСтрока(ПоляВременнойТаблицы),",","") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоляВыбора,ТаблицаИсточник,КлючЗначение.Значение)
		КонецЦикла;
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		стрВыражение 				= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ПоляТаблицы,ПоляВременнойТаблицы,ТаблицаИсточник);
		
		Если Не ПустаяСтрока("" + Параметр.Выражение) Тогда
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса("" + Параметр.Выражение + Символы.ПС + "И " + стрВыражение);
		Иначе
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса(стрВыражение);
		КонецЕсли;
		
		
	ИначеЕсли ПараметрыВТ.ТипПараметра = "ТипПараметраРавно" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1 = &%2";
		Для Каждого КлючЗначение Из ПараметрыВТ.СоотвествиеПолей Цикл				
			Если ПустаяСтрока(ДоступныеПараметры) ИЛИ мДоступныеПараметры.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			мПараметрыИЛИ 			= СтрРазделить(КлючЗначение.Значение, ",");
			ПолеТаблицы 			= ?(мПараметрыИЛИ.Количество() = 1,"","(");
			Для ИндексПараметраИли = 0 По мПараметрыИЛИ.ВГраница() Цикл
				Если НЕ ИндексПараметраИли = 0 Тогда
					ПолеТаблицы 	= ПолеТаблицы + Символы.ПС + "ИЛИ ";
				КонецЕсли;
				ПолеТаблицы 		= ПолеТаблицы + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначение.Ключ,мПараметрыИЛИ[ИндексПараметраИли]);
			КонецЦикла;
			
			Если НЕ мПараметрыИЛИ.Количество() = 1 Тогда
				ПолеТаблицы 		= ПолеТаблицы + ")";
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + ПолеТаблицы;
		КонецЦикла;	
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ПустаяСтрока("" + Параметр.Выражение) Тогда
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса("" + Параметр.Выражение + Символы.ПС + "И " + ПоляТаблицы);
		Иначе
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса(ПоляТаблицы);
		КонецЕсли;
		
	ИначеЕсли ПараметрыВТ.ТипПараметра = "ТипПараметраМеньше" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1 < &%2";
		Для Каждого КлючЗначение Из ПараметрыВТ.СоотвествиеПолей Цикл				
			Если ПустаяСтрока(ДоступныеПараметры) ИЛИ мДоступныеПараметры.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			мПараметрыИЛИ 			= СтрРазделить(КлючЗначение.Значение, ",");
			ПолеТаблицы 			= ?(мПараметрыИЛИ.Количество() = 1,"","(");
			Для ИндексПараметраИли = 0 По мПараметрыИЛИ.ВГраница() Цикл
				Если НЕ ИндексПараметраИли = 0 Тогда
					ПолеТаблицы 	= ПолеТаблицы + Символы.ПС + "ИЛИ ";
				КонецЕсли;
				ПолеТаблицы 		= ПолеТаблицы + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначение.Ключ,мПараметрыИЛИ[ИндексПараметраИли]);
			КонецЦикла;
			
			Если НЕ мПараметрыИЛИ.Количество() = 1 Тогда
				ПолеТаблицы 		= ПолеТаблицы + ")";
			КонецЕсли;
			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") + ПолеТаблицы;
		КонецЦикла;	
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ПустаяСтрока("" + Параметр.Выражение) Тогда
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса("" + Параметр.Выражение + Символы.ПС + "И " + ПоляТаблицы);
		Иначе
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса(ПоляТаблицы);
		КонецЕсли;
		
	ИначеЕсли ПараметрыВТ.ТипПараметра = "ТипПараметраВСписке" Тогда
		ПоляТаблицы 				= "";
		ШаблонПоля 					= "%1 В (&%2)";
		Для Каждого КлючЗначение Из ПараметрыВТ.СоотвествиеПолей Цикл				
			Если ПустаяСтрока(ДоступныеПараметры) ИЛИ мДоступныеПараметры.Найти(ВРег(КлючЗначение.Ключ)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			ПоляТаблицы 			= ПоляТаблицы + ?(НЕ ПустаяСтрока(ПоляТаблицы),Символы.ПС + "И ","") +  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;	
		
		Если ПустаяСтрока(ПоляТаблицы) Тогда
			Возврат;
		КонецЕсли;
				
		Если Не ПустаяСтрока("" + Параметр.Выражение) Тогда
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса("" + Параметр.Выражение + Символы.ПС + "И " + ПоляТаблицы);
		Иначе
			Параметр.Выражение		= Новый ВыражениеСхемыЗапроса(ПоляТаблицы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицыПерехватаВДоступныеТаблицы(СхемаЗапроса, ТаблицыПодмены, ПараметрыЗапроса) 
	ИсходноеКоличествоПакетов 				= Неопределено;
	Индекс 									= 0;
	ТаблицыПерехвата 						= Новый Соответствие;
	ШаблонТекстаЗапроса  					= 
	"ВЫБРАТЬ 
	|	%1
	|ПОМЕСТИТЬ %2
	|ИЗ
	|	&%2 КАК %2";
	ШаблонВыбораПоля 						=  "%1.%2 КАК %2";
	Для Каждого КлючЗначение Из ТаблицыПодмены Цикл
		ТаблицаПерехвата 					= Новый ТаблицаЗначений;
		мМетаданные 						= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючЗначение.Ключ,".");
		Если мМетаданные[0] = "Документ" Тогда
			КоллекцияМетаданных 			= Метаданные.Документы;
		ИначеЕсли мМетаданные[1] = "Справочник" Тогда
			КоллекцияМетаданных 			= Метаданные.Справочники;
		КонецЕсли;
		мМассивПолей 						= Новый Массив;
		яМетаданныеТаблицы  				= КоллекцияМетаданных[мМетаданные[1]];
		ПсевдонимТаблицы 					= "Таблица" + мМетаданные[1];
				
		ДобавитьПоляТаблицыВМассив(мМассивПолей, ПсевдонимТаблицы, ТаблицаПерехвата, ШаблонВыбораПоля, яМетаданныеТаблицы);
	
		ТекстЗапроса  						= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаЗапроса,СтрСоединить(мМассивПолей,"," + Символы.ПС),ПсевдонимТаблицы);
		Если СхемаЗапроса = Неопределено Тогда
			СхемаЗапроса  					= Новый СхемаЗапроса;
			Пакет 							= СхемаЗапроса.ПакетЗапросов[0];
			ИсходноеКоличествоПакетов 		= 0;
		Иначе
			Если ИсходноеКоличествоПакетов = Неопределено Тогда
				ИсходноеКоличествоПакетов 	= СхемаЗапроса.ПакетЗапросов.Количество();
			КонецЕсли;			
			Пакет 							= СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
		КонецЕсли;  	 
		Индекс 								= Индекс + 1;
		Пакет.УстановитьТекстЗапроса(ТекстЗапроса);
		ЗаполнитьТаблицуПерехавата(КлючЗначение.Значение, ТаблицаПерехвата);		
		ТаблицыПерехвата.Вставить(КлючЗначение.Ключ, ПсевдонимТаблицы);
		ПараметрыЗапроса.Вставить(ПсевдонимТаблицы, ТаблицаПерехвата);	
		СхемаЗапроса.ПакетЗапросов.Сдвинуть(Пакет,0-ИсходноеКоличествоПакетов);
		
		Для Каждого ТабЧасть Из яМетаданныеТаблицы.ТабличныеЧасти Цикл			
			ТаблицаПерехватаТабЧасти		= Новый ТаблицаЗначений;
			мМассивПолейТабЧасти			= Новый Массив;
			ПсевдонимТаблицыТабЧасти		= ПсевдонимТаблицы + ТабЧасть.Имя;
			ДобавитьПоляТаблицыВМассив(мМассивПолейТабЧасти, ПсевдонимТаблицыТабЧасти, ТаблицаПерехватаТабЧасти, ШаблонВыбораПоля, ТабЧасть, яМетаданныеТаблицы);
			ТекстЗапросаТабЧасти			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаЗапроса,СтрСоединить(мМассивПолейТабЧасти,"," + Символы.ПС),ПсевдонимТаблицыТабЧасти);
			Пакет 							= СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
			Пакет.УстановитьТекстЗапроса(ТекстЗапросаТабЧасти);
			Для Сч = 0 По КлючЗначение.Значение.ВГраница() Цикл
				Если НЕ КлючЗначение.Значение[Сч].Свойство(ТабЧасть.Имя) Тогда
					Продолжить;
				КонецЕсли; 				
				ЗаполнитьТаблицуПерехавата(КлючЗначение.Значение[Сч][ТабЧасть.Имя], ТаблицаПерехватаТабЧасти);
			КонецЦикла;		
			ТаблицыПерехвата.Вставить(КлючЗначение.Ключ + "." + ТабЧасть.Имя, ПсевдонимТаблицыТабЧасти);
			ПараметрыЗапроса.Вставить(ПсевдонимТаблицыТабЧасти, ТаблицаПерехватаТабЧасти);	
			СхемаЗапроса.ПакетЗапросов.Сдвинуть(Пакет,0-ИсходноеКоличествоПакетов);		
		КонецЦикла;		
	КонецЦикла;
	
	Возврат ТаблицыПерехвата;
	
КонецФункции

Процедура ДобавитьПоляТаблицыВМассив(мМассивПолей, ПсевдонимТаблицы, ТаблицаПерехвата, ШаблонВыбораПоля, яМетаданныеТаблицы, яМетаданныеРодитель  = Неопределено)

	Для Каждого РеквизитШапки Из яМетаданныеТаблицы.СтандартныеРеквизиты Цикл			
		ТаблицаПерехвата.Колонки.Добавить(РеквизитШапки.Имя,РеквизитШапки.Тип);
		мМассивПолей.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВыбораПоля,ПсевдонимТаблицы,РеквизитШапки.Имя));
	КонецЦикла;
	
	Для Каждого РеквизитШапки Из яМетаданныеТаблицы.Реквизиты Цикл
		ТаблицаПерехвата.Колонки.Добавить(РеквизитШапки.Имя,РеквизитШапки.Тип);			
		мМассивПолей.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВыбораПоля,ПсевдонимТаблицы,РеквизитШапки.Имя));
	КонецЦикла;

	Если НЕ яМетаданныеРодитель = Неопределено Тогда
		ТаблицаПерехвата.Колонки.Добавить(яМетаданныеРодитель.СтандартныеРеквизиты.Ссылка.Имя,яМетаданныеРодитель.СтандартныеРеквизиты.Ссылка.Тип);			
		мМассивПолей.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВыбораПоля,ПсевдонимТаблицы,яМетаданныеРодитель.СтандартныеРеквизиты.Ссылка.Имя));
	КонецЕсли;  	
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПерехавата(Источник, Приемник)
	
	Если ТипЗнч(Источник) = Тип("Массив") Тогда
		Для Сч = 0 По Источник.ВГраница() Цикл
			ЗаполнитьЗначенияСвойств(Приемник.Добавить(),  Источник[Сч]);
		КонецЦикла;		
	ИначеЕсли ТипЗнч(Источник) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Приемник.Добавить(),  Источник[Сч]);
	Иначе
		ВызватьИсключение "ЗаполнитьТаблицуПерехавата Не известный тип источника";
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

Функция КлючиТаблицДвижений(Схема) Экспорт 
	
	КлючиТаблицДвижений  				= Новый Структура;
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 							= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Набор") Тогда			
			КлючиТаблицДвижений.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Набор")),Сч);			
			Пакет.ТаблицаДляПомещения 	= "";
		КонецЕсли;		
	КонецЦикла;
	
	Возврат КлючиТаблицДвижений;
	
КонецФункции

#КонецОбласти







