#Область СобытияЭлементовШапки

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район = ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовТабличнойЧастиРучнойПерерасчет

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийМКДТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДополнительныеПараметры = Новый Структура("Период, Организация, Район, АбонентВладелец", Объект.Дата, Объект.Организация, Объект.Район, Объект.МКД);
    энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент, ДополнительныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийМКДПриборУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ДвиженияэнргОбъемНачисленийМКД.ТекущиеДанные;
	ПараметрыФ = Новый Структура("Период, Организация, Район, МКД, ТочкаУчета", Объект.Дата, Объект.Организация, Объект.Район, Объект.МКД, ТекущиеДанные.ТочкаУчета);
	ПриборыСписок = ПолучитьСписокПриборов(ПараметрыФ);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПУ", ЭтотОбъект);
	мФорма = ОткрытьФорму("Справочник.энргПриборыУчетаАбонента.ФормаВыбора",, Элемент,,,, ОписаниеОповещения);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(мФорма.Список,"Ссылка",ПриборыСписок, ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокПриборов(ПараметрыФ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргПриборыТочекМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	               |ИЗ
	               |	РегистрСведений.энргПриборыТочекМКД.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И МКД = &МКД
	               |				И Район = &Район
	               |				И ТочкаУчета = &ТочкаУчета) КАК энргПриборыТочекМКДСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ПараметрыФ.Период);
	Запрос.УстановитьПараметр("Организация", ПараметрыФ.Организация);
	Запрос.УстановитьПараметр("МКД", ПараметрыФ.МКД);
	Запрос.УстановитьПараметр("Район", ПараметрыФ.Район);
	Запрос.УстановитьПараметр("ТочкаУчета", ПараметрыФ.ТочкаУчета);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПриборУчета");
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораПУ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    Элементы.ДвиженияэнргОбъемНачисленийМКД.ТекущиеДанные.ПриборУчета = Результат;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
