
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргРегистрацияПретензийОтПотребителяИсполнителя(ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли; 
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияПоКлючуПомещения(ТекущийОбъект.КлючПомещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
	ЗаполнитьТочкиУчетаСервер();
КонецПроцедуры


&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда
		АбонентПриИзмененииНаСервере();
	Иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьТочкиУчетаСервер();
КонецПроцедуры

&НаСервере
Процедура АбонентПриИзмененииНаСервере()
	ПолучаемыеСвойства 			= "Организация,Район,КлючПомещения";
	ЗначенияРеквизитов 			= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Объект.Абонент, ПолучаемыеСвойства);
	ЗаполнитьЗначенияСвойств(Объект,ЗначенияРеквизитов,ПолучаемыеСвойства);
	
	ДанныеПомещенияПоКлючуПомещения(Объект.КлючПомещения);
КонецПроцедуры


&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		СтроениеПомещениеПриИзмененииСервер();		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СтроениеПомещениеПриИзмененииСервер()
	КлючПомещенияПоСтроениюИПомещению();	
КонецПроцедуры


&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	ПомещениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПомещениеПриИзмененииНаСервере()
	КлючПомещенияПоСтроениюИПомещению();	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьТочкиУчетаСервер();
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);	
КонецПроцедуры


&НаСервере
Процедура КлючПомещенияПоСтроениюИПомещению()	
	ДанныеКлючаПомещения  = Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Строение, Помещение);
	ЗаполнитьЗначенияСвойств(Объект, ДанныеКлючаПомещения, "КлючПомещения,ЧастныйСектор,Район");
КонецПроцедуры


&НаСервере
Процедура ДанныеПомещенияПоКлючуПомещения(КлючПомещения)	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(КлючПомещения);
	Обработки.энргКлючиПомещенийМенеджер.ЗаполнитьДанныеКлючаПомещения(ЭтаФорма, ДанныеПомещенияРезультат);
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТочкиУчетаСервер()
	Объект.ТочкиУчета.Очистить();
	
	ДанныеСтроения 	= Новый Структура("Строение,Помещение,ЧастныйСектор", Строение, Помещение, ЧастныйСектор);
	Результат		= Обработки.энргСостояниеТочекУчетаМенеджер.ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика(Объект.Дата, Объект.Организация, Объект.Район, ДанныеСтроения); 
	Выборка  		= Результат.выбрать();	
	Пока Выборка.следующий() цикл
		НСтрока = Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла;							
КонецПроцедуры

#КонецОбласти


