#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
		
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// 
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииОперацияСПриборомУчета(КомандыСоздатьНаОсновании);  	
		
КонецФункции

// Получает изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета		 = Новый Соответствие; 
	
	ИзменяемыеПараметры 			= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","ПриборУчета,ПриборВведен,ДатаСостоянияПрибора,КоэффициентПУ,ДатаПоверки,ПотериОбъем,ПотериПроцент,ПериодНачисленияВыводаПрибора,СрокПоверкиИстек"));
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","Услуга",""));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры 			= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","ПриборВведен"));
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","ПриборУчета,ПриборВведен,КоэффициентПУ,ДатаПоверки,ПотериОбъем,ПотериПроцент,СрокПоверкиИстек,ПериодНачисленияВыводаПрибора"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры 			= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","ПриборВведен,ДатаПоверки,ПериодНачисленияВыводаПрибора"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ, ИзменяемыеПараметры);	
		
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

// Получает данные для проведение по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт 
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамВводПрибораУчета(Схема,ВыбираемыеТаблицы);	
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамЗаменаПрибораУчета(Схема,ВыбираемыеТаблицы);
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамВыводПрибораУчета(Схема,ВыбираемыеТаблицы);
КонецПроцедуры

// Получает данные изменения состава шкал.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеИзмененияСоставаШкал(Схема,ВыбираемыеТаблицы) Экспорт
	 ПолучитьДанныеИзмененияСоставаШкалАктВводаПрибораУчета(Схема,ВыбираемыеТаблицы);
	 ПолучитьДанныеИзмененияСоставаШкалАктЗаменыПрибораУчета(Схема,ВыбираемыеТаблицы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ключ, "ВидОперации");//Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСПриборомУчета",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСПриборомУчета",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСПриборомУчета",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	

		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОперацияСПриборомУчета");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаВидыДифференцированностиПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема, Регистры);
	ДобавитьТекстЗапросаКоэффциентыПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаВыводыПУБезПоказаний(Схема,Регистры);
	ДобавитьТекстЗапросаПриборыТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеПриборовУчетаАбонента(Схема, Регистры);
	ДобавитьТекстЗапросаСоставУзлаУчета(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры);
	
	ДанныеСтроения			= ДополнительныеСвойства.ДанныеСтроения;
	КлючиТаблицДвижений 	= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  				= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы"						, ДокументСсылка);
	Запрос.УстановитьПараметр("ЧастныйСектор"					, ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение"						, ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("Помещение"						, ДанныеСтроения.Помещение);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор"	, ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
			
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  					= Неопределено;
	Параметры 				= Новый Структура;
	КлючиТаблицКонтроля 	= Новый Структура;	
	
	Если Не Схема = Неопределено Тогда		
		ПараметрыЗапроса 	= Новый Структура;
		ПараметрыЗапроса.Вставить("мДокументы", ДокументСсылка);
		ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 	энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 		КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьСхемуПриборыУчетаДляАрхивации(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	ЭтоНовыйПакет 					= Истина;
	
	Если Схема = Неопределено Тогда
		Схема 						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	ИначеЕсли НЕ ПустаяСтрока(ТаблицаДляПомещения) Тогда
		
		Для Каждого ПакетСхемы Из Схема.ПакетЗапросов Цикл
			Если ВРег(ПакетСхемы.ТаблицаДляПомещения) = ВРег(ТаблицаДляПомещения) Тогда
				Пакет 				= ПакетСхемы;
				ЭтоНовыйПакет 		= Ложь;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		Если ЭтоНовыйПакет Тогда
			Пакет 					= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
	Иначе	
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Если ЭтоНовыйПакет Тогда
		Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляАрхивации());
		Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;;
	Иначе
		врСхема 					= Новый СхемаЗапроса;
		врПакет 					= врСхема.ПакетЗапросов[0];
		врПакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляАрхивации());
		Для Каждого врОператор из врПакет.Операторы Цикл
			НовыйПакет 				= Пакет.Операторы.Добавить(врОператор);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуПриборыУчетаДляПередачи(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт
	ЭтоНовыйПакет 					= Истина;
	
	Если Схема = Неопределено Тогда
		Схема 						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	ИначеЕсли НЕ ПустаяСтрока(ТаблицаДляПомещения) Тогда
		Для Каждого ПакетСхемы Из Схема.ПакетЗапросов Цикл
			Если ВРег(ПакетСхемы.ТаблицаДляПомещения) = ВРег(ТаблицаДляПомещения) Тогда
				Пакет 				= ПакетСхемы;
				ЭтоНовыйПакет 		= Ложь;
				Прервать;
			КонецЕсли;			
		КонецЦикла;		
	Иначе	
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Если ЭтоНовыйПакет Тогда
		Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляПередачи());
		Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;;
	Иначе
		врСхема 					= Новый СхемаЗапроса;
		врПакет 					= врСхема.ПакетЗапросов[0];
		врПакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляПередачи());
		Для Каждого врОператор из врПакет.Операторы Цикл
			НовыйПакет 				= Пакет.Операторы.Добавить(врОператор);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерефейса_Проведение

Процедура ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНомерПломбПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаНомераПломб.КлючСтроки КАК МестоУстановки,
	|	таблицаНомераПломб.НомерПломбы КАК НомерПломбы,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	таблицаНомераПломб.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	таблицаНомераПломб.ЛицоУстановившееПломбу КАК ЛицоУстановившееПломбу,
	|	таблицаНомераПломб.ВидПломбы КАК ВидПломбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табШапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		Документ.энргОперацияСПриборомУчета КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|				И (НЕ табТочкиУчета.УстановленныйПУ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.КлючПомещения,
	|		табИзмерители.ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.Ссылка,
	|		табИзмерители.IDСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА табШапка.ДатаФактическогоСобытия
	|				ИНАЧЕ табШапка.Дата
	|			КОНЕЦ КАК Период,
	|			табШапка.Организация КАК Организация,
	|			табШапка.Район КАК Район,
	|			табШапка.КлючПомещения КАК КлючПомещения,
	|			табШапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табШапка.Ссылка КАК Ссылка,
	|			табТочкиУчета.IDСтроки КАК IDСтроки
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета КАК табШапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|				ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|					И (табШапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (табШапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ)))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|					И (НЕ табТочкиУчета.УстановленныйПУ)) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.Измерители КАК табИзмерители
	|			ПО ВложенныйЗапрос.Ссылка = табИзмерители.Ссылка
	|				И ВложенныйЗапрос.IDСтроки = табИзмерители.IDСтрокиТочкиУчета
	|				И (табИзмерители.Ссылка В (&мДокументы))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.НомераПломб КАК таблицаНомераПломб
	|		ПО ВложенныйЗапрос.Ссылка = таблицаНомераПломб.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаНомераПломб.IDСтрокиИзмерителя
	|			И (таблицаНомераПломб.Ссылка В (&мДокументы))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВидыДифференцированностиПриборовУчета(Схема,Регистры)
	
	ИмяРегистра = "энргВидыДифференцированностиПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	табШкалыПриборовУчета.Шкала КАК Шкала,
	|	ВЫБОР
	|		КОГДА табШкалыПриборовУчета.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|		ИНАЧЕ табШкалыПриборовУчета.ВидДифференцированности
	|	КОНЕЦ КАК ВидДифференцированности,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.энргОперацияСПриборомУчета КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|				И (НЕ табТочкиУчета.УстановленныйПУ)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табШкалыПриборовУчета.IDСтрокиТочкиУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета,
	|	табШкалыПриборовУчета.Шкала,
	|	ВЫБОР
	|		КОГДА табШкалыПриборовУчета.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|		ИНАЧЕ табШкалыПриборовУчета.ВидДифференцированности
	|	КОНЕЦ,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.энргОперацияСПриборомУчета КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|				И (НЕ табТочкиУчета.УстановленныйПУ)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табШкалыПриборовУчета.IDСтрокиТочкиУчета";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема,Регистры)
	
	ИмяРегистра = "энргДатыПоверкиПрибораУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	табТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверки,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	табТочкиУчета.ТочкаУчета,
	|	табТочкиУчета.ПриборУчета,
	|	табТочкиУчета.ДатаПоверкиСчетчика,
	|	Шапка.Дата,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоэффциентыПриборовУчета(Схема,Регистры)
	
	ИмяРегистра = "энргКоэффциентыПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА табТочкиУчета.КоэффициентПУ = 0
	|			ТОГДА 1
	|		ИНАЧЕ табТочкиУчета.КоэффициентПУ
	|	КОНЕЦ КАК Коэффициент,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	табТочкиУчета.ТочкаУчета,
	|	табТочкиУчета.ПриборУчета,
	|	ВЫБОР
	|		КОГДА табТочкиУчета.КоэффициентПУ = 0
	|			ТОГДА 1
	|		ИНАЧЕ табТочкиУчета.КоэффициентПУ
	|	КОНЕЦ,
	|	Шапка.Дата,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема,Регистры)
	
	ИмяРегистра 	= "энргПоказанияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	табПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	0 КАК Разделитель,
	|	табПоказанияПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) КАК ПричинаОтклонения,
	|	ЛОЖЬ КАК КС,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка) КАК ИсточникПоказаний,
	|	ЛОЖЬ КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	табПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		табШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоказанияПриборовУчета.IDСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	табПоказанияПриборовУчета.ТарифнаяЗона,
	|	0,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ПриборУчета.РегистрируетОбъем
	|			ТОГДА табПоказанияПриборовУчета.Разница
	|		ИНАЧЕ табПоказанияПриборовУчета.ТекущиеПоказания
	|	КОНЕЦ,
	|	табПоказанияПриборовУчета.СостояниеПоказаний,
	|	табПоказанияПриборовУчета.ПричинаОтклонения,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка),
	|	табПоказанияПриборовУчета.Переворот,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	табПоказанияПриборовУчета.НомерСтроки,
	|	ВложенныйЗапрос.ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		табШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчетаВывод КАК ПриборУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табТочкиУчета.IDСтрокиВывод КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ))
	|					И (НЕ табТочкиУчета.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоказанияПриборовУчета.IDСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	табПоказанияПриборовУчета.ТарифнаяЗона,
	|	0,
	|	табПоказанияПриборовУчета.ТекущиеПоказания,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты),
	|	Значение(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	табПоказанияПриборовУчета.НомерСтроки,
	|	ВложенныйЗапрос.ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		табШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоказанияПриборовУчета.IDСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	табПоказанияПриборовУчета.ТарифнаяЗона,
	|	0,
	|	табПоказанияПриборовУчета.ТекущиеПоказания,
	|	табПоказанияПриборовУчета.СостояниеПоказаний,
	|	табПоказанияПриборовУчета.ПричинаОтклонения,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	табПоказанияПриборовУчета.НомерСтроки,
	|	ВложенныйЗапрос.ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		табШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчетаВывод КАК ПриборУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табТочкиУчета.IDСтрокиВывод КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|					И (НЕ табТочкиУчета.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоказанияПриборовУчета.IDСтроки"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВыводыПУБезПоказаний(Схема,Регистры)
	
	ИмяРегистра 	= "энргВыводыПУБезПоказаний";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Абонент КАК Абонент
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		табШкалыПриборовУчета.Шкала КАК Шкала,
	|		ВложенныйЗапрос.Абонент КАК Абонент
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчетаВывод КАК ПриборУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табТочкиУчета.IDСтрокиВывод КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор,
	|			Шапка.Абонент КАК Абонент
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ))
	|					И (НЕ табТочкиУчета.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоказанияПриборовУчета.IDСтроки
	|			И (табПоказанияПриборовУчета.ТекущиеПоказания = 0)
	|			И (табПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	энргКлючиПомещений.Строение,
	|	энргКлючиПомещений.Помещение,
	|	энргКлючиПомещений.ЧастныйСектор,
	|	ВложенныйЗапрос.Абонент
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		табШкалыПриборовУчета.Шкала КАК Шкала,
	|		ВложенныйЗапрос.Абонент КАК Абонент
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчетаВывод КАК ПриборУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табТочкиУчета.IDСтрокиВывод КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор,
	|			Шапка.Абонент КАК Абонент
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|					И (НЕ табТочкиУчета.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоказанияПриборовУчета.IDСтроки
	|			И (табПоказанияПриборовУчета.ТекущиеПоказания = 0)
	|			И (табПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.Абонент,
	|	энргКлючиПомещений.Помещение,
	|	энргКлючиПомещений.Строение,
	|	энргКлючиПомещений.ЧастныйСектор"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборыТочекУчета(Схема,Регистры)
	
	ИмяРегистра = "энргПриборыТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	табТочкиУчета.ТочкаУчета,
	|	табТочкиУчета.ПриборУчета,
	|	Шапка.Дата,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеПриборовУчетаАбонента(Схема,Регистры)
	
	ИмяРегистра 	= "энргСостояниеПриборовУчетаАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	табТочкиУчета.ТочкаУчета,
	|	табТочкиУчета.ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод),
	|	Шапка.Дата,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	табТочкиУчета.ТочкаУчета,
	|	табТочкиУчета.ПриборУчетаВывод,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод),
	|	Шапка.Дата,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|			И (НЕ табТочкиУчета.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	табТочкиУчета.ТочкаУчета,
	|	табТочкиУчета.ПриборУчетаВывод,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод),
	|	Шапка.Дата,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ))
	|			И (НЕ табТочкиУчета.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ табТочкиУчета.УстановленныйПУ)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры 

Процедура ДобавитьТекстЗапросаСоставУзлаУчета(Схема, Регистры)
	
	ИмяРегистра = "энргСоставУзлаУчетаПомещения";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаИзмерители.ПриборУчета КАК Измеритель,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табШапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		Документ.энргОперацияСПриборомУчета КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|				И (НЕ табТочкиУчета.УстановленныйПУ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ,
	|		табШапка.Организация,
	|		табШапка.Район,
	|		табШапка.КлючПомещения,
	|		табТочкиУчета.ТочкаУчета,
	|		табТочкиУчета.ПриборУчета,
	|		табШапка.Дата,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ),
	|		табШапка.Ссылка,
	|		табТочкиУчета.IDСтроки
	|	ИЗ
	|		Документ.энргОперацияСПриборомУчета КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|				И (НЕ табТочкиУчета.УстановленныйПУ)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.Измерители КАК таблицаИзмерители
	|		ПО ВложенныйЗапрос.Ссылка = таблицаИзмерители.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаИзмерители.IDСтрокиТочкиУчета
	|			И (таблицаИзмерители.Ссылка В (&мДокументы))
	|			И (таблицаИзмерители.ВспомогательноеОборудование)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры)
		
	ИмяРегистра = "энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	=
	"ВЫБРАТЬ
	|	табШапка.Дата КАК Период,
	|	табШапка.Организация КАК Организация,
	|	табШапка.Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	табШапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табШапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ИСТИНА КАК ОбязанностиВыполнены
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета КАК табШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО (табШапка.Ссылка В (&мДокументы))
	|			И (табШапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ)))
	|			И табШапка.Ссылка = ТаблицаТочкиУчета.Ссылка
	|			И (НЕ ТаблицаТочкиУчета.УстановленныйПУ)";  
	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодами

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамВводПрибораУчета(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовВводПрибораУчета";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамВводПрибораУчета());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());	
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамВыводПрибораУчета(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовВыводПрибораУчета";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамВыводПрибораУчета());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());	
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамЗаменаПрибораУчета(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовЗаменаПрибораУчета";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамЗаменаПрибораУчета());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());	
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПолучитьДанныеИзмененияСоставаШкалАктВводаПрибораУчета(Схема,ВыбираемыеТаблицы) 
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеСоставаШкалАктВводаПрибораУчета";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияСоставаШкалАктВводаПрибораУчета());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьДанныеИзмененияСоставаШкалАктЗаменыПрибораУчета(Схема,ВыбираемыеТаблицы) 
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеСоставаШкалАктЗаменыПрибораУчета";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияСоставаШкалАктЗаменыПрибораУчета());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;

КонецПроцедуры

Функция ТекстДляПроведенияПоСтабильнымПериодамВводПрибораУчета()
	
	Текст 	=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	энргОперацияСПриборомУчета.Ссылка КАК ДокРегистратор,
	|	энргОперацияСПриборомУчета.Дата КАК ДатаРегистратора,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ) КАК ВидОперации,
	|	энргОперацияСПриборомУчета.Дата КАК Дата
	|ПОМЕСТИТЬ ШапкаВводПУ
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК энргОперацияСПриборомУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргОперацияСПриборомУчета.Ссылка
	|			И (энргОперацияСПриборомУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодНачисления КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.МенялосьСостояниеПУ КАК МенялосьСостояниеПУ,
	|	ВложенныйЗапрос.Порядок КАК Порядок,
	|	СУММА(табПотери.ФиксированныйОбъемПотерь) КАК ПотериОбъем,
	|	СУММА(табПотери.ПроцентПотерь) КАК ПотериПроцент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНачисленияВыводаПрибора,
	|	ЛОЖЬ КАК СрокПоверкиИстек
	|ИЗ
	|	(ВЫБРАТЬ
	|		Шапка.Организация КАК Организация,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Район КАК Район,
	|		Шапка.ЧастныйСектор КАК ЧастныйСектор,
	|		Шапка.Строение КАК Строение,
	|		Шапка.Помещение КАК Помещение,
	|		Шапка.ПериодРегистрации КАК ПериодРегистрации,
	|		Шапка.ДокРегистратор КАК ДокРегистратор,
	|		Шапка.ДатаРегистратора КАК ДатаРегистратора,
	|		Шапка.ВидОперации КАК ВидОперации,
	|		ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		ИСТИНА КАК ПриборВведен,
	|		ТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		Шапка.ПериодНачисления КАК ДатаСостоянияПрибора,
	|		ТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|		ИСТИНА КАК МенялосьСостояниеПУ,
	|		0 КАК Порядок,
	|		ТочкиУчета.IDСтроки КАК IDСтроки,
	|		ТочкиУчета.Услуга КАК Услуга
	|	ИЗ
	|		ШапкаВводПУ КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТочкиУчета
	|			ПО Шапка.ДокРегистратор = ТочкиУчета.Ссылка
	|				И (НЕ ТочкиУчета.УстановленныйПУ)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.Потери КАК табПотери
	|		ПО ВложенныйЗапрос.ДокРегистратор = табПотери.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПотери.IDСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.МенялосьСостояниеПУ,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.КоэффициентПУ,
	|	ВложенныйЗапрос.Порядок,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ПериодНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации,
	|	МАКСИМУМ(ВложенныйЗапрос.ТочкаУчета),
	|	ВложенныйЗапрос.ПриборВведен,
	|	МАКСИМУМ(ВложенныйЗапрос.ПриборУчета),
	|	ВложенныйЗапрос.ПериодНачисления,
	|	МАКСИМУМ(ВложенныйЗапрос.КоэффициентПУ),
	|	ВложенныйЗапрос.МенялосьСостояниеПУ,
	|	ВложенныйЗапрос.Порядок,
	|	0,
	|	0,
	|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВложенныйЗапрос.Услуга),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЛОЖЬ
	|ИЗ
	|	(ВЫБРАТЬ
	|		Шапка.Организация КАК Организация,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Район КАК Район,
	|		Шапка.ЧастныйСектор КАК ЧастныйСектор,
	|		Шапка.Строение КАК Строение,
	|		Шапка.Помещение КАК Помещение,
	|		Шапка.ПериодРегистрации КАК ПериодРегистрации,
	|		Шапка.ДокРегистратор КАК ДокРегистратор,
	|		Шапка.ДатаРегистратора КАК ДатаРегистратора,
	|		Шапка.ВидОперации КАК ВидОперации,
	|		МАКСИМУМ(ТочкиУчета.ТочкаУчета) КАК ТочкаУчета,
	|		ИСТИНА КАК ПриборВведен,
	|		МАКСИМУМ(ТочкиУчета.ПриборУчета) КАК ПриборУчета,
	|		Шапка.ПериодНачисления КАК ДатаСостоянияПрибора,
	|		МАКСИМУМ(ТочкиУчета.КоэффициентПУ) КАК КоэффициентПУ,
	|		ИСТИНА КАК МенялосьСостояниеПУ,
	|		1 КАК Порядок,
	|		ТочкиУчета.Услуга КАК Услуга
	|	ИЗ
	|		ШапкаВводПУ КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТочкиУчета
	|			ПО Шапка.ДокРегистратор = ТочкиУчета.Ссылка
	|				И (ТочкиУчета.УстановленныйПУ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Шапка.Организация,
	|		Шапка.ПериодНачисления,
	|		Шапка.Район,
	|		Шапка.ЧастныйСектор,
	|		Шапка.Строение,
	|		Шапка.Помещение,
	|		Шапка.ПериодРегистрации,
	|		Шапка.ДокРегистратор,
	|		Шапка.ДатаРегистратора,
	|		Шапка.ВидОперации,
	|		ТочкиУчета.Услуга,
	|		Шапка.ПериодНачисления) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации,
	|	ВложенныйЗапрос.ПриборВведен,
	|	ВложенныйЗапрос.МенялосьСостояниеПУ,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Порядок,
	|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, ВложенныйЗапрос.Услуга),
	|	ВложенныйЗапрос.ПериодНачисления";
	
	
	//Схема  							= Неопределено;
	//ПараметрыОтбор  				= Новый Массив;
	//
	//ПараметрыВТ 					= Новый Массив;
	//ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	//ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	//ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
	//
	//ПараметрыВыбора	 				= Новый Структура("ПараметрыВТ,Отбор", ПараметрыВТ,ПараметрыОтбор);
	//ПараметрыВыбора.Вставить("Период", Новый Структура("ИмяПараметра","Период"));
	//
	//РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещенияБезПУ(Схема,ПараметрыВыбора);
	
	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамВыводПрибораУчета()
	
	Текст 	=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	энргОперацияСПриборомУчета.Ссылка КАК ДокРегистратор,
	|	энргОперацияСПриборомУчета.Дата КАК ДатаРегистратора,
	|	энргОперацияСПриборомУчета.ПериодНачисленияФактическогоСобытия КАК ПериодНачисленияФактическогоСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ) КАК ВидОперации,
	|	энргОперацияСПриборомУчета.Дата КАК Дата
	|ПОМЕСТИТЬ ШапкаВыводПУ
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК энргОперацияСПриборомУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргОперацияСПриборомУчета.Ссылка
	|			И (энргОперацияСПриборомУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.Организация КАК Организация,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Район КАК Район,
	|	Шапка.ЧастныйСектор КАК ЧастныйСектор,
	|	Шапка.Строение КАК Строение,
	|	Шапка.Помещение КАК Помещение,
	|	Шапка.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.ДокРегистратор КАК ДокРегистратор,
	|	Шапка.ДатаРегистратора КАК ДатаРегистратора,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ЛОЖЬ КАК ПриборВведен,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоверки,
	|	ВЫБОР
	|		КОГДА Шапка.ПериодНачисленияФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ПериодНачисления
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(Шапка.ПериодНачисленияФактическогоСобытия)
	|	КОНЕЦ КАК ПериодНачисленияВыводаПрибора,
	|	0 КАК Порядок
	|ИЗ
	|	ШапкаВыводПУ КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТочкиУчета
	|		ПО Шапка.ДокРегистратор = ТочкиУчета.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамЗаменаПрибораУчета()
	
	Текст 	=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Ссылка КАК ДокРегистратор,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ) КАК ВидОперации,
	|	Шапка.Дата КАК Дата,
	|	таблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|	таблицаТочки.ПриборУчетаВывод КАК ПриборУчета,
	|	0 КАК Порядок,
	|	ЛОЖЬ КАК ПриборВведен,
	|	0 КАК КоэффициентПУ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоверки,
	|	0 КАК ПотериОбъем,
	|	0 КАК ПотериПроцент,
	|	ЛОЖЬ КАК СрокПоверкиИстек,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНачисленияВыводаПрибора
	|ПОМЕСТИТЬ ШапкаВводПУ
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК таблицаТочки
	|		ПО ДокументыДляПроведения.ДокРегистратор = таблицаТочки.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации,
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Порядок,
	|	ВложенныйЗапрос.ПриборВведен,
	|	ВложенныйЗапрос.КоэффициентПУ,
	|	ВложенныйЗапрос.ДатаПоверки,
	|	0 КАК ПотериОбъем,
	|	0 КАК ПотериПроцент,
	|	Ложь,
	|	ДАТАВРЕМЯ(1, 1, 1)
	//|	,СУММА(табПотери.ФиксированныйОбъемПотерь) КАК ПотериОбъем
	//|	,СУММА(табПотери.ПроцентПотерь) КАК ПотериПроцент
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|		Шапка.Ссылка КАК ДокРегистратор,
	|		Шапка.Дата КАК ДатаРегистратора,
	|		ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ) КАК ВидОперации,
	|		Шапка.Дата КАК Дата,
	|		таблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|		таблицаТочки.ПриборУчета КАК ПриборУчета,
	|		1 КАК Порядок,
	|		ИСТИНА КАК ПриборВведен,
	|		таблицаТочки.КоэффициентПУ КАК КоэффициентПУ,
	|		таблицаТочки.ДатаПоверкиСчетчика КАК ДатаПоверки,
	|		таблицаТочки.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК таблицаТочки
	|			ПО ДокументыДляПроведения.ДокРегистратор = таблицаТочки.Ссылка) КАК ВложенныйЗапрос";
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.Потери как табПотери
	//|		ПО ВложенныйЗапрос.ДокРегистратор = табПотери.Ссылка
	//|		И ВложенныйЗапрос.IDСтроки = табПотери.IDСтроки";	
		
	Возврат Текст;
	
КонецФункции

Функция ТекстПолучитьДанныеИзмененияСоставаШкалАктВводаПрибораУчета()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаШкалПриборовУчета.Шкала КАК Шкала,
	|	ТаблицаШкалПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	0 КАК Порядок,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|		ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК ТаблицаШкалПриборовУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = ТаблицаШкалПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалПриборовУчета.IDСтрокиТочкиУчета";
	
	Возврат Текст;
КонецФункции

Функция ТекстПолучитьДанныеИзмененияСоставаШкалАктЗаменыПрибораУчета()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаШкалПриборовУчета.Шкала КАК Шкала,
	|	ТаблицаШкалПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	1 КАК Порядок,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|		ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК ТаблицаШкалПриборовУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = ТаблицаШкалПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалПриборовУчета.IDСтрокиТочкиУчета";
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСГИЖКХ

Функция ТекстЗапросаПриборыУчетаДляАрхивации()
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПричинаЗаменыПрибораУчета КАК ПричинаЗаменыПрибораУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргОперацияСПриборомУчета.Ссылка КАК Ссылка,
	|		энргОперацияСПриборомУчета.Организация КАК Организация,
	|		энргОперацияСПриборомУчетаТочкиУчета.ПриборУчетаВывод КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Справочник.энргПричиныАрхивацииПУ.ПустаяСсылка) КАК ПричинаЗаменыПрибораУчета
	|	ИЗ
	|		Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК энргОперацияСПриборомУчетаТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК энргОперацияСПриборомУчета
	|			ПО энргОперацияСПриборомУчетаТочкиУчета.Ссылка = энргОперацияСПриборомУчета.Ссылка
	|				И (энргОперацияСПриборомУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|	ГДЕ
	|		энргОперацияСПриборомУчета.Ссылка В(&мИзменения)
	|		И энргОперацияСПриборомУчетаТочкиУчета.Ссылка В(&мИзменения)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргОперацияСПриборомУчета.Ссылка,
	|		энргОперацияСПриборомУчета.Организация,
	|		энргОперацияСПриборомУчетаТочкиУчета.ПриборУчетаВывод,
	|		ЗНАЧЕНИЕ(Справочник.энргПричиныАрхивацииПУ.ПустаяСсылка)
	|	ИЗ
	|		Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК энргОперацияСПриборомУчетаТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК энргОперацияСПриборомУчета
	|			ПО энргОперацияСПриборомУчетаТочкиУчета.Ссылка = энргОперацияСПриборомУчета.Ссылка
	|				И (энргОперацияСПриборомУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ))
	|	ГДЕ
	|		энргОперацияСПриборомУчета.Ссылка В(&мИзменения)
	|		И энргОперацияСПриборомУчетаТочкиУчета.Ссылка В(&мИзменения)) КАК ВложенныйЗапрос";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПриборыУчетаДляПередачи()
	
	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.СоставнаяУслуга
	|				И НЕ энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.НаименованиеМодели КАК НаименованиеМодели,
	|	ВложенныйЗапрос.НаименованиеМарки КАК НаименованиеМарки,
	|	ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки,
	|	ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.Дата КАК Дата,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		табПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ВложенныйЗапрос.НаименованиеМодели КАК НаименованиеМодели,
	|		ВложенныйЗапрос.НаименованиеМарки КАК НаименованиеМарки,
	|		ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|		ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|		ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|		ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки,
	|		ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Ссылка КАК Ссылка,
	|			ВложенныйЗапрос.Дата КАК Дата,
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			табШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|			табШкалы.IDСтроки КАК IDСтрокиШкалы,
	|			ТипыПриборовУчета.Наименование КАК НаименованиеМодели,
	|			ТипыПриборовУчета.Ссылка КАК ТипПрибораУчета,
	|			ПРЕДСТАВЛЕНИЕ(ТипыПриборовУчета.МаркаПУ) КАК НаименованиеМарки,
	|			ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|			ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|			ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ДатаСледующейПоверкиСчетчика, МЕСЯЦ, -ТипыПриборовУчета.бестМежповерочныйИнтервал) КАК ДатаПоверки,
	|			ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Шапка.Ссылка КАК Ссылка,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ КАК Дата,
	|				Шапка.Абонент КАК Абонент,
	|				Шапка.КлючПомещения КАК КлючПомещения,
	|				табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|				табТочкиУчета.Услуга КАК Услуга,
	|				табТочкиУчета.IDСтроки КАК IDСтроки,
	|				табТочкиУчета.ДатаПоверкиСчетчика КАК ДатаСледующейПоверкиСчетчика,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ КАК ДатаУстановки,
	|				ПриборыУчетаАбонента.Код КАК ЗаводскойНомер,
	|				ПриборыУчетаАбонента.ТипПрибораУчета КАК МодельПрибораУчета,
	|				ПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем
	|			ИЗ
	|				Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК Шапка
	|					ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|						И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК ПриборыУчетаАбонента
	|					ПО табТочкиУчета.ПриборУчета = ПриборыУчетаАбонента.Ссылка
	|			ГДЕ
	|				Шапка.Ссылка В(&мИзменения)
	|				И табТочкиУчета.Ссылка В(&мИзменения)
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Шапка.Ссылка,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ,
	|				Шапка.Абонент,
	|				Шапка.КлючПомещения,
	|				табТочкиУчета.ПриборУчета,
	|				табТочкиУчета.Услуга,
	|				табТочкиУчета.IDСтроки,
	|				табТочкиУчета.ДатаПоверкиСчетчика,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ,
	|				ПриборыУчетаАбонента.Код,
	|				ПриборыУчетаАбонента.ТипПрибораУчета,
	|				ПриборыУчетаАбонента.РегистрируетОбъем
	|			ИЗ
	|				Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК табТочкиУчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК Шапка
	|					ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|						И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ))
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК ПриборыУчетаАбонента
	|					ПО табТочкиУчета.ПриборУчета = ПриборыУчетаАбонента.Ссылка
	|			ГДЕ
	|				Шапка.Ссылка В(&мИзменения)
	|				И табТочкиУчета.Ссылка В(&мИзменения)) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ШкалыПриборовУчета КАК табШкалы
	|				ПО ВложенныйЗапрос.Ссылка = табШкалы.Ссылка
	|					И ВложенныйЗапрос.IDСтроки = табШкалы.IDСтрокиТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК ТипыПриборовУчета
	|				ПО ВложенныйЗапрос.МодельПрибораУчета = ТипыПриборовУчета.Ссылка) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|			ПО ВложенныйЗапрос.Ссылка = табПоказанияПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиШкалы = табПоказанияПриборовУчета.IDСтроки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|			И (энргВидыУслугСоставляющиеУслуг.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли