#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Процедура МассивПриборов() Экспорт 
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ тогда 		
		Текст  			= 
		"ВЫБРАТЬ
		|	ТаблицаТочек.ПриборУчета КАК ПриборУчета,
		|	ЛОЖЬ КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочек
		|ГДЕ
		|	ТаблицаТочек.Ссылка = &Ссылка
		|	И НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ тогда 		
		Текст  			= 
		"ВЫБРАТЬ
		|	ТаблицаТочек.ПриборУчетаВывод КАК ПриборУчета,
		|	ЛОЖЬ КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель,
		|	ВЫБОР
		|		КОГДА ШапкаДокумента.ДатаФактическогоСобытия <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
		|	КОНЕЦ КАК СостояниеПроведения
		|ИЗ
		|	Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК ШапкаДокумента
		|		ПО ТаблицаТочек.Ссылка = ШапкаДокумента.Ссылка
		|			И (ТаблицаТочек.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаТочек.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";	
	иначе
		Текст  			= 
		"ВЫБРАТЬ
		|	ТаблицаТочек.ПриборУчетаВывод КАК ПриборУчета,
		|	ИСТИНА КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель,
		|	ВЫБОР
		|		КОГДА ШапкаДокумента.ДатаФактическогоСобытия <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
		|	КОНЕЦ КАК СостояниеПроведения
		|ИЗ
		|	Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочек
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК ШапкаДокумента
		|		ПО ТаблицаТочек.Ссылка = ШапкаДокумента.Ссылка
		|			И (ТаблицаТочек.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаТочек.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТочек.ПриборУчета,
		|	ЛОЖЬ,
		|	""ПоказанияПриборовУчета"",
		|	0,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
		|ИЗ
		|	Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочек
		|ГДЕ
		|	ТаблицаТочек.Ссылка = &Ссылка
		|	И НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	КонецЕсли;
	
	Запрос.Текст 	= Текст;
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());	
	
КонецПроцедуры

// Получает абонентов плательщиков.
// 
// Возвращаемое значение:
//   Массив и Структура.
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДатаФактическогоСобытия) Тогда
		Возврат МассивПлательщиков;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",		Ссылка);
	Запрос.УстановитьПараметр("ДатаФакта",	ДатаФактическогоСобытия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПриборов.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаПриборов
	|ГДЕ
	|	ТаблицаПриборов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.Плательщик КАК Плательщик,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТУ КАК ВТ_ТУ
	|		ПО энргСтабильныеПериоды.ТочкаУчета = ВТ_ТУ.ТочкаУчета
	|			И (энргСтабильныеПериоды.Плательщик <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка))
	|			И (энргСтабильныеПериоды.ПериодНачисления >= &ДатаФакта)
	|			И (энргСтабильныеПериоды.Абонент <> энргСтабильныеПериоды.Плательщик)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргСтабильныеПериоды.Плательщик = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Плательщик,
	|	энргАбоненты.КлючПомещения";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		МассивПлательщиков.Добавить(Новый Структура("Абонент,КлючПомещения", Результат.Плательщик, Результат.КлючПомещения));
	КонецЦикла;
	
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	Если Не КлючевыеРеквизитыЗаполены() Тогда
		Отказ = Истина;
	КонецЕсли; 	
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ Тогда 		
		//ПроверяемыеРеквизиты.Добавить("ТочкиУчета.ДатаПриемки");
		//ПроверяемыеРеквизиты.добавить("ТочкиУчета.ДатаПоверкиСчетчика");
	ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ Тогда
		ПроверяемыеРеквизиты.Добавить("ТочкиУчета.ДатаПриемки");
		ПроверяемыеРеквизиты.добавить("ТочкиУчета.ДатаПоверкиСчетчика");
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПроверяемыеРеквизиты") И ДополнительныеСвойства.ПроверяемыеРеквизиты.Количество() > 0 Тогда 		
		// Признак выполнения повторной проверки перед записью поэтому очищает стандартные реквизиты
		ПроверяемыеРеквизиты.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеРеквизиты,ДополнительныеСвойства.ПроверяемыеРеквизиты); 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Документы.энргОперацияСПриборомУчета.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	Документы.энргОперацияСПриборомУчета.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);		
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Ключевые реквизиты заполены
// Выполняется перед записью объекта
// Данный фрагмент нельзя вынести в обработку проверки заполнения так как ссылки на прибор учета определяются перед
// записью формы
//
Функция КлючевыеРеквизитыЗаполены()
	
	ПроверяемыеРеквизиты 		= Новый Массив;
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ Тогда 		
		//ПроверяемыеРеквизиты.Добавить("ТочкиУчета.ПриборУчета");
		//ПроверяемыеРеквизиты.Добавить("ПоказанияПриборовУчета.ТекущиеПоказания");
	ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ Тогда
		//ПроверяемыеРеквизиты.Добавить("ТочкиУчета.ПриборУчета");
		ПроверяемыеРеквизиты.Добавить("ТочкиУчета.ПриборУчетаВывод");		
	ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ Тогда
		ПроверяемыеРеквизиты.Добавить("ТочкиУчета.ПриборУчетаВывод");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПроверяемыеРеквизиты" , ПроверяемыеРеквизиты);
	
	Возврат ПроверитьЗаполнение()
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли