#Область СобытияФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда			
		Для Каждого СтрокаТочкиПоставки Из ТекущийОбъект.ТочкиПоставки Цикл
			Если Не ЗначениеЗаполнено(СтрокаТочкиПоставки.ТочкаПоставки) Тогда
				СтрокаТочкиПоставки.ТочкаПоставки = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Отказ И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для каждого стр из ТекущийОбъект.ТочкиПоставки Цикл
			Если не ЗначениеЗаполнено(стр.ТочкаПоставки.Код) Тогда
				НоваяТочкаПоставки 					= Справочники.энргТочкиУчета.СоздатьЭлемент();
				НоваяТочкаПоставки.Наименование 		= стр.НаименованиеТочкиПоставки;
				НоваяТочкаПоставки.ЭтоТочкаПоставки 	= Истина;
				НоваяТочкаПоставки.ЭтоТочкаПриема 		= Объект.ТочкиПриема;
				НоваяТочкаПоставки.УстановитьСсылкуНового(стр.ТочкаПоставки);
				НоваяТочкаПоставки.Записать();
			ИначеЕсли стр.НаименованиеТочкиПоставки <> стр.ТочкаПоставки.Наименование ИЛИ Объект.ТочкиПриема <> стр.ТочкаПоставки.ЭтоТочкаПриема Тогда
				ИзмененнаяТП = стр.ТочкаПоставки.ПолучитьОбъект();
				ИзмененнаяТП.Наименование	= стр.НаименованиеТочкиПоставки;
				ИзмененнаяТП.ЭтоТочкаПриема = Объект.ТочкиПриема;
				ИзмененнаяТП.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьРеквизитов();
КонецПроцедуры

#Конецобласти

#Область СобытияШапки

&НаКлиенте
Процедура ТочкиПриемаПриИзменении(Элемент)
	НастроитьВидимостьРеквизитов();
КонецПроцедуры

#Конецобласти

#Область События_ТЧ_ТочкиПоставки

&НаКлиенте
Процедура ТочкиПоставкиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.КатегорииНадежности,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("КатегорииНадежности");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

#Конецобласти

#Область События_ТЧ_КатегорииНадежности

&НаКлиенте
Процедура КатегорииНадежностиПриИзменении(Элемент)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 							= Элементы.КатегорииНадежности.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

#Конецобласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьВидимостьРеквизитов()
	Элементы.ГруппаПараметрыТочкиПриема.Видимость = Объект.ТочкиПриема;
КонецПроцедуры

#Конецобласти
