
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ВходныеДанные,Параметры.КлючДанных);
	Элементы.ГруппаЭЭ.Видимость = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ");
КонецПроцедуры

#Конецобласти 

#Область КомандыФормы

&НаКлиенте
Процедура Завершить(Команда)
	КлючДанных = бестПользовательскийВводКлиент.ПолучитьКлючЗаполненияИнформацииОбъекта();
	Закрыть(ПолучитьРезультат(КлючДанных));
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат(КлючДанных)
	Результат			= Новый Структура(КлючДанных);
	ЗаполнитьЗначенияСвойств(Результат,ЭтаФорма);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
