#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает ПД и возвращает количество не проведенных ПД и созданные документы.
//
// Параметры:
//  СтруктураОтборов	-	Структура.
// 
// Возвращаемое значение:
//   Структура.
//
Функция СоздатьПД(СтруктураОтборов) Экспорт
	
	ТекДоговор	 									= Неопределено;
	ТекТипЗадолженности	 							= Неопределено;
	ДокументОбъект 									= Неопределено;
	ДокументСсылка									= Неопределено;
	мСозданныеДокументы 							= Новый Массив;
	
	ПериодНачисления 								= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(СтруктураОтборов.ДатаФакта, СтруктураОтборов.Организация,СтруктураОтборов.Район);
	ГраницыПериода  								= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(СтруктураОтборов.Организация,СтруктураОтборов.Район,ПериодНачисления,Ложь);
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП - 1;	
	ПредыдущийПериодНачисления                      = ДобавитьМесяц(ПериодНачисления, -1);
	ДатаФакта										= ?(СтруктураОтборов.Свойство("ДатаФакта"),СтруктураОтборов.ДатаФакта,ТекущаяДата());
	ЭтоКонецПериода 								= КонецДня(ДатаФакта) = КонецМесяца(КонецПериодаРасчета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаФормированиеПД();
	
	Если СтруктураОтборов.Свойство("Договор") И ЗначениеЗаполнено(СтруктураОтборов.Договор) Тогда
		Запрос.УстановитьПараметр("Договор", СтруктураОтборов.Договор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Договор = &Договор", "Истина");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("Контрагент") И ЗначениеЗаполнено(СтруктураОтборов.Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", СтруктураОтборов.Контрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Контрагент = &Контрагент", "Истина");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("ТипЗадолженности") И ЗначениеЗаполнено(СтруктураОтборов.ТипЗадолженности) Тогда
		Запрос.УстановитьПараметр("ТипЗадолженности", СтруктураОтборов.ТипЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТипОплаты = &ТипЗадолженности", "Истина");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 					СтруктураОтборов.Организация);
	Запрос.УстановитьПараметр("Район", 							СтруктураОтборов.Район);
	Запрос.УстановитьПараметр("ДатаФакта", 						ДатаФакта);
	Запрос.УстановитьПараметр("ПериодНачисления", 				ПериодНачисления);
	Запрос.УстановитьПараметр("ПредыдущийПериодНачисления", 	ПредыдущийПериодНачисления);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета", 			НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("ЭтоКонецПериода", 				ЭтоКонецПериода);
	Запрос.УстановитьПараметр("ЦеновыеКатегорииРазделителяМощности"	, ЦеновыеКатегорииРазделителяМощности());
	Запрос.УстановитьПараметр("СпособыНачисленийРазделителяМощности", СпособыНачисленийРазделителяМощности());
		
	Авансовый = Перечисления.бестВидыРасчета.Авансовый;
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоНепроведенныхПД = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
		Если ТекДоговор <> ВыборкаДетальныеЗаписи.Договор ИЛИ ТекТипЗадолженности <> ВыборкаДетальныеЗаписи.ТипЗадолженности Тогда
			
			Если Не ДокументОбъект = Неопределено Тогда
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					мСозданныеДокументы.Добавить(ДокументОбъект.Ссылка);
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось провести платежный документ!'"),
											 УровеньЖурналаРегистрации.Ошибка,
											 ,
											 ,
											 ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					КоличествоНепроведенныхПД = КоличествоНепроведенныхПД + 1;
				КонецПопытки;
			КонецЕсли; 					
			
			ДокументСсылка 							= ВыборкаДетальныеЗаписи.ПД;			
			
			Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда			
				ДокументСсылка 						= Документы.бестПлатежныйДокумент.ПолучитьСсылку(Новый УникальныйИдентификатор());
				ДокументОбъект 						= Документы.бестПлатежныйДокумент.СоздатьДокумент();
				ДокументОбъект.Организация			= ВыборкаДетальныеЗаписи.Организация;
				ДокументОбъект.Район 				= ВыборкаДетальныеЗаписи.Район;
				ДокументОбъект.Договор	 			= ВыборкаДетальныеЗаписи.Договор;
				ДокументОбъект.ТипЗадолженности	 	= ВыборкаДетальныеЗаписи.ТипЗадолженности;
				ДокументОбъект.ВидОперации	 		= Перечисления.бестВидыОпераций.ПлатежныйДокумент_Расчетный;
				ДокументОбъект.ПериодНачисления	 	= ?(ВыборкаДетальныеЗаписи.ТипЗадолженности = Авансовый, ПериодНачисления, ПредыдущийПериодНачисления);
				ДокументОбъект.Дата 				= ?(ВыборкаДетальныеЗаписи.ТипЗадолженности = Авансовый, ПериодНачисления + (ВыборкаДетальныеЗаписи.ДеньФормирования - 1) * 86400, КонецМесяца(ПредыдущийПериодНачисления));
				
				ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);	
				
			Иначе
				ДокументОбъект 						= ДокументСсылка.ПолучитьОбъект();
				ДокументОбъект.ОсновнаяРеализация.Очистить();
				ДокументОбъект.ПометкаУдаления 		= Ложь;
				ДокументОбъект.Процент	 			= ВыборкаДетальныеЗаписи.Процент;
			КонецЕсли;
			
			Если Не ТранзакцияАктивна() Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
		КонецЕсли;
		
		НовСтр 				= ДокументОбъект.ОсновнаяРеализация.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		ТекДоговор 			= ВыборкаДетальныеЗаписи.Договор;
		ТекТипЗадолженности = ВыборкаДетальныеЗаписи.ТипЗадолженности;
	КонецЦикла;
	
	Если Не ДокументОбъект = Неопределено Тогда
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			мСозданныеДокументы.Добавить(ДокументОбъект.Ссылка);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось провести платежный документ!'"),
									 УровеньЖурналаРегистрации.Ошибка,
									 ,
									 ,
									 ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КоличествоНепроведенныхПД = КоличествоНепроведенныхПД + 1;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Новый Структура("КоличествоНеПроведенныхПД, СозданныеДокументы", КоличествоНеПроведенныхПД, мСозданныеДокументы);
	
КонецФункции

// Создает СФ на аванс.
//
// Параметры:
//  СтруктураОтборов	-	Структура.
// 
// Возвращаемое значение:
//   Массив из ДокументСсылка.бестАвансыЭЭ.
//
Функция СоздатьСФНаАванс(СтруктураОтборов) Экспорт
	
	мСозданныеДокументы								= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаФормированиеСФНаАванс();
	
	Если НЕ СтруктураОтборов.Свойство("ВводНачальныхОстатков") Тогда
		ПериодНачисления 								= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(СтруктураОтборов.ДатаФакта, СтруктураОтборов.Организация,СтруктураОтборов.Район);
		
		Запрос.УстановитьПараметр("Дата", 				СтруктураОтборов.ДатаФакта);
		Запрос.УстановитьПараметр("Организация", 		СтруктураОтборов.Организация);
		Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
		Запрос.УстановитьПараметр("Район", 				СтруктураОтборов.Район);
		
		
		Если СтруктураОтборов.Свойство("Договор") И ЗначениеЗаполнено(СтруктураОтборов.Договор) Тогда
			Запрос.УстановитьПараметр("Договор", СтруктураОтборов.Договор);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАвансыЭЭ.Договор = &Договор", "Истина");
		КонецЕсли;
		
		Если СтруктураОтборов.Свойство("Контрагент") И ЗначениеЗаполнено(СтруктураОтборов.Контрагент) Тогда
			Запрос.УстановитьПараметр("Контрагент", СтруктураОтборов.Контрагент);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Контрагент = &Контрагент", "Истина");
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАвансыЭЭ.Регистратор = &ВводНачальныхОстатков", "Истина");
		
	Иначе
		
		Запрос.УстановитьПараметр("ВводНачальныхОстатков", СтруктураОтборов.ВводНачальныхОстатков);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАвансыЭЭ.Организация = &Организация", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАвансыЭЭ.Район = &Район", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАвансыЭЭ.Договор = &Договор", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Контрагент = &Контрагент", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАвансыЭЭ.ПериодНачисления = &ПериодНачисления", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестАвансыЭЭ.Период <= &Дата", "Истина");
		
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	НачатьТранзакцию();
	Попытка
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументСФ) Тогда
				ДокументОбъект 						= ВыборкаДетальныеЗаписи.ДокументСФ.ПолучитьОбъект();
				ДокументОбъект.СуммаПереплаты 		= ВыборкаДетальныеЗаписи.СуммаПереплаты;
				ДокументОбъект.СуммаПереплатыНДС 	= ВыборкаДетальныеЗаписи.СуммаПереплатыНДС;
			Иначе
				ДокументОбъект 						= Документы.бестСчетФактураНаАванс.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокументОбъект, ВыборкаДетальныеЗаписи);
			КонецЕсли;
			
			
			ДокументОбъект.записать();
			мСозданныеДокументы.Добавить(ДокументОбъект.Ссылка);	
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		Возврат Новый Массив;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Если НЕ СтруктураОтборов.Свойство("ВводНачальныхОстатков") Тогда
		СоздатьКорректировочныеСФНаАванс(мСозданныеДокументы, СтруктураОтборов);
	КонецЕсли;
	
	Возврат мСозданныеДокументы;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СозданиеПД

Функция ПолучитьТекстЗапросаФормированиеПД()
	Возврат "ВЫБРАТЬ
	        |	бестСтавкиНДССрезПоследних.СтавкаНДС КАК СтавкаНДС,
	        |	бестСтавкиНДССрезПоследних.Организация КАК Организация
	        |ПОМЕСТИТЬ СтавкиНДС
	        |ИЗ
	        |	РегистрСведений.бестСтавкиНДС.СрезПоследних(&ДатаФакта, Организация = &Организация) КАК бестСтавкиНДССрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация КАК Организация,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район КАК Район,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор КАК Договор,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ТипОплаты КАК ТипОплаты,
	        |	МАКСИМУМ(бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ДеньФормирования) КАК ДеньФормирования
	        |ПОМЕСТИТЬ НастройкаФормированияПДМаксимумДата
	        |ИЗ
	        |	РегистрСведений.бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам.СрезПоследних(
	        |			&ДатаФакта,
	        |			Организация = &Организация
	        |				И Район = &Район
	        |				И Договор = &Договор
	        |				И ТипОплаты = &ТипЗадолженности) КАК бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ПО бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор = энргДоговорыКонтрагентов.Ссылка
	        |ГДЕ
	        |	энргДоговорыКонтрагентов.Контрагент = &Контрагент
	        |	И ВЫБОР
	        |			КОГДА &ЭтоКонецПериода
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ДеньФормирования <= ДЕНЬ(&ДатаФакта)
	        |		КОНЕЦ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ТипОплаты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация КАК Организация,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район КАК Район,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор КАК Договор,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ТипОплаты КАК ТипОплаты,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Процент КАК Процент,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ДеньФормирования КАК ДеньФормирования,
	        |	бестКоличествоПериодовДляРасчетаАванса.КоличествоПериодов КАК КоличествоПериодовБазаОбъемов,
	        |	бестКоличествоПериодовДляРасчетаАванса1.КоличествоПериодов КАК КоличествоПериодовБазаСуммы
	        |ПОМЕСТИТЬ НастройкаФормированияПД
	        |ИЗ
	        |	НастройкаФормированияПДМаксимумДата КАК НастройкаФормированияПДМаксимумДата
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам.СрезПоследних(
	        |				&ДатаФакта,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И Договор = &Договор
	        |					И ТипОплаты = &ТипЗадолженности) КАК бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестКоличествоПериодовДляРасчетаАванса КАК бестКоличествоПериодовДляРасчетаАванса
	        |			ПО бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.БазаРасчетаОбъема = бестКоличествоПериодовДляРасчетаАванса.Ссылка
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестКоличествоПериодовДляРасчетаАванса КАК бестКоличествоПериодовДляРасчетаАванса1
	        |			ПО бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.БазаРасчетаСуммы = бестКоличествоПериодовДляРасчетаАванса1.Ссылка
	        |		ПО НастройкаФормированияПДМаксимумДата.Организация = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация
	        |			И НастройкаФормированияПДМаксимумДата.Район = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район
	        |			И НастройкаФормированияПДМаксимумДата.Договор = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор
	        |			И НастройкаФормированияПДМаксимумДата.ТипОплаты = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ТипОплаты
	        |			И НастройкаФормированияПДМаксимумДата.ДеньФормирования = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ДеньФормирования
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ЭтоКонецПериода
	        |				ТОГДА ИСТИНА
	        |			ИНАЧЕ бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ДеньФормирования <= ДЕНЬ(&ДатаФакта)
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор,
	        |	НастройкаФормированияПД.ТипОплаты КАК ТипОплаты,
	        |	НастройкаФормированияПД.ДеньФормирования КАК ДеньФормирования,
	        |	НастройкаФормированияПД.Организация КАК Организация,
	        |	НастройкаФормированияПД.Район КАК Район,
	        |	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	НастройкаФормированияПД.КоличествоПериодовБазаОбъемов КАК КоличествоПериодовБазаОбъемов,
	        |	НастройкаФормированияПД.КоличествоПериодовБазаСуммы КАК КоличествоПериодовБазаСуммы,
	        |	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	        |	НастройкаФормированияПД.Процент КАК Процент
	        |ПОМЕСТИТЬ НастройкиДляРасчетаАванса
	        |ИЗ
	        |	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	        |			&ДатаФакта,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	        |				&ДатаФакта,
	        |				Организация = &Организация
	        |					И Район = &Район) КАК бестАктивностьТочекУчетаНПСрезПоследних
	        |		ПО бестДоговорыТочекУчетаСрезПоследних.Организация = бестАктивностьТочекУчетаНПСрезПоследних.Организация
	        |			И бестДоговорыТочекУчетаСрезПоследних.Район = бестАктивностьТочекУчетаНПСрезПоследних.Район
	        |			И бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета
	        |			И бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета = бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаФормированияПД КАК НастройкаФормированияПД
	        |		ПО бестДоговорыТочекУчетаСрезПоследних.Организация = НастройкаФормированияПД.Организация
	        |			И бестДоговорыТочекУчетаСрезПоследних.Район = НастройкаФормированияПД.Район
	        |			И бестДоговорыТочекУчетаСрезПоследних.Договор = НастройкаФормированияПД.Договор
	        |			И (НастройкаФормированияПД.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Авансовый))
	        |ГДЕ
	        |	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	НастройкиДляРасчетаАванса.ТипОплаты КАК ТипОплаты,
	        |	НастройкиДляРасчетаАванса.ТочкаУчета КАК ТочкаУчета,
	        |	НастройкиДляРасчетаАванса.Договор КАК Договор,
	        |	НастройкиДляРасчетаАванса.Организация КАК Организация,
	        |	НастройкиДляРасчетаАванса.Район КАК Район,
	        |	НастройкиДляРасчетаАванса.Услуга КАК Услуга,
	        |	НастройкиДляРасчетаАванса.ОбъектРасчета КАК ОбъектРасчета,
	        |	НастройкиДляРасчетаАванса.ДеньФормирования КАК ДеньФормирования,
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги * НастройкиДляРасчетаАванса.Процент / 100 КАК ОбъемУслуги,
	        |	бестОбъемНачисленийЭлектроэнергии.Организация ЕСТЬ NULL КАК ЕстьНачисление,
	        |	НастройкиДляРасчетаАванса.Процент КАК Процент,
	        |	бестОбъемНачисленийЭлектроэнергии.СпособНачисления КАК СпособНачисления,
	        |	бестОбъемНачисленийЭлектроэнергии.НДСВнутри КАК НДСВнутри,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ АвансБазаТолькоОбъемыНачисления
	        |ИЗ
	        |	НастройкиДляРасчетаАванса КАК НастройкиДляРасчетаАванса
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	        |		ПО НастройкиДляРасчетаАванса.ТочкаУчета = бестОбъемНачисленийЭлектроэнергии.ТочкаУчета
	        |			И НастройкиДляРасчетаАванса.Договор = бестОбъемНачисленийЭлектроэнергии.Договор
	        |			И НастройкиДляРасчетаАванса.Организация = бестОбъемНачисленийЭлектроэнергии.Организация
	        |			И НастройкиДляРасчетаАванса.Район = бестОбъемНачисленийЭлектроэнергии.Район
	        |			И НастройкиДляРасчетаАванса.ОбъектРасчета = бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета
	        |			И (бестОбъемНачисленийЭлектроэнергии.ПериодРасчета = ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -НастройкиДляРасчетаАванса.КоличествоПериодовБазаОбъемов))
	        |			И НастройкиДляРасчетаАванса.Услуга = бестОбъемНачисленийЭлектроэнергии.Услуга
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	НастройкиДляРасчетаАванса.ТипОплаты,
	        |	НастройкиДляРасчетаАванса.ТочкаУчета,
	        |	НастройкиДляРасчетаАванса.Договор,
	        |	НастройкиДляРасчетаАванса.Организация,
	        |	НастройкиДляРасчетаАванса.Район,
	        |	НастройкиДляРасчетаАванса.Услуга,
	        |	НастройкиДляРасчетаАванса.ОбъектРасчета,
	        |	НастройкиДляРасчетаАванса.ДеньФормирования,
	        |	бестОбъемНачисленийНП.ОбъемУслуги * НастройкиДляРасчетаАванса.Процент / 100,
	        |	бестОбъемНачисленийНП.Организация ЕСТЬ NULL,
	        |	НастройкиДляРасчетаАванса.Процент,
	        |	бестОбъемНачисленийНП.СпособНачисления,
	        |	бестОбъемНачисленийНП.НДСВнутри,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона
	        |ИЗ
	        |	НастройкиДляРасчетаАванса КАК НастройкиДляРасчетаАванса
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ПО НастройкиДляРасчетаАванса.ТочкаУчета = бестОбъемНачисленийНП.ТочкаУчета
	        |			И НастройкиДляРасчетаАванса.Договор = бестОбъемНачисленийНП.Договор
	        |			И НастройкиДляРасчетаАванса.Организация = бестОбъемНачисленийНП.Организация
	        |			И НастройкиДляРасчетаАванса.Район = бестОбъемНачисленийНП.Район
	        |			И НастройкиДляРасчетаАванса.ОбъектРасчета = бестОбъемНачисленийНП.ОбъектРасчета
	        |			И (бестОбъемНачисленийНП.ПериодРасчета = ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -НастройкиДляРасчетаАванса.КоличествоПериодовБазаОбъемов))
	        |			И НастройкиДляРасчетаАванса.Услуга = бестОбъемНачисленийНП.Услуга
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	АвансБазаТолькоОбъемыНачисления.ТипОплаты КАК ТипОплаты,
	        |	АвансБазаТолькоОбъемыНачисления.ТочкаУчета КАК ТочкаУчета,
	        |	АвансБазаТолькоОбъемыНачисления.Договор КАК Договор,
	        |	АвансБазаТолькоОбъемыНачисления.Организация КАК Организация,
	        |	АвансБазаТолькоОбъемыНачисления.Район КАК Район,
	        |	АвансБазаТолькоОбъемыНачисления.Услуга КАК Услуга,
	        |	АвансБазаТолькоОбъемыНачисления.ОбъектРасчета КАК ОбъектРасчета,
	        |	АвансБазаТолькоОбъемыНачисления.ДеньФормирования КАК ДеньФормирования,
	        |	СУММА(АвансБазаТолькоОбъемыНачисления.ОбъемУслуги) КАК ОбъемУслуги,
	        |	АвансБазаТолькоОбъемыНачисления.ЕстьНачисление КАК ЕстьНачисление,
	        |	АвансБазаТолькоОбъемыНачисления.Процент КАК Процент,
	        |	АвансБазаТолькоОбъемыНачисления.СпособНачисления КАК СпособНачисления,
	        |	АвансБазаТолькоОбъемыНачисления.НДСВнутри КАК НДСВнутри,
	        |	АвансБазаТолькоОбъемыНачисления.ТарифнаяЗона КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ АвансБазаОбъемыГруппировка
	        |ИЗ
	        |	АвансБазаТолькоОбъемыНачисления КАК АвансБазаТолькоОбъемыНачисления
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	АвансБазаТолькоОбъемыНачисления.ТарифнаяЗона,
	        |	АвансБазаТолькоОбъемыНачисления.СпособНачисления,
	        |	АвансБазаТолькоОбъемыНачисления.НДСВнутри,
	        |	АвансБазаТолькоОбъемыНачисления.ЕстьНачисление,
	        |	АвансБазаТолькоОбъемыНачисления.ОбъектРасчета,
	        |	АвансБазаТолькоОбъемыНачисления.ТочкаУчета,
	        |	АвансБазаТолькоОбъемыНачисления.Договор,
	        |	АвансБазаТолькоОбъемыНачисления.Район,
	        |	АвансБазаТолькоОбъемыНачисления.Организация,
	        |	АвансБазаТолькоОбъемыНачисления.Услуга,
	        |	АвансБазаТолькоОбъемыНачисления.ТипОплаты,
	        |	АвансБазаТолькоОбъемыНачисления.ДеньФормирования,
	        |	АвансБазаТолькоОбъемыНачисления.Процент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	АвансБазаОбъемыГруппировка.ТипОплаты КАК ТипОплаты,
	        |	АвансБазаОбъемыГруппировка.ТочкаУчета КАК ТочкаУчета,
	        |	АвансБазаОбъемыГруппировка.Договор КАК Договор,
	        |	АвансБазаОбъемыГруппировка.Организация КАК Организация,
	        |	АвансБазаОбъемыГруппировка.Район КАК Район,
	        |	ЕСТЬNULL(АвансБазаОбъемыГруппировка.Услуга, бестГарантированныеОбъемыСрезПоследних.Услуга) КАК Услуга,
	        |	АвансБазаОбъемыГруппировка.ОбъектРасчета КАК ОбъектРасчета,
	        |	АвансБазаОбъемыГруппировка.ДеньФормирования КАК ДеньФормирования,
	        |	ЕСТЬNULL(АвансБазаОбъемыГруппировка.ОбъемУслуги, бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги * АвансБазаОбъемыГруппировка.Процент / 100) КАК ОбъемУслуги
	        |ПОМЕСТИТЬ АвансБазаОбъемы
	        |ИЗ
	        |	АвансБазаОбъемыГруппировка КАК АвансБазаОбъемыГруппировка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	        |				&ДатаФакта,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И Месяц = МЕСЯЦ(&ПериодНачисления)
	        |					И Год = ГОД(&ДатаФакта)) КАК бестГарантированныеОбъемыСрезПоследних
	        |		ПО АвансБазаОбъемыГруппировка.Организация = бестГарантированныеОбъемыСрезПоследних.Организация
	        |			И АвансБазаОбъемыГруппировка.Район = бестГарантированныеОбъемыСрезПоследних.Район
	        |			И АвансБазаОбъемыГруппировка.ОбъектРасчета = бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета
	        |			И (бестГарантированныеОбъемыСрезПоследних.Год = ГОД(&ДатаФакта))
	        |			И (НЕ АвансБазаОбъемыГруппировка.ЕстьНачисление)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	НастройкиДляРасчетаАванса.ТипОплаты КАК ТипОплаты,
	        |	НастройкиДляРасчетаАванса.ТочкаУчета КАК ТочкаУчета,
	        |	НастройкиДляРасчетаАванса.Договор КАК Договор,
	        |	НастройкиДляРасчетаАванса.Организация КАК Организация,
	        |	НастройкиДляРасчетаАванса.Район КАК Район,
	        |	НастройкиДляРасчетаАванса.ОбъектРасчета КАК ОбъектРасчета,
	        |	НастройкиДляРасчетаАванса.Услуга КАК Услуга,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги) КАК ОбъемУслуги,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.Тариф) КАК ТарифНаСредневзвешанную,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА бестОбъемНачисленийЭлектроэнергии.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
	        |				ТОГДА бестОбъемНачисленийЭлектроэнергии.ТарифЗаУслугиПоПередачи
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ТарифЗаУслугиПоПередачи,
	        |	бестОбъемНачисленийЭлектроэнергии.СпособНачисления КАК СпособНачисления,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ АвансБазаЦены
	        |ИЗ
	        |	НастройкиДляРасчетаАванса КАК НастройкиДляРасчетаАванса
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	        |		ПО НастройкиДляРасчетаАванса.ТочкаУчета = бестОбъемНачисленийЭлектроэнергии.ТочкаУчета
	        |			И НастройкиДляРасчетаАванса.Договор = бестОбъемНачисленийЭлектроэнергии.Договор
	        |			И НастройкиДляРасчетаАванса.Организация = бестОбъемНачисленийЭлектроэнергии.Организация
	        |			И НастройкиДляРасчетаАванса.Район = бестОбъемНачисленийЭлектроэнергии.Район
	        |			И НастройкиДляРасчетаАванса.ОбъектРасчета = бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета
	        |			И (бестОбъемНачисленийЭлектроэнергии.ПериодРасчета = ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -НастройкиДляРасчетаАванса.КоличествоПериодовБазаСуммы))
	        |			И НастройкиДляРасчетаАванса.Услуга = бестОбъемНачисленийЭлектроэнергии.Услуга
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НастройкиДляРасчетаАванса.ТипОплаты,
	        |	НастройкиДляРасчетаАванса.ТочкаУчета,
	        |	НастройкиДляРасчетаАванса.Договор,
	        |	НастройкиДляРасчетаАванса.Организация,
	        |	НастройкиДляРасчетаАванса.Район,
	        |	НастройкиДляРасчетаАванса.ОбъектРасчета,
	        |	НастройкиДляРасчетаАванса.Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.СпособНачисления,
	        |	бестОбъемНачисленийЭлектроэнергии.ТарифнаяЗона
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	НастройкиДляРасчетаАванса.ТипОплаты,
	        |	НастройкиДляРасчетаАванса.ТочкаУчета,
	        |	НастройкиДляРасчетаАванса.Договор,
	        |	НастройкиДляРасчетаАванса.Организация,
	        |	НастройкиДляРасчетаАванса.Район,
	        |	НастройкиДляРасчетаАванса.ОбъектРасчета,
	        |	НастройкиДляРасчетаАванса.Услуга,
	        |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги),
	        |	0,
	        |	0,
	        |	бестОбъемНачисленийНП.СпособНачисления,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона
	        |ИЗ
	        |	НастройкиДляРасчетаАванса КАК НастройкиДляРасчетаАванса
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ПО НастройкиДляРасчетаАванса.ТочкаУчета = бестОбъемНачисленийНП.ТочкаУчета
	        |			И НастройкиДляРасчетаАванса.Договор = бестОбъемНачисленийНП.Договор
	        |			И НастройкиДляРасчетаАванса.Организация = бестОбъемНачисленийНП.Организация
	        |			И НастройкиДляРасчетаАванса.Район = бестОбъемНачисленийНП.Район
	        |			И НастройкиДляРасчетаАванса.ОбъектРасчета = бестОбъемНачисленийНП.ОбъектРасчета
	        |			И (бестОбъемНачисленийНП.ПериодРасчета = ДОБАВИТЬКДАТЕ(&ПериодНачисления, МЕСЯЦ, -НастройкиДляРасчетаАванса.КоличествоПериодовБазаСуммы))
	        |			И НастройкиДляРасчетаАванса.Услуга = бестОбъемНачисленийНП.Услуга
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НастройкиДляРасчетаАванса.ТипОплаты,
	        |	НастройкиДляРасчетаАванса.ТочкаУчета,
	        |	НастройкиДляРасчетаАванса.Договор,
	        |	НастройкиДляРасчетаАванса.Организация,
	        |	НастройкиДляРасчетаАванса.Район,
	        |	НастройкиДляРасчетаАванса.ОбъектРасчета,
	        |	НастройкиДляРасчетаАванса.Услуга,
	        |	бестОбъемНачисленийНП.СпособНачисления,
	        |	бестОбъемНачисленийНП.ТарифнаяЗона
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	АвансБазаЦены.ТипОплаты КАК ТипОплаты,
	        |	АвансБазаЦены.ТочкаУчета КАК ТочкаУчета,
	        |	АвансБазаЦены.Договор КАК Договор,
	        |	АвансБазаЦены.Организация КАК Организация,
	        |	АвансБазаЦены.Район КАК Район,
	        |	АвансБазаЦены.ОбъектРасчета КАК ОбъектРасчета,
	        |	АвансБазаЦены.Услуга КАК Услуга,
	        |	СУММА(АвансБазаЦены.ОбъемУслуги) КАК ОбъемУслуги,
	        |	СУММА(АвансБазаЦены.ТарифНаСредневзвешанную) КАК ТарифНаСредневзвешанную,
	        |	СУММА(АвансБазаЦены.ТарифЗаУслугиПоПередачи) КАК ТарифЗаУслугиПоПередачи,
	        |	АвансБазаЦены.СпособНачисления КАК СпособНачисления,
	        |	АвансБазаЦены.ТарифнаяЗона КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ АвансБазаЦеныГруппировка
	        |ИЗ
	        |	АвансБазаЦены КАК АвансБазаЦены
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	АвансБазаЦены.Договор,
	        |	АвансБазаЦены.Услуга,
	        |	АвансБазаЦены.ТарифнаяЗона,
	        |	АвансБазаЦены.ТочкаУчета,
	        |	АвансБазаЦены.Организация,
	        |	АвансБазаЦены.ТипОплаты,
	        |	АвансБазаЦены.ОбъектРасчета,
	        |	АвансБазаЦены.Район,
	        |	АвансБазаЦены.СпособНачисления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	АвансБазаОбъемыГруппировка.ТочкаУчета КАК ТочкаУчета,
	        |	АвансБазаОбъемыГруппировка.Договор КАК Договор,
	        |	АвансБазаОбъемыГруппировка.ТипОплаты КАК ТипОплаты,
	        |	АвансБазаЦеныГруппировка.ТарифНаСредневзвешанную КАК ТарифНаСредневзвешанную,
	        |	АвансБазаОбъемыГруппировка.ДеньФормирования КАК ДеньФормирования,
	        |	АвансБазаОбъемыГруппировка.Организация КАК Организация,
	        |	АвансБазаОбъемыГруппировка.Район КАК Район,
	        |	АвансБазаОбъемыГруппировка.Услуга КАК Услуга,
	        |	АвансБазаОбъемыГруппировка.ОбъектРасчета КАК ОбъектРасчета,
	        |	СтавкиНДС.СтавкаНДС КАК СтавкаНДС,
	        |	ВЫБОР
	        |		КОГДА АвансБазаЦеныГруппировка.Организация ЕСТЬ NULL
	        |			ТОГДА 0
	        |		ИНАЧЕ АвансБазаОбъемыГруппировка.ОбъемУслуги * АвансБазаЦеныГруппировка.ТарифНаСредневзвешанную
	        |	КОНЕЦ КАК СуммаСредневзвешенная,
	        |	ВЫБОР
	        |		КОГДА АвансБазаЦеныГруппировка.Организация ЕСТЬ NULL
	        |				ИЛИ СтавкиНДС.Организация ЕСТЬ NULL
	        |			ТОГДА 0
	        |		ИНАЧЕ АвансБазаОбъемыГруппировка.ОбъемУслуги * АвансБазаЦеныГруппировка.ТарифНаСредневзвешанную * СтавкиНДС.СтавкаНДС / (100 + ВЫБОР
	        |				КОГДА АвансБазаОбъемыГруппировка.НДСВнутри
	        |					ТОГДА СтавкиНДС.СтавкаНДС
	        |				ИНАЧЕ 0
	        |			КОНЕЦ)
	        |	КОНЕЦ КАК СуммаСредневзвешеннаяНДС,
	        |	АвансБазаОбъемыГруппировка.ОбъемУслуги КАК ОбъемУслуги,
	        |	АвансБазаОбъемыГруппировка.Процент КАК Процент,
	        |	ВЫБОР
	        |		КОГДА АвансБазаЦеныГруппировка.Организация ЕСТЬ NULL
	        |			ТОГДА 0
	        |		ИНАЧЕ АвансБазаОбъемыГруппировка.ОбъемУслуги * АвансБазаЦеныГруппировка.ТарифЗаУслугиПоПередачи
	        |	КОНЕЦ КАК СуммаЗаУслугиПоПередачи,
	        |	ВЫБОР
	        |		КОГДА АвансБазаЦеныГруппировка.Организация ЕСТЬ NULL
	        |				ИЛИ СтавкиНДС.Организация ЕСТЬ NULL
	        |			ТОГДА 0
	        |		ИНАЧЕ АвансБазаОбъемыГруппировка.ОбъемУслуги * АвансБазаЦеныГруппировка.ТарифЗаУслугиПоПередачи * СтавкиНДС.СтавкаНДС / (100 + ВЫБОР
	        |				КОГДА АвансБазаОбъемыГруппировка.НДСВнутри
	        |					ТОГДА СтавкиНДС.СтавкаНДС
	        |				ИНАЧЕ 0
	        |			КОНЕЦ)
	        |	КОНЕЦ КАК СуммаЗаУслугиПоПередачиНДС,
	        |	АвансБазаЦеныГруппировка.ТарифЗаУслугиПоПередачи КАК ТарифЗаУслугиПоПередачи,
	        |	энргВидыУслуг.бестИспользоватьРасчетПоМощности КАК бестИспользоватьРасчетПоМощности,
	        |	АвансБазаОбъемыГруппировка.НДСВнутри КАК НДСВнутри
	        |ПОМЕСТИТЬ АвансовыеСуммы
	        |ИЗ
	        |	АвансБазаОбъемыГруппировка КАК АвансБазаОбъемыГруппировка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ АвансБазаЦеныГруппировка КАК АвансБазаЦеныГруппировка
	        |		ПО АвансБазаОбъемыГруппировка.ТочкаУчета = АвансБазаЦеныГруппировка.ТочкаУчета
	        |			И АвансБазаОбъемыГруппировка.Договор = АвансБазаЦеныГруппировка.Договор
	        |			И АвансБазаОбъемыГруппировка.Организация = АвансБазаЦеныГруппировка.Организация
	        |			И АвансБазаОбъемыГруппировка.Район = АвансБазаЦеныГруппировка.Район
	        |			И АвансБазаОбъемыГруппировка.Услуга = АвансБазаЦеныГруппировка.Услуга
	        |			И АвансБазаОбъемыГруппировка.ОбъектРасчета = АвансБазаЦеныГруппировка.ОбъектРасчета
	        |			И АвансБазаОбъемыГруппировка.СпособНачисления = АвансБазаЦеныГруппировка.СпособНачисления
	        |			И АвансБазаОбъемыГруппировка.ТарифнаяЗона = АвансБазаЦеныГруппировка.ТарифнаяЗона
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНДС КАК СтавкиНДС
	        |		ПО АвансБазаОбъемыГруппировка.Организация = СтавкиНДС.Организация
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО АвансБазаОбъемыГруппировка.Услуга = энргВидыУслуг.Ссылка
	        |ГДЕ
	        |	НЕ АвансБазаОбъемыГруппировка.Услуга ЕСТЬ NULL
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийЭлектроэнергии.Организация КАК Организация,
	        |	бестОбъемНачисленийЭлектроэнергии.Район КАК Район,
	        |	бестОбъемНачисленийЭлектроэнергии.ПериодНачисления КАК ПериодНачисления,
	        |	бестОбъемНачисленийЭлектроэнергии.ПериодРасчета КАК ПериодРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета КАК ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга КАК Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.Договор КАК Договор,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги) КАК ОбъемУслуги,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаСредневзвешенная) КАК СуммаСредневзвешенная,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаЗаСбытовуюНадбавку) КАК СуммаЗаСбытовуюНадбавку,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаЗаУслугиПоПередачи) КАК СуммаЗаУслугиПоПередачи,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаЗаИныеУслуги) КАК СуммаЗаИныеУслуги,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаСредневзвешеннаяНДС) КАК СуммаСредневзвешеннаяНДС,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаЗаСбытовуюНадбавкуНДС) КАК СуммаЗаСбытовуюНадбавкуНДС,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаЗаУслугиПоПередачиНДС) КАК СуммаЗаУслугиПоПередачиНДС,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаЗаИныеУслугиНДС) КАК СуммаЗаИныеУслугиНДС,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.ТарифНаИныеУслуги) КАК ТарифНаИныеУслуги,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавку) КАК ТарифЗаСбытовуюНадбавку,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.ТарифЗаУслугиПоПередачи) КАК ТарифЗаУслугиПоПередачи,
	        |	МАКСИМУМ(бестОбъемНачисленийЭлектроэнергии.СтавкаНДС) КАК СтавкаНДС,
	        |	НастройкаФормированияПД.ТипОплаты КАК ТипОплаты,
	        |	НастройкаФормированияПД.ДеньФормирования КАК ДеньФормирования,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	        |				ТОГДА бестОбъемНачисленийЭлектроэнергии.Тариф - бестОбъемНачисленийЭлектроэнергии.ТарифНаИныеУслуги - бестОбъемНачисленийЭлектроэнергии.ТарифЗаСбытовуюНадбавку - бестОбъемНачисленийЭлектроэнергии.ТарифЗаУслугиПоПередачи
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ТарифНаСредневзвешанную,
	        |	0 КАК Процент,
	        |	ВЫБОР
	        |		КОГДА бестОбъемНачисленийЭлектроэнергии.ЦеноваяКатегория В (&ЦеновыеКатегорииРазделителяМощности)
	        |				И бестОбъемНачисленийЭлектроэнергии.СпособНачисления В (&СпособыНачисленийРазделителяМощности)
	        |			ТОГДА бестОбъемНачисленийЭлектроэнергии.СпособНачисления
	        |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка)
	        |	КОНЕЦ КАК РазделительНачисленияМощности,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.Сумма) КАК Сумма,
	        |	СУММА(бестОбъемНачисленийЭлектроэнергии.СуммаНДС) КАК СуммаНДС,
	        |	бестОбъемНачисленийЭлектроэнергии.Тариф КАК Тариф,
	        |	бестОбъемНачисленийЭлектроэнергии.НДСВнутри КАК НДСВнутри
	        |ПОМЕСТИТЬ Объемы
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии КАК бестОбъемНачисленийЭлектроэнергии
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаФормированияПДМаксимумДата КАК НастройкаФормированияПД
	        |		ПО бестОбъемНачисленийЭлектроэнергии.Организация = НастройкаФормированияПД.Организация
	        |			И бестОбъемНачисленийЭлектроэнергии.Район = НастройкаФормированияПД.Район
	        |			И бестОбъемНачисленийЭлектроэнергии.Договор = НастройкаФормированияПД.Договор
	        |			И (НастройкаФормированияПД.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический))
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО бестОбъемНачисленийЭлектроэнергии.Услуга = энргВидыУслуг.Ссылка
	        |ГДЕ
	        |	бестОбъемНачисленийЭлектроэнергии.ПериодРасчета = &ПредыдущийПериодНачисления
			|	И бестОбъемНачисленийЭлектроэнергии.ОбъемУслуги > 0
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийЭлектроэнергии.Организация,
	        |	бестОбъемНачисленийЭлектроэнергии.Район,
	        |	бестОбъемНачисленийЭлектроэнергии.ПериодНачисления,
	        |	бестОбъемНачисленийЭлектроэнергии.ОбъектРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.ТочкаУчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Услуга,
	        |	бестОбъемНачисленийЭлектроэнергии.Договор,
	        |	НастройкаФормированияПД.ТипОплаты,
	        |	НастройкаФормированияПД.ДеньФормирования,
	        |	ВЫБОР
	        |		КОГДА бестОбъемНачисленийЭлектроэнергии.ЦеноваяКатегория В (&ЦеновыеКатегорииРазделителяМощности)
	        |				И бестОбъемНачисленийЭлектроэнергии.СпособНачисления В (&СпособыНачисленийРазделителяМощности)
	        |			ТОГДА бестОбъемНачисленийЭлектроэнергии.СпособНачисления
	        |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка)
	        |	КОНЕЦ,
	        |	бестОбъемНачисленийЭлектроэнергии.НДСВнутри,
	        |	бестОбъемНачисленийЭлектроэнергии.ПериодРасчета,
	        |	бестОбъемНачисленийЭлектроэнергии.Тариф
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	бестОбъемНачисленийНП.Организация,
	        |	бестОбъемНачисленийНП.Район,
	        |	бестОбъемНачисленийНП.ПериодНачисления,
	        |	бестОбъемНачисленийНП.ПериодРасчета,
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	бестОбъемНачисленийНП.Договор,
	        |	СУММА(бестОбъемНачисленийНП.ОбъемУслуги),
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	0,
	        |	МАКСИМУМ(бестОбъемНачисленийНП.СтавкаНДС),
	        |	НастройкаФормированияПД.ТипОплаты,
	        |	НастройкаФормированияПД.ДеньФормирования,
	        |	0,
	        |	0,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка),
	        |	СУММА(бестОбъемНачисленийНП.Сумма),
	        |	СУММА(бестОбъемНачисленийНП.СуммаНДС),
	        |	бестОбъемНачисленийНП.ЗначениеТарифа,
	        |	бестОбъемНачисленийНП.НДСВнутри
	        |ИЗ
	        |	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаФормированияПДМаксимумДата КАК НастройкаФормированияПД
	        |		ПО бестОбъемНачисленийНП.Организация = НастройкаФормированияПД.Организация
	        |			И бестОбъемНачисленийНП.Район = НастройкаФормированияПД.Район
	        |			И бестОбъемНачисленийНП.Договор = НастройкаФормированияПД.Договор
	        |			И (НастройкаФормированияПД.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический))
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	        |		ПО бестОбъемНачисленийНП.Услуга = энргВидыУслуг.Ссылка
	        |ГДЕ
	        |	бестОбъемНачисленийНП.ПериодРасчета = &ПредыдущийПериодНачисления	
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестОбъемНачисленийНП.Организация,
	        |	бестОбъемНачисленийНП.Район,
	        |	бестОбъемНачисленийНП.ПериодНачисления,
	        |	бестОбъемНачисленийНП.ОбъектРасчета,
	        |	бестОбъемНачисленийНП.ТочкаУчета,
	        |	бестОбъемНачисленийНП.Услуга,
	        |	бестОбъемНачисленийНП.Договор,
	        |	НастройкаФормированияПД.ТипОплаты,
	        |	НастройкаФормированияПД.ДеньФормирования,
	        |	бестОбъемНачисленийНП.НДСВнутри,
	        |	бестОбъемНачисленийНП.ПериодРасчета,
	        |	бестОбъемНачисленийНП.ЗначениеТарифа
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	АвансовыеСуммы.Организация,
	        |	АвансовыеСуммы.Район,
	        |	&ПериодНачисления,
	        |	&ПериодНачисления,
	        |	АвансовыеСуммы.ОбъектРасчета,
	        |	АвансовыеСуммы.ТочкаУчета,
	        |	АвансовыеСуммы.Услуга,
	        |	АвансовыеСуммы.Договор,
	        |	АвансовыеСуммы.ОбъемУслуги,
	        |	ВЫБОР
	        |		КОГДА АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.СуммаСредневзвешенная
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	0,
	        |	ВЫБОР
	        |		КОГДА АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.СуммаЗаУслугиПоПередачи
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	0,
	        |	ВЫБОР
	        |		КОГДА АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.СуммаСредневзвешеннаяНДС
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	0,
	        |	ВЫБОР
	        |		КОГДА АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.СуммаЗаУслугиПоПередачиНДС
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	0,
	        |	0,
	        |	0,
	        |	ВЫБОР
	        |		КОГДА АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.ТарифЗаУслугиПоПередачи
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	АвансовыеСуммы.СтавкаНДС,
	        |	АвансовыеСуммы.ТипОплаты,
	        |	АвансовыеСуммы.ДеньФормирования,
	        |	ВЫБОР
	        |		КОГДА АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.ТарифНаСредневзвешанную
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	АвансовыеСуммы.Процент,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка),
	        |	ВЫБОР
	        |		КОГДА НЕ АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.СуммаСредневзвешенная
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА НЕ АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.СуммаСредневзвешеннаяНДС
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА НЕ АвансовыеСуммы.бестИспользоватьРасчетПоМощности
	        |			ТОГДА АвансовыеСуммы.ТарифНаСредневзвешанную
	        |		ИНАЧЕ 0
	        |	КОНЕЦ,
	        |	АвансовыеСуммы.НДСВнутри
	        |ИЗ
	        |	АвансовыеСуммы КАК АвансовыеСуммы
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Объемы.Организация КАК Организация,
	        |	Объемы.Район КАК Район,
	        |	Объемы.ПериодНачисления КАК ПериодНачисления,
	        |	Объемы.ОбъектРасчета КАК ОбъектРасчета,
	        |	Объемы.ТочкаУчета КАК ТочкаУчета,
	        |	Объемы.Услуга КАК Услуга,
	        |	Объемы.Договор КАК Договор,
	        |	СУММА(Объемы.ОбъемУслуги) КАК ОбъемУслуги,
	        |	СУММА(Объемы.СуммаСредневзвешенная) КАК СуммаСредневзвешенная,
	        |	СУММА(Объемы.СуммаЗаСбытовуюНадбавку) КАК СуммаЗаСбытовуюНадбавку,
	        |	СУММА(Объемы.СуммаЗаУслугиПоПередачи) КАК СуммаЗаУслугиПоПередачи,
	        |	СУММА(Объемы.СуммаЗаИныеУслуги) КАК СуммаЗаИныеУслуги,
	        |	СУММА(Объемы.СуммаСредневзвешеннаяНДС) КАК СуммаСредневзвешеннаяНДС,
	        |	СУММА(Объемы.СуммаЗаСбытовуюНадбавкуНДС) КАК СуммаЗаСбытовуюНадбавкуНДС,
	        |	СУММА(Объемы.СуммаЗаУслугиПоПередачиНДС) КАК СуммаЗаУслугиПоПередачиНДС,
	        |	СУММА(Объемы.СуммаЗаИныеУслугиНДС) КАК СуммаЗаИныеУслугиНДС,
	        |	Объемы.ТарифНаИныеУслуги КАК ТарифНаИныеУслуги,
	        |	Объемы.ТарифЗаСбытовуюНадбавку КАК ТарифЗаСбытовуюНадбавку,
	        |	Объемы.ТарифЗаУслугиПоПередачи КАК ТарифЗаУслугиПоПередачи,
	        |	Объемы.СтавкаНДС КАК СтавкаНДС,
	        |	ВЫБОР
	        |		КОГДА Объемы.ТарифНаСредневзвешанную <> 0
	        |			ТОГДА Объемы.ТарифНаСредневзвешанную
	        |		КОГДА Объемы.ОбъемУслуги = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ Объемы.СуммаСредневзвешенная / Объемы.ОбъемУслуги
	        |	КОНЕЦ КАК ТарифНаСредневзвешанную,
	        |	бестПлатежныйДокумент.Ссылка КАК ПД,
	        |	Объемы.ТипОплаты КАК ТипЗадолженности,
	        |	Объемы.ДеньФормирования КАК ДеньФормирования,
	        |	Объемы.Процент КАК Процент,
	        |	Объемы.РазделительНачисленияМощности КАК СпособНачисления,
	        |	СУММА(Объемы.Сумма) КАК Сумма,
	        |	СУММА(Объемы.СуммаНДС) КАК СуммаНДС,
	        |	Объемы.Тариф КАК Тариф,
	        |	Объемы.НДСВнутри КАК НДСВнутри
	        |ИЗ
	        |	Объемы КАК Объемы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	        |		ПО Объемы.Организация = бестПлатежныйДокумент.Организация
	        |			И Объемы.Район = бестПлатежныйДокумент.Район
	        |			И Объемы.Договор = бестПлатежныйДокумент.Договор
	        |			И (бестПлатежныйДокумент.ДокументОснование = НЕОПРЕДЕЛЕНО)
	        |			И Объемы.ТипОплаты = бестПлатежныйДокумент.ТипЗадолженности
	        |			И (ВЫБОР
	        |				КОГДА Объемы.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Авансовый)
	        |					ТОГДА ДЕНЬ(бестПлатежныйДокумент.Дата) = Объемы.ДеньФормирования
	        |							И МЕСЯЦ(бестПлатежныйДокумент.Дата) = МЕСЯЦ(&ПериодНачисления)
	        |				ИНАЧЕ Объемы.ПериодРасчета = бестПлатежныйДокумент.ПериодНачисления
	        |			КОНЕЦ)
	        |			И (бестПлатежныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПлатежныйДокумент_Расчетный))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестПлатежныйДокумент.Ссылка,
	        |	Объемы.ТипОплаты,
	        |	Объемы.НДСВнутри,
	        |	Объемы.РазделительНачисленияМощности,
	        |	Объемы.Район,
	        |	Объемы.ПериодНачисления,
	        |	Объемы.ОбъектРасчета,
	        |	Объемы.ТочкаУчета,
	        |	Объемы.Услуга,
	        |	Объемы.Договор,
	        |	Объемы.Организация,
	        |	Объемы.ТарифНаИныеУслуги,
	        |	Объемы.ТарифЗаСбытовуюНадбавку,
	        |	Объемы.ТарифЗаУслугиПоПередачи,
	        |	Объемы.СтавкаНДС,
	        |	ВЫБОР
	        |		КОГДА Объемы.ТарифНаСредневзвешанную <> 0
	        |			ТОГДА Объемы.ТарифНаСредневзвешанную
	        |		КОГДА Объемы.ОбъемУслуги = 0
	        |			ТОГДА 0
	        |		ИНАЧЕ Объемы.СуммаСредневзвешенная / Объемы.ОбъемУслуги
	        |	КОНЕЦ,
	        |	Объемы.ДеньФормирования,
	        |	Объемы.Процент,
	        |	Объемы.Тариф
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Договор,
	        |	ТипЗадолженности,
	        |	ПД УБЫВ";
КонецФункции

Функция ЦеновыеКатегорииРазделителяМощности()
	
	Результат = Новый Массив;	
	Результат.Добавить(Перечисления.бестЦеновыеКатегории.ЧетвертаяЦК);
	Результат.Добавить(Перечисления.бестЦеновыеКатегории.ШестаяЦК);
	
	Возврат Результат;
	
КонецФункции

Функция СпособыНачисленийРазделителяМощности()
	
	Результат = Новый Массив;	
	Результат.Добавить(Перечисления.энргСпособНачислений.МощностьНаРозничномРынке);
	Результат.Добавить(Перечисления.энргСпособНачислений.МощностьНаПередачу);
	
	Возврат Результат;	
	
КонецФункции

#КонецОбласти

#Область СозданиеСФНаАванс

Процедура СоздатьКорректировочныеСФНаАванс(мСозданныеДокументы, СтруктураОтборов)
	ПериодНачисления 								= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(СтруктураОтборов.ДатаФакта, СтруктураОтборов.Организация,СтруктураОтборов.Район);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаКорректировочныеСФНаАванс();
	
	
	Запрос.УстановитьПараметр("Организация", 		СтруктураОтборов.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 				СтруктураОтборов.Район);
	
	
	Если СтруктураОтборов.Свойство("Договор") И ЗначениеЗаполнено(СтруктураОтборов.Договор) Тогда
		Запрос.УстановитьПараметр("Договор", СтруктураОтборов.Договор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестСчетФактураНаАванс.Договор = &Договор", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестКорректировкаЗадолженности.Договор = &Договор", "Истина");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("Контрагент") И ЗначениеЗаполнено(СтруктураОтборов.Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", СтруктураОтборов.Контрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов.Контрагент = &Контрагент", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргДоговорыКонтрагентов1.Контрагент = &Контрагент", "Истина");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	НачатьТранзакцию();
	Попытка
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СозданныйДокумент) Тогда
				ДокументОбъект 						= ВыборкаДетальныеЗаписи.СозданныйДокумент.ПолучитьОбъект();
				ДокументОбъект.СуммаПереплаты 		= ВыборкаДетальныеЗаписи.СуммаПереплаты;
				ДокументОбъект.СуммаПереплатыНДС 	= ВыборкаДетальныеЗаписи.СуммаПереплатыНДС;
			Иначе
				ДокументОбъект 						= Документы.бестСчетФактураНаАванс.СоздатьДокумент();
				ДокументОбъект.Дата					= СтруктураОтборов.ДатаФакта;
				ДокументОбъект.Корректировка		= Истина;
				ЗаполнитьЗначенияСвойств(ДокументОбъект, ВыборкаДетальныеЗаписи);
			КонецЕсли;
			
			
			ДокументОбъект.записать();
			мСозданныеДокументы.Добавить(ДокументОбъект.Ссылка);	
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Функция ПолучитьТекстЗапросаФормированиеСФНаАванс()
	
	Возврат "ВЫБРАТЬ
	        |	бестАвансыЭЭ.Регистратор КАК Регистратор,
	        |	бестАвансыЭЭ.Организация КАК Организация,
	        |	бестАвансыЭЭ.Район КАК Район,
	        |	бестАвансыЭЭ.Договор КАК Договор,
	        |	бестАвансыЭЭ.ПериодНачисления КАК ПериодНачисления,
	        |	бестАвансыЭЭ.ДокументОплаты КАК ДокументОплаты,
	        |	бестАвансыЭЭ.Сумма КАК Сумма,
	        |	бестАвансыЭЭ.СуммаНДС КАК СуммаНДС,
	        |	бестАвансыЭЭ.IDСтрокиОплаты КАК IDСтрокиОплаты,
	        |	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Дата КАК Дата
	        |ПОМЕСТИТЬ Авансы
	        |ИЗ
	        |	РегистрНакопления.бестАвансыЭЭ КАК бестАвансыЭЭ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ПО бестАвансыЭЭ.Договор = энргДоговорыКонтрагентов.Ссылка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица КАК бестПлатежноеПоручениеВходящееЭЭЮрЛица
	        |		ПО бестАвансыЭЭ.ДокументОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛица.Ссылка
	        |ГДЕ
	        |	бестАвансыЭЭ.Организация = &Организация
	        |	И бестАвансыЭЭ.Район = &Район
	        |	И бестАвансыЭЭ.Договор = &Договор
	        |	И энргДоговорыКонтрагентов.Контрагент = &Контрагент
	        |	И бестАвансыЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	        |	И бестАвансыЭЭ.ПериодНачисления = &ПериодНачисления
	        |	И бестАвансыЭЭ.Период <= &Дата
	        |	И бестАвансыЭЭ.Регистратор = &ВводНачальныхОстатков
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Авансы.Организация КАК Организация,
	        |	Авансы.Район КАК Район,
	        |	Авансы.Договор КАК Договор,
	        |	Авансы.ПериодНачисления КАК ПериодНачисления,
	        |	Авансы.ДокументОплаты КАК ДокументОплаты,
	        |	Авансы.Сумма КАК СуммаПереплаты,
	        |	Авансы.СуммаНДС КАК СуммаПереплатыНДС,
	        |	Авансы.IDСтрокиОплаты КАК IDСтрокиОплаты,
	        |	бестСчетФактураНаАванс.Ссылка КАК ДокументСФ,
	        |	энргЗоныОтвественности.КодРайона КАК КодРайона,
	        |	Авансы.Дата КАК Дата,
	        |	ВЫБОР
	        |		КОГДА Авансы.Регистратор ССЫЛКА Документ.бестВводНачальныхОстатковЮридическихЛиц
	        |			ТОГДА Авансы.Регистратор
	        |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	        |	КОНЕЦ КАК Основание
	        |ИЗ
	        |	Авансы КАК Авансы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестСчетФактураНаАванс КАК бестСчетФактураНаАванс
	        |		ПО Авансы.Организация = бестСчетФактураНаАванс.Организация
	        |			И Авансы.Район = бестСчетФактураНаАванс.Район
	        |			И Авансы.Договор = бестСчетФактураНаАванс.Договор
	        |			И Авансы.ПериодНачисления = бестСчетФактураНаАванс.ПериодНачисления
	        |			И Авансы.ДокументОплаты = бестСчетФактураНаАванс.ДокументОплаты
	        |			И Авансы.IDСтрокиОплаты = бестСчетФактураНаАванс.IDСтрокиОплаты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	        |		ПО Авансы.Район = энргЗоныОтвественности.Ссылка";
	
КонецФункции

Функция ПолучитьТекстЗапросаКорректировочныеСФНаАванс()
	 Возврат "ВЫБРАТЬ
	         |	бестСчетФактураНаАванс.Организация КАК Организация,
	         |	бестСчетФактураНаАванс.Район КАК Район,
	         |	бестСчетФактураНаАванс.Договор КАК Договор,
	         |	&ПериодНачисления КАК ПериодНачисления,
	         |	бестСчетФактураНаАванс.НомерСчетаФактуры КАК НомерСчетаФактуры,
	         |	бестСчетФактураНаАванс.IDСтрокиОплаты КАК IDСтрокиОплаты,
	         |	бестСчетФактураНаАванс.Ссылка КАК Основание,
	         |	СУММА(бестКорректировкаЗадолженностиПереносОплаты.Сумма) КАК СуммаПереплаты,
	         |	СУММА(бестКорректировкаЗадолженностиПереносОплаты.СуммаНДС) КАК СуммаПереплатыНДС,
	         |	бестКорректировкаЗадолженности.Ссылка КАК ДокументОплаты
	         |ПОМЕСТИТЬ ПереносГруппировка
	         |ИЗ
	         |	Документ.бестСчетФактураНаАванс КАК бестСчетФактураНаАванс
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	         |		ПО бестСчетФактураНаАванс.Договор = энргДоговорыКонтрагентов.Ссылка
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
	         |		ПО бестСчетФактураНаАванс.IDСтрокиОплаты = бестКорректировкаЗадолженностиПереносОплаты.IDСтроки,
	         |	Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов1
	         |		ПО бестКорректировкаЗадолженности.Договор = энргДоговорыКонтрагентов1.Ссылка
	         |ГДЕ
	         |	бестСчетФактураНаАванс.Организация = &Организация
	         |	И бестСчетФактураНаАванс.Район = &Район
	         |	И бестСчетФактураНаАванс.Договор = &Договор
	         |	И бестКорректировкаЗадолженности.Организация = &Организация
	         |	И бестКорректировкаЗадолженности.Район = &Район
	         |	И бестКорректировкаЗадолженности.ПериодНачисления = &ПериодНачисления
	         |	И бестКорректировкаЗадолженности.Договор = &Договор
	         |	И энргДоговорыКонтрагентов.Контрагент = &Контрагент
	         |	И энргДоговорыКонтрагентов1.Контрагент = &Контрагент
	         |	И бестКорректировкаЗадолженности.Проведен
	         |	И НЕ бестКорректировкаЗадолженности.ПометкаУдаления
	         |	И НЕ бестСчетФактураНаАванс.ПометкаУдаления
	         |	И НЕ бестСчетФактураНаАванс.Корректировка
	         |	И бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа)
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	бестСчетФактураНаАванс.Организация,
	         |	бестСчетФактураНаАванс.Район,
	         |	бестСчетФактураНаАванс.Договор,
	         |	бестСчетФактураНаАванс.НомерСчетаФактуры,
	         |	бестСчетФактураНаАванс.IDСтрокиОплаты,
	         |	бестСчетФактураНаАванс.Ссылка,
	         |	бестКорректировкаЗадолженности.Ссылка
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	бестСчетФактураНаАванс.Организация КАК Организация,
	         |	бестСчетФактураНаАванс.Район КАК Район,
	         |	бестСчетФактураНаАванс.Договор КАК Договор,
	         |	&ПериодНачисления КАК ПериодНачисления,
	         |	бестСчетФактураНаАванс.НомерСчетаФактуры КАК НомерСчетаФактуры,
	         |	бестСчетФактураНаАванс.IDСтрокиОплаты КАК IDСтрокиОплаты,
	         |	бестСчетФактураНаАванс.Ссылка КАК Основание,
	         |	бестКорректировкаЗадолженностиВозвратОплаты.СуммаВозврата КАК СуммаПереплаты,
	         |	бестКорректировкаЗадолженностиВозвратОплаты.СуммаВозвратаНДС КАК СуммаПереплатыНДС,
	         |	бестКорректировкаЗадолженности.Ссылка КАК ДокументОплаты
	         |ПОМЕСТИТЬ ДанныеДляФормирования
	         |ИЗ
	         |	Документ.бестСчетФактураНаАванс КАК бестСчетФактураНаАванс
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности.ВозвратОплаты КАК бестКорректировкаЗадолженностиВозвратОплаты
	         |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
	         |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов1
	         |				ПО бестКорректировкаЗадолженности.Договор = энргДоговорыКонтрагентов1.Ссылка
	         |			ПО (бестКорректировкаЗадолженности.Ссылка = бестКорректировкаЗадолженностиВозвратОплаты.Ссылка)
	         |		ПО бестСчетФактураНаАванс.IDСтрокиОплаты = бестКорректировкаЗадолженностиВозвратОплаты.IDСтроки
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	         |		ПО бестСчетФактураНаАванс.Договор = энргДоговорыКонтрагентов.Ссылка
	         |ГДЕ
	         |	бестСчетФактураНаАванс.Организация = &Организация
	         |	И бестСчетФактураНаАванс.Район = &Район
	         |	И бестСчетФактураНаАванс.Договор = &Договор
	         |	И бестКорректировкаЗадолженности.Организация = &Организация
	         |	И бестКорректировкаЗадолженности.Район = &Район
	         |	И бестКорректировкаЗадолженности.ПериодНачисления = &ПериодНачисления
	         |	И бестКорректировкаЗадолженности.Договор = &Договор
	         |	И энргДоговорыКонтрагентов.Контрагент = &Контрагент
	         |	И энргДоговорыКонтрагентов1.Контрагент = &Контрагент
	         |	И бестКорректировкаЗадолженности.Проведен
	         |	И НЕ бестКорректировкаЗадолженности.ПометкаУдаления
	         |	И НЕ бестСчетФактураНаАванс.ПометкаУдаления
	         |	И НЕ бестСчетФактураНаАванс.Корректировка
	         |	И бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ВозвратПлатежа)
	         |
	         |ОБЪЕДИНИТЬ ВСЕ
	         |
	         |ВЫБРАТЬ
	         |	ПереносГруппировка.Организация,
	         |	ПереносГруппировка.Район,
	         |	ПереносГруппировка.Договор,
	         |	ПереносГруппировка.ПериодНачисления,
	         |	ПереносГруппировка.НомерСчетаФактуры,
	         |	ПереносГруппировка.IDСтрокиОплаты,
	         |	ПереносГруппировка.Основание,
	         |	ПереносГруппировка.СуммаПереплаты,
	         |	ПереносГруппировка.СуммаПереплатыНДС,
	         |	ПереносГруппировка.ДокументОплаты
	         |ИЗ
	         |	ПереносГруппировка КАК ПереносГруппировка
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ДанныеДляФормирования.Организация КАК Организация,
	         |	ДанныеДляФормирования.Район КАК Район,
	         |	ДанныеДляФормирования.Договор КАК Договор,
	         |	ДанныеДляФормирования.ПериодНачисления КАК ПериодНачисления,
	         |	ДанныеДляФормирования.НомерСчетаФактуры КАК НомерСчетаФактуры,
	         |	ДанныеДляФормирования.IDСтрокиОплаты КАК IDСтрокиОплаты,
	         |	ДанныеДляФормирования.Основание КАК Основание,
	         |	ДанныеДляФормирования.СуммаПереплаты КАК СуммаПереплаты,
	         |	ДанныеДляФормирования.СуммаПереплатыНДС КАК СуммаПереплатыНДС,
	         |	ДанныеДляФормирования.ДокументОплаты КАК ДокументОплаты,
	         |	бестСчетФактураНаАванс.Ссылка КАК СозданныйДокумент
	         |ИЗ
	         |	ДанныеДляФормирования КАК ДанныеДляФормирования
	         |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестСчетФактураНаАванс КАК бестСчетФактураНаАванс
	         |		ПО ДанныеДляФормирования.Организация = бестСчетФактураНаАванс.Организация
	         |			И ДанныеДляФормирования.Район = бестСчетФактураНаАванс.Район
	         |			И ДанныеДляФормирования.Договор = бестСчетФактураНаАванс.Договор
	         |			И ДанныеДляФормирования.ПериодНачисления = бестСчетФактураНаАванс.ПериодНачисления
	         |			И ДанныеДляФормирования.НомерСчетаФактуры = бестСчетФактураНаАванс.НомерСчетаФактуры
	         |			И ДанныеДляФормирования.IDСтрокиОплаты = бестСчетФактураНаАванс.IDСтрокиОплаты
	         |			И ДанныеДляФормирования.Основание = бестСчетФактураНаАванс.Основание
	         |			И ДанныеДляФормирования.ДокументОплаты = бестСчетФактураНаАванс.ДокументОплаты
	         |			И (бестСчетФактураНаАванс.Корректировка)
	         |			И (НЕ бестСчетФактураНаАванс.ПометкаУдаления)";
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли