#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ = ОбменДанными.Загрузка;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Дата,Номер,ПериодНачисления");
	
	ПредыдущийЭтап 									= ДанныеЗаполнения.ЭтапЗаключенияДоговора; 
	ЭтапЗаключенияДоговора							= СледующийЭтапЗаключенияДоговора(ПредыдущийЭтап);
	Основание 										= ДанныеЗаполнения;
	
	Если ЭтапЗаключенияДоговора = Справочники.бестВидыОперацийЗаключенийДоговоров.ЭтапЗаключенияДоговора_ПередачаДоговораВАрхив тогда
		//// Заполняем табличную часть
		//Долги.Очистить();
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаГоспошлина) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Гос пошлина";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаГоспошлина;
		//КонецЕсли;	
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаПеня) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Пеня";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаПеня;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаЗадолженности) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Сумма основного долга";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаЗадолженности;
		//КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СледующийЭтапЗаключенияДоговора(ПредыдущийЭтап)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПредыдущийЭтап",ПредыдущийЭтап);
	Запрос.Текст 	="ВЫБРАТЬ
	|	бестВидыОперацийЗаключенийДоговоров.Ссылка КАК Этап
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(бестВидыОперацийЗаключенийДоговоров.Порядок) КАК Порядок
	|	ИЗ
	|		Справочник.бестВидыОперацийЗаключенийДоговоров КАК бестВидыОперацийЗаключенийДоговоров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				бестВидыОперацийЗаключенийДоговоров.Порядок КАК Порядок
	|			ИЗ
	|				Справочник.бестВидыОперацийЗаключенийДоговоров КАК бестВидыОперацийЗаключенийДоговоров
	|			ГДЕ
	|				бестВидыОперацийЗаключенийДоговоров.Ссылка = &ПредыдущийЭтап) КАК ВложенныйЗапрос
	|			ПО (ВложенныйЗапрос.Порядок < бестВидыОперацийЗаключенийДоговоров.Порядок)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестВидыОперацийЗаключенийДоговоров КАК бестВидыОперацийЗаключенийДоговоров
	|		ПО ВложенныйЗапрос.Порядок = бестВидыОперацийЗаключенийДоговоров.Порядок";
	результат  = Запрос.Выполнить();
	Если результат.Пустой() тогда
		Возврат Справочники.бестВидыОперацийЗаключенийДоговоров.ПустаяСсылка();
	иначе
		Выборка = результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Этап;
	КонецЕсли; 
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли