#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет действующую разрезы норматива.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующуюРазрезыНорматива(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующуюПараметрыРасчетаНорматива());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
КонецПроцедуры

// Заполняет действующую разрезы норматива коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка..
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующуюРазрезыНормативаКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующуюРазрезыНормативаКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
КонецПроцедуры

// Получает структуру параметров разреза.
// 
// Возвращаемое значение:
//   ФиксированнаяСтруктура.
//
Функция СтруктураПараметровРазреза() Экспорт
	Менеджер = Перечисления.энргКлючевыеПараметрыНорматива;
	
	Возврат Новый ФиксированнаяСтруктура("
	|РазрезВидБлагоустройства,РазрезВидСобственности,РазрезГодПостройки,
	|РазрезКоличествоКомнат,РазрезКоличествоЧеловек,РазрезКоличествоПрописанных,РазрезКоличествоПроживающих,РазрезКоличествоЭтажей,РазрезИзмерительНаправленияИспользования",
	Менеджер.ВидБлагоустройства, Менеджер.ВидСобственности, Менеджер.ГодПостройки,
	Менеджер.КоличествоКомнат, Менеджер.КоличествоЧеловек,Менеджер.КоличествоПрописанных,Менеджер.КоличествоПроживающих, Менеджер.КоличествоЭтажей, Менеджер.ИзмерительНаправленияИспользования);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующуюПараметрыРасчетаНорматива()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидБлагоустройства,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидСобственности)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидСобственности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ГодПостройки)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезГодПостройки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоКомнат,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЧеловек,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПроживающих,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПрописанных,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЭтажей)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЭтажей,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезИзмерительНаправленияИспользования,
	|	ВложенныйЗапрос.ТипНачисления КАК ТипНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		энргУстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|		энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив,
	|		ВложенныйЗапрос.ТипНачисления КАК ТипНачисления
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.ТипНачисления КАК ТипНачисления,
	|			МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга КАК Услуга,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления КАК ТипНачисления,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период КАК Период,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив КАК СоциальныйНорматив
	|			ИЗ
	|				РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива.СрезПоследних(
	|						&МоментВремени,
	|						Организация = &Организация
	|							И Район = &Район
	|							И (ВЫБОР
	|								КОГДА &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ПустаяСсылка)
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ТипНачисления = &ТипНачисления
	|							КОНЕЦ)) КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив
	|			ИЗ
	|				РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива.СрезПоследних(
	|						&МоментВремени,
	|						Организация = &Организация
	|							И Район = &Район
	|							И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)) КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|					ПО энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|						И (энргВидыУслуг.НормативДляИндивидуальных)
	|						И (НЕ &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТипНачисления,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|			ПО ВложенныйЗапрос.Услуга = энргУстановленныеПараметрыРасчетаНорматива.Услуга
	|				И ВложенныйЗапрос.Период = энргУстановленныеПараметрыРасчетаНорматива.Период
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|				И ВложенныйЗапрос.ТипНачисления = энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|				И ВложенныйЗапрос.НаправлениеИспользованияТУ = энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|				И ВложенныйЗапрос.СоциальныйНорматив = энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив,
	|	ВложенныйЗапрос.ТипНачисления";	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДействующуюРазрезыНормативаКоллекцияПериодов()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидБлагоустройства,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидСобственности)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидСобственности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ГодПостройки)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезГодПостройки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоКомнат,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЧеловек,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПрописанных,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПроживающих,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЭтажей)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЭтажей,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезИзмерительНаправленияИспользования,
	|	ВложенныйЗапрос.ТипНачисления КАК ТипНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		энргУстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|		энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив,
	|		энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления КАК ТипНачисления
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.ТипНачисления КАК ТипНачисления,
	|			МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|				ВложенныйЗапрос.Организация КАК Организация,
	|				ВложенныйЗапрос.Район КАК Район,
	|				ВложенныйЗапрос.ТипНачисления КАК ТипНачисления,
	|				ВложенныйЗапрос.Услуга КАК Услуга,
	|				ВложенныйЗапрос.Разрез КАК Разрез,
	|				ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|				УстановленныеПараметрыРасчетаНорматива.Период КАК Период
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация КАК Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район КАК Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления КАК ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга КАК Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив,
	|					МАКСИМУМ(УстановленныеПараметрыРасчетаНорматива.Период) КАК Период
	|				ИЗ
	|					ТаблицаПериодов КАК ТаблицаПериодов
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК УстановленныеПараметрыРасчетаНорматива
	|						ПО ТаблицаПериодов.Организация = УстановленныеПараметрыРасчетаНорматива.Организация
	|							И ТаблицаПериодов.Район = УстановленныеПараметрыРасчетаНорматива.Район
	|							И (ВЫБОР
	|								КОГДА &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ПустаяСсылка)
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ УстановленныеПараметрыРасчетаНорматива.ТипНачисления = &ТипНачисления
	|							КОНЕЦ)
	|							И ТаблицаПериодов.ЗавершениеОП > УстановленныеПараметрыРасчетаНорматива.Период
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ТаблицаПериодов.ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив
	|				
	|				ОБЪЕДИНИТЬ ВСЕ
	|				
	|				ВЫБРАТЬ
	|					ТаблицаПериодов.ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив,
	|					МАКСИМУМ(УстановленныеПараметрыРасчетаНорматива.Период)
	|				ИЗ
	|					ТаблицаПериодов КАК ТаблицаПериодов
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК УстановленныеПараметрыРасчетаНорматива
	|						ПО ТаблицаПериодов.Организация = УстановленныеПараметрыРасчетаНорматива.Организация
	|							И ТаблицаПериодов.Район = УстановленныеПараметрыРасчетаНорматива.Район
	|							И (УстановленныеПараметрыРасчетаНорматива.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|							И ТаблицаПериодов.ЗавершениеОП > УстановленныеПараметрыРасчетаНорматива.Период
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|						ПО (УстановленныеПараметрыРасчетаНорматива.Услуга = энргВидыУслуг.Ссылка)
	|							И (энргВидыУслуг.НормативДляИндивидуальных)
	|							И (НЕ &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ТаблицаПериодов.ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК УстановленныеПараметрыРасчетаНорматива
	|					ПО ВложенныйЗапрос.Организация = УстановленныеПараметрыРасчетаНорматива.Организация
	|						И ВложенныйЗапрос.Район = УстановленныеПараметрыРасчетаНорматива.Район
	|						И ВложенныйЗапрос.ТипНачисления = УстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|						И ВложенныйЗапрос.Услуга = УстановленныеПараметрыРасчетаНорматива.Услуга
	|						И ВложенныйЗапрос.Разрез = УстановленныеПараметрыРасчетаНорматива.Разрез
	|						И ВложенныйЗапрос.НаправлениеИспользованияТУ = УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|						И ВложенныйЗапрос.СоциальныйНорматив = УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив
	|						И ВложенныйЗапрос.Период = УстановленныеПараметрыРасчетаНорматива.Период) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.ПериодНачисления,
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТипНачисления,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|			ПО ВложенныйЗапрос.Услуга = энргУстановленныеПараметрыРасчетаНорматива.Услуга
	|				И ВложенныйЗапрос.Период = энргУстановленныеПараметрыРасчетаНорматива.Период
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|				И ВложенныйЗапрос.ТипНачисления = энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|				И ВложенныйЗапрос.НаправлениеИспользованияТУ = энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|				И ВложенныйЗапрос.СоциальныйНорматив = энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив,
	|	ВложенныйЗапрос.ТипНачисления";	
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли