
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьНачисления(Команда)
	ЗапуститьФоновоеЗаданиеКлиент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#Область ФоновоеВыполнениеЗадачи

&НаКлиенте
Функция ЗапуститьФоновоеЗаданиеКлиент()
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер();
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииФоновогоЗадания", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьФоновоеЗаданиеСервер()
	
	ИмяМетода = "энргВыполнениеНачислений.энргВыполнениеНачислений";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнения начислений по заданной очередности'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииФоновогоЗадания(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение( ,РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 	
	
	ПоказатьПредупреждение( ,"Задание выполнено");
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти