#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),				Движения.бестКоличествоНедопусковЮЛ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		   |	бестУстановитьКоличествоНедопусковЮЛ.Дата КАК Период,
	      		   |	бестУстановитьКоличествоНедопусковЮЛ.Организация КАК Организация,
	      		   |	бестУстановитьКоличествоНедопусковЮЛ.КоличествоНедопусков КАК КоличествоНедопусков,
	      		   |	бестУстановитьКоличествоНедопусковЮЛ.Коэффициент КАК Коэффициент
	      		   |ИЗ
	      		   |	Документ.бестУстановитьКоличествоНедопусковЮЛ КАК бестУстановитьКоличествоНедопусковЮЛ
	      		   |ГДЕ
	      		   |	бестУстановитьКоличествоНедопусковЮЛ.Ссылка = &Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли