#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестАктПринятияПрибораУчетаККоммерческомуУчету(ЭтотОбъект, Объект.Ссылка);
	// энргОбщегоНазначения.ЗаполнитьОрганизациюПоУмолчанию();
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;	
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект);
	//КонецЕсли;
	
	// ВводНаОсновании
	//ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	//ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестАктПринятияПрибораУчетаККоммерческомуУчету(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	Запрос.УстановитьПараметр("Район", 				Объект.Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		Объект.ОбъектРасчета);
	Запрос.УстановитьПараметр("Дата", 				?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), Объект.ДатаФактическогоСобытия, Объект.Дата));
	
	Текст	 = "ВЫБРАТЬ
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.Организация КАК Организация,
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.Район КАК Район,
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
	     	   |ПОМЕСТИТЬ ВрТ_ТУ
	     	   |ИЗ
	     	   |	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	     	   |			&Дата,
	     	   |			Организация = &Организация
	     	   |				И Район = &Район
	     	   |				И ОбъектРасчета = &ОбъектРасчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	     	   |ГДЕ
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	     	   |
	     	   |СГРУППИРОВАТЬ ПО
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета,
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.Организация,
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.Район,
	     	   |	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета
	     	   |;
	     	   |
	     	   |////////////////////////////////////////////////////////////////////////////////
	     	   |ВЫБРАТЬ
	     	   |	ВрТ_ТУ.Организация КАК Организация,
	     	   |	ВрТ_ТУ.Район КАК Район,
	     	   |	ВрТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	     	   |	ВрТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	     	   |	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	     	   |ИЗ
	     	   |	ВрТ_ТУ КАК ВрТ_ТУ
	     	   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(&Дата, ) КАК бестПриборыТочекУчетаНПСрезПоследних
	     	   |		ПО ВрТ_ТУ.Организация = бестПриборыТочекУчетаНПСрезПоследних.Организация
	     	   |			И ВрТ_ТУ.Район = бестПриборыТочекУчетаНПСрезПоследних.Район
	     	   |			И ВрТ_ТУ.ОбъектРасчета = бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета
	     	   |			И ВрТ_ТУ.ТочкаУчета = бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета
	     	   |
	     	   |УПОРЯДОЧИТЬ ПО
	     	   |	ОбъектРасчета";
	
	Запрос.Текст = Текст;	
	Результат 		= Запрос.Выполнить();
	Выгрузка 		= Результат.Выгрузить();
	
	Объект.ТочкиУчета.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти