
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДокумент  				= Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		ЗаполнитьДокумент 			= Параметры.ЗаполнитьДокумент; 		 		
	КонецЕсли;  	
	
	Если ЗначениеЗаполнено(Объект.Абонент) и ЗаполнитьДокумент тогда 
		
		ДокументОснование  			= Параметры.ЗначенияЗаполнения.ДокументОснование;
		
		Строки  					= Объект.ДокументыОснования.НайтиСтроки(Новый Структура("Документ",ДокументОснование));
		Если Строки.количество()  = 0 тогда
			Строка  				= Объект.ДокументыОснования.Добавить();
			Строка.Документ 		= ДокументОснование;
		КонецЕсли;  		
		ЗаполнитьДанныеПоОснованиямСервер();
	КонецЕсли;  
		
	Если Параметры.Ключ.Пустая() и Параметры.ЗначенияЗаполнения.Свойство("Абонент") тогда
	
		ДанныеАбонента								= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Абонент,Новый ФиксированнаяСтруктура("Район,МКД,ЛицевойСчет"));
		Объект.Район 								= ДанныеАбонента.Район;
		Объект.МКД 									= ДанныеАбонента.МКД;
		Объект.ЛицевойСчет							= ДанныеАбонента.ЛицевойСчет;
		Объект.АдресОбъекта 						= УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Объект.Абонент,Справочники.ВидыКонтактнойИнформации.АдресОбъекта);
		
	иначеЕсли не Параметры.Ключ.Пустая() Тогда
		
		  УстановитьПредсталениеПериода();
		
  КонецЕсли;  
	  
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестПерерасчетНП(ЭтотОбъект);
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(Объект);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		Предупреждение("Заполните табличную часть ""Документ-основание""");
	Иначе
		ЗаполнитьДанныеПоОснованиямСервер();		
	КонецЕсли;  
	
КонецПроцедуры 

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеПоОснованиямСервер()
	
	//НачПерНачисления 				= энргНачисления.ОпределитьНачальныйПериодПерерасчета(Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ"),Ложь);
	//
	//Объект.НачПериода 				= НачПерНачисления;
	//Объект.КонПериода 				= НачалоМесяца(Объект.ПериодНачисления-1);
	//
	//УстановитьПредсталениеПериода();	
	//энргНачисления.ДанныеПерерасчета(Объект.Район,Объект.МКД,Объект.Абонент,НачПерНачисления,Объект.ПериодНачисления,Объект);
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргВводНачальныхОстатков"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргОбходнойЛист"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПриходныйКассовыйОрдер"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПерерасчет"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента"));
	
	
	Текст  							="ВЫБРАТЬ МАКСИМУМ(ВложенныйЗапрос.ДатаФакт)КАК ДатаФакт  ИЗ (Выбрать Минимум(ВложенныйЗапрос.ДатаФактическогоСобытия) КАК ДатаФакт ИЗ (%%ТекстВложенногоЗапроса%%) КАК ВложенныйЗапрос ОБЪЕДИНИТЬ ВСЕ " +Символы.ПС + " ВЫБРАТЬ энргДатаНачалаВеденияУчета.Значение  ИЗ Константа.энргДатаНачалаВеденияУчета КАК энргДатаНачалаВеденияУчета ГДЕ энргДатаНачалаВеденияУчета.Значение > ДАТАВРЕМЯ(1, 1, 1)) КАК ВложенныйЗапрос";
	ТекстВложенногоЗапроса 			="";
	Шаблон 							="ВЫБРАТЬ Док.ДатаФактическогоСобытия ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	
	ВозможныеТипы 					= Метаданные.Документы.энргПерерасчет.ТабличныеЧасти.ДокументыОснования.Реквизиты.Документ.Тип.типы();
	ГлавСчетчик 					= 0; 
	для Каждого Тип из ВозможныеТипы цикл
		Если Не ИсключаемыеТипы.Найти(Тип) = Неопределено ТОгда
			Продолжить;
		КонецЕсли;
		МетадДок 					= Метаданные.НайтиПоТипу(Тип);
		ИмяДок  					= МетадДок.имя;
		Если ГлавСчетчик> 0 тогда	
				ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
		КонецЕсли;

		ТекстВложенногоЗапроса 	= ТекстВложенногоЗапроса + СтрЗаменить(Шаблон,"%%ИмяДокумента%%",ИмяДок);
		ГлавСчетчик 			= ГлавСчетчик + 1;
	КонецЦикла;
	
	// ТекстВложенногоЗапроса 			= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ " +Символы.ПС + " ВЫБРАТЬ энргДатаНачалаВеденияУчета.Значение  ИЗ Константа.энргДатаНачалаВеденияУчета КАК энргДатаНачалаВеденияУчета ГДЕ энргДатаНачалаВеденияУчета.Значение > ДАТАВРЕМЯ(1, 1, 1)";
	
	Текст 							= СтрЗаменить(Текст,"%%ТекстВложенногоЗапроса%%",ТекстВложенногоЗапроса);
	Запрос 							= Новый Запрос;
	Запрос.Текст 					=Текст;
	Запрос.УстановитьПараметр("МассивСсылок",Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ"));
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Выборка.Следующий();
	
	НачПерНачисления 				= энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Выборка.ДатаФакт,Объект.Организация);
	Объект.НачПериода 				= НачПерНачисления;
	Объект.КонПериода 				= НачалоМесяца(Объект.ПериодНачисления-1);
	УстановитьПредсталениеПериода();	
	энргНачисления.ДанныеПерерасчета(Объект.Организация,Объект.Район,Объект.МКД,Объект.Абонент,НачПерНачисления,Объект.ПериодНачисления,Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредсталениеПериода()
	ПредставлениеПериодаРасчета = Формат(Объект.НачПериода,"ДФ='ММММ гггг'") + " - " + Формат(Объект.КонПериода,"ДФ='ММММ гггг'");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

