#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если не ЗначениеЗаполнено(Путь) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните реквизит ""Путь""");
		Возврат;
	КонецЕсли;
	
	Попытка
		ДвоичныеДанные 	= Новый ДвоичныеДанные(Путь);
		Адрес			= ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	Исключение 			
		ОписаниеОшибки  = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		Возврат;
	КонецПопытки;

	ЗагрузитьНаСервере(Адрес);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере(Адрес)	
	
	Элементы.ДокументыКИмпортуСуммаДокумента.ТекстПодвала = ДокументыКИмпорту.Итог("СуммаДокумента");
	Возврат;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	ЗаписьЖурналаРегистрации("Создание документов оплаты",УровеньЖурналаРегистрации.Информация,
	,,"Начало создания документов");
	
КонецПроцедуры

#КонецОбласти