#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет действующие точки точки по формуле.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующиеТочкиТочкиПоФормуле(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	 	
	ЕстьДействующиеТочки 			= Ложь;
	Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
		Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочки" Тогда
			ЕстьДействующиеТочки 	= Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если Не ЕстьДействующиеТочки Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеТочкиТочкиПоФормуле());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 										= ОператорВыбора.Отбор;		
		ДоступныеПараметры 							= "Организация, Район, КлючПомещения, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующиеТочкиТочкиПоФормуле()
	
	Текст  =
		"ВЫБРАТЬ
		|	энргРасчетныеСпособыТочекУчетаСрезПоследних.Регистратор КАК Регистратор,
		|	энргРасчетныеСпособыТочекУчетаСрезПоследних.Район КАК Район,
		|	энргРасчетныеСпособыТочекУчетаСрезПоследних.Организация КАК Организация,
		|	энргРасчетныеСпособыТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргРасчетныеСпособыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	энргРасчетныеСпособыТочекУчетаСрезПоследних.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда
		|ИЗ
		|	РегистрСведений.энргРасчетныеСпособыТочекУчета.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения, ТочкаУчета) В
		|				(ВЫБРАТЬ
		|					ДействующиеТочки.Организация,
		|					ДействующиеТочки.Район,
		|					ДействующиеТочки.КлючПомещения,
		|					ДействующиеТочки.ТочкаУчета
		|				ИЗ
		|					ДействующиеТочки КАК ДействующиеТочки)) КАК энргРасчетныеСпособыТочекУчетаСрезПоследних
		|ГДЕ
		|	энргРасчетныеСпособыТочекУчетаСрезПоследних.РасчетныйСпособ";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли