#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.ЕстьПодэтапы Тогда
		Для каждого СтрокаТЧ Из Объект.Подэтапы Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Подэтап)  Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Подэтап""", ,"Подэтапы[" + (СтрокаТЧ.НомерСтроки-1) + "].Подэтап", "Объект");				
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ЕстьПодэтапыПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПодэтапыПриИзменении(Элемент)
	ОбновитьПорядок();
КонецПроцедуры

&НаКлиенте
Процедура ПодэтапыПараллельноПриИзменении(Элемент)
	ОбновитьПорядок();
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеМетоды

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Подэтапы.Видимость = Объект.ЕстьПодэтапы;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьПорядок()
	Сч = 0;
	Для каждого СтрокаТЗ Из Объект.Подэтапы Цикл
		Если Сч = 0 Или Не СтрокаТЗ.Параллельно Тогда
			Сч = Сч + 1;
		КонецЕсли;
		
		СтрокаТЗ.Порядок = Сч;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти




