#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
			
	МКДОткрыт 		= Истина;

	Если НЕ ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор тогда		
		Строение 		= ДополнительныеСвойства.ДанныеСтроения.Строение;
		МКДОткрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Момент,Район,Строение,Организация);			
	КонецЕсли;
	
	Если не МКДОткрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " мкд закрыт");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
		
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеТочекУчета = ПолучитьДанныеТочекУчета();
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,				Движения.бестСтруктураСетиТочекУчетаНП);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеТочекУчета()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", 		Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Регистратор", 		Ссылка);
	Запрос.УстановитьПараметр("Период", 			?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.СтруктураСети КАК СтруктураСети,
	               |	&Регистратор КАК Регистратор,
	               |	&Организация КАК Организация,
	               |	&Район КАК Район,
	               |	&Период КАК Период,
	               |	&ПериодНачисления КАК ПериодНачисления,
	               |	&ПериодРегистрации КАК ПериодРегистрации,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.ТочкаУчета КАК ТочкаУчета,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.Строение КАК Строение
	               |ИЗ
	               |	Документ.энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСети.Строения КАК энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения
	               |ГДЕ
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.Ссылка = &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.СтруктураСети,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.ТочкаУчета,
	               |	энргИзменениеПривязкиТочкиУчетаСтроенияКСтруктуреСетиСтроения.Строение";

	Результат = Запрос.Выполнить();
	
	Возврат Результат; 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли