#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый()); 
	
	Если ЗначениеЗаполнено(ИНН) И Не Справочники.энргКонтрагенты.ПроверитьИНННаУникальность(Ссылка, ИНН, КПП) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Контрагент с таким ИНН уже существует, проверьте правильность ИНН или используйте для работы существующего контрагента.");
		Возврат;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли