#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры = Неопределено) Экспорт
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 Булево - Ложь, функция не работает.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Ложь;	  	
		
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестОперацияСПриборомУчетаНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестОперацияСПриборомУчетаНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестОперацияСПриборомУчетаНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	

		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестОперацияСПриборомУчетаНП");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТабличныеЧастиДляАктаВывода(Объект, ИспользоватьТарифныеЗоны = Неопределено, ИспользоватьШкалыПриборовУчета = Неопределено) Экспорт

	Если ИспользоватьТарифныеЗоны = Неопределено Тогда
		ИспользоватьТарифныеЗоны = ПолучитьФункциональнуюОпцию("бестИспользоватьТарифныеЗоны");
	КонецЕсли;
	Если ИспользоватьШкалыПриборовУчета = Неопределено Тогда
		ИспользоватьШкалыПриборовУчета = ПолучитьФункциональнуюОпцию("бестИспользоватьШкалыПриборовУчета");
	КонецЕсли;

	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	
	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район,Объект.ОбъектРасчета); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета или НЕ ТекПрибор = Выборка.ПриборУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Шкала) И (НоваяТочка Или НЕ ТекШкала = Выборка.Шкала) Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекШкала 								= Выборка.Шкала;
		ТекПрибор 								= Выборка.ПриборУчета;
	КонецЦикла;
	
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);


КонецПроцедуры

Процедура ЗаполнитьТабличныеЧастиДляАктаЗамены(Объект, ИспользоватьТарифныеЗоны = Неопределено, ИспользоватьШкалыПриборовУчета = Неопределено) Экспорт

	Если ИспользоватьТарифныеЗоны = Неопределено Тогда
		ИспользоватьТарифныеЗоны = ПолучитьФункциональнуюОпцию("бестИспользоватьТарифныеЗоны");
	КонецЕсли;
	Если ИспользоватьШкалыПриборовУчета = Неопределено Тогда
		ИспользоватьШкалыПриборовУчета = ПолучитьФункциональнуюОпцию("бестИспользоватьШкалыПриборовУчета");
	КонецЕсли;

	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыИзмерителей.Очистить();
	Объект.Измерители.Очистить();
	Объект.НомераПломб.Очистить();
	Объект.ЗначенияИзмерителей.Очистить();
	Объект.Потери.Очистить();
	
	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчетаСИзмерителями(Объект.Дата,Объект.Организация,Объект.Район,Объект.ОбъектРасчета); 
	РезультатТУ									= Результат[Результат.Количество()-2];
	РезультатИзмерители							= Результат[Результат.Количество()-1].Выгрузить();
	Выборка  									= РезультатТУ.выбрать();
	ТекШкала 									= Неопределено;
	ТекТочкаУчета 								= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			СтрокаТочкиУчета  								= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 									= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 						= IDСтрокиТочки;
			СтрокаТочкиУчета.ПриборУчета 					= Выборка.ПриборУчетаВывод;
			СтрокаИзмерителя 								= Объект.Измерители.Добавить();
			СтрокаИзмерителя.IDСтрокиТочкиУчета 			= IDСтрокиТочки;
			СтрокаИзмерителя.ПриборУчета 					= Выборка.ПриборУчетаВывод;
			СтрокаИзмерителя.ТипИзмерителя 					= Выборка.ТипИзмерителя;
			СтрокаИзмерителя.РасположениеИзмерителя 		= Выборка.РасположениеИзмерителя;
			СтрокаИзмерителя.ВспомогательноеОборудование 	= Ложь;
			Отбор = Новый Структура();
			Отбор.Вставить("ТочкаУчета", Выборка.ТочкаУчета);
			СтрокиИзмерителей 								= РезультатИзмерители.НайтиСтроки(Отбор);
			Для каждого стр из СтрокиИзмерителей Цикл
				СтрокаИзмерителя 							= Объект.Измерители.Добавить();
				СтрокаИзмерителя.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				ЗаполнитьЗначенияСвойств(СтрокаИзмерителя,стр);
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Шкала) И (ТекШкала <> Выборка.Шкала ИЛИ ТекТочкаУчета <> Выборка.ТочкаУчета) Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			СтрокаШкалы.Вывод 					= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ТарифнаяЗона) Тогда
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
			СтрокаПоказаний.Вывод 					= Истина;
		КонецЕсли;
		
		ТекШкала 								= Выборка.Шкала;
		ТекТочкаУчета							= Выборка.ТочкаУчета;
	КонецЦикла;
	
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь,Истина);
	
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);


КонецПроцедуры

#КонецОбласти

#КонецЕсли