#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ Тогда	 
		ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", Ложь);   
	КонецЕсли;   

	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия),Ссылка), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= Новый Граница(МоментВремени(),ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	
	ПриборыВыведены = истина;
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВводПУ тогда
		ПриборыВыведены = бестРаботаСприборамиУчетаСервер.ПриборыВыведены(Новый Структура("МоментВремени,Организация,Район,ОбъектРасчета,МассивТочекУчета",Момент,Организация,Район,ОбъектРасчета,ТочкиУчета.ВыгрузитьКолонку("ТочкаУчета"))); 
	КонецЕсли;
	
	Если  Не ПриборыВыведены Тогда 
		Отказ			= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " приборы учета уже введены");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВводПУ Тогда
		
		Если не СоставУзлаКорректен() тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ОперацииСВводомПУ();		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВыводПУ Тогда		
		ОперацииСВыводомПУ(); 		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ Тогда				
		ОперацииСЗаменойПУ();
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ Тогда				
		ОперацииСЗаменойВспомогательногоПУ();
	КонецЕсли;		
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВыводПУ Тогда
		Документы.бестОперацияСПриборомУчетаНП.ЗаполнитьТабличныеЧастиДляАктаВывода(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВВОД_ПУ

Процедура ОперацииСВводомПУ()	
	
	Пакет = ПолучитьДанныеТЧ();
	ВТ_УзлыВРСПриборыТочек			= Пакет[0];
	ДанныеПриборовТУ				= Пакет[1];
	ДанныеПоказанийПриборовУчета	= Пакет[2];
	ДанныеПоШкаламПУ			 	= Пакет[3];
	ДанныеУзловУчета				= Пакет[4];
	ДанныеПриборовУзловУчета		= Пакет[5];
	ДанныеПараметрыИзмерителей		= Пакет[6];
	ДанныеКоМУчета					= Пакет[7];
	ДанныеНомераПломб				= Пакет[8];
	
		
	//// Узлы учета
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ВТ_УзлыВРСПриборыТочек,	Движения.бестПриборыТочекУчетаНП);	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеУзловУчета,			Движения.бестСостояниеПриборовУчетаНП);
	
	// приборы точек учета
	
	
	//энргРаботаСприборамиУчетаСервер.СброситьРасчетПоФормуле(Движения,ДанныеШапки);
	
	// показания приборов учета 
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоШкаламПУ,				Движения.бестВидыДифференцированностиПриборовУчетаНП);

	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,				Движения.бестКоэффциентыПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,				Движения.бестДатыПоверкиПрибораУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеКоМУчета,				Движения.бестДопускПриборовУчетаККоммерческомуУчету);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовУзловУчета,		Движения.бестПриборыУзловУчетаНП);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПараметрыИзмерителей,	Движения.бестПараметрыИзмерителей);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеНомераПломб,				Движения.бестНомерПломбПриборовУчетаНП);
	
	
КонецПроцедуры

Функция ПолучитьДанныеТЧ()  	
	
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),ДатаФактическогоСобытия,Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);
	Запрос.УстановитьПараметр("ПериодИскл",			Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	
	Запрос.Текст = ВернутьТекстЗапросаВвода();
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 	
КонецФункции 

Функция ВернутьТекстЗапросаВвода()
	
	Текст = "ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаПриборовУчета.IDСтроки КАК IDСтроки,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаПриборовУчета.НомерПломбы КАК НомерПломбы,
	        |	ТаблицаПриборовУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	        |	ТаблицаПриборовУчета.КоэффициентПУ КАК Коэффициент,
	        |	ТаблицаПриборовУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ТаблицаПриборовУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	ТаблицаПриборовУчета.ДатаПоверкиСчетчика КАК ДатаПоверки,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	        |	ТаблицаПриборовУчета.ПриборУчета.ТипУзлаУчета КАК ТипУзлаУчета
	        |ПОМЕСТИТЬ ВТ_ТУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |ГДЕ
	        |	ТаблицаПриборовУчета.Ссылка = &ссылка
	        |	И НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаПриборовУчета.IDСтроки КАК IDСтроки,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ПриборУчета КАК ПриборУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.НомерПломбы КАК НомерПломбы,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	        |	бестОперацияСПриборомУчетаНПИзмерители.КоэффициентПУ КАК Коэффициент,
	        |	ТаблицаПриборовУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ТаблицаПриборовУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ДатаПоверкиСчетчика КАК ДатаПоверки,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК УзелУчета,
	        |	ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	        |	бестОперацияСПриборомУчетаНПИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
	        |	бестОперацияСПриборомУчетаНПИзмерители.IDСтроки КАК IDСтрокиИзмерителя
	        |ПОМЕСТИТЬ ВТ_ПУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.Измерители КАК бестОперацияСПриборомУчетаНПИзмерители
	        |		ПО ТаблицаПриборовУчета.Ссылка = бестОперацияСПриборомУчетаНПИзмерители.Ссылка
	        |			И ТаблицаПриборовУчета.IDСтроки = бестОперацияСПриборомУчетаНПИзмерители.IDСтрокиТочкиУчета
	        |			И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
	        |			И (бестОперацияСПриборомУчетаНПИзмерители.Ссылка = &Ссылка)
	        |			И (НЕ бестОперацияСПриборомУчетаНПИзмерители.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	        |	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) КАК ПричинаОтклонения,
	        |	ЛОЖЬ КАК КС,
	        |	ЛОЖЬ КАК Переворот,
	        |	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	        |	ШкалыПриборовУчета.Шкала КАК Шкала
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ШкалыПриборовУчета
	        |		ПО (ШкалыПриборовУчета.Ссылка = &ссылка)
	        |			И ВТ_ТУ.IDСтроки = ШкалыПриборовУчета.IDСтрокиТочкиУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	        |		ПО ВТ_ТУ.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтрокиТочкиУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаШкалыПриборов.Шкала КАК Шкала,
	        |	ВЫБОР
	        |		КОГДА ТаблицаШкалыПриборов.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	        |			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	        |		ИНАЧЕ ТаблицаШкалыПриборов.ВидДифференцированности
	        |	КОНЕЦ КАК ВидДифференцированности,
	        |	ВТ_ТУ.Период КАК Период
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ТаблицаШкалыПриборов
	        |		ПО (ТаблицаШкалыПриборов.Ссылка = &Ссылка)
	        |			И (ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	        |			И ВТ_ТУ.IDСтроки = ТаблицаШкалыПриборов.IDСтрокиТочкиУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Период КАК Период,
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ТУ.IDСтроки КАК IDСтроки,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.МКД КАК МКД,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ТУ.Состояние КАК Состояние,
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние КАК СостояниеУзла,
	        |	ВТ_ТУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ВТ_ТУ.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	ВТ_ТУ.МКД КАК МКД1
	        |ПОМЕСТИТЬ ВТ_УзлыДляВключения
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	        |				&ПериодИскл,
	        |				Организация = &Организация
	        |					И Район = &Район
	        |					И (ОбъектРасчета, ТочкаУчета, ПриборУчета) В
	        |						(ВЫБРАТЬ
	        |							ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |							ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |							ВТ_ТУ.ПриборУчета КАК ПриборУчета
	        |						ИЗ
	        |							ВТ_ТУ КАК ВТ_ТУ)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	        |		ПО ВТ_ТУ.ОбъектРасчета = бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета
	        |			И ВТ_ТУ.ТочкаУчета = бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета
	        |			И ВТ_ТУ.ПриборУчета = бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета
	        |ГДЕ
	        |	(бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета ЕСТЬ NULL
	        |			ИЛИ бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	        |	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ПУ.УзелУчета КАК УзелУчета,
	        |	ВТ_ПУ.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ПУ.РасположениеИзмерителя КАК РасположениеИзмерителя,
	        |	ВТ_ПУ.Ссылка КАК Ссылка,
	        |	ВТ_ПУ.МКД КАК МКД
	        |ПОМЕСТИТЬ ВТ_ПУДляВкл
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |ГДЕ
	        |	ВТ_ПУ.ПриборУчета <> ВТ_ПУ.УзелУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.ПриборУчета КАК Измеритель,
	        |	ТаблицаШкал.ВидПараметра КАК ВидПараметра,
	        |	ВТ_ТУ.Период КАК Период,
	        |	ТаблицаШкал.Шкала КАК Шкала,
	        |	ТаблицаШкал.ТипТемпературы КАК ТипТемпературы
	        |ПОМЕСТИТЬ ВТ_ПараметрыИзмерителей
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ТаблицаШкал
	        |		ПО (ТаблицаШкал.ВидПараметра <> ЗНАЧЕНИЕ(Справочник.бестВидыПараметровИзмерителей.ПустаяСсылка))
	        |			И (ТаблицаШкал.Ссылка = &Ссылка)
	        |			И ВТ_ТУ.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Период КАК Период,
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ТУ.МКД КАК МКД,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ТУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ВТ_ТУ.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |ГДЕ
	        |	ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.пустаяссылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период КАК Период,
	        |	ВТ_ПУ.Организация КАК Организация,
	        |	ВТ_ПУ.Район КАК Район,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.НомерПломбы КАК НомерПломбы,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.КлючСтроки КАК МестоУстановки,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ДатаУстановкиПломбы КАК ДатаОперацииСПломбой,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ЛицоУстановившееПломбу КАК ОтветственноеЛицо,
			|	бестОперацияСПриборомУчетаНПНомераПломб.ВидПломбы КАК ВидПломбы,
	        |	ИСТИНА КАК Состояние
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.НомераПломб КАК бестОперацияСПриборомУчетаНПНомераПломб
	        |		ПО ВТ_ПУ.Ссылка = бестОперацияСПриборомУчетаНПНомераПломб.Ссылка
	        |			И ВТ_ПУ.IDСтрокиИзмерителя = бестОперацияСПриборомУчетаНПНомераПломб.IDСтрокиИзмерителя";
	
	Возврат Текст
КонецФункции

#КонецОбласти

#Область ВЫВОД_ПУ

Процедура ОперацииСВыводомПУ()
	
	Пакет = ВернутьДанныеВывода();//ПолучитьДанныеТЧ("Вывод");  	
	ДанныеПриборовТУ				= Пакет[1];
	ДанныеПоказанийПриборовУчета	= Пакет[2];
	ДанныеУзловТУ					= Пакет[4];
	
	//Узлы
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеУзловТУ,				Движения.бестСостояниеПриборовУчетаНП);
	
	//Приборы
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,				Движения.бестВыводПриборовУчетаНП);
	
	//энргРаботаСприборамиУчетаСервер.ЗаписатьДанныеВывода(ДанныеШапки,Движения,"ПриборыУчетаВывод",СоотвествиеКолонок);
КонецПроцедуры

Функция ВернутьДанныеВывода()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);  	
	
	Текст = "ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ВЫБОР
	        |		КОГДА ТаблицаПриборовУчета.УзелУчета ЕСТЬ NULL
	        |				ИЛИ ТаблицаПриборовУчета.УзелУчета = ЗНАЧЕНИЕ(справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	        |			ТОГДА ТаблицаПриборовУчета.ПриборУчета
	        |		ИНАЧЕ ТаблицаПриборовУчета.УзелУчета
	        |	КОНЕЦ КАК ПриборУчета,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
	        |	ВЫБОР
	        |		КОГДА ТаблицаПриборовУчета.УзелУчета ЕСТЬ NULL
	        |				ИЛИ ТаблицаПриборовУчета.УзелУчета = ЗНАЧЕНИЕ(справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	        |			ТОГДА ТаблицаПриборовУчета.ПриборУчета.ТипУзлаУчета
	        |		ИНАЧЕ ТаблицаПриборовУчета.УзелУчета.ТипУзлаУчета
	        |	КОНЕЦ КАК ТипУзлаУчета,
	        |	ТаблицаПриборовУчета.ПриборУчета.ТипУзлаУчета КАК ПриборУчетаТипУзлаУчета
	        |ПОМЕСТИТЬ ВТ_ТУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |ГДЕ
	        |	ТаблицаПриборовУчета.Ссылка = &ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаПриборовУчета.IDСтроки КАК IDСтроки,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаПриборовУчета.ПриборУчета.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК УзелУчета,
	        |	ТаблицаПриборовУчета.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ПУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |ГДЕ
	        |	ТаблицаПриборовУчета.Ссылка = &Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	        |	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	        |	ТаблицаПоказанийПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	        |	ЛОЖЬ КАК КС,
	        |	ТаблицаПоказанийПриборовУчета.Переворот КАК Переворот,
	        |	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	        |	ШкалыПриборовУчета.Шкала КАК Шкала,
	        |	ТаблицаТочкиУчета.УзелУчета КАК УзелУчета
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаТочкиУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ШкалыПриборовУчета
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	        |			ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	        |				И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	        |				И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
	        |				И (НЕ ТаблицаПоказанийПриборовУчета.ТекущиеПоказания = 0)
	        |		ПО ТаблицаТочкиУчета.Ссылка = ШкалыПриборовУчета.Ссылка
	        |			И ТаблицаТочкиУчета.IDСтроки = ШкалыПриборовУчета.IDСтрокиТочкиУчета
	        |			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
	        |			И (ШкалыПриборовУчета.Ссылка = &Ссылка)
	        |ГДЕ
	        |	ТаблицаТочкиУчета.Ссылка = &Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	энргТипыУзловУчетаСоставУзла.ТипИзмерителя КАК ТипИзмерителя,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета
	        |ПОМЕСТИТЬ ВТ_СоставУзла
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыУзловУчета.СоставУзла КАК энргТипыУзловУчетаСоставУзла
	        |		ПО ВТ_ТУ.ТипУзлаУчета = энргТипыУзловУчетаСоставУзла.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Период КАК Период,
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.МКД КАК МКД,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ТУ.Состояние КАК Состояние,
	        |	ВТ_ТУ.ТипУзлаУчета КАК ТипУзлаУчета
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |			ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
	        |			ВТ_ПУ.УзелУчета КАК УзелУчета
	        |		ИЗ
	        |			ВТ_ПУ КАК ВТ_ПУ
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоставУзла КАК ВТ_СоставУзла
	        |				ПО ВТ_ПУ.ОбъектРасчета = ВТ_СоставУзла.ОбъектРасчета
	        |					И ВТ_ПУ.ТочкаУчета = ВТ_СоставУзла.ТочкаУчета
	        |					И ВТ_ПУ.УзелУчета = ВТ_СоставУзла.ПриборУчета
	        |					И ВТ_ПУ.ТипИзмерителя = ВТ_СоставУзла.ТипИзмерителя
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ВТ_ПУ.ТочкаУчета,
	        |			ВТ_ПУ.ОбъектРасчета,
	        |			ВТ_ПУ.УзелУчета) КАК ВложенныйЗапрос
	        |		ПО ВТ_ТУ.ОбъектРасчета = ВложенныйЗапрос.ОбъектРасчета
	        |			И ВТ_ТУ.ТочкаУчета = ВложенныйЗапрос.ТочкаУчета
	        |			И ВТ_ТУ.ПриборУчета = ВложенныйЗапрос.УзелУчета";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();
КонецФункции

#КонецОбласти

#Область ЗАМЕНА_ПУ

Процедура ОперацииСЗаменойПУ()	
	
	Пакет = ПолучитьДанныеЗамены();
	ДанныеПриборовТУ				= Пакет[0];
	
	ДанныеПриборовТУСостояние		= Пакет[2];
	ДанныеИзмерителей				= Пакет[3];
	ДанныеСостояниеИзмерителей		= Пакет[4];
	ДанныеПоказанийПриборовУчета	= Пакет[5];
	ДанныеВидаДифференцированности	= Пакет[6];
	ДанныеКомУчета					= Пакет[7];
	ДанныеНомераПломб				= Пакет[8];
	
	
	
	СоотвествиеКолонок = Новый Структура;
	СоотвествиеКолонок.Вставить("ПриборУчета", "ПриборУчетаВывод");
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,				Движения.бестВыводПриборовУчетаНП, СоотвествиеКолонок);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,				Движения.бестПриборыТочекУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУСостояние,		Движения.бестСостояниеПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеИзмерителей,				Движения.бестДатыПоверкиПрибораУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеИзмерителей,				Движения.бестКоэффциентыПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеНомераПломб,				Движения.бестНомерПломбПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеКомУчета,				Движения.бестДопускПриборовУчетаККоммерческомуУчету);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеСостояниеИзмерителей,	Движения.бестПриборыУзловУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеВидаДифференцированности,Движения.бестВидыДифференцированностиПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеВидаДифференцированности,Движения.бестПараметрыИзмерителей);
КонецПроцедуры

Функция ПолучитьДанныеЗамены()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия,Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);  	
	Текст 		= ВернутьТекстЗапросаЗамена(); 	
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();
КонецФункции

Функция ВернутьТекстЗапросаЗамена()
	
	Текст = "ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаПриборовУчета.IDСтроки КАК IDСтроки,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	        |	ТаблицаПриборовУчета.ПриборУчета.ТипУзлаУчета КАК ТипУзлаУчета,
	        |	ТаблицаПриборовУчета.ПриборУчетаВывод КАК ПриборУчетаВывод,
	        |	ТаблицаПриборовУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ТаблицаПриборовУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
	        |ПОМЕСТИТЬ ВТ_ТУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |ГДЕ
	        |	ТаблицаПриборовУчета.Ссылка = &ссылка
	        |	И НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	        |	И ТаблицаПриборовУчета.ПриборУчета <> ТаблицаПриборовУчета.ПриборУчетаВывод
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаПриборовУчета.IDСтроки КАК IDСтроки,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ПриборУчета КАК ПриборУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.НомерПломбы КАК НомерПломбы,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	        |	бестОперацияСПриборомУчетаНПИзмерители.КоэффициентПУ КАК Коэффициент,
	        |	ТаблицаПриборовУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ТаблицаПриборовУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ДатаПоверкиСчетчика КАК ДатаПоверки,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК УзелУчета,
	        |	ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	        |	бестОперацияСПриборомУчетаНПИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
	        |	бестОперацияСПриборомУчетаНПИзмерители.Вывод КАК Вывод,
	        |	бестОперацияСПриборомУчетаНПИзмерители.Ввод КАК Ввод,
	        |	ТаблицаПриборовУчета.ПриборУчетаВывод КАК УзелВывод,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ТипИзмерителя КАК ТипИзмерителя,
	        |	бестОперацияСПриборомУчетаНПИзмерители.IDСтроки КАК IDСтрокиИзмерителя
	        |ПОМЕСТИТЬ ВТ_ПУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.Измерители КАК бестОперацияСПриборомУчетаНПИзмерители
	        |		ПО ТаблицаПриборовУчета.Ссылка = бестОперацияСПриборомУчетаНПИзмерители.Ссылка
	        |			И ТаблицаПриборовУчета.IDСтроки = бестОперацияСПриборомУчетаНПИзмерители.IDСтрокиТочкиУчета
	        |			И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
	        |			И (бестОперацияСПриборомУчетаНПИзмерители.Ссылка = &Ссылка)
	        |			И (НЕ бестОперацияСПриборомУчетаНПИзмерители.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Период КАК Период,
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ТУ.МКД КАК МКД,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчетаВывод КАК ПриборУчета,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Период,
	        |	ВТ_ТУ.Организация,
	        |	ВТ_ТУ.Район,
	        |	ВТ_ТУ.ОбъектРасчета,
	        |	ВТ_ТУ.ПериодРегистрации,
	        |	ВТ_ТУ.ПериодНачисления,
	        |	ВТ_ТУ.МКД,
	        |	ВТ_ТУ.ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета,
	        |	ВТ_ТУ.Состояние
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период КАК Период,
	        |	ВТ_ПУ.Организация КАК Организация,
	        |	ВТ_ПУ.Район КАК Район,
	        |	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ПУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ПУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ПУ.IDСтроки КАК IDСтроки,
	        |	ВТ_ПУ.МКД КАК МКД,
	        |	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ПУ.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВТ_ПУ.НомерПломбы КАК НомерПломбы,
	        |	ВТ_ПУ.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	        |	ВТ_ПУ.Коэффициент КАК Коэффициент,
	        |	ВТ_ПУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ВТ_ПУ.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	ВТ_ПУ.ДатаПоверки КАК ДатаПоверки,
	        |	ВТ_ПУ.Состояние КАК Состояние,
	        |	ВТ_ПУ.УзелУчета КАК УзелУчета,
	        |	ВТ_ПУ.Ссылка КАК Ссылка,
	        |	ВТ_ПУ.РасположениеИзмерителя КАК РасположениеИзмерителя,
	        |	ВТ_ПУ.ТипИзмерителя КАК ТипИзмерителя,
	        |	ВТ_ПУ.IDСтрокиИзмерителя КАК IDСтрокиИзмерителя
	        |ПОМЕСТИТЬ ВТ_ВведенныеИзмерители
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА ВТ_ПУ.УзелВывод = ВТ_ПУ.УзелУчета
	        |				ТОГДА ВТ_ПУ.Ввод
	        |			ИНАЧЕ НЕ ВТ_ПУ.Вывод
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период КАК Период,
	        |	ВТ_ПУ.Организация КАК Организация,
	        |	ВТ_ПУ.Район КАК Район,
	        |	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ПУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ПУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ПУ.МКД КАК МКД,
	        |	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
	        |	ВТ_ПУ.УзелВывод КАК УзелУчета,
	        |	ВТ_ПУ.ТипИзмерителя КАК ТипИзмерителя
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА ВТ_ПУ.УзелВывод = ВТ_ПУ.УзелУчета
	        |				ТОГДА ВТ_ПУ.Вывод
	        |			ИНАЧЕ НЕ ВТ_ПУ.Ввод
	        |		КОНЕЦ
			|	И НЕ ВТ_ПУ.УзелВывод = ВТ_ПУ.ПриборУчета
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ВведенныеИзмерители.Период,
	        |	ВТ_ВведенныеИзмерители.Организация,
	        |	ВТ_ВведенныеИзмерители.Район,
	        |	ВТ_ВведенныеИзмерители.ОбъектРасчета,
	        |	ВТ_ВведенныеИзмерители.ПериодРегистрации,
	        |	ВТ_ВведенныеИзмерители.ПериодНачисления,
	        |	ВТ_ВведенныеИзмерители.МКД,
	        |	ВТ_ВведенныеИзмерители.ТочкаУчета,
	        |	ВТ_ВведенныеИзмерители.ПриборУчета,
	        |	ВТ_ВведенныеИзмерители.Состояние,
	        |	ВТ_ВведенныеИзмерители.УзелУчета,
	        |	ВТ_ВведенныеИзмерители.ТипИзмерителя
	        |ИЗ
	        |	ВТ_ВведенныеИзмерители КАК ВТ_ВведенныеИзмерители
	        |ГДЕ
	        |	НЕ ВТ_ВведенныеИзмерители.УзелУчета = ВТ_ВведенныеИзмерители.ПриборУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчетаВывод КАК ПриборУчета,
	        |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	        |	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	        |	ТаблицаПоказанийПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	        |	ЛОЖЬ КАК КС,
	        |	ЛОЖЬ КАК Переворот,
	        |	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	        |	ШкалыПриборовУчета.Шкала КАК Шкала
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ШкалыПриборовУчета
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	        |			ПО ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	        |				И ШкалыПриборовУчета.IDСтрокиТочкиУчета = ТаблицаПоказанийПриборовУчета.IDСтрокиТочкиУчета
	        |				И ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	        |		ПО (ШкалыПриборовУчета.Ссылка = &ссылка)
	        |			И ВТ_ТУ.IDСтроки = ШкалыПриборовУчета.IDСтрокиТочкиУчета
	        |ГДЕ
	        |	ШкалыПриборовУчета.Вывод
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	&Район,
	        |	&ОбъектРасчета,
	        |	&ПериодРегистрации,
	        |	&ПериодНачисления,
	        |	ВТ_ТУ.ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета,
	        |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона,
	        |	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты),
	        |	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка),
	        |	ЛОЖЬ,
	        |	ЛОЖЬ,
	        |	ТаблицаПоказанийПриборовУчета.НомерСтроки,
	        |	ШкалыПриборовУчета.Шкала
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ШкалыПриборовУчета
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	        |			ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	        |				И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	        |				И ШкалыПриборовУчета.IDСтрокиТочкиУчета = ТаблицаПоказанийПриборовУчета.IDСтрокиТочкиУчета
	        |		ПО (ШкалыПриборовУчета.Ссылка = &ссылка)
	        |			И ВТ_ТУ.IDСтроки = ШкалыПриборовУчета.IDСтрокиТочкиУчета
	        |ГДЕ
	        |	НЕ ШкалыПриборовУчета.Вывод
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаШкалыПриборов.Шкала КАК Шкала,
	        |	ВЫБОР
	        |		КОГДА ТаблицаШкалыПриборов.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	        |			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	        |		ИНАЧЕ ТаблицаШкалыПриборов.ВидДифференцированности
	        |	КОНЕЦ КАК ВидДифференцированности,
	        |	ВТ_ТУ.Период КАК Период,
	        |	ТаблицаШкалыПриборов.ВидПараметра КАК ВидПараметра,
	        |	ТаблицаШкалыПриборов.ТипТемпературы КАК ТипТемпературы,
	        |	ВТ_ТУ.ПриборУчета КАК Измеритель
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ТаблицаШкалыПриборов
	        |		ПО (ТаблицаШкалыПриборов.Ссылка = &Ссылка)
	        |			И (ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	        |			И ВТ_ТУ.IDСтроки = ТаблицаШкалыПриборов.IDСтрокиТочкиУчета
	        |			И (НЕ ТаблицаШкалыПриборов.Вывод)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Период КАК Период,
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ТУ.МКД КАК МКД,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ТУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ВТ_ТУ.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |ГДЕ
	        |	ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.пустаяссылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период КАК Период,
	        |	ВТ_ПУ.Организация КАК Организация,
	        |	ВТ_ПУ.Район КАК Район,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.НомерПломбы КАК НомерПломбы,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.КлючСтроки КАК МестоУстановки,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ДатаУстановкиПломбы КАК ДатаОперацииСПломбой,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ЛицоУстановившееПломбу КАК ОтветственноеЛицо,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ВидПломбы КАК ВидПломбы,
	        |	ИСТИНА КАК Состояние
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.НомераПломб КАК бестОперацияСПриборомУчетаНПНомераПломб
	        |		ПО ВТ_ПУ.Ссылка = бестОперацияСПриборомУчетаНПНомераПломб.Ссылка
	        |			И ВТ_ПУ.IDСтрокиИзмерителя = бестОперацияСПриборомУчетаНПНомераПломб.IDСтрокиИзмерителя";
	
	Возврат Текст
КонецФункции

#КонецОбласти

#Область ЗАМЕНА_ВСПОМОГАТЕЛЬНОГО_ПУ

Процедура ОперацииСЗаменойВспомогательногоПУ()	
	
	Пакет = ПолучитьДанныеЗаменыВспомогательногоПУ();
	ДанныеПриборовТУ				= Пакет[0];
	
	ДанныеПриборовТУСостояние		= Пакет[1];
	ДанныеИзмерителей				= Пакет[2];
	ДанныеСостояниеИзмерителей		= Пакет[3];
	ДанныеВидаДифференцированности	= Пакет[4];
	ДанныеНомераПломб				= Пакет[5];
	ДанныеКоэффициенты				= Пакет[6];
	
	
	СоотвествиеКолонок = Новый Структура;
	СоотвествиеКолонок.Вставить("ПриборУчета", "ПриборУчетаВывод");
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеИзмерителей,				Движения.бестДатыПоверкиПрибораУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеКоэффициенты,				Движения.бестКоэффциентыПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеНомераПломб,				Движения.бестНомерПломбПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеСостояниеИзмерителей,	Движения.бестПриборыУзловУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеВидаДифференцированности,Движения.бестПараметрыИзмерителей);
КонецПроцедуры

Функция ПолучитьДанныеЗаменыВспомогательногоПУ()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия,Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);  	
	Текст 		= ВернутьТекстЗапросаЗаменаВспомогательногоПУ(); 	
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();
КонецФункции

Функция ВернутьТекстЗапросаЗаменаВспомогательногоПУ()
	
	Текст = "ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаПриборовУчета.IDСтроки КАК IDСтроки,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	        |	ТаблицаПриборовУчета.ПриборУчета.ТипУзлаУчета КАК ТипУзлаУчета,
	        |	ТаблицаПриборовУчета.ПриборУчетаВывод КАК ПриборУчетаВывод,
	        |	ТаблицаПриборовУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ТаблицаПриборовУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета
	        |ПОМЕСТИТЬ ВТ_ТУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |ГДЕ
	        |	ТаблицаПриборовУчета.Ссылка = &ссылка
	        |	И НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	        |	И ТаблицаПриборовУчета.ПриборУчета <> ТаблицаПриборовУчета.ПриборУчетаВывод
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период КАК Период,
	        |	&Организация КАК Организация,
	        |	&Район КАК Район,
	        |	&ОбъектРасчета КАК ОбъектРасчета,
	        |	&ПериодРегистрации КАК ПериодРегистрации,
	        |	&ПериодНачисления КАК ПериодНачисления,
	        |	ТаблицаПриборовУчета.IDСтроки КАК IDСтроки,
	        |	&МКД КАК МКД,
	        |	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ПриборУчета КАК ПриборУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.НомерПломбы КАК НомерПломбы,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	        |	бестОперацияСПриборомУчетаНПИзмерители.КоэффициентПУ КАК Коэффициент,
	        |	ТаблицаПриборовУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ТаблицаПриборовУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ДатаПоверкиСчетчика КАК ДатаПоверки,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	        |	ТаблицаПриборовУчета.ПриборУчета КАК УзелУчета,
	        |	ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	        |	бестОперацияСПриборомУчетаНПИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
	        |	бестОперацияСПриборомУчетаНПИзмерители.Вывод КАК Вывод,
	        |	бестОперацияСПриборомУчетаНПИзмерители.Ввод КАК Ввод,
	        |	ТаблицаПриборовУчета.ПриборУчетаВывод КАК УзелВывод,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ТипИзмерителя КАК ТипИзмерителя,
	        |	бестОперацияСПриборомУчетаНПИзмерители.IDСтроки КАК IDСтрокиИзмерителя,
	        |	бестОперацияСПриборомУчетаНПИзмерители.ВспомогательноеОборудование КАК ВспомогательноеОборудование
	        |ПОМЕСТИТЬ ВТ_ПУ
	        |ИЗ
	        |	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.Измерители КАК бестОперацияСПриборомУчетаНПИзмерители
	        |		ПО ТаблицаПриборовУчета.Ссылка = бестОперацияСПриборомУчетаНПИзмерители.Ссылка
	        |			И ТаблицаПриборовУчета.IDСтроки = бестОперацияСПриборомУчетаНПИзмерители.IDСтрокиТочкиУчета
	        |			И (ТаблицаПриборовУчета.Ссылка = &Ссылка)
	        |			И (бестОперацияСПриборомУчетаНПИзмерители.Ссылка = &Ссылка)
	        |			И (НЕ бестОперацияСПриборомУчетаНПИзмерители.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период КАК Период,
	        |	ВТ_ПУ.Организация КАК Организация,
	        |	ВТ_ПУ.Район КАК Район,
	        |	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ПУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ПУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ПУ.IDСтроки КАК IDСтроки,
	        |	ВТ_ПУ.МКД КАК МКД,
	        |	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ПУ.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВТ_ПУ.НомерПломбы КАК НомерПломбы,
	        |	ВТ_ПУ.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	        |	ВТ_ПУ.Коэффициент КАК Коэффициент,
	        |	ВТ_ПУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ВТ_ПУ.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	ВТ_ПУ.ДатаПоверки КАК ДатаПоверки,
	        |	ВТ_ПУ.Состояние КАК Состояние,
	        |	ВТ_ПУ.УзелУчета КАК УзелУчета,
	        |	ВТ_ПУ.Ссылка КАК Ссылка,
	        |	ВТ_ПУ.РасположениеИзмерителя КАК РасположениеИзмерителя,
	        |	ВТ_ПУ.ТипИзмерителя КАК ТипИзмерителя,
	        |	ВТ_ПУ.IDСтрокиИзмерителя КАК IDСтрокиИзмерителя
	        |ПОМЕСТИТЬ ВТ_ВведенныеИзмерители
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА ВТ_ПУ.УзелВывод = ВТ_ПУ.УзелУчета
	        |				ТОГДА ВТ_ПУ.Ввод
	        |			ИНАЧЕ НЕ ВТ_ПУ.Вывод
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период КАК Период,
	        |	ВТ_ПУ.Организация КАК Организация,
	        |	ВТ_ПУ.Район КАК Район,
	        |	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ПУ.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ПУ.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ПУ.МКД КАК МКД,
	        |	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
	        |	ВТ_ПУ.УзелВывод КАК УзелУчета,
	        |	ВТ_ПУ.ТипИзмерителя КАК ТипИзмерителя
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА ВТ_ПУ.УзелВывод = ВТ_ПУ.УзелУчета
	        |				ТОГДА ВТ_ПУ.Вывод
	        |			ИНАЧЕ НЕ ВТ_ПУ.Ввод
	        |		КОНЕЦ
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ВведенныеИзмерители.Период,
	        |	ВТ_ВведенныеИзмерители.Организация,
	        |	ВТ_ВведенныеИзмерители.Район,
	        |	ВТ_ВведенныеИзмерители.ОбъектРасчета,
	        |	ВТ_ВведенныеИзмерители.ПериодРегистрации,
	        |	ВТ_ВведенныеИзмерители.ПериодНачисления,
	        |	ВТ_ВведенныеИзмерители.МКД,
	        |	ВТ_ВведенныеИзмерители.ТочкаУчета,
	        |	ВТ_ВведенныеИзмерители.ПриборУчета,
	        |	ВТ_ВведенныеИзмерители.Состояние,
	        |	ВТ_ВведенныеИзмерители.УзелУчета,
	        |	ВТ_ВведенныеИзмерители.ТипИзмерителя
	        |ИЗ
	        |	ВТ_ВведенныеИзмерители КАК ВТ_ВведенныеИзмерители
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ТУ.Организация КАК Организация,
	        |	ВТ_ТУ.Район КАК Район,
	        |	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаШкалыПриборов.Шкала КАК Шкала,
	        |	ВЫБОР
	        |		КОГДА ТаблицаШкалыПриборов.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	        |			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	        |		ИНАЧЕ ТаблицаШкалыПриборов.ВидДифференцированности
	        |	КОНЕЦ КАК ВидДифференцированности,
	        |	ВТ_ТУ.Период КАК Период,
	        |	ТаблицаШкалыПриборов.ВидПараметра КАК ВидПараметра,
	        |	ТаблицаШкалыПриборов.ТипТемпературы КАК ТипТемпературы,
	        |	ВТ_ТУ.ПриборУчета КАК Измеритель
	        |ИЗ
	        |	ВТ_ТУ КАК ВТ_ТУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.ШкалыПриборовУчета КАК ТаблицаШкалыПриборов
	        |		ПО (ТаблицаШкалыПриборов.Ссылка = &Ссылка)
	        |			И (ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	        |			И ВТ_ТУ.IDСтроки = ТаблицаШкалыПриборов.IDСтрокиТочкиУчета
	        |			И (НЕ ТаблицаШкалыПриборов.Вывод)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период КАК Период,
	        |	ВТ_ПУ.Организация КАК Организация,
	        |	ВТ_ПУ.Район КАК Район,
	        |	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.НомерПломбы КАК НомерПломбы,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.КлючСтроки КАК МестоУстановки,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ДатаУстановкиПломбы КАК ДатаОперацииСПломбой,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ЛицоУстановившееПломбу КАК ОтветственноеЛицо,
	        |	бестОперацияСПриборомУчетаНПНомераПломб.ВидПломбы КАК ВидПломбы,
	        |	ИСТИНА КАК Состояние
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСПриборомУчетаНП.НомераПломб КАК бестОперацияСПриборомУчетаНПНомераПломб
	        |		ПО ВТ_ПУ.Ссылка = бестОперацияСПриборомУчетаНПНомераПломб.Ссылка
	        |			И ВТ_ПУ.IDСтрокиИзмерителя = бестОперацияСПриборомУчетаНПНомераПломб.IDСтрокиИзмерителя
			|;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ВведенныеИзмерители.Период КАК Период,
	        |	ВТ_ВведенныеИзмерители.Организация КАК Организация,
	        |	ВТ_ВведенныеИзмерители.Район КАК Район,
	        |	ВТ_ВведенныеИзмерители.ОбъектРасчета КАК ОбъектРасчета,
	        |	ВТ_ВведенныеИзмерители.ПериодРегистрации КАК ПериодРегистрации,
	        |	ВТ_ВведенныеИзмерители.ПериодНачисления КАК ПериодНачисления,
	        |	ВТ_ВведенныеИзмерители.IDСтроки КАК IDСтроки,
	        |	ВТ_ВведенныеИзмерители.МКД КАК МКД,
	        |	ВТ_ВведенныеИзмерители.ТочкаУчета КАК ТочкаУчета,
	        |	ВТ_ВведенныеИзмерители.ПриборУчета КАК ПриборУчета,
	        |	ВТ_ВведенныеИзмерители.ТипПрибораУчета КАК ТипПрибораУчета,
	        |	ВТ_ВведенныеИзмерители.НомерПломбы КАК НомерПломбы,
	        |	ВТ_ВведенныеИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	        |	ВТ_ВведенныеИзмерители.Коэффициент КАК Коэффициент,
	        |	ВТ_ВведенныеИзмерители.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	        |	ВТ_ВведенныеИзмерители.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	        |	ВТ_ВведенныеИзмерители.ДатаПоверки КАК ДатаПоверки,
	        |	ВТ_ВведенныеИзмерители.Состояние КАК Состояние,
	        |	ВТ_ВведенныеИзмерители.УзелУчета КАК УзелУчета,
	        |	ВТ_ВведенныеИзмерители.Ссылка КАК Ссылка,
	        |	ВТ_ВведенныеИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
	        |	ВТ_ВведенныеИзмерители.ТипИзмерителя КАК ТипИзмерителя,
	        |	ВТ_ВведенныеИзмерители.IDСтрокиИзмерителя КАК IDСтрокиИзмерителя
	        |ИЗ
	        |	ВТ_ВведенныеИзмерители КАК ВТ_ВведенныеИзмерители
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ПУ.Период,
	        |	ВТ_ПУ.Организация,
	        |	ВТ_ПУ.Район,
	        |	ВТ_ПУ.ОбъектРасчета,
	        |	ВТ_ПУ.ПериодРегистрации,
	        |	ВТ_ПУ.ПериодНачисления,
	        |	ВТ_ПУ.IDСтроки,
	        |	ВТ_ПУ.МКД,
	        |	ВТ_ПУ.ТочкаУчета,
	        |	ВТ_ПУ.ПриборУчета,
	        |	ВТ_ПУ.ТипПрибораУчета,
	        |	ВТ_ПУ.НомерПломбы,
	        |	ВТ_ПУ.ДатаУстановкиПломбы,
	        |	ВТ_ПУ.Коэффициент,
	        |	ВТ_ПУ.НачалоДействияКоммерскогоУчета,
	        |	ВТ_ПУ.КонецПериодаКоммерскогоУчета,
	        |	ВТ_ПУ.ДатаПоверки,
	        |	ВТ_ПУ.Состояние,
	        |	ВТ_ПУ.УзелУчета,
	        |	ВТ_ПУ.Ссылка,
	        |	ВТ_ПУ.РасположениеИзмерителя,
	        |	ВТ_ПУ.ТипИзмерителя,
	        |	ВТ_ПУ.IDСтрокиИзмерителя
	        |ИЗ
	        |	ВТ_ПУ КАК ВТ_ПУ
	        |ГДЕ
	        |	НЕ ВТ_ПУ.ВспомогательноеОборудование";
	
	Возврат Текст
КонецФункции

#КонецОбласти

Функция МассивПриборов() Экспорт 
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ВыводПрибораУчета",	ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВыводПУ);
	
	Если ВидОперации <> Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ тогда 		
		Текст  			= 
		"ВЫБРАТЬ
		|	&ОбъектРасчета КАК ОбъектРасчета,
		|	&МКД КАК МКД,
		|	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
		|ГДЕ
		|	ТаблицаПриборовУчета.Ссылка = &Ссылка";
	иначе
		Текст  			= 
		
		"ВЫБРАТЬ
		|	&ОбъектРасчета КАК ОбъектРасчета,
		|	&МКД КАК МКД,
		|	ТаблицаПриборовУчета.ПриборУчетаВывод КАК ПриборУчета,
		|	ИСТИНА КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
		|ГДЕ
		|	ТаблицаПриборовУчета.Ссылка = &Ссылка
		|	И ТаблицаПриборовУчета.ПриборУчета <> ТаблицаПриборовУчета.ПриборУчетаВывод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ОбъектРасчета,
		|	&МКД,
		|	ТаблицаПриборовУчета.ПриборУчета,
		|	ЛОЖЬ,
		|	""ПоказанияПриборовУчета"",
		|	0
		|ИЗ
		|	Документ.бестОперацияСПриборомУчетаНП.ТочкиУчета КАК ТаблицаПриборовУчета
		|ГДЕ
		|	ТаблицаПриборовУчета.Ссылка = &Ссылка
		|	И ТаблицаПриборовУчета.ПриборУчета <> ТаблицаПриборовУчета.ПриборУчетаВывод";

	КонецЕсли;
	
	Запрос.Текст 	= Текст;
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());	
	
КонецФункции

Функция СоставУзлаКорректен()
	
	Данные = Новый Структура;
	Данные.Вставить("Период",					Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Данные.Вставить("Район",					Район);
	Данные.Вставить("Организация",			    Организация);		 
	Данные.Вставить("Ссылка",					Ссылка);
	
	Возврат энргРаботаСприборамиУчетаСервер.СоставУзлаКорректенНП(Данные);
	 	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВводПУ тогда
		
		Для Каждого СтрокаТЧ из ТочкиУчета цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипУзлаУчета)  Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для услуги " + СтрокаТЧ.НомерСтроки + " не указан тип узла учета",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТипУзлаУчета");				
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаТЧ из ТочкиУчета цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Услуга) и НЕ ЗначениеЗаполнено(СтрокаТЧ.ТочкаУчета) Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Услуга""",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
			КонецЕсли;			
		КонецЦикла;

		Если Не ЗначениеЗаполнено(ТочкиУчета) Тогда
			Отказ = Истина;
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список ""Услуги""", ЭтотОбъект, "ТочкиУчета");
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВыводПУ тогда
		Если Не ЗначениеЗаполнено(ТочкиУчета) Тогда
			Отказ = Истина;
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список ""Услуги""", ЭтотОбъект, "ТочкиУчета");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПоказанияПриборовУчета) Тогда
			Отказ = Истина;
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список ""Показаний""", ЭтотОбъект, "ПоказанияПриборовУчета");
			Возврат;
		КонецЕсли;
		
		//Для каждого СтрокаТЧ из ПоказанияПриборовУчета Цикл
		//	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТекущиеПоказания) Тогда
		//		Отказ 		= истина;
		//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Текущие показания""",ЭтотОбъект,"ПоказанияПриборовУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТекущиеПоказания");				
		//	КонецЕсли;
		//КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли