 
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриСозданииЧтенииНаСервере(Форма, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета, ТекущийОбъект = Неопределено, ИмяТЧ = "ТочкиУчета") Экспорт 
	
	Если ИспользоватьТарифныеЗоны и ИспользоватьШкалыПриборовУчета Тогда
		Форма.ПрефиксТочекУчета 										= "ЕстьШкалыЕстьТарифныеЗоны";
		Форма.ИспользоватьТарифныеЗоны 									= Истина;
		Форма.ИспользоватьШкалыПриборовУчета 							= Истина;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоны.Видимость  	= Истина;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоны.Видимость  		= Ложь;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗон.Видимость  		= Ложь;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗон.Видимость  		= Ложь;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Истина, Истина, ИмяТЧ);
		КонецЕсли;
		
	ИначеЕсли ИспользоватьТарифныеЗоны Тогда
		Форма.ПрефиксТочекУчета 										= "НетШкалЕстьТарифныеЗоны";
		Форма.ИспользоватьТарифныеЗоны 									= Истина;
		Форма.ИспользоватьШкалыПриборовУчета 							= Ложь;		
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоны.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоны.Видимость  		= Истина;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗон.Видимость  		= Ложь;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗон.Видимость  		= Ложь;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Истина, Ложь, ИмяТЧ);
		КонецЕсли;
		
	ИначеЕсли ИспользоватьШкалыПриборовУчета Тогда	
		Форма.ПрефиксТочекУчета 										= "ЕстьШкалыНетТарифныхЗон";
		Форма.ИспользоватьТарифныеЗоны 									= Ложь;
		Форма.ИспользоватьШкалыПриборовУчета 							= Истина;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоны.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоны.Видимость  		= Ложь;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗон.Видимость  		= Истина;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗон.Видимость  		= Ложь;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Ложь, Истина, ИмяТЧ);
		КонецЕсли;
		
	Иначе
		Форма.ПрефиксТочекУчета 										= "НетШкалНетТарифныхЗон";
		Форма.ИспользоватьТарифныеЗоны 									= Ложь;
		Форма.ИспользоватьШкалыПриборовУчета 							= Ложь;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоны.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоны.Видимость  		= Ложь;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗон.Видимость  		= Ложь;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗон.Видимость  		= Истина;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Ложь, Ложь, ИмяТЧ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииЧтенииНаСервереВводВыводПрибораУчета(Форма, ТекущийОбъект = Неопределено, ИмяТЧ = "ТочкиУчета") Экспорт 
	
	Если энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны") и энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета") Тогда
		Форма.ПрефиксТочекУчета 										= "ЕстьШкалыЕстьТарифныеЗоны";
		Форма.ИспользоватьТарифныеЗоны 									= Истина;
		Форма.ИспользоватьШкалыПриборовУчета 							= Истина;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВвод.Видимость 	= Истина;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВывод.Видимость = Истина;
		
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВывод.Видимость  	= Ложь;
		
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВывод.Видимость  	= Ложь;
		
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВывод.Видимость  	= Ложь;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Истина, Истина, ИмяТЧ);
		КонецЕсли;
		
	ИначеЕсли энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны") Тогда
		Форма.ПрефиксТочекУчета 										= "НетШкалЕстьТарифныеЗоны";
		Форма.ИспользоватьТарифныеЗоны 									= Истина;
		Форма.ИспользоватьШкалыПриборовУчета 							= Ложь;
		
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВвод.Видимость  = Ложь;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВывод.Видимость = Ложь;
		
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВвод.Видимость  	= Истина;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВывод.Видимость  	= Истина;
		
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВывод.Видимость  	= Ложь;
		
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВывод.Видимость  	= Ложь;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Истина, Ложь, ИмяТЧ);
		КонецЕсли;
		
	ИначеЕсли энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета") Тогда	
		Форма.ПрефиксТочекУчета 										= "ЕстьШкалыНетТарифныхЗон";
		Форма.ИспользоватьТарифныеЗоны 									= Ложь;
		Форма.ИспользоватьШкалыПриборовУчета 							= Истина;
		
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВвод.Видимость  = Ложь;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВывод.Видимость = Ложь;
		
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВывод.Видимость  	= Ложь;
		
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВвод.Видимость  	= Истина;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВывод.Видимость  	= Истина;
		
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВывод.Видимость  	= Ложь;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Ложь, Истина, ИмяТЧ);
		КонецЕсли;
		
	Иначе
		Форма.ПрефиксТочекУчета 										= "НетШкалНетТарифныхЗон";
		Форма.ИспользоватьТарифныеЗоны 									= Ложь;
		Форма.ИспользоватьШкалыПриборовУчета 							= Ложь;
		
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВвод.Видимость  = Ложь;
		Форма.Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоныВывод.Видимость = Ложь;
		
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаНетШкалЕстьТарифныеЗоныВывод.Видимость  	= Ложь;
		
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВвод.Видимость  	= Ложь;
		Форма.Элементы.СтраницаЕстьШкалыНетТарифныхЗонВывод.Видимость  	= Ложь;
		
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВвод.Видимость  	= Истина;
		Форма.Элементы.СтраницаНетШкалНетТарифныхЗонВывод.Видимость  	= Истина;
		
		Если НЕ ТекущийОбъект = Неопределено Тогда
			ЗаполнитьПредставлениеФормы(Форма.Объект, ТекущийОбъект, Ложь, Ложь, ИмяТЧ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьПредставлениеФормы(ОбъектФормы, ТекущийОбъект,ИспользоватьТарифныеЗоны = Неопределено, ИспользоватьШкалыПриборовУчета = Неопределено, ИмяТЧ = "ТочкиУчета") Экспорт 
	
	ТипТекущегоОбъекта								= ТипЗнч(ТекущийОбъект);
	
	ЕстьДатаПоказаний								= ТипТекущегоОбъекта = Тип("ДокументОбъект.энргВводНачальныхОстатков") Или ТипТекущегоОбъекта = Тип("ДокументОбъект.энргВводНачальныхОстатковМКД");
	Если ТипТекущегоОбъекта = Тип("Структура") Тогда
		ЕстьВидОперации 							= Ложь;
	ИначеЕсли ТипТекущегоОбъекта = Тип("ДанныеФормыСтруктура") Тогда
		ЕстьВидОперации 							= ТекущийОбъект.Ссылка.Метаданные().Реквизиты.Найти("ВидОперации") <> Неопределено;
	ИначеЕсли ТипТекущегоОбъекта = Тип("ФормаКлиентскогоПриложения") Тогда	
		ЕстьВидОперации 							= Ложь;
		РеквизитыФормы  							= ТекущийОбъект.ПолучитьРеквизиты();
		Для Индекс = 0 По РеквизитыФормы.ВГраница() Цикл
			Если РеквизитыФормы[Индекс].Имя = "ВидОперации" Тогда
				ЕстьВидОперации 					= Истина;
				Прервать;
			КонецЕсли;			
		КонецЦикла;		
	Иначе
		ЕстьВидОперации 							= ТекущийОбъект.Метаданные().Реквизиты.Найти("ВидОперации") <> Неопределено;
	КонецЕсли;
	
	ТолькоТекущиеПоказания 							= ЗаполнитьТолькоТекущиеПоказания(ОбъектФормы);
	МассивТиповДокументов 							= Новый Массив;
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргОткрытиеМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргРегистрацияПоказанийМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргОперацияСУслугамиМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргОперацияСПриборомУчетаМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестРегистрацияПоказанийНП"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестОперацияСУслугамиНП"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестОперацияСПриборомУчетаНП"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестУстановитьДатуПоверкиПУ"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргВводНачальныхОстатковМКД"));
	Если ОбщегоНазначения.ПодсистемаСуществует("скэкПроект") Тогда
		МассивТиповДокументов.Добавить(Тип("ДокументСсылка.скэкНачислениеТеплоисточника"));
		МассивТиповДокументов.Добавить(Тип("ДокументСсылка.скэкОперацияСУслугамиТеплоисточника"));
	КонецЕсли;
	
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргСменаПоставщикаМКД"));
	
	МассивОперацийЗамены 							= Новый Массив;
	МассивОперацийЗамены.Добавить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ);
	МассивОперацийЗамены.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ);
	МассивОперацийЗамены.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ);
	
	Если ИспользоватьТарифныеЗоны и ИспользоватьШкалыПриборовУчета Тогда
		
		
	ИначеЕсли ИспользоватьТарифныеЗоны Тогда
		
		Если   ТипЗнч(ОбъектФормы[ИмяТЧ]) = Тип("ДанныеФормыДерево") Тогда
			Коллекция 								= ОбъектФормы[ИмяТЧ].ПолучитьЭлементы();
		Иначе
			Коллекция 								= ОбъектФормы[ИмяТЧ];
		КонецЕсли;		
		
		ТзШкалыПриборовУчета	= ТекущийОбъект.ШкалыПриборовУчета.Выгрузить();
		ТзКоллекцияТУ			= Коллекция.Выгрузить();
		Запрос	= Новый Запрос;
		Текст = 
		"ВЫБРАТЬ
		|	ТзКоллекцияТУ.Реквизит
		|ПОМЕСТИТЬ ВТ_ТУ
		|ИЗ
		|	&ТзКоллекцияТУ КАК ТзКоллекцияТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТзШкалыПриборовУчета.Реквизит
		|ПОМЕСТИТЬ ВТ_Шкалы
		|ИЗ
		|	&ТзШкалыПриборовУчета КАК ТзШкалыПриборовУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Шкалы.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
		|	Максимум(ВТ_Шкалы.IDСтроки) КАК IDСтроки
		|ПОМЕСТИТЬ ВТ_МаксимальнаяШкала
		|ИЗ
		|	ВТ_Шкалы КАК ВТ_Шкалы
		|СГРУППИРОВАТЬ ПО ВТ_Шкалы.IDСтрокиТочкиУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Шкалы.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
		|	ВТ_Шкалы.IDСтроки КАК IDСтроки,
		|	Максимум(ВТ_Шкалы.ВидДифференцированности) КАК ВидДифференцированности
		|ПОМЕСТИТЬ ВТ_ИтогШкалы
		|ИЗ
		|	ВТ_Шкалы КАК ВТ_Шкалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимальнаяШкала КАК ВТ_МаксимальнаяШкала
		|		ПО ВТ_Шкалы.IDСтрокиТочкиУчета = ВТ_МаксимальнаяШкала.IDСтрокиТочкиУчета
		|			И ВТ_Шкалы.IDСтроки = ВТ_МаксимальнаяШкала.IDСтроки
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Шкалы.IDСтроки,
		|	ВТ_Шкалы.IDСтрокиТочкиУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.*
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогШкалы КАК ВТ_ИтогШкалы
		|		ПО ВТ_ТУ.IDСтроки = ВТ_ИтогШкалы.IDСтрокиТочкиУчета";
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогШкалы КАК ВТ_ИтогШкалыВывод
		//|		ПО ВТ_ТУ.IDСтрокиВывод = ВТ_ИтогШкалы.IDСтрокиТочкиУчета";
		
		ТекстРеквизитовТУ = "";
		Для Каждого ТекКолонка Из ТзКоллекцияТУ.Колонки Цикл
			ТекстРеквизитовТУ = ТекстРеквизитовТУ + "
			|	ТЗКоллекцияТУ." + ТекКолонка.Имя + " КАК " + ТекКолонка.Имя + ",";			
		КонецЦикла;
		ТекстРеквизитовТУ = Лев(ТекстРеквизитовТУ, СтрДлина(ТекстРеквизитовТУ)-1);		
		Текст = СтрЗаменить(Текст,"ТзКоллекцияТУ.Реквизит",ТекстРеквизитовТУ);
		
		ТекстРеквизитовШкал = "";
		Для Каждого ТекКолонка Из ТзШкалыПриборовУчета.Колонки Цикл
			ТекстРеквизитовШкал = ТекстРеквизитовШкал + "
			|	ТзШкалыПриборовУчета." + ТекКолонка.Имя + " КАК " + ТекКолонка.Имя + ",";			
		КонецЦикла;
		ТекстРеквизитовШкал = Лев(ТекстРеквизитовШкал, СтрДлина(ТекстРеквизитовШкал)-1);		
		Текст = СтрЗаменить(Текст,"ТзШкалыПриборовУчета.Реквизит",ТекстРеквизитовШкал);
		
		ТекстРеквизитовТУ =  СтрЗаменить(ТекстРеквизитовТУ,"ТЗКоллекцияТУ.","ВТ_ТУ."); 
		Текст = СтрЗаменить(Текст,"ВТ_ТУ.*",ТекстРеквизитовТУ);
		Текст = СтрЗаменить(Текст,"ВТ_ТУ.IDСтрокиШкалы ","ВТ_ИтогШкалы.IDСтроки ");
		Текст = СтрЗаменить(Текст,"ВТ_ТУ.ВидДифференцированности", "ВТ_ИтогШкалы.ВидДифференцированности");
		
		
		Если ТзКоллекцияТУ.Колонки.Найти("IDСтрокиВывод") <> Неопределено И (ЕстьВидОперации И МассивОперацийЗамены.Найти(ТекущийОбъект.ВидОперации) <> Неопределено Или Не ЕстьВидОперации) Тогда
			Текст = Текст + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогШкалы КАК ВТ_ИтогШкалыВывод
			|		ПО ВТ_ТУ.IDСтрокиВывод = ВТ_ИтогШкалыВывод.IDСтрокиТочкиУчета";
			Текст = СтрЗаменить(Текст,"ВТ_ТУ.IDСтрокиШкалыВывод","ВТ_ИтогШкалыВывод.IDСтроки");
			
		КонецЕсли;
		Запрос.Текст	 = Текст;
		Запрос.УстановитьПараметр("ТзШкалыПриборовУчета", ТзШкалыПриборовУчета);
		Запрос.УстановитьПараметр("ТзКоллекцияТУ", ТзКоллекцияТУ);
		Результат = Запрос.Выполнить().Выгрузить();
		//Результат.Индексы.Добавить("IDСтрокиТочкиУчета");
		Коллекция.Загрузить(Результат);
		
		
		////Для Каждого СтрокаТочки Из Коллекция Цикл
		////	СтрокиШкал								= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтроки));
		////	Если СтрокиШкал.Количество()  > 0 Тогда
		////		СтрокаШкал							= СтрокиШкал[0];
		////		СтрокаТочки.IDСтрокиШкалы			= СтрокаШкал.IDСтроки;
		////		СтрокаТочки.ВидДифференцированности	= СтрокаШкал.ВидДифференцированности;			
		////	КонецЕсли;
		////	
		////	Если СтрокаТочки.Свойство("IDСтрокиВывод") И ЕстьВидОперации И МассивОперацийЗамены.Найти(ТекущийОбъект.ВидОперации) <> Неопределено Или СтрокаТочки.Свойство("IDСтрокиВывод") И Не ЕстьВидОперации Тогда
		////		СтрокиШкал							= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтрокиВывод));
		////		Если СтрокиШкал.Количество()  > 0 Тогда
		////			СтрокаШкал						= СтрокиШкал[0];
		////			СтрокаТочки.IDСтрокиШкалыВывод	= СтрокаШкал.IDСтроки;
		////			//СтрокаТочки.ВидДифференцированности	= СтрокаШкал.ВидДифференцированности; 					
		////		КонецЕсли;				  
		////		
		////	КонецЕсли;
		////КонецЦикла;
	ИначеЕсли ИспользоватьШкалыПриборовУчета Тогда	
		
		Для Каждого СтрокаШкалы Из ОбъектФормы.ШкалыПриборовУчета Цикл
			СтрокиПоказаний 						= ТекущийОбъект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", ?(СтрокаШкалы.Свойство("IDСтрокиТарифнаяЗона"),СтрокаШкалы.IDСтрокиТарифнаяЗона,СтрокаШкалы.IDСтроки)));
			Если СтрокиПоказаний.Количество()  = 0 Тогда
				Продолжить;
			КонецЕсли;				  
			СтрокаПоказаний 						= СтрокиПоказаний[0];
			СтрокаШкалы.ТекущиеПоказания 			= СтрокаПоказаний.ТекущиеПоказания;
			
			Если ЕстьДатаПоказаний Тогда
				СтрокаШкалы.ДатаПоказаний	 		= СтрокаПоказаний.ДатаПоказаний;
			КонецЕсли;
			
			Если Не ТолькоТекущиеПоказания Тогда
				Если МассивТиповДокументов.Найти(ТипЗнч(ТекущийОбъект.Ссылка)) <> Неопределено Тогда
					ЗаполнитьСтрокуПоказанийОбъектаМКД(СтрокаШкалы, СтрокаПоказаний);
				Иначе
					ЗаполнитьСтрокуПоказанийОбъекта(СтрокаШкалы, СтрокаПоказаний);					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
	Иначе
		
		Для Каждого СтрокаТочки Из ОбъектФормы[ИмяТЧ] Цикл
			СтрокиШкал 								= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтроки));
			Если СтрокиШкал.Количество() > 0 Тогда
				СтрокаШкалы  						= СтрокиШкал[0];
				СтрокиПоказаний 					= ТекущийОбъект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));
				Если СтрокиПоказаний.Количество() > 0 Тогда        	
					СтрокаПоказаний 				= СтрокиПоказаний[0];
					СтрокаТочки.ТекущиеПоказания 	= СтрокаПоказаний.ТекущиеПоказания;
					СтрокаТочки.IDСтрокиШкалы	 	= СтрокаПоказаний.IDСтроки;
					Если Не ТолькоТекущиеПоказания Тогда
						Если МассивТиповДокументов.Найти(ТипЗнч(ТекущийОбъект.Ссылка)) <> Неопределено Тогда
							ЗаполнитьСтрокуПоказанийОбъектаМКД(СтрокаТочки, СтрокаПоказаний);
						Иначе
							ЗаполнитьСтрокуПоказанийОбъекта(СтрокаТочки, СтрокаПоказаний);							
						КонецЕсли;
					КонецЕсли;						
				КонецЕсли;
			Иначе
				СтрокаТочки.IDСтрокиШкалы	 	= Новый УникальныйИдентификатор;
			КонецЕсли;	
			Если СтрокаТочки.Свойство("IDСтрокиВывод") И ЕстьВидОперации И МассивОперацийЗамены.Найти(ТекущийОбъект.ВидОперации) <> Неопределено Или СтрокаТочки.Свойство("IDСтрокиВывод") И Не ЕстьВидОперации Тогда
				СтрокиШкал 								= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтрокиВывод));
				Если СтрокиШкал.Количество() > 0 Тогда
					СтрокаШкалы  						= СтрокиШкал[0];
					СтрокиПоказаний 					= ТекущийОбъект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));
					Если СтрокиПоказаний.Количество() > 0 Тогда        	
						СтрокаПоказаний 				= СтрокиПоказаний[0];
						СтрокаТочки.ТекущиеПоказания 	= СтрокаПоказаний.ТекущиеПоказания;
						СтрокаТочки.IDСтрокиШкалыВывод	= СтрокаПоказаний.IDСтроки;
						Если Не ТолькоТекущиеПоказания Тогда
							Если МассивТиповДокументов.Найти(ТипЗнч(ТекущийОбъект.Ссылка)) <> Неопределено Тогда
								ЗаполнитьСтрокуПоказанийОбъектаМКД(СтрокаТочки, СтрокаПоказаний);
							Иначе
								ЗаполнитьСтрокуПоказанийОбъекта(СтрокаТочки, СтрокаПоказаний); 								
							КонецЕсли;
						КонецЕсли;						
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьОбъектПоПредставлениюФормы(ОбъектФормы, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета, ИмяТЧ = "ТочкиУчета") Экспорт 
	
	ТипТекущегоОбъекта	= ТипЗнч(ТекущийОбъект);
	
	ЕстьДатаПоказаний	= ТипТекущегоОбъекта = Тип("ДокументОбъект.энргВводНачальныхОстатков") Или ТипТекущегоОбъекта = Тип("ДокументОбъект.энргВводНачальныхОстатковМКД");
	Если ТипТекущегоОбъекта = Тип("Структура") Тогда
		ЕстьВидОперации = Ложь;
	ИначеЕсли ТипТекущегоОбъекта = Тип("ДанныеФормыСтруктура") Тогда
		ЕстьВидОперации = ТекущийОбъект.Ссылка.Метаданные().Реквизиты.Найти("ВидОперации") <> Неопределено;
	Иначе
		ЕстьВидОперации = ТекущийОбъект.Метаданные().Реквизиты.Найти("ВидОперации") <> Неопределено;
	КонецЕсли;
	
	
	ТолькоТекущиеПоказания 						= ЗаполнитьТолькоТекущиеПоказания(ТекущийОбъект);
	МассивТиповДокументов = Новый Массив;
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргОткрытиеМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргРегистрацияПоказанийМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргОперацияСУслугамиМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргОперацияСПриборомУчетаМКД"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестРегистрацияПоказанийНП"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестОперацияСУслугамиНП"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.бестОперацияСПриборомУчетаНП"));
	
	Если ОбщегоНазначения.ПодсистемаСуществует("скэкПроект") Тогда 
		ИмяТипа 			= "ДокументСсылка.скэкНачислениеТеплоисточника";
		МассивТиповДокументов.Добавить(Тип(ИмяТипа));
		ИмяТипа 			= "ДокументСсылка.скэкОперацияСУслугамиТеплоисточника";
		МассивТиповДокументов.Добавить(Тип(ИмяТипа));
	КонецЕсли;
	
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.энргСменаПоставщикаМКД"));
	
	МассивОперацийЗамены = Новый Массив;
	МассивОперацийЗамены.Добавить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ);
	МассивОперацийЗамены.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ);
	МассивОперацийЗамены.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ);
	
	ВидыОперацийДляВидовПараметров					= новый Массив; 	
	ВидыОперацийДляВидовПараметров.Добавить(Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаПУ);
	ВидыОперацийДляВидовПараметров.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ);
	
	ИспользоватьУзлы = энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыФизЛиц();// FIX
	
	Если ИспользоватьТарифныеЗоны и Не ИспользоватьШкалыПриборовУчета Тогда
		// По строке точке ищем шкалу, если не нашли то добавляем основную
		Для Каждого СтрокаТочки Из ОбъектФормы[ИмяТЧ] Цикл
			СтрокиШкал 							= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтроки));
			
			Если СтрокиШкал.Количество() > 1 Тогда
				Для Сч = 1 По СтрокиШкал.Вграница() - 1 Цикл
					ТекущийОбъект.ШкалыПриборовУчета.Удалить(СтрокиШкал[Сч]);
				КонецЦикла;
				СтрокаШкалы 					= СтрокиШкал[0];
			ИначеЕсли СтрокиШкал.Количество() = 0 Тогда
				СтрокаШкалы 					= ТекущийОбъект.ШкалыПриборовУчета.Добавить();
				СтрокаШкалы.IDСтрокиТочкиУчета 	= СтрокаТочки.IDСтроки;
				СтрокаШкалы.IDСтроки 			= СтрокаТочки.IDСтрокиШкалы;
			Иначе
				СтрокаШкалы 					= СтрокиШкал[0];
			КонецЕсли;
			СтрокаШкалы.Шкала 					= Справочники.энргШкалыПриборовУчета.Основная;
			Если ТипТекущегоОбъекта = Тип("ДокументОбъект.энргПлатежноеПоручениеВходящие") тогда
				СтрокаШкалы.ВидДифференцированности = СтрокаТочки.УдалитьВидДифференцированности;
			ИначеЕсли ТипТекущегоОбъекта = Тип("ДокументОбъект.энргУстановитьВидДифференцированностиПриборУчета") тогда
				СтрокаШкалы.ВидДифференцированности = СтрокаТочки.ВидДифференцированности;
			иначе
				Если ИспользоватьУзлы Тогда 
					СтрокаТочки.ВидДифференцированности = СтрокаШкалы.ВидДифференцированности; 
				Иначе 
					СтрокаШкалы.ВидДифференцированности = СтрокаТочки.ВидДифференцированности;
				КонецЕсли;
			Конецесли;
			Если ЕстьВидОперации И ВидыОперацийДляВидовПараметров.Найти(ТекущийОбъект.ВидОперации) <> Неопределено Тогда 
				СтрокаШкалы.ВидПараметра	= СтрокаТочки.ВидПараметра;
			КонецЕсли;
			
			Если СтрокаТочки.Свойство("IDСтрокиВывод") И ЕстьВидОперации И МассивОперацийЗамены.Найти(ТекущийОбъект.ВидОперации) <> Неопределено Или СтрокаТочки.Свойство("IDСтрокиВывод") И Не ЕстьВидОперации Тогда 
				СтрокиШкал 							= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтрокиВывод));
				
				Если СтрокиШкал.Количество() > 1 Тогда
					Для Сч = 1 По СтрокиШкал.Вграница() - 1 Цикл
						ТекущийОбъект.ШкалыПриборовУчета.Удалить(СтрокиШкал[Сч]);
					КонецЦикла;
					СтрокаШкалы 					= СтрокиШкал[0];
				ИначеЕсли СтрокиШкал.Количество() = 0 Тогда
					СтрокаШкалы 					= ТекущийОбъект.ШкалыПриборовУчета.Добавить();
					СтрокаШкалы.IDСтрокиТочкиУчета 	= СтрокаТочки.IDСтрокиВывод;
					СтрокаШкалы.IDСтроки 			= СтрокаТочки.IDСтрокиШкалыВывод;
				Иначе
					СтрокаШкалы 					= СтрокиШкал[0];
				КонецЕсли;
				СтрокаШкалы.Шкала 					= Справочники.энргШкалыПриборовУчета.Основная; 			
				
				//СтрокаШкалы.ВидДифференцированности = СтрокаТочки.ВидДифференцированности;
			КонецЕсли; 			
			
		КонецЦикла;
		
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны и ИспользоватьШкалыПриборовУчета Тогда
		// По шкале ищем строку показаний, тарифную зону записываем как "без разбивки" 
		
		ТекущийОбъект.ПоказанияПриборовУчета.Очистить();
		ТекущийОбъект.ШкалыПриборовУчета.Очистить();
		
		ПустойКлючСтроки 						= Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		Для Каждого СтрокаШкалы Из ОбъектФормы.ШкалыПриборовУчета Цикл
			
			НоваяСтрокаШкалы  					= ТекущийОбъект.ШкалыПриборовУчета.добавить();
			
			Если НЕ ЗначениеЗаполнено(СтрокаШкалы.IDСтроки) ИЛИ СтрокаШкалы.IDСтроки = ПустойКлючСтроки  Тогда
				СтрокаШкалы.IDСтроки 			= Новый УникальныйИдентификатор;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШкалы,СтрокаШкалы);
			
			Если Не ЗначениеЗаполнено(СтрокаШкалы.ВидДифференцированности) Тогда
				
			КонецЕсли;
			
			СтрокаПоказаний 					= ТекущийОбъект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 			= СтрокаШкалы.IDСтроки;			
			СтрокаПоказаний.ТарифнаяЗона 		= Справочники.энргТарифныеЗоны.БезРазбивки;
			СтрокаПоказаний.ТекущиеПоказания 	= СтрокаШкалы.ТекущиеПоказания;
			
			Если ЕстьДатаПоказаний Тогда
				СтрокаПоказаний.ДатаПоказаний	= СтрокаШкалы.ДатаПоказаний;
			КонецЕсли;
			
			Если Не ТолькоТекущиеПоказания Тогда
				Если МассивТиповДокументов.Найти(ТипЗнч(ТекущийОбъект.Ссылка)) <> Неопределено Тогда
					ЗаполнитьСтрокуПоказанийОбъектаМКД(СтрокаПоказаний, СтрокаШкалы);
				Иначе
					ЗаполнитьСтрокуПоказанийОбъекта(СтрокаПоказаний, СтрокаШкалы);
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны и НЕ ИспользоватьШкалыПриборовУчета Тогда
		
		Для Каждого СтрокаТочки Из ОбъектФормы[ИмяТЧ] Цикл
			СтрокиШкал 							= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтроки));
			
			Если СтрокиШкал.Количество() > 1 Тогда
				Для Сч = 1 По СтрокиШкал.Вграница() - 1 Цикл
					ТекущийОбъект.ШкалыПриборовУчета.Удалить(СтрокиШкал[Сч]);
				КонецЦикла;
				СтрокаШкалы 					= СтрокиШкал[0];
			ИначеЕсли СтрокиШкал.Количество() = 0 Тогда
				СтрокаШкалы 					= ТекущийОбъект.ШкалыПриборовУчета.Добавить();
				СтрокаШкалы.IDСтрокиТочкиУчета 	= СтрокаТочки.IDСтроки;
				СтрокаШкалы.IDСтроки 			= СтрокаТочки.IDСтрокиШкалы;
			Иначе
				СтрокаШкалы 					= СтрокиШкал[0];
			КонецЕсли;
			СтрокаШкалы.Шкала 					= Справочники.энргШкалыПриборовУчета.Основная;
			СтрокаШкалы.ВидДифференцированности = СтрокаТочки.ВидДифференцированности;
			
			Если ЕстьВидОперации И ВидыОперацийДляВидовПараметров.Найти(ТекущийОбъект.ВидОперации) <> Неопределено Тогда 
				СтрокаШкалы.ВидПараметра	= СтрокаТочки.ВидПараметра;
			КонецЕсли;			
			
			СтрокиПоказаний 					= ТекущийОбъект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаТочки.IDСтрокиШкалы));
			
			Если СтрокиПоказаний.Количество() > 1 Тогда
				Для Сч = 1 По СтрокиПоказаний.Вграница() - 1 Цикл
					ТекущийОбъект.ПоказанияПриборовУчета.Удалить(СтрокиПоказаний[Сч]);
				КонецЦикла;
				СтрокаПоказаний					= СтрокиПоказаний[0];
			ИначеЕсли СтрокиПоказаний.Количество() = 0 Тогда
				СтрокаПоказаний					= ТекущийОбъект.ПоказанияПриборовУчета.Добавить();
				СтрокаПоказаний.IDСтроки 		= СтрокаТочки.IDСтрокиШкалы;
			Иначе
				СтрокаПоказаний 				= СтрокиПоказаний[0];
			КонецЕсли;
			СтрокаПоказаний.ТарифнаяЗона		= Справочники.энргТарифныеЗоны.БезРазбивки;
			СтрокаПоказаний.ТекущиеПоказания	= СтрокаТочки.ТекущиеПоказания;
			Если Не ТолькоТекущиеПоказания Тогда
				Если МассивТиповДокументов.Найти(ТипЗнч(ТекущийОбъект.Ссылка)) <> Неопределено Тогда
					ЗаполнитьСтрокуПоказанийОбъектаМКД(СтрокаПоказаний, СтрокаТочки);
				Иначе
					ЗаполнитьСтрокуПоказанийОбъекта(СтрокаПоказаний, СтрокаТочки);
					
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТочки.Свойство("IDСтрокиВывод") И ЕстьВидОперации И МассивОперацийЗамены.Найти(ТекущийОбъект.ВидОперации) <> Неопределено Или СтрокаТочки.Свойство("IDСтрокиВывод") И Не ЕстьВидОперации Тогда
				СтрокиШкал 							= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтрокиВывод));
				
				Если СтрокиШкал.Количество() > 1 Тогда
					Для Сч = 1 По СтрокиШкал.Вграница() - 1 Цикл
						ТекущийОбъект.ШкалыПриборовУчета.Удалить(СтрокиШкал[Сч]);
					КонецЦикла;
					СтрокаШкалы 					= СтрокиШкал[0];
				ИначеЕсли СтрокиШкал.Количество() = 0 Тогда
					СтрокаШкалы 					= ТекущийОбъект.ШкалыПриборовУчета.Добавить();
					СтрокаШкалы.IDСтрокиТочкиУчета 	= СтрокаТочки.IDСтрокиВывод;
					СтрокаШкалы.IDСтроки 			= СтрокаТочки.IDСтрокиШкалыВывод;
				Иначе
					СтрокаШкалы 					= СтрокиШкал[0];
				КонецЕсли;
				СтрокаШкалы.Шкала 					= Справочники.энргШкалыПриборовУчета.Основная;
				//СтрокаШкалы.ВидДифференцированности = СтрокаТочки.ВидДифференцированности;
				
				СтрокиПоказаний 					= ТекущийОбъект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаТочки.IDСтрокиШкалыВывод));
				
				Если СтрокиПоказаний.Количество() > 1 Тогда
					Для Сч = 1 По СтрокиПоказаний.Вграница() - 1 Цикл
						ТекущийОбъект.ПоказанияПриборовУчета.Удалить(СтрокиПоказаний[Сч]);
					КонецЦикла;
					СтрокаПоказаний					= СтрокиПоказаний[0];
				ИначеЕсли СтрокиПоказаний.Количество() = 0 Тогда
					СтрокаПоказаний					= ТекущийОбъект.ПоказанияПриборовУчета.Добавить();
					СтрокаПоказаний.IDСтроки 		= СтрокаТочки.IDСтрокиШкалыВывод;
				Иначе
					СтрокаПоказаний 				= СтрокиПоказаний[0];
				КонецЕсли;
				СтрокаПоказаний.ТарифнаяЗона		= Справочники.энргТарифныеЗоны.БезРазбивки;
				СтрокаПоказаний.ТекущиеПоказания	= СтрокаТочки.ТекущиеПоказанияВывод;
				Если Не ТолькоТекущиеПоказания Тогда
					Если МассивТиповДокументов.Найти(ТипЗнч(ТекущийОбъект.Ссылка)) <> Неопределено Тогда
						ЗаполнитьСтрокуПоказанийОбъектаМКД(СтрокаПоказаний, СтрокаТочки);
					Иначе
						ЗаполнитьСтрокуПоказанийОбъекта(СтрокаПоказаний, СтрокаТочки);
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;		
	КонецЕсли;		
КонецПроцедуры


Процедура ЗаполнитьСтрокуПоказанийОбъекта(Приемник,Источник) 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ПоказанияПредоставлены") 
		и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Приемник, "ПоказанияПредоставлены") Тогда
		Приемник.ПоказанияПредоставлены = Источник.ПоказанияПредоставлены;
	КонецЕсли;
	
	Приемник.ДатаПоследнихПоказаний 				= Источник.ДатаПоследнихПоказаний;
	Приемник.ЗначениеТарифа 						= Источник.ЗначениеТарифа;
	Приемник.ПредставлениеЗначениеТарифа			= Источник.ПредставлениеЗначениеТарифа;
	Приемник.КоэффициентПУ 							= Источник.КоэффициентПУ;
	Приемник.МаксимальноВозможныеПоказания 			= Источник.МаксимальноВозможныеПоказания;
	Приемник.МаксимальноВозможныйОбъемПотребления 	= Источник.МаксимальноВозможныйОбъемПотребления;
	Приемник.Переворот 								= Источник.Переворот;
	Приемник.ПереворотИзмененПользователем 			= Источник.ПереворотИзмененПользователем;
	Приемник.ПредыдущиеПоказания 					= Источник.ПредыдущиеПоказания;
	Приемник.Разница 								= Источник.Разница;
	Приемник.СостояниеПоказаний 					= Источник.СостояниеПоказаний;
	Приемник.СреднийОбъемПотребления 				= Источник.СреднийОбъемПотребления;
	Приемник.СтатусИзмененПользователем 			= Источник.СтатусИзмененПользователем;
	Приемник.ПричинаОтклонения 						= Источник.ПричинаОтклонения;
	Приемник.Сумма 									= Источник.Сумма;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПоказанийОбъектаМКД(Приемник,Источник) 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ПоказанияПредоставлены") Тогда
		Приемник.ПоказанияПредоставлены = Источник.ПоказанияПредоставлены;
	КонецЕсли;
	
	Приемник.ДатаПоследнихПоказаний 				= Источник.ДатаПоследнихПоказаний;
	Приемник.КоэффициентПУ 							= Источник.КоэффициентПУ;
	Приемник.МаксимальноВозможныеПоказания 			= Источник.МаксимальноВозможныеПоказания;
	Приемник.МаксимальноВозможныйОбъемПотребления 	= Источник.МаксимальноВозможныйОбъемПотребления;
	Приемник.Переворот 								= Источник.Переворот;
	Приемник.ПереворотИзмененПользователем 			= Источник.ПереворотИзмененПользователем;
	Приемник.ПредыдущиеПоказания 					= Источник.ПредыдущиеПоказания;
	Приемник.Разница 								= Источник.Разница;
	Приемник.СостояниеПоказаний 					= Источник.СостояниеПоказаний;
	Приемник.СреднийОбъемПотребления 				= Источник.СреднийОбъемПотребления;
	Приемник.СтатусИзмененПользователем 			= Источник.СтатусИзмененПользователем;
	
КонецПроцедуры

Функция ЗаполнитьТолькоТекущиеПоказания(ОбъектФормы)
	
	ТолькоТекущиеПоказания = Ложь;
	
	Если ТипЗнч(ОбъектФормы.Ссылка)	= Тип("ДокументСсылка.энргОперацияСЛицевымСчетом")
		И ОбъектФормы.ВидОперации	= Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.энргОперацияСУслугами")
		И ОбъектФормы.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.энргОперацияСПриборомУчета")
		И ОбъектФормы.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ Тогда
		
		//ТолькоТекущиеПоказания 											= Истина;	
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.энргОткрытиеМКД")
		И ОбъектФормы.ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие Тогда
		
		ТолькоТекущиеПоказания 											= Истина;	
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.энргОперацияСУслугамиМКД")
		И ОбъектФормы.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.энргОперацияСПриборомУчетаМКД")
		И ОбъектФормы.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами")
		И ОбъектФормы.ВидОперации  = Перечисления.бестВидыОпераций.ОперацияСДоговором_ОткрытиеДоговора Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.бестОперацияСПриборомУчетаНП")
		И ОбъектФормы.ВидОперации  = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ВводПУ Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.бестОперацияСУслугамиНП")
		И ОбъектФормы.ВидОперации  = Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка)	= Тип("ДокументСсылка.энргВводНачальныхОстатков") Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка)	= Тип("ДокументСсылка.энргВводНачальныхОстатковМКД") Тогда
		
		ТолькоТекущиеПоказания 											= Истина;
		
	ИначеЕсли ОбщегоНазначения.ПодсистемаСуществует("скэкПроект") И ТипЗнч(ОбъектФормы.Ссылка)	= Тип("ДокументСсылка.скэкОперацияСУслугамиТеплоисточника")
		//И ОбъектФормы.ВидОперации	= Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги Тогда
		и ОбъектФормы.ВидОперации=Перечисления.энргВидыОпераций.энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги тогда 
		ТолькоТекущиеПоказания 											= Истина;
		
	КонецЕсли;
	
	Возврат ТолькоТекущиеПоказания; 
КонецФункции


Процедура ПроверитьПоказанияНаКорректностьВвода(ТекущийОбъект, Постфикс = "") Экспорт
	
	Если энргРаботаСКонстантами.ЗначениеКонстантыРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу() Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НеУказаныТекущиеПоказания", Ложь);
		Возврат;
	КонецЕсли;   	
	
	ВыводитьПредупреждение = Ложь;
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НеУказаныТекущиеПоказания", Ложь);
	Для Каждого ТекСтрокаТочкиУчета из ТекущийОбъект.ТочкиУчета Цикл		
		IDСтроки 	= ТекСтрокаТочкиУчета["IDСтроки" + Постфикс];		
		СтрокиШкал 	= ТекущийОбъект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", IDСтроки));
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			СтрокиПоказаний = ТекущийОбъект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				Если НЕ СтрокаПоказаний.СостояниеПоказаний = Перечисления.энргСостояниеПоказаний.Приняты Тогда
					ВыводитьПредупреждение = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла; 
	КонецЦикла;
	
	Если ВыводитьПредупреждение Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны текущие показания. Проверьте корректность введенных данных.");
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НеУказаныТекущиеПоказания", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 
 