#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Если Объект.СтатическиеКолонки.Количество() = 0 Тогда
		СтатическиеКолонки = Документы.бестСуточнаяВедомость.ПолучитьСтатическиеКолонки();
		
		Для Каждого ТекСтр из СтатическиеКолонки Цикл
			ТекСтрЗначение = ТекСтр.Значение;
			Если ТекСтрЗначение.ВыводитьВТЧ Тогда
				НоваяСтрока 			= Объект.СтатическиеКолонки.Добавить();
				НоваяСтрока.РеквизитТЧ 	= ТекСтрЗначение.Имя;				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДинамическиеКолонки

&НаКлиенте
Процедура СтатическиеКолонкиПередУдалением(Элемент, Отказ)
	Отказ = Истина
КонецПроцедуры

&НаКлиенте
Процедура СтатическиеКолонкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти