#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеДанных

// Выполняет запрос для получение шапки.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура РезультатЗапросаШапки(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];		
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;			
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаШапки());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные = ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорОтбора 			  = Пакет.Операторы[0].Отбор;	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Ссылка,Контрагент,ВидКонтактнойИнформации,ОтправлятьНаБумажномНосителе,ПометкаУдаления";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорОтбора, "бестСпособыДоставкиЕПД", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ВыбираемыеПоляШапки") Тогда
		// Дополняем поля в пакет запроса	
	КонецЕсли;
	
КонецПроцедуры

#Область ТекстЗапроса

Функция ТекстЗапросаШапки()
	
	Текст =
	"ВЫБРАТЬ
	|	бестСпособыДоставкиЕПД.Ссылка КАК СпособДоставки
	|ИЗ
	|	Справочник.бестСпособыДоставкиЕПД КАК бестСпособыДоставкиЕПД";
	
	Возврат Текст;	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли