#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные маршрута по ключу помещения.
//
// Параметры:
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
// 
// Возвращаемое значение:
//   Структура:
//    * Маршрут		-	СправочникСсылка.энргМаршрутыКонтроллеров.
//    * Контролер	-	СправочникСсылка.энргСотрудники.
//
Функция  ДанныеМаршрутаПоКлючуПомещения(КлючПомещения) Экспорт 
	
	Результат  			= Новый Структура("Маршрут,Контролер", Справочники.энргМаршрутыКонтроллеров.ПустаяСсылка(), Справочники.энргСотрудники.ПустаяСсылка());
	Запрос  			= Новый Запрос(ТекстЗапросаДанныеМаршрутаПоКлючуПомещения());
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	РезультатЗапроса 	= Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка  		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

// Формирует текст запроса для получение состава маршрута.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СоставМаршрута(Схема,ТаблицаДляПомещения ="") Экспорт 
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргМаршрутыКонтроллеровАдресаМаршрута.Представление КАК Представление
	|ИЗ
	|	Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	|ГДЕ
	|	энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка = &МаршрутКонтроллера";
	
	Пакет  						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;	
		
КонецПроцедуры

// Формирует текст запроса для получение маршрута по ключу помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбор		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТекстМаршрутПоКлючуПомещения(Схема,ПараметрыОтбор,ТаблицаДляПомещения ="") Экспорт 
	
	ВызватьИсключение "Метод не реализован";	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеМаршрутаПоКлючуПомещения()
	
	Текст =
	"ВЫБРАТЬ
	|	энргКлючиПомещенийМаршрутовКонтролеров.МаршрутКонтролера КАК Маршрут,
	|	энргКлючиПомещенийМаршрутовКонтролеров.МаршрутКонтролера.Владелец КАК Контролер
	|ИЗ
	|	РегистрСведений.энргКлючиПомещенийМаршрутовКонтролеров КАК энргКлючиПомещенийМаршрутовКонтролеров
	|ГДЕ
	|	энргКлючиПомещенийМаршрутовКонтролеров.КлючПомещения = &КлючПомещения";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли