#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет период начисления.
//
// Параметры:
//  ДатаДокумента	-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
// 
// Возвращаемое значение:
//   Дата.
//
Функция ОпределитьПериодНачисления(Знач ДатаДокумента, Знач Организация, Знач Район) Экспорт
	
	
	ГраницыРасчетногоПериодаВРазрезеРайонов = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргГраницыРасчетногоПериодаВРазрезеРайонов");
	
	Если ГраницыРасчетногоПериодаВРазрезеРайонов Тогда
		Район 								= Справочники.энргЗоныОтвественности.ПустаяСсылка()				
	КонецЕсли; 
	
	Дата									= ?(Не ЗначениеЗаполнено(ДатаДокумента),ТекущаяДата(),ДатаДокумента);
	ДатаКонстанта 							= РегистрыСведений.бестДатыОтчетногоПериодыОбщиеНастройки.ЗавершениеПериодаНачисленияПоОрганизации(Организация, Район);
	КолВоДнейВМесяце 						= День(КонецМесяца(Дата));
	ДнейСНачалоПериода						= Мин(ДатаКонстанта, КолВоДнейВМесяце);
	ЧислоЗавОП								= НачалоМесяца(Дата) + ДнейСНачалоПериода  * 86400;
	
	Если Дата < ЧислоЗавОП Тогда
		ВозвратнаяДата						= НачалоМесяца(Дата);
	Иначе
		ВозвратнаяДата						= НачалоМесяца(ДобавитьМесяц(Дата,1));
	КонецЕсли;
		
	Возврат ВозвратнаяДата;
КонецФункции

// Получает границу расчетного периода.
//
// Параметры:
//  Организация					-	СправочникСсылка.Организации.
//  Район						-	СправочникСсылка.энргЗоныОтвественности.
//  ПериодНачисления			-	Дата.
//  УчитыватьНачалоВеденияУчета	-	Булево.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления,УчитыватьНачалоВеденияУчета = ложь) Экспорт
	
	Текст  							= бестНачисленияНП.ТекстГраницОтчетногоПериода(ПериодНачисления,ПериодНачисления,УчитыватьНачалоВеденияУчета);
	Запрос  						= Новый запрос;
	Запрос.Текст 					= СтрЗаменить(Текст,"ПОМЕСТИТЬ ГраницыОтчетногоПериода","");
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	РезультатЗапроса				= Запрос.Выполнить();
	Результат  						= Новый Структура;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка  					= РезультатЗапроса.Выбрать();
		Выборка.Следующий();	
		Для Каждого КолонкаРезульта Из РезультатЗапроса.Колонки Цикл
			Результат.Вставить(КолонкаРезульта.Имя, Выборка[КолонкаРезульта.Имя]);
		КонецЦикла;
	Иначе		
		Результат.Вставить("Организация", 		Организация);
		Результат.Вставить("Район",				Район);
		Результат.Вставить("ПериодНачисления",	ПериодНачисления);
		Результат.Вставить("НачалоОП",			НачалоМесяца(ПериодНачисления));
		Результат.Вставить("ЗавершениеОП",		КонецМесяца(ПериодНачисления)+1);
		Результат.Вставить("ДнейВПериоде",		День(КонецМесяца(ПериодНачисления)));
		Для Каждого КолонкаРезульта Из РезультатЗапроса.Колонки Цикл
			Если Результат.Свойство(КолонкаРезульта.Имя) Тогда
				Продолжить;
			КонецЕсли; 			
			ТипыЗначения 			= КолонкаРезульта.ТипЗначения.Типы();
			ИндексУдаляемогоТипа 	= ТипыЗначения.Найти(Тип("Null"));
			Если Не ИндексУдаляемогоТипа = Неопределено Тогда
				ТипыЗначения.Удалить(ИндексУдаляемогоТипа);
			КонецЕсли;
			ТипЗначения 			= Новый ОписаниеТипов(ТипыЗначения);
			Результат.Вставить(КолонкаРезульта.Имя, ТипЗначения.ПривестиЗначение());
		КонецЦикла;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли