#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДинамическуюТЧ();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьТЧ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьДинамическуюТЧ()
	Если Объект.УсредненныеОбъемы.Количество() = 0 Тогда
		пДата = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДатаСеанса());
		ДобавляемыйДень = НачалоМесяца(пДата);
		Пока Месяц(ДобавляемыйДень) = Месяц(пДата) Цикл
			НовСтр 		= ТЗУсредненныеОбъемы.Добавить();
			НовСтр.День 	= ДобавляемыйДень;
			ДобавляемыйДень = ДобавляемыйДень + 86400;
		КонецЦикла;
	Иначе
		Для каждого стр из Объект.УсредненныеОбъемы Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("День", стр.День);
			НайденныеСтроки = ТЗУсредненныеОбъемы.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ЗаполняемаяСтрока = ТЗУсредненныеОбъемы.Добавить();
			Иначе
				ЗаполняемаяСтрока = НайденныеСтроки[0];
			КонецЕсли;
			ЗаполняемаяСтрока["Час" + стр.Час] 	= стр.Объем;
			ЗаполняемаяСтрока.День 				= стр.День;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТЧ()
	Объект.УсредненныеОбъемы.Очистить();
	Для каждого стр Из ТЗУсредненныеОбъемы Цикл
		ТекущийЧас = 0;
		Пока ТекущийЧас <= 23 Цикл
			НовСтр = Объект.УсредненныеОбъемы.Добавить();
			НовСтр.День = стр.День;
			НовСтр.Объем = стр["Час" + ТекущийЧас];
			НовСтр.Час = ТекущийЧас;
			ТекущийЧас = ТекущийЧас + 1;        
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Справочники.энргЗоныОтвественности.ПустаяСсылка());	
КонецПроцедуры

#КонецОбласти