#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Таблица потерь
//
// Параметры:
//  МВТ				 - МенеджерВременныхТаблиц 
//  Период			 - Дата 
//  Организация		 - СправочникСсылка.Организации  
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета
//  ТочкаУчета		 - СправочникСсылка.энргТочкиУчета
// 
// Возвращаемое значение:
//  ТаблицаЗначений 
//
Функция ТаблицаПотерь(МВТ, Период, Организация, Район, ОбъектРасчета, ТочкаУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери) КАК ВидПотерь,
	               |	ЕСТЬNULL(бестПотериТочекУчетаСрезПоследних.ФиксированныйОбъемПотерь, 0) КАК ФиксированныйОбъемПотерьБыло,
	               |	ЕСТЬNULL(бестПотериТочекУчетаСрезПоследних.ПроцентПотерь, 0) КАК ПроцентПотерьБыло
	               |ИЗ
	               |	Итог КАК Итог
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПотериТочекУчета.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ОбъектРасчета = &ОбъектРасчета
	               |					И ТочкаУчета = &ТочкаУчета
	               |					И ВидПотерь = ЗНАЧЕНИЕ(Справочник.энргВидыПотерь.рксРасчетныеПотери)
	               |					И (ТарифнаяЗона) В
	               |						(ВЫБРАТЬ
	               |							Итог.ТарифнаяЗона
	               |						ИЗ
	               |							Итог КАК Итог)) КАК бестПотериТочекУчетаСрезПоследних
	               |		ПО Итог.ОбъектРасчета = бестПотериТочекУчетаСрезПоследних.ОбъектРасчета
	               |			И Итог.ТочкаУчета = бестПотериТочекУчетаСрезПоследних.ТочкаУчета
	               |			И Итог.ТарифнаяЗона = бестПотериТочекУчетаСрезПоследних.ТарифнаяЗона";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район); 
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции    

#КонецОбласти

#КонецЕсли