#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Пакет = ПолучитьДанныеДляПроведения();
	
	ДанныеВозможностиУстановки		= Пакет[0];
	ДанныеЦеновыхКатегорий			= Пакет[1];
	ДанныеПотери					= Пакет[2];
	ДанныеСтруктурыСети				= Пакет[3];
	ДанныеТочкаПоставки				= Пакет[4];

	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеВозможностиУстановки,		Движения.бестТехническаяВозможностьУстановкиПУ);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеЦеновыхКатегорий,			Движения.бестЦеновыеКатегорииТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПотери,					Движения.бестПотериТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеСтруктурыСети,			Движения.бестСтруктураСетиТочекУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочкаПоставки,			Движения.бестТочкиПоставкиТочекУчетаЮЛ);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочкаПоставки,			Движения.бестТочкиПоставкиОбъектовРасчета);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),ДатаФактическогоСобытия,Дата));
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	      		  |	&Период КАК Период
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.НетВозможностьУстановкиПУБыло <> бестИзменитьПараметрыТочкиУчета.НетВозможностьУстановкиПУ
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД,
	      		  |	&Период КАК Период
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |		ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.ЦеноваяКатегорияБыло <> бестИзменитьПараметрыТочкиУчета.ЦеноваяКатегория
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ВидПотерь КАК ВидПотерь,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ТарифнаяЗона КАК ТарифнаяЗона,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
	      		  |	бестИзменитьПараметрыТочкиУчетаПотери.ПроцентПотерь КАК ПроцентПотерь,
	      		  |	&Период КАК Период,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета.Потери КАК бестИзменитьПараметрыТочкиУчетаПотери
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |			ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |		ПО бестИзменитьПараметрыТочкиУчетаПотери.Ссылка = бестИзменитьПараметрыТочкиУчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД,
	      		  |	&Период КАК Период,
	      		  |	бестИзменитьПараметрыТочкиУчета.СтруктураСети КАК СтруктураСети
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |		ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.СтруктураСетиБыло <> бестИзменитьПараметрыТочкиУчета.СтруктураСети
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	бестИзменитьПараметрыТочкиУчета.Организация КАК Организация,
	      		  |	бестИзменитьПараметрыТочкиУчета.Район КАК Район,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	      		  |	бестИзменитьПараметрыТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	      		  |	бестОбъектыРасчета.МКД КАК МКД,
	      		  |	&Период КАК Период,
	      		  |	бестИзменитьПараметрыТочкиУчета.ТочкаПоставки КАК ТочкаПоставки
	      		  |ИЗ
	      		  |	Документ.бестИзменитьПараметрыТочкиУчета КАК бестИзменитьПараметрыТочкиУчета
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	      		  |		ПО бестИзменитьПараметрыТочкиУчета.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьПараметрыТочкиУчета.Ссылка = &Ссылка
	      		  |	И бестИзменитьПараметрыТочкиУчета.ТочкаПоставкиБыло <> бестИзменитьПараметрыТочкиУчета.ТочкаПоставки";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли