#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗагрузкаДанных

// Процедура - Загрузить показания из файла XML 80020
//
// Параметры:
//  Параметры - Структура - структура параметров процедуры:
//   * Файлы  - Массив - поток файлов для обработки данных
//
//  Адрес     - Строка, Неопределено - адрес результат выполнения фонового задания
//
Процедура ЗагрузитьПоказанияИзРегламентногоЗадания(Параметры, Адрес = Неопределено) Экспорт
	
	ПотокФайлов = Параметры.Файлы;
	ТаблицаДанных = НоваяТаблицаДесериализированныхДанных();
	Для Каждого Файл Из ПотокФайлов Цикл
		ПреобразоватьФайл(Файл, ТаблицаДанных);
	КонецЦикла;

	ОбработатьДанные(ТаблицаДанных);
	
КонецПроцедуры  

Процедура ОбработатьДанные(Таблица)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Примечание = НСтр("ru = 'Создан через регламентное задание ""Загрузка файлов АСКУЭ формата XML 80020 (профиль энергии и мощности)""'");
	
	Запрос = Новый Запрос(ТекстЗапросаОбработатьПУ());
	Запрос.УстановитьПараметр("Таблица", Таблица); 
	
	Результат = Запрос.Выполнить(); 
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПУ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПУ.Следующий() Цикл
		ВыборкаДень = ВыборкаПУ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДень.Следующий() Цикл
			ДокументОбъект = Документы.бестПочасоваяВедомость.СоздатьДокумент();		
			ЗаполнитьЗначенияСвойств(ДокументОбъект, ВыборкаПУ); 
			ДокументОбъект.Ответственный = Ответственный;
			ДокументОбъект.Примечание = Примечание; 
			ДокументОбъект.ВидОперации = Перечисления.бестВидыОпераций.ПочасоваяВедомость_ФактическоеПотребление;
			ДокументОбъект.Дата = ВыборкаДень.День;
			ДокументОбъект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ВыборкаДень.День, ДокументОбъект.Организация, ДокументОбъект.Район); 
			
			ВыборкаДетально = ВыборкаДень.Выбрать();
			Час = 0;
			Пока ВыборкаДетально.Следующий() И Час < 24 Цикл
				НоваяСтрокаТЧ = ДокументОбъект.ПредоставленныеОбъемы.Добавить(); 
				НоваяСтрокаТЧ.День = ВыборкаДень.День;
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ВыборкаДетально);
				Час = Час + 1;
			КонецЦикла; 
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);			
		КонецЦикла;
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти 

#Область ДесериализацияДанных

Процедура ПреобразоватьФайл(Файл, ОбщаяТаблицаДанных)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xml"); 
	Файл.Записать(ПутьКФайлу);
	
	ФайлXML = Новый ЧтениеXML;
	ФайлXML.ОткрытьФайл(ПутьКФайлу);     
					
	ПервыйОбъект =  ФабрикаXDTO.ПрочитатьXML(ФайлXML); //message  
	
	СтруктураСтроки = СтруктураТаблицыДанных(ОбщаяТаблицаДанных); 
	СтруктураСтроки.day = Дата(ПервыйОбъект.datetime.day);
	СтруктураСвойств = СтруктураСвойств();
	
	СтруктураПараметров = Новый Структура("ТаблицаДанных, СтруктураСтроки, СтруктураСвойств", ОбщаяТаблицаДанных, СтруктураСтроки, СтруктураСвойств);
	
	РазложитьУзел(ПервыйОбъект.area, "area", СтруктураПараметров);
	
	ФайлXML.Закрыть(); 
	
КонецПроцедуры

Процедура РазложитьУзел(ОбъектыXDTO, СвойствоТекущее, СтруктураПараметров)
	
	Если ТипЗнч(ОбъектыXDTO) = Тип("СписокXDTO") Тогда
		Для Каждого ОбъектXDTO Из ОбъектыXDTO Цикл 
			ВызватьДочернийУзел(ОбъектXDTO, СвойствоТекущее, СтруктураПараметров);	
		КонецЦикла;
	Иначе
		ВызватьДочернийУзел(ОбъектыXDTO, СвойствоТекущее, СтруктураПараметров);		
	КонецЕсли;
		
КонецПроцедуры  

Процедура ВызватьДочернийУзел(ОбъектXDTO, СвойствоТекущее, СтруктураПараметров)

	Если СвойствоТекущее = "value" Тогда
		СтруктураПараметров.СтруктураСтроки.value	= ОбъектXDTO.Последовательность().ПолучитьТекст(0);
	Иначе
		ЗаполнитьЗначенияСвойств(СтруктураПараметров.СтруктураСтроки, ОбъектXDTO, СтруктураПараметров.СтруктураСвойств[СвойствоТекущее]); 	
	КонецЕсли;
	
	Если СвойствоТекущее = "period" И ТипЗнч(ОбъектXDTO["value"]) <> Тип("ОбъектXDTO")  Тогда 
		НоваяСтрока = СтруктураПараметров.ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПараметров.СтруктураСтроки);
		НоваяСтрока.start = Час(Дата("00010101" + ОбъектXDTO.start));
		НоваяСтрока.end = Час(Дата("00010101" + ОбъектXDTO.end));
		Возврат;
	ИначеЕсли СвойствоТекущее = "period" Тогда 
		НоваяСтрока = СтруктураПараметров.ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПараметров.СтруктураСтроки);
		НоваяСтрока.start = Час(Дата("00010101" + ОбъектXDTO.start));
		НоваяСтрока.end = Час(Дата("00010101" + ОбъектXDTO.end));
	ИначеЕсли СвойствоТекущее = "value" Тогда
		НоваяСтрока = СтруктураПараметров.ТаблицаДанных[СтруктураПараметров.ТаблицаДанных.Количество()-1];
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПараметров.СтруктураСтроки, "value");
		Возврат;
	КонецЕсли;
	Свойство = НайтиСвойстваДляПереходаКУзлу(ОбъектXDTO); 
	Если Свойство <> Неопределено Тогда 
		РазложитьУзел(ОбъектXDTO[Свойство.Имя], Свойство.Имя, СтруктураПараметров);
	КонецЕсли;	
	
КонецПроцедуры 

Функция НайтиСвойстваДляПереходаКУзлу(Объект)
	
	Свойства = Объект.Свойства();
	ПоследовательностьУзлов = ПоследовательностьУзлов();
	Для Каждого ДочернийУзел Из ПоследовательностьУзлов Цикл
		Свойство = Свойства.Получить(ДочернийУзел);
		Если Свойство <> Неопределено Тогда 
			Возврат Свойство; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПоследовательностьУзлов()
	СписокДочерних = Новый Массив();
	СписокДочерних.Добавить("measuringpoint"); 
	СписокДочерних.Добавить("accountpoint"); 
	СписокДочерних.Добавить("measuringchannel");
	СписокДочерних.Добавить("period");
	СписокДочерних.Добавить("value");
	Возврат СписокДочерних;
КонецФункции 

Функция СтруктураСвойств() //описание свойств всех вложенных узлов, которые нужно заполнить
	Структура = Новый Структура();
	Структура.Вставить("area", "inn"); 
	Структура.Вставить("measuringpoint", "code"); 
	Структура.Вставить("accountpoint", "code");
	Структура.Вставить("measuringchannel", ""); 
	Структура.Вставить("period", "start, end, value");
	Возврат Структура;
КонецФункции

Функция НоваяТаблицаДесериализированныхДанных()
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("day", Новый ОписаниеТипов("Дата"));  
	Таблица.Колонки.Добавить("inn", ОбщегоНазначения.ОписаниеТипаСтрока(10));   
	Таблица.Колонки.Добавить("code", ОбщегоНазначения.ОписаниеТипаСтрока(20));  //код ту
	Таблица.Колонки.Добавить("start", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("end", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("value", Новый ОписаниеТипов("Число")); 
	Возврат Таблица;
КонецФункции 

Функция СтруктураТаблицыДанных(ТаблицаДанных)
	Структура = Новый Структура;
	Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
		Структура.Вставить(Колонка.Имя);
	КонецЦикла;
	Возврат Структура;
КонецФункции   

Функция ТекстЗапросаОбработатьПУ()
	
	Возврат "ВЫБРАТЬ
	        |	Таблица.inn КАК ИНН,
	        |	Таблица.code КАК КодТочкиУчета,
	        |	Таблица.start КАК НачалоЧас,
	        |	Таблица.end КАК КонецЧас,
	        |	Таблица.day КАК День,
	        |	Таблица.value КАК Объем
	        |ПОМЕСТИТЬ ДанныеТаблица
	        |ИЗ
	        |	&Таблица КАК Таблица
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	энргПриборыУчетаАбонента.Ссылка КАК Ссылка,
	        |	энргПриборыУчетаАбонента.ПолучасовыеЗначения КАК ПолучасовыеЗначения,
	        |	энргПриборыУчетаАбонента.ДанныеВатт КАК ДанныеВатт,
	        |	НЕ энргПриборыУчетаАбонента.КоэффициентТрансформации КАК УчитыватьКоэффициентПУ,
	        |	энргПриборыУчетаАбонента.ПонижающийКоэффициент КАК ПонижающийКоэффициент,
	        |	ДанныеТаблица.День КАК День,
	        |	ДанныеТаблица.НачалоЧас КАК НачалоЧас,
	        |	ДанныеТаблица.КонецЧас КАК КонецЧас,
	        |	ВЫБОР
	        |		КОГДА энргПриборыУчетаАбонента.ПонижающийКоэффициент
	        |			ТОГДА ВЫБОР
	        |					КОГДА энргПриборыУчетаАбонента.ДанныеВатт
	        |						ТОГДА ДанныеТаблица.Объем / 1000
	        |					ИНАЧЕ ДанныеТаблица.Объем
	        |				КОНЕЦ * 0.5
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА энргПриборыУчетаАбонента.ДанныеВатт
	        |					ТОГДА ДанныеТаблица.Объем / 1000
	        |				ИНАЧЕ ДанныеТаблица.Объем
	        |			КОНЕЦ
	        |	КОНЕЦ КАК Объем
	        |ПОМЕСТИТЬ ДанныеПУ
	        |ИЗ
	        |	Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТаблица КАК ДанныеТаблица
	        |		ПО энргПриборыУчетаАбонента.КодТочкиУчета = ДанныеТаблица.КодТочкиУчета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестПриборыТочекУчетаНПСрезПоследних.Организация КАК Организация,
	        |	бестПриборыТочекУчетаНПСрезПоследних.Район КАК Район,
	        |	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	        |ПОМЕСТИТЬ ДанныеТУ
	        |ИЗ
	        |	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(, ) КАК бестПриборыТочекУчетаНПСрезПоследних
	        |ГДЕ
	        |	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета В
	        |			(ВЫБРАТЬ
	        |				ДанныеПУ.Ссылка
	        |			ИЗ
	        |				ДанныеПУ)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПУ.Ссылка КАК ПУ,
	        |	МИНИМУМ(ДанныеПУ.НачалоЧас) КАК МинЧас
	        |ПОМЕСТИТЬ НачальныеЧас
	        |ИЗ
	        |	ДанныеПУ КАК ДанныеПУ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеПУ.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПУ.Ссылка КАК ПриборУчета,
	        |	ДанныеПУ.НачалоЧас КАК НачалоЧас,
	        |	СУММА(ДанныеПУ.Объем) КАК Объем,
	        |	ДанныеПУ.День КАК День
	        |ПОМЕСТИТЬ Объемы
	        |ИЗ
	        |	ДанныеПУ КАК ДанныеПУ
	        |ГДЕ
	        |	ДанныеПУ.ПолучасовыеЗначения
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДанныеПУ.НачалоЧас,
	        |	ДанныеПУ.День,
	        |	ДанныеПУ.Ссылка
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	ДанныеПУ.Ссылка,
	        |	ДанныеПУ.НачалоЧас + ДанныеПУ.КонецЧас - НачальныеЧас.МинЧас,
	        |	ДанныеПУ.Объем,
	        |	ДанныеПУ.День
	        |ИЗ
	        |	ДанныеПУ КАК ДанныеПУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачальныеЧас КАК НачальныеЧас
	        |		ПО (НачальныеЧас.ПУ = ДанныеПУ.Ссылка)
	        |ГДЕ
	        |	НЕ ДанныеПУ.ПолучасовыеЗначения
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ДанныеТУ.Организация КАК Организация,
	        |	ДанныеТУ.Район КАК Район,
	        |	ДанныеТУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ДанныеТУ.ТочкаУчета КАК ТочкаУчета,
	        |	ДанныеПУ.Ссылка КАК ПриборУчета,
	        |	Объемы.НачалоЧас КАК Час,
	        |	Объемы.День КАК День,
	        |	Объемы.Объем КАК Объем,
	        |	ДанныеПУ.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	        |ИЗ
	        |	ДанныеПУ КАК ДанныеПУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТУ КАК ДанныеТУ
	        |		ПО ДанныеПУ.Ссылка = ДанныеТУ.ПриборУчета
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Объемы КАК Объемы
	        |		ПО ДанныеПУ.Ссылка = Объемы.ПриборУчета
	        |ИТОГИ
	        |	МАКСИМУМ(Организация),
	        |	МАКСИМУМ(Район),
	        |	МАКСИМУМ(ОбъектРасчета),
	        |	МАКСИМУМ(ТочкаУчета),
	        |	МАКСИМУМ(УчитыватьКоэффициентПУ)
	        |ПО
	        |	ПриборУчета,
	        |	День";  
	
КонецФункции  

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли