#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	УстановитьПараметрыСКД();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	УстановитьПараметрыСКД();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыСКД()
	
	КомпоновщикНастроек = ЭтаФорма.Отчет.КомпоновщикНастроек;
	
	ПараметрПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета"); 
	ПараметрПериодОтчета.Использование = Истина; 
	ПараметрПериодОтчета.Значение  = Отчет.ПериодОтчета; 
	
		
	ПараметрРайон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Район");
	ПараметрРайон.Использование = Истина;
	ПараметрРайон.Значение  = Район;
	
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Отчет.ПериодОтчета, Район.Организация,Район);
	ГраницаОП = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Район.Организация,Район, ПериодНачисления,Ложь);
	НачалоРасчетногоПериода = ГраницаОП.НачалоОП;
	КонецРасчетногоПериода = ГраницаОП.ЗавершениеОП - 1;
	
	
	ПараметрДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоРасчетногоПериода");
	ПараметрДатаНач.Использование = Истина;
	ПараметрДатаНач.Значение  = НачалоРасчетногоПериода;
	
	ПараметрДатаКон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецРасчетногоПериода");
	ПараметрДатаКон.Использование = Истина;
	ПараметрДатаКон.Значение  = КонецРасчетногоПериода;
	
КонецПроцедуры

#КонецОбласти

