#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
				
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 							= Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты",Истина);
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",				Истина);
	ДополнительныеСвойства.Вставить("ПараметрыПроведения",			Новый Структура());
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Если ПометкаУдаления Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Записать();
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

