#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет просуженная задолженность за период.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПросуженнаяЗадолженностьЗаПериод(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПросуженнаяЗадолженностьЗаПериод());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("Период") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["Период"].ИмяПараметра));
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,Услуга,ПериодНачисления,Поставщик";
		ПараметрИсточника 	= ПараметрыИсточника[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Операторы[0].Отбор, "энргПросуженнаяЗадолженностьАбонентовСрезПоследних", ПараметрыСхемы.ПараметрыВТ, "ПросуженнаяБлокированная");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПросуженнаяЗадолженностьЗаПериод()
	Текст  = 
	"ВЫБРАТЬ
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Организация КАК Организация,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Район КАК Район,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.МКД КАК МКД,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Абонент КАК Абонент,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Услуга КАК Услуга,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.Поставщик КАК Поставщик,
	|	энргПросуженнаяЗадолженностьАбонентовСрезПоследних.ПросуженнаяБлокированная КАК ПросуженнаяБлокированная
	|ИЗ
	|	РегистрСведений.энргПросуженнаяЗадолженностьАбонентов.СрезПоследних(, ) КАК энргПросуженнаяЗадолженностьАбонентовСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли