
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	бестЛокализацияСервер.ПриСозданииНаСервере_бестАктированиеНедопускаЮЛ(ЭтотОбъект);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти                                             

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьТУ();
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТУ()
	Объект.ТочкиУчета.Очистить();
	РезультатЗапроса = бестРаботаСТочкамиУчетаНПСервер.ПолучитьДействующиеТочкиУчета(Объект.Дата,Объект.Организация,Объект.Район,,,Объект.ОбъектРасчета);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		мТУ = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТочкаУчета");
		мТУ = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мТУ);
		Для каждого эл из мТУ Цикл
			НовСтр = Объект.ТочкиУчета.Добавить();
			НовСтр.ТочкаУчета = эл;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти