
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Результат = ПроверкаЗаписиДокумента(ПараметрКоманды);
	Если Результат Тогда
		Возврат
	Иначе
		ТабДок = ОпределитьПечатнуюФорму(ПараметрКоманды);	     
		Если НЕ ТабДок = Неопределено Тогда 
			ТабДок.Показать();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция  ОпределитьПечатнуюФорму(ДокументСобытия)
	ТабДок = Неопределено;
	
	Если ДокументСобытия.ТипСобытия = Справочники.энргСпособСвязи.НаправлениеУведомленияИсполнителюНаВводОРП Тогда
		ТабДок = НовыйТабличныйДокумент();
		СформироватьУведомлениеИсполнителюОРП(ДокументСобытия, ТабДок);
	КонецЕсли;
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Функция ПроверкаЗаписиДокумента(ПараметрКоманды)
	Если не ЗначениеЗаполнено (ПараметрКоманды) Тогда
		ПоказатьПредупреждение(, "Перед печатью макета необходимо записать документ");
		РезультатПредупреждения = Истина;
	Иначе
		РезультатПредупреждения = Ложь;
	КонецЕсли;
	Возврат РезультатПредупреждения;
КонецФункции

&НаСервере
Процедура СформироватьУведомлениеИсполнителюОРП(ДокументСобытия, ТабДок)	
	Документы.энргСобытие.СформироватьУведомлениеИсполнителюОРП(ДокументСобытия, ТабДок);	
КонецПроцедуры

&НаСервере
Функция НовыйТабличныйДокумент()
	ТабДок = Новый ТабличныйДокумент; 	
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.ОтображатьСетку 	= Ложь;
	
	Возврат ТабДок;
КонецФункции

#КонецОбласти