

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//{{MRG[ <-> ]
//	энргОбщегоНазначения.УстановитьСписокРайонов(Объект.Район,Элементы.Район); 
//}}MRG[ <-> ]
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
//{{MRG[ <-> ]
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);
//}}MRG[ <-> ]
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			энргРаботаСЛицевымСчетомСервер.ПрочитатьДанныеПомещения(ЭтотОбъект,Объект);
		КонецЕсли;		
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// МенюОтчеты
//	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	энргРаботаСЛицевымСчетомСервер.ПрочитатьДанныеПомещения(ЭтотОбъект,ТекущийОбъект);

	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	


КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
//{{MRG[ <-> ]
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
//}}MRG[ <-> ]
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораПомещения(Элемент,Объект.Организация,Объект.Район,СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Услуга) тогда
		ЗаполнитьСписокАбонентовСервер();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура АбонентыСпособРаспределенияПриИзменении(Элемент)
	
	ТекущиеДанные 							= Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	СпособРаспределения 					= ТекущиеДанные.СпособРаспределения;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) тогда
		ТекущиеДанные.IDСтроки 							= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	КоллекцияФиксВеличина					= ЭтаФорма.Объект.ФиксированныеОбъемы;
	КоллекцияДолиРаспределения				= ЭтаФорма.Объект.ДолиРаспределенияОбъемаПомещения;
	
	СтруктураПоиска  						= Новый Структура("IDСтроки",ТекущиеДанные.IDСтроки);
	
	Если СпособРаспределения = ПредопределенноеЗначение("Перечисление.энргСпособыРаспределенияОбъема.ФиксированныйОбъем") Тогда
		
		СтрокиФиксУдалить						= КоллекцияФиксВеличина.НайтиСтроки(СтруктураПоиска);	
		для Каждого СтрокаФиксУдалить из СтрокиФиксУдалить цикл		  		
			КоллекцияФиксВеличина.Удалить(СтрокаФиксУдалить);		
		КонецЦикла;  	 
		СтрокаФикс 						= КоллекцияФиксВеличина.добавить();
		СтрокаФикс["IDСтроки"]				= ТекущиеДанные.IDСтроки;
		
	ИначеЕсли СпособРаспределения = ПредопределенноеЗначение("Перечисление.энргСпособыРаспределенияОбъема.ДолевоеРаспределение") Тогда 
		
		СтрокиДолиУдалить						= КоллекцияДолиРаспределения.НайтиСтроки(СтруктураПоиска);	
		для Каждого СтрокаДолиУдалить из СтрокиДолиУдалить цикл		  		
			КоллекцияДолиРаспределения.Удалить(СтрокаДолиУдалить);		
		КонецЦикла;  	 
		СтрокаДоли 						= КоллекцияДолиРаспределения.добавить();
		СтрокаДоли["IDСтроки"]				= ТекущиеДанные.IDСтроки;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные 							= Элементы.Абоненты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) тогда
		ТекущиеДанные.IDСтроки				= Новый УникальныйИдентификатор;
	КонецЕсли;    
	
	Элементы.ФиксированныеОбъемы.ОтборСтрок		= Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);
	
	Элементы.ДолиРаспределенияОбъемаПомещения.ОтборСтрок		= Новый ФиксированнаяСтруктура("IDСтроки", ТекущиеДанные.IDСтроки);


КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты

// Конец МенюОтчеты

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокАбонентовСервер()
	
	Объект.Абоненты.Очистить();
	
	Результат 								= энргРаботаСЛицевымСчетомСервер.ТочкиУчетаРазделенныхЛС(Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения, Объект.Услуга); 
	Выборка  								= Результат.выбрать();
	
	Пока Выборка.следующий() цикл
		НовСтр  					= Объект.Абоненты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
