#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция МассивПриборов() Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	энргПоступлениеОплатыЧерезКонтроллера.ПериодНачисления КАК ПериодНачисления,
	|	энргПоступлениеОплатыЧерезКонтроллера.Дата КАК ПериодРегистрации,
	|	энргАбоненты.Район КАК Район,
	|	энргАбоненты.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.ВыводПрибораУчета,
	|	ВложенныйЗапрос.ИмяТабЧасти
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТочекУчета.Ссылка КАК ссылка,
	|		ТаблицаТочекУчета.Абонент КАК Абонент,
	|		ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ТаблицаПоказаний.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ЛОЖЬ КАК ВыводПрибораУчета,
	|		""ПоказанияПриборовУчета"" КАК ИмяТабЧасти
	|	ИЗ
	|		Документ.энргПоступлениеОплатыЧерезКонтроллера.ПоказанияПриборовУчета КАК ТаблицаПоказаний
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ТаблицаПоказаний.IDСтроки = ТаблицаТочекУчета.IDСтроки
	|				И ТаблицаПоказаний.Ссылка = ТаблицаТочекУчета.Ссылка
	|				И (ТаблицаПоказаний.Ссылка = &ссылка)
	|				И (ТаблицаТочекУчета.Ссылка = &ссылка)
	|				И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера КАК энргПоступлениеОплатыЧерезКонтроллера
	|		ПО ВложенныйЗапрос.ссылка = энргПоступлениеОплатыЧерезКонтроллера.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД,
	|	Абонент,
	|	ПриборУчета,
	|	ТарифнаяЗона,
	|	ПериодРегистрации,
	|	ТекущиеПоказания";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("Кассир",				Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.Касса); 
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",		Истина);
	ДополнительныеСвойства.вставить("ДанныеОплаты",			ДанныеОплаты()); 	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеОплаты 					= ДанныеОплаты();
	ВыборкаОплата  					= ДанныеОплаты.выбрать();
	
	Пока ВыборкаОплата.следующий() цикл
		Запись 						= Движения.энргВзаиморасчеты.ДобавитьРасход();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаОплата);
		Запись.Период 				= ВыборкаОплата.Дата;
		Запись.ПериодНачисления 	= ПериодНачисления;
		
		Запись 						= Движения.энргОплатаУслуг.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаОплата);
		Запись.Период 				= ВыборкаОплата.Дата;
		Запись.ПериодНачисления 	= ПериодНачисления;
		Запись.Кассир 				= Ответственный;
		Запись.ИсточникПоступления 	= Справочники.энргИсточникиПоступления.Касса;
	КонецЦикла; 
	
	ДанныеПоказанийПриборовУчета 	= ДанныеПоказанийПриборовУчета();
			
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеПоказанийПриборовУчета,Движения);
	
	Результат = ПолучитьОбъемыПУ(); 	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(Результат, Движения.энргЗарегистрированныйОбъемПриборов);
	
	Выборка 				= Результат.Выбрать();
	НаборРасчетСреднего 	= РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
	НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНабор  			= НаборРасчетСреднего.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНабор,Выборка);	
		СтрокаНабор.ОбъемУслуги = Выборка.ОбъемУслугиПотребленный;
		
	КонецЦикла;
	НаборРасчетСреднего.Записать(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//// Функция - Данные оплаты
//// Возвращаемое значение:
////   - 
Функция ДанныеОплаты();
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеТабЧасти",		Оплата);
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.Текст 	= "ВЫБРАТЬ
	|	&Дата КАК Дата,
	|	&Район КАК Район,
	|	&Ссылка КАК Регистратор,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	энргПоступлениеОплатыЧерезКонтроллераОплата.Абонент,
	|	энргПоступлениеОплатыЧерезКонтроллераОплата.СуммаОплаты КАК Сумма
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	&ДанныеТабЧасти КАК энргПоступлениеОплатыЧерезКонтроллераОплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.ПериодНачисления,
	|	Шапка.Район,
	|	энргАбоненты.МКД КАК МКД,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.Сумма КАК СуммаОплаты,
	|	ИСТИНА КАК ЭтоОплата,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодВзаиморасчетов,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодВзаиморасчетовОкончание,
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка) КАК Услуга,
	|	Шапка.Дата,
	|	Шапка.Регистратор
	|ИЗ
	|	Шапка КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО Шапка.Абонент = энргАбоненты.Ссылка";
	
	Результат  = Запрос.Выполнить();
	Возврат Результат;
	 
КонецФункции

Функция ДанныеПоказанийПриборовУчета()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Текст 		= 
	"ВЫБРАТЬ
	|	энргПоступлениеОплатыЧерезКонтроллера.Дата КАК Период,
	|	энргПоступлениеОплатыЧерезКонтроллера.Дата КАК ПериодРегистрации,
	|	энргПоступлениеОплатыЧерезКонтроллера.ПериодНачисления КАК ПериодНачисления,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.Показание,
	|	ВложенныйЗапрос.СостояниеПоказаний,
	|	ВложенныйЗапрос.КС,
	|	ВложенныйЗапрос.Переворот,
	|	ВложенныйЗапрос.НомерСтрокиТЧ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТочекУчета.Ссылка КАК ссылка,
	|		ТаблицаТочекУчета.Абонент КАК Абонент,
	|		ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|		ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|		ЛОЖЬ КАК КС,
	|		ЛОЖЬ КАК Переворот,
	|		ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ
	|	ИЗ
	|		Документ.энргПоступлениеОплатыЧерезКонтроллера.ТочкиУчета КАК ТаблицаТочекУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|			ПО ТаблицаТочекУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|				И ТаблицаТочекУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|				И (ТаблицаТочекУчета.Ссылка = &ссылка)
	|				И (ТаблицаПоказанийПриборовУчета.Ссылка = &Ссылка)
	|				И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера КАК энргПоступлениеОплатыЧерезКонтроллера
	|		ПО ВложенныйЗапрос.ссылка = энргПоступлениеОплатыЧерезКонтроллера.Ссылка";
		
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить();  	
КонецФункции 

Функция ПолучитьОбъемыПУ()
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	|	&ДокументСсылка КАК ДокРегистратор,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.Разница КАК ОбъемУслугиПотребленный,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Период КАК Период,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	|		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	|		ТаблицаШкал.Шкала КАК Шкала,
	|		ТаблицаШкал.IDСтроки КАК IDСтроки,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ТаблицаДокумента.Район КАК Район,
	|		ТаблицаПриборовУчета.КлючПомещения КАК КлючПомещения,
	|		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаПриборовУчета.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	|		&Период КАК Период
	|	ИЗ
	|		Документ.энргПоступлениеОплатыЧерезКонтроллера.ТочкиУчета КАК ТаблицаПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ШкалыПриборовУчета КАК ТаблицаШкал
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	|				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	|				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера КАК ТаблицаДокумента
	|			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	|				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	|				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПоступлениеОплатыЧерезКонтроллера.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	|			И (ВложенныйЗапрос.РегистрируетОбъем)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка"	,Ссылка);
	Запрос.УстановитьПараметр("Период"			,Дата);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли