#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗадолженностьПени(Дата, Организация, Район, Абонент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоПениОстатки.Организация КАК Организация,
	|	энргВзаиморасчетыПоПениОстатки.Район КАК Район,
	|	энргВзаиморасчетыПоПениОстатки.МКД КАК МКД,
	|	энргВзаиморасчетыПоПениОстатки.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоПениОстатки.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргВзаиморасчетыПоПениОстатки.ПериодРасчета КАК ПериодРасчета,
	|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_Долги
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоПениОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПросуженнаяПениСрезПоследних.Организация КАК Организация,
	|	энргПросуженнаяПениСрезПоследних.Район КАК Район,
	|	энргПросуженнаяПениСрезПоследних.МКД КАК МКД,
	|	энргПросуженнаяПениСрезПоследних.Абонент КАК Абонент,
	|	энргПросуженнаяПениСрезПоследних.Услуга КАК Услуга,
	|	энргПросуженнаяПениСрезПоследних.ПериодРасчета КАК ПериодРасчета,
	|	энргПросуженнаяПениСрезПоследних.ПериодНачисления КАК ПериодНачисления,
	|	энргПросуженнаяПениСрезПоследних.Просуженная КАК Просуженная
	|ПОМЕСТИТЬ ВТ_Просуженная
	|ИЗ
	|	РегистрСведений.энргПросуженнаяПени.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент = &Абонент) КАК энргПросуженнаяПениСрезПоследних
	|ГДЕ
	|	энргПросуженнаяПениСрезПоследних.Просуженная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Долги.Услуга КАК Услуга,
	|	ВТ_Долги.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_Долги.ПериодРасчета КАК ПериодРасчета,
	|	ВТ_Долги.СуммаОстаток КАК Сумма,
	|	ВТ_Долги.СуммаОстаток КАК СуммаРанееНачисленнойПени
	|ИЗ
	|	ВТ_Долги КАК ВТ_Долги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Просуженная КАК ВТ_Просуженная
	|		ПО ВТ_Долги.Организация = ВТ_Просуженная.Организация
	|			И ВТ_Долги.Район = ВТ_Просуженная.Район
	|			И ВТ_Долги.МКД = ВТ_Просуженная.МКД
	|			И ВТ_Долги.Абонент = ВТ_Просуженная.Абонент
	|			И ВТ_Долги.Услуга = ВТ_Просуженная.Услуга
	|			И ВТ_Долги.ПериодНачисления = ВТ_Просуженная.ПериодНачисления
	|			И ВТ_Долги.ПериодРасчета = ВТ_Просуженная.ПериодРасчета
	|ГДЕ
	|	ВТ_Просуженная.Организация ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район); 
	Запрос.УстановитьПараметр("Период", Дата); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();	

КонецФункции  

#КонецОбласти

#КонецЕсли