#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	

	Пакет = ПолучитьДанныеТЧ();	
	ДанныеДанныеЗадолженности = Пакет[0]; 
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеДанныеЗадолженности,	Движения.энргПросуженнаяПени);
	
	СоздатьДокументРучноеИзменениеПени(Ссылка);
КонецПроцедуры  

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого СтрокаТЧ Из ПросуженнаяЗадолженность Цикл
		Если СтрокаТЧ.Просуженная Тогда
			Если СтрокаТЧ.Сумма <= 0 Тогда
				Отказ = истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не правильно заполнено поле ""Сумма""", ЭтотОбъект,"ПросуженнаяЗадолженность["+(СтрокаТЧ.НомерСтроки-1)+"].Сумма");				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРучноеИзменениеПени.Ссылка КАК Ссылка,
		|	энргРучноеИзменениеПени.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
		|ГДЕ
		|	энргРучноеИзменениеПени.ДокументОснование = &мДокументы
		|";
	
	Запрос.УстановитьПараметр("мДокументы", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл 
		РучноеИзменениеПениОбъект = Выборка.Ссылка.ПолучитьОбъект();
		РучноеИзменениеПениОбъект.УстановитьПометкуУдаления(Истина);
		РучноеИзменениеПениОбъект.Пени.Очистить();
		РучноеИзменениеПениОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеТЧ()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мДокументы", Ссылка);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Шапка.Дата КАК Период,
		|	Шапка.Ссылка КАК Регистратор,
		|	Шапка.Организация КАК Организация,
		|	Шапка.Район КАК Район,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ КАК МКД,
		|	Шапка.Абонент КАК Абонент,
		|	ТаблицаЗадолженности.Услуга КАК Услуга,
		|	ТаблицаЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаЗадолженности.ПериодРасчета КАК ПериодРасчета,
		|	ТаблицаЗадолженности.Поставщик КАК Поставщик,
		|	ТаблицаЗадолженности.Сумма КАК Сумма,
		|	ТаблицаЗадолженности.Просуженная КАК Просуженная, 
		|	ТаблицаЗадолженности.СуммаРанееНачисленнойПени КАК СуммаРанееНачисленнойПени
		|ИЗ
		|	Документ.энргРегистрацияПросуженнойПени КАК Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПросуженнойПени.ПросуженнаяЗадолженность КАК ТаблицаЗадолженности
		|		ПО Шапка.Ссылка = ТаблицаЗадолженности.Ссылка
		|			И (Шапка.Ссылка В (&мДокументы))
		|			И (ТаблицаЗадолженности.Ссылка В (&мДокументы))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО Шапка.КлючПомещения = энргКлючиПомещений.Ссылка
		|ГДЕ
		|	ТаблицаЗадолженности.Просуженная = ИСТИНА";
	
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными();   	
КонецФункции 

Процедура СоздатьДокументРучноеИзменениеПени(Ссылка)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРучноеИзменениеПени.Ссылка КАК Ссылка,
		|	энргРучноеИзменениеПени.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_Перерасчет
		|ИЗ
		|	Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
		|ГДЕ
		|	энргРучноеИзменениеПени.ДокументОснование = &мДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шапка.Район КАК Район,
		|	Шапка.Абонент КАК Абонент,
		|	Шапка.Дата КАК Дата,
		|	Шапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ КАК МКД,
		|	Шапка.КлючПомещения КАК КлючПомещения,
		|	ЛОЖЬ КАК НеУчитывать,
		|	Шапка.Ответственный КАК Ответственный,
		|	Шапка.Примечание КАК Примечание,
		|	Шапка.Ссылка КАК ДокументОснование,
		|	ТаблицаЗадолженности.Услуга КАК Услуга,
		|	ТаблицаЗадолженности.Поставщик КАК Поставщик,
		|	ТаблицаЗадолженности.ПериодРасчета КАК ПериодРасчета,
		|	ТаблицаЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаЗадолженности.Сумма - ТаблицаЗадолженности.СуммаРанееНачисленнойПени КАК Сумма,
		|	ТаблицаЗадолженности.СуммаРанееНачисленнойПени КАК СуммаРанееНачисленнойПени
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.энргРегистрацияПросуженнойПени КАК Шапка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПросуженнойПени.ПросуженнаяЗадолженность КАК ТаблицаЗадолженности
		|		ПО Шапка.Ссылка = ТаблицаЗадолженности.Ссылка
		|			И (Шапка.Ссылка В (&мДокументы))
		|			И (ТаблицаЗадолженности.Ссылка В (&мДокументы))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО Шапка.КлючПомещения = энргКлючиПомещений.Ссылка
		|ГДЕ
		|	ТаблицаЗадолженности.Просуженная
		|	И (ТаблицаЗадолженности.СуммаРанееНачисленнойПени > ТаблицаЗадолженности.Сумма
		|			ИЛИ ТаблицаЗадолженности.СуммаРанееНачисленнойПени < ТаблицаЗадолженности.Сумма)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.Район КАК Район,
		|	ВТ_ДанныеДокумента.Абонент КАК Абонент,
		|	ВТ_ДанныеДокумента.Дата КАК Дата,
		|	ВТ_ДанныеДокумента.Организация КАК Организация,
		|	ВТ_ДанныеДокумента.МКД КАК МКД,
		|	ВТ_ДанныеДокумента.КлючПомещения КАК КлючПомещения,
		|	ВТ_ДанныеДокумента.НеУчитывать КАК НеУчитывать,
		|	ВТ_ДанныеДокумента.Ответственный КАК Ответственный,
		|	ВТ_ДанныеДокумента.Примечание КАК Примечание,
		|	ВТ_ДанныеДокумента.ДокументОснование КАК ДокументОснование,
		|	ВТ_ДанныеДокумента.Услуга КАК Услуга,
		|	ВТ_ДанныеДокумента.Поставщик КАК Поставщик,
		|	ВТ_ДанныеДокумента.ПериодРасчета КАК ПериодРасчета,
		|	ВТ_ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ДанныеДокумента.Сумма КАК Сумма,
		|	ВТ_ДанныеДокумента.СуммаРанееНачисленнойПени КАК СуммаРанееНачисленнойПени,
		|	ВТ_Перерасчет.Ссылка КАК РучноеИзменениеПени
		|ИЗ
		|	ВТ_Перерасчет КАК ВТ_Перерасчет
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ПО ВТ_Перерасчет.ДокументОснование = ВТ_ДанныеДокумента.ДокументОснование
		|ИТОГИ
		|	МАКСИМУМ(Район),
		|	МАКСИМУМ(Абонент),
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(МКД),
		|	МАКСИМУМ(КлючПомещения),
		|	МАКСИМУМ(НеУчитывать),
		|	МАКСИМУМ(Ответственный),
		|	МАКСИМУМ(Примечание)
		|ПО
		|	ДокументОснование,
		|	РучноеИзменениеПени";
	
	Запрос.УстановитьПараметр("мДокументы", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаДокументОснование = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НеПервыйДокумент = Ложь;
	
	Пока ВыборкаДокументОснование.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДокументОснование.ДокументОснование) Тогда 
			НеПервыйДокумент = Истина;
		КонецЕсли;
		
		ВыборкаИзмененияПени = ВыборкаДокументОснование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
		Пока ВыборкаИзмененияПени.Следующий() Цикл
			Если НеПервыйДокумент Тогда 
				Если ЗначениеЗаполнено(ВыборкаИзмененияПени.РучноеИзменениеПени) Тогда
					РучноеИзменениеПениОбъект = ВыборкаИзмененияПени.РучноеИзменениеПени.ПолучитьОбъект();
					РучноеИзменениеПениОбъект.УстановитьПометкуУдаления(Истина);
					РучноеИзменениеПениОбъект.Пени.Очистить();
					РучноеИзменениеПениОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаИзмененияПени.РучноеИзменениеПени) Тогда
				РучноеИзменениеПениОбъект = ВыборкаИзмененияПени.РучноеИзменениеПени.ПолучитьОбъект();
				РучноеИзменениеПениОбъект.УстановитьПометкуУдаления(Ложь);
				РучноеИзменениеПениОбъект.Пени.Очистить();     
			Иначе
				РучноеИзменениеПениОбъект = Документы.энргРучноеИзменениеПени.СоздатьДокумент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(РучноеИзменениеПениОбъект, ВыборкаИзмененияПени);
			РучноеИзменениеПениОбъект.ПериодНачисления	= ПериодНачисления;
			
			ВыборкаДетальныеЗаписи = ВыборкаИзмененияПени.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НовСтр = РучноеИзменениеПениОбъект.Пени.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
			КонецЦикла; 
			РучноеИзменениеПениОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчетаПени", РучноеИзменениеПениОбъект.Ссылка);
			НеПервыйДокумент = Истина;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли