
#Область ПрограммныйИнтерфейс

Функция ПроверитьВозможностьВводаНаОсновании(ПараметрКоманды) Экспорт
	
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрКоманды,"Статус,Проведен");
	
	Документы.ЗаказКлиента.ПроверитьВозможностьВводаНаОсновании(
		ПараметрКоманды,
		СтруктураРеквизитов.Статус,
		НЕ СтруктураРеквизитов.Проведен,
		Истина);
	
КонецФункции

Функция ОписаниеКомандыСоздатьНаОсновании(ИмяКоманды, АдресКомандСоздатьНаОснованииВоВременномХранилище) Экспорт
	
	Возврат ВводНаОсновании.ОписаниеКомандыСоздатьНаОсновании(ИмяКоманды, АдресКомандСоздатьНаОснованииВоВременномХранилище);
	
КонецФункции

#КонецОбласти

#Область СозданиеДокументаРасходныйКассовыйОрдер

Функция ДанныеДляЗаполненияРасходныйКассовыйОрдерНаОсновании(ДокументСсылка) Экспорт 
	
	Возврат Документы.энргПерерасчет.ДанныеДляЗаполненияРасходныйКассовыйОрдер(ДокументСсылка);
	
КонецФункции

#КонецОбласти

Функция ДанныеЗаполненияОткрытиеЛицевогоСчетаНаОснованииЗакрытияЛС(ДокументСсылка) Экспорт 
	
	Возврат Документы.энргОперацияСЛицевымСчетом.ДанныеЗполненияНаОснованииОперацииСЛицевымСчетом(ДокументСсылка);
	
КонецФункции

