#Область СлужебныйПрограммныйИнтерфейс 
 
Процедура бестПроверкаНаличияПрисоединенныхФайловОбработкаПроведения(Источник, Отказ, Статус, СправочникФайлов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестОбязательныеКПрикреплениюФайлы.ВидФайла КАК ВидФайла
	|ПОМЕСТИТЬ ОбязательныеВиды
	|ИЗ
	|	РегистрСведений.бестОбязательныеКПрикреплениюФайлы КАК бестОбязательныеКПрикреплениюФайлы
	|ГДЕ
	|	бестОбязательныеКПрикреплениюФайлы.Статус = &Статус
	|	И бестОбязательныеКПрикреплениюФайлы.Обязателен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбязательныеВиды.ВидФайла КАК ВидФайла
	|ИЗ
	|	ОбязательныеВиды КАК ОбязательныеВиды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник." + СправочникФайлов + " КАК " + СправочникФайлов + "
	|		ПО ОбязательныеВиды.ВидФайла = " + СправочникФайлов + ".энргВидПрикрепленногоФайла И НЕ " + СправочникФайлов + ".ПометкаУдаления
	|ГДЕ
	|	" + СправочникФайлов + ".Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Отказ = НЕ РезультатЗапроса.Пустой();
	
	Если Отказ Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		НеприкрепленныеВиды = "";
		
		Пока Выборка.Следующий() Цикл
			НеприкрепленныеВиды = НеприкрепленныеВиды + Выборка.ВидФайла + "; ";
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют присоединенные файлы следующих видов: " + НеприкрепленныеВиды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСтатус(Регистратор, Движения, Статус) Экспорт
	Набор				= Движения.бестСтатусыЭтаповЗаключенияДоговора;
	Запись				= Набор.добавить();	
	Запись.Период 		= Регистратор.Дата;
	Запись.Статус 		= Статус;
	ЗаполнитьЗначенияСвойств(Запись, Регистратор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

