#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Процедура МассивПриборов() Экспорт 
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
		
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ тогда
		Если НЕ энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() Тогда 
			Текст  	= 
			"ВЫБРАТЬ
			|	ТаблицаПриборов.ПриборУчета КАК ПриборУчета,
			|	ЛОЖЬ КАК ВыводПрибораУчета,
			|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
			|	0 КАК Разделитель
			|ИЗ
			|	Документ.энргОперацияСПриборомУчетаМКД.ТочкиУчета КАК ТаблицаТочкиУчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчетаМКД.ПриборыУзловУчета КАК ТаблицаПриборов
			|		ПО ТаблицаТочкиУчета.Ссылка = ТаблицаПриборов.Ссылка
			|			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
			|			И (ТаблицаПриборов.Ссылка = &Ссылка)
			|			И ТаблицаТочкиУчета.IDСтроки = ТаблицаПриборов.IDСтроки
			|			И (НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
		Иначе 
			Текст  			= 
			"ВЫБРАТЬ
			|	ТаблицаТочек.ПриборУчета КАК ПриборУчета,
			|	ЛОЖЬ КАК ВыводПрибораУчета,
			|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
			|	0 КАК Разделитель
			|ИЗ
			|	Документ.энргОперацияСПриборомУчетаМКД.ТочкиУчета КАК ТаблицаТочек
			|ГДЕ
			|	ТаблицаТочек.Ссылка = &Ссылка
			|	И НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ тогда 		
		Текст  			= 
		"ВЫБРАТЬ
		|	ТаблицаТочек.ПриборУчетаВывод КАК ПриборУчета,
		|	ЛОЖЬ КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.энргОперацияСПриборомУчетаМКД.ТочкиУчета КАК ТаблицаТочек
		|ГДЕ
		|	ТаблицаТочек.Ссылка = &Ссылка
		|	И НЕ ТаблицаТочек.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";	
	иначе
		Текст  			= 
		"ВЫБРАТЬ
		|	ТаблицаТочек.ПриборУчетаВывод КАК ПриборУчета,
		|	ИСТИНА КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.энргОперацияСПриборомУчетаМКД.ТочкиУчета КАК ТаблицаТочек
		|ГДЕ
		|	ТаблицаТочек.Ссылка = &Ссылка
		|	И НЕ ТаблицаТочек.ПриборУчетаВывод = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаТочек.ПриборУчета,
		|	ЛОЖЬ,
		|	""ПоказанияПриборовУчета"",
		|	0
		|ИЗ
		|	Документ.энргОперацияСПриборомУчетаМКД.ТочкиУчета КАК ТаблицаТочек
		|ГДЕ
		|	ТаблицаТочек.Ссылка = &Ссылка
		|	И НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	КонецЕсли;

	Запрос.Текст 	= Текст;
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДополнительныеСвойства.Вставить("Строение", МКД);
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Документы.энргОперацияСПриборомУчетаМКД.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	Документы.энргОперацияСПриборомУчетаМКД.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли