#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет актуальные способы распределения объема помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура АктуальныеСпособыРаспределенияОбъемаПомещения(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеСпособыРаспределенияОбъемаПомещения());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения; 
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора.Период.ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, КлючПомещения, Услуга, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаАктуальныеСпособыРаспределенияОбъемаПомещения()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргСпособыРаспределенияОбъемаПомещенияСрезПоследних.Организация КАК Организация,
	|	энргСпособыРаспределенияОбъемаПомещенияСрезПоследних.Район КАК Район,
	|	энргСпособыРаспределенияОбъемаПомещенияСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргСпособыРаспределенияОбъемаПомещенияСрезПоследних.Услуга КАК Услуга,
	|	энргСпособыРаспределенияОбъемаПомещенияСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСпособыРаспределенияОбъемаПомещенияСрезПоследних.СпособРаспределения КАК СпособРаспределения
	|ИЗ
	|	РегистрСведений.энргСпособыРаспределенияОбъемаПомещения.СрезПоследних КАК энргСпособыРаспределенияОбъемаПомещенияСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли