#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЧетнаяСторонаПриИзменении(Элемент)
	
	Если ЧетнаяСторона Тогда
		НечетнаяСторона = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НечетнаяСторонаПриИзменении(Элемент)
	
	Если НечетнаяСторона Тогда
		ЧетнаяСторона = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.СписокСтроений.Количество()<> 0 тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросОчисткиСпискаСтроений",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Перед заполнением очистить список строений?",РежимДиалогаВопрос.ДаНет);		
	Иначе
		ЗаполнитьНаСервере();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Результат = Документы.энргНазначениеСтроенийСудебномуУчастку.ЗаполнитьСписокСтроений(Объект.Организация,Объект.Район,Улица,Дом,ЧетнаяСторона,НечетнаяСторона);
	
	Пока Результат.Следующий() Цикл
		Адрес = РаботаСАдресами.СведенияОбАдресе(Результат.Значение);
		Если ЗначениеЗаполнено(Улица) Тогда
			ОтборПоУлице = СтрНайти(Адрес.Улица,Улица) <> 0;
		Иначе
			ОтборПоУлице =Истина;
		КонецЕсли;	
		Если ЗначениеЗаполнено(Дом) Тогда
			ОтборПоДому = Адрес.Здание.Номер = Дом;
		Иначе
			ОтборПоДому =Истина;
		КонецЕсли;		
		Если ЗначениеЗаполнено(Адрес.Здание.Номер) Тогда
			
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Адрес.Здание.Номер) Тогда
				
				НомерДома = Число(Адрес.Здание.Номер);
				
			Иначе
				
				НомерДома = Число(энргОбщегоНазначения.ПолучитьСтрокуТолькоПервыеЦифры(Адрес.Здание.Номер));
				
			КонецЕсли;
			
			Если ЧетнаяСторона Тогда
				ОтборЧетное = НомерДома/2 = Цел(НомерДома/2);
			Иначе
				ОтборЧетное =Истина;
			КонецЕсли;	
			Если НечетнаяСторона Тогда
				ОтборНеЧетное = НомерДома/2 <> Цел(НомерДома/2);
			Иначе
				ОтборНеЧетное =Истина;
			КонецЕсли;	
		Иначе
			ОтборЧетное =Ложь;
			ОтборНеЧетное =Ложь;
		КонецЕсли;		
		
		Если ОтборПоУлице И ОтборПоДому И ОтборЧетное И ОтборНеЧетное Тогда
			
			НоваяСтрока = Объект.СписокСтроений.Добавить();
			НоваяСтрока.Строение = Результат.Ссылка;
		
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчисткиСпискаСтроений(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			Объект.СписокСтроений.Очистить();
		КонецЕсли; 		
		ЗаполнитьНаСервере();		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти