#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"СпособРасчетаНорматива","СпособыРасчетаНормативаСоставныхУслуг","ПараметрыСпособовРасчетаНорматива");
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьИтогиДоговорныхОбъемов();
		ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	бестРаботаСОбъектамиНПСервер.ПрочитатьДанныеОбъекта(ЭтотОбъект, "ОбъектыРасчета");
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДанныеКварталов();
	ОбновитьЗаголовокКнопкиПереключенияИтогов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПроверкаДублированияНаименованийОбъектовРасчета(Отказ);			
	энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект); 	
	бестПользовательскийВводСервер.ЗаписатьПараметрыОбъекта(Объект.ОбъектыРасчета, ТекущийОбъект); 
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестЗаключениеДоговоровСЮридическимиЛицами",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация,Объект.Контрагент,СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиОбъектыРасчета

&НаКлиенте
Процедура ОбъектыРасчетаПриАктивизацииСтроки(Элемент)
		
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекОбъектРасчета = ТекДанные.ОбъектРасчета;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.УслугиОбъектов,						Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ГарантированныеОбъемы,					Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы["ТочкиУчета"	+ ПрефиксТочекУчета],	Неопределено,		ТекДанные.IDСтроки,, "Владельца");
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТарифныеКатегорииУслуги,				Неопределено,		ТекДанные.IDСтроки);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.МаксимальныеНагрузки	,				Неопределено,		ТекДанные.IDСтроки);

	Если Объект.ОбъемыИНагрузкиВРазрезеДоговора И ТекДанные.НомерСтроки > 1 Тогда
		Элементы.ГарантированныеОбъемы.ТолькоПросмотр = Истина;
		Элементы.УслугиОбъектов.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ГарантированныеОбъемы.ТолькоПросмотр = Ложь;
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ГарантированныеОбъемы,					Неопределено,		ТекДанные.IDСтроки);
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.УслугиОбъектов,						Неопределено,		ТекДанные.IDСтроки);
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ИтогиДоговорныхОбъемов,				Неопределено,		ТекДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаНаименованиеОбъектаРасчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.НаименованиеОбъектаРасчета) и НЕ ЗначениеЗаполнено(ТекДанные.ОбъектРасчета) Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.Собственник) Тогда
			ТекДанные.Собственник	= Объект.Контрагент;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТЧ", 			"ОбъектыРасчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("IDСтроки", 		Элементы.ОбъектыРасчета.ТекущиеДанные.IDСтроки);
	ПроверкаУдаленияСтроки(ДопПараметры);	
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;	
		НоваяСтрока = Объект.ОбъектыРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные);
		НоваяСтрока.idСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	МодульУправлениеКонтактнойИнформациейКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
	
	ПараметрыФормыКонтактнойИнформации 					= МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"),""); 
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
		
	ДанныеСтроки 										= Новый Структура("Представление,ЗначенияПолей",ТекДанные.АдресОбъекта,ТекДанные.АдресОбъектаЗначение);
	
	ПараметрыФормыКонтактнойИнформации.Значение 		= ДанныеСтроки.ЗначенияПолей;
	ПараметрыФормыКонтактнойИнформации.Представление 	= ДанныеСтроки.Представление;
	
	Оповещение 											= Новый ОписаниеОповещения("ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", Истина);
	Оповещение.ДополнительныеПараметры.Вставить("КлючСтроки", 		 Элементы.ОбъектыРасчета.ТекущаяСтрока);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);		
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             ЭтаФорма);
	
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,,Оповещение);


КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт 
		
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 									= Объект.ОбъектыРасчета.НайтиПоИдентификатору(ДополнительныеПараметры.КлючСтроки);	
	
	ТекущиеДанные.АдресОбъекта 						= РезультатЗакрытия.Представление;
	ТекущиеДанные.АдресОбъектаЗначение 				= РезультатЗакрытия.Значение; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаАдресОбъектаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;

	ТекДанные.АдресОбъектаЗначение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекДанные.АдресОбъекта, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета"));
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиГарантированныеОбъемы

&НаКлиенте
Процедура ГарантированныеОбъемыПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеОбъемы = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если ТекДанныеОбъемы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеОбъемы.IDСтроки = ТекДанные.IDСтроки;

	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
	
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыЯнварьПриИзменении(Элемент)
	СуммаПоКварталу()
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиУслугиОбъектов

&НаКлиенте
Процедура УслугиОбъектовУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Элементы.УслугиОбъектов.ТекущиеДанные.Услуга.Пустая()=Истина Тогда
		//Отказ=Истина;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("IDСтроки", Элементы.УслугиОбъектов.ТекущиеДанные.IDСтроки);
		ПараметрыОтбора.Вставить("Услуга", Элементы.УслугиОбъектов.ТекущиеДанные.Услуга);

		НайденныеСтроки = Объект.УслугиОбъектов.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()> 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По услуге "+ Элементы.УслугиОбъектов.ТекущиеДанные.Услуга + " уже введена нагрузка");
			//Объект.УслугиОбъектов.Удалить(Элементы.УслугиОбъектов.ТекущаяСтрока);
			
			ИдентификаторСтроки = Элементы.УслугиОбъектов.ТекущаяСтрока;
			ЭлементКоллекции = Объект.УслугиОбъектов.НайтиПоИдентификатору(ИдентификаторСтроки);
			ИндексЭлементаКоллекции = Объект.УслугиОбъектов.Индекс(ЭлементКоллекции);
			Объект.УслугиОбъектов.Удалить(ИндексЭлементаКоллекции);
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	// энргРаботаСПоставщиками {
	бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСПоставщиками } 
	
	УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	Если ИспользоватьШкалыПриборовУчета Тогда
		СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
		бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета; 	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ТекущиеДанные.IDСтроки,Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТекущиеДанные.IDСтрокиВладельца = ТекДанные.IDСтроки;
	
	ТочкиУчетаПриИзмененииСервер(ТекДанные.IDСтроки, ТекДанные.МКД);

КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаПриИзмененииСервер(IDСтроки, МКД)	
	бестРаботаСТочкамиУчетаНПСервер.ОбновитьГруппыПотребителейУслуги(ЭтотОбъект, IDСтроки,МКД);	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныНачалоДействияКоммерскогоУчета1ПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
		энргРаботаСТочкамиУчетаКлиент.ПриИзмененииДатДействияКоммерческогоУчета(ТекущиеДанные, "НачалоДействияКоммерскогоУчета");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныКонецДействияКоммерскогоУчета1ПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
		
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	//	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииДатДействияКоммерческогоУчета(ТекущиеДанные, "КонецДействияКоммерскогоУчета");
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если Копирование Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.ВидДифференцированности   = Неопределено;
		ТекущиеДанные.ВидКанальности            = Неопределено;
		ТекущиеДанные.ВидДифференцированности   = Неопределено;
		ТекущиеДанные.ДатаВыпуска               = Неопределено;
		ТекущиеДанные.ДатаПоверкиСчетчика       = Неопределено;
		ТекущиеДанные.ДатаУстановкиПломбы       = Неопределено;
		ТекущиеДанные.ЗаводскойНомер            = "";
		ТекущиеДанные.КонецДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.КоэффициентПУ             = 1;
		ТекущиеДанные.НаименованиеТочки         = "";
		ТекущиеДанные.НачалоДействияКоммерскогоУчета = Неопределено;
		ТекущиеДанные.НетТехническойВозможностиУстановкиПУ = Ложь;
		ТекущиеДанные.НомерПломбы               = "";
		ТекущиеДанные.ОписаниеПрибора 			= "";
		ТекущиеДанные.ОписаниеТочки 			= "";
		ТекущиеДанные.ПриборУчета               = "";
		ТекущиеДанные.Расположение              = Неопределено;
		ТекущиеДанные.ТекущиеПоказания          = 0;
		ТекущиеДанные.ТочкаУчета                = Неопределено;
		ТекущиеДанные.УзелУчета                 = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТипУзлаУчета1ПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;		
	Если ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		Если не ЗначениеЗаполнено(ТекущиеДанные.ВладелецУзлаУчета) Тогда
			ТекущиеДанные.ВладелецУзлаУчета = Объект.Контрагент;
		КонецЕсли;
	Иначе		
		ТекущиеДанные.ВладелецУзлаУчета = ПредопределенноеЗначение("Справочник.энргКонтрагенты.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиУслугиОбъектов

&НаКлиенте
Процедура УслугиОбъектовПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеУслуги = Элементы.УслугиОбъектов.ТекущиеДанные;
	Если ТекДанныеУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанныеУслуги.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовНагрузкаПриИзменении(Элемент)
	ТекСтрока = Элементы.УслугиОбъектов.ТекущиеДанные;
	//Если Объект.МаксимальныеНагрузки.Количество() > 0 Тогда
		ПроверкаЗначенияОбычнойНагрузки("МаксимальныеНагрузки", "Максимальные нагрузки",ТекСтрока.Услуга, ТекСтрока.Нагрузка, ТекСтрока.IDСтроки, ТекСтрока.НомерСтроки);
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТарифныеКатегорииУслуги

&НаКлиенте
Процедура ТарифныеКатегорииУслугиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеТарифныеКатегории = Элементы.ТарифныеКатегорииУслуги.ТекущиеДанные;
	Если ТекДанныеТарифныеКатегории = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ТекДанныеТарифныеКатегории.IDСтроки = ТекДанные.IDСтроки;

КонецПроцедуры

&НаКлиенте
Процедура ТарифныеКатегорииУслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиМаксимальныеНагрузки

&НаКлиенте
Процедура МаксимальныеНагрузкиНагрузкаПриИзменении(Элемент)
	ТекСтрока = Элементы.МаксимальныеНагрузки.ТекущиеДанные;
	Если Объект.УслугиОбъектов.Количество() > 0 Тогда
		ПроверкаЗначенияНагрузки("УслугиОбъектов", "Нагрузки",ТекСтрока.Услуга, ТекСтрока.Нагрузка, ТекСтрока.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныеНагрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители = Элементы.МаксимальныеНагрузки.ТекущиеДанные;
	Если ТекДанныеПотребители = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекДанныеПотребители.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

&НаКлиенте
Процедура МаксимальныеНагрузкиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;
	
	СписокУслуг = ПолучитьСписокУслугДляВыбора(ТекДанные.IDСтроки);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Функция ПолучитьСписокУслугДляВыбора(IDСтрокиОбъекта)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтрокиВладельца", IDСтрокиОбъекта);
	НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	СписокУслуг = Новый СписокЗначений;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		СписокУслуг.Добавить(Стр.Услуга);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)";
	
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаКлиенте
Процедура СуммаПоКварталу()
	ТекСтрока 				= Элементы.ГарантированныеОбъемы.ТекущиеДанные;
	Если НЕ ТекСтрока		= Неопределено ТОгда
		ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
		ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
		ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
		ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
		//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
		
		ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
		ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
		ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ТаблицыФормы = Новый Массив;	
			ТаблицыФормы.Добавить("УслугиОбъектов");
			ТаблицыФормы.Добавить("ПотребителиГВС");
			ТаблицыФормы.Добавить("ГарантированныеОбъемы");
			ТаблицыФормы.Добавить("ТемпературныеГрафикиОбъектов");
			ТаблицыФормы.Добавить("УслугиРаспределенияПотерь");
			
			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.IDСтроки, Объект, ТаблицыФормы);
			
			ТаблицыФормы.Очистить();
			ТаблицыФормы.Добавить("ТочкиУчета");
			ТаблицыФормыВторогоУровня	= Новый Массив;
			ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
			ТаблицыФормыВторогоУровня.Добавить("ФормулыРасчетаУслуг");
			ТаблицыФормыВторогоУровня.Добавить("ОбъемыРаспределенияПотерь");
			
			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.IDСтроки, Объект, ТаблицыФормы,"Владельца", ТаблицыФормыВторогоУровня);

			УдалитьСтроку(ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаСервере
Процедура ПроверкаДублированияНаименованийОбъектовРасчета(Отказ)
	МассивОбъектовРасчета = Новый ТаблицаЗначений;
	МассивОбъектовРасчета.Колонки.Добавить("НаименованиеОбъектаРасчета");
	МассивОбъектовРасчета.Колонки.Добавить("АдресОбъекта");
	Для каждого стр из Объект.ОбъектыРасчета Цикл
		Отбор		= Новый Структура("НаименованиеОбъектаРасчета, АдресОбъекта", стр.НаименованиеОбъектаРасчета, стр.АдресОбъекта);
		ИщемСтроки 	= МассивОбъектовРасчета.НайтиСтроки(ОТбор);
		Если ИщемСтроки.Количество()> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В ТЧ 'Объекты расчета' обнаружено несколько объектов с наименованием '" + стр.НаименованиеОбъектаРасчета + "' и адресом: " + стр.АдресОбъекта + "! Необходимо переименовать объект расчета");
			Отказ = Истина;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(МассивОбъектовРасчета.Добавить(), Отбор);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеКварталов() 
	
	ОбновитьСуммуПоКварталу();

КонецПроцедуры


// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

&НаКлиенте
Процедура ПроверкаЗначенияОбычнойНагрузки(ИмяТЧ, ИмяТЧСиноним, ТекУслуга, ТекНагрузка, ТекIDСтроки, ТекНомерСтроки)
	Отбор 		 = Новый Структура("IDСтроки, Услуга", ТекIDСтроки, ТекУслуга);
	ИщемСтроку	 = Объект[ИмяТЧ].НайтиСтроки(Отбор);
	ТекСумма	 = Неопределено;
	Если ИщемСтроку.Количество() > 0 Тогда
		ТекСумма = ИщемСтроку[0].Нагрузка;
	КонецЕсли;
	Отбор.Вставить("ИмяТЧСиноним", ИмяТЧСиноним);
	Отбор.Вставить("ТекНагрузка", ТекНагрузка);
	Отбор.Вставить("ТекСумма", ТекСумма);
	Отбор.Вставить("ИщемСтроку", ИщемСтроку);
	Отбор.Вставить("ТекНомерСтроки", ТекНомерСтроки);
	ПроверкаИзмененияНагрузки(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМаксимальнуюНагрузку(ДополнительныеПараметры)
	Если ДополнительныеПараметры.Изменяем Тогда
		Если Не ДополнительныеПараметры.ТекСумма = Неопределено Тогда
			НоваяСТрока = ДополнительныеПараметры.ИщемСтроку[0];
		Иначе
			НоваяСтрока = Объект.МаксимальныеНагрузки.Добавить();
		КонецЕсли;
		
		НоваяСтрока.IDСтроки 	= ДополнительныеПараметры.IDСтроки;
		НоваяСтрока.Услуга 		= ДополнительныеПараметры.Услуга;
		НоваяСтрока.Нагрузка 	= ДополнительныеПараметры.ТекНагрузка;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная нагрузка добавлена в ТЧ '" + ДополнительныеПараметры.ИмяТЧСиноним + "'! Скорректируйте значение в ТЧ '" + ДополнительныеПараметры.ИмяТЧСиноним + "', если необходимо!");	
	Иначе
		Если ДополнительныеПараметры.ИщемСтроку <> Неопределено Тогда
			ИзменяемаяСтрока = Объект.УслугиОбъектов[ДополнительныеПараметры.ТекНомерСтроки - 1];
			ИзменяемаяСтрока.Нагрузка =  ДополнительныеПараметры.ИщемСтроку[0].Нагрузка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИзмененияНагрузки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросИзмененияНагрузки", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Изменение нагрузки изменит значение Максимальной нагрузки по данной услуге у текущего объекта. Изменить нагрузку?", РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросИзмененияНагрузки(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ДополнительныеПараметры.Вставить("Изменяем", Истина);
			ИзменитьМаксимальнуюНагрузку(ДополнительныеПараметры);
		Иначе
			ДополнительныеПараметры.Вставить("Изменяем", Ложь);
			ИзменитьМаксимальнуюНагрузку(ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗначенияНагрузки(ИмяТЧ, ИмяТЧСиноним,ТекУслуга, ТекНагрузка, ТекIDСтроки)
	Отбор 		= Новый Структура("IDСтроки, Услуга", ТекIDСтроки, ТекУслуга);
	ИщемСтроку	= Объект[ИмяТЧ].НайтиСтроки(Отбор);
	Если ИщемСтроку.Количество() > 0 Тогда
		ТекСумма= ИщемСтроку[0].Нагрузка;
	КонецЕсли;
	Если ТекСумма > ТекНагрузка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Максимальная нагрузка не может быть меньше нагрузки в ТЧ '" + ИмяТЧСиноним + "'! Необходимо скорректировать нагрузку!");
		ТекНагрузка	= ТекСумма; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеИтоговДоговорныхИтогов(Команда)
	ИтогиПоДоговору = Не ИтогиПоДоговору;
	ОбновитьЗаголовокКнопкиПереключенияИтогов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКнопкиПереключенияИтогов()
	Если ИтогиПоДоговору Тогда
		Элементы.ПереключениеИтоговДоговорныхИтогов.Заголовок = "Показать итоги по объекту";
		Элементы.ИтогиДоговорныхОбъемовПоДоговору.Видимость = Истина;
		Элементы.ИтогиДоговорныхОбъемов.Видимость = ложь;
	Иначе	
		Элементы.ПереключениеИтоговДоговорныхИтогов.Заголовок = "Показать итоги по договору";
		Элементы.ИтогиДоговорныхОбъемовПоДоговору.Видимость = Ложь;
		Элементы.ИтогиДоговорныхОбъемов.Видимость = Истина;
	КонецЕсли;	              
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДоговорныхОбъемов()
	ТЧ				= Объект.ГарантированныеОбъемы;
	ТЗ				= ИтогиДоговорныхОбъемов.Выгрузить();
	ТЗ.Очистить(); 
	Для каждого стр из ТЧ Цикл
		НовСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, стр);
		НовСтрока.ЕдиницаИзмерения = стр.Услуга.ЕдиницаИзмерения;
		НовСтрока.ИтогПервыйКвартал = стр.Январь + стр.Февраль + стр.Март;
		НовСтрока.ИтогВторойКвартал = стр.Апрель + стр.Май + стр.Июнь;
		НовСтрока.ИтогТретийКвартал = стр.Июль + стр.Август + стр.Сентябрь;
		НовСтрока.ИтогГод = стр.Январь + стр.Февраль + стр.Март + стр.Апрель + стр.Май + стр.Июнь + стр.Июль + стр.Август + стр.Сентябрь 
						+ стр.Октябрь + стр.Ноябрь + стр.Декабрь;
	КонецЦикла;
	ТЗ.Свернуть("IDСтроки, ЕдиницаИзмерения", "Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь, ИтогПервыйКвартал, ИтогВторойКвартал, ИтогТретийКвартал, ИтогГод");
	ИтогиДоговорныхОбъемов.Загрузить(ТЗ);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиДоговорныхОбъемовПоДоговору()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь) КАК Январь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль) КАК Февраль,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март) КАК Март,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель) КАК Апрель,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май) КАК Май,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь) КАК Июнь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль) КАК Июль,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август) КАК Август,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь) КАК Сентябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь) КАК Октябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь) КАК Ноябрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь) КАК Декабрь,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь) КАК ИтогГод,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март) КАК ИтогПервыйКвартал,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь) КАК ИтогВторойКвартал,
	|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август + бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь) КАК ИтогТретийКвартал
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга.ЕдиницаИзмерения";
	
	Результат = Запрос.Выполнить();
	Выгрузка	= Результат.Выгрузить();

	ИтогиДоговорныхОбъемовПоДоговору.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуПоКварталу()
	Для каждого ТекСтрока из Объект.ГарантированныеОбъемы Цикл
		ИтогПервыйКвартал 		= ТекСтрока.Январь + ТекСтрока.Февраль + ТекСтрока.Март;
		ИтогВторойКвартал 		= ТекСтрока.Апрель + ТекСтрока.Май + ТекСтрока.Июнь;
		ИтогТретийКвартал 		= ТекСтрока.Июль + ТекСтрока.Август + ТекСтрока.Сентябрь;
		ИтогЧетвертыйКвартал 	= ТекСтрока.Октябрь + ТекСтрока.Ноябрь + ТекСтрока.Декабрь;
		//ИтогГод 				= ИтогПервыйКвартал + ИтогВторойКвартал + ИтогТретийКвартал + ИтогЧетвертыйКвартал;
		
		ТекСтрока.ГарантированныйОбъемИтогПервыйКвартал 	= ИтогПервыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогВторойКвартал 	= ИтогВторойКвартал;
		ТекСтрока.ГарантированныйОбъемИтогТретийКвартал 	= ИтогТретийКвартал;
		ТекСтрока.ГарантированныйОбъемИтогЧетвертыйКвартал 	= ИтогЧетвертыйКвартал;
		ТекСтрока.ГарантированныйОбъемИтогГод				= ИтогПервыйКвартал+ИтогВторойКвартал +ИтогТретийКвартал + ИтогЧетвертыйКвартал;	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСУзлами

#Область ДобавлениеПУКУзлам

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить тип узла учета!");
		Возврат;		
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);	
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

#КонецОбласти

#Область ПереопределенныеПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПриИзменении(Элемент)
	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Для каждого стр из Объект.ОбъектыРасчета Цикл
		ОповеститьОбИзменении(стр.ОбъектРасчета);		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговорныеОбъемы(Команда)
	ТекОбъект = Элементы.ОбъектыРасчета.ТекущиеДанные;
	Если ТекОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	IDСтроки = ТекОбъект.IDСтроки;
	
	Модифицированность = Истина;
	Если ЗначениеЗаполнено(Объект.ГарантированныеОбъемы) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаОчисткуТаблицы", ЭтотОбъект, Новый Структура("IDСтроки", IDСтроки));
		ПоказатьВопрос(ОписаниеОповещения, "Очистить договорные объемы?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДоговорныеОбъемыНаСервере(, IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаОчисткуТаблицы(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ОчиститьТЧ = РезультатВопроса = КодВозвратаДиалога.Да;
	ЗаполнитьДоговорныеОбъемыНаСервере(ОчиститьТЧ, ДополнительныеПараметры.IDСтроки);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорныеОбъемыНаСервере(ОчиститьТЧ = Ложь, IDСтроки)

	Если ОчиститьТЧ Тогда
		МассивУдвления = Объект.ГарантированныеОбъемы.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
		
		Для каждого СтрокаТЧ Из МассивУдвления Цикл
			Объект.ГарантированныеОбъемы.Удалить(СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СтрокаОбъекта = Объект.ОбъектыРасчета.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
	
	Запрос = Новый Запрос;
	МВТ  = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная КАК ТемператураОптимальная
		|ПОМЕСТИТЬ ВТ_ОптимальнаяТемпература
		|ИЗ
		|	РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КатегорияПомещения = &КатегорияПомещения) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература КАК ПроектнаяТемпература
		|ПОМЕСТИТЬ ВТ_ПроектнаяТемпература
		|ИЗ
		|	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеНагрузки.Услуга КАК Услуга,
		|	МаксимальныеНагрузки.Нагрузка КАК Нагрузка,
		|	МаксимальныеНагрузки.IDСтроки КАК IDСтроки
		|ПОМЕСТИТЬ ВТ_МаксимальныеНагрузки
		|ИЗ
		|	&МаксимальныеНагрузки КАК МаксимальныеНагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц КАК ПорядокМесяц,
		|	бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.РасчетТепловойЭнергии КАК РасчетТепловойЭнергии,
		|	бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.КоличествоДней КАК КоличествоДней,
		|	ВЫБОР
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 1
		|			ТОГДА ""Январь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 2
		|			ТОГДА ""Февраль""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 3
		|			ТОГДА ""Март""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 4
		|			ТОГДА ""Апрель""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 5
		|			ТОГДА ""Май""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 6
		|			ТОГДА ""Июнь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 7
		|			ТОГДА ""Июль""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 8
		|			ТОГДА ""Август""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 9
		|			ТОГДА ""Сентябрь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 10
		|			ТОГДА ""Октябрь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 11
		|			ТОГДА ""Ноябрь""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц = 12
		|			ТОГДА ""Декабрь""
		|	КОНЕЦ КАК Месяц,
		|	ВЫБОР
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 3
		|			ТОГДА ""ГарантированныйОбъемИтогПервыйКвартал""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 6
		|			ТОГДА ""ГарантированныйОбъемИтогВторойКвартал""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 9
		|			ТОГДА ""ГарантированныйОбъемИтогТретийКвартал""
		|		КОГДА бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних.Месяц <= 12
		|			ТОГДА ""ГарантированныйОбъемИтогЧетвертыйКвартал""
		|	КОНЕЦ КАК Квартл
		|ПОМЕСТИТЬ ВТ_Месяцы
		|ИЗ
		|	РегистрСведений.бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестНастройкаКоличестваДнейДляРасчетаДоговорныхОбъемовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВидыУслуг.Ссылка КАК Услуга,
		|	ВТ_МаксимальныеНагрузки.Нагрузка КАК Нагрузка,
		|	энргВидыУслуг.ЗависитОтУслуги КАК ЗависитОтУслуги,
		|	энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_Месяцы.Месяц КАК Месяц,
		|	ВТ_Месяцы.КоличествоДней КАК КоличествоДней,
		|	ВТ_Месяцы.ПорядокМесяц КАК ПорядокМесяц,
		|	ЕСТЬNULL(ВТ_ПроектнаяТемпература.ПроектнаяТемпература, 0) КАК ПроектнаяТемпература,
		|	ЕСТЬNULL(ВТ_ОптимальнаяТемпература.ТемператураОптимальная, 0) КАК ТемператураВнутриПомещения,
		|	24 КАК КоличествоЧасов,
		|	ВТ_Месяцы.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	ВТ_МаксимальныеНагрузки КАК ВТ_МаксимальныеНагрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Месяцы КАК ВТ_Месяцы
		|			ПО энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху = ВТ_Месяцы.РасчетТепловойЭнергии
		|		ПО ВТ_МаксимальныеНагрузки.Услуга = энргВидыУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОптимальнаяТемпература КАК ВТ_ОптимальнаяТемпература
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроектнаяТемпература КАК ВТ_ПроектнаяТемпература
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВТ_МаксимальныеНагрузки.IDСтроки = &IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(бестСредегодоваяРазницаТемпературДляДоговорныхОбъемовСрезПоследних.Температура) КАК Температура,
		|	ВТ_Месяцы.Месяц КАК Месяц,
		|	ВТ_Месяцы.ПорядокМесяц КАК ПорядокМесяц
		|ПОМЕСТИТЬ ВТ_СреднегодоваяРазница
		|ИЗ
		|	РегистрСведений.бестСредегодоваяРазницаТемпературДляДоговорныхОбъемов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестСредегодоваяРазницаТемпературДляДоговорныхОбъемовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Месяцы КАК ВТ_Месяцы
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Месяцы.Месяц,
		|	ВТ_Месяцы.ПорядокМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемовСрезПоследних.Температура) КАК Температура,
		|	ВТ_Месяцы.Месяц КАК Месяц,
		|	ВТ_Месяцы.ПорядокМесяц КАК ПорядокМесяц
		|ПОМЕСТИТЬ ВТ_СреднемесячнаяТемпература
		|ИЗ
		|	РегистрСведений.бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемов.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район) КАК бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Месяцы КАК ВТ_Месяцы
		|		ПО (МЕСЯЦ(бестСреднемесячнаяТемператураВоздухаДляДоговорныхОбъемовСрезПоследних.Месяц) = ВТ_Месяцы.ПорядокМесяц)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Месяцы.Месяц,
		|	ВТ_Месяцы.ПорядокМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.Услуга КАК Услуга,
		|	ВТ_Услуги.Месяц КАК Месяц,
		|	ВТ_Услуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
		|	ВТ_Услуги.бестИспользоватьТемпературныйКоэффициентПоВоздуху КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_Услуги.КоличествоДней КАК КоличествоДней,
		|	ВТ_СреднегодоваяРазница.Температура КАК СреднегодоваяРазница,
		|	ВТ_СреднемесячнаяТемпература.Температура КАК СреднемесячнаяТемпература,
		|	ВТ_Услуги.ПроектнаяТемпература КАК ПроектнаяТемпература,
		|	ВТ_Услуги.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
		|	ВТ_Услуги.КоличествоЧасов КАК КоличествоЧасов,
		|	ВТ_Услуги.Нагрузка КАК Нагрузка,
		|	ВТ_Услуги.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_Услуги.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_ДанныеРасчета
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СреднегодоваяРазница КАК ВТ_СреднегодоваяРазница
		|		ПО ВТ_Услуги.ПорядокМесяц = ВТ_СреднегодоваяРазница.ПорядокМесяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СреднемесячнаяТемпература КАК ВТ_СреднемесячнаяТемпература
		|		ПО ВТ_Услуги.ПорядокМесяц = ВТ_СреднемесячнаяТемпература.ПорядокМесяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеРасчета.Услуга КАК Услуга,
		|	ВТ_ДанныеРасчета.Месяц КАК Месяц,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеРасчета.СреднемесячнаяТемпература ЕСТЬ NULL
		|				ИЛИ ВТ_ДанныеРасчета.ПроектнаяТемпература = ВТ_ДанныеРасчета.ТемператураВнутриПомещения
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ДанныеРасчета.Нагрузка * ВТ_ДанныеРасчета.КоличествоДней * ВТ_ДанныеРасчета.КоличествоЧасов * (ВТ_ДанныеРасчета.ТемператураВнутриПомещения - ВТ_ДанныеРасчета.СреднемесячнаяТемпература) / (ВТ_ДанныеРасчета.ТемператураВнутриПомещения - ВТ_ДанныеРасчета.ПроектнаяТемпература)
		|	КОНЕЦ КАК Объем,
		|	NULL КАК ЗависитОтУслуги,
		|	NULL КАК бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_ДанныеРасчета.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_ДанныеРасчета.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_ОбъемыБезОсновныхУслуг
		|ИЗ
		|	ВТ_ДанныеРасчета КАК ВТ_ДанныеРасчета
		|ГДЕ
		|	ВТ_ДанныеРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеРасчета.Услуга,
		|	ВТ_ДанныеРасчета.Месяц,
		|	ВТ_ДанныеРасчета.Нагрузка * ВТ_ДанныеРасчета.КоличествоДней * ВТ_ДанныеРасчета.КоличествоЧасов,
		|	ВТ_ДанныеРасчета.ЗависитОтУслуги,
		|	ВТ_ДанныеРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху,
		|	ВТ_ДанныеРасчета.ПорядокМесяц,
		|	ВТ_ДанныеРасчета.Квартл
		|ИЗ
		|	ВТ_ДанныеРасчета КАК ВТ_ДанныеРасчета
		|ГДЕ
		|	НЕ ВТ_ДанныеРасчета.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|	И ВТ_ДанныеРасчета.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ОбъемыБезОсновныхУслуг.Объем) КАК ОбъемПодчинённых,
		|	энргВидыУслуг.Ссылка КАК ОсновнаяУслуга,
		|	ВТ_ОбъемыБезОсновныхУслуг.Месяц КАК Месяц,
		|	ВТ_СреднегодоваяРазница.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_СреднегодоваяРазница.Температура КАК СреднегодоваяРазницаТемператур,
		|	ВТ_ОбъемыБезОсновныхУслуг.Квартл КАК Квартл
		|ПОМЕСТИТЬ ВТ_ОсновныеУслуги
		|ИЗ
		|	ВТ_ОбъемыБезОсновныхУслуг КАК ВТ_ОбъемыБезОсновныхУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ПО ВТ_ОбъемыБезОсновныхУслуг.ЗависитОтУслуги = энргВидыУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СреднегодоваяРазница КАК ВТ_СреднегодоваяРазница
		|		ПО ВТ_ОбъемыБезОсновныхУслуг.ПорядокМесяц = ВТ_СреднегодоваяРазница.ПорядокМесяц
		|ГДЕ
		|	НЕ ВТ_ОбъемыБезОсновныхУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|	И НЕ энргВидыУслуг.бестИспользоватьТемпературныйКоэффициентПоВоздуху
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВидыУслуг.Ссылка,
		|	ВТ_ОбъемыБезОсновныхУслуг.Месяц,
		|	ВТ_СреднегодоваяРазница.ПорядокМесяц,
		|	ВТ_СреднегодоваяРазница.Температура,
		|	ВТ_ОбъемыБезОсновныхУслуг.Квартл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеУслуги.ОсновнаяУслуга КАК Услуга,
		|	ВТ_ОсновныеУслуги.Месяц КАК Месяц,
		|	ВЫБОР
		|		КОГДА ВТ_ОсновныеУслуги.СреднегодоваяРазницаТемператур ЕСТЬ NULL
		|				ИЛИ ВТ_ОсновныеУслуги.СреднегодоваяРазницаТемператур = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ОсновныеУслуги.ОбъемПодчинённых / ВТ_ОсновныеУслуги.СреднегодоваяРазницаТемператур
		|	КОНЕЦ КАК Объем,
		|	ВТ_ОсновныеУслуги.ПорядокМесяц КАК ПорядокМесяц,
		|	ВТ_ОсновныеУслуги.Квартл КАК Квартл
		|ИЗ
		|	ВТ_ОсновныеУслуги КАК ВТ_ОсновныеУслуги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОбъемыБезОсновныхУслуг.Услуга,
		|	ВТ_ОбъемыБезОсновныхУслуг.Месяц,
		|	ВТ_ОбъемыБезОсновныхУслуг.Объем,
		|	ВТ_ОбъемыБезОсновныхУслуг.ПорядокМесяц,
		|	ВТ_ОбъемыБезОсновныхУслуг.Квартл
		|ИЗ
		|	ВТ_ОбъемыБезОсновныхУслуг КАК ВТ_ОбъемыБезОсновныхУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	Услуга,
		|	ПорядокМесяц
		|ИТОГИ
		|	СУММА(Объем)
		|ПО
		|	Услуга,
		|	Квартл";
	
	Запрос.УстановитьПараметр("Дата", 					Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("Район",					Объект.Район);
	Запрос.УстановитьПараметр("МаксимальныеНагрузки", 	Объект.МаксимальныеНагрузки.Выгрузить());
	Запрос.УстановитьПараметр("IDСтроки",				IDСтроки);
	Запрос.УстановитьПараметр("КатегорияПомещения",		СтрокаОбъекта[0].КатегорияОбъекта);
	
	
	//РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаУслуга = РезультатЗапроса[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаУслуга = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуга.Следующий() Цикл
		НайденныеСтроки = Объект.ГарантированныеОбъемы.НайтиСтроки(Новый Структура("Услуга, IDСтроки", ВыборкаУслуга.Услуга, IDСтроки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТЧ = Объект.ГарантированныеОбъемы.Добавить();
			СтрокаТЧ.Услуга = ВыборкаУслуга.Услуга;
			СтрокаТЧ.Год = Объект.Дата;
			СтрокаТЧ.IDСтроки = IDСтроки;
		Иначе
			СтрокаТЧ = НайденныеСтроки[0];
		КонецЕсли;
		
		ВыборкаКвартл = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКвартл.Следующий() Цикл
			СтрокаТЧ[ВыборкаКвартл.Квартл] = ВыборкаКвартл.Объем;
			
			Выборка = ВыборкаКвартл.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТЧ[Выборка.Месяц] = Выборка.Объем;
			КонецЦикла;
			
		КонецЦикла;
		
		СтрокаТЧ.ГарантированныйОбъемИтогГод = ВыборкаУслуга.Объем;
		
	КонецЦикла;
	
	ЗаполнитьИтогиДоговорныхОбъемов();
	ЗаполнитьИтогиДоговорныхОбъемовПоДоговору();
КонецПроцедуры 

&НаСервере
Функция ПолучитьЗначениеРеквизита(ТекОбъект, ИмяРеквизита)
	Возврат ТекОбъект[ИмяРеквизита];	
КонецФункции

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = ПолучитьЗначениеРеквизита(Объект.Район, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПомещениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		ТекущаяСтрока = Элементы.ОбъектыРасчета.ТекущиеДанные;
		ПараметрыПолученияДанных.Отбор.Вставить("Строение", ТекущаяСтрока.МКД);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПомещениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		ТекущаяСтрока = Элементы.ОбъектыРасчета.ТекущиеДанные;
		ПараметрыПолученияДанных.Отбор.Вставить("Строение", ТекущаяСтрока.МКД);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиОбъектовУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка)
	    СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.УслугиОбъектов.ТекущиеДанные;	
		Если НЕ ТекДанные = Неопределено Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("IDСтрокиВладельца", ТекДанные.IDСтроки);
			
			НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);	
			
			СписокУслуг = Новый СписокЗначений;
			
			Для Каждого Стр Из НайденныеСтроки Цикл
				СписокУслуг.Добавить(Стр.Услуга);
			КонецЦикла;
			
			ДанныеВыбора = ПолучитьСписокУслугДляВыбораНаСервере(СписокУслуг, Текст);
		КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокУслугДляВыбораНаСервере(СписокУслуг, Текст)			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)
	|	И энргВидыУслугСоставляющиеУслуг.Услуга.Наименование ПОДОБНО &Текст
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка
	|ИЗ
	|	Справочник.энргВидыУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)
	|	И энргВидыУслугСоставляющиеУслуг.Наименование ПОДОБНО &Текст";
	
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);	
	Запрос.УстановитьПараметр("Текст", Текст + "%");	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокУслуг.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
КонецФункции

&НаКлиенте
Процедура УслугиОбъектовУслугаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГарантированныеОбъемыУслугаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// ОТЭК, 03.06.2020, 000206136.
	Если ЗначениеЗаполнено(Текст) Тогда
		СформироватьДанныеВыбораУслуги(Текст, ДанныеВыбора, СтандартнаяОбработка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПомещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 			= Ложь;
	ТекДанные						= Элементы.ОбъектыРасчета.ТекущиеДанные;
	ФормаВыбора 					= ПолучитьФорму("Справочник.энргПомещения.ФормаВыбора",,Элемент);
	ЭлементОтбора 					= ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Строение");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ТекДанные.МКД;
	ФормаВыбора.Открыть();
КонецПроцедуры

#КонецОбласти

#КонецОбласти
