#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ЭтоСтартоваяЗадача = СтартоваяЗадача = Ссылка;
	Если Не ЗначениеЗаполнено(СтартоваяЗадача) Тогда
		Если ЗначениеЗаполнено(Основание) Тогда
			СтартоваяЗадача = Основание;
		Иначе
			НовСсылкаЗадачи = Задачи.энргЗадачаПИД.ПолучитьСсылку();
			УстановитьСсылкуНового(НовСсылкаЗадачи);
			СтартоваяЗадача = НовСсылкаЗадачи;
			ЭтоСтартоваяЗадача = Истина;
		КонецЕсли;
	КонецЕсли;
	Если (Не ЗначениеЗаполнено(Основание) И Не ЭтоСтартоваяЗадача) Или Основание.ПрекращенаДеятельность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено основание для задачи.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка на единственного потомка у основания
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|ГДЕ
		|	энргЗадачаПИД.Основание = &Основание
		|	И &Основание <> ЗНАЧЕНИЕ(Задача.энргЗадачаПИД.ПустаяСсылка)
		|	И энргЗадачаПИД.Ссылка <> &Ссылка
		|	И НЕ энргЗадачаПИД.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У основания """ + Основание + """ уже есть подчиненные задачи.");

		Отказ = Истина;
	    Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И  ((ПометкаУдаления = Истина И Ссылка.ПометкаУдаления <> ПометкаУдаления) Или 
		 (Выполнена = Ложь И Ссылка.Выполнена <> Выполнена) Или
		 (ПрекращенаДеятельность = Истина И Ссылка.ПрекращенаДеятельность <> ПрекращенаДеятельность)) Тогда
	
		Если ЕстьПодчиненныеЗадачи() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Есть подчиненные задачи.");
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТипЭтапа = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Этап, "Тип");
	
	Если НЕ ЗадачаЮЛ И НЕ ЗначениеЗаполнено(СуммаЗадолженности) Тогда
		ПериодЗадолженностиНачало = Дата(1,1,1);
		ПериодЗадолженностиКонец  = Дата(1,1,1);
		СуммаЗадолженности = 0;
		Для каждого СтрокаТЧ Из Задолженность Цикл
			СуммаЗадолженности = СуммаЗадолженности + СтрокаТЧ.Задолженность;
			ПериодЗадолженностиКонец  = Макс(КонецМесяца(СтрокаТЧ.ПериодНачисления), ПериодЗадолженностиКонец);
			ПериодЗадолженностиНачало = ?(ЗначениеЗаполнено(ПериодЗадолженностиНачало),
			Мин(СтрокаТЧ.ПериодНачисления, ПериодЗадолженностиНачало), СтрокаТЧ.ПериодНачисления);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЭтапа = Перечисления.энргТипыЭтапов.СудебнаяРабота Или ТипЭтапа = Перечисления.энргТипыЭтапов.ИсполнительнаяРабота Тогда
		
		Если ЗадачаЮЛ Тогда
			Наименование = "Судебное дело №" + НомерСудебногоДела + " от " + Формат(Дата, "ДФ=dd.MM.yy") + " по договору " + Договор;
		Иначе
			Наименование = "Судебное дело №" + НомерСудебногоДела + " от " + Формат(Дата, "ДФ=dd.MM.yy") + " абонента " + Абонент;
		КонецЕсли;
		
		Если ТипЭтапа = Перечисления.энргТипыЭтапов.ИсполнительнаяРабота Тогда
			 Наименование = "Исполнительное производство";
		КонецЕсли;		
		
		Если ТипЭтапа = Перечисления.энргТипыЭтапов.СудебнаяРабота Тогда
			Если Не ЗначениеЗаполнено(ВидСудопроизводства) Тогда
				ВидСудопроизводства = ПредопределенноеЗначение("Перечисление.энргВидыСудопроизводства.ПриказноеПроизводство");
			КонецЕсли;
			ДатаРасчетаПени = ?(ЗначениеЗаполнено(ДатаРасчетаПени), ДатаРасчетаПени, ТекущаяДата()); 
			Если ЗадачаЮЛ Тогда
				//РезультатЗадолженность = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Организация, Район, ПериодЗадолженностиКонец, Договор);
				//Выборка = РезультатЗадолженность.Выбрать(); 
				//Если Выборка.Следующий() Тогда
				//	СуммаЗадолженности = Выборка.Сумма;
				//КонецЕсли;
				РезультатПеня				= бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Организация, Район, КонецДня(ПериодЗадолженностиКонец), Договор);
				Выборка = РезультатПеня.Выбрать(); 
				Если Выборка.Следующий() Тогда
					СуммаПени = Выборка.Сумма;
				КонецЕсли;
			Иначе
				СуммаПени		= Задачи.энргЗадачаПИД.ПолучитьСуммуПениЗадачи(Организация, Район, Договор, ДатаРасчетаПени, Задолженность.Выгрузить(), ТаблицаРасчётаПени.Выгрузить());
			КонецЕсли;
			СуммаИска 		= СуммаЗадолженности + СуммаПени + Прочие;
			СуммаГоспошлина	= РегистрыСведений.энргНастройкаРасчетаГоспошлины.РассчитатьГоспошлину(СуммаИска, ТекущаяДата(), ВидСудопроизводства);
			
			Для каждого СтрокаСудыТЧ Из СудебныеИнстанции Цикл
				Если СтрокаСудыТЧ.Текущая Тогда
					СтрокаСудыТЧ.ОсновнойДолг = СуммаЗадолженности;
					СтрокаСудыТЧ.Прочие		  = Прочие;
					СтрокаСудыТЧ.Госпошлина   = СуммаГоспошлина;
					СтрокаСудыТЧ.Пени		  = СуммаПени;
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ЭтоНовый() Тогда
			НовСтатусСудебногоДела = Неопределено;
			ДополнительныеСвойства.Свойство("СтатусСудебногоДела", НовСтатусСудебногоДела);
			Если Не ЗначениеЗаполнено(НовСтатусСудебногоДела) Тогда
				ДополнительныеСвойства.Вставить("СтатусСудебногоДела", Справочники.энргСтатусыДелСудебнойРаботы.НаРассмотрении);
			КонецЕсли;			
		иначе
			// Если возврат то другой статус!	
			
			ЕстьСвойствоСтатуса = ДополнительныеСвойства.Свойство("СтатусСудебногоДела");
			
			Если ПометкаУдаления = Истина И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
				Если не ЕстьСвойствоСтатуса Тогда
					ДополнительныеСвойства.Вставить("СтатусСудебногоДела", Справочники.энргСтатусыДелСудебнойРаботы.ВернулиНаДоработку);
				иначе
					ДополнительныеСвойства.СтатусСудебногоДела = Справочники.энргСтатусыДелСудебнойРаботы.ВернулиНаДоработку;
				КонецЕсли;
				
				
			ИначеЕсли ПометкаУдаления = Ложь И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда 
				Если не ЕстьСвойствоСтатуса Тогда
					ДополнительныеСвойства.Вставить("СтатусСудебногоДела", Справочники.энргСтатусыДелСудебнойРаботы.НаРассмотрении);
				иначе
					ДополнительныеСвойства.СтатусСудебногоДела = Справочники.энргСтатусыДелСудебнойРаботы.НаРассмотрении;
				КонецЕсли;				
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
	// Снятие пометки "Выполнена" с задач помеченных на удаление
	Если ПометкаУдаления = Истина И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
	    Выполнена = Ложь;
	КонецЕсли;
	// Установка даты выполнения задачи
	Если Ссылка.Выполнена <> Выполнена Тогда
		Если Выполнена Тогда
			ДатаВыполнения = ТекущаяДатаСеанса();
		Иначе
			ДатаВыполнения = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Исполнитель) И ЗначениеЗаполнено(Этап) И Не ЗадачаЮЛ Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестОтветственныйПИРСрезПоследних.Ответственный КАК Ответственный,
			|	бестОтветственныйПИРСрезПоследних.Организация КАК Организация,
			|	бестОтветственныйПИРСрезПоследних.Район КАК Район
			|ПОМЕСТИТЬ ВТ_Ответственный
			|ИЗ
			|	РегистрСведений.бестОтветственныйПИР.СрезПоследних(&ТекДата, Строение = &Строение) КАК бестОтветственныйПИРСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Ответственный.Ответственный КАК Ответственный
			|ИЗ
			|	ВТ_Ответственный КАК ВТ_Ответственный
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргРолиПользователей КАК энргРолиПользователей
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
			|			ПО энргРолиПользователей.Роль = энргВидыОперацийПИД.Роль
			|		ПО (ВТ_Ответственный.Ответственный = энргРолиПользователей.Пользователь)
			|			И ВТ_Ответственный.Организация = энргРолиПользователей.Организация
			|			И ВТ_Ответственный.Район = энргРолиПользователей.Район
			|ГДЕ
			|	энргВидыОперацийПИД.Ссылка = &Этап";
		
		Запрос.УстановитьПараметр("Строение", МКД);
		Запрос.УстановитьПараметр("ТекДата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
		Запрос.УстановитьПараметр("Этап", Этап);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Исполнитель = Выборка.Ответственный;
		КонецЦикла;
	КонецЕсли;
	
	НеМояЗадача = Неопределено;
	ДополнительныеСвойства.Свойство("НеМояЗадача", НеМояЗадача);
	Если НеМояЗадача <> Истина И Не ЗначениеЗаполнено(Исполнитель) И Не ТребуетПодтверждения Тогда
		Исполнитель = ПользователиКлиентСервер.АвторизованныйПользователь();
	КонецЕсли;
	
	Если Не Отказ и ЭтоСтартоваяЗадача Тогда
		СписокОшибок = Задачи.энргЗадачаПИД.ЭтапПИР_СоответствуетТребованиям(ЭтотОбъект, Этап);
		Если ЗначениеЗаполнено(СписокОшибок) Тогда
			Отказ = Истина;
			Для каждого ТестОшибки Из СписокОшибок Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТестОшибки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Перем ПропуститьПроверкуНаДублирование;
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
		ДополнительныеСвойства.Свойство("ПропуститьПроверкуНаДублирование", ПропуститьПроверкуНаДублирование);
	Если Не (ПрекращенаДеятельность Или ПометкаУдаления Или Выполнена Или ЗначениеЗаполнено(ПропуститьПроверкуНаДублирование) ИЛИ Этап.Тип = Перечисления.энргТипыЭтапов.ОграничениеРежимаПотребления) И НЕ ЗадачаЮЛ Тогда
		Отказ = ПоДолгуУжеВедетсяПИР();
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Установка статуса судебного дела
	НовСтатусСудебногоДела = Неопределено;
	Если ДополнительныеСвойства.Свойство("СтатусСудебногоДела", НовСтатусСудебногоДела) Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	энргСтатусыСудебныхДелСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.энргСтатусыСудебныхДел.СрезПоследних(, СудебноеДело = &Ссылка) КАК энргСтатусыСудебныхДелСрезПоследних";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ТекСтатус = Выборка.Статус;
		Иначе
			ТекСтатус = Неопределено;
		КонецЕсли;
		
		Если (ЗначениеЗаполнено(ТекСтатус) Или ЗначениеЗаполнено(НовСтатусСудебногоДела)) И ТекСтатус <> НовСтатусСудебногоДела  Тогда
			ЗаписьРС = РегистрыСведений.энргСтатусыСудебныхДел.СоздатьМенеджерЗаписи(); 
			ЗаписьРС.СудебноеДело = Ссылка;
			ЗаписьРС.Статус		  = НовСтатусСудебногоДела;
			ЗаписьРС.Период		  = ТекущаяДатаСеанса();
			ЗаписьРС.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			
			ЗаписьРС.Записать();
		КонецЕсли;

	КонецЕсли;
	
	НеОтменятьПерерасчет = Ложь;
	ДополнительныеСвойства.Свойство("НеОтменятьПерерасчет", НеОтменятьПерерасчет);
	Если ЗначениеЗаполнено(Перерасчет) И Не Выполнена И НеОтменятьПерерасчет <> Истина Тогда
		ДокПомечен = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Перерасчет, "ПометкаУдаления", Истина);
		
		Попытка
			Если ДокПомечен = Ложь Тогда
				ДокОбъект = Перерасчет.ПолучитьОбъект();
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	Если ЕстьПодчиненныеЗадачи() Или ПометкаУдаления Или ПрекращенаДеятельность Тогда
		Возврат;
	КонецЕсли;	
	
	// Так как нет подчиненных задач, то создадим новую подчиненную задачу
	СледЭтап = Справочники.энргСхемыПИД.ПолучитьСледующийЭтап(Схема, Этап);
	Если Не ЗначениеЗаполнено(СледЭтап) Тогда
		Возврат;
	КонецЕсли;
	
	Задачи.энргЗадачаПИД.СоздатьПодчиненнуюЗадачу(Отказ, СледЭтап, ЭтотОбъект,,,, Истина); 
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Наименование			  = "";
	Основание				  = Неопределено;
	СтартоваяЗадача			  = Неопределено;
	Этап					  = Неопределено;
	ДатаСледЭтапа			  = Неопределено;
	ПрекращенаДеятельность	  = Ложь;
	ПериодЗадолженностиНачало = Неопределено;
	ПериодЗадолженностиКонец  = Неопределено;
	СуммаЗадолженности		  = 0;
	СуммаГоспошлина			  = 0;
	СуммаПени				  = 0;
	ПериодНачисления		  = ТекущаяДатаСеанса(); 
	
	ИменаТЧ = Новый Структура("ПланПогашенияЗадолженности, Начисления, ИсторияПеренаправленийЗадачи, СудебныеИнстанции, Задолженность, ФайлыПодэтапов, ИсполнительныеДокументы, Подэтапы");
	Для каждого ИмяТЧ Из ИменаТЧ Цикл
		ЭтотОбъект[ИмяТЧ.Ключ].Очистить();
	КонецЦикла;
	
	Задачи.энргЗадачаПИД.ЗаполнитьНаименованиеИЭтап(ЭтотОбъект, Справочники.энргВидыОперацийПИД.ПустаяСсылка());
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПринятьКИсполнению() Экспорт
	
	Исполнитель 		= Пользователи.ТекущийПользователь();
	ДатаПринятияВРаботу = ТекущаяДата();
	ПринятоВРаботу 		= Истина;
	Записать();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьПодчиненныеЗадачи()
	
	Перем Запрос, РезультатЗапроса;
	
	// Получаем подчиненные задачи
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|ГДЕ
		|	энргЗадачаПИД.Основание = &Ссылка
		|	И НЕ энргЗадачаПИД.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();	
КонецФункции

Функция ПоДолгуУжеВедетсяПИР()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДЗадолженность.Услуга КАК Услуга,
		|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления
		|ПОМЕСТИТЬ ВТ_ЗадолжностьПоЗадаче
		|ИЗ
		|	Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
		|ГДЕ
		|	энргЗадачаПИДЗадолженность.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ЗадачиПоАбоненту
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|ГДЕ
		|	энргЗадачаПИД.Ссылка <> &Ссылка
		|	И энргЗадачаПИД.Организация = &Организация
		|	И энргЗадачаПИД.Район = &Район
		|	И энргЗадачаПИД.Абонент = &Абонент
		|	И НЕ энргЗадачаПИД.ПометкаУдаления
		|	И НЕ энргЗадачаПИД.Выполнена
		|	И НЕ энргЗадачаПИД.ПрекращенаДеятельность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДЗадолженность.Услуга КАК Услуга,
		|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ЗадачиПоАбоненту.Ссылка КАК Задача
		|ИЗ
		|	ВТ_ЗадачиПоАбоненту КАК ВТ_ЗадачиПоАбоненту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадолжностьПоЗадаче КАК ВТ_ЗадолжностьПоЗадаче
		|			ПО энргЗадачаПИДЗадолженность.Услуга = ВТ_ЗадолжностьПоЗадаче.Услуга
		|				И энргЗадачаПИДЗадолженность.ПериодНачисления = ВТ_ЗадолжностьПоЗадаче.ПериодНачисления
		|		ПО ВТ_ЗадачиПоАбоненту.Ссылка = энргЗадачаПИДЗадолженность.Ссылка";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Ложь;
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По задолженности услуги """ + Выборка.Услуга 
				+ """ за период " + Формат(Выборка.ПериодНачисления, "ДФ='ММММ гггг'") + " уже ведется ПИР");

		Результат = Истина;			
	КонецЦикла;

	Возврат Результат
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли