#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьОтчет(ТабДок, ПараметрыОтчета) Экспорт
	ТабДок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ДатаНач", 		ПараметрыОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", 		КонецДня(ПараметрыОтчета.ДатаКонца));
	ГВС	= Новый Массив;
	ГВС.Добавить(ПараметрыОтчета.ТН);
	ГВС.Добавить(ПараметрыОтчета.ТЭ);
	Запрос.УстановитьПараметр("ГВС", 			ГВС);
	Запрос.УстановитьПараметр("Тепло", 			ПараметрыОтчета.Тепло);
	Запрос.Текст = "ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОбороты.Абонент КАК ФИО,
	|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ВЫРАЗИТЬ(энргАбонентыКонтактнаяИнформация.Представление КАК СТРОКА(500)) КАК Адрес,
	|	0 КАК НаличиеЗадолженности,
	|	0 КАК НаличиеСоглашенияОРассрочке,
	|	СУММА(ВЫБОР
	|			КОГДА энргВзаиморасчетыПоМесяцамОбороты.Услуга В (&ГВС)
	|				ТОГДА энргВзаиморасчетыПоМесяцамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоГВСРуб,
	|	СУММА(ВЫБОР
	|			КОГДА энргВзаиморасчетыПоМесяцамОбороты.Услуга = &Тепло
	|				ТОГДА энргВзаиморасчетыПоМесяцамОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоОтоплениеРуб
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты(&ДатаНач, &ДатаКон, , Организация = &Организация) КАК энргВзаиморасчетыПоМесяцамОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|		ПО энргВзаиморасчетыПоМесяцамОбороты.Абонент = энргАбонентыКонтактнаяИнформация.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыПоМесяцамОбороты.Абонент,
	|	ВЫРАЗИТЬ(энргАбонентыКонтактнаяИнформация.Представление КАК СТРОКА(500)),
	|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.ФИО КАК ФИО,
	|	ВрТ0.ПериодНачисления КАК ПериодНачисления,
	|	ВрТ0.Адрес КАК Адрес,
	|	ВрТ0.НаличиеЗадолженности КАК НаличиеЗадолженности,
	|	ВрТ0.НаличиеСоглашенияОРассрочке КАК НаличиеСоглашенияОРассрочке,
	|	ВрТ0.НачисленоГВСРуб КАК НачисленоГВСРуб,
	|	ВрТ0.НачисленоОтоплениеРуб КАК НачисленоОтоплениеРуб
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЖильцыПолучающиеСудсидии.СрезПоследних(&ДатаКон, ) КАК бестЖильцыПолучающиеСудсидииСрезПоследних
	|		ПО ВрТ0.ФИО = бестЖильцыПолучающиеСудсидииСрезПоследних.Абонент
	|			И (бестЖильцыПолучающиеСудсидииСрезПоследних.Организация = &Организация)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	
	Макет	= Отчеты.бестОтчетДляНРИЦПоСубсидиям.ПолучитьМакет("Макет");
	
	Область	= Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
		Область	= Макет.ПолучитьОбласть("СтрокаТЧ");
		Область.Параметры.НомерСтроки = НомерСтроки;
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Область	= Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.ТекПользователь = Пользователи.ТекущийПользователь();
	ТабДок.Вывести(Область);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли