
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестПерерасчетЭЭ(ЭтотОбъект);
	УстановитьВидимость();
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПерерасчетаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перерасчитать(Команда)
	ПерерасчитатьНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ПерерасчитатьНаСервере()
	
	Объект.Движения.бестОбъемНачисленийЭлектроэнергии.Очистить();
	бестНачисленияНП.ДанныеПерерасчетаЭЭ(Объект.Организация, Объект.Район, Объект.ОснованиеПерерасчета,
		Объект.ПериодНачисления, Объект.Движения.бестОбъемНачисленийЭлектроэнергии, Объект.КорректируемыеПоказания);
	
	Для каждого Запись из Объект.Движения.бестОбъемНачисленийЭлектроэнергии Цикл
		Запись.Период 			= Объект.Дата;
		Запись.ПериодРасчета 	= Объект.ПериодНачисления;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"КорректируемыеПоказания", "Видимость", ТипЗнч(Объект.ОснованиеПерерасчета) = Тип("ДокументСсылка.бестРегистрацияПоказанийНП"));
КонецПроцедуры

#КонецОбласти
