#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	ДатаПоследнегоИзменения	= ТекущаяДата();

	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	

	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,НачалоМесяца(От),Ложь);
	
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,До,Ложь);
	
	КонецПериодаРасчета  							= ГраницыПериода.ЗавершениеОП;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоПениОбороты.СуммаПриход - энргВзаиморасчетыПоПениОбороты.СуммаРасход КАК Сумма,
		|	энргВзаиморасчетыПоПениОбороты.МКД КАК МКД,
		|	энргВзаиморасчетыПоПениОбороты.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоПениОбороты.Район КАК Район,
		|	энргВзаиморасчетыПоПениОбороты.Организация КАК Организация,
		|	энргВзаиморасчетыПоПениОбороты.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоПениОбороты.Услуга КАК Услуга
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоПени.Обороты(
		|			&От,
		|			&До,
		|			,
		|			МКД = &МКД
		|				И Район = &Район
		|				И Организация = &Организация
		|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоПениОбороты";
	
	Запрос.УстановитьПараметр("До", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("МКД", МКД);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("От", НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись  						= Движения.энргВзаиморасчетыПоПени.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.Период					= Дата;
		Запись.ВидДвижения				= ВидДвиженияНакопления.Расход;
		//Запись.ВидОперации				= Перечисления.энргВидыОперацийНачисления.СудебноеРешение;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКорректировкаПениПоСудебномуРешению.Дата КАК Период,
		|	энргКорректировкаПениПоСудебномуРешению.Организация КАК Организация,
		|	энргКорректировкаПениПоСудебномуРешению.Район КАК Район,
		|	энргКорректировкаПениПоСудебномуРешению.МКД КАК МКД,
		|	энргКорректировкаПениПоСудебномуРешению.От КАК От,
		|	энргКорректировкаПениПоСудебномуРешению.До КАК До,
		|	энргКорректировкаПениПоСудебномуРешению.Абонент КАК Абонент,
		|	энргКорректировкаПениПоСудебномуРешению.Сумма КАК Сумма,
		|	энргКорректировкаПениПоСудебномуРешению.УчитыватьВБУ КАК УчитыватьВБУ,
		|	энргКорректировкаПениПоСудебномуРешению.Услуга КАК Услуга
		|ИЗ
		|	Документ.энргКорректировкаПениПоСудебномуРешению КАК энргКорректировкаПениПоСудебномуРешению
		|ГДЕ
		|	энргКорректировкаПениПоСудебномуРешению.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись  						= Движения.энргВзаиморасчетыПоПени.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.ВидДвижения				= ВидДвиженияНакопления.Приход;
		Запись.ПериодНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(От, Организация,Район);
		//Запись.ВидОперации				= Перечисления.энргВидыОперацийНачисления.СудебноеРешение;		
		Если НЕ ДоначислятьПени Тогда
			Запись  						= Движения.энргОстановленныеРасчетыПени.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		КонецЕсли;
	КонецЦикла;

	

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли