#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("ПредКонтрагент, ТекКонтрагент"), Метаданные.Документы.бестОперацияСОбъектамиНП);
	// -- Акимов Д.В.
	
	//энргОбщегоНазначения.УстановитьСписокРайонов(Объект.Район,Элементы.Район);
	//	
	//Если Параметры.Ключ.Пустая() Тогда
	//	Объект.Дата = ТекущаяДата();
	//	//Объект.ДатаФактическогоСобытия = Объект.Дата;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Объект.Организация) Тогда
	//	Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
	//		ЗаполнитьПериодНачисленияСервер();
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Объект.Договор) и Не ЗначениеЗаполнено(ПредКонтрагент) Тогда
	//	ПредКонтрагент = Объект.Договор.Контрагент;
	//КонецЕсли;
	//Если ЗначениеЗаполнено(Объект.ДоговорНов) и Не ЗначениеЗаполнено(ТекКонтрагент) Тогда
	//	ТекКонтрагент = Объект.Договор.Контрагент;
	//КонецЕсли;
	//
	//// ВводНаОсновании
	//ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	//// Конец ВводНаОсновании

	// ++ gradum 000213955 2020.07.09 Раскомментировано
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// -- gradum 000213955 svb 2020.07.09
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	// ++ gradum 000213955 2020.07.10
	ДоговорПриИзмененииНаКлиентеНаСервере(ЭтаФорма, Неопределено);
	Если ЗначениеЗаполнено(Объект.ДоговорНов) Тогда
		ТекКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДоговорНов, "Контрагент");
	КонецЕсли;
	УстановитьПараметрыВыбораДоговора(ЭтаФорма, Неопределено, элементы.ДоговорНов, ТекКонтрагент);
	// -- gradum 000213955 svb 2020.07.10
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// ++ gradum 000213955 2020.07.09
	индексОбъекта = Новый Соответствие;
	// Пустые - удаляем, ПОВТОРЫ - так же, оставляя первое упоминание
	индексОбъекта.Вставить(ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка"), Истина);
	ИндексСтроки = 0; былиКорректировки = Ложь;
	Пока ИндексСтроки<Объект.ОбъектыРасчета.Количество() Цикл
		строкаТЧ = Объект.ОбъектыРасчета.Получить(ИндексСтроки);
		Если индексОбъекта.Получить(строкаТЧ.ОбъектРасчета) = Истина Тогда
			Объект.ОбъектыРасчета.Удалить(ИндексСтроки);
			былиКорректировки = Истина;
		Иначе
			индексОбъекта.Вставить(строкаТЧ.ОбъектРасчета, Истина);
			ИндексСтроки = ИндексСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	Если былиКорректировки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Были удалены повторы Объектов расчета");
	КонецЕсли;
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) <> Объект.ДатаФактическогоСобытия тогда
	//	ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроведения",ЭтотОбъект);
	//	ПоказатьВопрос(ОписаниеОповещения,"Дата документа отличается от фактической даты! Провести документ?",РежимДиалогаВопрос.ДаНет);
	//КонецЕсли;
	// -- gradum 000213955 svb 2020.07.09
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	// ++ gradum 000213955 2020.07.09
	//Если ЗначениеЗаполнено(Объект.Договор) тогда
	//	бестПользовательскийВводКлиент.ПриИзмененииДоговораКонтрагента(Объект,"ДатаФактическогоСобытия"); 
	//	ДоговорНовПриИзмененииНаСервере();
	//КонецЕсли;
	ДоговорПриИзмененииНаКлиентеНаСервере(ЭтаФорма, Элемент); 
	// -- gradum 000213955 svb 2020.07.09
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ++ gradum 000213955 2020.07.10
	//бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент, Объект.Организация, ПредКонтрагент, СтандартнаяОбработка);
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент, Неопределено, ПредКонтрагент, СтандартнаяОбработка);
	// -- gradum 000213955 svb 2020.07.10
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбъектыРасчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"ОбъектыРасчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры             

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

// ++ gradum 000213955 2020.07.09
&НаСервереБезКонтекста
Функция ПолучитьАктивныеОбъектыРасчетаНаСервере(Период, Организация, Район, Договор)
	индексОбъектРасчета = Новый Соответствие;
	индексОбъектРасчета.Вставить(ПредопределенноеЗначение("Справочник.бестОбъектыРасчета.ПустаяСсылка"), Истина);
	РезультатФункции = Новый Массив;
	МВТ = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.бестВладельцыОбъектовРасчета.ПолучитьВладельцевОбъектовРасчета(МВТ, Период, Организация, Район,,Договор,"ВладельцыОбъектовРасчета");
	РезультатЗапроса	= РегистрыСведений.бестАктивностьОбъектовРасчета.ПолучитьАктивныеОбъектыРасчета(МВТ, Период, Организация, Район,Истина);
	Выборка 			= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если индексОбъектРасчета.Получить(Выборка.ОбъектРасчета) = Истина Тогда
			Продолжить;
		КонецЕсли;
		РезультатФункции.Добавить(Выборка.ОбъектРасчета);
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции	//-- gradum 000213955 2020.07.09

&НаКлиенте
Процедура ДоговорНовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ++ gradum 000213955 2020.07.10
	//бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент,Объект.Организация,ТекКонтрагент, СтандартнаяОбработка);
	бестПользовательскийВводКлиент.НачалоВыбораДоговора(Элемент, Неопределено, ТекКонтрагент, СтандартнаяОбработка);
	// -- gradum 000213955 svb 2020.07.10
КонецПроцедуры

&НаКлиенте
Процедура ПредКонтрагентПриИзменении(Элемент)
	// ++ gradum 000213955 2020.07.09
	Объект.Договор = Неопределено;
	ДоговорПриИзменении(Элемент);
	// -- gradum 000213955 svb 2020.07.09
КонецПроцедуры

&НаКлиенте
Процедура ТекКонтрагентПриИзменении(Элемент)
	// ++ gradum 000213955 2020.07.09
	Объект.ДоговорНов = Неопределено;
	ДоговорНовПриИзменении(Неопределено);
	УстановитьПараметрыВыбораДоговора(ЭтаФорма, Неопределено, Элементы.ДоговорНов, ТекКонтрагент);
	// -- gradum 000213955 svb 2020.07.09
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНовПриИзменении(Элемент)
	// ++ gradum 000213955 2020.07.09
	Если ЗначениеЗаполнено(Объект.ДоговорНов) Тогда    
		ТекКонтрагент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДоговорНов,"Контрагент");
	Иначе
		
	КонецЕсли;
	// -- gradum 000213955 svb 2020.07.09
КонецПроцедуры

// ++ gradum 000213955 2020.07.09
&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПараметрыВыбораДоговора(Форма, Элемент, ЭлементДоговор, ЗначениеКонтрагент)

	массивПараметрыВыбора = Новый Массив;
	Если ЗначениеЗаполнено(ЗначениеКонтрагент) Тогда
		массивПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", ЗначениеКонтрагент));
	КонецЕсли;
	ЭлементДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(массивПараметрыВыбора);

КонецФункции //-- gradum 000213955 svb 2020.07.09

// ++ gradum 000213955 2020.07.09
&НаКлиентеНаСервереБезКонтекста
Функция ДоговорПриИзмененииНаКлиентеНаСервере(Форма, Элемент = Неопределено)

	Если ЗначениеЗаполнено(Форма.Объект.Договор) Тогда
		реквДоговор = Форма.Объект.Договор;
		массивОбъектовРасчета = ПолучитьАктивныеОбъектыРасчетаНаСервере(
			?(ЗначениеЗаполнено(Форма.Объект.ДатаФактическогоСобытия), Форма.Объект.ДатаФактическогоСобытия, 
				?(ЗначениеЗаполнено(Форма.Объект.Дата), Форма.Объект.Дата, ТекущаяДата()))
			, реквДоговор.Организация, реквДоговор.Район, Форма.Объект.Договор
		);
		Форма.ПредКонтрагент = реквДоговор.Контрагент;
	Иначе
		реквДоговор = Новый Структура("Контрагент, Организация, Район"
			, Неопределено, Неопределено, Неопределено
		);
		массивОбъектовРасчета = Новый Массив; массивОбъектовРасчета.Добавить(Неопределено);
	КонецЕсли;
	
	массПараметрыВыбора = Новый Массив;
	массПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", массивОбъектовРасчета));
	Форма.Элементы.ОбъектыРасчетаОбъектРасчета.ПараметрыВыбора = Новый ФиксированныйМассив(массПараметрыВыбора);
	
	Если Неопределено = Элемент Тогда
		// Например, ПриЧтенииНаСервере
	Иначе
		// Интерактивно, перезаплняем Объекты расчета
		Форма.Объект.ОбъектыРасчета.Очистить();
		Для Каждого эл Из массивОбъектовРасчета Цикл
			Форма.Объект.ОбъектыРасчета.Добавить().ОбъектРасчета = эл;
		КонецЦикла;
		
	КонецЕсли;
	
	массПараметрыВыбора = Новый Массив;
	Если ЗначениеЗаполнено(Форма.ПредКонтрагент) Тогда
		массПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", Форма.ПредКонтрагент));
	КонецЕсли;
	Форма.Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(массПараметрыВыбора);
	
КонецФункции //-- gradum 000213955 svb 2020.07.09

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	// ++ gradum 000213955 2020.07.10
	Если ЗначениеЗаполнено(Объект.Район) Тогда
		Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	Иначе
		Объект.Организация = Неопределено;
	КонецЕсли;
	// -- gradum 000213955 svb 2020.07.10
КонецПроцедуры

#КонецОбласти