#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Процедура МассивПриборов() Экспорт 
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ВыводПрибораУчета",	?(ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗакрытиеДоговора,Истина,ложь));
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗакрытиеДоговора Тогда 
		Запрос.Текст  	= 
		"ВЫБРАТЬ
		|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ТаблицаОбъектыРасчета.МКД КАК МКД
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК ТаблицаТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ПО ТаблицаТочкиУчета.IDСтрокиВладельца = ТаблицаОбъектыРасчета.IDСтроки
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|			И (НЕ ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
		|			И (ТаблицаОбъектыРасчета.Ссылка = &Ссылка)
		|			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)" ;
		
	иначе
		Запрос.Текст  	=
		"ВЫБРАТЬ
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель,
		|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаОбъектыРасчета.МКД КАК МКД
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК ТаблицаТочкиУчета
		|		ПО ТаблицаОбъектыРасчета.Ссылка = ТаблицаТочкиУчета.Ссылка
		|			И ТаблицаОбъектыРасчета.IDСтроки = ТаблицаТочкиУчета.IDСтрокиВладельца
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка)
		|				И НЕ ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());

КонецПроцедуры

// Вставляет в дополнительные свойсва массив объектов расчета.
//
Функция МассивОбъектовРасчета() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗаключениеДоговоровСЮридическимиЛицами.Дата КАК Период,
	|	бестЗаключениеДоговоровСЮридическимиЛицами.Организация КАК Организация,
	|	бестЗаключениеДоговоровСЮридическимиЛицами.Район КАК Район,
	|	бестЗаключениеДоговоровСЮридическимиЛицами.ПериодНачисления КАК ПериодНачисления,
	|	бестЗаключениеДоговоровСЮридическимиЛицами.Дата КАК ПериодРегистрации,
	|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.МКД КАК МКД
	|ИЗ
	|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами КАК бестЗаключениеДоговоровСЮридическимиЛицами
	|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицами.Ссылка
	|ГДЕ
	|	бестЗаключениеДоговоровСЮридическимиЛицами.Ссылка = &Ссылка";
	
	ДополнительныеСвойства.Вставить("МассивОбъектов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 	
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	ДополнительныеСвойства.Вставить("МассивОбъектовРасчета",Истина);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение Тогда
		ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды",Ложь);
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия),Ссылка), ВидГраницы.Исключая) ;
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= Новый Граница(МоментВремени(), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение Тогда
		ДоговорЗаключен		= РегистрыСведений.бестСостояниеДоговоров.ДоговорЗаключен(Момент, Организация, Район, Договор); 
	КонецЕсли;
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ОткрытиеДоговора
		ИЛИ ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_РегистрацияОбъекта Тогда
		
		Если ДоговорЗаключен Тогда
			Отказ			= истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " договор уже заключен!");
		КонецЕсли;
		
		Если не СоставУзлаКорректен() тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ тогда
			Возврат;
		КонецЕсли;
		
		ЗаключениеДоговора();
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗакрытиеДоговора 
		ИЛИ ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ПерезаключениеДоговора Тогда
		Если Не ДоговорЗаключен Тогда
			Отказ			= истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " договор не заключен!");
		КонецЕсли;
		
		Для Каждого СтрокаТЧ из ПоказанияПриборовУчета цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТекущиеПоказания) Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнены текущие показания",ЭтотОбъект,"ПоказанияПриборовУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТекущиеПоказания");				
			КонецЕсли;	
		КонецЦикла;

		
		Если Отказ тогда
			Возврат;
		КонецЕсли;
		
		РасторжениеПерезаключениеДоговора(ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ПерезаключениеДоговора);			
		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение или ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_АктБездоговорногоПотребления Тогда
		
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			УстановитьСсылкуНового(Документы.бестЗаключениеДоговоровСЮридическимиЛицами.ПолучитьСсылку(Новый УникальныйИдентификатор));
			ТекущаяСсылка	= ПолучитьСсылкуНового();
		Иначе
			ТекущаяСсылка	= Ссылка;
		КонецЕсли;
	
		БизнесПроцессы.бестЗаключениеДоговора.ИнициализироватьБППоДоговору(Организация, Район, Договор, ТекущаяСсылка);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Договор		= Справочники.энргДоговорыКонтрагентов.ПустаяСсылка();
	Контрагент	= Справочники.энргКонтрагенты.ПустаяСсылка();
	
	ГарантированныеОбъемы.Очистить();
	ТемпературныеГрафикиОбъектов.Очистить();
	МаксимальныеНагрузки.Очистить();
	НастройкиОплаты.Очистить();
	РаспределениеПоступившейОплаты.Очистить();
	НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Очистить();
	ЭтапыПИД.Очистить();
	УслугиРаспределенияПотерь.Очистить();
	ОбъемыРаспределенияПотерь.Очистить();
	
	Для Каждого стр из ОбъектыРасчета Цикл 
		стр.ОбъектРасчета = Справочники.бестОбъектыРасчета.ПустаяСсылка();
		стр.НаименованиеОбъектаРасчета = "";
		стр.Площадь		= 0;
		стр.МКД			= Справочники.энргСтроения.ПустаяСсылка();
		
	КонецЦикла;	
	Для Каждого стр из ТочкиУчета цикл
		стр.ТочкаУчета	 	= Справочники.энргТочкиУчета.ПустаяСсылка();
		стр.ПриборУчета 	= Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();		
	КонецЦикла;
	Для Каждого стр из ПриборыУзловУчета цикл		
		стр.ПриборУчета 	= Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();		
	КонецЦикла;
	Для Каждого стр из ПоказанияПриборовУчета цикл
		стр.ТекущиеПоказания= 0;	
	КонецЦикла;
	Для Каждого стр из УслугиОбъектов Цикл
		стр.Нагрузка = 0;	
	КонецЦикла;
	Для Каждого стр из ТарифныеКатегорииУслуги Цикл
		стр.ВидБлагоустройства = Справочники.энргВидыБлагоустройств.ПустаяСсылка();
		стр.ТарифнаяКатегория = Справочники.энргГруппыПотребителей.ПустаяСсылка();
		стр.РасчетПоФактическомуПотреблению = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.добавить("Организация");
	ПроверяемыеРеквизиты.добавить("Контрагент");
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ПерезаключениеДоговора ИЛИ ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаменаДоговораУОбъекта Тогда 
		ПроверяемыеРеквизиты.добавить("ТекущийДоговор");
		ПроверяемыеРеквизиты.добавить("Район");
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_РегистрацияОбъекта Тогда	
		Если РассчитыватьПени И ВариантРасчета = ПредопределенноеЗначение("Перечисление.бестВариантыРасчетаПени.ОтСтавкиРефинансирования") Тогда
			ПроверяемыеРеквизиты.добавить("ГруппаПотребителей");	
		КонецЕсли; 
		Если РассчитыватьПени Тогда 
			ПроверяемыеРеквизиты.добавить("ВариантРасчета");
        КонецЕсли;	
	ИначеЕсли ВидОперации <> Перечисления.бестВидыОпераций.ОперацияСДоговором_ЗаявкаНаЗаключение Тогда
		ПроверяемыеРеквизиты.добавить("Договор");
	КонецЕсли;
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_ОткрытиеДоговора Тогда 
		ПроверяемыеРеквизиты.добавить("Район");
		
		Если Не ЗначениеЗаполнено(ОбъектыРасчета) Тогда
			Отказ = Истина;
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список ""Объект расчета""", ЭтотОбъект, "ОбъектыРасчета");
		КонецЕсли;
		Для Каждого СтрокаТЧ из ОбъектыРасчета цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НаименованиеОбъектаРасчета) и НЕ ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчета) Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Объект расчета""",ЭтотОбъект,"ОбъектыРасчета["+(СтрокаТЧ.НомерСтроки-1)+"].ОбъектРасчета");				
			КонецЕсли;			
		КонецЦикла;
		Если Не ЗначениеЗаполнено(ТочкиУчета) Тогда
			Отказ = Истина;
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не введено ни одной строки в список ""Услуги""", ЭтотОбъект, "ТочкиУчета");
		КонецЕсли;
		Для Каждого СтрокаТЧ из ТарифныеКатегорииУслуги цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТарифнаяКатегория) Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Тарифная категория""",ЭтотОбъект,"ТарифныеКатегорииУслуги["+(СтрокаТЧ.НомерСтроки-1)+"].ТарифнаяКатегория");				
			КонецЕсли;			
		КонецЦикла;
		Для Каждого СтрокаТЧ из УслугиОбъектов цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Услуга""",ЭтотОбъект,"УслугиОбъектов["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
			КонецЕсли;			
		КонецЦикла;
		
	КонецЕсли;

	Для Каждого СтрокаТЧ из ТочкиУчета цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
			Отказ 		= истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле Услуга",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
		КонецЕсли;
		Если Константы.бестИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ.Получить() Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтруктураСети) Тогда
				Отказ 		= истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле Структура Сети",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].СтруктураСети");
			КонецЕсли;
		КонецЕсли;  
		Если энргОбщегоНазначения.ЗначениеКонстанты("бестНезависимыйСбыт") Тогда
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ТипТарифа) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле Тип тарифа",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТипТарифа");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бестЗаключениеДоговоровСЮридическимиЛицами") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Ссылка, Дата, Номер, ПометкаУдаления,ВидОперации,Комментарий,Ответственный,ДатаФактическогоСобытия");
		мТЧ = Новый Массив;
		мТч.Добавить("ОбъектыРасчета");
		мТч.Добавить("ТочкиУчета");
		мТч.Добавить("ТочкиПоставки");
		мТч.Добавить("ПоставщикиСоставныхУслуг");
		мТч.Добавить("ДоговорыСоставныхУслуг");
		мТч.Добавить("ГарантированныеОбъемы");
		мТч.Добавить("НастройкиОплаты");
		мТч.Добавить("НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов");
		мТч.Добавить("ШкалыПриборовУчета");
		мТч.Добавить("ПоказанияПриборовУчета");
		мТч.Добавить("ШкалыИзмерителей");
		мТч.Добавить("Измерители");
		мТч.Добавить("НомераПломб");
		мТч.Добавить("Субабоненты");
		мТч.Добавить("ЗначенияИзмерителей");
		мТч.Добавить("Потери");
		ЗаполнитьТЧ(ЭтотОбъект,ДанныеЗаполнения,мТЧ);
		//ОбъектыРасчета.Загрузить(ДанныеЗаполнения.ОбъектыРасчета.Выгрузить());
		//ТочкиУчета.Загрузить(ДанныеЗаполнения.ТочкиУчета.Выгрузить());
		//ТочкиПоставки.Загрузить(ДанныеЗаполнения.ТочкиПоставки.Выгрузить());
		//ПоставщикиСоставныхУслуг.Загрузить(ДанныеЗаполнения.ПоставщикиСоставныхУслуг.Выгрузить());
		//ДоговорыСоставныхУслуг.Загрузить(ДанныеЗаполнения.ДоговорыСоставныхУслуг.Выгрузить());	
		//ГарантированныеОбъемы.Загрузить(ДанныеЗаполнения.ГарантированныеОбъемы.Выгрузить());
		//НастройкиОплаты.Загрузить(ДанныеЗаполнения.НастройкиОплаты.Выгрузить());
		//НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Загрузить(ДанныеЗаполнения.НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Выгрузить());
		//ШкалыПриборовУчета.Загрузить(ДанныеЗаполнения.ШкалыПриборовУчета.Выгрузить());
		//ПоказанияПриборовУчета.Загрузить(ДанныеЗаполнения.ПоказанияПриборовУчета.Выгрузить());	
		//ШкалыИзмерителей.Загрузить(ДанныеЗаполнения.ШкалыИзмерителей.Выгрузить());
		//Измерители.Загрузить(ДанныеЗаполнения.Измерители.Выгрузить());
		//НомераПломб.Загрузить(ДанныеЗаполнения.НомераПломб.Выгрузить());
		//Субабоненты.Загрузить(ДанныеЗаполнения.Субабоненты.Выгрузить());
		//ЗначенияИзмерителей.Загрузить(ДанныеЗаполнения.ЗначенияИзмерителей.Выгрузить());
		//Потери.Загрузить(ДанныеЗаполнения.Потери.Выгрузить());
		
		ВидОперации = Перечисления.бестВидыОпераций.ОперацияСДоговором_РегистрацияОбъекта;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заключение_Договора

Процедура ЗаключениеДоговора()
	Документы.бестЗаключениеДоговоровСЮридическимиЛицами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	бестПроведениеСерверНП.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
КонецПроцедуры

Функция ТекстЗаключенияДоговора()
	Текст 		= 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ТаблицаУслугиОбъектов.Услуга КАК Услуга,
		|	ТаблицаУслугиОбъектов.Нагрузка КАК Нагрузка,
		|	ТаблицаОбъектыРасчета.МКД КАК МКД
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.УслугиОбъектов КАК ТаблицаУслугиОбъектов
		|		ПО ТаблицаОбъектыРасчета.Ссылка = ТаблицаУслугиОбъектов.Ссылка
		|			И ТаблицаОбъектыРасчета.IDСтроки = ТаблицаУслугиОбъектов.IDСтроки
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (ТаблицаУслугиОбъектов.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ТаблицаПотребителиГВС.Тип КАК Тип,
		|	ТаблицаПотребителиГВС.Количество КАК Количество,
		|	ТаблицаПотребителиГВС.КоличествоРабочихЧасовВДень КАК КоличествоРабочихЧасовВДень,
		|	ТаблицаПотребителиГВС.ТипНормы КАК ТипНормы,
		|	ТаблицаОбъектыРасчета.МКД КАК МКД
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПотребителиГВС КАК ТаблицаПотребителиГВС
		|		ПО ТаблицаОбъектыРасчета.Ссылка = ТаблицаПотребителиГВС.Ссылка
		|			И ТаблицаОбъектыРасчета.IDСтроки = ТаблицаПотребителиГВС.IDСтроки
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (ТаблицаПотребителиГВС.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ВЫБОР
		|		КОГДА ТаблицаОбъектыРасчета.ТочкаУчетаДоТП
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|	КОНЕЦ КАК Состояние,
		|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК АбонентВладелец,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ТаблицаТочкиУчета.Услуга КАК Услуга,
		|	ТаблицаТочкиУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаТочкиУчета.НомерПломбы КАК НомерПломбы,
		|	ТаблицаТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
		|	ТаблицаТочкиУчета.КоэффициентПУ КАК Коэффициент,
		|	ТаблицаТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверки,
		|	ТаблицаТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
		|	ТаблицаТочкиУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	ТаблицаТочкиУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
		|	ТаблицаТочкиУчета.НетТехническойВозможностиУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|	ТаблицаТочкиУчета.Участвует КАК Участвует,
		|	ТаблицаТочкиУчета.ГБП КАК ГБП,
		|	ТаблицаТочкиУчета.СтруктураСети КАК СтруктураСети,
		|	ТаблицаТочкиУчета.ВладелецУзлаУчета КАК ОбъектВладелец,
		|	ТаблицаОбъектыРасчета.МКД КАК МКД,
		|	ТаблицаОбъектыРасчета.IDСтроки КАК IDСтрокиОбъектыРасчета,
		|	ТаблицаТочкиУчета.Ссылка КАК Ссылка,
		|	ТаблицаТочкиУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
		|	ТаблицаТочкиУчета.ТочкаПоставки КАК ТочкаПоставки,
		|	ТаблицаТочкиУчета.Поставщик КАК Поставщик,
		|	ТаблицаОбъектыРасчета.ОбъектУК КАК ОбъектУК,
		|	ТаблицаТочкиУчета.РасчетПоГрафикуГП КАК РасчетПоГрафикуГП,
		|	ТаблицаТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
		|	ТаблицаТочкиУчета.ТипТарифа КАК ТипТарифа,
		|	ТаблицаТочкиУчета.ТарифнаяСетка КАК ТарифнаяСетка,
		|	ТаблицаТочкиУчета.ЗначениеСкидки КАК ЗначениеСкидки
		|ПОМЕСТИТЬ ВТ_ТУ
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК ТаблицаТочкиУчета
		|		ПО ТаблицаОбъектыРасчета.Ссылка = ТаблицаТочкиУчета.Ссылка
		|			И ТаблицаОбъектыРасчета.IDСтроки = ТаблицаТочкиУчета.IDСтрокиВладельца
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена) КАК Состояние,
		|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК АбонентВладелец,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ТаблицаТочкиУчета.Услуга КАК Услуга,
		|	ТаблицаТочкиУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ПриборУчета КАК ПриборУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.НомерПломбы КАК НомерПломбы,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
		|	ВЫБОР
		|		КОГДА ТаблицаТочкиУчета.КоэффициентПУ = 0
		|			ТОГДА 1
		|		ИНАЧЕ ТаблицаТочкиУчета.КоэффициентПУ
		|	КОНЕЦ КАК Коэффициент,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ДатаПоверкиСчетчика КАК ДатаПоверки,
		|	ТаблицаТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
		|	ТаблицаТочкиУчета.ГБП КАК ГБП,
		|	ТаблицаТочкиУчета.СтруктураСети КАК СтруктураСети,
		|	ТаблицаТочкиУчета.ПриборУчета КАК УзелУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.ТипПрибораУчета КАК ТипПрибораУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	ТаблицаОбъектыРасчета.Ссылка КАК Ссылка,
		|	ТаблицаОбъектыРасчета.МКД КАК МКД,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.IDСтроки КАК IDСтрокиИзмеритель,
		|	ТаблицаОбъектыРасчета.ОбъектУК КАК ОбъектУК
		|ПОМЕСТИТЬ ВТ_ПУ
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК ТаблицаТочкиУчета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Измерители КАК бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители
		|			ПО ТаблицаТочкиУчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.Ссылка
		|				И ТаблицаТочкиУчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.IDСтрокиТочкиУчета
		|				И (бестЗаключениеДоговоровСЮридическимиЛицамиИзмерители.Ссылка = &Ссылка)
		|		ПО ТаблицаОбъектыРасчета.Ссылка = ТаблицаТочкиУчета.Ссылка
		|			И ТаблицаОбъектыРасчета.IDСтроки = ТаблицаТочкиУчета.IDСтрокиВладельца
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) КАК ПричинаОтклонения,
		|	ЛОЖЬ КАК КС,
		|	ЛОЖЬ КАК Переворот,
		|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ШкалыПриборовУчета.Шкала КАК Шкала
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ШкалыПриборовУчета КАК ШкалыПриборовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК ТаблицаПриборовУчета
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|				ПО ТаблицаПриборовУчета.Ссылка = ТаблицаОбъектыРасчета.Ссылка
		|					И ТаблицаПриборовУчета.IDСтрокиВладельца = ТаблицаОбъектыРасчета.IDСтроки
		|					И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|					И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|					И (НЕ ТаблицаОбъектыРасчета.ОбъектУК)
		|			ПО (ТаблицаПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка)
		|				И (ТаблицаПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтрокиТочкиУчета)
		|		ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
		|			И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
		|			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки КАК IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга КАК Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Январь КАК ОбъемУслуги,
		|	1 КАК Месяц,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год КАК Год
		|ПОМЕСТИТЬ ВТ_Объемы
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Февраль,
		|	2,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Март,
		|	3,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Апрель,
		|	4,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Май,
		|	5,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июнь,
		|	6,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Июль,
		|	7,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Август,
		|	8,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Сентябрь,
		|	9,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Октябрь,
		|	10,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ноябрь,
		|	11,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.IDСтроки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Декабрь,
		|	12,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГарантированныеОбъемы КАК бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГарантированныеОбъемы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_Объемы.Услуга КАК Услуга,
		|	ВТ_Объемы.ОбъемУслуги КАК ОбъемУслуги,
		|	ВТ_Объемы.Месяц КАК Месяц,
		|	ТаблицаОбъектыРасчета.МКД КАК МКД,
		|	ВТ_Объемы.Год КАК Год
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Объемы КАК ВТ_Объемы
		|		ПО ТаблицаОбъектыРасчета.IDСтроки = ВТ_Объемы.IDСтроки
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.Договор КАК Договор,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.Услуга КАК Услуга,
		|	ВТ_ТУ.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	НЕ ВТ_ТУ.ЭтоСоставнаяУслуга
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период,
		|	ВТ_ТУ.Организация,
		|	ВТ_ТУ.Район,
		|	ВТ_ТУ.Договор,
		|	ВТ_ТУ.ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления,
		|	ВТ_ТУ.ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.ЧастьСоставнойУслуги,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.СпособРасчетаНорматива,
		|	ВТ_ТУ.ТочкаУчета
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.СпособыРасчетаНормативаСоставныхУслуг КАК бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг
		|		ПО (ВТ_ТУ.ЭтоСоставнаяУслуга)
		|			И ВТ_ТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.IDСтроки
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиСпособыРасчетаНормативаСоставныхУслуг.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.Шкала КАК Шкала,
		|	ВТ_ТУ.Услуга КАК Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ШкалыПриборовУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТУ КАК ВТ_ТУ
		|		ПО (ВТ_ТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.IDСтрокиТочкиУчета)
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиШкалыПриборовУчета.Ссылка = ВТ_ТУ.Ссылка
		|			И (НЕ ВТ_ТУ.ОбъектУК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов.ТемпературныйГрафик КАК ТемпературныйГрафик
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТемпературныеГрафикиОбъектов КАК бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов.Ссылка
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов.IDСтроки
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = &Ссылка)
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиТемпературныеГрафикиОбъектов.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Услуга КАК Услуга,
		|	СУММА(бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Нагрузка) КАК Нагрузка,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектыРасчета,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.МаксимальныеНагрузки КАК бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Ссылка = &Ссылка)
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = &Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестЗаключениеДоговоровСЮридическимиЛицамиМаксимальныеНагрузки.Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ТарифныеКатегорииУслуги.Услуга КАК Услуга,
		|	ТарифныеКатегорииУслуги.ТарифнаяКатегория КАК ТарифнаяКатегория,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета.МКД КАК МКД
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТарифныеКатегорииУслуги КАК ТарифныеКатегорииУслуги
		|		ПО ТаблицаОбъектыРасчета.Ссылка = ТарифныеКатегорииУслуги.Ссылка
		|			И ТаблицаОбъектыРасчета.IDСтроки = ТарифныеКатегорииУслуги.IDСтроки
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (ТарифныеКатегорииУслуги.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	&Район,
		|	&Договор,
		|	&ПериодРегистрации,
		|	&ПериодНачисления,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Услуга,
		|	МАКСИМУМ(бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТарифнаяКатегория),
		|	ТаблицаОбъектыРасчета.ОбъектРасчета.МКД
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета
		|		ПО ТаблицаОбъектыРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Ссылка
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население))
		|			И ТаблицаОбъектыРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.IDСтрокиВладельца
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОбъектыРасчета.ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Услуга,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета.МКД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ТУ.МКД КАК МКД
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	НЕ ВТ_ТУ.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
		|	И НЕ ВТ_ТУ.ОбъектУК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.ПриборУчета КАК Измеритель,
		|	ТаблицаШкал.ВидПараметра КАК ВидПараметра,
		|	ВТ_ТУ.Период КАК Период,
		|	ТаблицаШкал.Шкала КАК Шкала,
		|	ТаблицаШкал.ТипТемпературы КАК ТипТемпературы
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ШкалыПриборовУчета КАК ТаблицаШкал
		|		ПО ВТ_ТУ.Ссылка = ТаблицаШкал.Ссылка
		|			И (ТаблицаШкал.Ссылка = &Ссылка)
		|			И (ТаблицаШкал.ВидПараметра <> ЗНАЧЕНИЕ(Справочник.бестВидыПараметровИзмерителей.ПустаяСсылка))
		|			И ВТ_ТУ.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
		|			И (НЕ ВТ_ТУ.ОбъектУК)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Собственник КАК Собственник,
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Период КАК Период,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Район КАК Район,
		|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
		|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
		|	ВложенныйЗапрос.Услуга КАК Услуга,
		|	ВЫБОР
		|		КОГДА бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.Ссылка ЕСТЬ NULL
		|			ТОГДА ВложенныйЗапрос.Договор
		|		ИНАЧЕ бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.Договор
		|	КОНЕЦ КАК Договор
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ТУ.Период КАК Период,
		|		ВТ_ТУ.Организация КАК Организация,
		|		ВТ_ТУ.Район КАК Район,
		|		ВЫБОР
		|			КОГДА энргДоговорыКонтрагентов.ОснованиеДопСоглашения = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.пустаяссылка)
		|				ТОГДА ВТ_ТУ.Договор
		|			ИНАЧЕ энргДоговорыКонтрагентов.ОснованиеДопСоглашения
		|		КОНЕЦ КАК Договор,
		|		ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|		ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|		ВЫБОР
		|			КОГДА ВТ_ТУ.Услуга.СоставнаяУслуга
		|				ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
		|			ИНАЧЕ ВТ_ТУ.Услуга
		|		КОНЕЦ КАК Услуга,
		|		ВТ_ТУ.IDСтроки КАК IDСтроки
		|	ИЗ
		|		ВТ_ТУ КАК ВТ_ТУ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|			ПО ВТ_ТУ.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|				И (ВТ_ТУ.Услуга.СоставнаяУслуга)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
		|			ПО ВТ_ТУ.Договор = энргДоговорыКонтрагентов.Ссылка) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ДоговорыСоставныхУслуг КАК бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг
		|		ПО ВложенныйЗапрос.Услуга = бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.ЧастьСоставнойУслуги
		|			И ВложенныйЗапрос.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.IDСтроки
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиДоговорыСоставныхУслуг.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.ТочкаУчета КАК ТочкаУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Услуга КАК Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.ТипДополнительногоНачисления КАК ТипДополнительногоНачисления,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки КАК IDСтрокиОбъектовРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.Сезонность КАК Сезонность,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.Процент КАК Процент,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.IDСтрокиТУ КАК IDСтрокиТУ,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Ссылка КАК Ссылка,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.ТарифнаяКатегория КАК ТарифнаяКатегория
		|ПОМЕСТИТЬ ДополнительныеНачисления
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ДополнительныеНачисленияТУ КАК бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ДополнительныеНачисленияЗначения КАК бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.Ссылка
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияЗначения.IDСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.IDСтрокиВладельца = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиДополнительныеНачисленияТУ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	ДополнительныеНачисления.Услуга КАК Услуга,
		|	ДополнительныеНачисления.ОбъектРасчета КАК ОбъектРасчета,
		|	ДополнительныеНачисления.Сезонность КАК Сезонность,
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	бестОбъектыРасчета.МКД КАК МКД,
		|	ДополнительныеНачисления.Процент КАК Процент,
		|	ДополнительныеНачисления.ТипДополнительногоНачисления КАК ТипДополнительногоНачисления,
		|	ДополнительныеНачисления.ТарифнаяКатегория КАК ТарифнаяКатегория
		|ИЗ
		|	ДополнительныеНачисления КАК ДополнительныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета
		|		ПО ДополнительныеНачисления.IDСтрокиОбъектовРасчета = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.IDСтрокиВладельца
		|			И ДополнительныеНачисления.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.Ссылка
		|			И ДополнительныеНачисления.IDСтрокиТУ = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиУчета.IDСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|		ПО ДополнительныеНачисления.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.МКД КАК МКД,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиПоставки КАК бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки.Ссылка
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиТочкиПоставки.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки)
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.IDСтроки КАК IDСтроки
		|ПОМЕСТИТЬ ИдентификаторыТУСоСхемойПоРазнымРайонам
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Субабоненты КАК бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(&Период, Район <> &Район) КАК бестАктивностьТочекУчетаНПРасчетаСрезПоследних
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ОбъектРасчета = бестАктивностьТочекУчетаНПРасчетаСрезПоследних.ОбъектРасчета
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ТочкаУчета = бестАктивностьТочекУчетаНПРасчетаСрезПоследних.ТочкаУчета
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Ссылка = &Ссылка
		|	И бестАктивностьТочекУчетаНПРасчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Услуга КАК Услуга,
		|	ВТ_ТУ.ТочкаУчета КАК ГоловнаяТочкаУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ОбъектРасчета КАК ОбъектРасчетаСубабонента,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.ТочкаУчета КАК ТочкаУчетаСубабонента,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Услуга КАК УслугаСубабонента,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Коэффициент КАК Коэффициент,
		|	ИСТИНА КАК Актуальность,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.СторнироватьОбъемИндивидуальногоПотребления КАК СторнироватьОбъемИндивидуальногоПотребления,
		|	НЕ ИдентификаторыТУСоСхемойПоРазнымРайонам.IDСтроки ЕСТЬ NULL КАК ТранзитИзРазныхРО,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Абонент КАК АбонентСубабонента
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Субабоненты КАК бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты
		|		ПО ВТ_ТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.IDСтроки
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиСубабоненты.Ссылка = &Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыТУСоСхемойПоРазнымРайонам КАК ИдентификаторыТУСоСхемойПоРазнымРайонам
		|		ПО ВТ_ТУ.IDСтроки = ИдентификаторыТУСоСхемойПоРазнымРайонам.IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.МКД КАК МКД,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.КоличествоРабочихДней КАК КоличествоРабочихДней,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.КоличествоРабочихЧасовВДень КАК КоличествоРабочихЧасовВДень,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ПотреблениеВРабДни КАК ПотреблениеВРабДни,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ПотреблениеВРВыхДни КАК ПотреблениеВРВыхДни,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НаличиеГенерирующихУстановок КАК НаличиеГенерирующихУстановок,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.НагрузкаЭлектроприемника КАК НагрузкаЭлектроприемника,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.РежимЭлСнабжения КАК РежимЭлСнабжения
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПУ.Период КАК Период,
		|	ВТ_ПУ.Организация КАК Организация,
		|	ВТ_ПУ.Район КАК Район,
		|	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ПУ.МКД КАК МКД,
		|	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ПУ.УзелУчета КАК УзелУчета,
		|	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ПУ.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние
		|ИЗ
		|	ВТ_ПУ КАК ВТ_ПУ
		|ГДЕ
		|	ВТ_ПУ.УзелУчета <> ВТ_ПУ.ПриборУчета
		|	И НЕ ВТ_ПУ.ОбъектУК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	ВТ_ТУ.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.пустаяссылка)
		|	И НЕ ВТ_ТУ.ОбъектУК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.НомерПломбы КАК НомерПломбы,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.КлючСтроки КАК МестоУстановки,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.ДатаУстановкиПломбы КАК ДатаОперацииСПломбой,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.ЛицоУстановившееПломбу КАК ОтветственноеЛицо,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.ВидПломбы КАК ВидПломбы,
		|	ИСТИНА КАК Состояние,
		|	ВТ_ПУ.Организация КАК Организация,
		|	ВТ_ПУ.Район КАК Район,
		|	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ПУ.Период КАК Период
		|ИЗ
		|	ВТ_ПУ КАК ВТ_ПУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.НомераПломб КАК бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб
		|		ПО ВТ_ПУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.Ссылка
		|			И ВТ_ПУ.IDСтрокиИзмеритель = бестЗаключениеДоговоровСЮридическимиЛицамиНомераПломб.IDСтрокиИзмерителя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ВидПотерь КАК ВидПотерь,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ПроцентПотерь КАК ПроцентПотерь,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиПотери.ТарифнаяЗона КАК ТарифнаяЗона
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Потери КАК бестЗаключениеДоговоровСЮридическимиЛицамиПотери
		|		ПО ВТ_ТУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиПотери.Ссылка
		|			И ВТ_ТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиПотери.IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Услуга КАК Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Нагрузка КАК Нагрузка,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Сезонность КАК Сезонность
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК ТаблицаОбъектыРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.СезонныеНагрузки КАК бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки
		|		ПО ТаблицаОбъектыРасчета.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Ссылка
		|			И ТаблицаОбъектыРасчета.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.IDСтроки
		|			И (ТаблицаОбъектыРасчета.Ссылка = &ссылка)
		|			И (бестЗаключениеДоговоровСЮридическимиЛицамиСезонныеНагрузки.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаОбъектыРасчета.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Услуга КАК Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Формировать КАК Формировать,
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов КАК бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.ТипОплаты КАК ТипОплаты,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.ДеньФормирования КАК ДеньФормирования,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.Процент КАК Процент,
		|	&ОРганизация КАК Организация,
		|	&Район КАК Район,
		|	&период КАК Период,
		|	&Договор КАК Договор,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.БазаРасчетаОбъема КАК БазаРасчетаОбъема,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.БазаРасчетаСуммы КАК БазаРасчетаСуммы,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.СрокОплаты КАК СрокОплаты
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.НастройкиОплаты КАК бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиНастройкиОплаты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Месяц КАК Месяц,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.КодРежима КАК КодРежима,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Значение КАК Значение,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Услуга КАК Услуга,
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ГрафикиРежимаОграничения КАК бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка
		|			И бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.IDСтроки
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиГрафикиРежимаОграничения.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.Услуга КАК Услуга,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.Сезонность КАК Сезонность,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.ТипБрони КАК ТипБрони,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.ЗначениеБрони КАК ЗначениеБрони,
		|	бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗаключениеДоговоровСЮридическимиЛицами.Организация КАК Организация,
		|	бестЗаключениеДоговоровСЮридическимиЛицами.Район КАК Район,
		|	бестЗаключениеДоговоровСЮридическимиЛицами.Дата КАК Период
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами КАК бестЗаключениеДоговоровСЮридическимиЛицами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ВеличинаБрони КАК бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони
		|		ПО (бестЗаключениеДоговоровСЮридическимиЛицамиВеличинаБрони.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицами.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ОбъектыРасчета КАК бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета
		|		ПО бестЗаключениеДоговоровСЮридическимиЛицами.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиОбъектыРасчета.Ссылка
		|ГДЕ
		|	бестЗаключениеДоговоровСЮридическимиЛицами.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВЫБОР
		|		КОГДА бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.Поставщик ЕСТЬ NULL
		|			ТОГДА ВТ_ТУ.Поставщик
		|		ИНАЧЕ бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.Поставщик
		|	КОНЕЦ КАК Поставщик,
		|	ВЫБОР
		|		КОГДА бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.Поставщик ЕСТЬ NULL
		|			ТОГДА ВТ_ТУ.Услуга
		|		ИНАЧЕ бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги
		|	КОНЕЦ КАК ЧастьСоставной,
		|	ВТ_ТУ.Услуга КАК Услуга
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПоставщикиСоставныхУслуг КАК бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг
		|		ПО ВТ_ТУ.Ссылка = бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.Ссылка
		|			И ВТ_ТУ.IDСтроки = бестЗаключениеДоговоровСЮридическимиЛицамиПоставщикиСоставныхУслуг.IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТочкиУчета.Период КАК Период,
		|	ТаблицаТочкиУчета.Организация КАК Организация,
		|	ТаблицаТочкиУчета.Район КАК Район,
		|	ТаблицаТочкиУчета.Договор КАК Договор,
		|	ТаблицаТочкиУчета.ПериодРегистрации КАК ПериодРегистрации,
		|	ТаблицаТочкиУчета.ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаТочкиУчета.Состояние КАК Состояние,
		|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаТочкиУчета.АбонентВладелец КАК АбонентВладелец,
		|	ТаблицаТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ТаблицаТочкиУчета.Услуга КАК Услуга,
		|	ТаблицаТочкиУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаТочкиУчета.НомерПломбы КАК НомерПломбы,
		|	ТаблицаТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
		|	ТаблицаТочкиУчета.Коэффициент КАК Коэффициент,
		|	ТаблицаТочкиУчета.ДатаПоверки КАК ДатаПоверки,
		|	ТаблицаТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
		|	ТаблицаТочкиУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	ТаблицаТочкиУчета.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
		|	ТаблицаТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|	ТаблицаТочкиУчета.Участвует КАК Участвует,
		|	ТаблицаТочкиУчета.ГБП КАК ГБП,
		|	ТаблицаТочкиУчета.СтруктураСети КАК СтруктураСети,
		|	ТаблицаТочкиУчета.ОбъектВладелец КАК ОбъектВладелец,
		|	ТаблицаТочкиУчета.МКД КАК МКД,
		|	ТаблицаТочкиУчета.IDСтрокиОбъектыРасчета КАК IDСтрокиОбъектыРасчета,
		|	ТаблицаТочкиУчета.Ссылка КАК Ссылка,
		|	ТаблицаТочкиУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
		|	ТаблицаТочкиУчета.ТочкаПоставки КАК ТочкаПоставки,
		|	ТаблицаТочкиУчета.Поставщик КАК Поставщик
		|ИЗ
		|	ВТ_ТУ КАК ТаблицаТочкиУчета
		|ГДЕ
		|	НЕ ТаблицаТочкиУчета.ОбъектУК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПУ.Период КАК Период,
		|	ВТ_ПУ.Организация КАК Организация,
		|	ВТ_ПУ.Район КАК Район,
		|	ВТ_ПУ.Договор КАК Договор,
		|	ВТ_ПУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ПУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ПУ.Состояние КАК Состояние,
		|	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ПУ.АбонентВладелец КАК АбонентВладелец,
		|	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ПУ.Услуга КАК Услуга,
		|	ВТ_ПУ.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ПУ.НомерПломбы КАК НомерПломбы,
		|	ВТ_ПУ.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
		|	ВТ_ПУ.Коэффициент КАК Коэффициент,
		|	ВТ_ПУ.ДатаПоверки КАК ДатаПоверки,
		|	ВТ_ПУ.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	ВТ_ПУ.IDСтроки КАК IDСтроки,
		|	ВТ_ПУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	ВТ_ПУ.КонецПериодаКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
		|	ВТ_ПУ.ГБП КАК ГБП,
		|	ВТ_ПУ.СтруктураСети КАК СтруктураСети,
		|	ВТ_ПУ.УзелУчета КАК УзелУчета,
		|	ВТ_ПУ.ТипПрибораУчета КАК ТипПрибораУчета,
		|	ВТ_ПУ.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	ВТ_ПУ.Ссылка КАК Ссылка,
		|	ВТ_ПУ.МКД КАК МКД,
		|	ВТ_ПУ.IDСтрокиИзмеритель КАК IDСтрокиИзмеритель,
		|	ВТ_ПУ.ОбъектУК КАК ОбъектУК
		|ИЗ
		|	ВТ_ПУ КАК ВТ_ПУ
		|ГДЕ
		|	НЕ ВТ_ПУ.ОбъектУК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ЗначениеСкидки КАК ЗначениеСкидки
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	ВТ_ТУ.ЗначениеСкидки <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ТарифнаяСетка КАК ТарифнаяСетка
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	ВТ_ТУ.ТарифнаяСетка <> ЗНАЧЕНИЕ(Справочник.бестТарифныеСетки.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ТипТарифа КАК ТипТарифа
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	ВТ_ТУ.ТипТарифа <> ЗНАЧЕНИЕ(Перечисление.бестТипыТарифаНезависимыйСбыт.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ЦеноваяКатегория КАК ЦеноваяКатегория
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	ВТ_ТУ.ЦеноваяКатегория <> ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПустаяСсылка)";

	Возврат Текст;
КонецФункции

Процедура ЗаполнитьТЧ(ЭтотОбъект,ДанныеЗаполнения,мТЧ)
	Для каждого ТЧ из мТЧ Цикл
		Для каждого стр из ДанныеЗаполнения[ТЧ] Цикл
			НовСтр = ЭтотОбъект[ТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, стр); 
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Расторжение_Договора

Процедура РасторжениеПерезаключениеДоговора(ЭтоПерезаключение) 
	ДанныеШапки 					= ДанныеШапки();
	
	Пакет = ПолучитьДанныеТЧДляЗакрытияПерезаключения();
	ДанныеПоказанийПриборовУчета 	= Пакет[0];
	ДанныеДоговорыТУ			 	= Пакет[1];
	
	УстановитьСостояниеДоговоров(ДанныеШапки,Движения,Ложь);//отключаем договор

	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);
	
	Если ЭтоПерезаключение Тогда 
		бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеДоговорыТУ,	Движения.бестДоговорыТочекУчета);
	КонецЕсли;

КонецПроцедуры
	
Функция ПолучитьДанныеТЧДляЗакрытияПерезаключения()
	ПериодДо = Новый Граница(МоментВремени(),ВидГраницы.Исключая);
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос  	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Договор",			Договор);
	Запрос.УстановитьПараметр("НовыйДоговор",		НовыйДоговор);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	Запрос.УстановитьПараметр("ПериодДо",			ПериодДо);
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);  	
	Текст 		= 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
		|	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
		|	ТаблицаПоказанийПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
		|	ЛОЖЬ КАК КС,
		|	ТаблицаПоказанийПриборовУчета.Переворот КАК Переворот,
		|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
		|	ТаблицаПриборовУчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ШкалыПриборовУчета.Шкала КАК Шкала,
		|	ТаблицаПриборовУчета.УзелУчета КАК УзелУчета,
		|	ТаблицаПриборовУчета.ПриборУчета.ТипПрибораУчета КАК ТипПрибораУчета
		|ПОМЕСТИТЬ ВТ_Показания
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчетаЗакрытие КАК ТаблицаПриборовУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ШкалыПриборовУчета КАК ШкалыПриборовУчета
		|			ПО (ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки)
		|				И (ТаблицаПоказанийПриборовУчета.Ссылка = &ссылка)
		|		ПО (ТаблицаПриборовУчета.Ссылка = ШкалыПриборовУчета.Ссылка)
		|			И (ТаблицаПриборовУчета.IDСтроки = ШкалыПриборовУчета.IDСтрокиТочкиУчета)
		|			И (ТаблицаПриборовУчета.Ссылка = &ссылка)
		|			И (ШкалыПриборовУчета.Ссылка = &Ссылка)
		|			И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
		|			И (ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&НовыйДоговор КАК Договор,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаПриборовУчета.ОбъектРасчета КАК ОбъектРасчета,
		|	ВЫБОР
		|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
		|			ТОГДА ТаблицаПриборовУчета.Услуга
		|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
		|	КОНЕЦ КАК Услуга
		|ПОМЕСТИТЬ ДоговорыТУ
		|ИЗ
		|	Документ.бестЗаключениеДоговоровСЮридическимиЛицами.ТочкиУчетаЗакрытие КАК ТаблицаПриборовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО ТаблицаПриборовУчета.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка";
		
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти 

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",						?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Организация",					Организация);
	ДанныеШапки.Вставить("Район",						Район);
	ДанныеШапки.Вставить("Договор",						Договор);
	ДанныеШапки.Вставить("ОбъектыРасчета",				ОбъектыРасчета);
	ДанныеШапки.Вставить("ОбъектыРасчетаНеОбъектУК",	ОбъектыРасчета.Выгрузить(Новый Структура("ОбъектУК", Ложь)));
	ДанныеШапки.Вставить("ТочкиУчетаЗакрытие",			ТочкиУчетаЗакрытие);
	ДанныеШапки.Вставить("Состояние",					Перечисления.энргСостояниеТочекУчета.Включена);
	ДанныеШапки.Вставить("ПериодРегистрации",			Дата);
	ДанныеШапки.Вставить("Дата",						Дата);
	ДанныеШапки.Вставить("ПериодНачисления",			ПериодНачисления); 	
	ДанныеШапки.Вставить("ВидПлощади",					Перечисления.энргВидыПлощадей.ОбщаяПлощадьНП);
	ДанныеШапки.Вставить("Документ",					Ссылка);
	ДанныеШапки.Вставить("УчитыватьПереплату",			УчитыватьПереплату);
	ДанныеШапки.Вставить("ИмяДокумента",				"бестЗаключениеДоговоровСЮридическимиЛицами");
	ДанныеШапки.Вставить("РассчитыватьПени",			РассчитыватьПени); 	
	ДанныеШапки.Вставить("ГруппаПотребителей",			ГруппаПотребителей);
	ДанныеШапки.Вставить("ВариантРасчета",				ВариантРасчета);
	ДанныеШапки.Вставить("ПроцентПени",					ПроцентПени);
	
	Возврат ДанныеШапки;	
КонецФункции

Функция СоставУзлаКорректен()
	
	Данные = Новый Структура;
	Данные.Вставить("Период",					Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Данные.Вставить("Район",					Район);
	Данные.Вставить("Организация",			    Организация);		
	Данные.Вставить("Договор",					Договор); 
	Данные.Вставить("Ссылка",					Ссылка);
	
	Возврат энргРаботаСприборамиУчетаСервер.СоставУзлаКорректенНП(Данные);
	 	
КонецФункции

Процедура УстановитьСостояниеДоговоров(ДанныеШапки,Движения,Состояние) 
	Набор				= Движения.бестСостояниеДоговоров;
	Запись				= Набор.добавить(); 
	ЗаполнитьЗначенияСвойств(Запись, ДанныеШапки);
	Запись.Состояние	= Состояние;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли