#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает значения реквизитов объекта.
//
// Параметры:
//  МаркаСсылка			-	см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
//  ПолучаемыеСвойства	-	см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
// 
// Возвращаемое значение:
//   Структура	-	см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
//
Функция ЗначенияРеквизитовОбъекта(МаркаСсылка, ПолучаемыеСвойства) Экспорт 
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжМаркиПриборовУчетаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжМаркиПриборовУчетаМенеджер"].ЗначенияРеквизитовОбъекта(МаркаСсылка, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргМаркиПриборовУчета.ЗначенияРеквизитовОбъекта(МаркаСсылка, ПолучаемыеСвойства);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргМаркиПриборовУчета.ЗначенияРеквизитовОбъекта";
		ПараметрыМетода 			= Новый Структура("МаркаСсылка, ПолучаемыеСвойства", МаркаСсылка, ПолучаемыеСвойства); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли