#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки 		= КомпоновщикНастроек.ПолучитьНастройки();
	Если Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидОперации")).Использование = Истина Тогда
		ВидОперации 	= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидОперации")).Значение;
	Иначе ВидОперации = "";
	КонецЕсли;
	
	Если Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Контролер")).Использование = Истина Тогда
	Контролер 		= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Контролер")).Значение;
	Иначе Контролер = "";
	КонецЕсли;
	
	Если Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Район")).Использование = Истина Тогда
		Филиал 			= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Район")).Значение;
	Иначе Филиал = "";
	КонецЕсли;

	НачалоПериода 	= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение.ДатаНачала;
	КонецПериода 	= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение.ДатаОкончания;
	


	КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьЗаголовок").Использование = Истина;
    КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьЗаголовок").Значение      = ТипВыводаТекстаКомпоновкиДанных.Выводить; 
    КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок").Использование         = Истина;
    КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок").Значение              = "Реестр операций "   +  ВидОперации  + Символы.ПС 
                                                                                                    + "Период с " + Формат(НачалоПериода,"ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода,"ДФ=dd.MM.yyyy") + Символы.ПС 
																									+ "Контролер " +  Контролер  + Символы.ПС
																									+ "Филиал " +  Филиал;  
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли