#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция КоличествоОсталосьСоздатьДокументовРегистратора(ДокументОснование) Экспорт 
	
	Результат = 0;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бестЗагрузкаПоказанийТочкиУчета.IDСтроки) КАК КоличествоОсталось
		|ИЗ
		|	РегистрСведений.бестЗагрузкаПоказанийТочкиУчета КАК бестЗагрузкаПоказанийТочкиУчета
		|ГДЕ
		|	бестЗагрузкаПоказанийТочкиУчета.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.КоличествоОсталось;
	
	Возврат Результат;
	
КонецФункции   

#КонецОбласти

#КонецЕсли