#Область ОбработчикиСобытий

&НаКлиенте
Процедура Завершить(Команда)
	СоотвествиеУслуг  = Новый Соответствие;
	Для Каждого стр из ДанныеСоставныхУслуг цикл
		   СоотвествиеУслуг.Вставить(стр.Услуга,Новый Структура(КлючСтруктуры,стр.СпособРасчетаНорматива));
	КонецЦикла;  	
	Закрыть(Новый Структура("ДанныеИзменены,СоотвествиеУслуг",ДанныеИзменены,СоотвествиеУслуг));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КлючСтруктуры 					= Параметры.КлючСтруктуры.Поставщик;
	для Каждого КлючЗначение из Параметры.СоотвествиеУслуг цикл
		СтрокаТаблицы  				= ДанныеСоставныхУслуг.Добавить();
		СтрокаТаблицы.Услуга  		= КлючЗначение.Ключ;
		СтрокаТаблицы.СпособРасчетаНорматива	= КлючЗначение.Значение[КлючСтруктуры];
	КонецЦикла; 
	ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ"); 
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСоставныхУслугПриИзменении(Элемент)
	ДанныеИзменены = истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ Тогда
		Элементы.ДанныеСоставныхУслугПоставщик.РежимВыбораИзСписка = Истина;
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина"));
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.бестТипыНачисленияПоНормативуНП.БалансовыйМетод"));
		Элементы.ДанныеСоставныхУслугПоставщик.СписокВыбора.ЗагрузитьЗначения(МассивЗначений);
	КонецЕсли;
КонецПроцедуры



#КонецОбласти
