#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Документы.энргРегистрацияПоказанийАбонента.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);  	
		
КонецПроцедуры

// Заполняет список команд создать на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт 
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргРасходныйКассовыйОрдер) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор 	= Метаданные.Документы.энргРасходныйКассовыйОрдер.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Расходный кассовый ордер'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//КомандаОтчет.Идентификатор           			= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Порядок      						 = 50;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();
	//КомандаОтчет.Идентификатор         				= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	//КомандаОтчет.Порядок       						= 50;
	
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати 					= КомандыПечати.Добавить();
	КомандаПечати.Идентификатор 	= "Чек";
	КомандаПечати.Представление 	= НСтр("ru = 'Чек'; en = 'Acceptance note'");	
 
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов.
//  ПараметрыПечати			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати.
//  КоллекцияПечатныхФорм	-	см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм.
//  ОбъектыПечати			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати.
//  ПараметрыВывода			-	см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Чек") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Чек", 
		НСтр("ru = 'Чек'; en = 'Acceptance note'"),
		СформироватьПечатнуюФормуЧека(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	энргФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);

КонецПроцедуры

// Заполняет структуру получателей печатных форм.
//
// Параметры:
//  СтруктураДанныхОбъектаПечати	-	Структура.
//
Процедура ЗаполнитьСтруктуруПолучателейПечатныхФорм(СтруктураДанныхОбъектаПечати) Экспорт

	СтруктураДанныхОбъектаПечати.ОсновнойПолучатель = "Абонент.ФизЛицо";
	
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("Абонент.ФизЛицо");
	
КонецПроцедуры

// Добавляет команду создать на основании документ перерасчет.
//
// Параметры:
//  КомандыСоздатьНаОсновании	-	КомандыФормы.
//
Процедура ДобавитьКомандуСоздатьНаОснованииДокументПерерасчет(КомандыСоздатьНаОсновании) Экспорт 
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.РасходныйКассовыйОрдерНаОснованииПерерасчет";
		КомандаСоздатьНаОсновании.Идентификатор 	= "РасходныйКассовыйОрдерНаОснованииПерерасчет";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Расходный кассовый ордер'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Ложь; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПечатнуюФормуЧека(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) 
	
	Макет					= УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.энргЧек");
	
	МВТ						= Новый МенеджерВременныхТаблиц;
	СтруктураРезультатов	= ПолучитьДанныеДляПечати(МассивОбъектов, ПараметрыПечати, МВТ);
	
	ЗапросНаОстатки			= Новый Запрос;
	ЗапросНаОстатки.МенеджерВременныхТаблиц	= МВТ;
	ЗапросНаОстатки.Текст	= ПолучитьТекстОстатков();
	
	

	ДанныеОрганизаций		= СтруктураРезультатов["РезультатПоШапке"].Выбрать();
	ДанныеКвитанций			= СтруктураРезультатов["РезультатПоКвитанциям"].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеПоДатам			= СтруктураРезультатов["РезультатПоДатам"].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТабличныйДокумент 		= Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеОрганизаций.Следующий() Цикл
		ЗапросНаОстатки.УстановитьПараметр("Организация", ДанныеОрганизаций.Организация);
		// Заполняем область шапки чека
		
		ОбластьОрганизация								= Макет.ПолучитьОбласть("Организация");
		ЗаполнитьЗначенияСвойств(ОбластьОрганизация.Параметры, ДанныеОрганизаций);
		
		СтруктураПоиска = Новый Структура("Организация", ДанныеОрганизаций.Организация);
		// Найдем в выборке даты по текущей организации
		НайденСледующий = ДанныеПоДатам.НайтиСледующий(СтруктураПоиска);
		Если НайденСледующий Тогда
			ВыборкаПоДатам = ДанныеПоДатам.Выбрать();
			ВыборкаПоДатам.Сбросить();
		Иначе
			Продолжить;
		КонецЕсли;
		
		Пока ВыборкаПоДатам.Следующий() Цикл
			// запрос на остатки услуг
			ЗапросНаОстатки.УстановитьПараметр("Дата",НачалоМесяца(ДобавитьМесяц(ВыборкаПоДатам.ДатаОстатков, 1)));
			   
			// Найдем в выборке квитанции по текущей организации
			НайденСледующий = ДанныеКвитанций.НайтиСледующий(СтруктураПоиска);
			
			// Если в Организации нет квитанций - перейдем к следующей организации
			Если НайденСледующий Тогда
				ВыборкаПоДатамКвитанций = ДанныеКвитанций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ВыборкаПоДатамКвитанций.Сбросить();
			Иначе
				Продолжить;
			КонецЕсли;
			
			// Найдем в квитанции по текущей дате
			СтруктураПоискаПоДате = Новый Структура("ДатаОстатков", ВыборкаПоДатам.ДатаОстатков);
			НайденСледующий = ВыборкаПоДатамКвитанций.НайтиСледующий(СтруктураПоискаПоДате);
			
			// Если в Дате нет квитанций - перейдем к следующей дате
			Если НайденСледующий Тогда
				ВыборкаПоДокументу = ВыборкаПоДатамКвитанций.Выбрать();
				ВыборкаПоДокументу.Сбросить();
			Иначе
				Продолжить;
			КонецЕсли;
			
			ВыборкаОстатков	= ЗапросНаОстатки.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоДокументу.Следующий() Цикл
							
				// Заполняем остатки
				СтруктураПоискаАбонента = Новый Структура("Абонент", ВыборкаПоДокументу.ФИО);
				НайденСледующий			= ВыборкаОстатков.НайтиСледующий(СтруктураПоискаАбонента);
				ТД_Аванс				= Неопределено;
				Если НайденСледующий И ВыборкаОстатков.СуммаОстаток > 0 Тогда
					ОбщаяЗадолженность	= ВыборкаОстатков.СуммаОстаток;
					ОбщаяОплата			= ВыборкаПоДокументу.СуммаОплаты;
					Если ОбщаяЗадолженность < ОбщаяОплата Тогда 
						// надо еще напечатать авансовый чек на (ОбщаяОплата - ОбщаяЗадолженность)						
						ТД_Аванс = ПолучитьЧек(Макет, ОбщаяОплата - ОбщаяЗадолженность, , ОбластьОрганизация, ДанныеОрганизаций, ВыборкаПоДокументу);
						ОбщаяОплата			= ОбщаяЗадолженность;
					КонецЕсли;
					
					ОстатокЗадолженности	= ОбщаяЗадолженность;
					ОстатокОплаты			= ОбщаяОплата;
					
					ВыборкаПоУслугам = ВыборкаОстатков.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					ВыборкаПоУслугам.Сбросить();
					
					ТД_Услуги = Новый ТабличныйДокумент;
					
					Пока ВыборкаПоУслугам.Следующий() Цикл
						ОбластьНазваниеУслуги	= Макет.ПолучитьОбласть("НазваниеУслуги");
					    ЗаполнитьЗначенияСвойств(ОбластьНазваниеУслуги.Параметры,ВыборкаПоУслугам);
						ТД_Услуги.Вывести(ОбластьНазваниеУслуги);
						
						ВыборкаПоДатамУслуги = ВыборкаПоУслугам.Выбрать();
						Пока ВыборкаПоДатамУслуги.Следующий() Цикл
							ОбластьДолгУслуги	= Макет.ПолучитьОбласть("ДолгУслуги");
							ЗаполнитьЗначенияСвойств(ОбластьДолгУслуги.Параметры,ВыборкаПоДатамУслуги);
							ОбластьДолгУслуги.Параметры.ПериодНачисления = Формат(ВыборкаПоДатамУслуги.ПериодНачисления, "ДФ=MMMM.yy");
							ТД_Услуги.Вывести(ОбластьДолгУслуги);
						КонецЦикла;
						
						ОбластьОплатаУслуги	= Макет.ПолучитьОбласть("ОплатаУслуги");
					    ЗаполнитьЗначенияСвойств(ОбластьОплатаУслуги.Параметры,ВыборкаПоУслугам);
						
						ОстатокЗадолженности = ОстатокЗадолженности - ВыборкаПоУслугам.СуммаОстаток;
						Если ОстатокЗадолженности = 0 Тогда
							ТекОплата	= ОстатокОплаты;
						Иначе
							ТекОплата	= Окр(ОбщаяОплата * ВыборкаПоУслугам.СуммаОстаток / ОбщаяЗадолженность, 2);
						КонецЕсли;
						ОстатокОплаты	= ОстатокОплаты - ТекОплата;
						
						ОбластьОплатаУслуги.Параметры.Оплачено	= ТекОплата;						
						ТД_Услуги.Вывести(ОбластьОплатаУслуги);
					КонецЦикла;
					
				Иначе
					// Авансовый платеж
					ОбщаяОплата	= ВыборкаПоДокументу.СуммаОплаты;
					ТД_Услуги	= Неопределено;
				КонецЕсли;
				
				ТД_Чек = ПолучитьЧек(Макет, ОбщаяОплата, ТД_Услуги, ОбластьОрганизация, ДанныеОрганизаций, ВыборкаПоДокументу);
				
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ПервыйДокумент		= Ложь;
				НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
				ТабличныйДокумент.Вывести(ТД_Чек);
				
				//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументу.Ссылка);
				Если ТД_Аванс <> Неопределено Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					//НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
					ТабличныйДокумент.Вывести(ТД_Аванс);
				КонецЕсли;
				
				УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументу.Ссылка);
				
			КонецЦикла;
		КонецЦикла;

	КонецЦикла;
	
	ТабличныйДокумент.КлючПараметровПечати				= "ПАРАМЕТРЫ_ПЕЧАТИ_Чек";
	ТабличныйДокумент.АвтоМасштаб						= Истина;
	ТабличныйДокумент.ОриентацияСтраницы				= ОриентацияСтраницы.Портрет;
	
	Возврат ТабличныйДокумент;	  	
КонецФункции

Функция ПолучитьДанныеДляПечати(МассивОбъектов, ПараметрыПечати, МВТ)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргКвитанция.Ссылка КАК Ссылка,
	|	энргКвитанция.Номер КАК Номер,
	|	энргКвитанция.Дата КАК Дата,
	|	энргКвитанция.Абонент КАК ФИО,
	|	энргКвитанция.Касса КАК Касса,
	|	энргКвитанция.СуммаОплаты КАК СуммаОплаты,
	|	энргКвитанция.Организация КАК Организация,
	|	энргКвитанция.Абонент.ЛицевойСчет КАК ЛС,
	|	энргКвитанция.Абонент.КлючПомещения КАК КлючПомещения,
	|	энргКвитанция.Ответственный КАК Кассир,
	|	энргКвитанция.ПериодОплатыКонец КАК ПериодОплатыКонец,
	|	энргКвитанция.ПериодОплатыНачало КАК ПериодОплатыНачало,
	|	ВЫБОР
	|		КОГДА ДЕНЬ(энргКвитанция.Дата) <= 10
	|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(энргКвитанция.Дата, МЕСЯЦ, -1), МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(энргКвитанция.Дата, МЕСЯЦ)
	|	КОНЕЦ КАК ДатаОстатков
	|ПОМЕСТИТЬ ВТ_Квитанции
	|ИЗ
	|	Документ.энргПриходныйКассовыйОрдер КАК энргКвитанция
	|ГДЕ
	|	энргКвитанция.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Квитанции.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	ВТ_Квитанции КАК ВТ_Квитанции
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Квитанции.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Организации.Организация КАК Организация,
	|	ВТ_Организации.Организация.ИНН КАК ОрганизацияИНН,
	|	ВТ_Организации.Организация.КПП КАК ОрганизацияКПП,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.Банк КАК Банк,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.НомерСчета КАК РС,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.Банк.Код КАК БИК,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КС,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Почта,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК АдресОрганизации
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ВТ_Организации.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Организации.Организация,
	|	ВТ_Организации.Организация.ИНН,
	|	ВТ_Организации.Организация.КПП,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.Банк,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.НомерСчета,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.Банк.Код,
	|	ВТ_Организации.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Квитанции.Ссылка КАК Ссылка,
	|	ВТ_Квитанции.Номер КАК Номер,
	|	ВТ_Квитанции.Дата КАК ДатаВремя,
	|	ВТ_Квитанции.ФИО КАК ФИО,
	|	ВТ_Квитанции.Касса КАК Касса,
	|	ВТ_Квитанции.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_Квитанции.Организация КАК Организация,
	|	ВТ_Квитанции.ЛС КАК ЛС,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|					И энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта)
	|				ТОГДА энргАбонентыКонтактнаяИнформация.Представление
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК Адрес,
	|	МАКСИМУМ(энргКоличествоПроживающихСрезПоследних.Количество) КАК Прож,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь)
	|				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЖилаяПлощадь,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)
	|				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяПлощадь,
	|	ВТ_Квитанции.Кассир КАК Кассир,
	|	ВТ_Квитанции.ПериодОплатыКонец КАК ПериодОплатыКонец,
	|	ВТ_Квитанции.ПериодОплатыНачало КАК ПериодОплатыНачало,
	|	ВТ_Квитанции.СуммаОплаты * 0.2 КАК НДС,
	|	ВТ_Квитанции.ДатаОстатков КАК ДатаОстатков
	|ИЗ
	|	ВТ_Квитанции КАК ВТ_Квитанции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|		ПО ВТ_Квитанции.ФИО = энргАбонентыКонтактнаяИнформация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
	|				,
	|				КлючПомещения В
	|					(ВЫБРАТЬ
	|						ВТ.КлючПомещения
	|					ИЗ
	|						ВТ_Квитанции КАК ВТ)) КАК энргКоличествоПроживающихСрезПоследних
	|		ПО ВТ_Квитанции.КлючПомещения = энргКоличествоПроживающихСрезПоследних.КлючПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
	|				,
	|				КлючПомещения В
	|					(ВЫБРАТЬ
	|						ВТ.КлючПомещения
	|					ИЗ
	|						ВТ_Квитанции КАК ВТ)) КАК энргЗначенияПлощадейСрезПоследних
	|		ПО ВТ_Квитанции.КлючПомещения = энргЗначенияПлощадейСрезПоследних.КлючПомещения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Квитанции.Ссылка,
	|	ВТ_Квитанции.Номер,
	|	ВТ_Квитанции.Дата,
	|	ВТ_Квитанции.ФИО,
	|	ВТ_Квитанции.Касса,
	|	ВТ_Квитанции.СуммаОплаты,
	|	ВТ_Квитанции.Организация,
	|	ВТ_Квитанции.ЛС,
	|	ВТ_Квитанции.Кассир,
	|	ВТ_Квитанции.ПериодОплатыКонец,
	|	ВТ_Квитанции.ПериодОплатыНачало,
	|	ВТ_Квитанции.ДатаОстатков
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ЛС
	|ИТОГИ ПО
	|	Организация,
	|	ДатаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Квитанции.Организация КАК Организация,
	|	ВТ_Квитанции.ДатаОстатков КАК ДатаОстатков
	|ИЗ
	|	ВТ_Квитанции КАК ВТ_Квитанции
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Квитанции.Организация,
	|	ВТ_Квитанции.ДатаОстатков
	|ИТОГИ ПО
	|	Организация";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	МассивРезультатов		= Запрос.ВыполнитьПакет();
	РезультатПоШапке		= МассивРезультатов[2];
	РезультатПоКвитанциям	= МассивРезультатов[3];
	РезультатПоДатам		= МассивРезультатов[4];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке,РезультатПоКвитанциям,РезультатПоДатам", РезультатПоШапке, РезультатПоКвитанциям, РезультатПоДатам);
	                     
	Возврат СтруктураДанныхДляПечати;
КонецФункции

Функция СформироватьПредставлениеМесяца(Начало, Конец)
	
	Если Год(Начало) = Год(Конец) Тогда
		Если Месяц(Начало) = Месяц(Конец) Тогда
			Возврат Формат(Конец, "ДФ=ММMM.yy");
		КонецЕсли;
		
		Возврат Формат(Начало, "ДФ=ММMM") + "-" + Формат(Конец, "ДФ=ММMM.yy");	
		
	КонецЕсли;
	
	Возврат Формат(Начало, "ДФ=ММMM.yy") + "-" + Формат(Конец, "ДФ=ММMM.yy");
	
КонецФункции

Функция ПолучитьТекстОстатков()
	Возврат 
	"ВЫБРАТЬ
	|	энргГруппыПотребителейАбонентовСрезПоследних.Организация КАК Организация,
	|	энргГруппыПотребителейАбонентовСрезПоследних.Район КАК Район,
	|	энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргГруппыПотребителейАбонентовСрезПоследних.Услуга КАК Услуга,
	|	МАКСИМУМ(энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей) КАК ГруппаПотребителей
	|ПОМЕСТИТЬ ВТ_ГруппыПотребителей
	|ИЗ
	|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И КлючПомещения В
	|					(ВЫБРАТЬ
	|						ВТ.КлючПомещения
	|					ИЗ
	|						ВТ_Квитанции КАК ВТ)) КАК энргГруппыПотребителейАбонентовСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргГруппыПотребителейАбонентовСрезПоследних.Организация,
	|	энргГруппыПотребителейАбонентовСрезПоследних.Район,
	|	энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения,
	|	энргГруппыПотребителейАбонентовСрезПоследних.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппыПотребителей.Организация КАК Организация,
	|	ВТ_ГруппыПотребителей.Район КАК Район,
	|	ВТ_ГруппыПотребителей.Услуга КАК Услуга,
	|	ВТ_ГруппыПотребителей.КлючПомещения КАК КлючПомещения,
	|	СУММА(энргЗначенияТарифовСрезПоследних.Значение) КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.Период КАК Период,
	|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_Тарифы
	|ИЗ
	|	ВТ_ГруппыПотребителей КАК ВТ_ГруппыПотребителей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифовСрезПоследних
	|		ПО ВТ_ГруппыПотребителей.Организация = энргЗначенияТарифовСрезПоследних.Организация
	|			И ВТ_ГруппыПотребителей.Район = энргЗначенияТарифовСрезПоследних.Район
	|			И ВТ_ГруппыПотребителей.ГруппаПотребителей = энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	|			И ВТ_ГруппыПотребителей.Услуга = энргЗначенияТарифовСрезПоследних.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ГруппыПотребителей.Организация,
	|	ВТ_ГруппыПотребителей.Район,
	|	ВТ_ГруппыПотребителей.Услуга,
	|	ВТ_ГруппыПотребителей.КлючПомещения,
	|	энргЗначенияТарифовСрезПоследних.Период,
	|	энргЗначенияТарифовСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	|	МАКСИМУМ(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_Тарифы.Значение, 1)) КАК Тариф
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.ФИО
	|					ИЗ
	|						ВТ_Квитанции КАК ВТ)) КАК энргВзаиморасчетыПоМесяцамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Тарифы КАК ВТ_Тарифы
	|		ПО энргВзаиморасчетыПоМесяцамОстатки.Организация = ВТ_Тарифы.Организация
	|			И энргВзаиморасчетыПоМесяцамОстатки.Район = ВТ_Тарифы.Район
	|			И энргВзаиморасчетыПоМесяцамОстатки.Услуга = ВТ_Тарифы.Услуга
	|			И энргВзаиморасчетыПоМесяцамОстатки.Абонент.КлючПомещения = ВТ_Тарифы.КлючПомещения
	|			И энргВзаиморасчетыПоМесяцамОстатки.Поставщик = ВТ_Тарифы.Поставщик
	|			И энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления >= ВТ_Тарифы.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыПоМесяцамОстатки.Абонент,
	|	энргВзаиморасчетыПоМесяцамОстатки.Услуга,
	|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Абонент КАК Абонент,
	|	ВТ_Итог.Услуга КАК Услуга,
	|	ВТ_Итог.СуммаОстаток КАК СуммаОстаток,
	|	ВТ_Итог.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_Итог.Тариф КАК Тариф,
	|	ВТ_Итог.СуммаОстаток / ВТ_Итог.Тариф КАК Объем
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|
	|УПОРЯДОЧИТЬ ПО
	|	Абонент,
	|	Услуга,
	|	ПериодНачисления
	|ИТОГИ
	|	СУММА(СуммаОстаток)
	|ПО
	|	Абонент,
	|	Услуга"
КонецФункции

Функция ПолучитьЧек(Макет, ОбщаяОплата, ТД_Услуги = Неопределено, ОбластьОрганизация, ДанныеОрганизаций, ВыборкаПоДокументу)
	ТабличныйДокументЧека = Новый ТабличныйДокумент;
	
	ТабличныйДокументЧека.Вывести(ОбластьОрганизация);
	
	ОбластьКвитанция	= Макет.ПолучитьОбласть("Квитанция");
	ЗаполнитьЗначенияСвойств(ОбластьКвитанция.Параметры, ВыборкаПоДокументу);
	ОбластьКвитанция.Параметры.Месяц = СформироватьПредставлениеМесяца(ВыборкаПоДокументу.ПериодОплатыНачало, ВыборкаПоДокументу.ПериодОплатыКонец);
	
	ТабличныйДокументЧека.Вывести(ОбластьКвитанция);
	
	Если ТД_Услуги = Неопределено ТОгда
		ТД_Услуги = Новый ТабличныйДокумент;
		ОбластьНазваниеУслуги	= Макет.ПолучитьОбласть("НазваниеУслуги");
		ОбластьНазваниеУслуги.Параметры.Услуга = "Авансовый платеж";
		ТД_Услуги.Вывести(ОбластьНазваниеУслуги);
		
		ОбластьОплатаУслуги	= Макет.ПолучитьОбласть("ОплатаУслуги");
		ОбластьОплатаУслуги.Параметры.Оплачено		= ОбщаяОплата;
		ОбластьОплатаУслуги.Параметры.СуммаОстаток	= ОбщаяОплата;
		ТД_Услуги.Вывести(ОбластьОплатаУслуги);
	КонецЕсли;
	ТабличныйДокументЧека.Вывести(ТД_Услуги);
	
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаПоДокументу);
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ДанныеОрганизаций);
	ОбластьПодвал.Параметры.СуммаОплаты	= Формат(ОбщаяОплата, "ЧДЦ=2");
	ОбластьПодвал.Параметры.НДС			= Формат(ОбщаяОплата * 0.2, "ЧДЦ=2");
	ТабличныйДокументЧека.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокументЧека;
КонецФункции

#КонецОбласти

#КонецЕсли