#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет максимальные показания срез.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура МаксимальныеПоказанияСрез(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаписиНабора());
	Пакет.ТаблицаДляПомещения 		= "НаборЗаписейМаксимальныеПоказания";
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, МКД, ПриборУчета, Шкала, ТарифнаяЗона";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргМаксимальныеПоказанияМКД",ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		Пакет.Операторы[0].Отбор.Добавить("энргМаксимальныеПоказанияМКД.Период <= &" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
			
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСрезПоследнихИзНабора());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаписиНабора()
	Текст 							= 
	"ВЫБРАТЬ
	|	энргМаксимальныеПоказанияМКД.Организация КАК Организация,
	|	энргМаксимальныеПоказанияМКД.Район КАК Район,
	|	энргМаксимальныеПоказанияМКД.МКД КАК МКД,
	|	энргМаксимальныеПоказанияМКД.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияМКД.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияМКД.Период КАК Период,
	|	энргМаксимальныеПоказанияМКД.Разделитель КАК Разделитель,
	|	энргМаксимальныеПоказанияМКД.Регистратор КАК Регистратор,
	|	энргМаксимальныеПоказанияМКД.Показание КАК Показание
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказанияМКД КАК энргМаксимальныеПоказанияМКД";
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаСрезПоследнихИзНабора()
	Текст 							=
	"ВЫБРАТЬ
	|	НаборЗаписейМаксимальныеПоказания.Организация КАК Организация,
	|	НаборЗаписейМаксимальныеПоказания.Район КАК Район,
	|	НаборЗаписейМаксимальныеПоказания.МКД КАК МКД,
	|	НаборЗаписейМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	НаборЗаписейМаксимальныеПоказания.Шкала КАК Шкала,
	|	НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборЗаписейМаксимальныеПоказания.Период КАК Период,
	|	НаборЗаписейМаксимальныеПоказания.Регистратор КАК Регистратор,
	|	НаборЗаписейМаксимальныеПоказания.Разделитель КАК Разделитель,
	|	НаборЗаписейМаксимальныеПоказания.Показание КАК Показание
	|ИЗ
	|	(ВЫБРАТЬ
	|		МаксимумРегистратор.Организация КАК Организация,
	|		МаксимумРегистратор.Район КАК Район,
	|		МаксимумРегистратор.МКД КАК МКД,
	|		МаксимумРегистратор.ПриборУчета КАК ПриборУчета,
	|		МаксимумРегистратор.Шкала КАК Шкала,
	|		МаксимумРегистратор.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МаксимумРегистратор.Период КАК Период,
	|		МаксимумРегистратор.Регистратор КАК Регистратор,
	|		МАКСИМУМ(НаборЗаписейМаксимальныеПоказания.Разделитель) КАК Разделитель
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МаксимальнаяДатаРегистратора.Организация КАК Организация,
	|			МаксимальнаяДатаРегистратора.Район КАК Район,
	|			МаксимальнаяДатаРегистратора.МКД КАК МКД,
	|			МаксимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|			МаксимальнаяДатаРегистратора.Шкала КАК Шкала,
	|			МаксимальнаяДатаРегистратора.ТарифнаяЗона КАК ТарифнаяЗона,
	|			МаксимальнаяДатаРегистратора.Период КАК Период,
	|			МАКСИМУМ(НаборЗаписейМаксимальныеПоказания.Регистратор) КАК Регистратор
	|		ИЗ
	|			(ВЫБРАТЬ
	|				НаборЗаписейМаксимальныеПоказания.Организация КАК Организация,
	|				НаборЗаписейМаксимальныеПоказания.Район КАК Район,
	|				НаборЗаписейМаксимальныеПоказания.МКД КАК МКД,
	|				НаборЗаписейМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|				НаборЗаписейМаксимальныеПоказания.Шкала КАК Шкала,
	|				НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|				МАКСИМУМ(НаборЗаписейМаксимальныеПоказания.Период) КАК Период
	|			ИЗ
	|				НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|			
	|			СГРУППИРОВАТЬ ПО
	|				НаборЗаписейМаксимальныеПоказания.Организация,
	|				НаборЗаписейМаксимальныеПоказания.Район,
	|				НаборЗаписейМаксимальныеПоказания.МКД,
	|				НаборЗаписейМаксимальныеПоказания.ПриборУчета,
	|				НаборЗаписейМаксимальныеПоказания.Шкала,
	|				НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона) КАК МаксимальнаяДатаРегистратора
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|				ПО МаксимальнаяДатаРегистратора.Организация = НаборЗаписейМаксимальныеПоказания.Организация
	|					И МаксимальнаяДатаРегистратора.Район = НаборЗаписейМаксимальныеПоказания.Район
	|					И МаксимальнаяДатаРегистратора.МКД = НаборЗаписейМаксимальныеПоказания.МКД
	|					И МаксимальнаяДатаРегистратора.ПриборУчета = НаборЗаписейМаксимальныеПоказания.ПриборУчета
	|					И МаксимальнаяДатаРегистратора.Шкала = НаборЗаписейМаксимальныеПоказания.Шкала
	|					И МаксимальнаяДатаРегистратора.ТарифнаяЗона = НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона
	|					И МаксимальнаяДатаРегистратора.Период = НаборЗаписейМаксимальныеПоказания.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			МаксимальнаяДатаРегистратора.Организация,
	|			МаксимальнаяДатаРегистратора.Район,
	|			МаксимальнаяДатаРегистратора.МКД,
	|			МаксимальнаяДатаРегистратора.ПриборУчета,
	|			МаксимальнаяДатаРегистратора.Шкала,
	|			МаксимальнаяДатаРегистратора.ТарифнаяЗона,
	|			МаксимальнаяДатаРегистратора.Период) КАК МаксимумРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|			ПО МаксимумРегистратор.Организация = НаборЗаписейМаксимальныеПоказания.Организация
	|				И МаксимумРегистратор.Район = НаборЗаписейМаксимальныеПоказания.Район
	|				И МаксимумРегистратор.МКД = НаборЗаписейМаксимальныеПоказания.МКД
	|				И МаксимумРегистратор.ПриборУчета = НаборЗаписейМаксимальныеПоказания.ПриборУчета
	|				И МаксимумРегистратор.Шкала = НаборЗаписейМаксимальныеПоказания.Шкала
	|				И МаксимумРегистратор.ТарифнаяЗона = НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона
	|				И МаксимумРегистратор.Период = НаборЗаписейМаксимальныеПоказания.Период
	|				И МаксимумРегистратор.Регистратор = НаборЗаписейМаксимальныеПоказания.Регистратор
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МаксимумРегистратор.Организация,
	|		МаксимумРегистратор.Район,
	|		МаксимумРегистратор.МКД,
	|		МаксимумРегистратор.ПриборУчета,
	|		МаксимумРегистратор.Шкала,
	|		МаксимумРегистратор.ТарифнаяЗона,
	|		МаксимумРегистратор.Период,
	|		МаксимумРегистратор.Регистратор) КАК МаксимумРазделить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборЗаписейМаксимальныеПоказания КАК НаборЗаписейМаксимальныеПоказания
	|		ПО МаксимумРазделить.Организация = НаборЗаписейМаксимальныеПоказания.Организация
	|			И МаксимумРазделить.Район = НаборЗаписейМаксимальныеПоказания.Район
	|			И МаксимумРазделить.МКД = НаборЗаписейМаксимальныеПоказания.МКД
	|			И МаксимумРазделить.ПриборУчета = НаборЗаписейМаксимальныеПоказания.ПриборУчета
	|			И МаксимумРазделить.Шкала = НаборЗаписейМаксимальныеПоказания.Шкала
	|			И МаксимумРазделить.ТарифнаяЗона = НаборЗаписейМаксимальныеПоказания.ТарифнаяЗона
	|			И МаксимумРазделить.Период = НаборЗаписейМаксимальныеПоказания.Период
	|			И МаксимумРазделить.Регистратор = НаборЗаписейМаксимальныеПоказания.Регистратор
	|			И МаксимумРазделить.Разделитель = НаборЗаписейМаксимальныеПоказания.Разделитель";
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли