#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	энргДатаПоследнегоИзменения	= ТекущаяДата();

	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Для Каждого ТекСтрокаЭлементыСхемы Из ЭлементыСхемы Цикл
		Движение 						= Движения.бестСхемаРасчетаПоСтруктуреСети.Добавить();
		Движение.Период 				= Дата;
		Движение.РассчитываемыйЭлемент 	= РассчитываемыйЭлемент;
		Движение.ЭлементСтруктурыСети 	= ТекСтрокаЭлементыСхемы.ЭлементСтруктурыСети;
		Движение.ВычитатьЭлемент 		= ТекСтрокаЭлементыСхемы.ВычитатьЭлемент;
		Движение.Организация 			= Организация;
		Движение.Район 					= Район;
		Движение.Услуга 				= Услуга;
		Движение.ТочкаУчета 			= ТочкаУчета;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли