#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДанныеПоУмолчанию(); 	
	
	Если Параметры.Свойство("ПараметрыШапки") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПараметрыШапки);
		ЗаполнитьПриборыУчетаСервер();
	КонецЕсли;  	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоУмолчанию()
	ВидОперации 					= Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги;
	Дата							= ТекущаяДата();
	Организация 					= Справочники.Организации.ОрганизацияПоУмолчанию();
	Если ЗначениеЗаполнено(Организация) Тогда		
		ПериодНачисления 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Дата, Организация,Район);
	КонецЕсли;
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
КонецПроцедуры

#КонецОбласти

#Область СобытияКоманд

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	Успешно = Ложь;
	СформироватьДокументыНаСервере(Успешно);
	
	Если Успешно Тогда
		ПоказатьПредупреждение(, "Документы созданы успешно");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере(Успешно)
	
	ИмяДокумента = ПолучитьИмяДокумента();
	Если ИмяДокумента = "" Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТаблиц = Новый Структура("ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета, Ссылка", ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета, Неопределено);
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(ДанныеТаблиц, ДанныеТаблиц, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	// создаем документы
	ТочкиУчета.Сортировать("КлючПомещения");	
	
	Попытка
		НачатьТранзакцию();
		
		ТекКлючПомещения 	= Неопределено;
		НовыйДокумент		= Неопределено;
		
		Для Каждого ТекТочкаУчета из ТочкиУчета Цикл
			Если НЕ ТекКлючПомещения = ТекТочкаУчета.КлючПомещения Тогда
				Если НЕ НовыйДокумент = Неопределено Тогда
					// Проводим документ предыдущего Абонента
					НовыйДокумент.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеФайла", Истина);
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
				НовыйДокумент = Документы[ИмяДокумента].СоздатьДокумент();
				ЗаполнитьШапкуДокумента(НовыйДокумент, ТекТочкаУчета);
			КонецЕсли;
			
			НоваяСтрока = НовыйДокумент.ТочкиУчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекТочкаУчета);
			
			ЗаполнитьСвязанныеТабЧасти(НовыйДокумент, ТекТочкаУчета);
			
			ТекКлючПомещения = ТекТочкаУчета.КлючПомещения
		КонецЦикла;
		
		Если НЕ НовыйДокумент = Неопределено Тогда
			// Проводим документ последнего Абонента
			НовыйДокумент.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеФайла", Истина);
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		Успешно = Истина;
	Исключение 		
		ОтменитьТранзакцию(); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании документа: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШапкуДокумента(НовыйДокумент, ТекТочкаУчета)
	
	НовыйДокумент.Дата 				= Дата;
	НовыйДокумент.ПериодНачисления 	= ПериодНачисления;
	НовыйДокумент.ВидОперации 		= ВидОперации;
	НовыйДокумент.Организация 		= Организация;
	НовыйДокумент.Район 			= Район;
	НовыйДокумент.Абонент 			= ТекТочкаУчета.Абонент;
	НовыйДокумент.КлючПомещения 	= ТекТочкаУчета.КлючПомещения;
	НовыйДокумент.бестПричинаЗакрытияЛС = ПричинаЗакрытияЛС;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязанныеТабЧасти(НовыйДокумент, ТекТочкаУчета)
	
	СтрокиШкал 		= ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекТочкаУчета.IDСтроки));
	ТабЧастьШкал	= НовыйДокумент.ШкалыПриборовУчета;
	
	Для Каждого ТекШкала из СтрокиШкал Цикл
		НоваяСтрока = ТабЧастьШкал.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекШкала);
		
		ЗаполнитьПоказания(НовыйДокумент, ТекШкала);
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказания(НовыйДокумент, ТекШкала)
	
	СтрокиПоказаний		= ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", ТекШкала.IDСтроки));
	ТабЧастьПоказаний	= НовыйДокумент.ПоказанияПриборовУчета;
	
	Для Каждого ТекПоказания из СтрокиПоказаний Цикл
		НоваяСтрока = ТабЧастьПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекПоказания);
	КонецЦикла; 	
	
КонецПроцедуры



&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

#КонецОбласти

#Область СобытияРеквизитовШапки 

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	ДанныеСтроения = энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияМКД();
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыМКД(Строение, ДанныеСтроения);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеСтроения);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Функция ПолучитьИмяДокумента()
	ИмяДокумента = "";
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС Тогда
		ИмяДокумента = "энргОперацияСЛицевымСчетом";
	ИначеЕсли  ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги Тогда
		ИмяДокумента = "энргОперацияСУслугами";
	КонецЕсли;
	
	Возврат ИмяДокумента; 	
КонецФункции

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ИдентификаторСтроки = Неопределено)
	
	//ТочкаУчета  									= Неопределено;
	//Если ИдентификаторСтроки = Неопределено Тогда
	//	ТаблицаТЧ 									= ПоказанияПриборовУчета.Выгрузить();
	//	ШкалыПриборовУчета.Очистить();
	//	ПоказанияПриборовУчета.Очистить();
	//	ТочкиУчета.Очистить();
	//Иначе
	//	СтрокаТочкиУчета  							= ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
	//	ТочкаУчета 									= СтрокаТочкиУчета.ТочкаУчета;
	//	ПоискШкал	 								= Новый Структура("IDСтрокиТочкиУчета",СтрокаТочкиУчета.IDСтроки);
	//	СтрокиШкал  								= ШкалыПриборовУчета.НайтиСтроки(ПоискШкал);
	//	Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
	//		ПоискПоказаний 							= Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки);
	//		СтрокиПоказаний 						= ПоказанияПриборовУчета.НайтиСтроки(ПоискПоказаний);
	//		Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
	//			ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
	//		КонецЦикла;
	//		ШкалыПриборовУчета.Удалить(СтрокаШкалы);
	//	КонецЦикла;		
	//КонецЕсли;

	Результат 										= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПоМаршруту(Дата, Организация, Район, Неопределено, Строение); 
	
	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	Пока Выборка.следующий() цикл
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			Если ИдентификаторСтроки = Неопределено Тогда
				СтрокаТочкиУчета  					= ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			иначе 				
				СтрокаТочкиУчета  					= ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
				IDСтрокиТочки 						= СтрокаТочкиУчета.IDСтроки;
			КонецЕсли;
			СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 			= Выборка.ПриборУчета;
			СтрокаТочкиУчета.КлючПомещения 			= Выборка.КлючПомещения;
			// todo: Сделать заполнение абонента
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			КонецЕсли;
			
			СтрокаПоказаний 						= ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;
		ТекШкала 									= Выборка.Шкала;
	КонецЦикла; 
	
	
	ЗаполнитьНомерСтрокиТаблицы(ТочкиУчета);
	ЗаполнитьНомерСтрокиТаблицы(ШкалыПриборовУчета);
	ЗаполнитьНомерСтрокиТаблицы(ПоказанияПриборовУчета);
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Организация,ТочкиУчета,ШкалыПриборовУчета,ПоказанияПриборовУчета,Район); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Организация,ТаблицаПоказанийДляЗаполнения,Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,ПоказанияПриборовУчета);
		
	ДанныеТаблиц = Новый Структура("ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета, Ссылка", ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета, Неопределено);
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(ДанныеТаблиц, ДанныеТаблиц, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	ЗаполнитьАбонентов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерСтрокиТаблицы(ТаблицаНумерации)
	
	НомерСтроки = 0;
	Для Каждого ТекСтрока из ТаблицаНумерации Цикл
		НомерСтроки 			= НомерСтроки + 1;
		ТекСтрока.НомерСтроки	= НомерСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАбонентов()
	
	Ключи 			= ТочкиУчета.Выгрузить(,"КлючПомещения").ВыгрузитьКолонку("КлючПомещения");
	КлючиАбонентов 	= АбонентыКлючейПомещений(Ключи);
	Для Каждого СтрТУ Из ТочкиУчета Цикл
		СтрТУ.Абонент = КлючиАбонентов.Получить(СтрТУ.КлючПомещения);
	КонецЦикла; 
	
КонецПроцедуры  

&НаСервере
Функция АбонентыКлючейПомещений(Ключи)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.Ссылка КАК Абонент,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	НЕ энргАбоненты.ПометкаУдаления
		|	И энргАбоненты.КлючПомещения В(&КлючПомещения)
		|	И энргАбоненты.Организация = &Организация";
	
	Запрос.УстановитьПараметр("КлючПомещения"	, Ключи);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.КлючПомещения,ВыборкаДетальныеЗаписи.Абонент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СобытияТаблицыФормыЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	
	ТекущаяСтрока 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущаяСтрока;
	ЗаполнитьПриборыУчетаСервер(ТекущаяСтрока);
		
КонецПроцедуры

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ДополнительныеПараметры.ТекущиеДанные);
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыЕстьШкалыНетТарифныхЗон

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата);
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ПроверкаУдаленияСтроки(ДопПараметры);	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПослеУдаления(Элемент)
	ЗаполнитьНомерСтрокиТаблицы(ТочкиУчета);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ЗаполнитьНомерСтрокиТаблицы(ТочкиУчета);
	КонецЕсли;
КонецПроцедуры

#Область СобытияТаблицыФормыПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПослеУдаления(Элемент)
	ЗаполнитьНомерСтрокиТаблицы(ПоказанияПриборовУчета);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТаблицыФормыНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Дата);
КонецПроцедуры

#КонецОбласти
