#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСПоследовательностью

Функция ИзменитьЗадолженность(Знач ТекущееСостояниеЗадолженности, Знач ДанныеДокумента) Экспорт 	
	УменьшитьАванс(ТекущееСостояниеЗадолженности,ДанныеДокумента);
	УвеличитьЗадолженность(ТекущееСостояниеЗадолженности,ДанныеДокумента);
	Оплатить(ТекущееСостояниеЗадолженности,ДанныеДокумента);
	Возврат ТекущееСостояниеЗадолженности;	
КонецФункции

Функция СформироватьНаборыДляЗаписи(Знач ИсходноеСостояние, Знач ТекущееСостояниеЗадолженности) Экспорт 
	
КонецФункции

Процедура ЗаполнитьЗадолженностьНаГраницуНарушенияПоследовательности(МВТ,СостояниеЗадолженностиВсехАбонентов, Знач ИмяТаблицыАбоненты,Знач ИмяТаблицыГраницаНарушения, Знач Делегат = Неопределено) Экспорт	
	
	Если Делегат = Неопределено Тогда
		Делегат 					= ДелегатЗаполнитьЗадолженностьНаГраницуНарушенияПоследовательностиПоУмолчанию();
	КонецЕсли;
	
	ИмяТаблицыОстаткиНаНачало 		= "ОстатокЗадолженностиПоУслугамНаНачалоПериода";
	Делегат.МетодПолучитьОстатокЗадолженностиНаНачалоПериода.Вызвать(Новый Структура("МВТ,ИмяТаблицыДляПомещения",МВТ,ИмяТаблицыОстаткиНаНачало));
	
	ИмяТаблицыВзаиморасчетыОбороты 	= "ОборотыВзаиморасчетовПоУслугамЗаПериодНачисления";
	Делегат.МетодПолучитьОборотыЗадолженностиЗаПериод.Вызвать(Новый Структура("МВТ,ИмяТаблицыДляПомещения",МВТ,ИмяТаблицыВзаиморасчетыОбороты));
				
	Результат   					= РезультатЗадолженностьНаГраницуНарушенияПоследовательности(МВТ,ИмяТаблицыАбоненты,ИмяТаблицыГраницаНарушения,ИмяТаблицыОстаткиНаНачало,ИмяТаблицыВзаиморасчетыОбороты);
	Выборка 						= Результат.Выбрать();
	текАбонент 						= Неопределено;
	Пока Выборка.Следующий() Цикл
		Если Не текАбонент = Выборка.Абонент Тогда
			УслугиПоМесяцам 		= ОписаниеТаблицыЗадолженности();
			Если СостояниеЗадолженностиВсехАбонентов[Выборка.Абонент] = Неопределено Тогда
				СостояниеЗадолженностиВсехАбонентов.Вставить(Выборка.Абонент, Новый Структура("УслугиПоМесяцам", УслугиПоМесяцам));			
			КонецЕсли;
		КонецЕсли;		
		УслугиПоМесяцам 			= СостояниеЗадолженностиВсехАбонентов[Выборка.Абонент].УслугиПоМесяцам;
		ЗаполнитьЗначенияСвойств(УслугиПоМесяцам.Добавить(), Выборка);		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеВсехДокументовИзмененияЗадолженности(МВТ, ДанныеИзмененияЗадолженностиВсехДокументов, Знач ИмяТаблицыДокументыДляПроведения, Знач Делегат = Неопределено) Экспорт  
	
	Если Делегат = Неопределено Тогда
		Делегат 						= ДелегатЗаполнитьДанныеВсехДокументовИзмененияЗадолженностиПоУмолчанию();
	КонецЕсли;
	
	Результат   						= РезультатДанныеДокументовИзмененияЗадолженности(МВТ, ИмяТаблицыДокументыДляПроведения);
	Выборка 							= Результат.Выбрать();
	текАбонент 							= Неопределено;
	текРегистратор 						= Неопределено;
	Пока Выборка.Следующий() Цикл
		Если Не текАбонент = Выборка.Абонент 
			ИЛИ НЕ текРегистратор = Выборка.ДокРегистратор Тогда
			УслугиПоМесяцам 			= ОписаниеТаблицыДанныеДокумента();
			Если ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент] = Неопределено Тогда
				СоотвествиеРегистратор 	= Новый Соответствие;
				СоотвествиеРегистратор.Вставить(Выборка.ДокРегистратор, Новый Структура("УслугиПоМесяцам", УслугиПоМесяцам));
				ДанныеИзмененияЗадолженностиВсехДокументов.Вставить(Выборка.Абонент, СоотвествиеРегистратор);			
			ИначеЕсли ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент][Выборка.ДокРегистратор] = Неопределено Тогда
				ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент].Вставить(Выборка.ДокРегистратор, Новый Структура("УслугиПоМесяцам", УслугиПоМесяцам));				
			КонецЕсли;
		КонецЕсли; 				
		НачисленияПоУслугам 			= ДанныеИзмененияЗадолженностиВсехДокументов[Выборка.Абонент][Выборка.Регистратор].УслугиПоМесяцам;
		ЗаполнитьЗначенияСвойств(НачисленияПоУслугам.Добавить(), Выборка);
		текАбонент 						= Выборка.Абонент;
		текРегистратор 					= Выборка.ДокРегистратор;
	КонецЦикла;
	
КонецПроцедуры

Функция ДелегатЗаполнитьДанныеВсехДокументовИзмененияЗадолженностиПоУмолчанию() Экспорт 
	Возврат Новый Структура;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УменьшитьАванс(ТекущееСостояниеЗадолженности, ДанныеДокумента)
	
КонецПроцедуры

Процедура УвеличитьЗадолженность(ТекущееСостояниеЗадолженности, ДанныеДокумента)
			
КонецПроцедуры

Процедура Оплатить(ТекущееСостояниеЗадолженности, ДанныеДокумента)
	
КонецПроцедуры

Функция РезультатЗадолженностьНаГраницуНарушенияПоследовательности(МВТ,ИмяТаблицыАбоненты,ИмяТаблицыГраницаНарушенияПоследовательности,ИмяТаблицыОстаткиНаНачало,ИмяТаблицыВзаиморасчетыОбороты)
	СхемаЗапроса 	= Новый СхемаЗапроса;
	Пакет 			= СхемаЗапроса.ПакетЗапросов[0];
	// TODO Изменить имена источников
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗадолженностьНаГраницу());	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса,Новый Структура,МВТ);	
КонецФункции

Функция РезультатДанныеДокументовИзмененияЗадолженности(МВТ, ИмяТаблицыДокументыДляПроведения) 
	
	Схема  				= Новый СхемаЗапроса;
	ТипыДокументов 		= Метаданные.ОпределяемыеТипы.энргДокументыИзмененияЗадолженностиПоМесяцам.Тип.Типы();
	
	
	
КонецФункции

Функция ТекстЗапросаЗадолженностьНаГраницу()
	
	Текст 	=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.ПериодРасчета КАК ПериодРасчета,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстатокНачалоПериода.Организация КАК Организация,
	|		ОстатокНачалоПериода.ПериодНачисления КАК ПериодНачисления,
	|		ОстатокНачалоПериода.Район КАК Район,
	|		ОстатокНачалоПериода.МКД КАК МКД,
	|		ОстатокНачалоПериода.Абонент КАК Абонент,
	|		ОстатокНачалоПериода.Услуга КАК Услуга,
	|		ОстатокНачалоПериода.Поставщик КАК Поставщик,
	|		ОстатокНачалоПериода.ПериодНачисления КАК ПериодРасчета,
	|		ОстатокНачалоПериода.Сумма КАК Сумма
	|	ИЗ
	|		РазличныеАбоненты КАК РазличныеАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстатокЗадолженностиПоУслугамНаНачалоПериода КАК ОстатокНачалоПериода
	|			ПО РазличныеАбоненты.Район = ОстатокНачалоПериода.Район
	|				И РазличныеАбоненты.МКД = ОстатокНачалоПериода.МКД
	|				И РазличныеАбоненты.Абонент = ОстатокНачалоПериода.Абонент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзаиморасчетыОбороты.Организация КАК Организация,
	|		ВзаиморасчетыОбороты.ПериодНачисления,
	|		ВзаиморасчетыОбороты.Район,
	|		ВзаиморасчетыОбороты.МКД,
	|		ВзаиморасчетыОбороты.Абонент,
	|		ВзаиморасчетыОбороты.Услуга,
	|		ВзаиморасчетыОбороты.Поставщик,
	|		ВзаиморасчетыОбороты.ПериодНачисления,
	|		СУММА(ВзаиморасчетыОбороты.Сумма)
	|	ИЗ
	|		ГраницаНарушенияПоследовательности КАК ГраницаНарушенияПоследовательности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОборотыВзаиморасчетовПоУслугамЗаПериодНачисления КАК ВзаиморасчетыОбороты
	|			ПО (ВЫБОР
	|					КОГДА ГраницаНарушенияПоследовательности.ДатаРегистратора > ВзаиморасчетыОбороты.Период
	|						ТОГДА ИСТИНА
	|					КОГДА ГраницаНарушенияПоследовательности.ДатаРегистратора = ВзаиморасчетыОбороты.Период
	|						ТОГДА ВЫБОР
	|								КОГДА ГраницаНарушенияПоследовательности.ДопПорядок = 0
	|										И ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.энргНачисление
	|									ТОГДА ЛОЖЬ
	|								ИНАЧЕ ГраницаНарушенияПоследовательности.ДокРегистратор > ВзаиморасчетыОбороты.Регистратор
	|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|				И ГраницаНарушенияПоследовательности.Район = ВзаиморасчетыОбороты.Район
	|				И ГраницаНарушенияПоследовательности.МКД = ВзаиморасчетыОбороты.МКД
	|				И ГраницаНарушенияПоследовательности.Абонент = ВзаиморасчетыОбороты.Абонент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаиморасчетыОбороты.Организация,
	|		ВзаиморасчетыОбороты.ПериодНачисления,
	|		ВзаиморасчетыОбороты.Район,
	|		ВзаиморасчетыОбороты.МКД,
	|		ВзаиморасчетыОбороты.Абонент,
	|		ВзаиморасчетыОбороты.Услуга,
	|		ВзаиморасчетыОбороты.Поставщик,
	|		ВзаиморасчетыОбороты.ПериодНачисления) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.Поставщик,
	|	ВложенныйЗапрос.ПериодРасчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	Абонент,
	|	ПериодРасчета,
	|	Услуга";
	Возврат Текст;

КонецФункции

Функция ОписаниеТаблицыЗадолженности()
	тзУслугиПоМесяцам 			= Новый ТаблицаЗначений;
	тзУслугиПоМесяцам.Колонки.Добавить("Организация", 		Новый ОписаниеТипов("СправочникСсылка.Организации"));
	тзУслугиПоМесяцам.Колонки.Добавить("Район", 			Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));	
	тзУслугиПоМесяцам.Колонки.Добавить("МКД", 				Новый ОписаниеТипов("СправочникСсылка.энргСтроения"));
	тзУслугиПоМесяцам.Колонки.Добавить("Абонент", 			Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	тзУслугиПоМесяцам.Колонки.Добавить("Услуга", 			Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	тзУслугиПоМесяцам.Колонки.Добавить("ПериодНачисления", 	Новый ОписаниеТипов("Дата"));
	тзУслугиПоМесяцам.Колонки.Добавить("Поставщик", 		Новый ОписаниеТипов("СправочникСсылка.энргКонтрагенты"));
	тзУслугиПоМесяцам.Колонки.Добавить("Сумма", 			Метаданные.РегистрыНакопления.энргВзаиморасчетыПоМесяцам.Ресурсы.Сумма.Тип);
	Возврат тзУслугиПоМесяцам;
КонецФункции

Функция ОписаниеТаблицыДанныеДокумента()
	тзНачисленияПоУслугам 		= Новый ТаблицаЗначений;
	тзНачисленияПоУслугам.Колонки.Добавить("Организация", 			Новый ОписаниеТипов("СправочникСсылка.Организации"));
	тзНачисленияПоУслугам.Колонки.Добавить("Район", 				Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	тзНачисленияПоУслугам.Колонки.Добавить("МКД", 					Новый ОписаниеТипов("СправочникСсылка.энргСтроения"));
	тзНачисленияПоУслугам.Колонки.Добавить("Абонент", 				Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	тзНачисленияПоУслугам.Колонки.Добавить("Услуга", 				Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	тзНачисленияПоУслугам.Колонки.Добавить("Поставщик", 			Новый ОписаниеТипов("СправочникСсылка.энргКонтрагенты"));
	тзНачисленияПоУслугам.Колонки.Добавить("ПериодНачисления", 		Новый ОписаниеТипов("Дата"));
	тзНачисленияПоУслугам.Колонки.Добавить("ПериодРасчета", 		Новый ОписаниеТипов("Дата"));
	тзНачисленияПоУслугам.Колонки.Добавить("Сумма", 				Метаданные.РегистрыНакопления.энргОбъемНачислений.Ресурсы.Сумма.Тип);
	Возврат тзНачисленияПоУслугам;
КонецФункции

Функция ДелегатЗаполнитьЗадолженностьНаГраницуНарушенияПоследовательностиПоУмолчанию()
	Возврат Новый Структура;
КонецФункции

#КонецОбласти