#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОперацияСПриборомУчета(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	ЗаполнитьТекстовыеПоля();
	ПоказатьУзлы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	//энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	Если НЕ ИспользоватьТарифныеЗоны и ИспользоватьШкалыПриборовУчета Тогда
		ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонУстановленныйПУ();	
	КонецЕсли;
	ЗаполнитьТекстовыеПоля();
	ПоказатьУзлы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	яПроверяемыеРеквизиты = Новый Массив;	
	яПроверяемыеРеквизиты.Добавить("ЗаводскойНомер");
	яПроверяемыеРеквизиты.Добавить("ТипПрибораУчета");
	яПроверяемыеРеквизиты.Добавить("ВидКанальности");
	
	энргРаботаСприборамиУчетаСервер.РеквизитыПрибораЗаполнены(Объект,"ТочкиУчета","Точки учета",Отказ, яПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект, Истина);
	СоответствиеСтрок = Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
		
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	#Область ПроеркиЗаполнения
	// Проверка показаний НЕ КОРРЕКТНАЯ!  
	//Для Каждого СтрТЧ Из ТекущийОбъект.ПоказанияПриборовУчета Цикл
	//	Если СтрТЧ.СостояниеПоказаний <> Перечисления.энргСостояниеПоказаний.Приняты Тогда 		
	//		Отказ = Истина;
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны текущие показания. Проверьте корректность введенных данных.");				
	//	КонецЕсли;  			
	//КонецЦикла;
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыФизЛиц() Тогда 
		Для Каждого СтрТЧ Из ТекущийОбъект.ТочкиУчета Цикл
			Если СтрТЧ.УстановленныйПУ Тогда 				
				Продолжить;
			КонецЕсли;
			
			Если СтрТЧ.ДатаПриемки = '00010101000000' Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена колонка ""Дата выпуска"" списка ""Точки учета""");
			КонецЕсли;
			
			Если СтрТЧ.ДатаПоверкиСчетчика = '00010101000000' Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена колонка ""Дата следующей проверки счетчика"" списка ""Точки учета""");
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;
	#КонецОбласти 
	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// TODO FIX ME
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		// TODO FIX ME
		//Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
		
		НовыеПриборыУчета 	= Новый Массив;
		НовыеИзмерители 	= Новый Массив;
		СоответствиеПрибора = Новый Соответствие;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				
				ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
				СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
				
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
				//СтрокаИзмерителя.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				//НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				
				ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
				СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
				
				Если СоздаватьНовый Тогда
					ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
				КонецЕсли;			
				
				СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчета", энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект));
		энргРаботаСПериодомДействия.ЗаполнитьДанныеУстановкиФормулы(ТекущийОбъект);	
		
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
		//НовыеИзмерители 					= Новый Массив;
		//Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
		//	НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		//КонецЕсли;
		//Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
		//	ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		//КонецЦикла;
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ, НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.Абонент);
	
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;	
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
	Если ДопСвойства.свойство("ДанныеДляФормулы") тогда
		ДанныеДляФормулы = ДопСвойства.ДанныеДляФормулы;		 
	иначе
		ДанныеДляФормулы = Неопределено;
	КонецЕсли;
	
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	Если НЕ ИспользоватьТарифныеЗоны и ИспользоватьШкалыПриборовУчета Тогда
		ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонУстановленныйПУ();	
	КонецЕсли;
	ЗаполнитьТекстовыеПоля();
	ПоказатьУзлы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли; 
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьДанныеПоСредствамИзмерения" Тогда
		ОбновитьДанныеПоУслугамСервер(Параметр); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НеУстановленныйПУ 	= Новый ФиксированнаяСтруктура("УстановленныйПУ", Ложь);
	УстановленныйПУ 	= Новый ФиксированнаяСтруктура("УстановленныйПУ", Истина);
	
	ЭлементТочки = "ТочкиУчета" + ПрефиксТочекУчета;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементТочки, "ОтборСтрок", НеУстановленныйПУ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементТочки + "Установленные", "ОтборСтрок", УстановленныйПУ);
	
	Если ИспользоватьТарифныеЗоны Тогда
		ЭлементПоказания = "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементПоказания, "ОтборСтрок", НеУстановленныйПУ);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементПоказания + "Установленные", "ОтборСтрок", УстановленныйПУ);
	ИначеЕсли ИспользоватьШкалыПриборовУчета Тогда 
		ЭлементШкалы = "ШкалыПриборовУчета" + ПрефиксТочекУчета;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементШкалы, "ОтборСтрок", НеУстановленныйПУ);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементШкалы + "Установленные", "ОтборСтрок", УстановленныйПУ);	
	КонецЕсли;
	
	
	//Элементы["ТочкиУчета" + ПрефиксТочекУчета].ОтборСтрок						= Новый ФиксированнаяСтруктура("УстановленныйПУ", Ложь);
	//Элементы["ТочкиУчета" + ПрефиксТочекУчета + "Установленные"].ОтборСтрок		= Новый ФиксированнаяСтруктура("УстановленныйПУ", Истина);
	//
	//Если ИспользоватьТарифныеЗоны Тогда
	//	Элементы["ПоказанияПриборовУчета" + ПрефиксТочекУчета].ОтборСтрок						= Новый ФиксированнаяСтруктура("УстановленныйПУ", Ложь);
	//	Элементы["ПоказанияПриборовУчета" + ПрефиксТочекУчета + "Установленные"].ОтборСтрок		= Новый ФиксированнаяСтруктура("УстановленныйПУ", Истина);
	//ИначеЕсли ИспользоватьШкалыПриборовУчета Тогда  
	//	Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ОтборСтрок						= Новый ФиксированнаяСтруктура("УстановленныйПУ", Ложь);
	//	Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета + "Установленные"].ОтборСтрок		= Новый ФиксированнаяСтруктура("УстановленныйПУ", Истина);	
	//КонецЕсли; 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		ПриИзмененииАбонентаСервер();
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
КонецПроцедуры 

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	энргРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("энргОперацияСПриборомУчета",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьПериодНачисленияСервер(); 
    ПриИзмененииАбонентаСервер();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
	
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РегистрируетОбъемПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

#Область ОбщиеСобытияТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	
	ТекущиеДанные 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ТочкаУчета) Тогда
		ТекущиеДанные.Услуга  	= энргРаботаСТочкамиУчетаСервер.УслугаТочкиУчета(Объект.Организация,Объект.Район,Объект.КлючПомещения,ТекущиеДанные.ТочкаУчета,Объект.Дата);		
		ТекущиеДанные.НаправлениеИспользованияТУ = энргРаботаСТочкамиУчетаСервер.НаправлениеИспользованияТочкиУчета(Объект.Организация,Объект.Район,Объект.КлючПомещения,ТекущиеДанные.ТочкаУчета,Объект.Дата);	
	Иначе
		ТекущиеДанные.Услуга 	= ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьДанныеПотерьСервер(ТекущиеДанные.IDСтроки, ТекущиеДанные.ТочкаУчета);
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Отказ = Истина; 
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	ДопПараметры = новый Структура;
	ДопПараметры.Вставить("ТаблицыФормы",ТаблицыФормы);
	ДопПараметры.Вставить("ТаблицыФормыВторогоУровня",ТаблицыФормыВторогоУровня);
	ДопПараметры.Вставить("IDСтроки",ТекущиеДанные.IDСтроки);
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	ТекущиеДанные.НомерСтроки-1);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ДополнительныеПараметры.IDСтроки, Объект, ДополнительныеПараметры.ТаблицыФормы, "ТочкиУчета", ДополнительныеПараметры.ТаблицыФормыВторогоУровня);
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныВидКанальностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета");
	// энргРаботаСВидомДифференцированности }
	
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ЕстьШкалыЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	Состав 									= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтроки,Состав,"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны 

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета  + ПрефиксУстановленных;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета  + ПрефиксУстановленных;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ТекущиеДанные.ВидКанальности 			= ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиШкалы,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности),"ПоказанияПриборовУчета",Неопределено); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	    
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета + ПрефиксУстановленных;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета + ПрефиксУстановленных;
	ТаблицаФормыШкалы	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалы,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные); 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонВидКанальностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаКанальности(ЭтаФорма,ТекущиеДанные.IDСтроки,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета"); 
	// энргРаботаСВидомДифференцированности }
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры 

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонУстановленныйПУ()
	Для Каждого СтрокаКоллекции Из Объект.ШкалыПриборовУчета Цикл	
		Для каждого ТзТочкиУчета Из Объект.ТочкиУчета.Выгрузить(,"IDСтроки,УстановленныйПУ") Цикл
			Если ТзТочкиУчета.IDСтроки = СтрокаКоллекции.IDСтрокиТочкиУчета Тогда
				СтрокаКоллекции.УстановленныйПУ = ТзТочкиУчета.УстановленныйПУ;	
			КонецЕсли;			
		КонецЦикла;  
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыУстановленныеПУ

&НаКлиенте
Процедура  УстановленныеПУПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура  УстановленныеПУРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета, ПрефиксУстановленных);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета, ПрефиксУстановленных);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеПУТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета, ПрефиксУстановленных);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета, ПрефиксУстановленных);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура  УстановленныеПУПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета, ПрефиксУстановленных);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета, ПрефиксУстановленных);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные)
	ДопПараметры = Новый Структура("ЭтоВводПУ,НеРегистрацияОбъема",Истина,Истина);
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма,ДопПараметры);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПотерьСервер(Знач IDСтроки, Знач ТочкаУчета)
		
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери, новый Структура("IDСтроки", IDСтроки));
		
	Результат 		= энргРаботаСТочкамиУчетаСервер.ПолучитьАктуальныеЗначенияПотерь(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ТочкаУчета);
	Выборка 		= Результат.Выбрать();
	
	ФиксПотери		= Перечисления.энргСпособыРасчетаПотерь.ФиксированныйОбъем;
	
	Пока Выборка.Следующий() Цикл
		НСтрока 			= Объект.Потери.Добавить();
		НСтрока.IDСтроки 	= IDСтроки;
		НСтрока.ВидПотерь 	= Выборка.ВидПотерь;
		Если Выборка.СпособРасчетаПотерь = ФиксПотери Тогда
			НСтрока.ФиксированныйОбъемПотерь 	= Выборка.Значение;
		Иначе 
			НСтрока.ПроцентПотерь 				= Выборка.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваТочекУчета(Знач ТекущийОбъект)
	
	ПолучаемыеСвойстваТочекУчета 	= ПолучаемыеСвойстваТочекУчета();
	мТочкиУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"));	
	СвойстваТочекУчета 				= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектов(мТочкиУчета, ПолучаемыеСвойстваТочекУчета);
	ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Объект.ТочкиУчета, СвойстваТочекУчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Коллекция, СвойстваТочекУчета)
	
	СоотвествиеРеквизитовСвойств 								= СоотвествиеРеквизитовСвойствамТочкиУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ТочкаУчета) Тогда
			СвойстваТочкиУчета 									= СвойстваТочекУчета[СтрокаКоллекции.ТочкаУчета];		
		Иначе
			СвойстваТочкиУчета 									= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеТочки);
		КонецЕсли; 
		
		Если СвойстваТочкиУчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СвойстваТочкиУчета.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваТочкиУчета[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета() 
	Возврат энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
КонецФункции

&НаСервере
Функция ПолучаемыеСвойстваТочекУчета() 
	ПолучаемыеСвойстваТочекУчета 	= "
	|Наименование,Расположение";	
	Возврат ПолучаемыеСвойстваТочекУчета;
КонецФункции

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Функция СоотвествиеРеквизитовСвойствамПрибораУчета()
	Возврат энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамТочкиУчета()
	Возврат Новый Структура("НаименованиеТочки,Расположение","Наименование","Расположение");
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииАбонентаСервер() 
	
	ПолучаемыеСвойства 			= "Организация,Район,КлючПомещения";
	ЗначенияРеквизитов 			= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Объект.Абонент, ПолучаемыеСвойства);
	ЗаполнитьЗначенияСвойств(Объект,ЗначенияРеквизитов,ПолучаемыеСвойства);
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	ЗаполнитьПриборыУчетаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ИдентификаторСтроки  = Неопределено)
	
	ТочкаУчета 										= Неопределено;
	СтрокаТочкиУчета 								= Неопределено;
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		СтрокаТочкиУчета 							= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
	КонецЕсли;	
	
	ТаблицаТЧ 										= Объект.ПоказанияПриборовУчета.Выгрузить();
	
	Если СтрокаТочкиУчета = Неопределено Тогда 		
		Объект.ТочкиУчета.Очистить();
		Объект.Измерители.Очистить();
		Объект.ШкалыПриборовУчета.Очистить();
		Объект.ПоказанияПриборовУчета.Очистить();
	Иначе
		ОтборСтрок									= Новый Структура("IDСтрокиТочкиУчета", СтрокаТочкиУчета.IDСтроки);
		СтрокиШкалДляУдаления 						= Объект.ШкалыПриборовУчета.НайтиСтроки(ОтборСтрок);
		Для Индекс  = 0 По СтрокиШкалДляУдаления.ВГраница() Цикл
			СтрокаШкалы 							= СтрокиШкалДляУдаления[Индекс];
			СтрокиПоказанияДляУдаления 				= Объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));
			Для ИндекПоказаний = 0 По СтрокиПоказанияДляУдаления.ВГраница() Цикл
				Объект.ПоказанияПриборовУчета.Удалить(СтрокиПоказанияДляУдаления[ИндекПоказаний]);
			КонецЦикла;
			Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
		КонецЦикла;
		
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Измерители, ОтборСтрок); 
	КонецЕсли;
	
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыФизЛиц() Тогда
		ЗаполнитьПриборыУчетаСВспомогательнымОборудованием(ТочкаУчета, ИдентификаторСтроки)
	Иначе 		
		ЗаполнитьПриборыУчетаБезВспомогательногоОборудования(ТочкаУчета, ИдентификаторСтроки);
	КонецЕсли;
	
	СоотвествиеКолонок = Новый Структура;
	СоотвествиеКолонок.Вставить("IDСтроки"		, "IDСтроки");
	СоотвествиеКолонок.Вставить("ПриборУчета"	, "ПриборУчета");
	
	ТаблицаПоказанийДляЗаполнения 		= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район,Объект.КлючПомещения,ИдентификаторСтроки,СоотвествиеКолонок); 
	РезультатДанныеЗаполненияПоказаний 	= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,Объект.Район,ТаблицаПоказанийДляЗаполнения,Объект.Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, Объект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	ЗаполнитьТекстовыеПоля();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаБезВспомогательногоОборудования(ТочкаУчета, ИдентификаторСтроки)	
	Результат 										= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения, ТочкаУчета); 
	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			Если ИдентификаторСтроки = Неопределено Тогда
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;  				
				СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки; 				
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
				СтрокаТочкиУчета.КоэффициентПУ		= 1;
				СтрокаТочкиУчета.УстановленныйПУ 	= Истина;
			    СтрокаТочкиУчета.ЗаводскойНомер		= Выборка.ЗаводскойНомерПриборУчета;
			КонецЕсли;	
			СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета			= Выборка.ПриборУчета;	
			СтрокаТочкиУчета.ВидКанальности			= Выборка.ПриборУчета.ВидКанальности;
			СтрокаТочкиУчета.ТипПрибораУчета		= Выборка.ПриборУчета.ТипПрибораУчета;
		КонецЕсли;
		
		Если НЕ ТекШкала = Выборка.Шкала Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			СтрокаШкалы  							= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 							= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 			= СтрокаТочкиУчета.IDСтроки;
			СтрокаШкалы.IDСтроки 					= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 						= Выборка.Шкала; 
			СтрокаШкалы.УстановленныйПУ 			= Истина;
		КонецЕсли;
		
		СтрокаПоказаний 							= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.Шкала                       = Выборка.Шкала;
		СтрокаПоказаний.ЕдиницаИзмерения            = Выборка.Шкала.ЕдиницаИзмерения;   
		СтрокаПоказаний.IDСтроки 					= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 				= Выборка.ТарифнаяЗона;
				
		ТекТочкаУчета 	= Выборка.ТочкаУчета;
		ТекШкала 		= Выборка.Шкала;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриборыУчетаСВспомогательнымОборудованием(ТочкаУчета, ИдентификаторСтроки)
	Результат 		= Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиБезПрибораУчета(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ТочкаУчета); 
	Выборка  		= Результат.выбрать();
	ТекТочкаУчета 	= Неопределено;
	ТекШкала 		= Неопределено;
	IDСтрокиТочки 	= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			Если ИдентификаторСтроки = Неопределено Тогда
				СтрокаТочкиУчета  			= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 				= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки 	= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета = Выборка.ТочкаУчета;
			КонецЕсли;	
			СтрокаТочкиУчета.Услуга 					= Выборка.Услуга;
			СтрокаТочкиУчета.НаправлениеИспользованияТУ	= Выборка.НаправлениеИспользованияТУ;			
		КонецЕсли;		
				
		ТекТочкаУчета = Выборка.ТочкаУчета;
	КонецЦикла;
	
	//Результат 										= энргСостояниеПриборовУчета.ДействующийСоставУзлаПомещения(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ТочкаУчета); 
	//РезультатТУ										= Результат[Результат.Количество()-2];
	//РезультатИзмерители								= Результат[Результат.Количество()-1].Выгрузить();
	//Выборка  										= РезультатТУ.выбрать();
	//ТекТочкаУчета 									= Неопределено;
	//ТекШкала 										= Неопределено;
	//IDСтрокиТочки 									= Неопределено;
	//IDСтрокиШкалы 									= Неопределено;
	//Пока Выборка.следующий() цикл
	//	Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
	//		Если ИдентификаторСтроки = Неопределено Тогда
	//			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
	//			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
	//			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
	//			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
	//		КонецЕсли;	
	//		СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;
	//		СтрокаТочкиУчета.ТипУзлаУчета 			= Выборка.ТипУзлаУчета;
	//		СтрокаТочкиУчета.ПриборУчета			= Выборка.ПриборУчета;
	//		СтрокаТочкиУчета.НаправлениеИспользованияТУ	= Выборка.НаправлениеИспользованияТУ;
	//		
	//		СтрокаИзмерителя 								= Объект.Измерители.Добавить();
	//		СтрокаИзмерителя.IDСтроки 						= Новый УникальныйИдентификатор;
	//		СтрокаИзмерителя.IDСтрокиТочкиУчета 			= IDСтрокиТочки;
	//		СтрокаИзмерителя.ПриборУчета 					= СтрокаТочкиУчета.ПриборУчета;
	//		СтрокаИзмерителя.ВспомогательноеОборудование 	= Ложь;
	//		СтрокаИзмерителя.ТипПрибораУчета       			= Выборка.ТипПрибораУчета;
	//		СтрокаИзмерителя.РасположениеИзмерителя			= Выборка.РасположениеИзмерителя; 			
	//		СтрокаИзмерителя.ТипИзмерителя					= Выборка.ТипИзмерителя; 			
	//		
	//		
	//		Отбор 				= Новый Структура("ТочкаУчета", Выборка.ТочкаУчета);
	//		СтрокиИзмерителей 	= РезультатИзмерители.НайтиСтроки(Отбор);
	//		Для Каждого стр из СтрокиИзмерителей Цикл
	//			СтрокаИзмерителя 							= Объект.Измерители.Добавить();
	//			СтрокаИзмерителя.IDСтроки 					= Новый УникальныйИдентификатор;
	//			СтрокаИзмерителя.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
	//			ЗаполнитьЗначенияСвойств(СтрокаИзмерителя, стр);
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//	Если НЕ ТекШкала = Выборка.Шкала Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
	//		СтрокаШкалы  							= Объект.ШкалыПриборовУчета.Добавить();
	//		IDСтрокиШкалы 							= Новый УникальныйИдентификатор;
	//		СтрокаШкалы.IDСтрокиТочкиУчета 			= СтрокаТочкиУчета.IDСтроки;
	//		СтрокаШкалы.IDСтроки 					= IDСтрокиШкалы;
	//		СтрокаШкалы.Шкала 						= Выборка.Шкала;
	//		СтрокаШкалы.ВидДифференцированности 	= Выборка.ВидДифференцированности;
	//	КонецЕсли;
	//	
	//	СтрокаПоказаний 							= Объект.ПоказанияПриборовУчета.Добавить();
	//	СтрокаПоказаний.IDСтроки 					= IDСтрокиШкалы;
	//	СтрокаПоказаний.IDСтрокиТочкиУчета 			= IDСтрокиТочки;
	//	СтрокаПоказаний.ТарифнаяЗона 				= Выборка.ТарифнаяЗона;
	//			
	//	ТекТочкаУчета 	= Выборка.ТочкаУчета;
	//	ТекШкала 		= Выборка.Шкала;
	//КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если СтрНайти(ТекущаяСтраница.Имя, "Установленные") <> Неопределено Тогда
		ПрефиксУстановленных =  "Установленные";
	Иначе
		ПрефиксУстановленных = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РаботаСУзлами

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ИмяТаблицыТочек = "ТочкиУчета" + ПрефиксТочекУчета;
		ТекущиеДанные 	= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.IDСтроки 			= Новый УникальныйИдентификатор;
		ТекущиеДанные.СредстваИзмерения = "Не заполнены";
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект));
	КонецЕсли; 	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПераметрыОбновления) Экспорт 
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПераметрыОбновления.IDСтроки, ПераметрыОбновления.Результат, ПераметрыОбновления.ДанныеПУ);
	
	СтрокиТочки = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", ПераметрыОбновления.IDСтроки));
	Если СтрокиТочки.Количество() > 0 Тогда 
		СтрокаТочки = СтрокиТочки[0];
		ЗаполнитьЗначенияСвойств(СтрокаТочки, ПераметрыОбновления.ДанныеПУ);
		СтрокаТочки.КоэффициентПУ = ПераметрыОбновления.Результат.КоэффициентПУ; 
		Если СтрокаТочки.Свойство("ДатаПриемки") Тогда
			СтрокаТочки.ДатаПриемки = ПераметрыОбновления.ДанныеПУ.ДатаВыпуска;
		КонецЕсли;
	КонецЕсли;
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,Объект);
	
	ПоказатьУзлы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()	
	Для Каждого ТекСтрока ИЗ Объект.ТочкиУчета Цикл
		ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
	КонецЦикла;		
КонецПроцедуры

// В дальнейшем удалится 
&НаСервере
Процедура ПоказатьУзлы()
	Если НЕ энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргУзлыУчетаФизическихЛиц") Тогда
		Возврат
	КонецЕсли;
	
	ПрефиксТочекУчета 										= "";
	
	Элементы.СтраницаЕстьШкалыЕстьТарифныеЗоны.Видимость  	= Ложь;
	Элементы.СтраницаНетШкалЕстьТарифныеЗоны.Видимость  	= Ложь;
	Элементы.СтраницаЕстьШкалыНетТарифныхЗон.Видимость  	= Ложь;
	Элементы.СтраницаНетШкалНетТарифныхЗон.Видимость  		= Ложь;
	Элементы.СтраницаУслуги.Видимость  						= Истина;
КонецПроцедуры

#КонецОбласти








