#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	IDСтроки 						= Параметры.IDСтроки;
	Услуга 							= Параметры.Услуга;
	
	//Если Параметры.ПриборыУзловУчета.Количество() > 0 Тогда
		ЗаполнитьТЧИзПараметров(Параметры.ПриборыУзловУчета			, ПриборыУзловУчета);
		ЗаполнитьТЧИзПараметров(Параметры.ШкалыПриборовУчета		, ШкалыПриборовУчета);
		ЗаполнитьТЧИзПараметров(Параметры.ПоказанияПриборовУчета	, ПоказанияПриборовУчета);
		ЗаполнитьТЧИзПараметров(Параметры.ФормулыРасчетаУслуг		, ФормулыРасчетаУслуг);
		ЗаполнитьТЧИзПараметров(Параметры.ШкалыУслуг				, ШкалыУслуг);
	//Иначе
	//	ЗаполнитьТЧИзПараметров(Параметры.ПриборыУзловУчета			, ПриборыУзловУчета);
	//	ЗаполнитьТЧИзПараметров(Параметры.ШкалыПриборовУчета		, ШкалыПриборовУчета);
		Для каждого стр из ШкалыПриборовУчета Цикл
			Если НЕ ЗначениеЗаполнено(стр.IDСтрокиТарифнаяЗона) Тогда
				стр.IDСтрокиТарифнаяЗона = Новый УникальныйИдентификатор;
			КонецЕсли;
		КонецЦикла;
	//КонецЕсли;

	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,Неопределено);
	
	УправлениеВидимостью(Параметры, "ЭлементыДляСкрытия"	, Ложь);
	УправлениеВидимостью(Параметры, "ЭлементыДляОтображения", Истина);
	
	//Если Параметры.Свойство("ЭлементыДляСкрытия") Тогда
	//	Для Каждого ТекЭлемент Из Параметры.ЭлементыДляСкрытия Цикл	
	//		Элемент = СтрЗаменить(ТекЭлемент,"ПрефиксТочекУчета",ПрефиксТочекУчета);
	//		УправлениеВидимостью(Элемент,Ложь);
	//	КонецЦикла;
	//КонецЕсли;
	
	мСписокУслуг 					= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(Услуга);
	ТаблицаФормулыРасчетаУслуг 		= Элементы.ФормулыРасчетаУслуг;
	ПолеУслуга  					= ТаблицаФормулыРасчетаУслуг.ПодчиненныеЭлементы.Найти("ФормулыРасчетаУслугУслуга");
	ПолеУслуга.СписокВыбора.ЗагрузитьЗначения(мСписокУслуг);
	
	//Если Параметры.ПриборыУзловУчета.Количество() > 0 Тогда
	//	//Для каждого стр из ПриборыУзловУчета Цикл
	//	//	стр.ВидИзмерителя = стр.ТипПрибораУчета.Родитель;
	//	//КонецЦикла;
	//Иначе
		Для каждого стр из ПриборыУзловУчета Цикл
			Если не ЗначениеЗаполнено(стр.IDСтроки) тогда
				стр.IDСтроки = Новый УникальныйИдентификатор;
			КонецЕсли;
		КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧИзПараметров(ТабЧастьИзДокумента,Таблица)
	Для Каждого ТекСтрока из ТабЧастьИзДокумента Цикл
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура УправлениеВидимостью(Параметры, Свойство, Видимость)	
	
	Если Параметры.Свойство(Свойство) Тогда
		ИзменяемыеЭлементы = Параметры[Свойство];
		Для Каждого ТекЭлемент Из ИзменяемыеЭлементы Цикл	
			ИмяЭлемента = СтрЗаменить(ТекЭлемент, "ПрефиксТочекУчета", ПрефиксТочекУчета);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлемента, "Видимость", Видимость); 
		КонецЦикла;
	КонецЕсли;
	
	//Элементы[Элемент].Видимость = Видимость;	
	
КонецПроцедуры

#КонецОбласти

#Область ВОЗВРАТ_РЕЗУЛЬТАТА

&НаКлиенте
Процедура Ок(Команда)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ПриборыУзловУчета"		,ПриборыУзловУчета);
	ПараметрыЗакрытия.Вставить("ШкалыПриборовУчета"		,ШкалыПриборовУчета);
	ПараметрыЗакрытия.Вставить("ПоказанияПриборовУчета"	,ПоказанияПриборовУчета);
	ПараметрыЗакрытия.Вставить("ФормулыРасчетаУслуг"	,ФормулыРасчетаУслуг);
	ПараметрыЗакрытия.Вставить("ШкалыУслуг"				,ШкалыУслуг);
	
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ПЕРЕОПРЕДЕЛЕННЫЕ_МЕТОДЫ

&НаКлиенте
Процедура ПриИзмененииВидаКанальности(Форма,IDСтрокиТочкиУчета,IDСтроки,Шкалы,ИмяТаблицыШкалы,ИмяТаблицыПоказания, ДанныеФормы = Ложь)
	
	Если не ЗначениеЗаполнено(IDСтроки) тогда
		IDСтроки 							= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если не ДанныеФормы тогда 
		КоллекцияШкалы							= Форма.Объект[ИмяТаблицыШкалы];
		КоллекцияТарифныеЗоны					= Форма.Объект[ИмяТаблицыПоказания];
	иначе
		КоллекцияШкалы							= Форма[ИмяТаблицыШкалы];
		КоллекцияТарифныеЗоны					= Форма[ИмяТаблицыПоказания]; 		
	КонецЕсли;
	
	// Ищем строки по индентификатору
	СтруктураПоиска  						= Новый Структура("IDСтроки",IDСтроки);
	
	СтрокиШкалыУдалить						= КоллекцияШкалы.НайтиСтроки(СтруктураПоиска);	
	
	для Каждого СтрокаШкалаУдалить из СтрокиШкалыУдалить цикл		
		СтрокиТарифныхЗон 					= КоллекцияТарифныеЗоны.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалаУдалить["IDСтрокиТарифнаяЗона"]));//["IDСтроки"]));
		для Каждого СтрокаТарифнойЗоны из СтрокиТарифныхЗон цикл
			КоллекцияТарифныеЗоны.Удалить(СтрокаТарифнойЗоны);
		КонецЦикла;   		
		КоллекцияШкалы.Удалить(СтрокаШкалаУдалить);		
	КонецЦикла;  	 
	
	
	для Каждого Шкала из Шкалы цикл		
		СтрокаШкалы 						= КоллекцияШкалы.добавить();
		СтрокаШкалы["IDСтрокиТочкиУчета"]	= IDСтрокиТочкиУчета;
		СтрокаШкалы["IDСтроки"]				= IDСтроки;
		СтрокаШкалы["IDСтрокиТарифнаяЗона"]	= Новый УникальныйИдентификатор;
		СтрокаШкалы.Шкала		 			= Шкала;				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы, ПостФиксКолонки = "", ТаблицыВторогоУровня = Неопределено, РеквизитID)
	
	СтруктураПоиска  				= Новый Структура(РеквизитID + ПостФиксКолонки,IDСтроки);
	Для Каждого ТаблицаФормы из ТаблицыФормы цикл
		Коллекция  					= Объект[ТаблицаФормы];
		Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);	
		Для Каждого УдаляемаяСтрока из Строки Цикл 
			Если ТаблицыВторогоУровня <> Неопределено Тогда 
				СтруктураПоиска2  				= Новый Структура(РеквизитID,УдаляемаяСтрока.IDСтрокиТарифнаяЗона);//IDСтроки);
				Для Каждого ТаблицаФормы2 Из ТаблицыВторогоУровня Цикл
					Коллекция2  				= Объект[ТаблицаФормы2];
					Строки2  					= Коллекция2.НайтиСтроки(СтруктураПоиска2);	
					Для Каждого УдаляемаяСтрока2 из Строки2 Цикл 
						Коллекция2.Удалить(УдаляемаяСтрока2);
					КонецЦикла;
				КонецЦикла;			
			КонецЕсли;
			
			Коллекция.Удалить(УдаляемаяСтрока);
		КонецЦикла; 
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидаДифференцированности(Форма,IDСтроки,IDСтрокиТочкиУчета,Состав,ИмяТабЧасти,ИмяТабЧастиФормулы,ДанныеФормы  = Ложь, ВыводПрибораУчета = Неопределено)
	
	СоотвествиеПоказаний 							= Новый Соответствие;
	
	Если не ЗначениеЗаполнено(IDСтроки) тогда
		IDСтроки 									= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если не ДанныеФормы тогда 
		Коллекция 									= Форма.Объект[ИмяТабЧасти];
	иначе
		Коллекция 									= Форма[ИмяТабЧасти];
	КонецЕсли;
	
	// Ищем строки по индентификатору
	СтруктураПоиска  								= Новый Структура("IDСтроки",IDСтроки);
	Если ВыводПрибораУчета <> Неопределено тогда
		СтруктураПоиска.Вставить("ВыводПрибораУчета", ВыводПрибораУчета);
	КонецЕсли;
	
	СтрокиСоотвествия 								= Коллекция.НайтиСтроки(СтруктураПоиска);	
	
	для Каждого СтрокаСоотвествия из СтрокиСоотвествия цикл
		СоотвествиеПоказаний.Вставить(СтрокаСоотвествия.ТарифнаяЗона,СтрокаСоотвествия.ТекущиеПоказания);
		Коллекция.Удалить(СтрокаСоотвествия);
	КонецЦикла;  	 
	
	для Каждого СтрокаСостава из Состав цикл		
		СтрокаПоказаний 							= Коллекция.добавить();
		СтрокаПоказаний.IDСтроки 					= IDСтроки;
		СтрокаПоказаний.IDСтрокиТочкиУчета 			= IDСтрокиТочкиУчета;
		СтрокаПоказаний.ТарифнаяЗона 				= СтрокаСостава;
		Если СоотвествиеПоказаний[СтрокаСостава] <> Неопределено тогда
			СтрокаПоказаний.ТекущиеПоказания 	= СоотвествиеПоказаний[СтрокаСостава];
		КонецЕсли; 
		
		Если ВыводПрибораУчета<>Неопределено тогда
			СтрокаПоказаний.ВыводПрибораУчета 		= ВыводПрибораУчета;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВСПОМОГАТАЕЛЬНЫЕ_МЕТОДЫ

&НаКлиенте
Процедура ЗаполнитьКоэфициент(ТекущиеДанные) 	
	
	Если ТекущиеДанные.КоэффициентПУ = 0 тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
			ТекущиеДанные.КоэффициентПУ = 1;
		КонецЕсли; 	
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидКанальности) тогда
	//	Если ЗначениеЗаполнено(ТекущиеДанные.ЗаводскойНомер) или ЗначениеЗаполнено(ТекущиеДанные.ДатаПоверкиСчетчика) или ЗначениеЗаполнено(ТекущиеДанные.ТипПрибораУчета) Тогда
	//		ТекущиеДанные.ВидКанальности = ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
	//	КонецЕсли; 	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУслугДляВыбора(ТекУслуга)
	
	СписокУслуг = Новый СписокЗначений; 	
	СписокУслуг.Добавить(ТекУслуга);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка В(&СписокУслуг)";
	
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	РезультатЗапроса 		= Запрос.Выполнить();   	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУслуг.Добавить(ВыборкаДетальныеЗаписи.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаКлиенте
Процедура ПередУдалениемОбщая() 
	
	ИмяТаблицыТочек 	= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 		= Элементы[ИмяТаблицыТочек].ТекущиеДанные;  	
	
	ТаблицыФормы	= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалы, ЭтотОбъект, ТаблицыФормы, "", ТаблицыФормыВторогоУровня,"IDСтроки");
	
	ТаблицыФормы	= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыУслуг");
	ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	
	Если ПриборыУзловУчета.Количество() = 1 Тогда
		УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, ЭтотОбъект, ТаблицыФормы,,,"IDСтроки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуСТарфинойЗоной(IDСтрокиТарифнаяЗона,ТекущиеПоказания)
	
	//Показания
	СтрокаПоказаний 					= ПоказанияПриборовУчета.Добавить();
	СтрокаПоказаний.IDСтроки           	= IDСтрокиТарифнаяЗона;
	СтрокаПоказаний.IDСтрокиТочкиУчета 	= IDСтроки;
	СтрокаПоказаний.ТарифнаяЗона 		= ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки");
	СтрокаПоказаний.ТекущиеПоказания 	= ТекущиеПоказания;
	
КонецПроцедуры

#КонецОбласти


//================================================

&НаКлиенте
Процедура ТочкиУчетаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;		
	СписокУслуг 			= ПолучитьСписокУслугДляВыбора(Услуга);
	
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюТекущихПоказаний(Элемент)
	
	ТекущиеДанные			= Элементы["ТочкиУчета"	+ ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидимостьЭлемента = не ТекущиеДанные.РегистрируетОбъем;
	
	Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказания.Видимость 	= ВидимостьЭлемента;	
	Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказания.Видимость 	= ВидимостьЭлемента;	
	Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказания.Видимость 		= ВидимостьЭлемента;	
	Элементы.ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказания.Видимость 					= ВидимостьЭлемента;	

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидПараметраПриИзменении(Элемент)
	
	ТекущиеДанные 		= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	СтрокаШкалы 		= ШкалыПриборовУчета.НайтиСтроки(новый Структура("IDСтроки",ТекущиеДанные.IDСтрокиШкалы));
	ЗначениеРеквизита 	= ТекущиеДанные.ВидПараметра;
	
	Для Каждого ТекСтрокаШкалы Из СтрокаШкалы Цикл 
		ТекСтрокаШкалы.ВидПараметра = ЗначениеРеквизита;	
	КонецЦикла;
	
КонецПроцедуры

#Область Общие_ФормулыРасчета

&НаКлиенте
Процедура ФормулыРасчетаУслугПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.IDСтроки = IDСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаУслугПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПриборыУчета 				= Новый Массив;
		
	Для Каждого Строка Из ПриборыУзловУчета Цикл		
		
		Шкалы					= Новый Массив;
		
		Для Каждого СтрокаШкалы Из ШкалыПриборовУчета Цикл
			Если НЕ Строка.IDСтрокиШкалы  = СтрокаШкалы.IDСтроки Тогда
				Продолжить;
			КонецЕсли;
			Шкалы.Добавить(Новый Структура("Шкала,ВидПараметра",СтрокаШкалы.Шкала,СтрокаШкалы.ВидПараметра));
		КонецЦикла;
		ОписаниеПрибораУчета  	= Новый Структура;
		ОписаниеПрибораУчета.Вставить("ПриборУчета", 		Строка.ПриборУчета);
		ОписаниеПрибораУчета.Вставить("ВидПараметра", 		Строка.ВидПараметра);
		ОписаниеПрибораУчета.Вставить("ЗаводскойНомер",		Строка.ЗаводскойНомер);
		ОписаниеПрибораУчета.Вставить("Шкалы", 				Шкалы);
		ПриборыУчета.Добавить(ОписаниеПрибораУчета);		
	КонецЦикла;   	
	Оповещение 					= Новый ОписаниеОповещения("НастройкаФормулыРасчетаЗавершение",ЭтаФорма,Новый Структура("КлючСтроки", Элементы.ФормулыРасчетаУслуг.ТекущаяСтрока));
	ТекущиеДанные 				= Элементы.ФормулыРасчетаУслуг.ТекущиеДанные; 
	мСписокУслуг 				= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(Услуга);
	ПараметрыФормы  			= Новый Структура;
	ПараметрыФормы.Вставить("ПредставлениеФормулы", 	ТекущиеДанные.ФормулаРасчетаПредставление);
	ПараметрыФормы.Вставить("Услуга", 					?(ТекущиеДанные = Неопределено,ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка"),ТекущиеДанные.Услуга));
	ПараметрыФормы.Вставить("УзелУчета", 				Истина);
	ПараметрыФормы.Вставить("СоставУслуги", 			мСписокУслуг);
	ПараметрыФормы.Вставить("ПриборыУчета", 			ПриборыУчета);
	ОткрытьФорму("ОбщаяФорма.энргНастройкаФормулРасчета", ПараметрыФормы,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаУслугПредставлениеНеСезонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПриборыУчета 				= Новый Массив;
		
	Для Каждого Строка Из ПриборыУзловУчета Цикл		
		
		Шкалы					= Новый Массив;
		
		Для Каждого СтрокаШкалы Из ШкалыПриборовУчета Цикл
			Если НЕ Строка.IDСтрокиШкалы  = СтрокаШкалы.IDСтроки Тогда
				Продолжить;
			КонецЕсли;
			Шкалы.Добавить(Новый Структура("Шкала,ВидПараметра",СтрокаШкалы.Шкала,СтрокаШкалы.ВидПараметра));
		КонецЦикла;
		ОписаниеПрибораУчета  	= Новый Структура;
		ОписаниеПрибораУчета.Вставить("ПриборУчета", 		Строка.ПриборУчета);
		ОписаниеПрибораУчета.Вставить("ВидПараметра", 		Строка.ВидПараметра);
		ОписаниеПрибораУчета.Вставить("ЗаводскойНомер",		Строка.ЗаводскойНомер);
		ОписаниеПрибораУчета.Вставить("Шкалы", 				Шкалы);
		ПриборыУчета.Добавить(ОписаниеПрибораУчета);		
	КонецЦикла;   	
	Оповещение 					= Новый ОписаниеОповещения("НастройкаФормулыРасчетаЗавершение",ЭтаФорма,Новый Структура("НеСезон,КлючСтроки",Истина,Элементы.ФормулыРасчетаУслуг.ТекущаяСтрока));
	ТекущиеДанные 				= Элементы.ФормулыРасчетаУслуг.ТекущиеДанные; 
	мСписокУслуг 				= энргРаботаСПоставщикамиСервер.ПолучитьСоставУслуги(Услуга);
	ПараметрыФормы  			= Новый Структура;
	ПараметрыФормы.Вставить("ПредставлениеФормулы", 	ТекущиеДанные.ФормулаРасчетаНеСезонПредставление);
	ПараметрыФормы.Вставить("Услуга", 					?(ТекущиеДанные = Неопределено,ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка"),ТекущиеДанные.Услуга));
	ПараметрыФормы.Вставить("УзелУчета", 				Истина);
	ПараметрыФормы.Вставить("СоставУслуги", 			мСписокУслуг);
	ПараметрыФормы.Вставить("ПриборыУчета", 			ПриборыУчета);
	ОткрытьФорму("ОбщаяФорма.энргНастройкаФормулРасчета", ПараметрыФормы,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормулыРасчетаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатЗакрытия.Свойство("ПредставлениеФормулы") ИЛИ Не РезультатЗакрытия.Свойство("ФормулаРасчета") Тогда
		Возврат;
	КонецЕсли;
	
	КлючСтроки  											= ДополнительныеПараметры.КлючСтроки;
	НеСезон 												= Ложь;
	Если ДополнительныеПараметры.Свойство("НеСезон") И ДополнительныеПараметры.НеСезон Тогда
		НеСезон 											= Истина;
	КонецЕсли;
	
	ТекущиеДанные  											= ФормулыРасчетаУслуг.НайтиПоИдентификатору(КлючСтроки);
	Если НеСезон Тогда
		ТекущиеДанные.ФормулаРасчетаНеСезонПредставление 	= РезультатЗакрытия.ПредставлениеФормулы;
		ТекущиеДанные.ФормулаРасчетаНеСезон 				= РезультатЗакрытия.ФормулаРасчета;
	Иначе
		ТекущиеДанные.ФормулаРасчетаПредставление 			= РезультатЗакрытия.ПредставлениеФормулы;
		ТекущиеДанные.ФормулаРасчета 						= РезультатЗакрытия.ФормулаРасчета;
	КонецЕсли; 	  
	
КонецПроцедуры

#КонецОбласти

#Область ЕстьШкалыЕстьТарифныеЗоны

#Область ТочкиУчета 

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ТекущиеДанные			= Элементы["ТочкиУчета"				+ ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыШкал		= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета];
	ТаблицаФормыПоказания	= Элементы["ПоказанияПриборовУчета"	+ ПрефиксТочекУчета];	
	ТаблицаФормыШкалУслуг	= Элементы["ШкалыУслуг"				+ ПрефиксТочекУчета]; 
	
	
	// энргРаботаСВидомДифференцированности { 	 
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтроки",	ТекущиеДанные.IDСтрокиШкалы); 
	
	ТекДанныеЗон 		 = Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	IDСтрокиТарифнаяЗона = Неопределено;
	Если не ТекДанныеЗон = Неопределено Тогда
		IDСтрокиТарифнаяЗона = ТекДанныеЗон.IDСтрокиТарифнаяЗона;
	КонецЕсли;
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,IDСтрокиТарифнаяЗона);
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг,	"IDСтроки",	ТекущиеДанные.IDСтроки);
	
	УправлениеДоступностьюТекущихПоказаний(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ПередУдалениемОбщая();	
	ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.РаспределятьНаАбонентов 	= Истина;
		ТекущиеДанные.IDСтроки					= IDСтроки;
		//Если не ЗначениеЗаполнено(ТекущиеДанные.IDСтрокиШкалы) Тогда
		ТекущиеДанные.IDСтрокиШкалы				= новый УникальныйИдентификатор;
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//ПРИ ИЗМЕНЕНИИ----------------------------------

//&НаКлиенте
//Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныВидКанальностиПриИзменении(Элемент)
//	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
//	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
//	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
//	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
//	
//	// энргРаботаСВидомДифференцированности {
//	ПриИзмененииВидаКанальности(ЭтотОбъект,ТекущиеДанные.IDСтроки,ТекущиеДанные.IDСтрокиШкалы,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета",Истина); 
//	// энргРаботаСВидомДифференцированности }
//	
//	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(Услуга, ВидКанальности);
//	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтотОбъект, ТекущиеДанные, СоставУслуги, "ШкалыУслуг", Истина);
//	
//	ТаблицаФормыШкал		= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета];
//	ТаблицаФормыШкалУслуг	= Элементы["ШкалыУслуг"				+ ПрефиксТочекУчета];
//	
//	// энргРаботаСВидомДифференцированности {
//	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,		"IDСтроки",	ТекущиеДанные.IDСтрокиШкалы); 
//	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг,	"IDСтроки",	ТекущиеДанные.IDСтроки);
//КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ШкалыПриборов

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	Состав 									= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	// энргРаботаСВидомДифференцированности {
	ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиТарифнаяЗона,ТекущиеДанные.IDСтрокиТочкиУчета,Состав,"ПоказанияПриборовУчета",Неопределено,Истина); 
	// энргРаботаСВидомДифференцированности }
	
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиТарифнаяЗона); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиТарифнаяЗона); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область НетШкалЕстьТарифныеЗоны

#Область ТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки = IDСтроки;
	КонецЕсли;
	
	//Если не ЗначениеЗаполнено(ТекущиеДанные.IDСтрокиШкалы) Тогда
	//	ТекущиеДанные.IDСтрокиШкалы				= новый УникальныйИдентификатор;
	//КонецЕсли;
	
	ТаблицаФормыПоказания	= Элементы["ПоказанияПриборовУчета"	+ ПрефиксТочекУчета];
		
	МассивШкал 				= ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки",ТекущиеДанные.IDСтрокиШкалы));
	IDСтрокиТарифнаяЗона    = Неопределено;
	Если МассивШкал.Количество() > 0 Тогда
		СтрокаШкал 	= МассивШкал[0];
		//// энргРаботаСВидомДифференцированности {
		IDСтрокиТарифнаяЗона = СтрокаШкал.IDСтрокиТарифнаяЗона;	
		//// энргРаботаСВидомДифференцированности }
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания, Неопределено, IDСтрокиТарифнаяЗона);	 	
	// энргРаботаСВидомДифференцированности } 
	
	УправлениеДоступностьюТекущихПоказаний(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.РаспределятьНаАбонентов 	= Истина;
		ТекущиеДанные.IDСтроки					= IDСтроки;		
		ТекущиеДанные.IDСтрокиШкалы				= новый УникальныйИдентификатор;
		
		//Шкалы
		СтрокаШкал 							= ШкалыПриборовУчета.Добавить();
		СтрокаШкал.IDСтроки           		= ТекущиеДанные.IDСтрокиШкалы;
		СтрокаШкал.IDСтрокиТочкиУчета 		= IDСтроки;    			
		СтрокаШкал.IDСтрокиТарифнаяЗона 	= новый УникальныйИдентификатор; 
		СтрокаШкал.ВидПараметра 			= ТекущиеДанные.ВидПараметра;
		СтрокаШкал.Шкала 					= ПредопределенноеЗначение("Справочник.энргШкалыПриборовУчета.Основная");
		СтрокаШкал.ВидДифференцированности 	= ТекущиеДанные.ВидДифференцированности;
				
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	////// энргРаботаСПоставщиками } 	
	
	////ТаблицыФормы	= Новый Массив;	
	////ТаблицыФормы.Добавить("ПоказанияПриборовУчета"); 
	////УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалы, ЭтотОбъект, ТаблицыФормы,,,"IDСтроки");
	//
	//// энргРаботаСПоставщиками {
	//ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	//ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	//// энргРаботаСПоставщиками }       	
	//
	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	//
	//ТаблицыФормыВторогоУровня	= Новый Массив;
	//ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	//УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалы, ЭтотОбъект, ТаблицыФормы, "", ТаблицыФормыВторогоУровня,"IDСтроки");
	
	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыУслуг");
	//ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	//
	//Если ПриборыУзловУчета.Количество() = 1 Тогда
	//	ТаблицыФормы	= Новый Массив;		
	//	ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	//	УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, ЭтотОбъект, ТаблицыФормы,,,"IDСтроки");
	//КонецЕсли; 
	
	ПередУдалениемОбщая();	
	ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент);	
	
КонецПроцедуры

//ПРИ ИЗМЕНЕНИИ----------------------------------

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	
	МассивШкал = ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки",ТекущиеДанные.IDСтрокиШкалы));
	Если МассивШкал.Количество() > 0 Тогда
		СтрокаШкал 							= МассивШкал[0];
		СтрокаШкал.ВидДифференцированности 	= ВидДифференцированности;
		// энргРаботаСВидомДифференцированности {
		ПриИзмененииВидаДифференцированности(ЭтаФорма,СтрокаШкал.IDСтрокиТарифнаяЗона,СтрокаШкал.IDСтрокиТочкиУчета,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности,Услуга),"ПоказанияПриборовУчета",Неопределено,Истина); 
		// энргРаботаСВидомДифференцированности }
	КонецЕсли;	
	
	ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	отказ = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЕстьШкалыНетТарифныхЗон

#Область ТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ТекущиеДанные			= Элементы["ТочкиУчета"				+ ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыПоказания	= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета];	
	ТаблицаФормыШкалУслуг	= Элементы["ШкалыУслуг"				+ ПрефиксТочекУчета]; 	
	
	// энргРаботаСВидомДифференцированности { 	 
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказания, "IDСтроки", ТекущиеДанные.IDСтрокиШкалы);		
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг, "IDСтроки", ТекущиеДанные.IDСтроки);
	
	УправлениеДоступностьюТекущихПоказаний(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	ПередУдалениемОбщая();
	ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.РаспределятьНаАбонентов 	= Истина;
		ТекущиеДанные.IDСтроки					= IDСтроки;
		//Если не ЗначениеЗаполнено(ТекущиеДанные.IDСтрокиШкалы) Тогда
		ТекущиеДанные.IDСтрокиШкалы				= новый УникальныйИдентификатор;
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//ПРИ ИЗМЕНЕНИИ----------------------------------

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонВидКанальностиПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	// энргРаботаСВидомКанальности {
	ПриИзмененииВидаКанальности(ЭтотОбъект,ТекущиеДанные.IDСтроки,ТекущиеДанные.IDСтрокиШкалы,СоставКанальности,"ШкалыПриборовУчета","ПоказанияПриборовУчета",Истина); 
	// энргРаботаСВидомКанальности }
	
	СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(Услуга, ВидКанальности);
	бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтотОбъект, ТекущиеДанные, СоставУслуги, "ШкалыУслуг", Истина);
	
	Если ЗначениеЗаполнено(ВидКанальности) Тогда
		
		СтрокиШкал = ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки",ТекущиеДанные.IDСтрокиШкалы));
		Для Каждого ТекСтрокаШкал из СтрокиШкал Цикл
			
			СтрокаТарЗон = ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки",ТекСтрокаШкал.IDСтрокиТарифнаяЗона));			
			Если СтрокаТарЗон.Количество() = 0 Тогда
				ДобавитьСтрокуСТарфинойЗоной(ТекСтрокаШкал.IDСтрокиТарифнаяЗона,0);				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ШкалыПриборов

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанные 			= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	ТекущиеПоказания		= ТекущиеДанные.ТекущиеПоказания;
	МассивСтрокПоказаний 	= ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки",ТекущиеДанные.IDСтрокиТарифнаяЗона));
	
	Если МассивСтрокПоказаний.количество() > 0 Тогда
		МассивСтрокПоказаний[0].ТекущиеПоказания = ТекущиеПоказания; 
	Иначе 
		ДобавитьСтрокуСТарфинойЗоной(ТекущиеДанные.IDСтрокиТарифнаяЗона,ТекущиеПоказания);		 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПоказанияПриборовУчета


#КонецОбласти

#КонецОбласти

#Область НетШкалНетТарифныхЗон

#Область ТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;   	
	
	ТекущиеДанные.РаспределятьНаАбонентов 	= Истина;
	ТекущиеДанные.IDСтроки					= IDСтроки;	
	
	УправлениеДоступностьюТекущихПоказаний(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.РаспределятьНаАбонентов 	= Истина;
		ТекущиеДанные.IDСтроки					= IDСтроки;		
		ТекущиеДанные.IDСтрокиШкалы				= новый УникальныйИдентификатор;
		
		//Шкалы
		СтрокаШкал = ШкалыПриборовУчета.Добавить();
		СтрокаШкал.IDСтроки           	= ТекущиеДанные.IDСтрокиШкалы;
		СтрокаШкал.IDСтрокиТочкиУчета 	= IDСтроки;
		СтрокаШкал.ВидПараметра 		= ТекущиеДанные.ВидПараметра;
		СтрокаШкал.Шкала				= ПредопределенноеЗначение("Справочник.энргШкалыПриборовУчета.Основная");		
		СтрокаШкал.IDСтрокиТарифнаяЗона = новый УникальныйИдентификатор;
		
		//Показания
		ДобавитьСтрокуСТарфинойЗоной(СтрокаШкал.IDСтрокиТарифнаяЗона,ТекущиеДанные.ТекущиеПоказания);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПередУдалением(Элемент, Отказ)
	
	//ИмяТаблицыТочек = "ТочкиУчета" + ПрефиксТочекУчета;
	//ТекущиеДанные 	= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	//
	//
	//ТаблицыФормы	= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	//
	//ТаблицыФормыВторогоУровня	= Новый Массив;
	//ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	//УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтрокиШкалы, ЭтотОбъект, ТаблицыФормы, "", ТаблицыФормыВторогоУровня,"IDСтроки");
	ПередУдалениемОбщая();	
	
КонецПроцедуры

//ПРИ ИЗМЕНЕНИИ----------------------------------

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонЗаводскойНомерПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТипПрибораУчетаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонДатаПоверкиСчетчикаПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;	
	ЗаполнитьКоэфициент(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанные 	= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	ЗаполнитьПоказания(ТекущиеДанные.IDСтрокиШкалы,ТекущиеДанные.ТекущиеПоказания);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказания(IDСтрокиШкалы, ТекущиеПоказания)
	
	МассивСтрокШкал = ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки",IDСтрокиШкалы));
	Если МассивСтрокШкал.количество() > 0 Тогда
		МассивСтрокПоказаний = ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки",МассивСтрокШкал[0].IDСтрокиТарифнаяЗона));
		Если МассивСтрокПоказаний.количество() > 0 Тогда
			МассивСтрокПоказаний[0].ТекущиеПоказания = ТекущиеПоказания;  
		КонецЕсли;	 
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ШкалыПриборов


#КонецОбласти

#Область ПоказанияПриборовУчета


#КонецОбласти

#КонецОбласти



#Область РАБОТА_С_АКТИВНОСТЬЮ









#КонецОбласти


