&НаКлиенте
Перем ОтветПередЗакрытием;

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	слжСлужебныеОперацииПриСозданииНаСервере();
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Для Каждого КлючЗначение Из Параметры.ЗначенияЗаполнения Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, КлючЗначение.Ключ) Тогда
				ЭтоКоллекция 					= ТипЗнч(КлючЗначение.Значение) = Тип("Массив");
				Если ЗначениеЗаполнено(КлючЗначение.Значение) И НЕ Объект[КлючЗначение.Ключ] = КлючЗначение.Значение И Не ЭтоКоллекция Тогда
					Объект[КлючЗначение.Ключ] 	= КлючЗначение.Значение
				КонецЕсли;							
			КонецЕсли;						
		КонецЦикла;		 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;	
	ЗаполнитьДатуДокументаНаСервере();
	
	ЗаполнитьДокумент  							= Параметры.Свойство("Основание") И ЗначениеЗаполнено(Параметры.Основание);
	
	Если НЕ ЗаполнитьДокумент И Параметры.Свойство("ЗаполнитьДокумент") И Параметры.ЗаполнитьДокумент Тогда
		ЗаполнитьДокумент 						= Истина;		
	КонецЕсли;  	
	
	Если Параметры.Ключ.Пустая() и Параметры.ЗначенияЗаполнения.Свойство("Помещения") тогда
		ЗаполнитьПомещенияИзДокументаОснования(Параметры);
		энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
		
		//Помещения 								= Параметры.ЗначенияЗаполнения.Помещения;
		//мКлючиБезАбонентов 						= Новый Массив;
		//Для Сч = 0 По Помещения.ВГраница() Цикл
		//	ДанныеПомещения 					= Помещения[Сч];
		//	СтрокиПомещения						= Объект.Помещения.НайтиСтроки(Новый Структура("КлючПомещения", ДанныеПомещения.КлючПомещения));
		//	Если СтрокиПомещения.Количество() = 0 Тогда
		//		СтрокаПомещения  				= Объект.Помещения.Добавить();
		//		СтрокаПомещения.КлючПомещения  	= ДанныеПомещения.КлючПомещения;
		//		КлючПомещений.Добавить(ДанныеПомещения.КлючПомещения);
		//	КонецЕсли;
		//КонецЦикла;
		//
		//Если мКлючиБезАбонентов.Количество() > 0 Тогда
		//	 Схема  = Новый СхемаЗапроса;
		//КонецЕсли;
		//
		//энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
	ИначеЕсли НЕ Параметры.Ключ.Пустая() и Параметры.ЗначенияЗаполнения.Свойство("Помещения") Тогда
		
		ЗаполнитьПомещенияИзДокументаОснования(Параметры);
		ТЗ = Объект.Помещения.Выгрузить();
		ТЗ.Свернуть("КлючПомещения,Абонент,АбонентСмена");
		Объект.Помещения.Загрузить(ТЗ);
		
		энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
		
	ИначеЕсли Параметры.Ключ.Пустая() И Объект.Помещения.Количество() > 0 Тогда
		
		энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
		
	иначеЕсли не Параметры.Ключ.Пустая() Тогда
		
		УстановитьПредсталениеПериода();
		
	КонецЕсли;
	
	Если ЗаполнитьДокумент тогда 
		Если Параметры.ЗначенияЗаполнения.Свойство("ДокументОснование") и Не Параметры.ЗначенияЗаполнения["ДокументОснование"] = Неопределено Тогда
			ДокументОснование  		= Параметры.ЗначенияЗаполнения.ДокументОснование;
		ИначеЕсли Параметры.Свойство("Основание") и Не Параметры["Основание"] = Неопределено Тогда
			ДокументОснование 		= Параметры.Основание;
		КонецЕсли;  		
		
		Если НЕ ДокументОснование = Неопределено Тогда			
			Строки  				= Объект.ДокументыОснования.НайтиСтроки(Новый Структура("Документ",ДокументОснование));
			Если Строки.количество()  = 0 тогда
				Строка  			= Объект.ДокументыОснования.Добавить();
				Строка.Документ 	= ДокументОснование;
			КонецЕсли;
		КонецЕсли;
		
		ПерерасчетСНачалаГода 		= Ложь;
		Если Параметры.ДополнительныеПараметры.Свойство("ПерерасчетСНачалаГода")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ПерерасчетСНачалаГода) Тогда
			ПерерасчетСНачалаГода 	= Параметры.ДополнительныеПараметры.ПерерасчетСНачалаГода;
		КонецЕсли;
		
		Если Параметры.ЗначенияЗаполнения.Свойство("ДокументОснованиеИсключить") Тогда
			ДокументОснование  		= Параметры.ЗначенияЗаполнения.ДокументОснованиеИсключить;
			Строки  				= Объект.ДокументыОснования.НайтиСтроки(Новый Структура("Документ",ДокументОснование));			
			Для Индекс = 0 По Строки.ВГраница() Цикл
				Объект.ДокументыОснования.Удалить(Строки[Индекс]);
			КонецЦикла;			
		КонецЕсли;
		
		ЗаполнитьВспомогательныеДанные(ПерерасчетСНачалаГода);
	КонецЕсли;	  
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"КорректировкаПоказаний");
	
	НаборОбъемНачислений  = РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	НаборОбъемНачислений.Отбор.Регистратор.Установить(ТекущийОбъект.Ссылка);
	НаборОбъемНачислений.Прочитать();
	ЗначениеВРеквизитФормы(НаборОбъемНачислений,"Расшифровка");
	
	НаборНачисленыйСредний  = РегистрыНакопления.энргНачисленныйСреднийОбъем.СоздатьНаборЗаписей();
	НаборНачисленыйСредний.Отбор.Регистратор.Установить(ТекущийОбъект.Ссылка);
	НаборНачисленыйСредний.Прочитать();
	ЗначениеВРеквизитФормы(НаборНачисленыйСредний,"РасшифровкаНачисленныйСредний");
	
	РезультатПерерасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПраваДокументаПерерасчет(Отказ);
	ЗаполнитьКлючПомещений();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Набор 					= ТекущийОбъект.Движения.энргОбъемНачислений;
	Набор.Очистить();
	Набор.Загрузить(Расшифровка.Выгрузить());
	
	НаборНачисленныйСредний = РеквизитФормыВЗначение("РасшифровкаНачисленныйСредний", Тип("РегистрНакопленияНаборЗаписей.энргНачисленныйСреднийОбъем")); 	
	Набор.ДополнительныеСвойства.Вставить("НаборНачисленныйСредний", НаборНачисленныйСредний);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"КорректировкаПоказаний");
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();
		ЗаполнитьДатуДокументаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьТолькоПоказанияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Объект.ИзменятьТолькоПоказания Тогда
			ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросПередОчисткойРегистра",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения,"Очистить результат перерасчета?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, "Перед установкой признака ""Изменить только показания"" документ должен быть записан.");
		Объект.ИзменятьТолькоПоказания = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказания

&НаКлиенте
Процедура КорректировкаПоказанийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказания

&НаКлиенте
Процедура ДокументыОснованияПриИзменении(Элемент)
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Заполните табличную часть ""Документ-основание""",10);
		Возврат;				
	КонецЕсли;
	Объект.КорректировкаПоказаний.Очистить();
	ЗаполнитьДанныеПоОснованиямСервер();
	ЗаполнитьПоказания();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументПриИзменении(Элемент)
	ТекСтрока = Элементы.ДокументыОснования.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.Документ) И Не ДатаФактаЗаполнена(ТекСтрока.Документ) Тогда
		ТекСтрока.Документ	= Неопределено;
		ОбщегоНазначенияКлиент.СообщитьПользователю("В документе не указана дата фактического события. Документ не может быть выбран.");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаФактаЗаполнена(Документ)
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документ, "ДатаФактическогоСобытия") Тогда
		ДатаФакта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДатаФактическогоСобытия");
		Если Не ЗначениеЗаполнено(ДатаФакта) И Не ТипЗнч(Документ) = Тип("ДокументСсылка.энргОперацияСПриборомУчета") И Не ТипЗнч(Документ) = Тип("ДокументСсылка.энргОперацияСЛицевымСчетом") Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Заполните табличную часть ""Документ-основание""",10);
		Возврат;				
	КонецЕсли; 
	
	Если Объект.КорректировкаПоказаний.Количество() = 0 Тогда
		ЗаполнитьПоказания();
	КонецЕсли;
	
	ОбновитьРасшифровкуНаСервере();	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьРасшифровку(Команда)
	ОбновитьРасшифровкуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьРасшифровкуНаСервере()
	
	
	Если НЕ ЗначениеЗаполнено(Объект.НачПериода) ИЛИ НЕ ЗначениеЗаполнено(Объект.КонПериода)
		ИЛИ Объект.НачПериода > Объект.КонПериода Тогда
		Возврат;
	КонецЕсли;
	
	Набор 								= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	НаборПомещение						= РегистрыНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС.СоздатьНаборЗаписей();
	
	Помещения  							= Объект.Помещения.Выгрузить();
	
	КорректировкаПоказаний 				= Объект.КорректировкаПоказаний.Выгрузить();
	КорректировкаПоказаний.Колонки.Удалить("ПриборУчетаДо");
	Колонка  							= КорректировкаПоказаний.Колонки.Найти("ПриборУчетаПосле");
	Колонка.Имя 						= "ПриборУчета";
	
	КорректировкаПоказаний.Колонки.Удалить("ШкалаДо");
	Колонка  							= КорректировкаПоказаний.Колонки.Найти("ШкалаПосле");
	Колонка.Имя 						= "Шкала";
	
	КорректировкаПоказаний.Колонки.Удалить("ТарифнаяЗонаДо");
	Колонка  							= КорректировкаПоказаний.Колонки.Найти("ТарифнаяЗонаПосле");
	Колонка.Имя 						= "ТарифнаяЗона";
	
	Колонка  							= КорректировкаПоказаний.Колонки.Найти("РегистраторПоказаний");
	Колонка.Имя 						= "Регистратор";
	
	Колонка  							= КорректировкаПоказаний.Колонки.Найти("ДатаПоказаний");
	Колонка.Имя 						= "Период";
	
	Колонка  							= КорректировкаПоказаний.Колонки.Найти("ПоказанияПосле");
	Колонка.Имя 						= "Показания";
	
	ЧастныйСектор 						= НЕ ЗначениеЗаполнено(Объект.Строение);
	
	ТекАбонент = Неопределено; 
	Если ЗначениеЗаполнено(Объект.ДокументыОснования) И 
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект.ДокументыОснования[0].Документ, "ВидОперации") И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументыОснования[0].Документ, "ВидОперации") = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника Тогда 
		Если Помещения.Количество() = 1 Тогда
			Строение 						= Помещения[0].Строение;
			текАбонент = Помещения[0].Абонент;
		КонецЕсли;
	КонецЕсли;
	
	ПодключениеУслугиПервыйДокумент	= ПодключениеУслугиПервыйДокумент();
	ДополнительныеРеквизиты	= Новый Структура("ПодключениеУслугиПервыйДокумент", ПодключениеУслугиПервыйДокумент);
	
	Если Помещения.Количество() = 1 Тогда
		Строение 						= Помещения[0].Строение;
		Помещение 						= Помещения[0].Помещение;
		ЧастныйСектор                   = ПолучитьЗначениеПараметраЧастныйСектор(Помещения[0].КлючПомещения);
		энргНачисления.ДанныеПерерасчета(Объект.Организация,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.НачПериода,Объект.КонПериода,Набор,НаборПомещение,КорректировкаПоказаний,ДополнительныеРеквизиты);
	Иначе
		//энргНачисления.ДанныеПерерасчета(Объект.Организация,Объект.Район,ЧастныйСектор,Помещения.ВыгрузитьКолонку("Строение"),Помещения.ВыгрузитьКолонку("Помещение"),Объект.НачПериода,Объект.КонПериода,Набор,НаборПомещение,КорректировкаПоказаний);
		Строение 						= Помещения[0].Строение;
		энргНачисления.ДанныеПерерасчета(Объект.Организация, Объект.Район, ЧастныйСектор, Строение,Помещения.ВыгрузитьКолонку("Помещение"), Объект.НачПериода, Объект.КонПериода, Набор, НаборПомещение, КорректировкаПоказаний, ДополнительныеРеквизиты);
	КонецЕсли;	
	
	Расшифровка.Очистить();
	
	// Удалить записи не наших ЛС. Они могут появиться, если в данном помещении есть другие ЛС по другим услугам. Поиск ведем по ТУ, т.к. за нашу ТУ может платить другой плательщик
	СтрокиУдалить	= Новый Массив;
	
	НашиТУ			= Новый Массив;
	Для Сч = 0 По Набор.Количество() -1 Цикл		
		Если Помещения.Найти(Набор[Сч].Абонент, "Абонент") <> Неопределено Тогда
			НашиТУ.Добавить(Набор[Сч].ТочкаУчета);
		КонецЕсли;
	КонецЦикла;
	
	Для Сч = 0 По Набор.Количество() -1 Цикл		
		Если НашиТУ.Найти(Набор[Сч].ТочкаУчета) = Неопределено Тогда
			СтрокиУдалить.Добавить(Набор[Сч]);
		КонецЕсли;
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		Набор.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;	
	
	РегистрыНакопления.энргОбъемНачислений.УдалитьНеЗначащиеЗаписи(Набор);
	
	РасшифровкаНачисленныйСредний.Очистить();
	Если Набор.ДополнительныеСвойства.Свойство("ОтложенныеНачисленияПоПриборам") Тогда
		ОтложенныеНачисленияПоПриборам 	= Набор.ДополнительныеСвойства.ОтложенныеНачисленияПоПриборам;
		// надо в ОтложенныеНачисленияПоПриборам оставить только не списанные средние
		
		ОтложенныеНачисленияПоПриборамДляСписания	= РегистрыНакопления.энргОбъемНачислений.ОтложенныеНачисленияПоПриборамДляСписания(ОтложенныеНачисленияПоПриборам.Выгрузить());
		РезультатНачисленныйСредний 		= РегистрыНакопления.энргОбъемНачислений.РезультатНачисленныйСреднийОбъем(ОтложенныеНачисленияПоПриборамДляСписания.Выгрузить());
		Выборка 							= РезультатНачисленныйСредний.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись 				= РасшифровкаНачисленныйСредний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Период 			= НачалоДня(Объект.Дата) - 1;
		КонецЦикла;		
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из Набор Цикл
		
		Если СтрокаНабора.ПериодНачисления = Объект.ПериодНачисления Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекАбонент = Неопределено Или СтрокаНабора.Абонент = ТекАбонент Тогда
			ЗаполнитьЗначенияСвойств(Расшифровка.Добавить(), СтрокаНабора);		
		КонецЕсли;
	КонецЦикла; 	
	
	// читаем данные которые были начислены до перерасчета
	НачалоОтчетногоПериода 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация, Объект.Район, Объект.НачПериода).НачалоОП;
	КонецОтчетногоПериода 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация, Объект.Район, Объект.КонПериода).ЗавершениеОП - 1;	
	
	ВыгруженныеПомещения							= Объект.Помещения.Выгрузить();
	РезультатДанныеНачислений 						= Обработки.энргПерерасчетМенеджер.ДанныеНачисленийЗаПериод(Объект.Организация, Объект.Район, Объект.ПериодНачисления, НачалоОтчетногоПериода, КонецОтчетногоПериода, Расшифровка.Выгрузить(), ВыгруженныеПомещения, Объект.Ссылка);
	Выборка  										= РезультатДанныеНачислений.Выбрать();
	
	НашиТУ	= Расшифровка.Выгрузить(,"ТочкаУчета").ВыгрузитьКолонку("ТочкаУчета");
	Пока Выборка.Следующий() Цикл
		Если Выборка.Регистратор = Объект.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		
		// Удаляем строки с чужими абонентами и чужими ТУ. При смене может получиться, что ТУ наша, а абонент уже не наш
		Если Помещения.Найти(Выборка.Абонент, "Абонент") = Неопределено и НашиТУ.Найти(Выборка.ТочкаУчета) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекАбонент = Неопределено Или Выборка.Абонент = ТекАбонент Тогда
			НоваяЗапись 								= Расшифровка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		Иначе 
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись.ОбъемУслуги 					= -НоваяЗапись.ОбъемУслуги;
		НоваяЗапись.ОбъемУслугиПотери 				= -НоваяЗапись.ОбъемУслугиПотери;
		НоваяЗапись.ОбъемУслугиПотребленный 		= -НоваяЗапись.ОбъемУслугиПотребленный;
		НоваяЗапись.ОбъемУслугиПотребленныйПотери 	= -НоваяЗапись.ОбъемУслугиПотребленныйПотери;
		НоваяЗапись.ОбъемУслугиПотребленныйСоцНорма = -НоваяЗапись.ОбъемУслугиПотребленныйСоцНорма;
		НоваяЗапись.ОбъемУслугиСоцНорма 			= -НоваяЗапись.ОбъемУслугиСоцНорма;
		НоваяЗапись.Сумма 							= -НоваяЗапись.Сумма;
		НоваяЗапись.СуммаПоПовышенномуКоэффициенту 	= -НоваяЗапись.СуммаПоПовышенномуКоэффициенту;
		НоваяЗапись.Было 							= Истина;
		НоваяЗапись.ЭтоСторно						= Истина;
		НоваяЗапись.Период 							= НачалоДня(Объект.Дата) - 1;
		
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.энргПерерасчет") 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Регистратор, "ВидОперации") = Перечисления.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет Тогда
			НоваяЗапись 								= Расшифровка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Было 							= Ложь;
			НоваяЗапись.Период 							= НачалоДня(Объект.Дата) - 1;
		КонецЕсли;
	КонецЦикла;	
	
	// оперделяем была ли смена собственника
	АбонентСтарый			= Справочники.энргАбоненты.ПустаяСсылка();
	АбонентНовый			= Справочники.энргАбоненты.ПустаяСсылка();
	Для Каждого ТекПомещение Из ВыгруженныеПомещения Цикл
		Если ЗначениеЗаполнено(ТекПомещение.АбонентСмена) Тогда
			АбонентСтарый	= ТекПомещение.Абонент;
			АбонентНовый	= ТекПомещение.АбонентСмена;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	
	РезультатСреднийЗаПериод 						= Обработки.энргПерерасчетМенеджер.ДанныеНачисленныйСреднийЗаПериод(Объект.Организация, Объект.Район, Объект.ПериодНачисления, НачалоОтчетногоПериода, КонецОтчетногоПериода, ВыгруженныеПомещения, Объект.Ссылка);
	Выборка  										= РезультатСреднийЗаПериод.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Помещения.Найти(Выборка.Абонент, "Абонент") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(АбонентНовый) И Выборка.ПериодНачисления < НачалоОтчетногоПериода Тогда
			// Если не было смены собственника, то нас интересют только периоды после начала отчетного периода 
			Продолжить;
		КонецЕсли;;
		
		НоваяЗапись 								= РасшифровкаНачисленныйСредний.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.ОбъемУслуги 					= -НоваяЗапись.ОбъемУслуги;
		НоваяЗапись.ОбъемУслугиПотери 				= -НоваяЗапись.ОбъемУслугиПотери;
		НоваяЗапись.ОбъемУслугиПотребленный 		= -НоваяЗапись.ОбъемУслугиПотребленный;
		НоваяЗапись.ОбъемУслугиПотребленныйПотери 	= -НоваяЗапись.ОбъемУслугиПотребленныйПотери;
		НоваяЗапись.Сумма 							= -НоваяЗапись.Сумма;
		НоваяЗапись.Было 							= Истина;
		НоваяЗапись.ЭтоСторно						= Истина;
		НоваяЗапись.Период 							= НачалоДня(Объект.Дата) - 1;
		
		// Если была смена собственника, то данные от связных перерасчетов прошлых периодов старого абонента надо дописать как начисление на нового
		Если ЗначениеЗаполнено(АбонентНовый) И ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.энргПерерасчет")  Тогда
			
			Если Выборка.ПериодНачисления < НачалоОтчетногоПериода Тогда
				// Нас интересют только периоды после начала отчетного периода 
				// До даты начала отчетного периода начисленный средний надо списать (см. Чек 1426)
				НоваяЗапись 								= Расшифровка.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				НоваяЗапись.ОбъемУслуги 					= -НоваяЗапись.ОбъемУслуги;
				НоваяЗапись.ОбъемУслугиПотери 				= -НоваяЗапись.ОбъемУслугиПотери;
				НоваяЗапись.ОбъемУслугиПотребленный 		= -НоваяЗапись.ОбъемУслугиПотребленный;
				НоваяЗапись.ОбъемУслугиПотребленныйПотери 	= -НоваяЗапись.ОбъемУслугиПотребленныйПотери;
				НоваяЗапись.Сумма 							= -НоваяЗапись.Сумма;
				
				НоваяЗапись.Было 							= Ложь;
				НоваяЗапись.ЭтоСторно						= Ложь;
				НоваяЗапись.Период 							= Объект.Дата;
				
				Продолжить;
			КонецЕсли;
			
			МассивСтрок	= Расшифровка.НайтиСтроки(Новый Структура("ПериодНачисления,Было,Абонент,ТочкаУчета", Выборка.ПериодНачисления, Ложь, АбонентНовый, Выборка.ТочкаУчетаСУчетомРодителя));
			ЕстьНачислениеПоПУ	= Ложь;
			Для Каждого ТекСтрокаНачисления Из МассивСтрок Цикл
				Если ТекСтрокаНачисления.СпособНачисления = Перечисления.энргСпособНачислений.ПоПриборам Тогда
					ЕстьНачислениеПоПУ	= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// данные от связного добавляем только если у нового абонента начисление не по ПУ
			Если Не ЕстьНачислениеПоПУ Тогда
				НоваяЗапись 								= Расшифровка.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				НоваяЗапись.Абонент							= АбонентНовый;
				НоваяЗапись.ОбъемУслуги 					= -НоваяЗапись.ОбъемУслуги;
				НоваяЗапись.ОбъемУслугиПотери 				= -НоваяЗапись.ОбъемУслугиПотери;
				НоваяЗапись.ОбъемУслугиПотребленный 		= -НоваяЗапись.ОбъемУслугиПотребленный;
				НоваяЗапись.ОбъемУслугиПотребленныйПотери 	= -НоваяЗапись.ОбъемУслугиПотребленныйПотери;
				НоваяЗапись.Сумма 							= -НоваяЗапись.Сумма;
				
				НоваяЗапись.Было 							= Ложь;
				НоваяЗапись.ЭтоСторно						= Ложь;
				НоваяЗапись.Период 							= Объект.Дата;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// переносим данные распределения при смене собственника
	Если ЗначениеЗаполнено(АбонентНовый) Тогда
		РезультатДанныеНачислений 						= Обработки.энргПерерасчетМенеджер.ДанныеРаспределенияЗаПериод(Объект.Организация, Объект.Район, Объект.ПериодНачисления, НачалоОтчетногоПериода, КонецОтчетногоПериода, ВыгруженныеПомещения, АбонентСтарый);
		Выборка  										= РезультатДанныеНачислений.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяЗапись 								= Расшифровка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.ОбъемУслуги 					= -НоваяЗапись.ОбъемУслуги;
			НоваяЗапись.ОбъемУслугиПотери 				= -НоваяЗапись.ОбъемУслугиПотери;
			НоваяЗапись.ОбъемУслугиПотребленный 		= -НоваяЗапись.ОбъемУслугиПотребленный;
			НоваяЗапись.ОбъемУслугиПотребленныйПотери 	= -НоваяЗапись.ОбъемУслугиПотребленныйПотери;
			НоваяЗапись.ОбъемУслугиПотребленныйСоцНорма = -НоваяЗапись.ОбъемУслугиПотребленныйСоцНорма;
			НоваяЗапись.ОбъемУслугиСоцНорма 			= -НоваяЗапись.ОбъемУслугиСоцНорма;
			НоваяЗапись.Сумма 							= -НоваяЗапись.Сумма;
			НоваяЗапись.СуммаПоПовышенномуКоэффициенту 	= -НоваяЗапись.СуммаПоПовышенномуКоэффициенту;
			НоваяЗапись.Было 							= Истина;
			НоваяЗапись.ЭтоСторно						= Истина;
			НоваяЗапись.Период 							= НачалоДня(Объект.Дата) - 1;
			
			НоваяЗапись 								= Расшифровка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Абонент							= АбонентНовый;
			НоваяЗапись.Было 							= Ложь;
			НоваяЗапись.ЭтоСторно						= Ложь;
			НоваяЗапись.Период 							= НачалоДня(Объект.Дата) - 1;
			
			
		КонецЦикла;
	КонецЕсли;
	// сворачиваем результат
	РезультатПерерасчета();
	
КонецПроцедуры

&НаСервере
Функция ПодключениеУслугиПервыйДокумент()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргПерерасчетДокументыОснования.Документ КАК Документ,
	|	энргПерерасчетДокументыОснования.Документ.Дата КАК ДокументДата,
	|	ВЫБОР
	|		КОГДА энргПерерасчетДокументыОснования.Документ ССЫЛКА Документ.энргОперацияСУслугами
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПодключениеУслугиПервыйДокумент
	|ИЗ
	|	Документ.энргПерерасчет.ДокументыОснования КАК энргПерерасчетДокументыОснования
	|ГДЕ
	|	энргПерерасчетДокументыОснования.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПодключениеУслугиПервыйДокумент;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВспомогательныеДанные(ПерерасчетСНачалаГода)
	Если ПерерасчетСНачалаГода Тогда
		Объект.НачПериода 					= НачалоГода(Объект.Дата);
		Объект.КонПериода 					= Объект.ПериодНачисления;
		УстановитьПредсталениеПериода();
	Иначе
		ЗаполнитьДанныеПоОснованиямСервер();
	КонецЕсли;
	Объект.КорректировкаПоказаний.Очистить();
	ЗаполнитьПоказания();
	ОбновитьРасшифровкуНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоОснованиямСервер()
	
	ИсключаемыеТипы					 	= Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргВводНачальныхОстатков"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргОбходнойЛист"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПриходныйКассовыйОрдер"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПерерасчет"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента"));
	
	Текст  								= "ВЫБРАТЬ Минимум(ВложенныйЗапрос.ДатаФактическогоСобытия) КАК ДатаФакт ИЗ (%%ТекстВложенногоЗапроса%%) КАК ВложенныйЗапрос";
	ТекстПериодНачисления 				= "ВЫБРАТЬ Минимум(ВложенныйЗапрос.ПериодНачисления) КАК ПериодНачисления ИЗ (%%ТекстЗапросаПериодНачисления%%) КАК ВложенныйЗапрос";
	ТекстВложенногоЗапроса 				= "";
	ТекстЗапросаПериодНачисления 		= "";
	Шаблон 								= "ВЫБРАТЬ ВЫБОР КОГДА Док.ДатаФактическогоСобытия  <> ДАТАВРЕМЯ(1, 1, 1) ТОГДА Док.ДатаФактическогоСобытия ИНАЧЕ Док.ПериодНачисления КОНЕЦ КАК ДатаФактическогоСобытия ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	ШаблонПериодНачисления				= "ВЫБРАТЬ Док.ПериодНачисления ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	
	ВозможныеТипы 						= Метаданные.Документы.энргПерерасчет.ТабличныеЧасти.ДокументыОснования.Реквизиты.Документ.Тип.типы();
	ГлавСчетчик 						= 0; 
	для Каждого Тип из ВозможныеТипы цикл
		Если Не ИсключаемыеТипы.Найти(Тип) = Неопределено ТОгда
			Продолжить;
		КонецЕсли;
		МетадДок 						= Метаданные.НайтиПоТипу(Тип);
		ИмяДок  						= МетадДок.имя;
		Если ГлавСчетчик> 0 тогда	
			ТекстВложенногоЗапроса 		= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
		КонецЕсли;
		
		ТекстВложенногоЗапроса 			= ТекстВложенногоЗапроса + СтрЗаменить(Шаблон,"%%ИмяДокумента%%",ИмяДок);
		ГлавСчетчик 					= ГлавСчетчик + 1;
	КонецЦикла;
	
	ГлавСчетчик 						= 0;	
	для Каждого Тип из ИсключаемыеТипы цикл
		МетадДок 						= Метаданные.НайтиПоТипу(Тип);
		ИмяДок  						= МетадДок.имя;
		Если ГлавСчетчик> 0 тогда	
			ТекстЗапросаПериодНачисления= ТекстЗапросаПериодНачисления + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
		КонецЕсли;
		
		ТекстЗапросаПериодНачисления 	= ТекстЗапросаПериодНачисления + СтрЗаменить(ШаблонПериодНачисления,"%%ИмяДокумента%%",ИмяДок);
		ГлавСчетчик 					= ГлавСчетчик + 1;
	КонецЦикла;
	
	Текст 								= СтрЗаменить(Текст,"%%ТекстВложенногоЗапроса%%",ТекстВложенногоЗапроса);
	Запрос 								= Новый Запрос;
	Запрос.Текст 						= Текст;
	Запрос.УстановитьПараметр("МассивСсылок",Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ"));
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	НачПерНачисления 					= Объект.ПериодНачисления;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ДатаФакт)  Тогда
			НачПерНачисления 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Выборка.ДатаФакт,Объект.Организация,Объект.Район);
		КонецЕсли;		
	КонецЕсли;
	
	Текст 								= СтрЗаменить(ТекстПериодНачисления,"%%ТекстЗапросаПериодНачисления%%",ТекстЗапросаПериодНачисления);
	Запрос 								= Новый Запрос;
	Запрос.Текст 						= Текст;
	Запрос.УстановитьПараметр("МассивСсылок",Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ"));
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	НачПерНачисленияПоказания 			= Объект.ПериодНачисления;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ПериодНачисления) Тогда
			НачПерНачисленияПоказания 	= Выборка.ПериодНачисления;
		КонецЕсли;		
	КонецЕсли;
	
	Объект.НачПериода 					= Мин(НачПерНачисления, НачПерНачисленияПоказания);
	Объект.КонПериода 					= НачалоМесяца(Объект.ПериодНачисления-1);
	УстановитьПредсталениеПериода();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказания() 
	
	Результат  			= РезультатДляЗаполненияПоказанийПриборовУчета();
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока	= Объект.КорректировкаПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.МожноКорректировать	= Истина;
	КонецЦикла;	
	
	Результат  			= РезультатДляЗаполненияПоказанийПриборовУчета(Ложь);
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока	= Объект.КорректировкаПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция РезультатДляЗаполненияПоказанийПриборовУчета(МожноКорректировать = Истина)
	//ПараметрыЗапроса = Новый Структура("Организация,Район,НачалоПериода,КонецПериода",Объект.Организация, Объект.Район,Объект.НачПериода,КонецМесяца(Объект.КонПериода));	
	ПараметрыЗапроса 		= Новый Структура("Организация,Район", Объект.Организация, Объект.Район);
	НачалоОтчетногоПериода 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация, Объект.Район, Объект.НачПериода).НачалоОП;
	КонецОтчетногоПериода 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация, Объект.Район, Объект.КонПериода).ЗавершениеОП - 1;
	ПараметрыЗапроса.Вставить("НачалоПериода"	, НачалоОтчетногоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода"	, КонецОтчетногоПериода);
	ПараметрыЗапроса.Вставить("Регистраторы"	, Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ"));
	ПараметрыЗапроса.Вставить("КлючиПомещений"	, Объект.Помещения.Выгрузить().ВыгрузитьКолонку("КлючПомещения"));
	
	Схема 						= Неопределено;	
	ПараметрыВТ 				= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район","Организация","Район")));
	Если МожноКорректировать Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения,Регистратор","КлючиПомещений","Регистраторы")));
		// Период не нужен для Ввода остатков. Отбора по регистратору хватит
		//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
	Иначе
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения","КлючиПомещений")));
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипНеВСписке(Новый Структура("Регистратор","Регистраторы")));
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("ПериодНачисления", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));
		//ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрПериодМежду("Период", Новый Структура("НачалоПериода,КонецПериода","НачалоПериода","КонецПериода")));	
	КонецЕсли;
	
	ПараметрыСхемы 				= Новый Структура;	
	ПараметрыСхемы.Вставить("ПараметрыВТ",ПараметрыВТ); 
	РегистрыСведений.энргПоказанияПриборовУчета.ЗаполнитьСхемуИсторияПоказанийПомещенияСУчетомКорректировки(Схема,ПараметрыСхемы,"");
	
	Пакет 						= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];	
	Оператор 					= Пакет.Операторы[0];
	
	ПереОпределяемыПоля  		= Новый Структура;
	ПереОпределяемыПоля.Вставить("ПриборУчета", 		"ПриборУчетаДо,ПриборУчетаПосле");
	ПереОпределяемыПоля.Вставить("Шкала", 				"ШкалаДо,ШкалаПосле");
	ПереОпределяемыПоля.Вставить("ТарифнаяЗона",		"ТарифнаяЗонаДо,ТарифнаяЗонаПосле");
	ПереОпределяемыПоля.Вставить("Показание",			"ПоказанияДо,ПоказанияПосле");
	ПереОпределяемыПоля.Вставить("Переворот",			"ПереворотДо,ПереворотПосле");
	ПереОпределяемыПоля.Вставить("СостояниеПоказаний",	"СостояниеПоказанийДо,СостояниеПоказанийПосле");
	ПереОпределяемыПоля.Вставить("КС",					"КСДо,КСПосле");
	
	ДополнитьВыбираемыеПоля 	= Новый Структура;
	ИндексКолонки				= 0;
	Для Каждого Поле Из Оператор.ВыбираемыеПоля Цикл
		Колонка 				= Пакет.Колонки[ИндексКолонки];
		Если ПереОпределяемыПоля.Свойство(Колонка.Псевдоним) Тогда
			мСтроки 			= СтрРазделить(ПереОпределяемыПоля[Колонка.Псевдоним],",",Ложь);
			Колонка.Псевдоним 	= мСтроки[0];
			Для Индекс = 1 По мСтроки.ВГраница() Цикл
				ДополнитьВыбираемыеПоля.Вставить(мСтроки[Индекс],"" + Поле);  
			КонецЦикла;			
		КонецЕсли;
		ИндексКолонки 			= ИндексКолонки + 1;
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ДополнитьВыбираемыеПоля Цикл
		Оператор.ВыбираемыеПоля.Добавить(КлючЗначение.Значение);
		Колонка  				= Пакет.Колонки[Пакет.Колонки.Количество()-1];
		Колонка.Псевдоним 		= КлючЗначение.Ключ;
	КонецЦикла; 	
	
	Пакет.Порядок.Добавить("ПериодНачисления");
	Пакет.Порядок.Добавить("ПриборУчетаДо");
	Пакет.Порядок.Добавить("ДатаПоказаний");
	Пакет.Порядок.Добавить("РегистраторПоказаний");
	Пакет.Порядок.Добавить("Разделитель");
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
КонецФункции 

&НаСервере
Процедура УстановитьПредсталениеПериода()
	ПредставлениеПериодаРасчета = Формат(Объект.НачПериода,"ДФ='ММММ гггг'") + " - " + Формат(Объект.КонПериода,"ДФ='ММММ гггг'");
КонецПроцедуры

&НаСервере
Процедура РезультатПерерасчета()
	
	Запрос 								= Новый Запрос;
	Запрос.УстановитьПараметр("Расшифровка", Расшифровка.Выгрузить());
	Запрос.Текст 						=
	"ВЫБРАТЬ
	|	Расшифровка.ПериодНачисления КАК ПериодНачисления,
	|	Расшифровка.Строение КАК Строение,
	|	Расшифровка.Помещение КАК Помещение,
	|	Расшифровка.Услуга КАК Услуга,
	|	Расшифровка.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВЫБОР
	|		КОГДА Расшифровка.ЭтоСторно
	|			ТОГДА -Расшифровка.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.ЭтоСторно
	|			ТОГДА Расшифровка.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПосле,
	|	ВЫБОР
	|		КОГДА Расшифровка.ЭтоСторно
	|			ТОГДА -Расшифровка.ОбъемУслуги
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.ЭтоСторно
	|			ТОГДА Расшифровка.ОбъемУслуги
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПосле,
	|	ВЫБОР
	|		КОГДА Расшифровка.ЭтоСторно
	|			ТОГДА -Расшифровка.ОбъемУслугиПотребленный
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.ЭтоСторно
	|			ТОГДА Расшифровка.ОбъемУслугиПотребленный
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйПосле,
	|	Расшифровка.Абонент КАК Абонент,
	|	Расшифровка.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ РезультатПерерасчета
	|ИЗ
	|	&Расшифровка КАК Расшифровка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатПерерасчета.ПериодНачисления КАК ПериодНачисления,
	|	РезультатПерерасчета.Строение КАК Строение,
	|	РезультатПерерасчета.Помещение КАК Помещение,
	|	РезультатПерерасчета.Услуга КАК Услуга,
	|	РезультатПерерасчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	СУММА(РезультатПерерасчета.СуммаДо) КАК СуммаДо,
	|	СУММА(РезультатПерерасчета.СуммаПосле) КАК СуммаПосле,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиДо) КАК ОбъемУслугиДо,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПосле) КАК ОбъемУслугиПосле,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПотребленныйДо) КАК ОбъемУслугиПотребленныйДо,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПотребленныйПосле) КАК ОбъемУслугиПотребленныйПосле,
	|	РезультатПерерасчета.Абонент КАК Абонент,
	|	РезультатПерерасчета.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РезультатПерерасчета КАК РезультатПерерасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатПерерасчета.ПериодНачисления,
	|	РезультатПерерасчета.Строение,
	|	РезультатПерерасчета.Помещение,
	|	РезультатПерерасчета.Услуга,
	|	РезультатПерерасчета.НаправлениеИспользованияТУ,
	|	РезультатПерерасчета.Абонент,
	|	РезультатПерерасчета.ТочкаУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	Строение,
	|	Помещение,
	|	Услуга,
	|	НаправлениеИспользованияТУ";
	
	РезультатПерерасчета.Очистить();
	Результат  = Запрос.Выполнить();
	Выборка  = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(РезультатПерерасчета.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуДокументаНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Район)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда		
		Возврат;
	КонецЕсли;	
	
	ГраницыПериодаНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация, Объект.Район, Объект.ПериодНачисления, Ложь);
	Если Не Объект.Дата = ГраницыПериодаНачисления.НачалоОП Тогда
		Объект.Дата 				= ГраницыПериодаНачисления.НачалоОП;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеПараметраЧастныйСектор(КлючПомещения)
	
	ДанныеПомещенияПоКлючу 				= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(КлючПомещения);
	ВыборкаДанныеПомещенияПоКлючу 		= ДанныеПомещенияПоКлючу.Выбрать();	
	
	Если ВыборкаДанныеПомещенияПоКлючу.Следующий() Тогда
		ЧастныйСектор =  ВыборкаДанныеПомещенияПоКлючу.ЧастныйСектор;
	Иначе ЧастныйСектор = Ложь;
	КонецЕсли; 
	
	Возврат ЧастныйСектор
КонецФункции

&НаСервере
Процедура ЗаполнитьПомещенияИзДокументаОснования(Параметры)
	Помещения 								= Параметры.ЗначенияЗаполнения.Помещения;
	//мКлючиБезАбонентов 						= Новый Массив;
	Для Сч = 0 По Помещения.ВГраница() Цикл
		ДанныеПомещения 					= Помещения[Сч];
		СтрокиПомещения						= Объект.Помещения.НайтиСтроки(Новый Структура("КлючПомещения,Абонент", ДанныеПомещения.КлючПомещения,ДанныеПомещения.Абонент));
		Если СтрокиПомещения.Количество() = 0 Тогда
			СтрокаПомещения  				= Объект.Помещения.Добавить();
			КлючПомещений.Добавить(ДанныеПомещения.КлючПомещения);
		Иначе
			СтрокаПомещения					= СтрокиПомещения[0];
		КонецЕсли;
		
		СтрокаПомещения.КлючПомещения  	= ДанныеПомещения.КлючПомещения;
		СтрокаПомещения.Абонент			= ДанныеПомещения.Абонент;
		СтрокаПомещения.АбонентСмена	= ?(ДанныеПомещения.Свойство("АбонентСмена"),ДанныеПомещения.АбонентСмена, Неопределено);
		
	КонецЦикла;
	
	//Если мКлючиБезАбонентов.Количество() > 0 Тогда
	//	Схема  = Новый СхемаЗапроса;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаписиРегистра()
	
	Попытка
		РегистрыНакопления.энргОбъемНачислений.ОчиститьНаборЗаписейПоРегистратору(Объект.Ссылка);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось удалить записи регистра накопления ""Объем начислений""");
		Возврат;
	КонецПопытки;
	РезультатПерерасчета.Очистить();
	Расшифровка.Очистить();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Заполнить", "Доступность", не Объект.ИзменятьТолькоПоказания);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВопросПередОчисткойРегистра(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			ОчиститьЗаписиРегистра();
		Иначе
			Объект.ИзменятьТолькоПоказания = Ложь;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СобытияТабличнойПомещения

&НаКлиенте
Процедура ПомещенияПриИзменении(Элемент)
	
	КлючПомещений.Очистить();
	ЗаполнитьКлючПомещений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияСтроениеПриИзменении(Элемент)
	
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Строение) Тогда
		ДанныеСтроения					= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(ТекущиеДанные.Строение,ТекущиеДанные.Помещение);
		ТекущиеДанные.КлючПомещения 	= ДанныеСтроения.КлючПомещения;
	Иначе
		ТекущиеДанные.Помещение			= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ТекущиеДанные.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияАбонентПриИзменении(Элемент)
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Абонент) Тогда
		
		ДанныеКлючПомещения				= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Абонент,"КлючПомещения");
		ТекущиеДанные.КлючПомещения 	= ДанныеКлючПомещения;
		ДанныеКлючаПомещения			= энргОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеКлючПомещения,"Строение,Помещение");
		ТекущиеДанные.Строение			= ДанныеКлючаПомещения.Строение;
		ТекущиеДанные.Помещение			= ДанныеКлючаПомещения.Помещение;
		
	Иначе
		ТекущиеДанные.Строение			= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		ТекущиеДанные.Помещение			= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ТекущиеДанные.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьКлючПомещений()
	
	Перем СтрокаПомещения;
	
	Для Каждого СтрокаПомещения Из Объект.Помещения Цикл
		КлючПомещений.Добавить(СтрокаПомещения.КлючПомещения);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодПерерасчета(Команда)
	Диалог 			= Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период 	= Новый СтандартныйПериод(Объект.НачПериода,Объект.КонПериода);
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьПериодПерерасчетаЗавершение", ЭтаФорма));	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодПерерасчетаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачПериода =  Период.ДатаНачала;
	Объект.КонПериода =  Период.ДатаОкончания; 
	УстановитьПредсталениеПериода();
КонецПроцедуры

&НаСервере 
Процедура ПроверитьПраваДокументаПерерасчет(Отказ) 
	
	ЕстьПравоЧтение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Чтение"); 
	ЕстьПравоИзменение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Изменение");
	Если Не ЕстьПравоИзменение И (Не ЕстьПравоЧтение Или ЕстьПравоЧтение И Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		Отказ = Истина;
		ВызватьИсключение "Нарушение прав доступа";
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр = ЕстьПравоЧтение И Не ЕстьПравоИзменение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаДобавить", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаОбновитьРасшифровку", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Заполнить", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РезультатПерерасчетаДобавить", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаНачисленныйСреднийДобавить", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОсновании", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);	
	
КонецПроцедуры

#КонецОбласти

#Область Подсистема_слжСлужебная

&НаКлиенте
Процедура Подключаемый_слж_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ОбработкаВыбораПоляВвода(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПриИзменении(Элемент)
	
	слжСобытияФормКлиентМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	слжСобытияФормКлиентМодуль.ПолеВводаПриИзменении(Элемент, ЭтаФорма);	
	ДействиеПоУмолчанию 		= слжСобытияФормКлиентМодуль.ДействиеПриИзмененииПоУмолчанию(Элемент, ЭтаФорма);
	Если Не ПустаяСтрока(ДействиеПоУмолчанию) Тогда
		Выполнить(ДействиеПоУмолчанию+"(Элемент)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_слж_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	слжМодульКлиент					= ОбщегоНазначенияКлиент.ОбщийМодуль("слжСобытияФормКлиент");
	СтруктураДействияПоУмолчанию 	= слжМодульКлиент.СтруктураДействияПоУмолчанию(ЭтаФорма);
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписью) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписью+"(Отказ, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	Отказ 							= слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписи) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписи+"(ПараметрыЗаписи)");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	Отказ 							= Истина;
	Модифицированность 				= Ложь;
	
КонецПроцедуры

&НаСервере
Функция слжВыполнитьСлужебныеОперацииПередЗаписьюСервер(СтруктураДействияПоУмолчанию,ПараметрыЗаписи)
	
	слжМодуль 					= ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");		
	слжТекущийОбъект 			= РеквизитФормыВЗначение("Объект");
	Отказ 						= Ложь;
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере) Тогда		
		Выполнить(СтруктураДействияПоУмолчанию.ПередЗаписьюНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЕсли;		
	
	Если НЕ слжТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ 					= Истина;
		Возврат Истина;
	КонецЕсли;
	
	НачатьТранзакцию();		
	слжТекущийОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПриЗаписиНаСервере+"(Отказ, слжТекущийОбъект, ПараметрыЗаписи)");
		Если Отказ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ПустаяСтрока(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере) Тогда
		Выполнить(СтруктураДействияПоУмолчанию.ПослеЗаписиНаСервере+"(слжТекущийОбъект, ПараметрыЗаписи)");
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(слжТекущийОбъект,"Объект");
	ОтменитьТранзакцию();
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура слжСлужебныеОперацииПриСозданииНаСервере()	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжСобытияФормМодуль = ОбщегоНазначения.ОбщийМодуль("слжСобытияФорм");
		слжСобытияФормМодуль.ПриСозданииНаСервере(ЭтотОбъект, Объект);
		Если Параметры.Свойство("слжКлюч") Тогда			
			слжПреобразовательДанныхМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжПреобразовательДанных");
			слжТекущийОбъект 				= слжПреобразовательДанныхМодуль.ТекущийОбъектПриЧтенииНаСервере(Параметры["слжКлюч"]);			
			слжПреобразовательДанныхМодуль.ЗаполнитьДанныеФормы(Параметры["слжКлюч"],Объект);
			ПриЧтенииНаСервере(слжТекущийОбъект);			
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти