#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПросроченныеЗаявки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СделатьОтборДинамческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрированныеОбращенияПриАктивизацииСтроки(Элемент)
	СделатьОтборДинамческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПросроченныеЗаявки(Команда)
	ЗаполнитьПросроченныеЗаявки();
КонецПроцедуры

#КонецОбласти

#Область ОБЩИЕ_МЕТОДЫ

&НаКлиенте
Процедура СделатьОтборДинамческогоСписка()
	
	ТекСтрока	= Элементы.ЗарегистрированныеОбращения.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ПервоначальныйДокумент = ТекСтрока.ссылка;
	
	ЭтапыОбращений.Отбор.Элементы.Очистить();
	ЭлементОтбора 					= ЭтапыОбращений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ПервоначальныйДокумент");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ПервоначальныйДокумент;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПросроченныеЗаявки()
	ПросроченныеЗаявки.Очистить();
	Результат 	= Обработки.бестРаботаСОбращениями.ПолучитьПросроченныеЗадачи();
	Выборка		= Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока	= ПросроченныеЗаявки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти






