#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//бестЛокализацияСервер.ПриСозданииНаСервере_бестСуточнаяВедомость(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Район)Тогда
		 РайонПриИзмененииНаСервере();
	 КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ОбъектыРасчетаУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	ВыборПростыеУслугиИТочкиУчета(ТекДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПростыеУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета",КонецДня(Объект.ДатаФактическогоСобытия));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекДанные);
	СтруктураОтбора.Период = ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), КонецДня(Объект.ДатаФактическогоСобытия), КонецДня(Объект.Дата));
	
	СтруктураОтбора.ОбъектРасчета = ТекДанные.ОбъектРасчета;
	
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца", СтруктураОтбора, "НП");
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		ТекДанные.ТочкаУчета = РезультатЗакрытия.ТочкаУчета;

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбъектыРасчетаУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			СписокСтрок = Объект.ОбъектыРасчета.НайтиСтроки(Новый Структура("ОбъектРасчета, ТочкаУчета", ТекДанные.ОбъектРасчета, ВыбранноеЗначение));
			Если СписокСтрок.Количество() >= 1 Тогда
				ТекДанные.ТочкаУчета 	 = Неопределено;
				ВыбранноеЗначение = Неопределено;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Точка учета уже добавлена в документ");
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ОбъектыРасчетаСтруктураСетиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.ОбъектыРасчета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			СписокСтрок = Объект.ОбъектыРасчета.НайтиСтроки(Новый Структура("ОбъектРасчета, ТочкаУчета, СтруктураСети", ТекДанные.ОбъектРасчета, ТекДанные.ТочкаУчета, ВыбранноеЗначение));
			Если СписокСтрок.Количество() >= 1 Тогда
				ТекДанные.СтруктураСети 	 = Неопределено;
				ВыбранноеЗначение = Неопределено;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Структура сети уже добавлена в документ");
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоСтруктуреСети(Команда)
	ЗаполнитьПоСтруктуреСетиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоСтруктуреСетиНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 			?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),КонецДня(Объект.Дата)));
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("СтруктураСети", 	Объект.СтруктураСети);

	Запрос.Текст = "ВЫБРАТЬ
	               |	бестАктивностьОбъектовРасчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	бестАктивностьОбъектовРасчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	бестАктивностьОбъектовРасчетаСрезПоследних.СтруктураСети КАК СтруктураСети
	               |ИЗ
	               |	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Район = &Район) КАК бестАктивностьОбъектовРасчетаСрезПоследних
	               |ГДЕ
	               |	бестАктивностьОбъектовРасчетаСрезПоследних.СтруктураСети = &СтруктураСети";
	
	
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	
	Объект.ОбъектыРасчета.Загрузить(Выгрузка);

КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти