#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНомераШаблонов(Дата,Шаблон = Неопределено) Экспорт
	
	НомераШаблонов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргНумерацияШаблоновВыгрузок.Шаблон КАК Шаблон,
		|	энргНумерацияШаблоновВыгрузок.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.энргНумерацияШаблоновВыгрузок КАК энргНумерацияШаблоновВыгрузок
		|ГДЕ
		|	энргНумерацияШаблоновВыгрузок.ДатаВыгрузки = &ДатаВыгрузки
		|	И энргНумерацияШаблоновВыгрузок.Шаблон = &Шаблон";
	
	Запрос.УстановитьПараметр("ДатаВыгрузки", Дата);
	Если Шаблон = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНумерацияШаблоновВыгрузок.Шаблон = &Шаблон","");
	Иначе	
		Запрос.УстановитьПараметр("Шаблон"		, Шаблон);
	КонецЕсли;

	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НомераШаблонов.Вставить(Выборка.Шаблон,Выборка.Номер + 1);
	КонецЦикла; 
	
	Если НомераШаблонов.Количество() = 0 Тогда
		СписокШаблонов =  Перечисления.энргШаблоныВыгрузок;
		Для Каждого ТекСтр Из СписокШаблонов Цикл
			НомераШаблонов.Вставить(ТекСтр,1);
		КонецЦикла;		
	КонецЕсли;
	
	Возврат НомераШаблонов;
	
КонецФункции

#КонецОбласти

#КонецЕсли