#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Если Параметры.Свойство("ЗаполнитьФорму") Тогда
		ЗаполнитьВходнымиДанными();
	КонецЕсли;
	
	ИспользоватьТарифныеЗоны 		= ПолучитьФункциональнуюОпцию("энргИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета 	= ПолучитьФункциональнуюОпцию("энргИспользоватьШкалыПриборовУчета");
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,,,,"УслугиДерево");	
	
	РаботаСУстановкойСвойствЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)		
	//Для Каждого ТекСтр из Объект.ТочкиУчета Цикл
	//	Если ТекСтр.ТехническиеСвойстваТУ = "" Тогда
	//		ТекСтр.ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстТехническихСвойств(ТекСтр, ПолучитьПотериТУ(ТекСтр.IDСтроки), ВызывающаяПодсистема);
	//	КонецЕсли;
	//	
	//	Если ТекСтр.СредстваИзмерения = "" Тогда
	//		энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстСредствИзмерений(ТекСтр, ПолучитьСИТУ(ТекСтр.IDСтроки));
	//	КонецЕсли; 		
	//КонецЦикла;
	
	ЗаполнитьДеревоУслуг();
КонецПроцедуры

#Конецобласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	Объект.ТочкиУчета.Очистить();
	ЗаполнитьТочкиНаОснованииДереваУслуг(УслугиДерево.ПолучитьЭлементы(), Неопределено);
	
	Закрыть(ПолучитьРезультат());
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат()	
	КлючиПараметровПередачи	= энргРаботаСТочкамиУчетаСервер.ПолучитьКлючиЗаполненияТочекУчета();	
	Результат 				= Новый Структура(КлючиПараметровПередачи.Таблицы);
	ТекущийОбъект			= Объект;
	
	ОчиститьНеИспользуемыеПриборыУчета();
	энргРаботаСТочкамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(Результат, ТекущийОбъект, ВидОперации);
	//Если ВызывающаяПодсистема = "МКД" Тогда
	//	СоответствиеТаблиц = энргРаботаСТочкамиУчетаСервер.СоответствиеТаблицЗаполненияМКД(ВидОперации);
	//иначе
	//	СоответствиеТаблиц = энргРаботаСТочкамиУчетаСервер.СоответствиеТаблицЗаполненияОбщая();
	//КонецЕсли;

	//энргРаботаСТочкамиУчетаСервер.ПолучитьВходныеДанныеТабЧастейУзла(Результат, ТекущийОбъект, СоответствиеТаблиц);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	ТаблицаФормы 				= Элементы.УслугиДерево;
	НоваяСтрока  				= УслугиДерево.ПолучитьЭлементы().Добавить();
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ЗаполнитьНовуюСтрокуДанными(НоваяСтрока);
	ТаблицаФормы.ИзменитьСтроку(); 	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненную(Команда)
	ТаблицаФормы 				= Элементы.УслугиДерево;
	ТаблицаФормы.ДобавитьСтроку();
	УстановитьНомерСтрокУслуг(УслугиДерево.ПолучитьЭлементы());
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыУслугиДерево

&НаКлиенте
Процедура УслугиДеревоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.УслугиДерево.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли; 	
		
		ЗаполнитьНовуюСтрокуДанными(ТекущиеДанные);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "УслугиДеревоТехническиеСвойстваТУ" Тогда
		 ОткрытьФормуТехническихСвойствТУ();
	ИначеЕсли Поле.Имя = "УслугиДеревоСредстваИзмерения" Тогда
		 ОткрытьФормуСредствИзмерений();
	ИначеЕсли Поле.Имя = "УслугиДеревоНаправлениеИспользованияТУ" Тогда
		 ОткрытьФормуИзмерителиНаправлений();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиДеревоПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.УслугиДерево.ТекущиеДанные;
	ОчиститьВзаимосвязанныеТаблицы(ТекущиеДанные.IDСтроки);
КонецПроцедуры

#КонецОбласти 

#Область СобытияЭлементовТаблицыУслугиДерево

&НаКлиенте
Процедура УслугиДеревоТочкаУчетаПриИзменении(Элемент)
	ТекущиеДанные 				= Элементы.УслугиДерево.ТекущиеДанны;
	Если ЗначениеЗаполнено(ТекущиеДанные.ТочкаУчета) Тогда
		ТекущиеДанные.Услуга  						= энргРаботаСТочкамиУчетаСервер.УслугаТочкиУчета(Объект.Организация,Объект.Район,Объект.КлючПомещения,ТекущиеДанные.ТочкаУчета,Объект.Дата);
		ТекущиеДанные.НаправлениеИспользованияТУ 	= энргРаботаСТочкамиУчетаСервер.НаправлениеИспользованияТочкиУчета(Объект.Организация,Объект.Район,Объект.КлючПомещения,ТекущиеДанные.ТочкаУчета,Объект.Дата);	
	Иначе
		ТекущиеДанные.Услуга 	= ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиДеревоУслугаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.УслугиДерево.ТекущиеДанные;
	ЗаполнитьНаименованиеТочкиУчета(ТекущиеДанные);  			
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма, ТекущиеДанные, энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга));
КонецПроцедуры

&НаКлиенте
Процедура УслугиДеревоРасположениеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.УслугиДерево.ТекущиеДанные;
	ЗаполнитьНаименованиеТочкиУчета(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиДеревоПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.УслугиДерево.ТекущиеДанные; 
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиДеревоПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.УслугиДерево.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоСоставнаяУслуга Тогда
		СтандартнаяОбработка=Ложь;
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные);
	Иначе 
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаСТехническимиСвойствамиТУ

&НаКлиенте
Процедура ОткрытьФормуТехническихСвойствТУ()
	ТекущиеДанные		= Элементы.УслугиДерево.ТекущиеДанные;
	КлючиДанных			= ПолучитьКлючиДанныхТехСвойств();
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ТехническиеСвойстваТУЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные, КлючиДанных", ТекущиеДанные, КлючиДанных));
	ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаТехническиеСвойстваТУ", ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


/////////////////////////////////////////////
// Получение входных данных

&НаКлиенте
Функция ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных)
	ТехническиеСвойстваТУ 	= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);	
	ЗаполнитьЗначенияСвойств(ТехническиеСвойстваТУ, ТекущиеДанные, КлючиДанных.Реквизиты);
	
	Если ВызывающаяПодсистема = "МКД" Тогда
		ТехническиеСвойстваТУ.НетВозможностьУстановкиПУ = ТекущиеДанные.НетВозможностьУстановкиОДПУ;
	КонецЕсли;
	
	ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, ТекущиеДанные.IDСтроки);
	ТехническиеСвойстваТУ.Вставить("ВызывающаяПодсистема", ВызывающаяПодсистема);
	
	Возврат Новый Структура("ВходныеПараметры", ТехническиеСвойстваТУ);
КонецФункции

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, IDСтроки)
	ИдентификаторФормы 				= ЭтаФорма.УникальныйИдентификатор;	
	ТехническиеСвойстваТУ.Потери 	= ПоместитьВоВременноеХранилище(Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки)), ИдентификаторФормы);
	//ТехническиеСвойстваТУ.Потери = ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки)));
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючиДанныхТехСвойств()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияТехническихСвойствТУ();
КонецФункции


/////////////////////////////////////////////
// Обработка возврата результата

&НаКлиенте
Процедура ТехническиеСвойстваТУЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	КлючиДанных 	= ДополнительныеПараметры.КлючиДанных;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, КлючиДанных.Реквизиты);
	ТехническиеСвойстваТУ = "";
	ЗаполнитьПотериИзРезультата(ТекущиеДанные.IDСтроки, Результат, ТехническиеСвойстваТУ);
	ТекущиеДанные.ТехническиеСвойстваТУ 		= ТехническиеСвойстваТУ;//энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстТехническихСвойств(Результат, Результат.Потери);
	ТекущиеДанные.НетВозможностьУстановкиОДПУ 	= Результат.НетВозможностьУстановкиПУ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПотериИзРезультата(IDСтроки, Результат, ТехническиеСвойстваТУ)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери, Новый Структура("IDСтроки", IDСтроки));
	
	ПотериРезультат = ПолучитьИзВременногоХранилища(Результат.Потери);
	Для Каждого ТекСтрЗаполнения из ПотериРезультат Цикл
		НоваяСтрока = Объект.Потери.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрЗаполнения);
		НоваяСтрока.IDСтроки = IDСтроки;
	КонецЦикла;
	
	Если НЕ ВызывающаяПодсистема = "МКД" Тогда
		ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(Результат, ПотериРезультат);
	Иначе 
		ТехническиеСвойстваТУ = ЗаполнитьТекстТехническихСвойствМКД(Результат, ПотериРезультат);
	КонецЕсли; 	
КонецПроцедуры

Функция ЗаполнитьТекстТехническихСвойствМКД(ТекущиеДанные, Потери)
	Текст = "Нет возможности установки ОДПУ = " + ТекущиеДанные.НетВозможностьУстановкиПУ + Символы.ПС;
	
	Если Потери.Количество() = 0 Тогда
		Текст = Текст + "Потери не заполнены";		
	иначе
		Текст = Текст + "Потери:" + Символы.ПС;
		Для Каждого ТекСтр из Потери Цикл
			ЧислоПотерь = ?(ТекСтр.ФиксированныйОбъемПотерь > 0 , ТекСтр.ФиксированныйОбъемПотерь, "" + ТекСтр.ПроцентПотерь + "%");
			Текст 		= Текст + ТекСтр.ВидПотерь + " = " + ЧислоПотерь + Символы.ПС;
		КонецЦикла; 		
	КонецЕсли;	
	
	Возврат СокрЛП(Текст);
КонецФункции

#КонецОбласти

#Область РаботаСИзмерителямиНаправлений

&НаКлиенте
Процедура ОткрытьФормуИзмерителиНаправлений()
	ТекущиеДанные 	= Элементы.УслугиДерево.ТекущиеДанные;
	КлючиДанных		= ПолучитьКлючиДанныхИзмерителейНаправлений();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзмерителиНаправленийЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные, КлючиДанных", ТекущиеДанные, КлючиДанных));
	ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаИзмерителиНаправлений", ПолучитьВходныеДанныеИзмерителейНаправлений(ТекущиеДанные, КлючиДанных),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


/////////////////////////////////////////////
// Получение входных данных

&НаКлиенте
Функция ПолучитьВходныеДанныеИзмерителейНаправлений(ТекущиеДанные, КлючиДанных)
	ИзмерителиНаправлений 	= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);
	ЗаполнитьЗначенияСвойств(ИзмерителиНаправлений, ТекущиеДанные, КлючиДанных.Реквизиты);
	ДополнитьТаблицыВВходныеДанныеИзмНаправлений(ИзмерителиНаправлений, ТекущиеДанные.IDСтроки); 	
	
	Возврат Новый Структура("ВходныеПараметры", ИзмерителиНаправлений); 
КонецФункции

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеИзмНаправлений(ИзмерителиНаправлений, IDСтроки)
	ИдентификаторФормы 							= ЭтаФорма.УникальныйИдентификатор;	
	ИзмерителиНаправлений.ЗначенияИзмерителей 	= ПоместитьВоВременноеХранилище(Объект.ЗначенияИзмерителей.Выгрузить(Новый Структура("IDСтроки", IDСтроки)), ИдентификаторФормы);
	//ИзмерителиНаправлений.ЗначенияИзмерителей 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ЗначенияИзмерителей.Выгрузить(Новый Структура("IDСтроки", IDСтроки)));
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючиДанныхИзмерителейНаправлений()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияИзмерителиНаправлений();
КонецФункции


/////////////////////////////////////////////
// Обработка возврата результата

&НаКлиенте
Процедура ИзмерителиНаправленийЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	КлючиДанных 	= ДополнительныеПараметры.КлючиДанных;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, КлючиДанных.Реквизиты);
	ЗаполнитьЗначенияИзмерителей(ТекущиеДанные.IDСтроки, Результат);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияИзмерителей(IDСтроки, Результат)
	
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ЗначенияИзмерителей, Новый Структура("IDСтроки", IDСтроки));
	
	ЗначенияИзмерителейРезультат = ПолучитьИзВременногоХранилища(Результат.ЗначенияИзмерителей);
	Для Каждого ТекСтрЗаполнения из ЗначенияИзмерителейРезультат Цикл
		НоваяСтрока = Объект.ЗначенияИзмерителей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрЗаполнения);
		НоваяСтрока.IDСтроки = IDСтроки;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССредствамиИзмерения

&НаКлиенте
Процедура ОткрытьФормуСредствИзмерений()
	
	ТекущиеДанные 	= Элементы.УслугиДерево.ТекущиеДанные;
	
	Если Не ТекущиеДанные.НетВозможностьУстановкиПУ Тогда
		КлючиДанных		= энргРаботаСТочкамиУчетаСервер.ПолучитьКлючиЗаполненияСредствИзмерений();//ПолучитьКлючиДанныхСредствИзмерений();	
		ОписаниеОповещения = Новый ОписаниеОповещения("СредстваИзмеренияЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные, КлючиДанных", ТекущиеДанные, КлючиДанных));
		ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаСредстваИзмерения", ПолучитьВходныеДанныеСредствИзмерений(ТекущиеДанные, КлючиДанных),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры


/////////////////////////////////////////////
// Получение входных данных

&НаКлиенте
Функция ПолучитьВходныеДанныеСредствИзмерений(ТекущиеДанные, КлючиДанных)
	ДопВходныеПараметры = "ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета";
	СредстваИзмерений 	= Новый Структура(КлючиДанных.Реквизиты + ", ВидОперации, " + КлючиДанных.Таблицы + ", " + ДопВходныеПараметры);
	
	ЗаполнитьЗначенияСвойств(СредстваИзмерений, ТекущиеДанные	, КлючиДанных.Реквизиты);
	ЗаполнитьЗначенияСвойств(СредстваИзмерений, ЭтаФорма		, ДопВходныеПараметры);
	СредстваИзмерений.Вставить("ВызывающаяПодсистема", ВызывающаяПодсистема);
	
	ДополнитьТаблицыВВходныеДанныеСредствИзмерений(СредстваИзмерений, ТекущиеДанные.IDСтроки);
	
	Возврат Новый Структура("ВходныеПараметры", СредстваИзмерений); 
КонецФункции

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеСредствИзмерений(СредстваИзмерений, IDСтроки)
	//СредстваИзмерений.Измерители 				= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.Измерители.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	//СредстваИзмерений.ШкалыПриборовУчета 		= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ШкалыПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	//СредстваИзмерений.ПоказанияПриборовУчета 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ПоказанияПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));	
	//СредстваИзмерений.ШкалыИзмерителей 			= ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ШкалыИзмерителей.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки)));
	
	энргРаботаСТочкамиУчетаСервер.ДополнитьТаблицыВВходныеДанныеСредствИзмерений(Объект, СредстваИзмерений, IDСтроки);  
	
КонецПроцедуры

/////////////////////////////////////////////
// Обработка возврата результата

&НаКлиенте
Процедура СредстваИзмеренияЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	КлючиДанных 	= ДополнительныеПараметры.КлючиДанных;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, КлючиДанных.Реквизиты, "Услуга, НаименованиеТочки");
	энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстСредствИзмерений(ТекущиеДанные, Результат);
	
	ДанныеПУ 		= энргРаботаСТочкамиУчетаСервер.ПолучитьОписаниеСтруктурыДанныхПУ();
	ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(ТекущиеДанные.IDСтроки, Результат, ДанныеПУ);
		
	//ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(ТекущиеДанные.IDСтроки, Результат, ДанныеПУ); 	
	
	// Заполняем описание узла
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеПУ);
	ТекущиеДанные.КоэффициентПУ = Результат.КоэффициентПУ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(IDСтрокиТочкиУчета, Результат, ДанныеПУ) 	
	//Измерители = ПолучитьИзВременногоХранилища(Результат.Измерители);
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, IDСтрокиТочкиУчета, Результат, ДанныеПУ);	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВходнымиДанными()
	Параметры.Свойство("ВидОперации"						, ВидОперации);	
	Параметры.Свойство("ВызывающаяПодсистема"				, ВызывающаяПодсистема);
	Параметры.Свойство("ПризнакРаспределенияНаАбонентов"	, ПризнакРаспределенияНаАбонентов);
	Параметры.Свойство("Организация"                        , Организация);
	Параметры.Свойство("Район"                              , Район);
	Параметры.Свойство("КлючПомещения"                      , КлючПомещения);
	
	ЗагрузитьТаблицуИзХранилища(Параметры.ТочкиУчета				, Объект.ТочкиУчета);
	ЗагрузитьТаблицуИзХранилища(Параметры.Измерители				, Объект.Измерители);
	ЗагрузитьТаблицуИзХранилища(Параметры.ШкалыПриборовУчета		, Объект.ШкалыПриборовУчета);
	ЗагрузитьТаблицуИзХранилища(Параметры.ШкалыИзмерителей			, Объект.ШкалыИзмерителей);
	ЗагрузитьТаблицуИзХранилища(Параметры.ПоказанияПриборовУчета	, Объект.ПоказанияПриборовУчета);
	ЗагрузитьТаблицуИзХранилища(Параметры.ЗначенияИзмерителей		, Объект.ЗначенияИзмерителей);
	ЗагрузитьТаблицуИзХранилища(Параметры.ПоставщикиСоставныхУслуг	, Объект.ПоставщикиСоставныхУслуг);
	ЗагрузитьТаблицуИзХранилища(Параметры.Потери					, Объект.Потери);
	ЗагрузитьТаблицуИзХранилища(Параметры.НомераПломб				, Объект.НомераПломб);
	
	Для Каждого ТекСтр из Объект.ТочкиУчета Цикл
		Если ТекСтр.ТехническиеСвойстваТУ = "" Тогда
			ТекСтр.ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(ТекСтр, ПолучитьПотериТУ(ТекСтр.IDСтроки), ВызывающаяПодсистема);
		КонецЕсли;
		
		Если ТекСтр.СредстваИзмерения = "" Тогда
			энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтр, ПолучитьСИТУ(ТекСтр.IDСтроки));
		КонецЕсли;
		
		ОбновитьТекстовыеПоляТаблицыТочкиУчетаПереопределяемый(ТекСтр);
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьТекстовыеПоляТаблицыТочкиУчетаПереопределяемый(СтрокаНабора)
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьТаблицуИзХранилища(ТаблицаИсточник, ТаблицаПриемник)
	Если ТаблицаИсточник = "" Тогда
		Возврат;
	КонецЕсли; 	
	
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(ТаблицаИсточник);
	ТаблицаПриемник.Загрузить(ТаблицаРезультат);
КонецПроцедуры


&НаСервере
Процедура РаботаСУстановкойСвойствЭлементовФормы()
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоУслуга", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоРасположение", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоНаименованиеТочки", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоНаправлениеИспользованияТУ", "Доступность", Ложь);		
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоПоставщик", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревобестСтруктураСети", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоТехническиеСвойстваТУ", "Видимость", Ложь); 		
	КонецЕсли;
	
	Если ВызывающаяПодсистема = "МКД" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоДобавитьПодчиненную"			, "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоНаправлениеИспользованияТУ"		, "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоНазначениеПУ", "Видимость"		, Истина); 
		//энргОбщегоНазначения.УстановитьДоступностьРаспределенияОДН(Элементы, "УслугиДеревоРаспределятьНаАбонентов");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УслугиДеревоРаспределятьНаАбонентов"		, "Видимость", Истина);
 	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВзаимосвязанныеТаблицы(IDСтроки)
	СтруктураДляIDСтроки 			= Новый Структура("IDСтроки", IDСтроки);
	СтруктураДляIDСтрокиТочкиУчета 	= Новый Структура("IDСтрокиТочкиУчета", IDСтроки);
	
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ЗначенияИзмерителей		, СтруктураДляIDСтроки);
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ПоставщикиСоставныхУслуг	, СтруктураДляIDСтроки);
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ШкалыПриборовУчета			, СтруктураДляIDСтрокиТочкиУчета);
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ПоказанияПриборовУчета		, СтруктураДляIDСтрокиТочкиУчета);
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Измерители					, СтруктураДляIDСтрокиТочкиУчета);
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ШкалыИзмерителей			, СтруктураДляIDСтрокиТочкиУчета);
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери						, СтруктураДляIDСтроки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУслуг()
	ПустойКлючСтроки  	= Новый ОписаниеТипов("УникальныйИдентификатор");
	ЗаполнитьДеревоУслугНаОснованииТочекУчета(Объект, УслугиДерево, ПустойКлючСтроки.ПривестиЗначение());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУслугНаОснованииТочекУчета(ТекущийОбъект, СтрокаРодитель, Родитель)
	
	Вершины 			= ТекущийОбъект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиРодитель", Родитель));
	Строки  			= СтрокаРодитель.ПолучитьЭлементы();
	
	Для Сч = 0 По Вершины.ВГраница() Цикл
		Если ЗначениеЗаполнено(Вершины[Сч].IDСтроки) Тогда
			СтрокаДерева  	= Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Вершины[Сч]);
			ЗаполнитьДеревоУслугНаОснованииТочекУчета(ТекущийОбъект, СтрокаДерева, Вершины[Сч].IDСтроки);
			ЗаполнитьСхемаПрисоединенияПоСтруктуреСетиПереопределяемый(Вершины[Сч], СтрокаДерева);
			//СтрокаДерева.СхемаПрисоединения = Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(Вершины[Сч].СтруктураСети);
			Если ВызывающаяПодсистема = "МКД" Тогда
				СтрокаДерева.НетВозможностьУстановкиПУ = Вершины[Сч].НетВозможностьУстановкиОДПУ;
			КонецЕсли;
			ЗаполнитьСтруктуруСетиПоТочкеУчета(Вершины[Сч].ТочкаУчета, СтрокаДерева);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСхемаПрисоединенияПоСтруктуреСетиПереопределяемый(СтрокаВершины, СтрокаДерева)
	// Переопределена в расширении	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруСетиПоТочкеУчета(ТочкаУчета, Строка)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТочкиНаОснованииДереваУслуг(Строки, Родитель)
	
	Для Каждого Строка Из Строки Цикл 		
		СтрокаТочки  						= Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочки, Строка);
		СтрокаТочки.ДанныеУслуги 				= энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстДанныеУслуги(СтрокаТочки, Объект.ПоставщикиСоставныхУслуг);
		СтрокаТочки.ДанныеРасположения 			= энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстДанныеРасположения(СтрокаТочки);
		
		СтрокаТочки.НетВозможностьУстановкиОДПУ = СтрокаТочки.НетВозможностьУстановкиПУ;
		
		Если Не Родитель = Неопределено Тогда
			СтрокаТочки.IDСтрокиРодитель	= Родитель;			
		КонецЕсли;
		
		ЗаполнитьТочкиНаОснованииДереваУслуг(Строка.ПолучитьЭлементы(), Строка.IDСтроки);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованиеТочкиУчета(ТекДанные)
	Если ТекДанные.Головная Тогда 
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга + "_Головная";
	Иначе
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПотериТУ(IDСтроки)
	МассивСтрок 	= Объект.Потери.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
	МассивВозврата 	= Новый Массив;
	Для Каждого ТекСтр из МассивСтрок Цикл
		НоваяСтрока = Новый Структура("ВидПотерь, ФиксированныйОбъемПотерь, ПроцентПотерь");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтр);
		МассивВозврата.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат МассивВозврата;
КонецФункции

&НаСервере
Функция ПолучитьСИТУ(IDСтроки)
	МассивСтрок = Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", IDСтроки));
	Возврат Новый Структура("Измерители", МассивСтрок);
КонецФункции

// энргРаботаСПоставщиками {
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков", IDСтроки = Неопределено, СоотвествиеУслуг = Неопределено) Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы,"УслугиДерево");
КонецПроцедуры

// энргРаботаСПоставщиками }

&НаКлиенте
Процедура УстановитьНомерСтрокУслуг(Строки, НомерСтроки=1)

	Для Каждого Строка Из Строки Цикл 		
		Строка.НомерСтроки 				= НомерСтроки;
		Строка.РаспределятьНаАбонентов	=  ПризнакРаспределенияНаАбонентов;
		
		НомерСтроки 					= НомерСтроки + 1;
		УстановитьНомерСтрокУслуг(Строка.ПолучитьЭлементы(), НомерСтроки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНовуюСтрокуДанными(ТекущиеДанные) 
	ТекущиеДанные.IDСтроки 					=  Новый УникальныйИдентификатор;
	ТекущиеДанные.РаспределятьНаАбонентов	=  ПризнакРаспределенияНаАбонентов;
	ТекущиеДанные.ТехническиеСвойстваТУ 	=  "Не заполнены";
	ТекущиеДанные.СредстваИзмерения			=  "Не заполнены";
КонецПроцедуры 


&НаСервере
Процедура ОчиститьНеИспользуемыеПриборыУчета()
	ПустоеОписаниеПУ = ПустоеОписаниеХарактеристикПрибораУчета();	
	Для Каждого ТекСтрока Из Объект.ТочкиУчета Цикл
		НетПриборов = Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)).Количество() = 0;
		Если НетПриборов Тогда 
			ЗаполнитьЗначенияСвойств(ТекСтрока, ПустоеОписаниеПУ);
		КонецЕсли;  	
	КонецЦикла; 		
КонецПроцедуры

&НаСервере
Функция ПустоеОписаниеХарактеристикПрибораУчета()
	Описание = Новый Структура;
	Описание.Вставить("ВидКанальности"				, Справочники.энргВидыКанальности.ПустаяСсылка());	
	Описание.Вставить("ОписаниеПрибора"				, "");	
	Описание.Вставить("ПриборУчета"					, Справочники.энргПриборыУчетаАбонента.ПустаяСсылка());	
	Описание.Вставить("ТипУзлаУчета"				, Справочники.энргТипыУзловУчета.ПустаяСсылка());	
	Описание.Вставить("ЗаводскойНомер"				, "");	
	Описание.Вставить("ДатаПоверкиСчетчика"			, Дата(1,1,1));	
	Описание.Вставить("ДатаУстановкиПломбы"			, Дата(1,1,1));	
	Описание.Вставить("НомерПломбы"					, "");	
	Описание.Вставить("ТипПрибораУчета"				, Справочники.энргТипыПриборовУчета.ПустаяСсылка());	
	Описание.Вставить("СистемаУчетаЭлектроэнергии"	, Справочники.энргСистемыУчетаЭлектроэнергии.ПустаяСсылка());	
	Описание.Вставить("СобственникСИ"				, Перечисления.энргБалансоваяПринадлежность.ПустаяСсылка());
	Описание.Вставить("БалансоваяПринадлежность"	, Перечисления.энргБалансоваяПринадлежность.ПустаяСсылка());

	Возврат Описание;
КонецФункции

#КонецОбласти