#Область ОбработчикиСобытий

// Функция рассчитывает льготы за день.
Функция РасчитатьЛьготыЗаДень(ОбщееНачислениеЗаДень, ЗначениеТарифа, День, КоличествоПрописанных, пЗначенияЛьгот, СоцНорма, пТариф, пКоличествоДней) Экспорт
	ТаблицаЛьготЗаДень = Новый ТаблицаЗначений;
	ТаблицаЛьготЗаДень.Колонки.Добавить("Жилец",,"Жилец");
	ТаблицаЛьготЗаДень.Колонки.Добавить("Льгота",,"Льгота");
	ТаблицаЛьготЗаДень.Колонки.Добавить("Бюджет",,"Бюджет");
	ТаблицаЛьготЗаДень.Колонки.Добавить("СуммаКВозмещению",,"СуммаКВозмещению");
	ТаблицаЛьготЗаДень.Колонки.Добавить("СуммаПоУслуге",,"СуммаПоУслуге");
		
	Если КоличествоПрописанных = 0 ИЛИ пКоличествоДней = 0 Тогда
		Возврат ТаблицаЛьготЗаДень;	
	КонецЕсли;  
 	
	НачисленияЗаДень=ОбщееНачислениеЗаДень/КоличествоПрописанных;
	Если СоцНорма<>0 Тогда	
		ЗначениеСоцНормы = СоцНорма;
		ПоСоцНормам = Истина;
	Иначе
		ЗначениеСоцНормы = 0;
		ПоСоцНормам = Ложь;		
	КонецЕсли;
		
	Если ЗначениеТарифа <> 0 Тогда
			КоличествоЕдениц = ((НачисленияЗаДень * пКоличествоДней) / ЗначениеТарифа);
		Иначе
			КоличествоЕдениц = 0;	
	КонецЕсли;
		
	ЗначениеСоцНормыНаЧеловека= ЗначениеСоцНормы/КоличествоПрописанных;
	НачислениеПоСоцНормамЗаДень = (ЗначениеСоцНормыНаЧеловека * ЗначениеТарифа) / пКоличествоДней; 
	
	Если НачислениеПоСоцНормамЗаДень > НачисленияЗаДень Тогда
		НачислениеПоСоцНормамЗаДень = НачисленияЗаДень;
	КонецЕсли;
	
	
	ТаблицаЗначенийЛьгот = пЗначенияЛьгот.ЗначенияЛьгот; 
	СтруктураНаОдногНеВДолях = Новый Структура("НаВсюСемью, ВДолях", Перечисления.ДаНет.Нет, Перечисления.ДаНет.Нет);
	СтруктураНаОдногоВДолях = Новый Структура("НаВсюСемью, ВДолях", Перечисления.ДаНет.Нет, Перечисления.ДаНет.Да); 
	СтруктураНаВсехВДолях = Новый Структура("НаВсюСемью, ВДолях", Перечисления.ДаНет.Да, Перечисления.ДаНет.Да); 
	СтруктураНаВсехНеВДолях = Новый Структура("НаВсюСемью, ВДолях", Перечисления.ДаНет.Да, Перечисления.ДаНет.Нет); 
	
	ТаблицаЗначенийЛьготНаВсехНеВДолях = ТаблицаЗначенийЛьгот.НайтиСтроки(СтруктураНаВсехНеВДолях); 
	ТаблицаЗначенийЛьготНаОдногоНеВДолях = ТаблицаЗначенийЛьгот.НайтиСтроки(СтруктураНаОдногНеВДолях);
	ТаблицаЗначенийЛьготНаОдногоВДолях = ТаблицаЗначенийЛьгот.НайтиСтроки(СтруктураНаОдногоВДолях); 
	ТаблицаЗначенийЛьготНаВсехВДолях = ТаблицаЗначенийЛьгот.НайтиСтроки(СтруктураНаВсехВДолях); 
		
	СтруктураУслуги = Новый Структура("ВидУслуги", пТариф.ВидУслуги); 
	ТаблицаЗначенийЛьготПоУслуге = ТаблицаЗначенийЛьгот.НайтиСтроки(СтруктураУслуги); 
	СтруктураДа = Новый Структура("ВидУслуги, НаВсюСемью", пТариф.ВидУслуги, Перечисления.ДаНет.Да);
	ТаблицаЗначенийЛьготНаВсюСемью = ТаблицаЗначенийЛьгот.НайтиСтроки(СтруктураДа); 

	КоличествоСДаНаВсюСемью=ТаблицаЗначенийЛьготНаВсюСемью.Количество();
    КоличествоДляРаспределения=КоличествоПрописанных-ТаблицаЗначенийЛьготПоУслуге.Количество();
	
	КоличествоСНетНаВсюСемью=ТаблицаЗначенийЛьготПоУслуге.Количество()-КоличествоСДаНаВсюСемью;
	
	Для Каждого СтрокаТаблицаЗначенийЛьготПоУслуге Из ТаблицаЗначенийЛьготПоУслуге Цикл
		Если СтрокаТаблицаЗначенийЛьготПоУслуге.НаВсюСемью=Перечисления.ДаНет.Нет Тогда
				Если СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзФедерального <> 0 Тогда
					СуммаЛьгот = НачислениеПоСоцНормамЗаДень * (СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзФедерального / 100);						
					Строка = ТаблицаЛьготЗаДень.Добавить();                                                                     
					Строка.Жилец = СтрокаТаблицаЗначенийЛьготПоУслуге.Жилец;
					Строка.Льгота = СтрокаТаблицаЗначенийЛьготПоУслуге.Льгота;
					Строка.Бюджет = Перечисления.Бюджеты.Федеральный;
					Строка.СуммаКВозмещению = СуммаЛьгот;
					Строка.СуммаПоУслуге = НачислениеПоСоцНормамЗаДень;
				КонецЕсли;
				
				// ПроцентИзОбластного
				Если СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзОбластного <> 0 Тогда
					СуммаЛьгот = НачислениеПоСоцНормамЗаДень * (СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзОбластного / 100);
					Строка = ТаблицаЛьготЗаДень.Добавить();
					Строка.Жилец = СтрокаТаблицаЗначенийЛьготПоУслуге.Жилец;
					Строка.Льгота = СтрокаТаблицаЗначенийЛьготПоУслуге.Льгота;
					Строка.Бюджет = Перечисления.Бюджеты.Областной;
					Строка.СуммаКВозмещению = СуммаЛьгот;
					Строка.СуммаПоУслуге = НачислениеПоСоцНормамЗаДень;
				КонецЕсли;
				
				Если СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзМестного <> 0 Тогда
					СуммаЛьгот = НачислениеПоСоцНормамЗаДень * (СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзМестного / 100);						
					Строка = ТаблицаЛьготЗаДень.Добавить();
					Строка.Жилец = СтрокаТаблицаЗначенийЛьготПоУслуге.Жилец;
					Строка.Льгота = СтрокаТаблицаЗначенийЛьготПоУслуге.Льгота;
					Строка.Бюджет = Перечисления.Бюджеты.Местный;
					Строка.СуммаКВозмещению = СуммаЛьгот;
					Строка.СуммаПоУслуге = НачислениеПоСоцНормамЗаДень;
				КонецЕсли;	
			Иначе   				
				Если СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзФедерального <> 0 Тогда
					СуммаЛьгот = НачислениеПоСоцНормамЗаДень * (СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзФедерального / 100);
					ЗначениеЛьготыДляРасчетаПоРаспределению=СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзФедерального;
					
					СуммаЛьготДляРаспределения = НачислениеПоСоцНормамЗаДень * ЗначениеЛьготыДляРасчетаПоРаспределению/100*КоличествоДляРаспределения;
					СуммаЛьготаДляРаспределенияНаОдного=СуммаЛьготДляРаспределения/КоличествоСДаНаВсюСемью;
					
					Для Каждого СтрокаТаблицаЗначенийЛьготНаВсюСемью Из ТаблицаЗначенийЛьготНаВсюСемью Цикл
						Строка = ТаблицаЛьготЗаДень.Добавить();
						Строка.Жилец = СтрокаТаблицаЗначенийЛьготНаВсюСемью.Жилец;
						Строка.Льгота = СтрокаТаблицаЗначенийЛьготНаВсюСемью.Льгота;
						Строка.Бюджет = Перечисления.Бюджеты.Федеральный;
						Строка.СуммаКВозмещению = СуммаЛьгот+СуммаЛьготаДляРаспределенияНаОдного;
						Строка.СуммаПоУслуге = НачислениеПоСоцНормамЗаДень+СуммаЛьготДляРаспределения;
                    КонецЦикла;
				КонецЕсли;
				
				// ПроцентИзОбластного
				Если СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзОбластного <> 0 Тогда
					СуммаЛьгот = НачислениеПоСоцНормамЗаДень * (СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзОбластного / 100);
	
					ЗначениеЛьготыДляРасчетаПоРаспределению=СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзОбластного;
					
					СуммаЛьготДляРаспределения = НачислениеПоСоцНормамЗаДень * ЗначениеЛьготыДляРасчетаПоРаспределению/100*КоличествоДляРаспределения;
					СуммаЛьготаДляРаспределенияНаОдного=СуммаЛьготДляРаспределения/КоличествоСДаНаВсюСемью;
					
					Для Каждого СтрокаТаблицаЗначенийЛьготНаВсюСемью Из ТаблицаЗначенийЛьготНаВсюСемью Цикл
						Строка = ТаблицаЛьготЗаДень.Добавить();
						Строка.Жилец = СтрокаТаблицаЗначенийЛьготПоУслуге.Жилец;
						Строка.Льгота = СтрокаТаблицаЗначенийЛьготПоУслуге.Льгота;
						Строка.Бюджет = Перечисления.Бюджеты.Областной;
						Строка.СуммаКВозмещению = СуммаЛьгот+СуммаЛьготаДляРаспределенияНаОдного;
						Строка.СуммаПоУслуге =НачислениеПоСоцНормамЗаДень+СуммаЛьготДляРаспределения;
					КонецЦикла;
				КонецЕсли;
				// ПроцентИзМестного
				Если СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзМестного <> 0 Тогда
					СуммаЛьгот = НачислениеПоСоцНормамЗаДень * (СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзМестного / 100);
					
					ЗначениеЛьготыДляРасчетаПоРаспределению=СтрокаТаблицаЗначенийЛьготПоУслуге.ПроцентИзМестного;
					
					СуммаЛьготДляРаспределения = НачислениеПоСоцНормамЗаДень * ЗначениеЛьготыДляРасчетаПоРаспределению/100*КоличествоДляРаспределения;
					СуммаЛьготаДляРаспределенияНаОдного=СуммаЛьготДляРаспределения/КоличествоСДаНаВсюСемью;
					
					Для Каждого СтрокаТаблицаЗначенийЛьготНаВсюСемью Из ТаблицаЗначенийЛьготНаВсюСемью Цикл
						Строка = ТаблицаЛьготЗаДень.Добавить();
						Строка.Жилец = СтрокаТаблицаЗначенийЛьготПоУслуге.Жилец;
						Строка.Льгота = СтрокаТаблицаЗначенийЛьготПоУслуге.Льгота;
						Строка.Бюджет = Перечисления.Бюджеты.Местный;
						Строка.СуммаКВозмещению = СуммаЛьгот+СуммаЛьготаДляРаспределенияНаОдного;					
						Строка.СуммаПоУслуге = НачислениеПоСоцНормамЗаДень+СуммаЛьготДляРаспределения;
					КонецЦикла;
				КонецЕсли;
			    Прервать;
		КонецЕсли;
	КонецЦикла;
		
		
	Возврат ТаблицаЛьготЗаДень;
	
КонецФункции

// Функция получает значения льгот.
Функция ПолучитьЗначенияЛьгот(пЛьготыАбонента, пПериод) Экспорт
	
	ОтборЗначениеЛьготы = Новый Структура;
	
	// Создаем таблицы значений льгот
	ТаблицаЗначенийЛьгот = Новый ТаблицаЗначений;
	ТаблицаЗначенийЛьгот.Колонки.Добавить("ПроцентИзФедерального",,"ПроцентИзФедерального");
	ТаблицаЗначенийЛьгот.Колонки.Добавить("ПроцентИзОбластного",,"ПроцентИзОбластного");
	ТаблицаЗначенийЛьгот.Колонки.Добавить("ПроцентИзМестного",,"ПроцентИзМестного");
	ТаблицаЗначенийЛьгот.Колонки.Добавить("ЗначениеЛьготы",,"ЗначениеЛьготы");	
	ТаблицаЗначенийЛьгот.Колонки.Добавить("Жилец",,"Жилец");
	ТаблицаЗначенийЛьгот.Колонки.Добавить("Льгота",,"Льгота");
	ТаблицаЗначенийЛьгот.Колонки.Добавить("ВидУслуги",,"ВидУслуги");
	ТаблицаЗначенийЛьгот.Колонки.Добавить("НаВсюСемью",,"НаВсюСемью");
	ТаблицаЗначенийЛьгот.Колонки.Добавить("ВДолях",,"ВДолях");
	
	// Находим значения льгот для всех и одного
	Для Каждого СтрокаЛьготыАбонента Из пЛьготыАбонента Цикл
		Если СтрокаЛьготыАбонента.Жилец.ПометкаУдаления=Ложь Тогда
			Льгота = СтрокаЛьготыАбонента.Льгота;
			Жилец = СтрокаЛьготыАбонента.Жилец;	
			ВидУслуги = СтрокаЛьготыАбонента.ВидУслуги; // Костя
			ОтборЗначениеЛьготы.Вставить("Льгота",Льгота);
			ОтборЗначениеЛьготы.Вставить("ВидУслуги",ВидУслуги);
			СрезПоЛьготе = РегистрыСведений.ЗначенияЛьгот.СрезПоследних(пПериод, ОтборЗначениеЛьготы);
			Для Каждого СтрокаСреза Из СрезПоЛьготе Цикл
				НайденныеСтроки = ТаблицаЗначенийЛьгот.НайтиСтроки(Новый Структура("Льгота, Жилец, ВидУслуги", Льгота, Жилец, СтрокаСреза.ВидУслуги));
				Строка = ТаблицаЗначенийЛьгот.Добавить();
				Строка.ПроцентИзФедерального = СтрокаСреза.ПроцентИзФедерального;
				Строка.ПроцентИзМестного = СтрокаСреза.ПроцентИзМестного;
				Строка.ПроцентИзОбластного = СтрокаСреза.ПроцентИзОбластного;
				Строка.ЗначениеЛьготы = Строка.ПроцентИзФедерального + Строка.ПроцентИзМестного + Строка.ПроцентИзОбластного;
				Строка.Жилец = Жилец;
				Строка.Льгота = Льгота;
				Строка.ВидУслуги = СтрокаСреза.ВидУслуги;
				Строка.НаВсюСемью = СтрокаСреза.НаВсюСемью;
				Строка.ВДолях = СтрокаСреза.ВДолях;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
		// Сортируем значения по убыванию
	
	Если ТаблицаЗначенийЛьгот.Количество() > 0 Тогда
		ТаблицаЗначенийЛьгот.Сортировать("ЗначениеЛьготы Убыв");
		ТаблицаЗначенийЛьгот.Сортировать("НаВсюСемью Убыв");		
	КонецЕсли;
	
	
	ВыходныеПараметры = Новый Структура();
	ВыходныеПараметры.Вставить("ЗначенияЛьгот", ТаблицаЗначенийЛьгот);
	
    Возврат ВыходныеПараметры; 
	
КонецФункции

// Функция получает периоды изменения льгот.
Функция ПолучитьПериодыИзмененияЛьгот(пНачПериода, пКонПериода, пАбонент) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИспользованиеЛьгот.Период КАК ДатаИзменения,
	                      |	ИспользованиеЛьгот.Льгота КАК Льгота,
	                      |	ИспользованиеЛьгот.Жилец КАК Жилец,
	                      |	ИспользованиеЛьгот.ВидУслуги КАК ВидУслуги,
	                      |	ИспользованиеЛьгот.Состояние КАК Состояние
	                      |ИЗ
	                      |	РегистрСведений.ИспользованиеЛьгот КАК ИспользованиеЛьгот
	                      |ГДЕ
	                      |	ИспользованиеЛьгот.Период > &НачалоПериода
	                      |	И ИспользованиеЛьгот.Период <= &КонецПериода
	                      |	И ИспользованиеЛьгот.Жилец.Владелец = &Абонент");
	Запрос.УстановитьПараметр("НачалоПериода",пНачПериода);
	Запрос.УстановитьПараметр("КонецПериода",пКонПериода);
	Запрос.УстановитьПараметр("Абонент",пАбонент);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗИзмененияЛьгот = РезультатЗапроса.Выгрузить();	
				
	Возврат ТЗИзмененияЛьгот;
	
КонецФункции

// Функция получает периоды изменения значений льгот.
Функция ПолучитьПериодыИзмененияЗначенийЛьгот(пНачПериода, пКонПериода) Экспорт
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗначенияЛьгот.Период КАК ДатаИзменения,
	                      |	ЗначенияЛьгот.Льгота КАК Льгота,
	                      |	ЗначенияЛьгот.ВидУслуги
	                      |ИЗ
	                      |	РегистрСведений.ЗначенияЛьгот КАК ЗначенияЛьгот
	                      |ГДЕ
	                      |	ЗначенияЛьгот.Период > &НачалоПериода
	                      |	И ЗначенияЛьгот.Период <= &КонецПериода");
	Запрос.УстановитьПараметр("НачалоПериода",пНачПериода);
	Запрос.УстановитьПараметр("КонецПериода",пКонПериода);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗИзмененийЗначенийЛьгот = РезультатЗапроса.Выгрузить();
				
	Возврат ТЗИзмененийЗначенийЛьгот;
	
КонецФункции

// Функция получает периоды изменения соцнорм.
Функция ПолучитьПериодыИзмененияСоцНорм(пНачПериода, пКонПериода) Экспорт
		
	Запрос = Новый Запрос("
		|	ВЫБРАТЬ
		|		Период КАК ДатаИзменения,
		|		Тариф КАК Тариф
		|	ИЗ
		| 		РегистрСведений.ЗначенияСоцНормативов		
		|	ГДЕ
		| 		Период > &НачалоПериода И
		|		Период <= &КонецПериода");
	Запрос.УстановитьПараметр("НачалоПериода",пНачПериода);
	Запрос.УстановитьПараметр("КонецПериода",пКонПериода);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗИзмененийЗначенийСоцНорм = РезультатЗапроса.Выгрузить();
				
	Возврат ТЗИзмененийЗначенийСоцНорм;
	
КонецФункции

// Функция получает значения соцнорм
Функция ПолучитьЗначенияСоцНорм(пУслугиАбонента, пКоличествоПрописанных, пПериод) Экспорт
	
	ТаблицаЗначенийСоцНорм = Новый ТаблицаЗначений;
	ТаблицаЗначенийСоцНорм.Колонки.Добавить("Тариф",,"Тариф");
	ТаблицаЗначенийСоцНорм.Колонки.Добавить("Значение",,"Значение");
	
	ОтборЗначениеСоцНормы = Новый Структура();
	
	Для Каждого СтрокаУслугиАбонента ИЗ пУслугиАбонента Цикл  
		ЗначениеСоцНормы = 0;
		// Находим значение соц нормы	
		ОтборЗначениеСоцНормы.Вставить("Тариф",СтрокаУслугиАбонента.Тариф);	
		ТаблицаСоцНормы = РегистрыСведений.ЗначенияСоцНормативов.СрезПоследних(пПериод,ОтборЗначениеСоцНормы);
		Если ТаблицаСоцНормы.Количество() > 0 Тогда 
			НайденаяСтрокаСоцНормы = ТаблицаСоцНормы.Найти(пКоличествоПрописанных,"КолЧеловек");
			Если НайденаяСтрокаСоцНормы = Неопределено Тогда 
				ТаблицаСоцНормы.Сортировать("КолЧеловек Убыв");
				Для Каждого СтрокаСоцНормы Из ТаблицаСоцНормы Цикл
					Строка = ТаблицаЗначенийСоцНорм.Добавить(); 
					Строка.Тариф = СтрокаУслугиАбонента.Тариф;
					Строка.Значение = СтрокаСоцНормы.ЗначениеНорм;
					Прервать;
				КонецЦикла;
			Иначе
				Строка = ТаблицаЗначенийСоцНорм.Добавить(); 
				Строка.Тариф = СтрокаУслугиАбонента.Тариф;
				Строка.Значение = НайденаяСтрокаСоцНормы.ЗначениеНорм;  	
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаЗначенийСоцНорм;	
	
КонецФункции

// Функция получает действующие льготы абонента.
Функция ПолучитьДействующиеЛьготыАбонента(пАбонент, пПроживаниеЖильцов, пПериод) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИспользованиеЛьготСрезПоследних.Жилец,
	                      |	ИспользованиеЛьготСрезПоследних.Льгота,
	                      |	ИспользованиеЛьготСрезПоследних.ВидУслуги,
	                      |	ИспользованиеЛьготСрезПоследних.Состояние,
	                      |	ИспользованиеЛьготСрезПоследних.ДляРасчета,
	                      |	ИспользованиеЛьготСрезПоследних.ВыбранаАбонентом
	                      |ИЗ
	                      |	РегистрСведений.ИспользованиеЛьгот.СрезПоследних(&Период, Жилец.Владелец = &Абонент) КАК ИспользованиеЛьготСрезПоследних");
	Запрос.УстановитьПараметр("Период", пПериод);
	Запрос.УстановитьПараметр("Абонент", пАбонент);
	
	тзЛьготыАбонента = Запрос.Выполнить().Выгрузить();
	// Удаляем отмененные льготы и льготы не для расчета
	Индекс = тзЛьготыАбонента.Количество() - 1; 
	Пока Индекс >= 0 Цикл 
		Если тзЛьготыАбонента[Индекс].Состояние = Перечисления.СостояниеЛьгот.Отменена
			ИЛИ НЕ тзЛьготыАбонента[Индекс].ДляРасчета Тогда 
				тзЛьготыАбонента.Удалить(Индекс); 
		КонецЕсли; 	
		Индекс = Индекс - 1; 
	КонецЦикла;
	
	// Удаляем льготы незарегестрированных жильцов
	Индекс = тзЛьготыАбонента.Количество() - 1; 
	Пока Индекс >= 0 Цикл 
		НаиденыйЖилец = пПроживаниеЖильцов.Найти(тзЛьготыАбонента[Индекс].Жилец,"Жилец");
		Если НаиденыйЖилец = Неопределено Тогда
			тзЛьготыАбонента.Удалить(Индекс); 
		КонецЕсли; 	
		Индекс = Индекс - 1; 
	КонецЦикла;

	Возврат тзЛьготыАбонента;
	
КонецФункции

#КонецОбласти
