#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СудебныеРаботы.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ПользователиКлиентСервер.АвторизованныйПользователь());
	ИсполнительноеПроизводство.Параметры.УстановитьЗначениеПараметра("ТекПользователь", ПользователиКлиентСервер.АвторизованныйПользователь());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСудебныеРаботы

&НаКлиенте
Процедура СудебныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.СудебныеРаботы.ТекущиеДанные;
	
	ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", Новый Структура("Ключ", ТекСтрока.Задача)); 
КонецПроцедуры

&НаКлиенте
Процедура СудебныеРаботыПриАктивизацииСтроки(Элемент)
	ОтборПредЭтапы = ПредыдущиеЭтапыСудебнойЗадачи.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	ПолеКомпановки = Новый ПолеКомпоновкиДанных("Ссылка.стартоваяЗадача");
	ТекСтрока = Элементы.СудебныеРаботы.ТекущиеДанные;
	
	Для каждого ТекОтбор Из ОтборПредЭтапы Цикл
		Если ТекОтбор.ЛевоеЗначение = ПолеКомпановки Тогда
			ТекОтбор.ПравоеЗначение = ?(ТекСтрока = Неопределено, Неопределено, ТекСтрока.СтартоваяЗадача);
		КонецЕсли;
	КонецЦикла;
	Элементы.ПредыдущиеЭтапыСудебнойЗадачи.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредыдущиеЭтапыСудебнойЗадачи

&НаКлиенте
Процедура ПредыдущиеЭтапыСудебнойЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ПредыдущиеЭтапыСудебнойЗадачи.ТекущиеДанные;
	
	ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", Новый Структура("Ключ", ТекСтрока.Ссылка)); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредыдущиеЭтапыСудебнойЗадачи

&НаКлиенте
Процедура ИсполнительноеПроизводствоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ИсполнительноеПроизводство.ТекущиеДанные;
	
	ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", Новый Структура("Ключ", ТекСтрока.Задача)); 
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительноеПроизводствоПриАктивизацииСтроки(Элемент)
	ОтборПредЭтапы = ПредыдущиеЭтапыИсполнительноеПроизводство.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	ПолеКомпановки = Новый ПолеКомпоновкиДанных("Ссылка.СтартоваяЗадача");
	ТекСтрока = Элементы.ИсполнительноеПроизводство.ТекущиеДанные;
	
	Для каждого ТекОтбор Из ОтборПредЭтапы Цикл
		Если ТекОтбор.ЛевоеЗначение = ПолеКомпановки Тогда
			ТекОтбор.ПравоеЗначение = ?(ТекСтрока = Неопределено, Неопределено, ТекСтрока.СтартоваяЗадача);
		КонецЕсли;
	КонецЦикла;
	Элементы.ПредыдущиеЭтапыИсполнительноеПроизводство.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредыдущиеЭтапыИсполнительноеПроизводство

&НаКлиенте
Процедура ПредыдущиеЭтапыИсполнительноеПроизводствоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ПредыдущиеЭтапыИсполнительноеПроизводство.ТекущиеДанные;
	
	ОткрытьФорму("Задача.энргЗадачаПИД.ФормаОбъекта", Новый Структура("Ключ", ТекСтрока.Ссылка));
КонецПроцедуры

#КонецОбласти