#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	ОписаниеВарианта 								= ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОтчетПоПоказаниям");
	ОписаниеВарианта.Описание 						= НСтр("ru= 'Отчет по показаниям'"); 
	ОписаниеВарианта.Включен 						= ПолучитьФункциональнуюОпцию("бестУчетНезависимыйСбыт");
	ОписаниеВарианта.ПоказыватьВПодменюВариантов 	= ПолучитьФункциональнуюОпцию("бестУчетНезависимыйСбыт");
КонецПроцедуры

Процедура ПриОпределенииНастроек(Настройки) Экспорт
	Настройки.НастроитьВариантыОтчета = Истина;
КонецПроцедуры

#КонецОбласти

#КонецЕсли