#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		ВыбранноеЗначение.Свойство("СсылкаНаОбъект", Объект.СсылкаНаОбъект);
		ВыбранноеЗначение.Свойство("Представление", Объект.Наименование);
		ВыбранноеЗначение.Свойство("Класс", Объект.Класс);
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Модифицированность = Истина;
	ОткрытьФорму("Справочник.макрОбъектыКонфигурации.Форма.ФормаВыбораСсылкаНаОбъектУправляемая", ,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
