////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов" (сервер, переопределяемый).
// 
// Выполняется на сервере, изменяется под специфику прикладной конфигурации,
// но предназначен для использования только данной подсистемой.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна панель отчетов.
// В Разделы необходимо добавить метаданные тех подсистем 1го уровня,
// в которых размещены команды вызова панелей отчетов.
//
// Параметры:
//   Разделы - СписокЗначений - Разделы в которые выведена команды открытия панели отчетов.
//      * Значение - ОбъектМетаданных: Подсистема
//                 - Строка - подсистема раздела глобального командного интерфейса,
//                   либо ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы для начальной страницы.
//       * Представление - Строка - Заголовок панели отчетов этого раздела.
//
// Пример:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.бестЮридическиеЛица,
	НСтр("ru= 'Отчеты по ЮЛ'"));
	
КонецПроцедуры

// Определяет объекты, в которых доступна панель отчетов.
// В Объекты необходимо добавить объекты метаданных тех подсистем 1го уровня,
// в которых размещены команды вызова панелей отчетов.
//
// Параметры:
//	 Объекты	-	Массив из ОбъектМетаданных	-	Объекты в которых выведены команды открытия панели отчетов.
//
// Пример:
//	 Объекты.Добавить(Метаданные.Документы.энргЗагрузкаДанныхИзВнешнихСистем);
//
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт 
	
	Объекты.Добавить(Метаданные.Документы.бестАктПринятияПрибораУчетаККоммерческомуУчету);
	Объекты.Добавить(Метаданные.Документы.бестЗаявлениеНаЗаключениеДоговора);
	Объекты.Добавить(Метаданные.Документы.бестВводНачальныхОстатковЮридическихЛиц);
	Объекты.Добавить(Метаданные.Документы.бестИзменениеСобственникаОбъектаРасчета);
	Объекты.Добавить(Метаданные.Документы.бестИзменениеСудсидииЖильцам);
	Объекты.Добавить(Метаданные.Документы.бестИзменениеТемпературногоГрафикаОбъектов);
	Объекты.Добавить(Метаданные.Документы.бестИзменениеТиповСхемГВСМКД);
	Объекты.Добавить(Метаданные.Документы.бестИзмененияОкружающейСреды);
	Объекты.Добавить(Метаданные.Документы.бестИзменитьФормуУправленияМКД);
	Объекты.Добавить(Метаданные.Документы.бестНачислениеНП);
	Объекты.Добавить(Метаданные.Документы.бестНачислениеПоДолевымСхемам);
	Объекты.Добавить(Метаданные.Документы.бестОбращения);
	Объекты.Добавить(Метаданные.Документы.бестОперацияСОбъектамиНП);
	Объекты.Добавить(Метаданные.Документы.бестОперацияСПриборомУчетаНП);
	Объекты.Добавить(Метаданные.Документы.бестОперацияСУслугамиНП);
	Объекты.Добавить(Метаданные.Документы.бестПерерасчетНП);
	Объекты.Добавить(Метаданные.Документы.бестПлатежноеПоручениеВходящееЮрЛица);
	Объекты.Добавить(Метаданные.Документы.бестРегистрацияНачисленияПИД);
	Объекты.Добавить(Метаданные.Документы.бестРегистрацияОбъемовПотребленияПриборовУчета);
	Объекты.Добавить(Метаданные.Документы.бестРегистрацияОбъемовПУМКД);
	Объекты.Добавить(Метаданные.Документы.бестРегистрацияПоказанийНП);
	Объекты.Добавить(Метаданные.Документы.бестРегистрацияПоказанийНПОбщий);
	Объекты.Добавить(Метаданные.Документы.бестСменаРабочегоПостановленияМКД);
	Объекты.Добавить(Метаданные.Документы.бестСуточнаяВедомость);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьГарантированныеОбъемыНП);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьГруппуПотребителейНП);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьЗначениеПлощадиНП);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьНагрузкуПоУслугам);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьПоказателиТемпературыВнутриПомещения);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьПотребителейГВС);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьСпособНачисленияПоНормативуНП);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьСреднемесячнуюТемпературу);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьТемпературуНаружногоВоздуха);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьТемпературыИсточника);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьФормулуРасчетаТочекУчетаНП);
	Объекты.Добавить(Метаданные.Документы.бестЗаключениеДоговоровСЮридическимиЛицами);
	Объекты.Добавить(Метаданные.Документы.бестИзменениеИндивидуальныхНастроекСезонности);
	Объекты.Добавить(Метаданные.Документы.бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети);
	Объекты.Добавить(Метаданные.Документы.бестСменаПоставщикаНП);
	Объекты.Добавить(Метаданные.Документы.бестДанныеДляРасчетаДоговорныхОбъемов);
	Объекты.Добавить(Метаданные.Документы.бестУстановитьДатуПоверкиПУ);
	Объекты.Добавить(Метаданные.Документы.бестЗагруженныеДанныеИзВнешнихИсточников);
	Объекты.Добавить(Метаданные.Документы.бестРегистрацияБездоговорногоБезучетногоПотребления);
	Объекты.Добавить(Метаданные.Документы.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены);
	Объекты.Добавить(Метаданные.Документы.бестИзменитьЧасыПиковойНагрузки);
	Объекты.Добавить(Метаданные.Документы.бестИзменитьПлановыеЧасыПиковойНагрузки);
	Объекты.Добавить(Метаданные.Документы.бестПрофильГарантирующегоПоставщика);
	Объекты.Добавить(Метаданные.Документы.бестНачислениеПоДолевымСхемамЭлектроэнергии);
	Объекты.Добавить(Метаданные.Документы.бестПлатежноеПоручениеВходящееЭЭЮрЛица);
	Объекты.Добавить(Метаданные.Документы.бестКорректировкаЗадолженности);
	Объекты.Добавить(Метаданные.Документы.бестСписаниеВосстановлениеЗадолженности);
	Объекты.Добавить(Метаданные.Документы.бестРегистрацияБанкротства);
	Объекты.Добавить(Метаданные.Документы.бестРеструктуризацияЗадолженности);

	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
//   В данной процедуре необходимо указать каким именно образом предопределенные варианты отчетов
//   будут регистрироваться в программе и показываться в панели отчетов.
//   НастройкиОтчета   = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.<ИмяОтчета>);
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.<ИмяОтчета>/Метаданные.Подсистемы.<ИмяПодсистемы>, Истина/Ложь);
//   ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.<ИмяОтчета>);
//
//   Данные функции получают соответственно настройки отчета и настройки варианта отчета следующей структуры:
//       * Включен - Булево -
//           Если Ложь, то вариант отчета не регистрируется в подсистеме.
//           Используется для удаления технических и контекстных вариантов отчетов из всех интерфейсов.
//           Эти варианты отчета по прежнему можно открывать в форме отчета программно при помощи
//           параметров открытия (см. справку по "Расширение управляемой формы для отчета.КлючВарианта").
//       * ВидимостьПоУмолчанию - Булево -
//           Если Ложь, то вариант отчета по умолчанию скрыт в панели отчетов.
//           Пользователь может "включить" его в режиме настройки панели отчетов
//           или открыть через форму "Все отчеты".
//       * Описание - Строка - Дополнительная информация по варианту отчета.
//           В панели отчетов выводится в качестве подсказки.
//           Должно расшифровывать для пользователя содержимое варианта отчета
//           и не должно дублировать наименование варианта отчета.
//           Используется при поиске.
//       * Размещение - Соответствие - Настройки размещения варианта отчета в разделах.
//           ** Ключ     - ОбъектМетаданных: Подсистема - Подсистема, в которой размещается отчет или вариант отчета.
//           ** Значение - Строка - Необязательный. Настройки размещения в подсистеме.
//               ""        - Выводить отчет в своей группе обычным шрифтом.
//               СВажный"  - Выводить отчет в своей группе жирным шрифтом.
//               ССмТакже" - Выводить отчет в группе "См. также".
//       * ФункциональныеОпции - Массив из Строка -
//            Имена функциональных опций варианта отчета.
//       * НастройкиДляПоиска - Структура - Дополнительные настройки для поиска этого варианта отчета.
//           Эти настройки необходимо задавать только если СКД не используется или используется не в полном объеме.
//           Например, СКД может использоваться только для параметризации и получения данных,
//           а вывод выполняться в фиксированный макет табличного документа.
//           ** НаименованияПолей - Строка - Имена полей варианта отчета. Разделитель имен: Символы.ПС.
//           ** НаименованияПараметровИОтборов - Строка - Имена настроек варианта отчета. Разделитель имен: Символы.ПС.
//       * ОпределитьНастройкиФормы - Булево - Отчет имеет программный интерфейс для тесной интеграции с формой отчета,
//           в том числе может переопределять некоторые настройки формы и подписываться на ее события.
//           Если Истина и отчет подключен к общей форме ФормаОтчета,
//           тогда в модуле объекта отчета следует определить процедуру по шаблону:
//               
//               // Настройки общей формы отчета подсистемы "Варианты отчетов".
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//               //       Неопределено когда вызов без контекста.
//               //   КлючВарианта - Строка, Неопределено - Имя предопределенного
//               //       или уникальный идентификатор пользовательского варианта отчета.
//               //       Неопределено когда вызов без контекста.
//               //   Настройки - Структура - см. возвращаемое значение
//               //       ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//               //
//               Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
//               	// Код процедуры.
//               КонецПроцедуры
//                
//   Отчет выступает в качестве контейнера вариантов.
//     Изменяя настройки отчета можно сразу изменять настройки всех его вариантов.
//     Однако, если явно получить настройки варианта отчета, то они станут самостоятельными,
//     т.е. более не будут наследовать изменения настроек от отчета. См. пример 3.
//   
//   Начальная настройка размещения отчетов по подсистемам зачитывается из метаданных,
//     ее дублирование в коде не требуется.
//   
//   Функциональные опции варианта объединяются с функциональными опциями этого отчета по следующим правилам:
//     (ФО1_Отчета ИЛИ ФО2_Отчета) И (ФО3_Варианта ИЛИ ФО4_Варианта).
//   Функциональные опции отчетов не зачитываются из метаданных,
//     они применяются на этапе использования подсистемы пользователем.
//   Через ОписаниеОтчета можно добавлять функциональные опции, которые будут соединяться по указанным выше правилам,
//     но надо помнить, что эти функциональные опции будут действовать только для предопределенных вариантов отчетов.
//   Для пользовательских вариантов отчета действуют только функциональные опции отчета
//     - они отключаются только с отключением всего отчета.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Пример:
//
//  (1) Добавить в подсистему вариант отчета.
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "ИмяВарианта1");
//	Вариант.Размещение.Вставить(Метаданные.Подсистемы.ИмяРаздела.Подсистемы.ИмяПодсистемы);
//
//  (2) Отключить вариант отчета.
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "ИмяВарианта1");
//	Вариант.Включен = Ложь;
//
//  (3) Отключить все варианты отчета, кроме требуемого.
//	Отчет = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	Отчет.Включен = Ложь;
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Отчет, "ИмяВарианта");
//	Вариант.Включен = Истина;
//
//  (4) Заполнить наименования полей, параметров и отборов:
//	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчетаБезСхемы, "");
//	Вариант.НастройкиДляПоиска.НаименованияПолей =
//		НСтр("ru = 'Контрагент
//		|Договор
//		|Ответственный
//		|Скидка
//		|Дата'");
//	Вариант.НастройкиДляПоиска.НаименованияПараметровИОтборов =
//		НСтр("ru = 'Период
//		|Ответственный
//		|Контрагент
//		|Договор'");
//
//  (5) Переключить режим вывода в панели отчетов:
//  (5.1) По отчетам:
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.ИмяОтчета, "ПоОтчетам");
//  (5.2) По вариантам:
//	Отчет = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Отчет, "ПоВариантам");
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт

	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестАктСверки);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестЖурналУчетаГрафиковПогашения); 
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетДляНРИЦПоЛьготникам);   
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетДляНРИЦПоСубсидиям);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоГВС);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестПочасовоеПотребление);
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестАнализПлатежныхДокументовЭЭ);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестДоговорныеОбъемы);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестДоговорыИОбъекты); 
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестЗагруженнаяОплата);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестИнвентаризационнаяВедомостьПоЗадолженности);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестИстечениеСроковПоверкиИК);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестКоличествоПотребителей);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестНагрузки);     
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестНачисленияОбъемовПоНагрузке);
    // ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестНачисленияПоОтоплению);   
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестНачисленияПоЮрЛицам);  
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестНезагруженнаяОплата);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестНезагруженныеДанные);   
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОплатаПоОрганизациям);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоДебиторскойЗадолженностиПоПериодам);  
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоЗарегистрированнымАктамЮЛ);  
    ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоНачислениям);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоНачислениямФизЛица);  
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоНачислениямФизЛицаСтарыйЛС);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоНачислениямЮрЛиц);  
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоПломбамЮЛ); 
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоСтроениям);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоСудебнойРаботе);
    ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестПечатьПриложенийКДоговору);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестПодключениеОтключениеУслугПоКонтролерам);  
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестПоказанияПриборовУчета);   
   	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестПредоплаты);   
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестРеестрДебиторскойЗадолженности);
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестРеестрДебиторскойЗадолженностиКраткий); 
	// ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестРеестрПотребителей);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестСанкции);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестСведенияОДДС); 
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестСводКнигиПокупок);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестСводКнигиПродаж); 
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестСправкаПоступлений);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестСхемаСети);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.бестОтчетПоПоказаниям); 

КонецПроцедуры

// Содержит описания изменений имен вариантов отчетов. Используется
// при обновлении информационной базы, в целях контроля ссылочной целостности
// и для сохранения настроек варианта, сделанных администратором.
// В Изменения необходимо добавить описания изменений имен вариантов
// отчетов, подключенных к подсистеме.
// Старое имя варианта резервируется и не может быть использовано в дальнейшем.
// Если изменений было несколько, то каждое изменение необходимо зарегистрировать,
// указывая в актуальном имени варианта последнее (текущее) имя варианта отчета.
// Поскольку имена вариантов отчетов не выводятся в пользовательском интерфейсе,
// то рекомендуется задавать их таким образом, что бы затем не менять.
//
// Параметры:
//   Изменения - ТаблицаЗначений - Таблица изменений имен вариантов. Колонки:
//       * Отчет					-	ОбъектМетаданных	-	метаданные отчета, в схеме которого изменилось имя варианта.
//       * СтароеИмяВарианта		-	Строка				-	старое имя варианта, до изменения.
//       * АктуальноеИмяВарианта	-	Строка				-	текущее (последнее актуальное) имя варианта.
//
// Пример:
//	Изменение = Изменения.Добавить();
//	Изменение.Отчет = Метаданные.Отчеты.<ИмяОтчета>;
//	Изменение.СтароеИмяВарианта = "<СтароеИмяВарианта>";
//	Изменение.АктуальноеИмяВарианта = "<АктуальноеИмяВарианта>";
//
Процедура ЗарегистрироватьИзмененияКлючейВариантовОтчетов(Изменения) Экспорт
	
КонецПроцедуры

// Глобальные настройки, применяемые как умолчания для объектов подсистемы.
//
// Параметры:
//   Настройки - Коллекция настроек подсистемы. Реквизиты:
//       * ВыводитьОтчетыВместоВариантов - Булево - Умолчание для вывода гиперссылок в панели отчетов:
//           - Истина - Варианты отчетов по умолчанию скрыты, а отчеты включены и видимы.
//           - Ложь   - Значение по умолчанию. Варианты отчетов по умолчанию видимы, а отчеты отключены.
//       * ВыводитьОписания - Булево - Умолчание для вывода описаний в панели отчетов:
//           - Истина - Значение по умолчанию. Выводить описания в виде подписей под гиперссылками вариантов
//               (режим чтения описаний).
//           - Ложь   - Выводить описания в виде всплывающих подсказок
//               (как раньше).
//       * Поиск - Структура - Настройки поиска вариантов отчетов.
//           * ПодсказкаВвода - Строка - Текст подсказки выводится в поле поиска когда поиск не задан.
//               В качестве примера рекомендуется указывать часто используемые термины прикладной конфигурации.
//       * ДругиеОтчеты - Структура - Настройки формы "Другие отчеты":
//           * ЗакрыватьПослеВыбора - Булево - Закрывать ли форму после выбора гиперссылки отчета.
//               - Истина - Значение по умолчанию. Закрывать "Другие отчеты" после выбора.
//               - Ложь   - Не закрывать.
//           * ПоказыватьФлажок - Булево - Показывать ли флажок ЗакрыватьПослеВыбора.
//               - Истина - Показывать флажок "Закрывать это окно после перехода к другому отчету".
//               - Ложь   - Значение по умолчанию. Не показывать флажок.
//
// Пример:
//	Настройки.Поиск.ПодсказкаВвода = НСтр("ru = 'Например, себестоимость'");
//	Настройки.ДругиеОтчеты.ЗакрыватьПослеВыбора = Ложь;
//	Настройки.ДругиеОтчеты.ПоказыватьФлажок = Истина;
//
Процедура ОпределитьГлобальныеНастройки(Настройки) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДвиженияДокумента

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандуДвиженияДокумента(КомандыОтчетов) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ДвиженияДокумента) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Идентификатор = Метаданные.Отчеты.ДвиженияДокумента.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Движения документа'");
		КомандаОтчет.Порядок       = 50;
		//КомандаОтчет.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Одиночный;
		//КомандаОтчет.МестоРазмещенияКоманды = "ПодменюОтчетыСмТакже";				
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СтруктураПодчиненности

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.СвязанныеДокументы) Тогда
		
		КомандаОтчет 					= КомандыОтчетов.Добавить();
		КомандаОтчет.Обработчик 		= "МенюОтчетыБиллингКлиент.СтруктураПодчиненности";
		КомандаОтчет.Идентификатор 		= Метаданные.ОбщиеФормы.СвязанныеДокументы.ПолноеИмя();
		КомандаОтчет.Представление 		= НСтр("ru = 'Структура подчиненности'");
		КомандаОтчет.Порядок       		= 50;
		КомандаОтчет.Картинка      		= БиблиотекаКартинок.СтруктураПодчиненности;
		КомандаОтчет.СочетаниеКлавиш 	= Новый СочетаниеКлавиш(Клавиша.S, Ложь, Истина, Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьВажностьВариантаОтчета(ОписаниеВарианта, Важность, Подсистема = Неопределено) Экспорт
	
	Если ВажностьУказанаВерно(Важность) Тогда
		Размещение = ОписаниеВарианта.Размещение.Получить(Подсистема);
		
		Если Не Размещение = Неопределено Тогда
			ОписаниеВарианта.Размещение.Вставить(Подсистема, Важность);
		Иначе
			Для Каждого Размещение Из ОписаниеВарианта.Размещение Цикл 
				ОписаниеВарианта.Размещение.Вставить(Размещение.Ключ, Важность);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет строку на содержание параметров важности
//
// Параметры:
//  Важность   - (Строка)
//
// Возвращаемое значение: 
//  Булево   - Истина, если переданная строка равна одному из значений:
//               	|- ""        - Вывод отчета в своей группе обычным шрифтом.
//               	|- "Важный"  - Вывод отчета в своей группе жирным шрифтом.
//               	|- "СмТакже" - Вывод отчета в группе "См. также".
//             Ложь, в ином случае
//
Функция ВажностьУказанаВерно(Важность)
	
	Возврат ПустаяСтрока(Важность) Или Важность = "Важный" Или Важность = "СмТакже";
	
КонецФункции

#КонецОбласти