#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//КомандаОтчет.Идентификатор           			= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Порядок      						 = 50;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();
	//КомандаОтчет.Идентификатор         				= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	//КомандаОтчет.Порядок       						= 50;
	
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры

// Заполняет список команд создания на основании закрытие ЛС.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииОперацияСУслугами(КомандыСоздатьНаОсновании);  	
		
КонецФункции

// Заполняет список возможных операций формы списка.
// 
// Возвращаемое значение:
//   СписокЗначений.
//
Функция ЗаполнитьСписокВозможныхОперацийФормаСписка() Экспорт 
	СписокОпераций = Новый СписокЗначений;
	ДополнитьСписокВыбораДоступнымиВидамиОпераций(СписокОпераций);		

	Возврат СписокОпераций;
КонецФункции 

// Получает соотвествие видов операции и префиксов форм.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция СоотвествиеВидовОперацииИПрефиксовФорм() Экспорт	
	Соотвествие = Новый Соответствие;
	ДополнитьСоотвествиеВидовОперацииИПрефиксовФорм(Соотвествие);
	
	Возврат Соотвествие;	
КонецФункции

// Получает изменяемые параметры расчета.
//
// Параметры:
//  ДобавитьАбонента	-	Булево.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета(ДобавитьАбонента = Истина) Экспорт 
	   
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;
	
	ИзменяемыеПараметры 		= Новый Массив;	
	СтрокаРесурсов = 
	"УслугаПодключена,ПриборВведен,ПриборУчета,
	|ДатаСостоянияПрибора,НаправлениеИспользованияТУ,КоэффициентПУ,Поставщик,
	|НетВозможностьУстановкиПУ,СоставнаяУслуга,ИспользоватьДиаметрСечения,
	|ДиаметрСечения,Техническая,РасчетТолькоПоПоказаниям,ТочкаУчетаРодитель,ВидБлагоустройства,
	|ТарифнаяГруппа,Плательщик,ДатаПоверки,ДатаРегистрацииПоверки,ПотериОбъем,ПотериПроцент,
	|КоличествоПрописанных,КоличествоПроживающих,КоличествоСобственников,КоличествоКомнат,КоличествоЖильцов,ДоговорЗаключенДоТП";
	
	Если ДобавитьАбонента ТОгда
		СтрокаРесурсов = СтрокаРесурсов + ",Абонент";	
	КонецЕсли;
	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,НоваяТочка,Ресурсы", "ТочкаУчета,Услуга", Истина, СтрокаРесурсов));
	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги, ИзменяемыеПараметры);
	     	
	ИзменяемыеПараметры 		= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","УслугаПодключена,ПериодНачисленияВыводаПрибора"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры 		= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","УслугаОграничена"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры 		= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета,Услуга" ,"УслугаОграничена"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления, ИзменяемыеПараметры);
			
	Возврат ИзменяемыеПараметрыРасчета;	
	
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт 
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовПодключениеУслуги";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодам());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());	
	КонецЦикла;	
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

// Получает данные изменения состава шкал.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеИзмененияСоставаШкал(Схема,ВыбираемыеТаблицы) Экспорт
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеСоставаШкалПодключениеУслуги";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияСоставаШкал());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
КонецПроцедуры

// Получает данные изменения измерителей.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеИзмененияИзмерителей(Схема,ВыбираемыеТаблицы) Экспорт
	
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеИзмеретелйПодключениеУслуги";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияИзмерителей());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла; 
	
КонецПроцедуры

// Получает данные изменения площади.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеИзмененияПлощади(Схема,ВыбираемыеТаблицы) Экспорт 
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеПлощадиПодключениеУслуги";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияПлощади());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет схему приборов учета для передачи.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуПриборыУчетаДляПередачи(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт
	ЭтоНовыйПакет 					= Истина;
	
	Если Схема = Неопределено Тогда
		Схема 						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	ИначеЕсли НЕ ПустаяСтрока(ТаблицаДляПомещения) Тогда
		Для Каждого ПакетСхемы Из Схема.ПакетЗапросов Цикл
			Если ВРег(ПакетСхемы.ТаблицаДляПомещения) = ВРег(ТаблицаДляПомещения) Тогда
				Пакет 				= ПакетСхемы;
				ЭтоНовыйПакет 		= Ложь;
				Прервать;
			КонецЕсли;			
		КонецЦикла;		
	Иначе	
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Если ЭтоНовыйПакет Тогда
		Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляПередачи());
		Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;;
	Иначе
		врСхема 					= Новый СхемаЗапроса;
		врПакет 					= врСхема.ПакетЗапросов[0];
		врПакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляПередачи());
		Для Каждого врОператор из врПакет.Операторы Цикл
			НовыйПакет 				= Пакет.Операторы.Добавить(врОператор);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

// Заполняет схему приборов учета для архивации.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуПриборыУчетаДляАрхивации(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт
	ЭтоНовыйПакет 					= Истина;
	
	Если Схема = Неопределено Тогда
		Схема 						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	ИначеЕсли НЕ ПустаяСтрока(ТаблицаДляПомещения) Тогда
		
		Для Каждого ПакетСхемы Из Схема.ПакетЗапросов Цикл
			Если ВРег(ПакетСхемы.ТаблицаДляПомещения) = ВРег(ТаблицаДляПомещения) Тогда
				Пакет 				= ПакетСхемы;
				ЭтоНовыйПакет 		= Ложь;
				Прервать;
			КонецЕсли;			
		КонецЦикла;
		
		Если ЭтоНовыйПакет Тогда
			Пакет 					= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
	Иначе	
		Пакет 						= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Если ЭтоНовыйПакет Тогда
		Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляАрхивации());
		Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;;
	Иначе
		врСхема 					= Новый СхемаЗапроса;
		врПакет 					= врСхема.ПакетЗапросов[0];
		врПакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляАрхивации());
		Для Каждого врОператор из врПакет.Операторы Цикл
			НовыйПакет 				= Пакет.Операторы.Добавить(врОператор);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ключ, "ВидОперации");// Параметры.ключ.Видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСУслугами",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСУслугами",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСУслугами",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОперацияСУслугами");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса  	= Новый Структура;
	Схема 				= Неопределено;
	
	ДобавитьТекстЗапросаАбонентыПомещений(Схема,Регистры);
	ДобавитьТекстЗапросаВладельцыТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаРодителейТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаАктивностьТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаУслугиТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаПриборыТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУ(Схема,Регистры);
	ДобавитьТекстЗапросаСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаНаправлениеИспользованияТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаЗначенияИзмерителейТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаДиаметрСеченияТочекУчета(Схема,Регистры);
	ДобавитьТекстЗапросаСостояниеПриборовУчетаАбонента(Схема,Регистры);
	ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема,Регистры);
	ДобавитьТекстЗапросаВыводыПУБезПоказаний(Схема,Регистры);
	ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаВидыДифференцированностиПриборовУчета(Схема,Регистры);
	ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема,Регистры);
	ДобавитьТекстЗапросаКоэффциентыПриборовУчета(Схема,Регистры);
	ДобавитьТекстЗапросаВидБлагоустройствАбонента(Схема, Регистры);
	ДобавитьТекстЗапросаГруппыПотребителейАбонентов(Схема, Регистры);
	ДобавитьТекстЗапросаПоставщикиУслугАбонента(Схема, Регистры);
	ДобавитьТекстЗапросаПлательщикиУслугАбонента(Схема, Регистры);
	ДобавитьТекстЗапросаЗначенияПлощадей(Схема, Регистры);
	ДобавитьТекстЗапросаКоличествоКомнат(Схема, Регистры);
	ДобавитьТекстЗапросаНазначенияПриборовУчета(Схема, Регистры);

	
	
	ДобавитьТекстЗапросаСостояниеВидовПотерьТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаЗначенияПотерьТочекУчета(Схема, Регистры);
	
	ДобавитьТекстЗапросаТУНаСтруктуреСети(Схема, Регистры);
	
	ДобавитьТекстЗапросаТочкиПоставкиТочекУчета(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыПроведения = ДополнительныеСвойства.ПараметрыПроведения;
	ПараметрыЗапроса.Вставить("ПериодРегистрации",				Новый Граница(ПараметрыПроведения.ПериодРегистрации, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
	ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции мкд закрыт'");
	ТекстСообщенияЛицевойСчетЗакрыт 			= НСтр("ru = 'На дату операции лицевой счет закрыт'");
	ДанныеСтроения 								= ДополнительныеСвойства.ДанныеСтроения;
	
	ПараметрыЗапроса 							= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 								ДокументСсылка);
	ПараметрыЗапроса.Вставить("ЧастныйСектор",								ДанныеСтроения.ЧастныйСектор);
	ПараметрыЗапроса.Вставить("Строение", 									ДанныеСтроения.Строение);
	ПараметрыЗапроса.Вставить("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	ПараметрыЗапроса.Вставить("ТекстСообщенияЛицевойСчетЗакрыт", 			ТекстСообщенияЛицевойСчетЗакрыт);
		
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

Функция ДанныеНаГраницуДокумента(ДокументОбъект) Экспорт 
	Схема 				= Новый СхемаЗапроса;	
	ПараметрыОтбора 	= Новый Структура;
	ПараметрыЗапроса 	= Новый Структура;
	
	ИнициализироватьПараметрыОтбораДанныхНаГраницу(ПараметрыОтбора);
	ИнициализироватьПараметрыЗапросаДанныхНаГраницу(ДокументОбъект, ПараметрыЗапроса);
	
	ЗаполнитьНачальнуюСхемуДанныхНаГраницу(Схема);	
	энргРаботаСЛицевымСчетомСервер.ЗаполнитьСхемуДанныхНаГраницуВремени(Схема, ПараметрыОтбора); 
	СоединитьСхемуДанныхНаГраницу(Схема);
	СоединитьСхемуДанныхНаГраницуПотери(Схема);
	СоединитьСхемуДанныхНаГраницуЗначениеПлощадей(Схема);
	СоединитьСхемуДанныхНаГраницуЗначенияИзмерителей(Схема);
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса);
КонецФункции 

Функция ЕстьТочкиСОРП(Период, Организация, Район, КлючПомещения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние КАК Состояние,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП)";
	
	Запрос.УстановитьПараметр("КлючПомещения"	, КлючПомещения);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Район"			, Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерфейса_ДоступныеВидыОпераций

Процедура ДополнитьСписокВыбораДоступнымиВидамиОпераций(СписокОпераций)
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги	, "Подключение услуги");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги	, "Отключение услуги");
КонецПроцедуры

Процедура ДополнитьСоотвествиеВидовОперацииИПрефиксовФорм(Соотвествие) 
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги	, "ПодключениеУслуги");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги	, "ОтключениеУслуги");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления	, "ОтключениеУслуги");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления	, "ОтключениеУслуги");
КонецПроцедуры
	
#КонецОбласти

#Область РеализацияИнтерефейса_Проведение

Процедура ДобавитьТекстЗапросаАбонентыПомещений(Схема, Регистры)
	
	ИмяРегистра = "энргАбонентыПомещений";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса( 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.Услуга КАК Услуга,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги)");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса( 
	"ВЫБРАТЬ
	|	энргАбонентыПомещенийСрезПоследних.Услуга КАК Услуга,
	|	энргАбонентыПомещенийСрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ПодключенныеУслуги
	|ИЗ
	|	РегистрСведений.энргАбонентыПомещений.СрезПоследних(
	|			&ПериодРегистрации,
	|			(Организация, Район, КлючПомещения) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.Район,
	|					ВТ.КлючПомещения
	|				ИЗ
	|					ВТ_ДанныеДокумента КАК ВТ)) КАК энргАбонентыПомещенийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргАбонентыПомещенийСрезПоследних.Услуга,
	|	энргАбонентыПомещенийСрезПоследних.Абонент");

	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса( 
	"ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Период КАК Период,
	|	ВТ_ДанныеДокумента.Организация КАК Организация,
	|	ВТ_ДанныеДокумента.Район КАК Район,
	|	ВТ_ДанныеДокумента.КлючПомещения КАК КлючПомещения,
	|	ВТ_ДанныеДокумента.Услуга КАК Услуга,
	|	ВТ_ДанныеДокумента.Абонент КАК Абонент,
	|	ВТ_ДанныеДокумента.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_ДанныеДокумента.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодключенныеУслуги КАК ВТ_ПодключенныеУслуги
	|		ПО ВТ_ДанныеДокумента.Абонент = ВТ_ПодключенныеУслуги.Абонент
	|			И ВТ_ДанныеДокумента.Услуга = ВТ_ПодключенныеУслуги.Услуга
	|ГДЕ
	|	ВТ_ПодключенныеУслуги.Услуга ЕСТЬ NULL");		
			
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВладельцыТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргВладельцыТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	Шапка.КлючПомещения КАК АбонентВладелец,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаАктивностьТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргАктивностьТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена) КАК Состояние,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена),
	|	Шапка.Дата,
	|	Шапка.ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП),
	|	Шапка.Дата,
	|	Шапка.ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаУслугиТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргУслугиТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.Услуга КАК Услуга,
	|	ТаблицаТочек.Техническая КАК Техническая,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборыТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.ПриборУчета КАК ПриборУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|			И (НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУ(Схема, Регистры)
	
	ИмяРегистра = "энргТехническаяВозможностьУстановкиПУ";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочек.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргСвойствоРасчетТолькоПоПоказаниямТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочек.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНаправлениеИспользованияТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНаправлениеИспользованияТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗначенияИзмерителейТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргЗначенияИзмерителейТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
		
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаЗначенияИзмерителей.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТаблицаЗначенияИзмерителей.Значение КАК Значение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Ссылка КАК Регистратор,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочек.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ТаблицаТочек.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|			ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (ТаблицаТочек.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ЗначенияИзмерителей КАК ТаблицаЗначенияИзмерителей
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаЗначенияИзмерителей.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаЗначенияИзмерителей.IDСтроки
	|			И (ТаблицаЗначенияИзмерителей.Ссылка В (&мДокументы))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДиаметрСеченияТочекУчета(Схема, Регистры) 
	
	ИмяРегистра = "энргДиаметрСеченияТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.РассчитыватьПоДиаметруСечения КАК Использовать,
	|	ТаблицаТочек.ДиаметрСечения КАК ДиаметрСечения,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеПриборовУчетаАбонента(Схема, Регистры)
	
	ИмяРегистра 	= "энргСостояниеПриборовУчетаАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочки.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочки
	|		ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочки.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|			И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры) 
	
	ИмяРегистра 	= "энргПоказанияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	0 КАК Разделитель,
	|	ТаблицаПоказанияПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) КАК ПричинаОтклонения,
	|	ЛОЖЬ КАК КС,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка) КАК ИсточникПоказаний,
	|	ЛОЖЬ КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ТаблицаШкалы.IDСтроки КАК IDСтроки,
	|		ТаблицаШкалы.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|			ТаблицаТочки.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			Шапка.ПериодНачисления КАК ПериодНачисления,
	|			ТаблицаТочки.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргОперацияСУслугами КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочки
	|				ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (ТаблицаТочки.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|					И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ШкалыПриборовУчета КАК ТаблицаШкалы
	|			ПО ВложенныйЗапрос.Регистратор = ТаблицаШкалы.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалы.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ТаблицаПоказанияПриборовУчета.ТарифнаяЗона,
	|	0,
	|	ТаблицаПоказанияПриборовУчета.ТекущиеПоказания,
	|	ТаблицаПоказанияПриборовУчета.СостояниеПоказаний,
	|	ТаблицаПоказанияПриборовУчета.ПричинаОтклонения,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка),
	|	ТаблицаПоказанияПриборовУчета.Переворот,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ТаблицаПоказанияПриборовУчета.НомерСтроки,
	|	ВложенныйЗапрос.ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ТаблицаШкалы.IDСтроки КАК IDСтроки,
	|		ТаблицаШкалы.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|			ТаблицаТочки.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			Шапка.ПериодНачисления КАК ПериодНачисления,
	|			ТаблицаТочки.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргОперацияСУслугами КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочки
	|				ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (ТаблицаТочки.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)))
	|					И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ШкалыПриборовУчета КАК ТаблицаШкалы
	|			ПО ВложенныйЗапрос.Регистратор = ТаблицаШкалы.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалы.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВыводыПУБезПоказаний(Схема,Регистры)
	
	ИмяРегистра 	= "энргВыводыПУБезПоказаний";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ТаблицаШкалы.IDСтроки КАК IDСтроки,
	|		ТаблицаШкалы.Шкала КАК Шкала,
	|		ВложенныйЗапрос.Абонент КАК Абонент
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|			ТаблицаТочки.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор,
	|			Шапка.Абонент КАК Абонент
	|		ИЗ
	|			Документ.энргОперацияСУслугами КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочки
	|				ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (ТаблицаТочки.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги)))
	|					И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ШкалыПриборовУчета КАК ТаблицаШкалы
	|			ПО ВложенныйЗапрос.Регистратор = ТаблицаШкалы.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалы.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанияПриборовУчета.ТекущиеПоказания = 0)
	|			И (ТаблицаПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	энргКлючиПомещений.Помещение,
	|	ВложенныйЗапрос.Район,
	|	энргКлючиПомещений.Строение,
	|	ВложенныйЗапрос.КлючПомещения"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНомерПломбПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаНомераПломб.КлючСтроки КАК МестоУстановки,
	|	таблицаНомераПломб.НомерПломбы КАК НомерПломбы,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	таблицаНомераПломб.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	таблицаНомераПломб.ЛицоУстановившееПломбу КАК ЛицоУстановившееПломбу,
	|	таблицаНомераПломб.ВидПломбы КАК ВидПломбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табШапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.КлючПомещения,
	|		табИзмерители.ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.Ссылка,
	|		табИзмерители.IDСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА табШапка.ДатаФактическогоСобытия
	|				ИНАЧЕ табШапка.Дата
	|			КОНЕЦ КАК Период,
	|			табШапка.Организация КАК Организация,
	|			табШапка.Район КАК Район,
	|			табШапка.КлючПомещения КАК КлючПомещения,
	|			табШапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табШапка.Ссылка КАК Ссылка,
	|			табТочкиУчета.IDСтроки КАК IDСтроки
	|		ИЗ
	|			Документ.энргОперацияСУслугами КАК табШапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|				ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|					И (табШапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.Измерители КАК табИзмерители
	|			ПО ВложенныйЗапрос.Ссылка = табИзмерители.Ссылка
	|				И ВложенныйЗапрос.IDСтроки = табИзмерители.IDСтрокиТочкиУчета
	|				И (табИзмерители.Ссылка В (&мДокументы))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.НомераПломб КАК таблицаНомераПломб
	|		ПО ВложенныйЗапрос.Ссылка = таблицаНомераПломб.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаНомераПломб.IDСтрокиИзмерителя
	|			И (таблицаНомераПломб.Ссылка В (&мДокументы))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВидыДифференцированностиПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргВидыДифференцированностиПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ТаблицаШкалы.Шкала КАК Шкала,
	|	ВЫБОР
	|		КОГДА ТаблицаШкалы.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|		ИНАЧЕ ТаблицаШкалы.ВидДифференцированности
	|	КОНЕЦ КАК ВидДифференцированности,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочки.ПриборУчета КАК ПриборУчета,
	|		ТаблицаТочки.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочки
	|			ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (ТаблицаТочки.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|				И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ШкалыПриборовУчета КАК ТаблицаШкалы
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаШкалы.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаШкалы.IDСтрокиТочкиУчета";
	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема, Регистры)
	
	ИмяРегистра = "энргДатыПоверкиПрибораУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочек.ДатаПоверкиСчетчика КАК ДатаПоверки,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|			И (НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоэффциентыПриборовУчета(Схема, Регистры) 
	
	ИмяРегистра = "энргКоэффциентыПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочек.КоэффициентПУ КАК Коэффициент,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|			И (НЕ ТаблицаТочек.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВидБлагоустройствАбонента(Схема, Регистры) 
	
	ИмяРегистра = "энргВидБлагоустройствАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	табВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройства,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ВидыБлагоустройстваТарифныеКатегории КАК табВидыБлагоустройстваТарифныеКатегории
	|		ПО Шапка.Ссылка = табВидыБлагоустройстваТарифныеКатегории.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табВидыБлагоустройстваТарифныеКатегории.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаГруппыПотребителейАбонентов(Схема, Регистры) 
	
	ИмяРегистра = "энргГруппыПотребителейАбонентов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	табВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория КАК ГруппаПотребителей,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ВидыБлагоустройстваТарифныеКатегории КАК табВидыБлагоустройстваТарифныеКатегории
	|		ПО Шапка.Ссылка = табВидыБлагоустройстваТарифныеКатегории.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табВидыБлагоустройстваТарифныеКатегории.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоставщикиУслугАбонента(Схема, Регистры)
	
	ИмяРегистра = "энргПоставщикиУслугАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(табПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(табПоставщикиСоставныхУслуг.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.Услуга КАК Услуга,
	|		табТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		табТочкиУчета.Поставщик КАК Поставщик,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Регистратор
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоставщикиСоставныхУслуг КАК табПоставщикиСоставныхУслуг
	|		ПО ВложенныйЗапрос.Регистратор = табПоставщикиСоставныхУслуг.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоставщикиСоставныхУслуг.IDСтроки"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПлательщикиУслугАбонента(Схема, Регистры)
	
	ИмяРегистра = "энргПлательщикиУслугАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(табПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ВЫБОР
	|					КОГДА табПоставщикиСоставныхУслуг.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ВложенныйЗапрос.Абонент
	|					ИНАЧЕ табПоставщикиСоставныхУслуг.Плательщик
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВложенныйЗапрос.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|					ТОГДА ВложенныйЗапрос.Абонент
	|				ИНАЧЕ ВложенныйЗапрос.Плательщик
	|			КОНЕЦ
	|	КОНЕЦ КАК Плательщик,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.Услуга КАК Услуга,
	|		табТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		табТочкиУчета.Плательщик КАК Плательщик,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Регистратор,
	|		Шапка.Абонент КАК Абонент
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоставщикиСоставныхУслуг КАК табПоставщикиСоставныхУслуг
	|		ПО ВложенныйЗапрос.Регистратор = табПоставщикиСоставныхУслуг.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоставщикиСоставныхУслуг.IDСтроки"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаРодителейТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргРодительТочкиУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСУслугами.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСУслугами.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСУслугами.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСУслугами.Организация КАК Организация,
	|	энргОперацияСУслугами.Район КАК Район,
	|	энргОперацияСУслугами.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСУслугами.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСУслугами.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(ТаблицаРодителейТочекУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК РодительТочкиУчета
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК энргОперацияСУслугами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочекУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаРодителейТочекУчета
	|			ПО ТаблицаТочекУчета.Ссылка = ТаблицаРодителейТочекУчета.Ссылка
	|				И (ТаблицаРодителейТочекУчета.Ссылка В (&мДокументы))
	|				И ТаблицаТочекУчета.IDСтрокиРодитель = ТаблицаРодителейТочекУчета.IDСтроки
	|		ПО энргОперацияСУслугами.Ссылка = ТаблицаТочекУчета.Ссылка
	|			И (энргОперацияСУслугами.Ссылка В (&мДокументы))
	|			И (энргОперацияСУслугами.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги)))
	|			И (ТаблицаТочекУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаТочекУчета.ТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗначенияПлощадей(Схема, Регистры) 
	
	ИмяРегистра = "энргЗначенияПлощадей";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табЗначениеПлощадей.ВидПлощади КАК ВидПлощади,
	|	табЗначениеПлощадей.Значение КАК Площадь,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ЗначениеПлощадей КАК табЗначениеПлощадей
	|		ПО Шапка.Ссылка = табЗначениеПлощадей.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табЗначениеПлощадей.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВидовПотерьТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеВидовПотерь";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	энргОперацияСУслугамиПотери.ВидПотерь КАК ВидПотерь,
	|	ИСТИНА КАК Состояние
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСУслугами.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСУслугами.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСУслугами.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСУслугами.Организация КАК Организация,
	|		энргОперацияСУслугами.Район КАК Район,
	|		энргОперацияСУслугами.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСУслугамиТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСУслугами.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСУслугами.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		энргОперацияСУслугами.Ссылка КАК Ссылка,
	|		энргОперацияСУслугамиТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК энргОперацияСУслугами
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК энргОперацияСУслугамиТочкиУчета
	|			ПО энргОперацияСУслугами.Ссылка = энргОперацияСУслугамиТочкиУчета.Ссылка
	|				И (энргОперацияСУслугами.Ссылка В (&мДокументы))
	|				И (энргОперацияСУслугамиТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСУслугами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.Потери КАК энргОперацияСУслугамиПотери
	|		ПО ВложенныйЗапрос.Ссылка = энргОперацияСУслугамиПотери.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСУслугамиПотери.IDСтроки
	|			И (энргОперацияСУслугамиПотери.Ссылка В (&мДокументы))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗначенияПотерьТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргЗначенияПотерь";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	энргОперацияСУслугамиПотери.ВидПотерь КАК ВидПотерь,
	|	ВЫБОР
	|		КОГДА энргОперацияСУслугамиПотери.ФиксированныйОбъемПотерь > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособыРасчетаПотерь.ФиксированныйОбъем)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособыРасчетаПотерь.Процент)
	|	КОНЕЦ КАК СпособРасчетаПотерь,
	|	ВЫБОР
	|		КОГДА энргОперацияСУслугамиПотери.ФиксированныйОбъемПотерь > 0
	|			ТОГДА энргОперацияСУслугамиПотери.ФиксированныйОбъемПотерь
	|		ИНАЧЕ энргОперацияСУслугамиПотери.ПроцентПотерь
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСУслугами.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСУслугами.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСУслугами.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСУслугами.Организация КАК Организация,
	|		энргОперацияСУслугами.Район КАК Район,
	|		энргОперацияСУслугами.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСУслугамиТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСУслугами.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСУслугами.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		энргОперацияСУслугами.Ссылка КАК Ссылка,
	|		энргОперацияСУслугамиТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК энргОперацияСУслугами
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК энргОперацияСУслугамиТочкиУчета
	|			ПО энргОперацияСУслугами.Ссылка = энргОперацияСУслугамиТочкиУчета.Ссылка
	|				И (энргОперацияСУслугами.Ссылка В (&мДокументы))
	|				И (энргОперацияСУслугамиТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСУслугами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.Потери КАК энргОперацияСУслугамиПотери
	|		ПО ВложенныйЗапрос.Ссылка = энргОперацияСУслугамиПотери.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСУслугамиПотери.IDСтроки
	|			И (энргОперацияСУслугамиПотери.Ссылка В (&мДокументы))";
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТУНаСтруктуреСети(Схема, Регистры)
	
	ИмяРегистра = "бестТУНаСтруктуреСети";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаТочек.СтруктураСети КАК СтруктураСети
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТочкиПоставкиТочекУчета(Схема, Регистры)
	ИмяРегистра = "энргТочкиПоставкиТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиПоставок.ТочкаПоставки КАК ТочкаПоставки,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.Услуга КАК Услуга,
	|		табТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		табТочкиУчета.Поставщик КАК Поставщик,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.энргОперацияСУслугами КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиПоставок КАК табТочкиПоставок
	|		ПО ВложенныйЗапрос.Ссылка = табТочкиПоставок.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табТочкиПоставок.IDСтроки";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
		
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоКомнат(Схема, Регистры)
	ИмяРегистра = "энргКоличествоКомнат";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСУслугами.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСУслугами.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСУслугами.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСУслугами.Организация КАК Организация,
	|	энргОперацияСУслугами.Район КАК Район,
	|	энргОперацияСУслугами.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСУслугами.КоличествоКомнат КАК Количество,
	|	энргОперацияСУслугами.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСУслугами.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК энргОперацияСУслугами
	|ГДЕ
	|	энргОперацияСУслугами.Ссылка = &мДокументы
	|	И энргОперацияСУслугами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги)
	|	И энргОперацияСУслугами.КоличествоКомнат > 0";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
		
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНазначенияПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНазначенияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.НазначениеПУ КАК НазначениеПУ,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|			И (ТаблицаТочек.НазначениеПУ <> ЗНАЧЕНИЕ(Перечисление.энргНазначениеПУ.пустаяссылка))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО Шапка.КлючПомещения = энргКлючиПомещений.Ссылка";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

 #Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	НЕ &ЧастныйСектор
	|	И (НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргОперацияСУслугами.Ссылка КАК Ссылка,
	|	энргОперацияСУслугами.Организация КАК Организация,
	|	энргОперацияСУслугами.Район КАК Район,
	|	энргОперацияСУслугами.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА &ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
	|		ИНАЧЕ &Строение
	|	КОНЕЦ КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСУслугами.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСУслугами.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСУслугами.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргОперацияСУслугами КАК энргОперацияСУслугами
	|ГДЕ
	|	энргОперацияСУслугами.Ссылка В(&мДокументы)
	|	И энргОперацияСУслугами.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,Абонент","Организация","Район","Абонент")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(Схема,ПараметрыСостоянияМКД,"СостояниеЛицевогоСчета");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияЛицевойСчетЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеЛицевогоСчета КАК СостояниеЛицевогоСчета
	|		ПО ПараметрыКонтроля.Организация = СостояниеЛицевогоСчета.Организация
	|			И ПараметрыКонтроля.Район = СостояниеЛицевогоСчета.Район
	|			И ПараметрыКонтроля.Абонент = СостояниеЛицевогоСчета.Абонент
	|ГДЕ
	|	НЕ ПараметрыКонтроля.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|	И (НЕ ЕСТЬNULL(СостояниеЛицевогоСчета.Состояние, ЛОЖЬ)
	|			ИЛИ ПараметрыКонтроля.Период < ЕСТЬNULL(СостояниеЛицевогоСчета.Период, ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеЛС";
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_ДанныеНаГраницуДокумента

Процедура ЗаполнитьНачальнуюСхемуДанныхНаГраницу(Схема)
	НачальныйТекстЗапроса =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&КлючПомещения КАК КлючПомещения,
	|	&Абонент КАК Абонент,
	|	ДанныеУслуги.Услуга КАК Услуга,
	|	ДанныеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеУслуги.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	&ДанныеУслуги КАК ДанныеУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУслуги.Организация КАК Организация,
	|	ДанныеУслуги.Район КАК Район,
	|	ДанныеУслуги.КлючПомещения КАК КлючПомещения,
	|	ДанныеУслуги.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА энргВидыУслугСоставляющиеУслуг.Услуга ЕСТЬ NULL
	|			ТОГДА ДанныеУслуги.Услуга
	|		ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ДанныеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеУслуги.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ УслугиДействующихТочек
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ДанныеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ДанныеУслуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДействующихТочек.Организация КАК Организация,
	|	УслугиДействующихТочек.Район КАК Район,
	|	УслугиДействующихТочек.КлючПомещения КАК КлючПомещения,
	|	УслугиДействующихТочек.Абонент КАК Абонент,
	|	УслугиДействующихТочек.Услуга КАК Услуга,
	|	УслугиДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|	УслугиДействующихТочек.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ДействующиеТочки
	|ИЗ
	|	ВТ_ДанныеДокумента КАК УслугиДействующихТочек";
	
	Схема.УстановитьТекстЗапроса(НачальныйТекстЗапроса);	
КонецПроцедуры

Процедура СоединитьСхемуДанныхНаГраницу(Схема)	
	Шаблон = 
	"ВЫБРАТЬ
	|	УслугиДействующихТочек.Организация КАК Организация,
	|	УслугиДействующихТочек.Район КАК Район,
	|	УслугиДействующихТочек.КлючПомещения КАК КлючПомещения,
	|	УслугиДействующихТочек.Абонент КАК Абонент,
	|	УслугиДействующихТочек.Услуга КАК Услуга,
	|	УслугиДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|	УслугиДействующихТочек.ПриборУчета КАК ПриборУчета,
	|	%1
	|ИЗ
	|	УслугиДействующихТочек КАК УслугиДействующихТочек
	|		%2";
	
	Результат 		= энргРаботаСЛицевымСчетомСервер.ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницу(Схема, Шаблон);
	ТекстСоединений = СтрШаблон(Шаблон, СтрСоединить(Результат.ВыбираемыеПоля, ","), СтрСоединить(Результат.МассивСоединений, Символы.ПС));
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстСоединений);
КонецПроцедуры

Процедура СоединитьСхемуДанныхНаГраницуПотери(Схема)	
	Шаблон = 
	"ВЫБРАТЬ
	|	УслугиДействующихТочек.Организация КАК Организация,
	|	УслугиДействующихТочек.Район КАК Район,
	|	УслугиДействующихТочек.КлючПомещения КАК КлючПомещения,
	|	УслугиДействующихТочек.Абонент КАК Абонент,
	|	УслугиДействующихТочек.Услуга КАК Услуга,
	|	УслугиДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|	УслугиДействующихТочек.ПриборУчета КАК ПриборУчета,
	|	%1
	|ИЗ
	|	УслугиДействующихТочек КАК УслугиДействующихТочек
	|		%2";
	
	Результат 		= энргРаботаСЛицевымСчетомСервер.ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницуПотери();
	ТекстСоединений = СтрШаблон(Шаблон, СтрСоединить(Результат.ВыбираемыеПоля, ","), СтрСоединить(Результат.МассивСоединений, Символы.ПС));
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстСоединений);
КонецПроцедуры

Процедура СоединитьСхемуДанныхНаГраницуЗначениеПлощадей(Схема)	
	Шаблон = 
	"ВЫБРАТЬ
	|	УслугиДействующихТочек.Организация КАК Организация,
	|	УслугиДействующихТочек.Район КАК Район,
	|	УслугиДействующихТочек.КлючПомещения КАК КлючПомещения,
	|	УслугиДействующихТочек.Абонент КАК Абонент,
	|	УслугиДействующихТочек.Услуга КАК Услуга,
	|	УслугиДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|	УслугиДействующихТочек.ПриборУчета КАК ПриборУчета,
	|	%1
	|ИЗ
	|	УслугиДействующихТочек КАК УслугиДействующихТочек
	|		%2";
	
	Результат 		= энргРаботаСЛицевымСчетомСервер.ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницуЗначениеПлощадей();
	ТекстСоединений = СтрШаблон(Шаблон, СтрСоединить(Результат.ВыбираемыеПоля, ","), СтрСоединить(Результат.МассивСоединений, Символы.ПС));
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстСоединений);
КонецПроцедуры

Процедура СоединитьСхемуДанныхНаГраницуЗначенияИзмерителей(Схема)	
	Шаблон = 
	"ВЫБРАТЬ
	|	УслугиДействующихТочек.Организация КАК Организация,
	|	УслугиДействующихТочек.Район КАК Район,
	|	УслугиДействующихТочек.КлючПомещения КАК КлючПомещения,
	|	УслугиДействующихТочек.Абонент КАК Абонент,
	|	УслугиДействующихТочек.Услуга КАК Услуга,
	|	УслугиДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|	УслугиДействующихТочек.ПриборУчета КАК ПриборУчета,
	|	%1
	|ИЗ
	|	УслугиДействующихТочек КАК УслугиДействующихТочек
	|		%2";
	
	Результат 		= энргРаботаСЛицевымСчетомСервер.ПолучитьВыбираемыеПоляИСоединенияСОсновнойТаблицейНаГраницуЗначенияИзмерителей();
	ТекстСоединений = СтрШаблон(Шаблон, СтрСоединить(Результат.ВыбираемыеПоля, ","), СтрСоединить(Результат.МассивСоединений, Символы.ПС));
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстСоединений);
КонецПроцедуры

Процедура ИнициализироватьПараметрыОтбораДанныхНаГраницу(ПараметрыОтбора)
	ПараметрыВТ 			= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно"		, Новый Структура("Абонент"			, "Абонент")		, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно"		, Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно"		, Новый Структура("Район"			, "Район")			, Неопределено));	
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно"		, Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно"		, Новый Структура("АбонентВладелец"	, "КлючПомещения")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВСписке"	, Новый Структура("ТочкаУчета"		, "ТочкаУчета")		, Неопределено));
		
	ПараметрыОтбора.Вставить("Период"		, Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);	
КонецПроцедуры

Процедура ИнициализироватьПараметрыЗапросаДанныхНаГраницу(ДокументОбъект, ПараметрыЗапроса)
	ДанныеТочекУчета = ДокументОбъект.ТочкиУчета.Выгрузить();
	
	ПараметрыЗапроса.Вставить("ДанныеУслуги"	, ДанныеТочекУчета);	
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(ДокументОбъект.Дата, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Организация"		, ДокументОбъект.Организация);
	ПараметрыЗапроса.Вставить("Район"			, ДокументОбъект.Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, ДокументОбъект.КлючПомещения);	
	ПараметрыЗапроса.Вставить("Абонент"			, ДокументОбъект.Абонент);	
	ПараметрыЗапроса.Вставить("ТочкаУчета"		, ДанныеТочекУчета.ВыгрузитьКолонку("ТочкаУчета")); 	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодами

Функция ТекстДляПроведенияПоСтабильнымПериодам()
	 
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	ИСТИНА КАК ЛСОткрыт,
	|	ЕСТЬNULL(энргКоличествоПрописанныхСрезПоследних.Количество, Шапка.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	ЕСТЬNULL(энргКоличествоКомнатСрезПоследних.Количество, Шапка.КоличествоКомнат) КАК КоличествоКомнат,
	|	ЕСТЬNULL(энргКоличествоПроживающихСрезПоследних.Количество, Шапка.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	ЕСТЬNULL(энргКоличествоСобственниковСрезПоследних.Количество, Шапка.КоличествоСобственников) КАК КоличествоСобственников,
	|	Шапка.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги)
	|				ИЛИ Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УслугаПодключена,
	|	ЛОЖЬ КАК ДоговорЗаключенДоТП,
	|	ВЫБОР
	|		КОГДА ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПриборВведен,
	|	ВЫБОР
	|		КОГДА ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ Шапка.ПериодНачисления
	|	КОНЕЦ КАК ДатаСостоянияПрибора,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочкиУчета.Услуга КАК Услуга,
	|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	ТаблицаТочкиУчета.Поставщик КАК Поставщик,
	|	ТаблицаТочкиУчета.Плательщик КАК Плательщик,
	|	Шапка.Абонент КАК Абонент,
	|	ТаблицаТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ТаблицаТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
	|	ТаблицаТочкиУчета.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|	ТаблицаТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ТаблицаТочкиУчета.РассчитыватьПоДиаметруСечения КАК ИспользоватьДиаметрСечения,
	|	ТаблицаТочкиУчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ТаблицаТочкиУчета.Техническая КАК Техническая,
	|	ТаблицаТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ВЫБОР
	|		КОГДА ТаблицаТочкиУчета.ПриборУчета ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ТаблицаТочкиУчета.ДатаПоверкиСчетчика
	|	КОНЕЦ КАК ДатаПоверки,
	|	ВЫБОР
	|		КОГДА ТаблицаТочкиУчета.ПриборУчета ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК ДатаРегистрацииПоверки,
	|	Шапка.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УслугаОграничена,
	|	Шапка.ДоговорЗаключен КАК ДоговорЗаключен
	|ПОМЕСТИТЬ ДанныеШапки
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочкиУчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами КАК Шапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКоличествоПроживающих.СрезПоследних КАК энргКоличествоПроживающихСрезПоследних
	|			ПО Шапка.КлючПомещения = энргКоличествоПроживающихСрезПоследних.КлючПомещения
	|				И Шапка.Организация = энргКоличествоПроживающихСрезПоследних.Организация
	|				И Шапка.Район = энргКоличествоПроживающихСрезПоследних.Район
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКоличествоПрописанных.СрезПоследних КАК энргКоличествоПрописанныхСрезПоследних
	|			ПО Шапка.КлючПомещения = энргКоличествоПрописанныхСрезПоследних.КлючПомещения
	|				И Шапка.Организация = энргКоличествоПрописанныхСрезПоследних.Организация
	|				И Шапка.Район = энргКоличествоПрописанныхСрезПоследних.Район
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКоличествоСобственников.СрезПоследних КАК энргКоличествоСобственниковСрезПоследних
	|			ПО Шапка.КлючПомещения = энргКоличествоСобственниковСрезПоследних.КлючПомещения
	|				И Шапка.Организация = энргКоличествоСобственниковСрезПоследних.Организация
	|				И Шапка.Район = энргКоличествоСобственниковСрезПоследних.Район
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКоличествоКомнат.СрезПоследних КАК энргКоличествоКомнатСрезПоследних
	|			ПО Шапка.КлючПомещения = энргКоличествоКомнатСрезПоследних.КлючПомещения
	|				И Шапка.Организация = энргКоличествоКомнатСрезПоследних.Организация
	|				И Шапка.Район = энргКоличествоКомнатСрезПоследних.Район
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|	ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.Плательщик КАК Плательщик,
	|	ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|	ВложенныйЗапрос.Техническая КАК Техническая,
	|	ВложенныйЗапрос.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	СУММА(табПотери.ФиксированныйОбъемПотерь) КАК ПотериОбъем,
	|	СУММА(табПотери.ПроцентПотерь) КАК ПотериПроцент,
	|	ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|	ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|	ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ВложенныйЗапрос.УслугаОграничена КАК УслугаОграничена,
	|	ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП,
	|	ВложенныйЗапрос.ДоговорЗаключен КАК ДоговорЗаключен
	|ПОМЕСТИТЬ ДанныеШапкиСоставныеУслуги
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеШапки.Организация КАК Организация,
	|		ДанныеШапки.ПериодНачисления КАК ПериодНачисления,
	|		ДанныеШапки.Район КАК Район,
	|		ДанныеШапки.ЧастныйСектор КАК ЧастныйСектор,
	|		ДанныеШапки.Строение КАК Строение,
	|		ДанныеШапки.Помещение КАК Помещение,
	|		ДанныеШапки.ПериодРегистрации КАК ПериодРегистрации,
	|		ВЫБОР
	|			КОГДА энргОперацияСУслугамиПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеШапки.Услуга
	|			ИНАЧЕ энргОперацияСУслугамиПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги
	|		КОНЕЦ КАК Услуга,
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСУслугамиПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеШапки.Услуга
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		КОНЕЦ КАК СоставнаяУслуга,
	|		ДанныеШапки.Абонент КАК Абонент,
	|		ДанныеШапки.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеШапки.ВидОперации КАК ВидОперации,
	|		ДанныеШапки.ДатаРегистратора КАК ДатаРегистратора,
	|		ДанныеШапки.ДокРегистратор КАК ДокРегистратор,
	|		ДанныеШапки.УслугаПодключена КАК УслугаПодключена,
	|		ДанныеШапки.ПриборВведен КАК ПриборВведен,
	|		ДанныеШапки.ПриборУчета КАК ПриборУчета,
	|		ДанныеШапки.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|		ДанныеШапки.КоэффициентПУ КАК КоэффициентПУ,
	|		ДанныеШапки.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|		ДанныеШапки.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ДанныеШапки.IDСтроки КАК IDСтроки,
	|		ДанныеШапки.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|		ВЫБОР
	|			КОГДА энргОперацияСУслугамиПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеШапки.Поставщик
	|			ИНАЧЕ энргОперацияСУслугамиПоставщикиСоставныхУслуг.Поставщик
	|		КОНЕЦ КАК Поставщик,
	|		ВЫБОР
	|			КОГДА энргОперацияСУслугамиПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеШапки.Плательщик
	|			ИНАЧЕ энргОперацияСУслугамиПоставщикиСоставныхУслуг.Плательщик
	|		КОНЕЦ КАК Плательщик,
	|		ДанныеШапки.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|		ДанныеШапки.ДиаметрСечения КАК ДиаметрСечения,
	|		ДанныеШапки.Техническая КАК Техническая,
	|		ДанныеШапки.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|		ДанныеШапки.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|		ДанныеШапки.ДатаПоверки КАК ДатаПоверки,
	|		ДанныеШапки.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|		ДанныеШапки.ЛСОткрыт КАК ЛСОткрыт,
	|		ДанныеШапки.КоличествоПрописанных КАК КоличествоПрописанных,
	|		ДанныеШапки.КоличествоКомнат КАК КоличествоКомнат,
	|		ДанныеШапки.КоличествоПроживающих КАК КоличествоПроживающих,
	|		ДанныеШапки.КоличествоСобственников КАК КоличествоСобственников,
	|		ДанныеШапки.КоличествоЖильцов КАК КоличествоЖильцов,
	|		ДанныеШапки.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|		ДанныеШапки.УслугаОграничена КАК УслугаОграничена,
	|		ДанныеШапки.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП,
	|		ДанныеШапки.ДоговорЗаключен КАК ДоговорЗаключен
	|	ИЗ
	|		ДанныеШапки КАК ДанныеШапки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоставщикиСоставныхУслуг КАК энргОперацияСУслугамиПоставщикиСоставныхУслуг
	|			ПО ДанныеШапки.ДокРегистратор = энргОперацияСУслугамиПоставщикиСоставныхУслуг.Ссылка
	|				И (ДанныеШапки.ЭтоСоставнаяУслуга)
	|				И ДанныеШапки.IDСтроки = энргОперацияСУслугамиПоставщикиСоставныхУслуг.IDСтроки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.Потери КАК табПотери
	|		ПО ВложенныйЗапрос.ДокРегистратор = табПотери.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПотери.IDСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ВидОперации,
	|	ВложенныйЗапрос.ПриборВведен,
	|	ВложенныйЗапрос.СоставнаяУслуга,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.ЭтоСоставнаяУслуга,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.Поставщик,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.УслугаПодключена,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.IDСтроки,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистрацииПоверки,
	|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям,
	|	ВложенныйЗапрос.ДатаПоверки,
	|	ВложенныйЗапрос.Плательщик,
	|	ВложенныйЗапрос.Техническая,
	|	ВложенныйЗапрос.ИспользоватьДиаметрСечения,
	|	ВложенныйЗапрос.IDСтрокиРодитель,
	|	ВложенныйЗапрос.КоэффициентПУ,
	|	ВложенныйЗапрос.ДиаметрСечения,
	|	ВложенныйЗапрос.ЛСОткрыт,
	|	ВложенныйЗапрос.КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоКомнат,
	|	ВложенныйЗапрос.КоличествоПроживающих,
	|	ВложенныйЗапрос.КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоЖильцов,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета,
	|	ВложенныйЗапрос.УслугаОграничена,
	|	ВложенныйЗапрос.ДоговорЗаключенДоТП,
	|	ВложенныйЗапрос.ДоговорЗаключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеШапкиСоставныеУслуги.Организация КАК Организация,
	|	ДанныеШапкиСоставныеУслуги.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеШапкиСоставныеУслуги.Район КАК Район,
	|	ДанныеШапкиСоставныеУслуги.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеШапкиСоставныеУслуги.Строение КАК Строение,
	|	ДанныеШапкиСоставныеУслуги.Помещение КАК Помещение,
	|	ДанныеШапкиСоставныеУслуги.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеШапкиСоставныеУслуги.ВидОперации КАК ВидОперации,
	|	ДанныеШапкиСоставныеУслуги.Услуга КАК Услуга,
	|	ДанныеШапкиСоставныеУслуги.Абонент КАК Абонент,
	|	ДанныеШапкиСоставныеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеШапкиСоставныеУслуги.ДатаРегистратора КАК ДатаРегистратора,
	|	ДанныеШапкиСоставныеУслуги.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеШапкиСоставныеУслуги.УслугаПодключена КАК УслугаПодключена,
	|	ДанныеШапкиСоставныеУслуги.ПриборВведен КАК ПриборВведен,
	|	ДанныеШапкиСоставныеУслуги.ПриборУчета КАК ПриборУчета,
	|	ДанныеШапкиСоставныеУслуги.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ДанныеШапкиСоставныеУслуги.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеШапкиСоставныеУслуги.КоэффициентПУ КАК КоэффициентПУ,
	|	ДанныеШапкиСоставныеУслуги.Поставщик КАК Поставщик,
	|	ДанныеШапкиСоставныеУслуги.Плательщик КАК Плательщик,
	|	ДанныеШапкиСоставныеУслуги.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ДанныеШапкиСоставныеУслуги.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ДанныеШапкиСоставныеУслуги.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ДанныеШапкиСоставныеУслуги.ДиаметрСечения КАК ДиаметрСечения,
	|	ДанныеШапкиСоставныеУслуги.Техническая КАК Техническая,
	|	ДанныеШапкиСоставныеУслуги.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ЕСТЬNULL(энргОперацияСУслугамиТочкиУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчетаРодитель,
	|	ЕСТЬNULL(энргОперацияСУслугамиВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваИндивидуальный, ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)) КАК ВидБлагоустройства,
	|	ЕСТЬNULL(энргОперацияСУслугамиВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ТарифнаяГруппа,
	|	0 КАК Порядок,
	|	ДанныеШапкиСоставныеУслуги.ДатаПоверки КАК ДатаПоверки,
	|	ДанныеШапкиСоставныеУслуги.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	ДанныеШапкиСоставныеУслуги.ПотериОбъем КАК ПотериОбъем,
	|	ДанныеШапкиСоставныеУслуги.ПотериПроцент КАК ПотериПроцент,
	|	ДанныеШапкиСоставныеУслуги.ЛСОткрыт КАК ЛСОткрыт,
	|	ДанныеШапкиСоставныеУслуги.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ДанныеШапкиСоставныеУслуги.КоличествоКомнат КАК КоличествоКомнат,
	|	ДанныеШапкиСоставныеУслуги.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ДанныеШапкиСоставныеУслуги.КоличествоСобственников КАК КоличествоСобственников,
	|	ДанныеШапкиСоставныеУслуги.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ДанныеШапкиСоставныеУслуги.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ДанныеШапкиСоставныеУслуги.УслугаОграничена КАК УслугаОграничена,
	|	ДанныеШапкиСоставныеУслуги.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП,
	|	ДанныеШапкиСоставныеУслуги.ДоговорЗаключен КАК ДоговорЗаключен
	|ПОМЕСТИТЬ Вводшапки
	|ИЗ
	|	ДанныеШапкиСоставныеУслуги КАК ДанныеШапкиСоставныеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ВидыБлагоустройстваТарифныеКатегории КАК энргОперацияСУслугамиВидыБлагоустройстваТарифныеКатегории
	|		ПО ДанныеШапкиСоставныеУслуги.ДокРегистратор = энргОперацияСУслугамиВидыБлагоустройстваТарифныеКатегории.Ссылка
	|			И ДанныеШапкиСоставныеУслуги.Услуга = энргОперацияСУслугамиВидыБлагоустройстваТарифныеКатегории.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК энргОперацияСУслугамиТочкиУчета
	|		ПО ДанныеШапкиСоставныеУслуги.ДокРегистратор = энргОперацияСУслугамиТочкиУчета.Ссылка
	|			И ДанныеШапкиСоставныеУслуги.IDСтрокиРодитель = энргОперацияСУслугамиТочкиУчета.IDСтроки";
	
	Возврат Текст;

КонецФункции

Функция ТекстПолучитьДанныеИзмененияСоставаШкал()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаШкалПриборовУчета.Шкала КАК Шкала,
	|	ТаблицаШкалПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	0 КАК Порядок,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|		ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|				И (НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ШкалыПриборовУчета КАК ТаблицаШкалПриборовУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = ТаблицаШкалПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалПриборовУчета.IDСтрокиТочкиУчета";	
	Возврат Текст;	
КонецФункции
 
Функция ТекстПолучитьДанныеИзмененияИзмерителей()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаИзмерителей.НаправлениеИспользованияТУ КАК Измеритель,
	|	ТаблицаИзмерителей.Значение КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТочкиУчета
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ЗначенияИзмерителей КАК ТаблицаИзмерителей
	|		ПО ВложенныйЗапрос.ДокРегистратор = ТаблицаИзмерителей.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаИзмерителей.IDСтроки";	
	Возврат Текст;
КонецФункции 

Функция ТекстПолучитьДанныеИзмененияПлощади()   
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	табЗначениеПлощадей.ВидПлощади КАК ВидПлощади,
	|	табЗначениеПлощадей.Значение КАК Значение
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ЗначениеПлощадей КАК табЗначениеПлощадей
	|		ПО ДокументыДляПроведения.ДокРегистратор = табЗначениеПлощадей.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления)))
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения";
	
	Возврат Текст;

КонецФункции

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСГИЖКХ

Функция ТекстЗапросаПриборыУчетаДляПередачи()
	
	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.СоставнаяУслуга
	|				И НЕ энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.НаименованиеМодели КАК НаименованиеМодели,
	|	ВложенныйЗапрос.НаименованиеМарки КАК НаименованиеМарки,
	|	ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки,
	|	ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.Дата КАК Дата,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		табПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ВложенныйЗапрос.НаименованиеМодели КАК НаименованиеМодели,
	|		ВложенныйЗапрос.НаименованиеМарки КАК НаименованиеМарки,
	|		ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|		ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|		ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|		ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки,
	|		ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Ссылка КАК Ссылка,
	|			ВложенныйЗапрос.Дата КАК Дата,
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			табШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|			табШкалы.IDСтроки КАК IDСтрокиШкалы,
	|			ТипыПриборовУчета.Наименование КАК НаименованиеМодели,
	|			ТипыПриборовУчета.Ссылка КАК ТипПрибораУчета,
	|			ПРЕДСТАВЛЕНИЕ(ТипыПриборовУчета.МаркаПУ) КАК НаименованиеМарки,
	|			ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|			ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|			ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ДатаСледующейПоверкиСчетчика, МЕСЯЦ, -ТипыПриборовУчета.бестМежповерочныйИнтервал) КАК ДатаПоверки,
	|			ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Шапка.Ссылка КАК Ссылка,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ КАК Дата,
	|				Шапка.Абонент КАК Абонент,
	|				Шапка.КлючПомещения КАК КлючПомещения,
	|				табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|				табТочкиУчета.Услуга КАК Услуга,
	|				табТочкиУчета.IDСтроки КАК IDСтроки,
	|				табТочкиУчета.ДатаПоверкиСчетчика КАК ДатаСледующейПоверкиСчетчика,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ КАК ДатаУстановки,
	|				ПриборыУчетаАбонента.Код КАК ЗаводскойНомер,
	|				ПриборыУчетаАбонента.ТипПрибораУчета КАК МодельПрибораУчета,
	|				ПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем
	|			ИЗ
	|				Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами КАК Шапка
	|					ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|						И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК ПриборыУчетаАбонента
	|					ПО табТочкиУчета.ПриборУчета = ПриборыУчетаАбонента.Ссылка
	|			ГДЕ
	|				Шапка.Ссылка В(&мИзменения)
	|				И табТочкиУчета.Ссылка В(&мИзменения)) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ШкалыПриборовУчета КАК табШкалы
	|				ПО ВложенныйЗапрос.Ссылка = табШкалы.Ссылка
	|					И ВложенныйЗапрос.IDСтроки = табШкалы.IDСтрокиТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК ТипыПриборовУчета
	|				ПО ВложенныйЗапрос.МодельПрибораУчета = ТипыПриборовУчета.Ссылка) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|			ПО ВложенныйЗапрос.Ссылка = табПоказанияПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиШкалы = табПоказанияПриборовУчета.IDСтроки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|			И (энргВидыУслугСоставляющиеУслуг.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПриборыУчетаДляАрхивации()
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПричинаЗаменыПрибораУчета КАК ПричинаЗаменыПрибораУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		Шапка.Ссылка КАК Ссылка,
	|		Шапка.Организация КАК Организация,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Справочник.энргПричиныАрхивацииПУ.ПустаяСсылка) КАК ПричинаЗаменыПрибораУчета
	|	ИЗ
	|		Документ.энргОперацияСУслугами.ТочкиУчета КАК табТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами КАК Шапка
	|			ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги))
	|	ГДЕ
	|		Шапка.Ссылка В(&мИзменения)
	|		И табТочкиУчета.Ссылка В(&мИзменения)) КАК ВложенныйЗапрос";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли