#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыводитьСобытия = истина;
	ВыводитьВзаиморасчетыПоМесяцам = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью(Истина);
	НачалоПериода = '2010-01-01';
	КонецПериода = '2016-01-01';
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	ДанныеАбонента  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
	ДанныеАбонента.удалить("Абонент");
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Абонент, ДанныеАбонента);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеАбонента);

	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабСобытияАбонента,"НЕАКТУАЛЬНОСТЬ");;
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабСобытияАбонента,"НЕАКТУАЛЬНОСТЬ");;;
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабСобытияАбонента,"НЕАКТУАЛЬНОСТЬ");;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкрытьНастройки(Команда)
	УправлениеВидимостью();	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыбораПериода(Команда)
	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Показать(ОписаниеОповещенияВыборПериода);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабСобытияАбонента,"ФОРМИРОВАНИЕОТЧЕТА");
	
	УправлениеВидимостью(Ложь);
	
	Элементы.ТабСобытияАбонента.ОтображениеСостояния.Видимость 	= Истина;
	Элементы.ТабСобытияАбонента.ОтображениеСостояния.Картинка 	= БиблиотекаКартинок.ДлительнаяОперация48;
	Элементы.ТабСобытияАбонента.ОтображениеСостояния.Текст 		= "Формирование отчета, пожалуйста подождите";
	
	СформироватьСервер();
	
	Подключаемый_ПроверитьВыполнениеЗадания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьСервер()
	ПараметрыКарточки  						= Новый Структура("НачалоПериода,КонецПериода,Организация, Район,МКД,Абонент,РасчетДляСуда,ВыводитьСобытия,МораторнаяЗадолженность,РеструктуризированнаяЗадолженность",НачалоПериода,КонецДня(КонецПериода), Организация,Район,МКД,Абонент,РасчетДляСуда,ВыводитьСобытия,МораторнаяЗадолженность,РеструктуризированнаяЗадолженность);
	 	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор, 
			"Отчеты.энргКарточкаАбонента.СформироватьСобытияАбонента", 
			ПараметрыКарточки, 
			НСтр("ru = 'формирование карточки абонента'"));
						
	АдресХранилища       					= РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания 					= РезультатВыполнения.ИдентификаторЗадания;	
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ТабСобытияАбонента 					= ПолучитьИзВременногоХранилища(АдресХранилища);
		ОтображениеСостояния 				= Элементы.ТабСобытияАбонента.ОтображениеСостояния;
		ОтображениеСостояния.Видимость 		= Ложь;
		ОтображениеСостояния.Картинка 		= Неопределено;
		ОтображениеСостояния.Текст 			= "";
		ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать; 		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()  
	
	ПараметрыОбработчикаОжидания = Новый Структура("ТекущийИнтервал,КоэффициентУвеличенияИнтервала,МаксимальныйИнтервал",2,1,10);
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ТабСобытияАбонента = ПолучитьИзВременногоХранилища(АдресХранилища);
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабСобытияАбонента,"НЕИСПОЛЬЗОВАТЬ");   
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью(Видимость = Неопределено)   	
	
	Элементы.СтраницаСобытия.Видимость 					= ВыводитьСобытия;
	
	Если Видимость = Неопределено тогда
		Видимость 										= не Элементы.ГруппаНастройки.Видимость;		
	КонецЕсли;
	
	Элементы.ГруппаНастройки.Видимость 					= Видимость; 
	Элементы.ФормаСкрытьНастройки.Заголовок 			= ?(Видимость,"Скрыть настройки","Показать настройки");

КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;	
	НачалоПериода 		= ИнтервалУстановлен.ДатаНачала;
	КонецПериода 		= ИнтервалУстановлен.ДатаОкончания;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабСобытияАбонента,"НЕАКТУАЛЬНОСТЬ");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура ТабСобытияАбонентаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.энргВводНачальныхОстатков") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
		ПараметрыФормы.Вставить("Абонент",Абонент);
		ОткрытьФорму("Документ.энргВводНачальныхОстатков.ФормаОбъекта", ПараметрыФормы,ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти