
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_бестДоговорыКонтрагентов(ЭтотОбъект);
	Параметры.Свойство("СтрокаНачальногоПоиска", СтрокаНачальногоПоиска);
	Параметры.Свойство("НезависимыйСбыт", НезависимыйСбыт);
	
	УстановитьОтборСпискаСервер();
	
	бестРаботаСФормойДоговораНезависимыйСбыт.НастроитьЭлементыИнтерфейсаДоговор(ЭтотОбъект);
	 	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаНачальногоПоискаПриИзменении(Элемент)
	УстановитьОтборСпискаСервер();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьФорму(Элементы.Список.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ЗакрытьФорму(Элементы.Список.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЗакрытьФорму(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборСпискаСервер()
	
	СписокДоговоров 				= Новый СписокЗначений;
	ПоискВыполнен 					= Ложь;
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда		
		Если УдалосьВыполнитьПолнотекстовыйПоиск(СписокДоговоров) Тогда
			ПоискВыполнен 			= Истина;
		КонецЕсли;		
		 // ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",мСписокСсылок,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	 КонецЕсли;
	 
	 Если Не ПоискВыполнен И Не ПустаяСтрока(СтрокаНачальногоПоиска) Тогда
		 мДоговоры 					= Справочники.энргДоговорыКонтрагентов.МассивСсылокПолнотекстовогоПоиска(СтрокаНачальногоПоиска);
		 СписокДоговоров.ЗагрузитьЗначения(мДоговоры);
	 КонецЕсли;
	 
	 Если Не СписокДоговоров.Количество() = 0 Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		 																			"Ссылка", 
		 																			СписокДоговоров, 
																					ВидСравненияКомпоновкиДанных.ВСписке,
																					,
																					, 
																					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 
	 Иначе
		 ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка"); 
	 КонецЕсли;
	 
	 Если НезависимыйСбыт Тогда
	 
		 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		 																			"ТипДоговора",
		 																			Перечисления.бестТипыДоговоров.Доходный,
																					,
																					,
																					,
																					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный); 	 	
	 
	 КонецЕсли;
 КонецПроцедуры
 
&НаСервере
Функция УдалосьВыполнитьПолнотекстовыйПоиск(СписокДоговоров)
	
	МаксимальноеКоличествоЭлементовПоиска 		= 50;
	
	Если НЕ ПолнотекстовыйПоиск.ИндексАктуален() Тогда		
		Возврат Ложь;
	КонецЕсли; 	
	
	яПолнотекстовыйПоиск 						= ПолнотекстовыйПоиск.СоздатьСписок(СтрокаНачальногоПоиска);
	ОбластьПоиска 								= Новый Массив;
	ОбластьПоиска.Добавить(Метаданные.Справочники.энргДоговорыКонтрагентов);		
	яПолнотекстовыйПоиск.ОбластьПоиска 			= ОбластьПоиска;
	яПолнотекстовыйПоиск.ПолучатьПредставление 	= Ложь;
	яПолнотекстовыйПоиск.ПолучатьОписание 		= Ложь;
	Попытка
		яПолнотекстовыйПоиск.ПерваяЧасть();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если яПолнотекстовыйПоиск.СлишкомМногоРезультатов() Тогда
		КодОшибки 								= "СлишкомМногоРезультатов";
		Возврат Ложь;
	КонецЕсли;		
	
	КоличествоРезультатов 						= яПолнотекстовыйПоиск.ПолноеКоличество();
	
	Если КоличествоРезультатов = 0 Тогда
		КодОшибки 								= "НичегоНеНайдено";
		Возврат Ложь;
	КонецЕсли;
	
	Если КоличествоРезультатов > МаксимальноеКоличествоЭлементовПоиска Тогда
		КодОшибки 								= "СлишкомМногоРезультатов";
		Возврат Ложь;
	КонецЕсли;
	
	мСписокСсылок 								= Новый СписокЗначений;
	Для Каждого НайденныйЭлемент Из яПолнотекстовыйПоиск Цикл
		мСписокСсылок.Добавить(НайденныйЭлемент.Значение);
	КонецЦикла;	
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(ТекДанные)
	Если ТекДанные <> Неопределено Тогда
		Закрыть(ТекДанные);
	Иначе
		Закрыть(ТекДанные);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
