#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьЗначенияЗаполнения = Ложь;
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЕстьЗначенияЗаполнения = Истина;
		ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
	ИначеЕсли Параметры.Свойство("Ключ") Тогда
		ЕстьЗначенияЗаполнения = Истина;
		ВидОперации = Параметры.Ключ.ВидОперации;
	ИначеЕсли  Параметры.свойство("ЗначениеКопирования") Тогда
		ЕстьЗначенияЗаполнения = Истина;
		ВидОперации = Параметры.ЗначениеКопирования.ВидОперации;
	КонецЕсли;
		
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Если ЗначениеЗаполнено(ВидОперации) тогда
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргСоглашениеПоРассрочке",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		ИначеЕсли Параметры.свойство("Основание") Или ЕстьЗначенияЗаполнения И Не ЗначениеЗаполнено(ВидОперации) тогда
			ВыбраннаяФорма 		= "ФормаДокументаФЛ";
		Иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргСоглашениеПоРассрочке");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	
			
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытий

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области
//												в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли