
#Область СтандартныеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеДоступностью(); 	
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностью()
	Элементы.КодАСКУЭ.Доступность = Не ЗначениеЗаполнено(Объект.КодАСКУЭ);
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	//Элементы.Группа6.Видимость = Объект.ТипПрибораУчета.бестЯвляетсяУзлом;
	ВидимостьСтраницы80020 = Обработки.энргКонстантыМенеджер.ЗначениеКонстанты("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПредставлениеДанных80020", "Видимость", ВидимостьСтраницы80020);
	
	ВидимостьНС = бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ответственный", "Видимость", ВидимостьНС); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "энргДатаПоследнегоИзменения", "Видимость", ВидимостьНС);
КонецПроцедуры

&НаКлиенте
Процедура ТипПрибораУчетаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСНезависимымСбытом.ДополнительныеПараметрыЗаписиДатыИзменения(ТекущийОбъект, ЭтотОбъект.Модифицированность, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти


