#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура: ДобавитьКомандыОтчетов
//  Описание: Данная процедура предназначена для добавления команд отчетов в переданный объект КомандыОтчетов.
//
// Параметры:
//  КомандыОтчетов	 - Объект	 - объект, в который будут добавлены команды отчетов.
//  Параметры		 - Структура - необязательный параметр,
//  содержащий дополнительные параметры для добавления команд. По умолчанию неопределено.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры = Неопределено) Экспорт
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли

