#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ = ОбменДанными.Загрузка;
	
	Ответственный = Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка); 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр бестСпособыДоставкиЕПДАбоненту
	Движения.бестСпособыДоставкиЕПДАбоненту.Записывать = Истина;
	Для Каждого ТекСтрокаАбоненты Из Абоненты Цикл
		Движение = Движения.бестСпособыДоставкиЕПДАбоненту.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Район = Район;
		Движение.Абонент = ТекСтрокаАбоненты.Абонент;
		Движение.СпособДоставкиЕПД = ТекСтрокаАбоненты.СпособДоставкиЕПД;
		Движение.Актуальность = Истина;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли