#Область ПрограммныйИнтерфейс

Функция ТекущиеДанныеТочкиУчета(ЭлементыФормы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета,Постфикс = "") Экспорт 
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны" + Постфикс);
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ТочкиУчетаЕстьШкалыНетТарифныхЗон" + Постфикс);
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ТочкиУчетаНетШкалЕстьТарифныеЗоны" + Постфикс);
	Иначе	
		ЭлементФормы = ЭлементыФормы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон" + Постфикс);
	КонецЕсли;
	
	Возврат ЭлементФормы.ТекущиеДанные;
КонецФункции

Функция ТекущиеДанныеПоказаний(ЭлементыФормы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета,Постфикс = "") Экспорт 
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны" + Постфикс);		
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон" + Постфикс);
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны" + Постфикс);
	Иначе	
		ЭлементФормы = ЭлементыФормы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон" + Постфикс);
	КонецЕсли;
	
	Возврат ЭлементФормы.ТекущиеДанные;
	
КонецФункции

Функция ТекущиеДанныеПоказанийВводВывод(ЭлементыФормы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета, Постфикс) Экспорт 
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		Возврат ЭлементыФормы["ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны" + Постфикс].ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		Возврат ЭлементыФормы["ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон" + Постфикс].ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		Возврат ЭлементыФормы["ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны" + Постфикс].ТекущиеДанные;
	Иначе	
		Возврат ЭлементыФормы["ПоказанияПриборовУчетаНетШкалНетТарифныхЗонВывод" + Постфикс].ТекущиеДанные;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущиеДанныеПоказанийВывод(ЭлементыФормы, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета) Экспорт 
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		Возврат ЭлементыФормы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныВывод.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		Возврат ЭлементыФормы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонВывод.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		Возврат ЭлементыФормы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныВывод.ТекущиеДанные;
	Иначе	
		Возврат ЭлементыФормы.ТочкиУчетаНетШкалНетТарифныхЗонВывод.ТекущиеДанные;
	КонецЕсли;
	
КонецФункции

#КонецОбласти