
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьРеквизитов();
КонецПроцедуры

#Конецобласти

#Область СобытияШапки

&НаКлиенте
Процедура ТочкиПриемаПриИзменении(Элемент)
	НастроитьВидимостьРеквизитов();
КонецПроцедуры

#Конецобласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьВидимостьРеквизитов()
	Элементы.ГруппаПараметрыТочкиПриема.Видимость = Объект.ТочкиПриема;
КонецПроцедуры

#Конецобласти

#Область События_ТЧ_ТочкиПоставки

&НаКлиенте
Процедура ТочкиПоставкиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.КатегорииНадежности,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("КатегорииНадежности");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

#КонецОбласти

#Область События_ТЧ_КатегорииНадежности

&НаКлиенте
Процедура КатегорииНадежностиПриИзменении(Элемент)
	ТекДанные = Элементы.ТочкиПоставки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 							= Элементы.КатегорииНадежности.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
КонецПроцедуры

#КонецОбласти
