&НаКлиенте
Перем мСхема;

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ЭтапыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	Если мСхема <> Схема Тогда
	
		Если Этапы.Количество() = 0 Тогда
			мСхема = Схема;
			ЗагрузитьЭтапыСхемы();
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаответаНаОчистку", ЭтотОбъект), "Очистить таблицу ""Этапы""?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мСхема = Схема;
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Организация, Район, Схема, Юридическая");

	Если ЗначениеЗаполнено(Схема) Тогда
		ЗагрузитьЭтапыСхемы();
		Модифицированность = Ложь;
	КонецЕсли;
	
	ТипСхемы = ?(Юридическая, ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ЮрЛицо"), ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ФизЛицо"));
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("Обновить");
КонецПроцедуры

&НаКлиенте
Процедура ИзмененыДанные(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
	
		Отказ = Истина;
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаответаПриЗакрытии", ЭтотОбъект), "Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаответаПриЗакрытии(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		Если ЗаписатьНаСервере() Тогда 
			Закрыть();
		КонецЕсли;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипСхемыПриИзменении(Элемент)
	Юридическая = ТипСхемы = ПредопределенноеЗначение("Перечисление.бестЮрФизЛицо.ЮрЛицо");
	
	ОбновитьВидимостьЭлементов();
	ЗагрузитьЭтапыСхемы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКоманд
&НаКлиенте
Процедура Сохранить(Команда)
	Если Не (ЗначениеЗаполнено(Период) И ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(Схема)) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Есть незаполненные поля");
	КонецЕсли;
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭтапы(Команда)
	ЗагрузитьЭтапыСхемы();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМетоды
&НаКлиенте
Процедура ОбработкаответаНаОчистку(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		мСхема = Схема;
		ЗагрузитьЭтапыСхемы();
	Иначе
		Схема = мСхема;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЭтапыСхемы()

	Модифицированность = Истина;
	Этапы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДЭтапы.Этап КАК Этап,
		|	ЕСТЬNULL(СрокиЭтаповПИДСрезПоследних.Срок, 0) КАК Срок,
		|	ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.Подэтап, ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ПУСТАЯССЫЛКА)) КАК Подэтап
		|ИЗ
		|	Справочник.энргСхемыПИД.Этапы КАК энргСхемыПИДЭтапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД.Подэтапы КАК энргВидыОперацийПИДПодэтапы
		|		ПО энргСхемыПИДЭтапы.Этап = энргВидыОперацийПИДПодэтапы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСрокиЭтаповПИД.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И Схема = &Схема
		|					И Юридическая = &Юридическая) КАК СрокиЭтаповПИДСрезПоследних
		|		ПО энргСхемыПИДЭтапы.Этап = СрокиЭтаповПИДСрезПоследних.Этап
		|			И (ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.Подэтап, ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ПУСТАЯССЫЛКА)) = СрокиЭтаповПИДСрезПоследних.Подэтап)
		|ГДЕ
		|	энргСхемыПИДЭтапы.Ссылка = &Схема
		|
		|УПОРЯДОЧИТЬ ПО
		|	энргСхемыПИДЭтапы.НомерСтроки,
		|	ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.НомерСтроки, 0)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период",		 Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Район",		 Район);
	Запрос.УстановитьПараметр("Схема",		 Схема);
	Запрос.УстановитьПараметр("Юридическая", Юридическая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = Этапы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	НаборЗаписей = РегистрыСведений.энргСрокиЭтаповПИД.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.Схема.Установить(Схема);
	НаборЗаписей.Отбор.Район.Установить(Район);

	Для каждого СтрокаЭтап Из Этапы Цикл
		СтрокаРС = НаборЗаписей.Добавить();
		СтрокаРС.Период		 = Период;
		СтрокаРС.Организация = Организация;
		СтрокаРС.Схема		 = Схема;
		СтрокаРС.Район		 = Район;
		СтрокаРС.Абонент	 = Абонент;
		СтрокаРС.МКД		 = МКД;
		СтрокаРС.Услуга		 = Услуга;
		ЗаполнитьЗначенияСвойств(СтрокаРС, СтрокаЭтап);
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать(Истина);
		Модифицированность = Ложь;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	Элементы.МКД.Видимость		= Не Юридическая;
	Элементы.Услуга.Видимость	= Не Юридическая;
	Элементы.Абонент.Видимость	= Не Юридическая;
КонецПроцедуры
#КонецОбласти