#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура Отправить(Зависимости, Настройки, ОтправляемыеОбъекты) Экспорт 
	
	РаспределитьОтправку(Зависимости, Настройки, ОтправляемыеОбъекты);
	
КонецПроцедуры

Процедура ОтправитьПисьма(Зависимости, Настройки, ОтправляемыеОбъекты, Контекст = Неопределено) Экспорт 
	
	ОтправитьПисьмаПорциями(Зависимости, Настройки, ОтправляемыеОбъекты, Контекст); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцессОтправки

Процедура РаспределитьОтправку(Зависимости, Настройки, ОтправляемыеОбъекты)
	
	Если Настройки.ОтправлятьМногопоточно Тогда
		ОтправитьОбъектыМногопоточно(Зависимости, Настройки, ОтправляемыеОбъекты);
		Возврат;
	КонецЕсли;
	
	ОтправитьПисьма(Зависимости, Настройки, ОтправляемыеОбъекты);
	
КонецПроцедуры

Функция ОтправитьПисьмаПорциями(Зависимости, Настройки, ОтправляемыеОбъекты, Контекст)
	
	МодульРаботыСПочтовымиСообщениями = ОпределитьМодульРаботыСПочтовымиСообщениями(Зависимости);
	
	КоличествоВПорции = ОтправляемыеОбъекты.Количество();
	Если Настройки.ИспользоватьПорции Тогда 
		КоличествоВПорции = Настройки.КоличествоВПорции;
	КонецЕсли; 
	
	ПорцияОтправляемыхОбъектов = Новый Массив;
	Итератор = 0;
	Сч = 0;
	СчПрогресса = Цел(ОтправляемыеОбъекты.Количество() / 15);
	ИтераторПрогресса = 0;
	
	ИмяРайона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Зависимости.СоздательПисем.Отборы.Район, "Наименование");
	Для Каждого ТекОбъектОтправки из ОтправляемыеОбъекты Цикл 
		
		Если Итератор = КоличествоВПорции Тогда
			ПриСменеПорции(Зависимости, Настройки, ПорцияОтправляемыхОбъектов, МодульРаботыСПочтовымиСообщениями);
			
			ПорцияОтправляемыхОбъектов.Очистить();
			Итератор = 0;
		КонецЕсли;		
		
		ПорцияОтправляемыхОбъектов.Добавить(ТекОбъектОтправки);
		Итератор = Итератор + 1;
		ИтераторПрогресса = ИтераторПрогресса + 1;
		Сч = Сч + 1;
		
		Если ИтераторПрогресса = СчПрогресса Тогда
			НомерПотока = "" + ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст, "НомерПотока", 1);
			ЗаписьЖурналаРегистрации(
				Зависимости.ИмяСобытия + ".Прогресс." + ИмяРайона + ".Поток №" + НомерПотока,
				УровеньЖурналаРегистрации.Примечание,,,
				"Отправлено " + Сч + " из " + ОтправляемыеОбъекты.Количество());
			//ДлительныеОперации.СообщитьПрогресс(1, "В потоке №" + НомерПотока + " отправлено " + ИтераторПрогресса + " из " + ОтправляемыеОбъекты.Количество());
			ИтераторПрогресса = 0;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если Итератор > 0 Тогда
		ПриСменеПорции(Зависимости, Настройки, ПорцияОтправляемыхОбъектов, МодульРаботыСПочтовымиСообщениями);
	КонецЕсли; 	
	
КонецФункции

Процедура ПриСменеПорции(Зависимости, Настройки, ПорцияОтправляемыхОбъектов, МодульРаботыСПочтовымиСообщениями)
	
	РезультатПодготовкиПисем = НовыйРезультатПодготовкиПисем();	
	Зависимости.СоздательПисем.Исполнитель.ПодготовитьПисьмаКОтправке(
		Зависимости, 
		ПорцияОтправляемыхОбъектов, 
		РезультатПодготовкиПисем);
	
	ПисьмаКОтправке = Новый Массив;
	Для Каждого Письмо из РезультатПодготовкиПисем.ВсеПисьма Цикл
		
		Если Настройки.ОтправлятьКаждоеПисьмоОтдельно Тогда
			ПисьмаКОтправке = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Письмо.Ключ);
			ВыполнитьОтправкуПисемПриСменеПорции(Зависимости, МодульРаботыСПочтовымиСообщениями, РезультатПодготовкиПисем, ПисьмаКОтправке);
			Продолжить;
		КонецЕсли;	
		
		ПисьмаКОтправке.Добавить(Письмо.Ключ);
		
	КонецЦикла;
	
	ВыполнитьОтправкуПисемПриСменеПорции(Зависимости, МодульРаботыСПочтовымиСообщениями, РезультатПодготовкиПисем, ПисьмаКОтправке);
	
КонецПроцедуры 

Процедура ВыполнитьОтправкуПисемПриСменеПорции(Зависимости, МодульРаботыСПочтовымиСообщениями, РезультатПодготовкиПисем, Письма)
		
	РезультатОтправкиПисем = Новый Соответствие;
	Попытка			
		РезультатОтправкиПисем = МодульРаботыСПочтовымиСообщениями.ОтправитьПисьма(Зависимости.УчетнаяЗапись, Письма);
	Исключение
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
			Зависимости.ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(Инфо));
	КонецПопытки;
	
	Зависимости.РегистраторРезультатаОтправкиПисем.Исполнитель.ЗаписатьРезультатОтправки(Зависимости, РезультатПодготовкиПисем, РезультатОтправкиПисем);
	
КонецПроцедуры

#КонецОбласти

#Область МногопоточноеВыполнениеЗадачи

Функция ОтправитьОбъектыМногопоточно(Зависимости, Настройки, ОтправляемыеОбъекты)
	
	ПодготовленныеПотоки = Новый Массив;
	Для Сч = 1 По Настройки.КоличествоПотоков Цикл 		
		ПодготовленныеПотоки.Добавить(Новый Массив);		
	КонецЦикла; 	
	
	Итерация = 0;
	Для Каждого ОтправляемыйОбъект из ОтправляемыеОбъекты Цикл 
		
		Если Итерация > Настройки.КоличествоПотоков - 1 Тогда
			Итерация = 0;
		КонецЕсли;
		
		ПодготовленныеПотоки[Итерация].Добавить(ОтправляемыйОбъект);
		
		Итерация = Итерация + 1;
		
	КонецЦикла; 	
	
	ДлительныеОперацииСписок = Новый Массив;
	НомерПотока = 1;
	Для Каждого Поток из ПодготовленныеПотоки Цикл 
		
		Если Поток.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДлительнаяОперация = ЗапуститьФоновоеЗадание(Зависимости, Настройки, Поток, НомерПотока);
		ДлительныеОперацииСписок.Добавить(ДлительнаяОперация);
		НомерПотока = НомерПотока + 1;
		
	КонецЦикла;
	           	
	ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок);
	
КонецФункции

Функция ЗапуститьФоновоеЗадание(Зависимости, Настройки, ОтправляемыеОбъекты, НомерПотока)
	
	ИмяМетода = "Обработки.энргМенеджерОтправкиПисем.ОтправитьПисьма";
	ПараметрыКонтекста = Новый Структура;
	ПараметрыКонтекста.Вставить("НомерПотока", НомерПотока);
	
	НаименованиеФоновогоЗадания = "Отправка писем по району: " + 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Зависимости.СоздательПисем.Отборы.Район,
			"Наименование") + 
		". Поток №" + НомерПотока;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = '%1'"), НаименованиеФоновогоЗадания);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		ИмяМетода,
		Зависимости, 
		Настройки, 
		ОтправляемыеОбъекты,
		ПараметрыКонтекста);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок)
	
	ЗавершенныеЗадания = Новый Массив;
	Пока Истина Цикл
		
		Если ЗавершенныеЗадания.Количество() = ДлительныеОперацииСписок.Количество() Тогда 
			Прервать;
		КонецЕсли; 		
		
		Для Каждого ДлительнаяОперация из ДлительныеОперацииСписок Цикл 
			
			Если НЕ ЗавершенныеЗадания.Найти(ДлительнаяОперация) = Неопределено Тогда 
				Продолжить;
			КонецЕсли; 			
			
			Выполнено = Ложь;
			Попытка
				
				Выполнено = ДлительныеОперации.ЗаданиеВыполнено(ДлительнаяОперация.ИдентификаторЗадания);	
				
			Исключение
				// Завершенные аварийно задания помещаем как выполненные
				Выполнено = Истина;
			КонецПопытки;
			
			Если Выполнено Тогда 
				ЗавершенныеЗадания.Добавить(ДлительнаяОперация);
			КонецЕсли; 			
			
		КонецЦикла;
		
		ОбменДаннымиСервер.Пауза(5);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция НовыйРезультатПодготовкиПисем()
	
	Результат = Новый Структура;
	Результат.Вставить("ВсеПисьма", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьМодульРаботыСПочтовымиСообщениями(Зависимости)
	
	Результат = Зависимости.РаботаСПочтовымиСообщениями;
	Если ТипЗнч(Зависимости.РаботаСПочтовымиСообщениями) = Тип("Строка") Тогда 
		Результат = ОбщегоНазначения.ОбщийМодуль(Зависимости.РаботаСПочтовымиСообщениями);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли