#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПриоритеты(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыУстановкиПриоритетов", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.энргПриоритетПередачиПоказаний.Форма.ФормаУстановкаПриоритетов",,,,,,ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыУстановкиПриоритетов(Результат, ДополнительныеПараметры) Экспорт 
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти
