#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",Истина);
	ДополнительныеСвойства.Вставить("МассивСтроений",Истина);
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= КонецДня(ДатаФактическогоСобытия);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= МоментВремени();
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	МКДОткрыт 		= Истина;

	//Если НЕ ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор тогда		
	//	Строение 		= ДополнительныеСвойства.ДанныеСтроения.Строение;
	//	МКДОткрыт 		= энргПроверкаДанныхАбонентаСервер.СостояниеМКД(Момент,Район,Строение,Организация);			
	//КонецЕсли;
	
	Если не МКДОткрыт тогда
		Отказ= истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " мкд закрыт");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();	
	Выборка		= ПолучитьДанныеТЧ();
	
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьТипСхемыГВСРезультатЗапроса(Движения, ДанныеШапки, Выборка);	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеТЧ()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ЗАпрос.Текст = "ВЫБРАТЬ
	|	бестИзменениеТиповСхемГВСМКДСтроения.Ссылка КАК Ссылка,
	|	бестИзменениеТиповСхемГВСМКДСтроения.Строение КАК МКД,
	|	бестИзменениеТиповСхемГВСМКДСтроения.ТипСхемыГВС КАК ТипСхемыГВС
	|ИЗ
	|	Документ.бестИзменениеТиповСхемГВСМКД.Строения КАК бестИзменениеТиповСхемГВСМКДСтроения
	|ГДЕ
	|	бестИзменениеТиповСхемГВСМКДСтроения.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестИзменениеТиповСхемГВСМКДСтроения.Ссылка,
	|	бестИзменениеТиповСхемГВСМКДСтроения.Строение,
	|	бестИзменениеТиповСхемГВСМКДСтроения.ТипСхемыГВС";
	Результат = Запрос.Выполнить();
	
	Возврат Результат;	
КонецФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);   
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("Ссылка",					Ссылка);

	Возврат ДанныеШапки; 
КонецФункции

Процедура МассивПомещений() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестИзменениеТиповСхемГВСМКД.Организация КАК Организация,
	|	бестИзменениеТиповСхемГВСМКД.Район КАК Район,
	|	бестИзменениеТиповСхемГВСМКД.ПериодНачисления КАК ПериодНачисления,
	|	бестИзменениеТиповСхемГВСМКДСтроения.Строение КАК Строение,
	|	бестИзменениеТиповСхемГВСМКД.Дата КАК ПериодРегистрации
	|ИЗ
	|	Документ.бестИзменениеТиповСхемГВСМКД.Строения КАК бестИзменениеТиповСхемГВСМКДСтроения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеТиповСхемГВСМКД КАК бестИзменениеТиповСхемГВСМКД
	|		ПО бестИзменениеТиповСхемГВСМКДСтроения.Ссылка = бестИзменениеТиповСхемГВСМКД.Ссылка
	|ГДЕ
	|	бестИзменениеТиповСхемГВСМКД.Ссылка = &Ссылка" ;
	
	ДополнительныеСвойства.Вставить("МассивПомещений",Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
