#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	бестЛокализацияСервер.ПриСозданииНаСервере_бестПлатежныйДокумент(ЭтотОбъект);
			
	НастроитьВидимость();
	
	Массив = Новый Массив(); 
	Массив.Добавить(Тип("ДокументСсылка.бестПерерасчетЭЭ")); 
	Элементы.ДокументОснование.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) 
		И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ПлатежныйДокумент_Исправление")
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.ПлатежныйДокумент_Корректировка")) Тогда
			
		Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.бестВидыРасчета.Фактический");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновнаяРеализация

&НаКлиенте
Процедура ОсновнаяРеализацияОбъемУслугиПриИзменении(Элемент)
	ПересчитатьВсеСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияТарифНаСредневзвешаннуюПриИзменении(Элемент)
	мСтрок = Новый Массив;
	ПересчитатьЗначенияТарифовПоСтроке(мСтрок, "Средневзвешенная");
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияТарифЗаСбытовуюНадбавкуПриИзменении(Элемент)
	мСтрок = Новый Массив;
	ПересчитатьЗначенияТарифовПоСтроке(мСтрок, "Надбавка");
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияТарифЗаУслугиПоПередачиПриИзменении(Элемент)
	мСтрок = Новый Массив;;
	ПересчитатьЗначенияТарифовПоСтроке(мСтрок, "ПоПередаче");
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияТарифНаИныеУслугиПриИзменении(Элемент)
	мСтрок = Новый Массив;
	ПересчитатьЗначенияТарифовПоСтроке(мСтрок, "Иные");
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияТарифПриИзменении(Элемент)
	Если Не ДокументСвязанСВводомНачальныхОстатков(Объект.ДокументОснование, Объект.ДокументИсточник) Тогда
		мСтрок = Новый Массив;
		ПересчитатьЗначенияТарифовПоСтроке(мСтрок, "Население");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияСтавкаНДСПриИзменении(Элемент)
	ПересчитатьВсеСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияНДСВнутриПриИзменении(Элемент)
	Если Не ДокументСвязанСВводомНачальныхОстатков(Объект.ДокументОснование, Объект.ДокументИсточник) Тогда
		ПересчитатьВсеСуммыСтроки();
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ОсновнаяРеализацияТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ОсновнаяРеализация.ТекущиеДанные;
	ВыборУслугиИТочкиУчета(ТекДанные, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяРеализацияУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ОсновнаяРеализация.ТекущиеДанные;
	ВыборУслугиИТочкиУчета(ТекДанные, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКорректировку(Команда)
	ЗаполнитьКорректировкуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Объект.ОсновнаяРеализация.Очистить();
	НастроитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДокументИсточникПриИзменении(Элемент)
	Объект.ОсновнаяРеализация.Очистить();
	НастроитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСумму(мСтрок);
	
	мСтрок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мСтрок);
	
	ТекДанные = Элементы.ОсновнаяРеализация.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Для каждого эл из мСтрок Цикл
			Если эл = "Средневзвешенная" Тогда
				РассчитатьСуммы(ТекДанные, "СуммаСредневзвешенная", "СуммаСредневзвешеннаяНДС", "ТарифНаСредневзвешанную");
			ИначеЕсли эл = "Надбавка" Тогда
				РассчитатьСуммы(ТекДанные, "СуммаЗаСбытовуюНадбавку", "СуммаЗаСбытовуюНадбавкуНДС", "ТарифЗаСбытовуюНадбавку");
			ИначеЕсли эл = "ПоПередаче" Тогда
				РассчитатьСуммы(ТекДанные, "СуммаЗаУслугиПоПередачи", "СуммаЗаУслугиПоПередачиНДС", "ТарифЗаУслугиПоПередачи");
			ИначеЕсли эл = "Иные" Тогда
				РассчитатьСуммы(ТекДанные, "СуммаЗаИныеУслуги", "СуммаЗаИныеУслугиНДС", "ТарифНаИныеУслуги");
			ИначеЕсли эл = "Население" Тогда
				РассчитатьСуммы(ТекДанные, "Сумма", "СуммаНДС", "Тариф");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимость()
	Если Объект.ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Расчетный Тогда
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьАктаПерерасчета.Видимость = Ложь;
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьКорректировочнойСФ.Видимость = Ложь;
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьИсправительнойСФ.Видимость = Ложь;
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьАктаПриемаПередачиПоЭЭ.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа7", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияИсходныеДанные", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияЗаполнитьКорректировку", "Видимость", Ложь);
	ИначеЕсли Объект.ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Корректировка Тогда
		 Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьИсправительнойСФ.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснованиеВвод", "Видимость", Ложь); 
	 ИначеЕсли Объект.ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Исправление Тогда
		 Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьКорректировочнойСФ.Видимость = Ложь;
		 ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоглашениеПодписано", "Видимость", Ложь);
	КонецЕсли;
	
	Если Объект.ТипЗадолженности = Перечисления.бестВидыРасчета.Авансовый Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияГруппа3", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияГруппа5", "Видимость", Ложь);
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьСчетаНаОплатуПост.Видимость = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Процент", "Видимость", Ложь);
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьСчетаНаОплатуПред.Видимость = Ложь;
	КонецЕсли;
	
	ТолькоПросмотрСумм = Ложь;
	ТолькоПросмотрОсновнойРеализации = Ложь;
	пДокументСвязанСВводомНачальныхОстатков = ДокументСвязанСВводомНачальныхОстатков(Объект.ДокументОснование, Объект.ДокументИсточник);
	Если пДокументСвязанСВводомНачальныхОстатков Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияГруппа2", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияГруппа3", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияГруппа4", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияГруппа5", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСтавкаНДС", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияТарифНаСредневзвешанную", "Видимость", Ложь);
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ДокументОснование)
		И (Объект.ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Исправление
		Или Объект.ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Корректировка) Тогда
			ТолькоПросмотрСумм = Истина;
	Иначе
		ТолькоПросмотрОсновнойРеализации = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализация", "ТолькоПросмотр", ТолькоПросмотрОсновнойРеализации);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияИсходныеДанные", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСумма", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаНДС", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаСредневзвешенная", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаСредневзвешеннаяНДС", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаЗаСбытовуюНадбавку", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаЗаСбытовуюНадбавкуНДС", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаЗаУслугиПоПередачи", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаЗаУслугиПоПередачиНДС", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаЗаИныеУслуги", "ТолькоПросмотр", ТолькоПросмотрСумм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсновнаяРеализацияСуммаЗаИныеУслугиНДС", "ТолькоПросмотр", ТолькоПросмотрСумм);
	
	Если Не (ОбщегоНазначения.ПодсистемаСуществует("аэсПроект") И Объект.ТипЗадолженности = Перечисления.бестВидыРасчета.Авансовый) Тогда
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестПлатежныйДокументПечатьСчетаНаПредварительнуюОплату.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКорректировкуНаСервере()	
	Документы.бестПлатежныйДокумент.ЗаполнитьДанныеКорректировки(Объект);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммы(ТекДанные, КолонкаСумма, КолонкаСуммаНДС, Тариф)
	ТекДанные[КолонкаСумма] = ТекДанные.ОбъемУслуги * ТекДанные[Тариф];
	Если ТекДанные.НДСВнутри Тогда
		ТекДанные[КолонкаСуммаНДС] = ТекДанные[КолонкаСумма] / (ТекДанные.СтавкаНДС + 100) * ТекДанные.СтавкаНДС;
	Иначе			
		ТекДанные[КолонкаСуммаНДС] = ТекДанные[КолонкаСумма] * ТекДанные.СтавкаНДС / 100;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВсеСуммыСтроки()
	
	мСтрок = Новый Массив;
	мСтрок.Добавить("Средневзвешенная");
	мСтрок.Добавить("Надбавка");
	мСтрок.Добавить("ПоПередаче");
	мСтрок.Добавить("Иные");
	мСтрок.Добавить("Население");
	
	ПересчитатьСумму(мСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЗначенияТарифовПоСтроке(МассивВидовСуммДляПересчета, ВидИзменяемогоТарифа = "Население", ПересчитыватьСуммы = Истина)
	
	ТекСтрока = Элементы.ОсновнаяРеализация.ТекущиеДанные;
	
	СуммаТарифовБезСредневзвешанной = ТекСтрока.ТарифЗаСбытовуюНадбавку + ТекСтрока.ТарифЗаУслугиПоПередачи + ТекСтрока.ТарифНаИныеУслуги;
	
	Если ВидИзменяемогоТарифа = "Население" Тогда
		МассивВидовСуммДляПересчета.Добавить("Средневзвешенная");
		ТекСтрока.ТарифНаСредневзвешанную = ТекСтрока.Тариф - СуммаТарифовБезСредневзвешанной;
	Иначе
		ТекСтрока.Тариф = ТекСтрока.ТарифНаСредневзвешанную + СуммаТарифовБезСредневзвешанной;
	КонецЕсли;
	
	Если ТекСтрока.ТарифНаСредневзвешанную < 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Тариф за период не может быть меньше суммы составляющих тарифа'"));
		ТекСтрока.ТарифНаСредневзвешанную = 0;
		ТекСтрока.Тариф = СуммаТарифовБезСредневзвешанной;
		МассивВидовСуммДляПересчета.Добавить("Средневзвешенная");
	КонецЕсли;
	
	МассивВидовСуммДляПересчета.Добавить("Население");
	МассивВидовСуммДляПересчета.Добавить(ВидИзменяемогоТарифа);
	
	Если ПересчитыватьСуммы Тогда
		ПересчитатьСумму(МассивВидовСуммДляПересчета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументСвязанСВводомНачальныхОстатков(ДокументОснование, ДокументИсточник)
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.бестВводНачальныхОстатковЮридическихЛиц") Тогда
		Возврат Истина;
	Иначе
		Возврат ДокументСвязанСВводомНачальныхОстатковРекурсия(ДокументИсточник);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ДокументСвязанСВводомНачальныхОстатковРекурсия(пДокументИсточник)
	Если Не ЗначениеЗаполнено(пДокументИсточник) Тогда
		  Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(пДокументИсточник.ДокументОснование) = Тип("ДокументСсылка.бестВводНачальныхОстатковЮридическихЛиц") Тогда
		Возврат Истина;
	ИначеЕсли ЗначениеЗаполнено(пДокументИсточник.ДокументИсточник) Тогда
		Возврат ДокументСвязанСВводомНачальныхОстатковРекурсия(пДокументИсточник.ДокументИсточник);
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции     

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период, Организация, Район, ОбъектРасчета, ПростыеУслуги", КонецДня(Объект.Дата));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора, Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора, ТекДанные);
	СтруктураОтбора.ПростыеУслуги = Истина;	
	
	ПараметрыВыбораФормы = Новый Структура("СтруктураОтбора, ТипВладельца", СтруктураОтбора, "НП");
	ОписаниеОповещения = Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета", ПараметрыВыбораФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры  

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	Если РезультатЗакрытия = Неопределено Тогда  
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	ТекДанные.ТочкаУчета = РезультатЗакрытия.ТочкаУчета;
	ТекДанные.Услуга = РезультатЗакрытия.Услуга;
КонецПроцедуры

#КонецОбласти