#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет значения повышающих коэффициентов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ЗначенияПовышающихКоэффициентов(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияПовышающихКоэффициентов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Услуга, НаправлениеИспользованияТУ";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энгрЗначенияПовышающихКоэффициентовСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Заполняет значения повышающих коэффициентов коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначенияПовышающихКоэффициентовКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияПовышающихКоэффициентовКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Поставщик";
		ИмяТаблицы 					= "ЗначенияПовышающихКоэффициентов";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса значения повышающих коэффициентов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаЗначенияПовышающихКоэффициентов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Организация КАК Организация,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Район КАК Район,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Услуга КАК Услуга,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энгрЗначенияПовышающихКоэффициентовСрезПоследних.Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.энгрЗначенияПовышающихКоэффициентов.СрезПоследних КАК энгрЗначенияПовышающихКоэффициентовСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса значения повышающих коэффициентов коллекция периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаЗначенияПовышающихКоэффициентовКоллекцияПериодов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ЗначенияПовышающихКоэффициентов.Коэффициент КАК Коэффициент
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ЗначенияПовышающихКоэффициентов.Организация КАК Организация,
	|		ЗначенияПовышающихКоэффициентов.Район КАК Район,
	|		ЗначенияПовышающихКоэффициентов.Услуга КАК Услуга,
	|		ЗначенияПовышающихКоэффициентов.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		МАКСИМУМ(ЗначенияПовышающихКоэффициентов.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энгрЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ЗначенияПовышающихКоэффициентов.Организация = ТаблицаПериодов.Организация
	|				И ЗначенияПовышающихКоэффициентов.Район = ТаблицаПериодов.Район
	|				И ЗначенияПовышающихКоэффициентов.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ЗначенияПовышающихКоэффициентов.Организация,
	|		ЗначенияПовышающихКоэффициентов.Район,
	|		ЗначенияПовышающихКоэффициентов.Услуга,
	|		ЗначенияПовышающихКоэффициентов.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энгрЗначенияПовышающихКоэффициентов КАК ЗначенияПовышающихКоэффициентов
	|		ПО ВложенныйЗапрос.Организация = ЗначенияПовышающихКоэффициентов.Организация
	|			И ВложенныйЗапрос.Район = ЗначенияПовышающихКоэффициентов.Район
	|			И ВложенныйЗапрос.Услуга = ЗначенияПовышающихКоэффициентов.Услуга
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = ЗначенияПовышающихКоэффициентов.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.Период = ЗначенияПовышающихКоэффициентов.Период";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли