#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекущееЗначениеФилиала(Организация, Район, Строение) Экспорт 
	
	ТекущееЗначение	= ПолучитьПоследнее(,Новый Структура("Организация,Район,Строение",Организация,Район,Строение));
		
	Возврат ТекущееЗначение.Филиал; 	
	
КонецФункции

Процедура ЗаполнитьСхемуФилиалыСтроение(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуФилиалыСтроение());
	ОператорВыбора 					= Пакет.Операторы[0];
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	ПараметрПериод 					= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Строение";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуФилиалыСтроение()
	
	Текст  =
	"ВЫБРАТЬ
	|	ФилиалыСтроений.Организация КАК Организация,
	|	ФилиалыСтроений.Район КАК Район,
	|	ФилиалыСтроений.Строение КАК Строение,
	|	ФилиалыСтроений.Филиал КАК Филиал
	|ИЗ
	|	РегистрСведений.энргФилиалыСтроений.СрезПоследних КАК ФилиалыСтроений";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли