
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация 	 = Параметры.Организация;
	Район 			 = Параметры.Район;
	Абонент 		 = Параметры.Абонент;
	ТекущийДокумент  = Параметры.ТекущийДокумент;
	МКД		 		 = Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Абонент, "МКД").МКД;
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Параметры.Дата, Организация, Район);	
	Граница	 		 = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	НачалоПериода	 = Граница.НачалоОП;
	
	ОбновитьДокументыНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область Команды

&НаКлиенте
Процедура ГалкаИстина(Команда)
	УстановитьФлажки(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ГалкаЛожь(Команда)
	УстановитьФлажки(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Отметка)
	Для Каждого ТекСтрока из ДокументыОплат Цикл 
		ТекСтрока.Отметка = Отметка;
	КонецЦикла; 	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДокументы(Команда)
	ОбновитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументыНаСервере()
	
	ДокументыОплат.Очистить();
	
	Результат 	= Обработки.энргЖурналОплатыАбонента.ПолучитьДоступныеДокументыОплатыДляКорректировки(НачалоПериода, Организация, Район, МКД, Абонент, ТекущийДокумент);
	Выборка 	= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл	
		нСтрока = ДокументыОплат.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Ответ = ПолучитьРезультатОтвета();
	Если ПустаяСтрока(Ответ.ТекстОшибки) Тогда 		
		Закрыть(Ответ);
	Иначе 
		ПоказатьПредупреждение(, Ответ.ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатОтвета()
	Ответ 				= Новый Структура("МассивДокументовОплат, СоответствиеРаспределения, ТекстОшибки", Новый Массив, Новый Соответствие, "");	
	ТЗДокументыОплат 	= ДокументыОплат.Выгрузить(Новый Структура("Отметка", Истина));
	
	Если ТЗДокументыОплат.Количество() = 1 Тогда   
		МассивДокументовОплат 	= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗДокументыОплат);
		
		СоответствиеРаспределения 	= Новый Соответствие;
		ОписаниеСтроки				= "Услуга,ВидЗадолженности,ПериодНачисления,СуммаОплаты,Поставщик";
		МассивРаспределения			= Новый Массив;
		
		Результат 	= Обработки.энргЖурналОплатыАбонента.ПолучитьРаспределениеДокументовОплаты(ТЗДокументыОплат, Абонент);
		Выборка 	= Результат.Выбрать();
		ТекДокумент = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ТекДокумент = Выборка.ДокументОплаты Тогда
				Если НЕ ТекДокумент = Неопределено Тогда
					СоответствиеРаспределения.Вставить(ТекДокумент, МассивРаспределения);
				КонецЕсли;
				МассивРаспределения	= Новый Массив;
			КонецЕсли;
			
			нСтрока = Новый Структура(ОписаниеСтроки);		
			ЗаполнитьЗначенияСвойств(нСтрока, Выборка);
			МассивРаспределения.Добавить(нСтрока);
			
			ТекДокумент = Выборка.ДокументОплаты;
		КонецЦикла;
		Если НЕ ТекДокумент = Неопределено Тогда
			СоответствиеРаспределения.Вставить(ТекДокумент, МассивРаспределения);
		КонецЕсли;
		
		Ответ.МассивДокументовОплат 	= МассивДокументовОплат;
		Ответ.СоответствиеРаспределения = СоответствиеРаспределения;
	ИначеЕсли ТЗДокументыОплат.Количество() > 1 Тогда
		Ответ.ТекстОшибки = "Нельзя выбрать больше одного документа оплаты";
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти