#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойства массив приборов.
// 
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	энргСменаПоставщикаТочкиУчета.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	энргСменаПоставщикаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСменаПоставщикаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргСменаПоставщика.ПоказанияПриборовУчета КАК энргСменаПоставщикаПоказанияПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщика.ШкалыПриборовУчета КАК энргСменаПоставщикаШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщика.ТочкиУчета КАК энргСменаПоставщикаТочкиУчета
	|			ПО энргСменаПоставщикаШкалыПриборовУчета.Ссылка = энргСменаПоставщикаТочкиУчета.Ссылка
	|				И энргСменаПоставщикаШкалыПриборовУчета.IDСтрокиТочкиУчета = энргСменаПоставщикаТочкиУчета.IDСтроки
	|				И (НЕ энргСменаПоставщикаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|		ПО энргСменаПоставщикаПоказанияПриборовУчета.Ссылка = энргСменаПоставщикаШкалыПриборовУчета.Ссылка
	|			И энргСменаПоставщикаПоказанияПриборовУчета.IDСтроки = энргСменаПоставщикаШкалыПриборовУчета.IDСтроки
	|ГДЕ
	|	энргСменаПоставщикаПоказанияПриборовУчета.Ссылка = &Ссылка
	|	И энргСменаПоставщикаТочкиУчета.Ссылка = &Ссылка
	|	И энргСменаПоставщикаШкалыПриборовУчета.Ссылка = &Ссылка";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 	
	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	ДанныеШапки 		= ДанныеШапки();
	
	СоотвествиеКолонок 	= Новый Структура;
	СоотвествиеКолонок.Вставить("ПриборУчета",				"ПриборУчета");
	СоотвествиеКолонок.Вставить("ТекущиеПоказания",			"ТекущиеПоказания");
	СоотвествиеКолонок.Вставить("ТочкаУчета",				"ТочкаУчета");
	
	Пакет = ПолучитьДанныеТЧ();	
	ДанныеПриборовТУ				= Пакет[0]; 
	ДанныеПриборовВывод				= Пакет[1];
	ДанныеПоказанийПриборовУчета	= Пакет[2];
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,	Движения.энргПоставщикиУслугАбонента);
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета, Движения.энргПоказанияПриборовУчета);
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовВывод, Движения.энргВыводПриборовУчета);
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТЧ Из ТочкиУчета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПоставщикПосле) Тогда
			Если СтрокаТЧ.ЭтоСоставнаяУслуга Тогда
				Для каждого СтрокаСоставныхуслуг Из ПоставщикиСоставныхУслуг Цикл
					Если СтрокаТЧ.IDСтроки = СтрокаСоставныхуслуг.IDСтроки Тогда
						Если НЕ ЗначениеЗаполнено(СтрокаСоставныхуслуг.ПоставщикПосле)  Тогда	
							Отказ = истина;
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""ПоставщикПосле"" по услуге: " + СтрокаСоставныхуслуг.ЧастьСоставнойУслуги,ЭтотОбъект,"УслугиОбъектов["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла;
			Иначе
				Отказ = истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""ПоставщикПосле"" по услуге: " + СтрокаТЧ.Услуга,ЭтотОбъект,"УслугиОбъектов["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки() 	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район); 
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("КлючПомещения",			КлючПомещения);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	//ДанныеШапки.Вставить("МКД",						МКД);
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("ТочкиУчета",				ТочкиУчета);
	ДанныеШапки.Вставить("Документ",				Ссылка);  	
	ДанныеШапки.Вставить("ИмяДокумента",			"энргСменаПоставщика");
	Возврат ДанныеШапки;	
КонецФункции

Функция ПолучитьДанныеТЧ()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("мДокументы",				Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(табПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(табПоставщикиСоставныхУслуг.ПоставщикПосле, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.ПоставщикПосле
	|	КОНЕЦ КАК Поставщик,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	табПоставщикиСоставныхУслуг.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.Услуга КАК Услуга,
	|		табТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Регистратор,
	|		табТочкиУчета.ПоставщикПосле КАК ПоставщикПосле,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета
	|	ИЗ
	|		Документ.энргСменаПоставщика КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщика.ТочкиУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщика.ПоставщикиСоставныхУслуг КАК табПоставщикиСоставныхУслуг
	|		ПО (ВложенныйЗапрос.Регистратор = табПоставщикиСоставныхУслуг.Ссылка)
	|			И (ВложенныйЗапрос.IDСтроки = табПоставщикиСоставныхУслуг.IDСтроки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТУ.Период КАК Период,
	|	ВТ_ТУ.Организация КАК Организация,
	|	ВТ_ТУ.Район КАК Район,
	|	ВТ_ТУ.КлючПомещения КАК АбонентВладелец,
	|	ВТ_ТУ.КлючПомещения КАК КлючПомещения,
	|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
	|	ВТ_ТУ.Ссылка КАК Ссылка,
	|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ТУ.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_ПУ
	|ИЗ
	|	ВТ_ТУ КАК ВТ_ТУ
	|ГДЕ
	|	НЕ ВТ_ТУ.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТУ.Район,
	|	ВТ_ТУ.Период,
	|	ВТ_ТУ.Организация,
	|	ВТ_ТУ.ПериодНачисления,
	|	ВТ_ТУ.Ссылка,
	|	ВТ_ТУ.ТочкаУчета,
	|	ВТ_ТУ.ПериодРегистрации,
	|	ВТ_ТУ.ПриборУчета,
	|	ВТ_ТУ.КлючПомещения,
	|	ВТ_ТУ.КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК АбонентВладелец,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ЛОЖЬ КАК КС,
	|	ЛОЖЬ КАК Переворот,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.Шкала КАК Шкала
	|ПОМЕСТИТЬ ВТ_ПоказанияПУ
	|ИЗ
	|	Документ.энргСменаПоставщика.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Период КАК Период,
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.Район КАК Район,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|			ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|			ВложенныйЗапрос.Регистратор КАК Регистратор,
	|			табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|			табШкалыПриборовУчета.Шкала КАК Шкала
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВЫБОР
	|					КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|					ИНАЧЕ Шапка.Дата
	|				КОНЕЦ КАК Период,
	|				Шапка.Организация КАК Организация,
	|				Шапка.Район КАК Район,
	|				Шапка.КлючПомещения КАК КлючПомещения,
	|				табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|				табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|				Шапка.Дата КАК ПериодРегистрации,
	|				НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|				табТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|				Шапка.Ссылка КАК Регистратор
	|			ИЗ
	|				Документ.энргСменаПоставщика КАК Шапка
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщика.ТочкиУчета КАК табТочкиУчета
	|					ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|						И (Шапка.Ссылка В (&мДокументы))
	|						И (табТочкиУчета.Ссылка В (&мДокументы))
	|						И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщика.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|				ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|					И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ПО (ВложенныйЗапрос.Регистратор = ТаблицаПоказанийПриборовУчета.Ссылка)
	|			И (ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки)";
	
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли