#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ФормулыРасчетаДействующихТочек(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	 	
	ЕстьДействующиеТочкиПоФормуле 	= Ложь;
	Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
		Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочкиПоФормуле" Тогда
			ЕстьДействующиеТочкиПоФормуле 	= Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если Не ЕстьДействующиеТочкиПоФормуле Тогда
		РегистрыСведений.энргРасчетныеСпособыТочекУчета.ДействующиеТочкиТочкиПоФормуле(Схема,ПараметрыОтбора,"ДействующиеТочкиПоФормуле");
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаФормулыРасчетаДействующихТочек());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаФормулыРасчетаДействующихТочек()
	
	Текст  = 	
	"ВЫБРАТЬ
	|	энргФормулыРасчетаТочекУчета.Организация КАК Организация,
	|	энргФормулыРасчетаТочекУчета.Район КАК Район,
	|	энргФормулыРасчетаТочекУчета.КлючПомещения КАК КлючПомещения,
	|	энргФормулыРасчетаТочекУчета.РассчитываемаяТочка КАК РассчитываемаяТочка,
	|	энргФормулыРасчетаТочекУчета.ТочкаИсточник КАК ТочкаИсточник,
	|	энргФормулыРасчетаТочекУчета.Коэффициент КАК Коэффициент
	|ИЗ
	|	ДействующиеТочкиПоФормуле КАК ДействующиеТочкиПоФормуле
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргФормулыРасчетаТочекУчета КАК энргФормулыРасчетаТочекУчета
	|		ПО ДействующиеТочкиПоФормуле.Регистратор = энргФормулыРасчетаТочекУчета.Регистратор
	|			И ДействующиеТочкиПоФормуле.Район = энргФормулыРасчетаТочекУчета.Район
	|			И ДействующиеТочкиПоФормуле.Организация = энргФормулыРасчетаТочекУчета.Организация
	|			И ДействующиеТочкиПоФормуле.КлючПомещения = энргФормулыРасчетаТочекУчета.КлючПомещения
	|			И ДействующиеТочкиПоФормуле.ТочкаУчета = энргФормулыРасчетаТочекУчета.РассчитываемаяТочка";
	
	Возврат Текст;
		
КонецФункции

#КонецОбласти

#КонецЕсли