#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДанныеОплаты() Экспорт
	
	ГраницыОтчетногоПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);	
	НачалоОтчПериода 	= ГраницыОтчетногоПериода.НачалоОП;	

	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			МКД);
	Запрос.УстановитьПараметр("Дата", 				НачалоОтчПериода);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ОбъемНачислений", 	ЭтотОбъект.Движения.энргОбъемНачислений.Выгрузить());
	Запрос.Текст 	=
	
	"ВЫБРАТЬ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	ОбъемНачислений.Строение КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Период КАК Дата,
	|	&Ссылка КАК ДокРегистратор,
	|	ОбъемНачислений.Сумма КАК СуммаОплаты,
	|	ЛОЖЬ КАК ЭтоОплата,
	|	ЛОЖЬ КАК ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.КлючПомещения КАК КлючПомещения,
	|	ОбъемНачислений.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&ОбъемНачислений КАК ОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемНачислений.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Дата КАК Дата,
	|	ОбъемНачислений.ДокРегистратор КАК ДокРегистратор,
	|	СУММА(ОбъемНачислений.СуммаОплаты) КАК СуммаОплаты,
	|	ОбъемНачислений.ЭтоОплата КАК ЭтоОплата,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Поставщик КАК Поставщик
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ПО ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Организация,
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.Район,
	|	ОбъемНачислений.ЭтоОплата,
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Дата,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	ОбъемНачислений.ДокРегистратор,
	|	ОбъемНачислений.Поставщик";
 
	ДополнительныеСвойства.Вставить("ДанныеОплаты", Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Ответственный 			= Пользователи.ТекущийПользователь();	
 
	Движения.энргОбъемНачислений.ДополнительныеСвойства.Вставить("НеПересчитыватьСумму", Истина);
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	ГраницыОП	= энргГраницыПериодаНачисленияМенеджерВызовСервера.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	Для Каждого СтрокаНабора Из Движения.энргОбъемНачислений Цикл
		СтрокаНабора.Период 		= Дата;
		СтрокаНабора.Активность 	= Истина;
		СтрокаНабора.ПериодРасчета 	= ПериодНачисления;		
		СтрокаНабора.Район			= Район;
		СтрокаНабора.Организация 	= Организация;
		СтрокаНабора.ВидНачисления 	= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.НачалоПериода  = ГраницыОП.НачалоОП;                                        
		СтрокаНабора.КонецПериода   = ГраницыОП.ЗавершениеОП;
		
		Если не ЗначениеЗаполнено(СтрокаНабора.Поставщик) Тогда 
			СтрокаНабора.Поставщик = Константы.энргПоставщикПоУмолчанию.Получить();
		КонецЕсли;
		
	КонецЦикла;

	ДополнительныеСвойства.Вставить("ГруппаАбонентов",				Истина);
	ДополнительныеСвойства.Вставить("ПараметрыПроведения",			Новый Структура());
	ДополнительныеСвойства.Вставить("ИсточникПоступления", 			Справочники.энргИсточникиПоступления.Касса);
	ДополнительныеСвойства.Вставить("Кассир", 						Справочники.энргКонтрагенты.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("МКД", 		 					МКД);
	
	ВрТабЗначенийАбоненты = Движения.энргОбъемНачислений.Выгрузить();
	Движения.энргВзаиморасчеты.Очистить();
	Для Каждого Стр Из ВрТабЗначенийАбоненты Цикл
		
		Строканабора = Движения.энргВзаиморасчеты.Добавить();
		ЗаполнитьЗначенияСвойств(Строканабора, Стр);
		Строканабора.Сумма 		= Стр.Сумма;
		Строканабора.Абонент 	= Стр.Абонент;
		СтрокаНабора.Период 	= Дата;
		СтрокаНабора.Активность	= Истина;
		СтрокаНабора.МКД 		= ?(Стр.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка(), Стр.Строение);
		
	КонецЦикла;

	Если ПометкаУдаления Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Записать();
		КонецЦикла;		
	КонецЕсли;
 
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли