#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Ответственный	= Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	УвеличитьЗадолженностьПоПроцентамРассрочки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УвеличитьЗадолженностьПоПроцентамРассрочки()
	
	для Каждого стр из НачисленияАбонентам цикл
		Запись 						= Движения.энргПроцентыПоРассрочке.ДобавитьПриход();
		Запись.Период 				= Дата;
		Запись.ПериодНачисления 	= НачалоМесяца(Дата);
		Запись.Район				= Район;
		Запись.Организация			= Организация;
		Запись.МКД					= МКД;
		Запись.Абонент				= стр.Абонент;
		Запись.СуммаЗадолженности	= стр.СуммаНачисленныхПроцентов;
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли

