
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Абонент  = Параметры.Абонент;  	
	ДокументыОплаты.Параметры.УстановитьЗначениеПараметра("Абонент",	Абонент);
	ДокументыОплаты.Параметры.УстановитьЗначениеПараметра("Ссылка",		Параметры.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ОписаниеСтрокиОплаты  	= ОписаниеСтрокиОплаты();
	ДанныеОплаты  			= Новый Массив;
	
	Для Каждого ВыбраннаяОперации Из ВыбранныеОперации Цикл
		ОписаниеСтроки  	= Новый Структура(ОписаниеСтрокиОплаты);
		ЗаполнитьЗначенияСвойств(ОписаниеСтроки,ВыбраннаяОперации);
		ДанныеОплаты.Добавить(ОписаниеСтроки);
	КонецЦикла;
	
	Закрыть(ДанныеОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные 			= Элементы.ДокументыОплаты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеСтрокиОплаты  	= ОписаниеСтрокиОплаты();
	ОписаниеСтроки 			= Новый Структура(ОписаниеСтрокиОплаты);
	ЗаполнитьЗначенияСвойств(ОписаниеСтроки,ТекущиеДанные);
	
	УжеДобавлено  			= ВыбранныеОперации.НайтиСтроки(ОписаниеСтроки);
	
	Если УжеДобавлено.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаВыбраннаяОплата  	= ВыбранныеОперации.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаВыбраннаяОплата, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ОписаниеСтрокиОплаты()
	
	Возврат "ДокументОплаты,Абонент,Услуга,Поставщик,ПериодОплаты,СуммаОплаты,Разделитель";
	
КонецФункции
