#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргУстановитьЗначенияИзмерителей(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = энргОбщегоНазначения.ЗначениеКонстанты("энргПоставщикПоУмолчанию");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчета", энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
	
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);
	
	ЗаполнитьДанныеАбонентаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
	
	ЗаполнитьДанныеАбонентаСервер();
КонецПроцедуры 

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДанныеАбонентаСервер();
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ

&НаКлиенте
Процедура ОбновитьНаправленияИзмерителейТУ(Команда)
	
	Для Каждого ТекСтрока Из Объект.ТочкиУчета Цикл
		ОбновитьНаправленияИспользованияТУ(ТекСтрока.IDСтроки,ТекСтрока.НаправлениеИспользованияТУ);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПриАктивацииСтроки(Элементы.ЗначенияИзмерителей,"IDСтроки",ТекущиеДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)	
	ТекДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ЗначенияИзмерителей,ТекДанные); 		
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияИзмерителейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда 
		Элемент.ТекущиеДанные.IDСтроки = ТекДанные.IDСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияИзмерителейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите точку учета");
		Отказ = Истина;
	КонецЕсли; 	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательный_Процедуры_Функции

&НаСервере
Процедура ЗаполнитьДанныеАбонентаСервер()	
	
	Объект.ТочкиУчета.Очистить();
	Объект.ЗначенияИзмерителей.Очистить();
	
	Результат 								= АктивныеТУ();
	Выборка  								= Результат.выбрать();	
	Пока Выборка.следующий() цикл  	
		
		СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();		
		СтрокаТочкиУчета.IDСтроки 			= Новый УникальныйИдентификатор;
		ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета,Выборка);
		
		ОбновитьНаправленияИспользованияТУ(СтрокаТочкиУчета.IDСтроки,Выборка.НаправлениеИспользованияТУ)
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаправленияИспользованияТУ(IDСтроки,РодительскийЭлемент)
	
	Справочники.энргНаправлениеИспользованияТочекУчета.ОбновитьТЧЗначенияИзмерителей(Объект.ЗначенияИзмерителей,IDСтроки,РодительскийЭлемент,Ложь);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция АктивныеТУ()  
	
	Текст 			=
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаАбонента
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
	|			&Период,
	|			Район = &Район
	|				И Организация = &Организация
	|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиУчетаАбонента
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Район = &Район
	|				И Организация = &Организация
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаАбонента.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаАбонента КАК АктивныеТочкиУчетаАбонента)) КАК энргВладельцыТочекУчетаСрезПоследних
	|ГДЕ
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец = &КлючПомещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиУчетаАбонента.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	ТочкиУчетаАбонента КАК ТочкиУчетаАбонента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктивныеТочкиУчетаАбонента КАК АктивныеТочкиУчетаАбонента
	|		ПО ТочкиУчетаАбонента.ТочкаУчета = АктивныеТочкиУчетаАбонента.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	|	энргНаправлениеИспользованияТочекУчетаСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ИЗ
	|	ВТ_ТУ КАК ВТ_ТУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНаправлениеИспользованияТочекУчета.СрезПоследних КАК энргНаправлениеИспользованияТочекУчетаСрезПоследних
	|		ПО ВТ_ТУ.ТочкаУчета = энргНаправлениеИспользованияТочекУчетаСрезПоследних.ТочкаУчета
	|			И (НЕ энргНаправлениеИспользованияТочекУчетаСрезПоследних.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))";	
			
	Запрос  		= Новый Запрос(Текст);
	
	Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
		Запрос.УстановитьПараметр("Период",					Объект.ДатаФактическогоСобытия);
	Иначе
		Запрос.УстановитьПараметр("Период",					Объект.Дата);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Район",					Объект.Район);
	Запрос.УстановитьПараметр("Организация",			Объект.Организация);
	Запрос.УстановитьПараметр("КлючПомещения",			Объект.КлючПомещения); 	
	
	Результат  		= Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти




