&НаКлиенте
Перем УслугиТочекУчета, ПоставщикиУслугТочекУчета;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИспользоватьТарифныеЗоны = энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		Объект.Дата = НачалоМесяца(Объект.ПериодНачисления);
	КонецЕсли;

	УслугиТочекУчета 				= Новый Соответствие;
	ПоставщикиУслугТочекУчета 		= Новый Соответствие;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);		

КонецПроцедуры

&НаКлиенте
Процедура МКДОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МКДИсходный = Объект.МКД;
КонецПроцедуры

&НаКлиенте
Процедура МКДОчистка(Элемент, СтандартнаяОбработка)
	МКДИсходный = Объект.МКД;
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	
	Если Объект.Движения.энргОбъемНачислений.Количество() <> 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОчиститьДвижения", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДвижения(Результат, ПараметрыКоманды) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Движения.энргОбъемНачислений.Очистить();
	Иначе 
		Объект.МКД	= МКДИсходный;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияэнргОбъемНачисленийАбонентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДвиженияэнргОбъемНачислений.ТекущиеДанные;
	Абонент = ТекущиеДанные.Абонент;
	
	ДанныеДляЗаполннения = ТаблицаРеестраАбонентПриИзмененииНаСервере(Абонент);
	
	Если ДанныеДляЗаполннения.ЧастныйСектор И ЗначениеЗаполнено(Объект.МКД) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Абонент не относится к указанному МКД");
		ТекущиеДанные.Абонент	= ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеДляЗаполннения.ЧастныйСектор И ДанныеДляЗаполннения.Строение <> Объект.МКД Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Абонент не относится к указанному МКД");
		ТекущиеДанные.Абонент	= ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка");
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеДляЗаполннения);
	
КонецПроцедуры
 

&НаСервереБезКонтекста
функция ТаблицаРеестраАбонентПриИзмененииНаСервере(Абонент)
	
	ПолучаемыеРеквизиты 					= "Район,Организация,КлючПомещения,Строение,Помещение,ЧастныйСектор";
	
	ЗначенияРеквизитовАбонента 				= Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Абонент,ПолучаемыеРеквизиты);

	Возврат ЗначенияРеквизитовАбонента;
	
КонецФункции

#КонецОбласти 

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	//ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти
