#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 		= Пользователи.ТекущийПользователь();	
	
	ГраницыПериода  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;
	ДополнительныеСвойства.Вставить("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	ДополнительныеСвойства.Вставить("ДанныеОплаты",			ДанныеОплаты(НачалоПериодаРасчета));
	ДополнительныеСвойства.Вставить("Кассир",				Справочники.Пользователи.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ЭтоОплата",	Ложь);	

	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	ДанныеШапки = ДанныеШапки();
	
	энргРаботаСТочкамиУчетаСервер.УстановитьБездоговорноеПотребление(ДанныеШапки,Движения,"Услуги");
	энргРаботаСПараметрамиРасчетаАбонентаСервер.ЗаполнитьВидБлагоустроства(ДанныеШапки, Движения);
	энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьГруппуПотребителей(Движения, ДанныеШапки);

	Движения.энргОбъемНачислений.Записывать = Ложь;
	Движения.Записать();
	
	РассчитатьОбъемНачислений(ДанныеШапки);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
		
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",				Район);
	ДанныеШапки.Вставить("Организация",			Организация); 
	ДанныеШапки.Вставить("КлючПомещения",		КлючПомещения);
	ДанныеШапки.Вставить("ПериодРегистрации",	Дата);
	ДанныеШапки.Вставить("ПериодНачисления",	ПериодНачисления);  
	ДанныеШапки.Вставить("Абонент",				Абонент);                   	
	ДанныеШапки.Вставить("Услуги",				Услуги);
	ДанныеШапки.Вставить("ИмяДокумента",		"энргАктБездоговорногоПотребления");
	ДанныеШапки.Вставить("Документ",			Ссылка);
	ДанныеШапки.Вставить("КоличествоДней",		(ОкончаниеПотребления - НачалоПотребления)/(24*3600) + 1);
	ДанныеШапки.Вставить("ВидыБлагоустройстваТарифныеКатегории", Услуги);
	
	Возврат ДанныеШапки;	

КонецФункции

Процедура РассчитатьОбъемНачислений(ДанныеШапки)
	
	ГраницыПериода  											= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	
	НачалоПериодаРасчета										= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  										= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  												= ГраницыПериода.ДнейВПериоде; 
	ПериодНовогоТарифа 											= энргОбщегоНазначения.ЗначениеКонстанты("энргДеньНачалаПримененияНовогоТарифа");
	КонецПериода  												= КонецМесяца(ПериодНачисления);

	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("АктПотребления", Ссылка);  
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	Запрос.УстановитьПараметр("ГодПостройки", КлючПомещения.Строение.ГодПостройки);
	Запрос.УстановитьПараметр("КоличествоЭтажей", КлючПомещения.Строение.КоличествоЭтажей);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ТипНачисления", Перечисления.энргТипыНачислений.ИндивидуальныеНачисления);
	
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодНачисления); 
	Запрос.УстановитьПараметр("Помещение", КлючПомещения.Помещение);
	Запрос.УстановитьПараметр("Строение", КлючПомещения.Строение); 
	
	Запрос.Текст = ТекстЗапросаНачисленияБездоговорногоПодключения();
	Запрос.Выполнить();
	
	Набор = Движения.энргОбъемНачислений;
	
	Запрос.Текст = ТекстЗапросаДанныеДляНачисления();
	
	МассивПериодов = РазбитьПериоды();
	Для Каждого ТекПериод Из МассивПериодов Цикл
		РассчитатьОбъемНачисленийПериод(ДанныеШапки,ТекПериод,Набор,Запрос,КонецПериодаРасчета);	
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Процедура РассчитатьОбъемНачисленийПериод(ДанныеШапки,ТекПериод,Набор,Запрос,КонецПериодаРасчетаОбщий)
	
	// КонецПериодаРасчета
	// ПериодРасчета
	// НачалоПериода,КонецПериода  НачалоПодключения, &КонецПодключения

	ГраницыПериода  											= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ТекПериод.КонецПериода,Ложь);
	
	НачалоПериодаРасчета										= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  										= ГраницыПериода.ЗавершениеОП;
	ДнейВПериоде  												= ГраницыПериода.ДнейВПериоде;
	
	Запрос.УстановитьПараметр("КонецПериодаРасчета", КонецПериодаРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления", Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ТекПериод.КонецПериода, Организация, Район));
	Запрос.УстановитьПараметр("НачалоПодключения", ТекПериод.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПодключения", ТекПериод.КонецПериода);
	
	ПИ = 3.141592653589793238462643;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
 
	Пока Выборка.Следующий() Цикл
		
		СтрокаНабора = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,Выборка);
		
		//СтрокаНабора.Период				= КонецПериодаРасчетаОбщий - 1;
		СтрокаНабора.Период				= Дата;
		СтрокаНабора.ВидНачисления		= Перечисления.энргВидыНачислений.Перерасчет;
		СтрокаНабора.СпособНачисления 	= Перечисления.энргСпособНачислений.БездоговорноеПотребление;
		
		Если Не ЗначениеЗаполнено(Выборка.ДиаметрСечения) И Не ЗначениеЗаполнено(Выборка.МощностьПодключаемогоОборудования) Тогда
			СтрокаНабора.ОбъемУслуги	= Выборка.НормаПотребления * Выборка.КоличествоПрописанных * 10 * (Выборка.КоличествоДней/ДнейВПериоде);
		ИначеЕсли ЗначениеЗаполнено(Выборка.ДиаметрСечения) Тогда
			СтрокаНабора.ОбъемУслуги	= Выборка.СкоростьДвижения * ((ПИ * Pow(Выборка.ДиаметрСечения, 2))/4) * 0.0036 * Выборка.КоличествоДней * 24;
		ИначеЕсли  ЗначениеЗаполнено(Выборка.МощностьПодключаемогоОборудования) Тогда
			СтрокаНабора.ОбъемУслуги	= Выборка.КоличествоДней * Выборка.МощностьПодключаемогоОборудования;
		КонецЕсли; 
		
		СтрокаНабора.ОбъемУслугиПотребленный = СтрокаНабора.ОбъемУслуги;
		СтрокаНабора.Сумма = СтрокаНабора.ОбъемУслуги * Выборка.ЗначениеТарифа;
		
	КонецЦикла;
	
КонецПроцедуры
 
Функция ТекстЗапросаНачисленияБездоговорногоПодключения()
	
	Текст  =  
		"ВЫБРАТЬ
		|	энргВидБлагоустройствАбонентаСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройства,
		|	энргВидБлагоустройствАбонентаСрезПоследних.Услуга КАК Услуга,
		|	энргВидБлагоустройствАбонентаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргВидБлагоустройствАбонентаСрезПоследних.Район КАК Район,
		|	энргВидБлагоустройствАбонентаСрезПоследних.Организация КАК Организация
		|ПОМЕСТИТЬ ВидБлагоустройствАбонента
		|ИЗ
		|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргВидБлагоустройствАбонентаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргГруппыПотребителейАбонентовСрезПоследних.Организация КАК Организация,
		|	энргГруппыПотребителейАбонентовСрезПоследних.Район КАК Район,
		|	энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргГруппыПотребителейАбонентовСрезПоследних.Услуга КАК Услуга,
		|	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей
		|ПОМЕСТИТЬ ТарифныеКатегории
		|ИЗ
		|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних КАК энргГруппыПотребителейАбонентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргБездоговорноеПотребление.Организация КАК Организация,
		|	энргБездоговорноеПотребление.Район КАК Район,
		|	энргБездоговорноеПотребление.КлючПомещения КАК КлючПомещения,
		|	энргБездоговорноеПотребление.Услуга КАК Услуга,
		|	энргБездоговорноеПотребление.ПериодНачисления КАК ПериодНачисления,
		|	энргБездоговорноеПотребление.КоличествоДней КАК КоличествоДней,
		|	энргБездоговорноеПотребление.ДиаметрСечения КАК ДиаметрСечения,
		|	энргБездоговорноеПотребление.МощностьПодключаемогоОборудования КАК МощностьПодключаемогоОборудования,
		|	энргБездоговорноеПотребление.Абонент КАК Абонент,
		|	ЕСТЬNULL(энргНормаСкоростиДвиженияВодыСрезПоследних.СкоростьДвижения, 0) КАК СкоростьДвижения,
		|	энргБездоговорноеПотребление.КлючПомещения.Строение КАК Строение,
		|	энргБездоговорноеПотребление.КлючПомещения.Помещение КАК Помещение,
		|	энргБездоговорноеПотребление.КлючПомещения.ЧастныйСектор КАК ЧастныйСектор
		|ПОМЕСТИТЬ БездоговорноеПотребление
		|ИЗ
		|	РегистрСведений.энргБездоговорноеПотребление КАК энргБездоговорноеПотребление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНормаСкоростиДвиженияВоды.СрезПоследних(&КонецПериодаРасчета, ) КАК энргНормаСкоростиДвиженияВодыСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	энргБездоговорноеПотребление.Регистратор = &АктПотребления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКоличествоПроживающихСрезПоследних.Организация КАК Организация,
		|	энргКоличествоПроживающихСрезПоследних.Район КАК Район,
		|	энргКоличествоПроживающихСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргКоличествоПроживающихСрезПоследних.Количество КАК Количество
		|ПОМЕСТИТЬ КоличествоПроживающих
		|ИЗ
		|	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПроживающихСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКоличествоСобственниковСрезПоследних.Организация КАК Организация,
		|	энргКоличествоСобственниковСрезПоследних.Район КАК Район,
		|	энргКоличествоСобственниковСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргКоличествоСобственниковСрезПоследних.Количество КАК Количество
		|ПОМЕСТИТЬ КоличествоСобственников
		|ИЗ
		|	РегистрСведений.энргКоличествоСобственников.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоСобственниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргТипСобственностиАбонентовСрезПоследних.Организация КАК Организация,
		|	энргТипСобственностиАбонентовСрезПоследних.Район КАК Район,
		|	энргТипСобственностиАбонентовСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности КАК ТипСобственности
		|ПОМЕСТИТЬ ВидыСобственности
		|ИЗ
		|	РегистрСведений.энргТипСобственностиАбонентов.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргТипСобственностиАбонентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКоличествоКомнатСрезПервых.Организация КАК Организация,
		|	энргКоличествоКомнатСрезПервых.Район КАК Район,
		|	энргКоличествоКомнатСрезПервых.КлючПомещения КАК КлючПомещения,
		|	энргКоличествоКомнатСрезПервых.Количество КАК Количество
		|ПОМЕСТИТЬ КоличествоКомнат
		|ИЗ
		|	РегистрСведений.энргКоличествоКомнат.СрезПервых(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоКомнатСрезПервых
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКоличествоПрописанныхСрезПоследних.Организация КАК Организация,
		|	энргКоличествоПрописанныхСрезПоследних.Район КАК Район,
		|	энргКоличествоПрописанныхСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргКоличествоПрописанныхСрезПоследних.Количество КАК Количество
		|ПОМЕСТИТЬ КоличествоПрописанных
		|ИЗ
		|	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргКоличествоПрописанныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БездоговорноеПотребление.Организация КАК Организация,
		|	БездоговорноеПотребление.Район КАК Район,
		|	БездоговорноеПотребление.КлючПомещения КАК КлючПомещения,
		|	БездоговорноеПотребление.Услуга КАК Услуга,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	БездоговорноеПотребление.КоличествоДней КАК КоличествоДней,
		|	БездоговорноеПотребление.ДиаметрСечения КАК ДиаметрСечения,
		|	БездоговорноеПотребление.МощностьПодключаемогоОборудования КАК МощностьПодключаемогоОборудования,
		|	БездоговорноеПотребление.Абонент КАК Абонент,
		|	БездоговорноеПотребление.СкоростьДвижения КАК СкоростьДвижения,
		|	ЕСТЬNULL(КоличествоКомнат.Количество, 0) КАК КоличествоКомнат,
		|	ЕСТЬNULL(КоличествоПроживающих.Количество, 0) КАК КоличествоПроживающих,
		|	ЕСТЬNULL(КоличествоПрописанных.Количество, 0) КАК КоличествоПрописанных,
		|	ЕСТЬNULL(КоличествоСобственников.Количество, 0) КАК КоличествоСобственников,
		|	ЕСТЬNULL(ВидыСобственности.ТипСобственности, ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка)) КАК ВидСобственности,
		|	&ГодПостройки КАК ГодПостройки,
		|	ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) КАК НаправлениеИспользованияТУ,
		|	&КоличествоЭтажей КАК КоличествоЭтажей,
		|	ЕСТЬNULL(ВидБлагоустройствАбонента.ВидБлагоустройства, ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)) КАК ВидБлагоустройства,
		|	ТарифныеКатегории.ГруппаПотребителей КАК ГруппаПотребителей,
		|	БездоговорноеПотребление.Строение КАК Строение,
		|	БездоговорноеПотребление.Помещение КАК Помещение,
		|	БездоговорноеПотребление.ЧастныйСектор КАК ЧастныйСектор
		|ПОМЕСТИТЬ ВсеПараметрыРасчета
		|ИЗ
		|	БездоговорноеПотребление КАК БездоговорноеПотребление
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоПрописанных КАК КоличествоПрописанных
		|		ПО БездоговорноеПотребление.Организация = КоличествоПрописанных.Организация
		|			И БездоговорноеПотребление.Район = КоличествоПрописанных.Район
		|			И БездоговорноеПотребление.КлючПомещения = КоличествоПрописанных.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоКомнат КАК КоличествоКомнат
		|		ПО БездоговорноеПотребление.Организация = КоличествоКомнат.Организация
		|			И БездоговорноеПотребление.Район = КоличествоКомнат.Район
		|			И БездоговорноеПотребление.КлючПомещения = КоличествоКомнат.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСобственности КАК ВидыСобственности
		|		ПО БездоговорноеПотребление.Организация = ВидыСобственности.Организация
		|			И БездоговорноеПотребление.Район = ВидыСобственности.Район
		|			И БездоговорноеПотребление.КлючПомещения = ВидыСобственности.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоПроживающих КАК КоличествоПроживающих
		|		ПО БездоговорноеПотребление.Организация = КоличествоПроживающих.Организация
		|			И БездоговорноеПотребление.Район = КоличествоПроживающих.Район
		|			И БездоговорноеПотребление.КлючПомещения = КоличествоПроживающих.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСобственников КАК КоличествоСобственников
		|		ПО БездоговорноеПотребление.Организация = КоличествоСобственников.Организация
		|			И БездоговорноеПотребление.Район = КоличествоСобственников.Район
		|			И БездоговорноеПотребление.КлючПомещения = КоличествоСобственников.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидБлагоустройствАбонента КАК ВидБлагоустройствАбонента
		|		ПО БездоговорноеПотребление.Организация = ВидБлагоустройствАбонента.Организация
		|			И БездоговорноеПотребление.Район = ВидБлагоустройствАбонента.Район
		|			И БездоговорноеПотребление.КлючПомещения = ВидБлагоустройствАбонента.КлючПомещения
		|			И БездоговорноеПотребление.Услуга = ВидБлагоустройствАбонента.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТарифныеКатегории КАК ТарифныеКатегории
		|		ПО БездоговорноеПотребление.Организация = ТарифныеКатегории.Организация
		|			И БездоговорноеПотребление.Район = ТарифныеКатегории.Район
		|			И БездоговорноеПотребление.КлючПомещения = ТарифныеКатегории.КлючПомещения
		|			И БездоговорноеПотребление.Услуга = ТарифныеКатегории.Услуга";
		
		
		
		Текст  = Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		Текст = Текст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНорматива();
		
		Текст  = Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
		Текст  = Текст +
		"ВЫБРАТЬ
		|	ВсеПараметрыРасчета.*,
		|	КлючиНорматива.КлючНорматива КАК КлючНорматива
		|ПОМЕСТИТЬ ВсеПараметрыРасчетаНорматив
		|ИЗ
		|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
		|		ПО (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
		|		И КлючиНорматива.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)";
		
		
		//Текст  = Текст + "
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|" 
		//+ 
		
	
	Возврат Текст;
КонецФункции                                            

Функция ТекстЗапросаДанныеДляНачисления()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	энргЗначенияНормативовПотребленияСрезПоследних.Организация КАК Организация,
		|	энргЗначенияНормативовПотребленияСрезПоследних.Район КАК Район,
		|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива КАК КлючНорматива,
		|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
		|	энргЗначенияНормативовПотребленияСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
		|ПОМЕСТИТЬ ЗначенияТекущихНормПотребления
		|ИЗ
		|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТипНачисления = &ТипНачисления) КАК энргЗначенияНормативовПотребленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
		|	энргЗначенияТарифовСрезПоследних.Район КАК Район,
		|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
		|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
		|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
		|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
		|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
		|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
		|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри
		|ПОМЕСТИТЬ ЗначенияТекущихТарифов
		|ИЗ
		|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
		|			&КонецПериодаРасчета,
		|			Организация = &Организация
		|				И Район = &Район) КАК энргЗначенияТарифовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ПериодРасчета КАК ПериодРасчета,
		|	&Строение КАК Строение,
		|	&Помещение КАК Помещение,
		|	ВсеПараметрыРасчетаНорматив.Организация КАК Организация,
		|	ВсеПараметрыРасчетаНорматив.ЧастныйСектор КАК ЧастныйСектор,
		|	ВсеПараметрыРасчетаНорматив.Район КАК Район,
		|	ВсеПараметрыРасчетаНорматив.КлючПомещения КАК КлючПомещения,
		|	ВсеПараметрыРасчетаНорматив.Услуга КАК Услуга,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	РАЗНОСТЬДАТ(&НачалоПодключения, &КонецПодключения, ДЕНЬ) КАК КоличествоДней,
		|	ВсеПараметрыРасчетаНорматив.ДиаметрСечения КАК ДиаметрСечения,
		|	ВсеПараметрыРасчетаНорматив.МощностьПодключаемогоОборудования КАК МощностьПодключаемогоОборудования,
		|	ВсеПараметрыРасчетаНорматив.Абонент КАК Абонент,
		|	ВсеПараметрыРасчетаНорматив.СкоростьДвижения КАК СкоростьДвижения,
		|	ВсеПараметрыРасчетаНорматив.КоличествоКомнат КАК КоличествоКомнат,
		|	ВсеПараметрыРасчетаНорматив.КоличествоПроживающих КАК КоличествоПроживающих,
		|	ВсеПараметрыРасчетаНорматив.КоличествоПрописанных КАК КоличествоПрописанных,
		|	ВсеПараметрыРасчетаНорматив.ВидБлагоустройства КАК ВидБлагоустройства,
		|	ВсеПараметрыРасчетаНорматив.ГодПостройки КАК ГодПостройки,
		|	ВсеПараметрыРасчетаНорматив.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ВсеПараметрыРасчетаНорматив.КоличествоЭтажей КАК КоличествоЭтажей,
		|	ВсеПараметрыРасчетаНорматив.КлючНорматива КАК КлючНорматива,
		|	ЕСТЬNULL(ЗначенияТекущихНормПотребления.ЗначениеНорматива, 0) КАК НормаПотребления,
		|	ЗначенияТекущихТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ЕСТЬNULL(ЗначенияТекущихТарифов.Значение, 0) КАК ЗначениеТарифа,
		|	ВЫРАЗИТЬ(ВсеПараметрыРасчетаНорматив.Услуга КАК Справочник.энргВидыУслуг).НормативДляИндивидуальных
		|		И ВЫРАЗИТЬ(ВсеПараметрыРасчетаНорматив.Услуга КАК Справочник.энргВидыУслуг).КорректироватьИндивидуальныйОбъемСУчетомОДПУ КАК ЭтоОтопление
		|ИЗ
		|	ВсеПараметрыРасчетаНорматив КАК ВсеПараметрыРасчетаНорматив
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихТарифов КАК ЗначенияТекущихТарифов
		|		ПО ВсеПараметрыРасчетаНорматив.Организация = ЗначенияТекущихТарифов.Организация
		|			И ВсеПараметрыРасчетаНорматив.Район = ЗначенияТекущихТарифов.Район
		|			И ВсеПараметрыРасчетаНорматив.Услуга = ЗначенияТекущихТарифов.Услуга
		|			И ВсеПараметрыРасчетаНорматив.ГруппаПотребителей = ЗначенияТекущихТарифов.ГруппаПотребителей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
		|		ПО ВсеПараметрыРасчетаНорматив.Организация = ЗначенияТекущихНормПотребления.Организация
		|			И ВсеПараметрыРасчетаНорматив.Район = ЗначенияТекущихНормПотребления.Район
		|			И ВсеПараметрыРасчетаНорматив.КлючНорматива = ЗначенияТекущихНормПотребления.КлючНорматива
		|			И ВсеПараметрыРасчетаНорматив.Услуга = ЗначенияТекущихНормПотребления.Услуга
		|			И ВсеПараметрыРасчетаНорматив.НаправлениеИспользованияТУ = ЗначенияТекущихНормПотребления.НаправлениеИспользованияТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЗначенияТекущихНормПотребления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЗначенияТекущихТарифов";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция РазбитьПериоды()
	
	МесяцНач = Месяц(НачалоПотребления);
	МесяцКон = Месяц(ОкончаниеПотребления);
	ГодНач	= Год(НачалоПотребления);
	ГодКон	= Год(ОкончаниеПотребления);
	
	МассивПериодов = Новый Массив;
	
	Для СчГод = ГодНач По ГодКон Цикл
		Для СчМесяц = МесяцНач По МесяцКон Цикл
			ТекДата = Дата(СчГод,СчМесяц,1);
			НовПериод = Новый Структура("НачалоПериода,КонецПериода",НачалоМесяца(ТекДата),КонецМесяца(ТекДата));
			Если СчГод	= Год(НачалоПотребления) И СчМесяц = Месяц(НачалоПотребления) Тогда
				НовПериод.НачалоПериода = НачалоПотребления;	
			КонецЕсли; 
			Если СчГод	= Год(ОкончаниеПотребления) И СчМесяц = Месяц(ОкончаниеПотребления) Тогда
				НовПериод.КонецПериода = КонецДня(ОкончаниеПотребления);	
			КонецЕсли;
			МассивПериодов.Добавить(НовПериод);
		КонецЦикла; 
	КонецЦикла;
	
	Возврат МассивПериодов;
		
КонецФункции

// Функция - Данные оплаты
// Возвращаемое значение:
//   - 
Функция ДанныеОплаты(НачалоПериодаРасчета);
			
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	энргАктБездоговорногоПотребления.Организация КАК Организация,
	|	энргАктБездоговорногоПотребления.Район КАК Район,
	|	энргАктБездоговорногоПотребления.ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(энргАктБездоговорногоПотребления.КлючПомещения.ЧастныйСектор, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргАктБездоговорногоПотребления.КлючПомещения.Строение
	|	КОНЕЦ КАК МКД,
	|	энргАктБездоговорногоПотребления.Абонент КАК Абонент,
	|	0 КАК СуммаОплаты,
	|	ЛОЖЬ КАК ЭтоОплата
	|ИЗ
	|	Документ.энргАктБездоговорногоПотребления КАК энргАктБездоговорногоПотребления
	|ГДЕ
	|	энргАктБездоговорногоПотребления.Ссылка = &Ссылка";	
	Результат  		= Запрос.Выполнить();
	Возврат Результат;	 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли