#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаВыбораПериода(Команда)
	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Показать(ОписаниеОповещенияВыборПериода);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", 	Организация);
	ПараметрыОтчета.Вставить("НачалоПериода", 	НачалоПериода);                
	ПараметрыОтчета.Вставить("КонецПериода", 	КонецПериода);
	

	СформироватьНаСервере(РезультатОтчета, ПараметрыОтчета);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборПериодаЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;	
	НачалоПериода 		= ИнтервалУстановлен.ДатаНачала;
	КонецПериода 		= ИнтервалУстановлен.ДатаОкончания;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабДок, ПараметрыОтчета)
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	ТекОбъект.СформироватьОтчет(ТабДок, ПараметрыОтчета);
КонецПроцедуры

#КонецОбласти