#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
		
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииОперацияСПриборомУчета(КомандыСоздатьНаОсновании);  	
		
КонецФункции

// Заполняет форму списка возможными операциями.
// 
// Возвращаемое значение:
//   СписокЗначений.
//
Функция ЗаполнитьСписокВозможныхОперацийФормаСписка() Экспорт 
	СписокОпераций = Новый СписокЗначений;
	ДополнитьСписокВыбораДоступнымиВидамиОпераций(СписокОпераций);

	Возврат СписокОпераций;
КонецФункции 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Основание				= Неопределено;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргРегистрацияПретензийОтПотребителяИсполнителя", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргРегистрацияПретензийОтПотребителяИсполнителя", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргРегистрацияПретензийОтПотребителяИсполнителя", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента"	,"энргРегистрацияПретензийОтПотребителяИсполнителя");
			Параметры.вставить("ВыборОперации"	,Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

Функция СоотвествиеВидовОперацииИПрефиксовФорм() Экспорт	
	Соотвествие = Новый Соответствие;
	ДополнитьСоотвествиеВидовОперацииИПрефиксовФорм(Соотвествие);
	
	Возврат Соотвествие;	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры);
	
	ДанныеСтроения		= ДополнительныеСвойства.ДанныеСтроения;
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  			= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы"		, ДокументСсылка);
	Запрос.УстановитьПараметр("ЧастныйСектор"	, ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение"		, ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("Помещение"		, ДанныеСтроения.Помещение);
			
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСписокВыбораДоступнымиВидамиОпераций(СписокОпераций)
	ВидыОперацийОбъекта 	= Перечисления.энргВидыОпераций;
	
	РегистрацияПретензии 	= ВидыОперацийОбъекта.энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии;
	АннулированиеПретензии	= ВидыОперацийОбъекта.энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии;	
	
	СписокОпераций.добавить(РегистрацияПретензии	, "Регистрация претензии");
	СписокОпераций.добавить(АннулированиеПретензии 	, "Аннулирование претензии");		
КонецПроцедуры

Процедура ДополнитьСоотвествиеВидовОперацииИПрефиксовФорм(Соотвествие)
	ВидыОперацийОбъекта 	= Перечисления.энргВидыОпераций;
	
	РегистрацияПретензии 	= ВидыОперацийОбъекта.энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии;
	АннулированиеПретензии	= ВидыОперацийОбъекта.энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии;	
	
	Соотвествие.Вставить(РегистрацияПретензии	, "РегистрацияПретензии");
	Соотвествие.Вставить(АннулированиеПретензии	, "АннулированиеПретензии");	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	табШапка.Дата КАК Период,
	|	табШапка.Организация КАК Организация,
	|	табШапка.Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	табШапка.КлючПомещения КАК КлючПомещения,
	|	табШапка.ТочкаУчета КАК ТочкаУчета,
	|	табШапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ЛОЖЬ КАК ОбязанностиВыполнены
	|ИЗ
	|	Документ.энргРегистрацияПретензийОтПотребителяИсполнителя КАК табШапка
	|ГДЕ
	|	табШапка.Ссылка В(&мДокументы)
	|	И табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	табШапка.Дата,
	|	табШапка.Организация,
	|	табШапка.Район,
	|	&ЧастныйСектор,
	|	&Строение,
	|	&Помещение,
	|	табШапка.КлючПомещения,
	|	энргРегистрацияПретензийОтПотребителяИсполнителяТочкиУчета.ТочкаУчета,
	|	табШапка.Дата,
	|	НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.энргРегистрацияПретензийОтПотребителяИсполнителя КАК табШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПретензийОтПотребителяИсполнителя.ТочкиУчета КАК энргРегистрацияПретензийОтПотребителяИсполнителяТочкиУчета
	|		ПО (табШапка.Ссылка В (&мДокументы))
	|			И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии))
	|			И табШапка.Ссылка = энргРегистрацияПретензийОтПотребителяИсполнителяТочкиУчета.Ссылка";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли