#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргПерерасчет(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	КонецЕсли; 			

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	УстановитьПериодПерерасчета();
	УстановитьСуммыШапки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПраваДокументаПерерасчет(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.ПериодНачисления = ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	ЗаполнитьЗадолженностьАбонента();
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		ПустыеСсылки = ПустыеСсылкиПриИзмененииАбонента();
		Объект.КлючПомещения	= ПустыеСсылки.КлючПомещения;
		ЭтаФорма.Помещение 		= ПустыеСсылки.Помещение;
		ЭтаФорма.Строение 		= ПустыеСсылки.Строение;
	КонецЕсли;
	
	ЗаполнитьЗадолженностьАбонента();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.НачПериода = НачалоМесяца(Период.ДатаНачала);
	Объект.КонПериода = НачалоМесяца(Период.ДатаОкончания);
	
	ЗаполнитьЗадолженностьАбонента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадолженностьБыла

&НаКлиенте
Процедура ЗадолженностьБылаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьБылаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеЗадолженностиНовое

&НаКлиенте
Процедура РаспределениеЗадолженностиНовоеАбонентПриИзменении(Элемент)
	ТекДанные = Элементы.РаспределениеЗадолженностиНовое.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекДанные.Абонент) Тогда
		ПустыеСсылки = ПустыеСсылкиПриИзмененииАбонента();
		ТекДанные.КлючПомещения	= ПустыеСсылки.КлючПомещения;
	КонецЕсли;
	
	ТекДанные.КлючПомещения	= КлючПомещенияАбонента(ТекДанные.Абонент);	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗадолженностиНовоеЗадолженностьПриИзменении(Элемент)
	ТекДанные = Элементы.РаспределениеЗадолженностиНовое.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяСумма = ПолучитьСуммуКРаспределению(ТекДанные);
	ПриИзмененииЗадолженностиРаспределении(ТекДанные, ОбщаяСумма);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗадолженностиНовоеДоляПриИзменении(Элемент)
	ТекДанные = Элементы.РаспределениеЗадолженностиНовое.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяСумма = ПолучитьСуммуКРаспределению(ТекДанные);	
	ТекДанные.Задолженность = ОбщаяСумма * ТекДанные.Доля; 
	ПриИзмененииЗадолженностиРаспределении(ТекДанные, ОбщаяСумма);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗадолженностиНовоеПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.РаспределениеЗадолженностиНовое.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаспределеннаяСумма = ПолучитьРаспределеннуюСумму(ТекДанные);
	ДанныеПерераспределения = Новый Структура("Услуга,Поставщик,ВидЗадолженности", ТекДанные.Услуга, ТекДанные.Поставщик, ТекДанные.ВидЗадолженности);
	ПерераспределитьЗадолженностьАбонентаШапки(РаспределеннаяСумма, ДанныеПерераспределения);
	УстановитьСуммыШапки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСДатами

&НаСервереБезКонтекста
Функция ОпределитьПериодНачисления(Дата, Организация, Район)
	 Возврат Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Дата, Организация, Район);		
КонецФункции

&НаСервере
Процедура УстановитьПериодПерерасчета()
	Период.ДатаНачала 		= Объект.НачПериода;
	Период.ДатаОкончания 	= Объект.КонПериода;
КонецПроцедуры 

#КонецОбласти

#Область РаботаПриИзмененииАбонента

&НаСервереБезКонтекста
Функция ПустыеСсылкиПриИзмененииАбонента()
	Результат = Новый Структура;
	Результат.Вставить("КлючПомещения"	, Справочники.энргКлючиПомещений.ПустаяСсылка());
	Результат.Вставить("Помещение"		, Справочники.энргПомещения.ПустаяСсылка());
	Результат.Вставить("Строение"		, Справочники.энргСтроения.ПустаяСсылка());
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция КлючПомещенияАбонента(АбонентСсылка)
	Результат = Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(АбонентСсылка, "КлючПомещения").КлючПомещения;	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	Обработки.энргКлючиПомещенийМенеджер.ЗаполнитьДанныеКлючаПомещения(ЭтотОбъект, ДанныеПомещенияРезультат);
КонецПроцедуры

#КонецОбласти

#Область РаботаСЗадолженностью

&НаКлиенте
Процедура ЗаполнитьЗадолженностьАбонента()
	ЗаполнитьЗадолженностьАбонентаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадолженностьАбонентаНаСервере()
	ОчиститьТаблицы();
	
	Граница  			= Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	МКД 				= ?(НЕ ЧастныйСектор, Строение, Справочники.энргСтроения.ПустаяСсылка());
	ДопПараметры 		= Новый Структура("ПериодОплатыНачало, ПериодОплатыКонец", Объект.НачПериода, Объект.КонПериода); 	
	РезультатЗапроса 	= энргРаботаСЛицевымСчетомСервер.ДанныеДляОплатыАбонента(Граница, Объект.Организация, Объект.Район, МКД, Объект.Абонент, ДопПараметры);
	Выборка				= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НСтрока = Объект.ЗадолженностьБыла.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
		НСтрока.ЗадолженностьНовая = Выборка.Задолженность;
	КонецЦикла;
		
	УстановитьСуммыШапки();
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииЗадолженностиРаспределении(ТекДанные, ОбщаяСумма)	
	РаспределеннаяСумма = ПолучитьРаспределеннуюСумму(ТекДанные);
	Если НЕ ОбщаяСумма >= РаспределеннаяСумма Тогда
		ТекДанные.Задолженность = 0;
		РаспределеннаяСумма 	= ПолучитьРаспределеннуюСумму(ТекДанные);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма долга распределенна некорректно.");
	КонецЕсли;
	ДанныеПерераспределения = Новый Структура("Услуга,Поставщик,ВидЗадолженности", ТекДанные.Услуга, ТекДанные.Поставщик, ТекДанные.ВидЗадолженности);
	ПерераспределитьЗадолженностьАбонентаШапки(РаспределеннаяСумма, ДанныеПерераспределения);
	УстановитьСуммыШапки();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСуммуКРаспределению(ТекДанные)
	Результат = 0;
	Для Каждого СтрокаНабора из Объект.ЗадолженностьБыла Цикл 
		Если НЕ СтрокаСуммыСоответствуетУсловиям(ТекДанные, СтрокаНабора) Тогда 
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + СтрокаНабора.Задолженность;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьРаспределеннуюСумму(ТекДанные)
	Результат = 0;
	Для Каждого СтрокаНабора из Объект.РаспределениеЗадолженностиНовое Цикл 
		Если НЕ СтрокаСуммыСоответствуетУсловиям(ТекДанные, СтрокаНабора) Тогда 
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + СтрокаНабора.Задолженность;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СтрокаСуммыСоответствуетУсловиям(ОсновнаяСтрока, СтрокаНабора)
	Результат = ОсновнаяСтрока.Услуга = СтрокаНабора.Услуга 
		И ОсновнаяСтрока.Поставщик = СтрокаНабора.Поставщик
		И ОсновнаяСтрока.ВидЗадолженности = СтрокаНабора.ВидЗадолженности;
		
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПерераспределитьЗадолженностьАбонентаШапки(РаспределеннаяСумма, ДанныеПерераспределения)
	СтрокиРаспределения = Объект.ЗадолженностьБыла.Выгрузить(ДанныеПерераспределения, "НомерСтроки, ПериодНачисления, Задолженность");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПерерасчетЗадолженностьБыла.НомерСтроки - 1 КАК НомерСтроки,
		|	энргПерерасчетЗадолженностьБыла.ПериодНачисления КАК ПериодНачисления,
		|	энргПерерасчетЗадолженностьБыла.Задолженность КАК Задолженность
		|ПОМЕСТИТЬ ВТ_СтрокиКРаспределению
		|ИЗ
		|	&ЗадолженностьБыла КАК энргПерерасчетЗадолженностьБыла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтрокиКРаспределению.НомерСтроки КАК НомерСтроки,
		|	ВТ_СтрокиКРаспределению.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_СтрокиКРаспределению.Задолженность КАК Задолженность
		|ИЗ
		|	ВТ_СтрокиКРаспределению КАК ВТ_СтрокиКРаспределению
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодНачисления УБЫВ";
	
	Запрос.УстановитьПараметр("ЗадолженностьБыла", СтрокиРаспределения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Списываем 	= Мин(РаспределеннаяСумма, Выборка.Задолженность);
		СтрокаДолга = Объект.ЗадолженностьБыла[Выборка.НомерСтроки];
		СтрокаДолга.ЗадолженностьНовая = Выборка.Задолженность - Списываем;
		
		РаспределеннаяСумма = РаспределеннаяСумма - Списываем;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСуммыШапки()	
	СуммаЗадолженности 			= Объект.ЗадолженностьБыла.Итог("Задолженность");
	СуммаКРаспределению			= Объект.РаспределениеЗадолженностиНовое.Итог("Задолженность");
	СуммаОстаткаРаспределения 	= СуммаЗадолженности - СуммаКРаспределению - Объект.ЗадолженностьБыла.Итог("ЗадолженностьНовая");
КонецПроцедуры

#КонецОбласти

&НаСервере 
Процедура ПроверитьПраваДокументаПерерасчет(Отказ) 
	ЕстьПравоЧтение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Чтение"); 
	ЕстьПравоИзменение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Изменение");
	Если Не ЕстьПравоИзменение И (Не ЕстьПравоЧтение Или ЕстьПравоЧтение И Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		Отказ = Истина;
		ВызватьИсключение "Нарушение прав доступа";
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр = ЕстьПравоЧтение И Не ЕстьПравоИзменение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОсновании", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицы()	
	Объект.ЗадолженностьБыла.Очистить(); 	
	Объект.РаспределениеЗадолженностиНовое.Очистить(); 	
КонецПроцедуры

#КонецОбласти