#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет массив данных оплаты.
//
// Возвращаемое значение:
//  РезультатЗапроса
//
Функция ДанныеОплаты() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестКорректировкаЗадолженности.Организация КАК Организация,
		|	бестКорректировкаЗадолженности.Район КАК Район,
		|	бестКорректировкаЗадолженности.Дата КАК Период,
		|	бестКорректировкаЗадолженности.Договор КАК Договор,
		|	СУММА(бестКорректировкаЗадолженностиПереносОплаты.Сумма) КАК Сумма,
		|	ЛОЖЬ КАК ЭтоОплата,
		|	бестКорректировкаЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	бестКорректировкаЗадолженности.Дата КАК Дата
		|ИЗ
		|	Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестКорректировкаЗадолженностиПереносОплаты.Ссылка = бестКорректировкаЗадолженности.Ссылка
		|ГДЕ
		|	бестКорректировкаЗадолженности.Ссылка = &Ссылка
		|	И бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженности.Договор,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженности.ПериодНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженностиПереносОплаты.Договор,
		|	СУММА(бестКорректировкаЗадолженностиПереносОплаты.Сумма),
		|	ИСТИНА,
		|	бестКорректировкаЗадолженности.ПериодНачисления,
		|	бестКорректировкаЗадолженности.Дата
		|ИЗ
		|	Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестКорректировкаЗадолженностиПереносОплаты.Ссылка = бестКорректировкаЗадолженности.Ссылка
		|ГДЕ
		|	бестКорректировкаЗадолженности.Ссылка = &Ссылка
		|	И бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженностиПереносОплаты.Договор,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженности.ПериодНачисления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("Договор",				Договор);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.КорректировкаЗадолженности_ВозвратПлатежа Тогда
		ДополнительныеСвойства.Вставить("ЭтоОплата",			Ложь);
		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа Тогда
		ДополнительныеСвойства.Вставить("МассивОбъектовРасчета",Истина);
		ДополнительныеСвойства.Вставить("ДанныеОплаты",			ДанныеОплаты());
	КонецЕсли;
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеЗадолженности 	= ПолучитьДанныеЗадолженности();
	ВыборкаЗадолженность	= ДанныеЗадолженности.выбрать();
	
	Пока ВыборкаЗадолженность.Следующий() Цикл
		Если ВыборкаЗадолженность.Приход Тогда
			Запись 						= Движения.бестВзаиморасчетыЭЭ.ДобавитьПриход();
		Иначе
			Запись 						= Движения.бестВзаиморасчетыЭЭ.ДобавитьРасход();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаЗадолженность);
		
		Если ВидОперации = Перечисления.бестВидыОпераций.КорректировкаЗадолженности_ВозвратПлатежа Тогда
			Запись 						= Движения.бестСуммыОплатЭЭ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,ВыборкаЗадолженность);
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеЗадолженности()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестКорректировкаЗадолженности.Организация КАК Организация,
		|	бестКорректировкаЗадолженности.Район КАК Район,
		|	бестКорректировкаЗадолженности.Дата КАК Период,
		|	бестКорректировкаЗадолженности.Договор КАК Договор,
		|	СУММА(-бестКорректировкаЗадолженностиВозвратОплаты.СуммаВозврата) КАК Сумма,
		|	СУММА(-бестКорректировкаЗадолженностиВозвратОплаты.СуммаВозвратаНДС) КАК СуммаНДС,
		|	ЛОЖЬ КАК Приход,
		|	ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛица.ИсточникПоступления, ЗНАЧЕНИЕ(Справочник.энргИсточникиПоступления.пустаяссылка)) КАК ИсточникПоступления
		|ИЗ
		|	Документ.бестКорректировкаЗадолженности.ВозвратОплаты КАК бестКорректировкаЗадолженностиВозвратОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестКорректировкаЗадолженностиВозвратОплаты.Ссылка = бестКорректировкаЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица КАК бестПлатежноеПоручениеВходящееЭЭЮрЛица
		|		ПО бестКорректировкаЗадолженностиВозвратОплаты.ДокументОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛица.Ссылка
		|ГДЕ
		|	бестКорректировкаЗадолженности.Ссылка = &Ссылка
		|	И бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ВозвратПлатежа)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженности.Договор,
		|	ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛица.ИсточникПоступления, ЗНАЧЕНИЕ(Справочник.энргИсточникиПоступления.пустаяссылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженности.Договор,
		|	СУММА(-бестКорректировкаЗадолженностиПереносОплаты.Сумма),
		|	СУММА(-бестКорректировкаЗадолженностиПереносОплаты.СуммаНДС),
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоступления.пустаяссылка)
		|ИЗ
		|	Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестКорректировкаЗадолженностиПереносОплаты.Ссылка = бестКорректировкаЗадолженности.Ссылка
		|ГДЕ
		|	бестКорректировкаЗадолженности.Ссылка = &Ссылка
		|	И бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженности.Договор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженностиПереносОплаты.Договор,
		|	СУММА(бестКорректировкаЗадолженностиПереносОплаты.Сумма),
		|	СУММА(бестКорректировкаЗадолженностиПереносОплаты.СуммаНДС),
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоступления.пустаяссылка)
		|ИЗ
		|	Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестКорректировкаЗадолженностиПереносОплаты.Ссылка = бестКорректировкаЗадолженности.Ссылка
		|ГДЕ
		|	бестКорректировкаЗадолженности.Ссылка = &Ссылка
		|	И бестКорректировкаЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.КорректировкаЗадолженности_ПереносПлатежа)
		|
		|СГРУППИРОВАТЬ ПО
		|	бестКорректировкаЗадолженности.Организация,
		|	бестКорректировкаЗадолженности.Район,
		|	бестКорректировкаЗадолженности.Дата,
		|	бестКорректировкаЗадолженностиПереносОплаты.Договор";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли