#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	КомандаОтчет 									= КомандыОтчетов.Добавить();	
	КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.ДвиженияДокумента.ПолноеИмя();
	КомандаОтчет.Представление 						= НСтр("ru = 'Движения документа'");
	КомандаОтчет.ФункциональныеОпции 				= "";
	КомандаОтчет.ИмяФормы 							= "Отчет.ДвиженияДокумента.Форма";
	КомандаОтчет.МножественныйВыбор 				= Ложь;
	
КонецПроцедуры

// Заполняет список команд создания на основании ОперацииСЛС.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииОперацииСЛС(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииОперацииСЛС";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованииеОперацииСЛС";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании ОперацияСПриборомУчета.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииОперацияСПриборомУчета(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор 	= Метаданные.Документы.энргПерерасчет.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании ОперацияСУслугами.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииОперацияСУслугами(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииОперацияСУслугами";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииОперацияСУслугами";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьВидБлагоустройстваАбонента.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьВидБлагоустройстваАбонента(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьВидБлагоустройстваАбонента";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьВидБлагоустройстваАбонента";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьГруппуПотребителейАбонента.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьГруппуПотребителейАбонента(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьГруппуПотребителейАбонента";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьГруппуПотребителейАбонента";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьЗначениеПлощади.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьЗначениеПлощади(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьЗначениеПлощади";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьЗначениеПлощади";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьКоличествоКомнат.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьКоличествоКомнат(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьКоличествоКомнат";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьКоличествоКомнат";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьКоличествоПрописанных.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьКоличествоПрописанных(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьКоличествоПрописанных";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьКоличествоПрописанных";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьКоличествоПроживающих.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьКоличествоПроживающих(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьКоличествоПроживающих";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьКоличествоПрописанных";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьФормулуРасчетаТочекУчета.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьФормулуРасчетаТочекУчета(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьФормулуРасчетаТочекУчета";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьФормулуРасчетаТочекУчета";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании УстановитьФормулуСобственников.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
// 
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений.
//
Функция ДобавитьКомандуСоздатьНаОснованииУстановитьКоличествоСобственников(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргПерерасчет) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ПерерасчетНаОснованиииУстановитьКоличествоСобственников";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ПерерасчетНаОснованиииУстановитьФормулуРасчетаТочекУчета";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Перерасчет'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список возможных операций формы списка.
// 
// Возвращаемое значение:
//	 СписокЗначений.
//
Функция ЗаполнитьСписокВозможныхОперацийФормаСписка() Экспорт 
	
	ЗначенияПеречисления = Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления;
	
	СписокОпераций = Новый СписокЗначений;
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет,									"Связанный перерасчет");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета,							"Изменение параметра расчета абонента");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет,										"Ручной перерасчет");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт,										"Регистрация блокировочного акта");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг,			"Корректировка годового потребления сезонных услуг");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты,									ЗначенияПеречисления.энргПерерасчет_КорректировкаОплаты.Синоним);
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода,			ЗначенияПеречисления.энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода.Синоним);
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_СписаниеЗадолженности,									"Решение суда");
	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты,									"Перенос/Возврат оплаты");
	
	Возврат СписокОпераций;
	
КонецФункции 

// Возвращает соотвествие видов операции и префиксов форм.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция СоотвествиеВидовОперацииИПрефиксовФорм() Экспорт
	
	Соотвествие = Новый Соответствие;
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет,									"СвязанныйПерерасчет");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета,							"ИзменениеПараметраРассчета");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет,										"РучнойПерерасчет");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт,										"РучнойПерерасчет");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг,		"КорректировкаПотребленияСезонныхУслуг");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты,									"КорректировкаОплаты");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода,			"ИзменениеПризнакаНаличияПрибораСНачалаГода");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_СписаниеЗадолженности,								"КорректировкаЗадолженности");
	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты,									"ПереносВозвратОплаты");
	
	Возврат Соотвествие;
	
КонецФункции

// Получает данные для заполнения расходного кассового ордера.
//
// Параметры:
//  ДокументСсылка	-	ДокументСсылка.энргПерерасчет.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ДанныеДляЗаполненияРасходныйКассовыйОрдер(ДокументСсылка) Экспорт 
	
	ДанныеДляЗаполнения 	= Новый Структура;
	ДанныеДляЗаполнения.Вставить("ДокументОснование", ДокументСсылка); 	
	 
	ДанныеАбонента 			= ДанныеАбонентаДляВозвратаОплаты(ДокументСсылка);
	СуммаВозврата 			= СуммаВозвратаКорректировкиОплаты(ДокументСсылка);
	
	ДанныеДляЗаполнения.Вставить("Сумма", 			СуммаВозврата);
	
	Если НЕ ДанныеАбонента = Неопределено Тогда
		ДанныеДляЗаполнения.Вставить("Абонент", 		ДанныеАбонента.Абонент);
		ДанныеДляЗаполнения.Вставить("КлючПомещения", 	ДанныеАбонента.КлючПомещения);
		ДанныеДляЗаполнения.Вставить("Организация", 	ДанныеАбонента.Организация);
		ДанныеДляЗаполнения.Вставить("Район", 			ДанныеАбонента.Район);
	КонецЕсли;
			
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

// Создает объект связанный перерасчет
//
// Параметры:
//  СсылкаНового	-	ДокументСсылка.энргПерерасчет.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  МКД				-	СправочникСсылка.энргСтроения.
//  ДатаДокумента	-	Дата.
// 
// Возвращаемое значение:
//   ДанныеФормыСтруктура.
//
Функция СоздатьОбъектСвязанныйПерерасчет(СсылкаНового,Организация,Район,МКД,ДатаДокумента) Экспорт 
		
	ДокументОбъект  							= Документы.энргПерерасчет.СоздатьДокумент();
	ДокументОбъект.Строение						= МКД;				
	ДокументОбъект.УстановитьСсылкуНового(СсылкаНового);		
	ДокументОбъект.Район  						= Район;		
	ДокументОбъект.Дата							= ДатаДокумента;
	ДокументОбъект.Организация 					= Организация;
	ДокументОбъект.ВидОперации 					= Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет;
		
	НаборДокументыНачислений 					= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
	НаборДокументыНачислений.Отбор.Организация.Установить(Организация);
	НаборДокументыНачислений.Отбор.ПериодНачисления.Установить(НачалоМесяца(ДатаДокумента));
	НаборДокументыНачислений.Отбор.Район.Установить(Район);
	НаборДокументыНачислений.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
	НаборДокументыНачислений.Отбор.МКД.Установить(МКД);
	
	СтрокаНабора 								= НаборДокументыНачислений.Добавить();
	СтрокаНабора.Организация 					= Организация;
	СтрокаНабора.ПериодНачисления 				= НачалоМесяца(ДатаДокумента);
	СтрокаНабора.Район			 				= Район;
	СтрокаНабора.ВидОперацийНачисления			= Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних;
	СтрокаНабора.МКД							= МКД;
	СтрокаНабора.ДокументНачисления				= СсылкаНового;
	СтрокаНабора.ПометкаУдаления				= Ложь;
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("НаборДокументыНачислений", НаборДокументыНачислений);
	
	Возврат ДокументОбъект; 
	
КонецФункции

// Снимает пометку на удаления связанный перерасчет.
//
// Параметры:
//  ДокументСсылка	-	ДокументСсылка.энргПерерасчет.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  МКД				-	СправочникСсылка.энргСтроения.
//
Процедура СнятьПометкуУдаленияСвязанныйПерерасчет(ДокументСсылка,Организация,Район,МКД) Экспорт  
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	ДокументОбъект.УстановитьПометкуУдаления(Ложь);
КонецПроцедуры

// Выполняется при заполнении ограничения доступа.
//
// Параметры:
//  Ограничение		-	Структура	-	см.УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ 
	|(ВидОперации = Значение(Перечисление.энргВидыОпераций.ПустаяСсылка))
	|ИЛИ
	|(ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты)
	|И РольДоступна(энргИзменение_энргПерерасчетКорректировкаОплаты))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|И РольДоступна(энргИзменение_энргПерерасчетСвязанныйПерерасчет))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет)
	|И РольДоступна(энргИзменение_энргПерерасчетРучнойПерерасчет))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета)
	|И РольДоступна(энргИзменение_энргПерерасчетИзменениеПараметраРассчета))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_РаспределениеЗадолженности)
	|И РольДоступна(энргИзменение_энргПерерасчетРаспределениеЗадолженности))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода)
	|И РольДоступна(энргИзменение_энргПерерасчетИзменениеПризнакаНаличияПрибораУчетаСНачалаГода))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт)
	|И РольДоступна(энргИзменение_энргПерерасчетБлокировочныйАкт))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг)
	|И РольДоступна(энргИзменение_энргПерерасчетКорректировкаГодовогоПотребленияСезонныхУслуг))	
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты)
	|И РольДоступна(энргИзменение_энргПерерасчетПереносВозвратОплаты))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_ПерерасчетНенадлежащегоКачества)
	|И РольДоступна(энргИзменение_энргПерерасчетПерерасчетНенадлежащегоКачества))
	|
	|ИЛИ (ВидОперации = Значение(Перечисление.энргВидыОпераций.энргПерерасчет_СписаниеЗадолженности)
	|И РольДоступна(энргИзменение_энргПерерасчетКорректировкаЗадолженности))";
	
КонецПроцедуры

// Проверяет право для документа.
//
// Параметры:
//  ВидОперации		-	ПеречисленияСсылка.энргВидыОпераций.
//  ПроверкаПрав	-	Строка.
// 
// Возвращаемое значение:
//   Неопределено, Булево.
//
Функция ПроверитьПравоДляДокумента(ВидОперации, ПроверкаПрав = "") Экспорт
	
	РольДляОперации = ВернутьСоответствиеРолиИОперации(ВидОперации);
	Если ПроверкаПрав = "Чтение" Тогда
		РольДляОперации = СтрЗаменить(РольДляОперации, "энргИзменение_", "энргЧтение_");
	КонецЕслИ;
	
	ЕстьПрава = Пользователи.РолиДоступны(РольДляОперации);	
	
	Возврат РольДляОперации = Неопределено Или ЕстьПрава;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьОснование 				= Ложь;
	
	Если Параметры.Свойство("Основание") тогда
		Если ЗначениеЗаполнено(Параметры.Основание) тогда
			ЕстьОснование 		= Истина; 						
		КонецЕсли; 		
	КонецЕсли;
	
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗаполнения тогда
		ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;	
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргПерерасчет",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргПерерасчет",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргПерерасчет",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		ИначеЕсли ЕстьОснование тогда 
			Параметры.вставить("ЗаполнитьДокумент",Истина);
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормыПоОснованию("энргПерерасчет",ТипЗнч(Параметры.Основание));
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргПерерасчет");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании	-	КомандыФормы.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Документы.энргРасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОснованииДокументПерерасчет(КомандыСоздатьНаОсновании);
	
КонецФункции

// Получает значения норматива ТУ.
//
// Параметры:
//  СтруктураСтроки	-	Структура.
//  СтруктураТарифа	-	Структура.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияНормативаТУ(СтруктураСтроки, СтруктураТарифа) Экспорт
	ДействующиеТочки	= Новый ТаблицаЗначений;
	ДействующиеТочки.Колонки.Добавить("Организация",		Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ДействующиеТочки.Колонки.Добавить("Район",				Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	ДействующиеТочки.Колонки.Добавить("КлючПомещения",		Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	ДействующиеТочки.Колонки.Добавить("ТочкаУчета",			Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	ДействующиеТочки.Колонки.Добавить("Услуга",				Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ДействующиеТочки.Колонки.Добавить("СоставнаяУслуга",	Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	ДействующиеТочки.Колонки.Добавить("ГруппаПотребителей",	Новый ОписаниеТипов("СправочникСсылка.энргГруппыПотребителей"));
	ДействующиеТочки.Колонки.Добавить("Поставщик",			Новый ОписаниеТипов("СправочникСсылка.энргКонтрагенты"));
	ДействующиеТочки.Колонки.Добавить("ВидБлагоустройства",	Новый ОписаниеТипов("СправочникСсылка.энргВидыБлагоустройств"));
	
	НоваяСтрока	 = ДействующиеТочки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураТарифа);
	
	Схема = Новый СхемаЗапроса;
	
	Параметры	= Новый Структура;
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));	
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
		
	Параметры.Вставить("Период"		, Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ДействующиеТочки.Организация КАК Организация,
		|	ДействующиеТочки.Район КАК Район,
		|	ДействующиеТочки.КлючПомещения КАК КлючПомещения,
		|	ДействующиеТочки.ТочкаУчета КАК ТочкаУчета,
		|	ДействующиеТочки.Услуга КАК Услуга,
		|	ДействующиеТочки.СоставнаяУслуга КАК СоставнаяУслуга,
		|	ДействующиеТочки.ГруппаПотребителей КАК ГруппаПотребителей,
		|	ДействующиеТочки.Поставщик КАК Поставщик,
		|	ДействующиеТочки.ВидБлагоустройства КАК ВидБлагоустройства
		|ПОМЕСТИТЬ ВспомогательныеДанныеУслуг
		|ИЗ
		|	&ДействующиеТочки КАК ДействующиеТочки");

	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема, Параметры, "НаправлениеИспользованияДействующихТочек");
	энргРаботаСРабочимМестомОператора.ЗаполнитьСхемуЗначениеНормативов(Схема, Параметры);
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ЗначенияТекущихНормПотребления.КлючНорматива КАК КлючНорматива,
		|	ЗначенияТекущихНормПотребления.ЗначениеНорматива КАК ЗначениеНорматива
		|ИЗ
		|	ВспомогательныеДанныеУслуг КАК ВспомогательныеДанныеУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияТекущихНормПотребления КАК ЗначенияТекущихНормПотребления
		|		ПО ВспомогательныеДанныеУслуг.Организация = ЗначенияТекущихНормПотребления.Организация
		|			И ВспомогательныеДанныеУслуг.Район = ЗначенияТекущихНормПотребления.Район
		|			И ВспомогательныеДанныеУслуг.Услуга = ЗначенияТекущихНормПотребления.Услуга");

	ДанныеЗаполнения  						= Новый Структура("КоличествоКомнат,КоличествоПрописанных, КоличествоПроживающих, КоличествоСобственников");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаАбонента(СтруктураСтроки.Организация, СтруктураСтроки.Район, СтруктураСтроки.Абонент, ТекущаяДата(), ДанныеЗаполнения);

	ПараметрыЗапроса = Новый Структура("Организация,Район,КлючПомещения,КоличествоКомнат,КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников");
	ПараметрыЗапроса.Вставить("Период",					СтруктураСтроки.ПериодНачисления);
	ПараметрыЗапроса.Вставить("МоментВремени",			СтруктураСтроки.ПериодНачисления);
	ПараметрыЗапроса.Вставить("ТипНачисления",			Перечисления.энргТипыНачислений.ИндивидуальныеНачисления);
	ПараметрыЗапроса.Вставить("ДействующиеТочки",		ДействующиеТочки);
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, СтруктураСтроки, "Организация,Район,КлючПомещения");
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, ДанныеЗаполнения, "КоличествоКомнат,КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников");
	
	Пакет = энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса);
	Выборка	= Пакет[Пакет.Количество() - 1].Выбрать();
	
	Результат = Новый Структура("ЗначениеНорматива, КлючНорматива", 0, Справочники.энргКлючиНормативов.ПустаяСсылка());
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат,Выборка);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Получает связанный РКО.
//
// Параметры:
//  ДокументСсылка	-	ДокументСсылка.энргПерерасчет, ДокументСсылка.энргРегистрацияПоказанийАбонента.
// 
// Возвращаемое значение:
//   Неопределено, ДокументСсылка.энргРасходныйКассовыйОрдер.
//
Функция ПолучитьСвязанныйРКО(ДокументСсылка)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРасходныйКассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргРасходныйКассовыйОрдер КАК энргРасходныйКассовыйОрдер
		|ГДЕ
		|	НЕ энргРасходныйКассовыйОрдер.ПометкаУдаления
		|	И энргРасходныйКассовыйОрдер.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	
	Результат  					= Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка  				= Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

// Получает данные заполнения начальныех показаний.
//
// Параметры:
//  мДокументы		-	ДокументСсылка.энргПерерасчет.
//  мНомераСтрок	-	Массив из Чисел.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДанныеЗаполненияНачальныеПоказания(мДокументы, мНомераСтрок) Экспорт 
	
	Схема  							= Новый СхемаЗапроса;
	Пакет 							= Схема.ПакетЗапросов[0];
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеЗаполненияНачальныеПоказания());
	
	ПараметрыЗапроса  				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы",	 	мДокументы);
	ПараметрыЗапроса.Вставить("мНомераСтрок", 	мНомераСтрок);
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргПерерасчет.ДанныеЗаполненияНачальныеПоказания";
		ПараметрыМетода 			= Новый Структура("мДокументы, мНомераСтрок",мДокументы, мНомераСтрок); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);
	КонецЕсли;
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеАбонентаДляВозвратаОплаты(ДокументСсылка)
	
	Запрос 					= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргПерерасчет.Абонент КАК Абонент,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	энргАбоненты.Организация КАК Организация,
	|	энргАбоненты.Район КАК Район
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргПерерасчет.Абонент = энргАбоненты.Ссылка
	|			И (энргПерерасчет.Ссылка = &Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат  				= Запрос.Выполнить();	
	
	Если НЕ Результат.Пустой() Тогда
		Выборка  			= Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СуммаВозвратаКорректировкиОплаты(ДокументСсылка)  
	
	Запрос 					= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст 			=	
	"ВЫБРАТЬ
	|	энргПерерасчетКорректировкаОплаты.СуммаВозврата КАК Сумма
	|ИЗ
	|	Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка";
		
	Результат  					= Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка  				= Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Сумма;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ТекстЗапросаДанныеЗаполненияНачальныеПоказания()
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ВСрок КАК ВСрок,
	|	ВложенныйЗапрос.Показания КАК Показания,
	|	ВложенныйЗапрос.ПоказанияТекущегоПериода КАК ПоказанияТекущегоПериода
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргПерерасчет.Организация КАК Организация,
	//|		энргПерерасчет.ПериодНачисления КАК ПериодНачисления,
	|		энргПерерасчетКорректировкаПоказаний.ПериодНачисления КАК ПериодНачисления,
	|		энргПерерасчет.Район КАК Район,
	|		энргПерерасчетКорректировкаПоказаний.КлючПомещения КАК КлючПомещения,
	|		энргПерерасчетКорректировкаПоказаний.ПриборУчетаПосле КАК ПриборУчета,
	|		энргПерерасчетКорректировкаПоказаний.ШкалаПосле КАК Шкала,
	|		энргПерерасчетКорректировкаПоказаний.ТарифнаяЗонаПосле КАК ТарифнаяЗона,
	|		энргПерерасчет.Дата КАК ДатаРегистратора,
	|		энргПерерасчет.Ссылка КАК ДокРегистратор,
	|		ЛОЖЬ КАК ВСрок,
	|		энргПерерасчетКорректировкаПоказаний.ПоказанияПосле КАК Показания,
	|		ЛОЖЬ КАК ПоказанияТекущегоПериода
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаПоказаний КАК энргПерерасчетКорректировкаПоказаний
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО энргПерерасчетКорректировкаПоказаний.Ссылка = энргПерерасчет.Ссылка
	|	ГДЕ
	|		энргПерерасчет.Ссылка = &мДокументы
	|		И энргПерерасчетКорректировкаПоказаний.Ссылка = &мДокументы
	|		И энргПерерасчетКорректировкаПоказаний.НомерСтроки В(&мНомераСтрок)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения";
	
	Возврат Текст;
	
КонецФункции

Функция ВернутьСоответствиеРолиИОперации(ВидОперации)
	
	РолиИОперации = Новый Соответствие();
	
	ЗначениеКлюча = ВидОперации;
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт, "энргИзменение_энргПерерасчетБлокировочныйАкт");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета, "энргИзменение_энргПерерасчетИзменениеПараметраРассчета");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода, "энргИзменение_энргПерерасчетИзменениеПризнакаНаличияПрибораУчетаСНачалаГода");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг, "энргИзменение_энргПерерасчетКорректировкаГодовогоПотребленияСезонныхУслуг");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты, "энргИзменение_энргПерерасчетКорректировкаОплаты");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты, "энргИзменение_энргПерерасчетПереносВозвратОплаты");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_ПерерасчетНенадлежащегоКачества, "энргИзменение_энргПерерасчетПерерасчетНенадлежащегоКачества");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_РаспределениеЗадолженности, "энргИзменение_энргПерерасчетРаспределениеЗадолженности");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет, "энргИзменение_энргПерерасчетРучнойПерерасчет");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет, "энргИзменение_энргПерерасчетСвязанныйПерерасчет");
	РолиИОперации.Вставить(Перечисления.энргВидыОпераций.энргПерерасчет_СписаниеЗадолженности, "энргИзменение_энргПерерасчетКорректировкаЗадолженности");
	
	Возврат РолиИОперации.Получить(ЗначениеКлюча);	
	
КонецФункции

#КонецОбласти

#КонецЕсли