#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Функция МассивПриборов() Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ПериодРегистрации",	ДополнительныеСвойства.ПериодРегистрацииПоказаний);
	Запрос.УстановитьПараметр("МассивПриборов",		Движения.энргПоказанияПриборовУчета.ВыгрузитьКолонку("ПриборУчета"));
	Запрос.Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаПриборов.КлючПомещения КАК КлючПомещения,
	|	ТаблицаПриборов.ПриборУчетаПосле КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	&ПериодРегистрации КАК ПериодРегистрации 
	|ИЗ
	|	Документ.энргПерерасчет.КорректировкаПоказаний КАК ТаблицаПриборов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ТаблицаПриборов.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|ГДЕ
	|	ТаблицаПриборов.Ссылка = &Ссылка
	|	И ТаблицаПриборов.ПриборУчетаПосле В(&МассивПриборов)";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

// Вставляет в дополнительные свойсва данные оплаты.
//
Процедура ДанныеОплаты() Экспорт 
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_РаспределениеЗадолженности Тогда
		РаспределениеЗадолженности_ДанныеОплаты();
		Возврат;
	КонецЕсли; 	
	
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			Строение);
	Запрос.УстановитьПараметр("Дата", 				Дата);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ОбъемНачислений", 	ЭтотОбъект.Движения.энргОбъемНачислений.Выгрузить());
	Запрос.Текст 	=
	
	"ВЫБРАТЬ
	|	ОбъемНачислений.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	&Строение КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	&Дата КАК Дата,
	|	&Ссылка КАК ДокРегистратор,
	|	0 КАК СуммаОплаты,
	|	ЛОЖЬ КАК ЭтоОплата,
	|	ЛОЖЬ КАК ЭтоКорректировкаОплаты
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&ОбъемНачислений КАК ОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка КАК Ссылка,
	|	энргПерерасчет.Абонент КАК Абонент,
	|	энргПерерасчет.КлючПомещения КАК КлючПомещения,
	|	энргПерерасчет.ВидОперации КАК ВидОперации,
	|	энргПерерасчет.Район КАК Район,
	|	энргПерерасчет.Организация КАК Организация
	|ПОМЕСТИТЬ ДанныеШапки
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	ДанныеШапки.Абонент КАК АбонентШапки,
	|	ДанныеШапки.КлючПомещения КАК КлючПомещенияШапки,
	|	ДанныеШапки.ВидОперации КАК ВидОперации,
	|	энргПерерасчетКорректировкаОплаты.АбонентБыло КАК АбонентБыло,
	|	энргПерерасчетКорректировкаОплаты.АбонентСтало КАК АбонентСтало,
	|	энргПерерасчетКорректировкаОплаты.IDСтроки КАК IDСтроки
	|ПОМЕСТИТЬ ДанныеКорректировкиОплаты
	|ИЗ
	|	ДанныеШапки КАК ДанныеШапки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ПО ДанныеШапки.Ссылка = энргПерерасчетКорректировкаОплаты.Ссылка
	|			И (энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеШапки.Ссылка КАК Ссылка,
	|	энргПерерасчетКорректировкаОплатыСтало.Абонент КАК Абонент
	|ПОМЕСТИТЬ ДанныеПереносаВозвратаОплаты
	|ИЗ
	|	ДанныеШапки КАК ДанныеШапки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплатыСтало КАК энргПерерасчетКорректировкаОплатыСтало
	|		ПО ДанныеШапки.Ссылка = энргПерерасчетКорректировкаОплатыСтало.Ссылка
	|			И ДанныеШапки.Абонент <> энргПерерасчетКорректировкаОплатыСтало.Абонент
	|			И (ДанныеШапки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|			И (энргПерерасчетКорректировкаОплатыСтало.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемНачислений.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Дата КАК Дата,
	|	ОбъемНачислений.ДокРегистратор КАК ДокРегистратор,
	|	ОбъемНачислений.СуммаОплаты КАК СуммаОплаты,
	|	ОбъемНачислений.ЭтоОплата КАК ЭтоОплата,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ПО ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	&ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	ВложенныйЗапрос.Абонент,
	|	&Дата,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	0,
	|	ВложенныйЗапрос.ЭтоОплата,
	|	ВложенныйЗапрос.ЭтоКорректировкаОплаты
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеКорректировкиОплаты.АбонентБыло КАК Абонент,
	|		ДанныеКорректировкиОплаты.Ссылка КАК ДокРегистратор,
	|		энргАбоненты.КлючПомещения КАК КлючПомещения,
	|		ИСТИНА КАК ЭтоОплата,
	|		ИСТИНА КАК ЭтоКорректировкаОплаты,
	|		энргАбоненты.Организация КАК Организация,
	|		энргАбоненты.Район КАК Район
	|	ИЗ
	|		ДанныеКорректировкиОплаты КАК ДанныеКорректировкиОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО ДанныеКорректировкиОплаты.АбонентБыло = энргАбоненты.Ссылка
	|				И (НЕ ДанныеКорректировкиОплаты.АбонентБыло = ДанныеКорректировкиОплаты.АбонентСтало)
	|				И (НЕ ДанныеКорректировкиОплаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало,
	|		энргПерерасчетКорректировкаОплаты.Ссылка,
	|		энргАбоненты.КлючПомещения,
	|		ИСТИНА,
	|		ЛОЖЬ,
	|		энргАбоненты.Организация,
	|		энргАбоненты.Район
	|	ИЗ
	|		ДанныеКорректировкиОплаты КАК энргПерерасчетКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО энргПерерасчетКорректировкаОплаты.АбонентСтало = энргАбоненты.Ссылка
	|				И (НЕ энргПерерасчетКорректировкаОплаты.АбонентБыло = энргПерерасчетКорректировкаОплаты.АбонентСтало)
	|				И (НЕ энргПерерасчетКорректировкаОплаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало,
	|		энргПерерасчетКорректировкаОплаты.Ссылка,
	|		энргАбоненты.КлючПомещения,
	|		ИСТИНА,
	|		ИСТИНА,
	|		энргАбоненты.Организация,
	|		энргАбоненты.Район
	|	ИЗ
	|		ДанныеКорректировкиОплаты КАК энргПерерасчетКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО энргПерерасчетКорректировкаОплаты.АбонентБыло = энргАбоненты.Ссылка
	|				И (энргПерерасчетКорректировкаОплаты.АбонентБыло = энргПерерасчетКорректировкаОплаты.АбонентСтало)
	|				И (НЕ энргПерерасчетКорректировкаОплаты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеШапки.Абонент,
	|		ДанныеШапки.Ссылка,
	|		ДанныеШапки.КлючПомещения,
	|		ИСТИНА,
	|		ИСТИНА,
	|		ДанныеШапки.Организация,
	|		ДанныеШапки.Район
	|	ИЗ
	|		ДанныеШапки КАК ДанныеШапки
	|	ГДЕ
	|		ДанныеШапки.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеПереносаВозвратаОплаты.Абонент,
	|		ДанныеПереносаВозвратаОплаты.Ссылка,
	|		энргАбоненты.КлючПомещения,
	|		ИСТИНА,
	|		ЛОЖЬ,
	|		энргАбоненты.Организация,
	|		энргАбоненты.Район
	|	ИЗ
	|		ДанныеПереносаВозвратаОплаты КАК ДанныеПереносаВозвратаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО ДанныеПереносаВозвратаОплаты.Абонент = энргАбоненты.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения";
	
	
	// Новый вариант корректировки оплаты
	
	//"ВЫБРАТЬ
	//|	&Организация КАК Организация,
	//|	&ПериодНачисления КАК ПериодНачисления,
	//|	&Район КАК Район,
	//|	&Строение КАК МКД,
	//|	ОбъемНачислений.Абонент КАК Абонент,
	//|	&Дата КАК Дата,
	//|	&Ссылка КАК ДокРегистратор,
	//|	0 КАК СуммаОплаты,
	//|	ЛОЖЬ КАК ЭтоОплата,
	//|	ЛОЖЬ КАК ЭтоКорректировкаОплаты
	//|ПОМЕСТИТЬ ОбъемНачислений
	//|ИЗ
	//|	&ОбъемНачислений КАК ОбъемНачислений
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ОбъемНачислений.Организация КАК Организация,
	//|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	//|	ОбъемНачислений.Район КАК Район,
	//|	ВЫБОР
	//|		КОГДА энргКлючиПомещений.ЧастныйСектор
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	//|		ИНАЧЕ энргКлючиПомещений.Строение
	//|	КОНЕЦ КАК МКД,
	//|	ОбъемНачислений.Абонент КАК Абонент,
	//|	ОбъемНачислений.Дата КАК Дата,
	//|	ОбъемНачислений.ДокРегистратор КАК ДокРегистратор,
	//|	ОбъемНачислений.СуммаОплаты КАК СуммаОплаты,
	//|	ОбъемНачислений.ЭтоОплата КАК ЭтоОплата,
	//|	ОбъемНачислений.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты
	//|ИЗ
	//|	ОбъемНачислений КАК ОбъемНачислений
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	//|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	//|		ПО ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВложенныйЗапрос.Организация,
	//|	&ПериодНачисления,
	//|	&Район,
	//|	ВЫБОР
	//|		КОГДА энргКлючиПомещений.ЧастныйСектор
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	//|		ИНАЧЕ энргКлючиПомещений.Строение
	//|	КОНЕЦ,
	//|	ВложенныйЗапрос.Абонент,
	//|	&Дата,
	//|	ВложенныйЗапрос.ДокРегистратор,
	//|	0,
	//|	ВложенныйЗапрос.ЭтоОплата,
	//|	ВложенныйЗапрос.ЭтоКорректировкаОплаты
	//|ИЗ
	//|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|		энргАбоненты.Ссылка КАК Абонент,
	//|		энргПерерасчет.Ссылка КАК ДокРегистратор,
	//|		энргАбоненты.КлючПомещения КАК КлючПомещения,
	//|		ЛОЖЬ КАК ЭтоОплата,
	//|		ИСТИНА КАК ЭтоКорректировкаОплаты,
	//|		энргАбоненты.Организация КАК Организация
	//|	ИЗ
	//|		Документ.энргПерерасчет КАК энргПерерасчет,
	//|		Справочник.энргАбоненты КАК энргАбоненты
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|		энргАбоненты.Ссылка,
	//|		энргПерерасчетКорректировкаОплатыСтало.Ссылка,
	//|		энргАбоненты.КлючПомещения,
	//|		ИСТИНА,
	//|		ИСТИНА,
	//|		энргАбоненты.Организация
	//|	ИЗ
	//|		Справочник.энргАбоненты КАК энргАбоненты
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплатыСтало КАК энргПерерасчетКорректировкаОплатыСтало
	//|			ПО (энргПерерасчетКорректировкаОплатыСтало.Абонент = &Ссылка)
	//|				И энргАбоненты.Ссылка = энргПерерасчетКорректировкаОплатыСтало.Абонент) КАК ВложенныйЗапрос
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	//|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения";
	
	// Новый вариант корректировки оплаты

	ДополнительныеСвойства.Вставить("ДанныеОплаты", Запрос.Выполнить());
	
КонецПроцедуры

// Вставляет в дополнительные свойсва массив помещений.
//
Процедура МассивПомещений() Экспорт 
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("КлючПомещения",		КлючПомещения);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодРегистрации",	ДополнительныеСвойства.ПериодРегистрацииПоказаний);
	Запрос.Текст 		=
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	&ПериодРегистрации КАК ПериодРегистрации 
	|ИЗ
	|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|ГДЕ
	|	энргКлючиПомещений.КлючПомещения В (&КлючПомещения)";
	
	ДополнительныеСвойства.Вставить("МассивПомещений", Запрос.Выполнить());
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;	
		
	Если ПометкаУдаления Тогда
		ОчиститьДвижения();	
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	ГраницыОтчетногоПериода = энргНачисления.ГраницыОтчетногоПериода(Организация,Район,ПериодНачисления);
	
	ДополнительныеСвойства.Вставить("ПериодРегистрацииПоказаний",	ГраницыОтчетногоПериода.НачалоОП);
	
	Если Не Документы.энргПерерасчет.ПроверитьПравоДляДокумента(ВидОперации, "Изменение") Тогда
		Отказ = Истина;
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Нарушение прав доступа. Невозможно записать документ ""Перерасчет"" с видом операции: %1'"), ВидОперации);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет Тогда
		ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
		ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
		ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
		ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
		
		Если НЕ ЭтоНовый() Тогда
			РеквизитыОбъекты 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"Организация,Район,Строение,Дата");
			Набор  						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
			Набор.Отбор.Организация.Установить(РеквизитыОбъекты.Организация);
			Набор.Отбор.ПериодНачисления.Установить(НачалоМесяца(РеквизитыОбъекты.Дата));
			Набор.Отбор.Район.Установить(РеквизитыОбъекты.Район);
			Набор.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
			Набор.Отбор.МКД.Установить(РеквизитыОбъекты.Строение);
			
			Набор.Прочитать();
			
			Если Набор.Количество() > 0 и Набор[0].ДокументНачисления = Ссылка Тогда
				Набор[0].ПометкаУдаления = ПометкаУдаления;
				Набор.Записать();
			КонецЕсли;
		КонецЕсли;
		Возврат;				
	КонецЕсли;
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет Тогда
		ДополнительныеСвойства.Вставить("НеПроверятьНаличиеПрисоединенныхФайлов", 	Истина);
		ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", 			Истина);
		ДополнительныеСвойства.Вставить("РегистрироватьПоказанияПУ", 				Ложь);
		ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", 			Ложь);
		
		Если НЕ ЭтоНовый() Тогда
			РеквизитыОбъекты 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"Организация,Район,Строение,Дата");
			Набор  						= РегистрыСведений.энргДокументыНачислений.СоздатьНаборЗаписей();
			Набор.Отбор.Организация.Установить(РеквизитыОбъекты.Организация);
			Набор.Отбор.ПериодНачисления.Установить(НачалоМесяца(РеквизитыОбъекты.Дата));
			Набор.Отбор.Район.Установить(РеквизитыОбъекты.Район);
			Набор.Отбор.ВидОперацийНачисления.Установить(Перечисления.энргВидыОперацийНачисления.ПерерасчетСредних);
			Набор.Отбор.МКД.Установить(РеквизитыОбъекты.Строение);
			
			Набор.Прочитать();
			
			Если Набор.Количество() > 0 и Набор[0].ДокументНачисления = Ссылка Тогда
				Набор[0].ПометкаУдаления = ПометкаУдаления;
				Набор.Записать();
			КонецЕсли;
		КонецЕсли;
		Возврат;				
	КонецЕсли;

	ДополнительныеСвойства.Вставить("Кассир",						Справочники.Пользователи.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ГруппаАбонентов", 				Истина);
	ДополнительныеСвойства.Вставить("ИсточникПоступления", 			ИсточникПоступления);
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт Тогда
		ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", Истина);
	Иначе
		ДополнительныеСвойства.Вставить("РегистрироватьСтабильныеПериоды", Ложь);
	КонецЕсли;
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект); 
			
	Если НЕ ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет И НЕ ПометкаУдаления Тогда
		Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт Тогда
			ЗаписатьДанныеБлокировочногоАкта();
		Иначе
			Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет Тогда
				Движения.энргОбъемНачислений.ДополнительныеСвойства.Вставить("НеПересчитыватьСумму", Истина);
			КонецЕсли;

			Для Каждого СтрокаНабора Из Движения.энргОбъемНачислений Цикл
				СтрокаНабора.Период 		= Дата;
				СтрокаНабора.Активность 	= Истина;
				СтрокаНабора.ПериодРасчета 	= ПериодНачисления;		
				СтрокаНабора.Район			= Район;
				Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_РучнойПерерасчет Тогда
					СтрокаНабора.Организация 	= Организация;
					СтрокаНабора.КлючПомещения  = КлючПомещения;
				КонецЕсли;
				СтрокаНабора.ВидНачисления 	= Перечисления.энргВидыНачислений.Перерасчет;
				КлючПомещенияСтрока 		= СтрокаНабора.Абонент.КлючПомещения;
				СтрокаНабора.ЧастныйСектор  = КлючПомещенияСтрока.ЧастныйСектор;
				СтрокаНабора.Строение		= КлючПомещенияСтрока.Строение;
				СтрокаНабора.Помещение		= КлючПомещенияСтрока.Помещение;
				//СтрокаНабора.НачалоПериода  = НачалоМесяца(ПериодНачисления);
				//СтрокаНабора.КонецПериода   = КонецМесяца(ПериодНачисления);						
			КонецЦикла;
			
			Если ЕстьБлокировочныйАкт() Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;		
		
		
		Набор = Движения.энргВзаиморасчеты;
		Набор.Записывать = Ложь;		
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргОперацияСПриборомУчета") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргУстановитьКоличествоПрописанных") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргУстановитьКоличествоКомнат")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргУстановитьЗначениеПлощади")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргУстановитьГруппуПотребителейАбонента") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргУстановитьВидБлагоустройстваАбонента")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргОперацияСУслугами")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргУстановитьКоличествоПроживающих")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргУстановитьКоличествоСобственников") Тогда 		
		СтрокаПомещения 				= Помещения.Добавить();
		СтрокаПомещения.КлючПомещения 	= ДанныеЗаполнения.КлючПомещения;
		СтрокаПомещения.Абонент		 	= ДанныеЗаполнения.Абонент;
		 
		ВидОперации 					= Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета;
		Организация 					= ДанныеЗаполнения.Организация;
		Район		 					= ДанныеЗаполнения.Район;
		ПериодНачисления		 		= ДанныеЗаполнения.ПериодНачисления;
		СтрокаОснования 				= ДокументыОснования.Добавить();
		СтрокаОснования.Документ 		= ДанныеЗаполнения;			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
	Иначе
		энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда	
		Если КорректировкаПоказаний.Количество() > 0 Тогда
			
			СкорректироватьПоказания(Отказ);
			
		ИначеЕсли КорректировкаОплаты.Количество() > 0 И ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты Тогда			
			
			СкорректироватьОплату(Отказ);
		 			
		ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты Тогда
			ОчиститьДвижения();
			ПеренестиИВернутьОплату();
		ИначеЕсли ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_РаспределениеЗадолженности Тогда
			
			ОчиститьДвижения();
			ПерераспределитьДолги();
		КонецЕсли;
		
		Если ВидОперации = Перечисления.энргВидыОпераций.энргПерерасчет_СписаниеЗадолженности Тогда
			СписатьЗадолженность(Отказ); 		
		КонецЕсли;
	Иначе
		НаборНачальныхПоказаний 				= РегистрыСведений.энргПредоставленныеПоказания.СоздатьНаборЗаписей();
		НаборНачальныхПоказаний.Отбор.ДокРегистратор.Установить(Ссылка);
		НаборНачальныхПоказаний.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкорректироватьПоказания(Отказ)
	Набор 									= Движения.энргПоказанияПриборовУчета;
	Набор.Записывать 						= Истина;
	
	НаборКорректировкаПоказаний 			= Движения.энргКорректировкаПоказаний;
	НаборКорректировкаПоказаний.Записывать	= Истина;
	
	НаборМаксимальныеПоказания 				= РегистрыСведений.энргМаксимальныеПоказания.СоздатьНаборЗаписей();
	НаборМаксимальныеПоказания.Отбор.ДокРегистратор.Установить(Ссылка);
	
	Результат 								= РезультатПоказанияПриборовУчета();
	Выборка  								= Результат.Выбрать();
	
	мНомераСтрок 							= Новый Массив;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
		ЗаполнитьЗначенияСвойств(НаборКорректировкаПоказаний.Добавить(), Выборка);
		
		НСтрокаМакс = НаборМаксимальныеПоказания.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрокаМакс, Выборка);
		НСтрокаМакс.ДокРегистратор = Ссылка;
		
		мНомераСтрок.Добавить(Выборка.НомерСтроки);
	КонецЦикла;
	
	НаборМаксимальныеПоказания.Записать();
	
	ДанныеЗаполненияНачальныеПоказания 		= Документы.энргПерерасчет.ДанныеЗаполненияНачальныеПоказания(Ссылка, мНомераСтрок);
	НаборНачальныхПоказаний 				= РегистрыСведений.энргПредоставленныеПоказания.НаборНачальныеПоказанияРасчетногоПериода(ДанныеЗаполненияНачальныеПоказания);
	НаборНачальныхПоказаний.Отбор.ДокРегистратор.Установить(Ссылка);
	НаборНачальныхПоказаний.Записать();
КонецПроцедуры

Функция РезультатПоказанияПриборовУчета()
	
	Запрос 			= Новый Запрос;             	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	ДополнительныеСвойства.ПериодРегистрацииПоказаний);	
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргПерерасчетКорректировкаПоказаний.ДатаПоказаний КАК ДатаПоказаний,
	|	энргПерерасчетКорректировкаПоказаний.ПереворотПосле КАК Переворот,
	|	энргПерерасчетКорректировкаПоказаний.ПоказанияПосле КАК Показания,
	|	энргПерерасчетКорректировкаПоказаний.ПриборУчетаПосле КАК ПриборУчета,
	|	энргПерерасчетКорректировкаПоказаний.СостояниеПоказанийПосле КАК СостояниеПоказаний,
	|	энргПерерасчетКорректировкаПоказаний.ТарифнаяЗонаПосле КАК ТарифнаяЗона,
	|	энргПерерасчетКорректировкаПоказаний.ШкалаПосле КАК Шкала,
	|	энргПерерасчетКорректировкаПоказаний.КСПосле КАК КС,
	|	энргПерерасчетКорректировкаПоказаний.ТочкаУчета КАК ТочкаУчета,
	|	энргПерерасчетКорректировкаПоказаний.РегистраторПоказаний КАК РегистраторПоказаний,
	|	энргПерерасчетКорректировкаПоказаний.КлючПомещения КАК КлючПомещения,
	|	энргПерерасчетКорректировкаПоказаний.НомерСтроки КАК НомерСтроки,
	|	энргПерерасчетКорректировкаПоказаний.ПериодНачисления КАК ПериодНачисления,
	|	энргПерерасчетКорректировкаПоказаний.ПоказанияДо КАК ПоказанияДо
	|ПОМЕСТИТЬ ДанныеТЧ
	|ИЗ
	|	Документ.энргПерерасчет.КорректировкаПоказаний КАК энргПерерасчетКорректировкаПоказаний
	|ГДЕ
	|	энргПерерасчетКорректировкаПоказаний.Ссылка = &Ссылка
	|	И (энргПерерасчетКорректировкаПоказаний.ПереворотДо <> энргПерерасчетКорректировкаПоказаний.ПереворотПосле
	|			ИЛИ энргПерерасчетКорректировкаПоказаний.ПоказанияДо <> энргПерерасчетКорректировкаПоказаний.ПоказанияПосле
	|			ИЛИ энргПерерасчетКорректировкаПоказаний.ПриборУчетаДо <> энргПерерасчетКорректировкаПоказаний.ПриборУчетаПосле
	|			ИЛИ энргПерерасчетКорректировкаПоказаний.СостояниеПоказанийДо <> энргПерерасчетКорректировкаПоказаний.СостояниеПоказанийПосле
	|			ИЛИ энргПерерасчетКорректировкаПоказаний.ТарифнаяЗонаДо <> энргПерерасчетКорректировкаПоказаний.ТарифнаяЗонаПосле
	|			ИЛИ энргПерерасчетКорректировкаПоказаний.ШкалаДо <> энргПерерасчетКорректировкаПоказаний.ШкалаПосле
	|			ИЛИ энргПерерасчетКорректировкаПоказаний.КСДо <> энргПерерасчетКорректировкаПоказаний.КСПосле)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодРегистрации КАК Период,
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ДанныеТЧ.ПриборУчета КАК ПриборУчета,
	|	ДанныеТЧ.Шкала КАК Шкала,
	|	ДанныеТЧ.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеТЧ.Переворот КАК Переворот,
	|	ДанныеТЧ.Показания КАК Показание,
	|	ЗНАЧЕНИЕ(перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ДанныеТЧ.КС КАК КС,
	|	ДанныеТЧ.ПериодНачисления КАК ПериодНачисления,
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеТЧ.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеТЧ.НомерСтроки КАК НомерСтроки,
	|	ДанныеТЧ.РегистраторПоказаний КАК ДокРегистратор,
	|	ДанныеТЧ.ПоказанияДо КАК ПоказанияДо,
	|	ДанныеТЧ.Показания КАК ПоказанияПосле
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ДатаПоказаний КАК ДатаПоказаний,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		МАКСИМУМ(ДанныеТЧ.РегистраторПоказаний) КАК РегистраторПоказаний
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДанныеТЧ.КлючПомещения КАК КлючПомещения,
	|			ДанныеТЧ.ПриборУчета КАК ПриборУчета,
	|			МАКСИМУМ(ДанныеТЧ.ДатаПоказаний) КАК ДатаПоказаний,
	|			ДанныеТЧ.Шкала КАК Шкала,
	|			ДанныеТЧ.ТарифнаяЗона КАК ТарифнаяЗона
	|		ИЗ
	|			ДанныеТЧ КАК ДанныеТЧ
	|		ГДЕ
	|			ДанныеТЧ.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДанныеТЧ.ПриборУчета,
	|			ДанныеТЧ.Шкала,
	|			ДанныеТЧ.ТарифнаяЗона,
	|			ДанныеТЧ.КлючПомещения) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТЧ КАК ДанныеТЧ
	|			ПО ВложенныйЗапрос.ПриборУчета = ДанныеТЧ.ПриборУчета
	|				И ВложенныйЗапрос.ДатаПоказаний = ДанныеТЧ.ДатаПоказаний
	|				И ВложенныйЗапрос.Шкала = ДанныеТЧ.Шкала
	|				И ВложенныйЗапрос.ТарифнаяЗона = ДанныеТЧ.ТарифнаяЗона
	|				И (ДанныеТЧ.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ПриборУчета,
	|		ВложенныйЗапрос.ДатаПоказаний,
	|		ВложенныйЗапрос.Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.КлючПомещения) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТЧ КАК ДанныеТЧ
	|		ПО ВложенныйЗапрос.ПриборУчета = ДанныеТЧ.ПриборУчета
	|			И ВложенныйЗапрос.ДатаПоказаний = ДанныеТЧ.ДатаПоказаний
	|			И ВложенныйЗапрос.РегистраторПоказаний = ДанныеТЧ.РегистраторПоказаний
	|			И ВложенныйЗапрос.Шкала = ДанныеТЧ.Шкала
	|			И ВложенныйЗапрос.ТарифнаяЗона = ДанныеТЧ.ТарифнаяЗона
	|			И (ДанныеТЧ.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))";
	
	Возврат Запрос.Выполнить();	
	
КонецФункции

Процедура СкорректироватьОплату(Отказ)
	Набор 									= Движения.энргВзаиморасчеты;
	Набор.Записывать 						= Истина;
	Результат 								= РезультатОперативнаяЗадолженность();
	Выборка  								= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
	КонецЦикла;
	
	Набор 									= Движения.энргИсторияОплаты;
	Набор.Записывать 						= Истина;
	Результат 								= РезультатКорректировкаОплаты();
	Выборка  								= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатОперативнаяЗадолженность()
	
	Запрос 		 = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период",				Дата);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ВложенныйЗапрос.ВидДвижения КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	&ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргАбоненты.Район КАК Район,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|		энргПерерасчетКорректировкаОплаты.АбонентБыло КАК Абонент,
	|		энргАбоненты.КлючПомещения КАК КлючПомещения,
	|		ВЫБОР
	|			КОГДА энргПерерасчетКорректировкаОплаты.АбонентБыло = энргПерерасчетКорректировкаОплаты.АбонентСтало
	|				ТОГДА -СУММА(энргПерерасчетКорректировкаОплаты.СуммаБыло - энргПерерасчетКорректировкаОплаты.СуммаСтало)
	|			ИНАЧЕ -СУММА(энргПерерасчетКорректировкаОплаты.СуммаСтало)
	|		КОНЕЦ КАК Сумма
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО энргПерерасчетКорректировкаОплаты.АбонентБыло = энргАбоненты.Ссылка
	|	ГДЕ
	|		энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргПерерасчетКорректировкаОплаты.АбонентБыло,
	|		энргАбоненты.Район,
	|		энргАбоненты.КлючПомещения,
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргАбоненты.Район,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало,
	|		энргАбоненты.КлючПомещения,
	|		СУММА(энргПерерасчетКорректировкаОплаты.СуммаСтало)
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО энргПерерасчетКорректировкаОплаты.АбонентСтало = энргАбоненты.Ссылка
	|	ГДЕ
	|		энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка
	|		И энргПерерасчетКорректировкаОплаты.АбонентБыло <> энргПерерасчетКорректировкаОплаты.АбонентСтало
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргАбоненты.Район,
	|		энргАбоненты.КлючПомещения,
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция РезультатКорректировкаОплаты() 
	Запрос 		 = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период",				Дата);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ИсточникПоступления", ИсточникПоступления);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Период КАК ДатаПлатежа,
	|	&Организация КАК Организация,
	|	энргАбоненты.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК СуммаПлатежа,
	|	&ИсточникПоступления КАК ИсточникПоступления,
	|	СУММА(ВложенныйЗапрос.СуммаАвизо) КАК СуммаАвизо,
	|	СУММА(ВложенныйЗапрос.СуммаКРаспределению) КАК СуммаКРаспределению
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргПерерасчетКорректировкаОплаты.АбонентБыло КАК Абонент,
	|		ВЫБОР
	|			КОГДА энргПерерасчетКорректировкаОплаты.АбонентБыло = энргПерерасчетКорректировкаОплаты.АбонентСтало
	|				ТОГДА -СУММА(энргПерерасчетКорректировкаОплаты.СуммаБыло - энргПерерасчетКорректировкаОплаты.СуммаСтало)
	|			ИНАЧЕ -СУММА(энргПерерасчетКорректировкаОплаты.СуммаСтало)
	|		КОНЕЦ КАК Сумма,
	|		0 КАК СуммаАвизо,
	|		0 КАК СуммаКРаспределению
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО энргПерерасчетКорректировкаОплаты.Ссылка = энргПерерасчет.Ссылка
	|				И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты))
	|				И (энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргПерерасчетКорректировкаОплаты.АбонентБыло,
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало,
	|		СУММА(энргПерерасчетКорректировкаОплаты.СуммаСтало),
	|		0,
	|		0
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО энргПерерасчетКорректировкаОплаты.Ссылка = энргПерерасчет.Ссылка
	|				И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты))
	|				И (энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка)
	|				И (энргПерерасчетКорректировкаОплаты.АбонентБыло <> энргПерерасчетКорректировкаОплаты.АбонентСтало)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргПерерасчетКорректировкаОплаты.АбонентСтало
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПерерасчет.Абонент,
	|		0,
	|		СУММА(энргПерерасчетКорректировкаОплаты.СуммаВозврата),
	|		-СУММА(энргПерерасчетКорректировкаОплаты.СуммаБыло)
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО энргПерерасчетКорректировкаОплаты.Ссылка = энргПерерасчет.Ссылка
	|				И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|				И (энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргПерерасчет.Абонент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПерерасчетКорректировкаОплатыСтало.Абонент,
	|		СУММА(ВЫБОР
	|				КОГДА энргПерерасчет.Абонент <> энргПерерасчетКорректировкаОплатыСтало.Абонент
	|					ТОГДА энргПерерасчетКорректировкаОплатыСтало.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ),
	|		0,
	|		СУММА(энргПерерасчетКорректировкаОплатыСтало.Сумма)
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаОплатыСтало КАК энргПерерасчетКорректировкаОплатыСтало
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО энргПерерасчетКорректировкаОплатыСтало.Ссылка = энргПерерасчет.Ссылка
	|				И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|				И (энргПерерасчетКорректировкаОплатыСтало.Ссылка = &Ссылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргПерерасчетКорректировкаОплатыСтало.Абонент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргПерерасчет.Абонент,
	|		-СУММА(энргПерерасчетКорректировкаОплатыСтало.Сумма),
	|		0,
	|		0
	|	ИЗ
	|		Документ.энргПерерасчет.КорректировкаОплатыСтало КАК энргПерерасчетКорректировкаОплатыСтало
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|			ПО энргПерерасчетКорректировкаОплатыСтало.Ссылка = энргПерерасчет.Ссылка
	|				И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|				И (энргПерерасчетКорректировкаОплатыСтало.Ссылка = &Ссылка)
	|				И (энргПерерасчет.Абонент <> энргПерерасчетКорректировкаОплатыСтало.Абонент)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргПерерасчет.Абонент) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Абонент,
	|	энргАбоненты.Район";
	
	Возврат Запрос.Выполнить();
КонецФункции

Процедура СписатьЗадолженность(Отказ)
	НаборВзаиморасчетыПоМесяцам				= Движения.энргВзаиморасчетыПоМесяцам;
	НаборВзаиморасчетыПоМесяцам.Записывать	= Истина;
	
	НаборВзаиморасчеты			  			= Движения.энргВзаиморасчеты;
	НаборВзаиморасчеты.Записывать 			= Истина;
	
	НаборВзаиморасчетыПени			  		= Движения.энргВзаиморасчетыПоПени;
	НаборВзаиморасчетыПени.Записывать 		= Истина;
	
	НаборРешениюСуда				  		= Движения.энргЗадолженностьПоРешениюСуда;
	НаборРешениюСуда.Записывать 			= Истина;
	
	
	Для каждого СтрокаТЧ Из УменьшениеОбъемаИСуммы Цикл		
		Движение = НаборВзаиморасчетыПоМесяцам.ДобавитьРасход();
		
		Движение.Период			  = Дата;
		Движение.Организация	  = Организация;
		Движение.Район			  = Район;
		Движение.МКД			  = Строение;
		Движение.Абонент		  = Абонент;
		Движение.Услуга			  = СтрокаТЧ.Услуга;
		Движение.ПериодНачисления = СтрокаТЧ.ПериодНачисления;
		Движение.Поставщик		  = СтрокаТЧ.Поставщик;
		Движение.Сумма			  = СтрокаТЧ.СуммаПерерасчет;
		
		Движение = НаборВзаиморасчеты.ДобавитьРасход();
		
		Движение.Период		 		= Дата;
		Движение.Организация 		= Организация;
		Движение.Район		 		= Район;
		Движение.ПериодНачисления	= ПериодНачисления;
		Движение.МКД		 		= Строение;
		Движение.Абонент	 		= Абонент;
		Движение.Сумма		 		= СтрокаТЧ.СуммаПерерасчет; 
		
		Движение = НаборВзаиморасчетыПени.ДобавитьРасход();
		
		Движение.Период				= Дата;
		Движение.Организация		= Организация;
		Движение.Район				= Район;
		Движение.ПериодНачисления	= СтрокаТЧ.ПериодНачисления;
		Движение.МКД				= Строение;
		Движение.Абонент			= Абонент;
		Движение.Услуга				= СтрокаТЧ.Услуга;
		Движение.Сумма				= СтрокаТЧ.Пеня;
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из ЗадолженностьПоРешениюСуда Цикл		
		Движение = НаборРешениюСуда.ДобавитьПриход();	
		
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
		Движение.Период			  = Дата;
		Движение.Организация	  = Организация;
		Движение.Район			  = Район;
		Движение.Строение		  = Строение;
		Движение.Абонент		  = Абонент;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиИВернутьОплату() 	
	
	Набор 									= Движения.энргВзаиморасчеты;
	Набор.Записывать 						= Истина;
	Результат 								= РезультатСторнированияОплаты();
	Выборка  								= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
	КонецЦикла;	
	
	Набор 									= Движения.энргИсторияОплаты;
	Набор.Записывать 						= Истина;
	Результат 								= РезультатКорректировкаОплаты();
	Выборка  								= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатСторнированияОплаты()
	
	Запрос 		 = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период",				Дата);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	энргПерерасчет.Район КАК Район,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	энргПерерасчет.Абонент КАК Абонент,
	|	энргПерерасчет.КлючПомещения КАК КлючПомещения,
	|	СУММА(энргПерерасчетКорректировкаОплаты.СуммаБыло) КАК Сумма,
	|	СУММА(энргПерерасчетКорректировкаОплаты.СуммаВозврата) КАК СуммаВозврата,
	|	&Ссылка КАК Ссылка,
	|	энргПерерасчет.Организация КАК Организация
	|ПОМЕСТИТЬ ДанныеАбонентаШапки
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ПО энргПерерасчет.Ссылка = энргПерерасчетКорректировкаОплаты.Ссылка
	|			И (энргПерерасчет.Ссылка = &Ссылка)
	|			И (энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка)
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПерерасчет.Абонент,
	|	энргПерерасчет.КлючПомещения,
	|	энргПерерасчет.Район,
	|	энргПерерасчет.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАбоненты.Район КАК Район,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	энргПерерасчетКорректировкаОплатыСтало.Абонент КАК Абонент,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения,
	|	СУММА(энргПерерасчетКорректировкаОплатыСтало.Сумма) КАК Сумма,
	|	&Ссылка КАК Ссылка,
	|	энргАбоненты.Организация КАК Организация
	|ПОМЕСТИТЬ ДанныеРаспределения
	|ИЗ
	|	Документ.энргПерерасчет.КорректировкаОплатыСтало КАК энргПерерасчетКорректировкаОплатыСтало
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргПерерасчетКорректировкаОплатыСтало.Абонент = энргАбоненты.Ссылка
	|			И (энргПерерасчетКорректировкаОплатыСтало.Ссылка = &Ссылка)
	|ГДЕ
	|	энргПерерасчетКорректировкаОплатыСтало.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргАбоненты.Район,
	|	энргАбоненты.КлючПомещения,
	|	энргПерерасчетКорректировкаОплатыСтало.Абонент,
	|	энргАбоненты.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеАбонентаШапки.Район КАК Район,
	|	ДанныеАбонентаШапки.ВидДвижения КАК ВидДвижения,
	|	ДанныеАбонентаШапки.Абонент КАК Абонент,
	|	ДанныеАбонентаШапки.КлючПомещения КАК КлючПомещения,
	|	ДанныеАбонентаШапки.Сумма - ДанныеАбонентаШапки.СуммаВозврата - ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) КАК Сумма,
	|	ДанныеАбонентаШапки.Сумма КАК СуммаСписания,
	|	ДанныеАбонентаШапки.СуммаВозврата КАК СуммаВозврата,
	|	ВложенныйЗапрос.Сумма КАК СуммаРаспределения,
	|	ДанныеАбонентаШапки.Организация КАК Организация
	|ПОМЕСТИТЬ Доначисление
	|ИЗ
	|	ДанныеАбонентаШапки КАК ДанныеАбонентаШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДанныеРаспределения.Ссылка КАК Ссылка,
	|			СУММА(ДанныеРаспределения.Сумма) КАК Сумма
	|		ИЗ
	|			ДанныеРаспределения КАК ДанныеРаспределения
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДанныеРаспределения.Ссылка) КАК ВложенныйЗапрос
	|		ПО ДанныеАбонентаШапки.Ссылка = ВложенныйЗапрос.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ВложенныйЗапрос.ВидДвижения КАК ВидДвижения,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	&ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеАбонентаШапки.Район КАК Район,
	|		ДанныеАбонентаШапки.ВидДвижения КАК ВидДвижения,
	|		ДанныеАбонентаШапки.Абонент КАК Абонент,
	|		ДанныеАбонентаШапки.КлючПомещения КАК КлючПомещения,
	|		-ДанныеАбонентаШапки.Сумма КАК Сумма,
	|		ДанныеАбонентаШапки.Организация КАК Организация
	|	ИЗ
	|		ДанныеАбонентаШапки КАК ДанныеАбонентаШапки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДанныеРаспределения.Район,
	|		ДанныеРаспределения.ВидДвижения,
	|		ДанныеРаспределения.Абонент,
	|		ДанныеРаспределения.КлючПомещения,
	|		ДанныеРаспределения.Сумма,
	|		ДанныеРаспределения.Организация
	|	ИЗ
	|		ДанныеРаспределения КАК ДанныеРаспределения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Доначисление.Район,
	|		Доначисление.ВидДвижения,
	|		Доначисление.Абонент,
	|		Доначисление.КлючПомещения,
	|		Доначисление.Сумма,
	|		Доначисление.Организация
	|	ИЗ
	|		Доначисление КАК Доначисление) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|ГДЕ
	|	ВложенныйЗапрос.Сумма <> 0";
	
	Результат = Запрос.Выполнить();
	Возврат Результат
	
КонецФункции

#Область РаспределениеЗадолженности

Процедура ПерераспределитьДолги() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПерерасчет.Ссылка КАК Ссылка,
		|	энргПерерасчет.Дата КАК Дата,
		|	энргПерерасчет.Организация КАК Организация,
		|	энргПерерасчет.Район КАК Район,
		|	энргПерерасчет.Абонент КАК Абонент,
		|	энргПерерасчет.КлючПомещения КАК КлючПомещения,
		|	энргПерерасчет.ПериодНачисления КАК ПериодНачисления
		|ПОМЕСТИТЬ ШапкаДокумента
		|ИЗ
		|	Документ.энргПерерасчет КАК энргПерерасчет
		|ГДЕ
		|	энргПерерасчет.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргПерерасчетЗадолженностьБыла.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА энргПерерасчетЗадолженностьБыла.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетЗадолженностьБыла.Услуга
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|	КОНЕЦ КАК Услуга,
		|	энргПерерасчетЗадолженностьБыла.ВидЗадолженности КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА энргПерерасчетЗадолженностьБыла.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетЗадолженностьБыла.ПериодНачисления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ПериодНачисления,
		|	СУММА(энргПерерасчетЗадолженностьБыла.Задолженность) КАК Задолженность,
		|	ВЫБОР
		|		КОГДА энргПерерасчетЗадолженностьБыла.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетЗадолженностьБыла.Поставщик
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Поставщик,
		|	СУММА(энргПерерасчетЗадолженностьБыла.ЗадолженностьНовая) КАК ЗадолженностьНовая
		|ПОМЕСТИТЬ ПерераспределениеДолговАбонентаШапки
		|ИЗ
		|	Документ.энргПерерасчет.ЗадолженностьБыла КАК энргПерерасчетЗадолженностьБыла
		|ГДЕ
		|	энргПерерасчетЗадолженностьБыла.Ссылка = &Ссылка
		|	И НЕ энргПерерасчетЗадолженностьБыла.Задолженность = энргПерерасчетЗадолженностьБыла.ЗадолженностьНовая
		|
		|СГРУППИРОВАТЬ ПО
		|	энргПерерасчетЗадолженностьБыла.ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА энргПерерасчетЗадолженностьБыла.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетЗадолженностьБыла.Поставщик
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА энргПерерасчетЗадолженностьБыла.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетЗадолженностьБыла.ПериодНачисления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА энргПерерасчетЗадолженностьБыла.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетЗадолженностьБыла.Услуга
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|	КОНЕЦ,
		|	энргПерерасчетЗадолженностьБыла.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргПерерасчетРаспределениеЗадолженностиНовое.Ссылка КАК Ссылка,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.Абонент КАК Абонент,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.КлючПомещения КАК КлючПомещения,
		|	ВЫБОР
		|		КОГДА энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетРаспределениеЗадолженностиНовое.Услуга
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|	КОНЕЦ КАК Услуга,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности КАК ВидЗадолженности,
		|	СУММА(энргПерерасчетРаспределениеЗадолженностиНовое.Задолженность) КАК Задолженность,
		|	ВЫБОР
		|		КОГДА энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетРаспределениеЗадолженностиНовое.Поставщик
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Поставщик,
		|	ВЫБОР
		|		КОГДА энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА ШапкаДокумента.ПериодНачисления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ПериодНачисления,
		|	ШапкаДокумента.Дата КАК Дата
		|ПОМЕСТИТЬ РаспределениеДолговНовыхАбонентов
		|ИЗ
		|	ШапкаДокумента КАК ШапкаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.РаспределениеЗадолженностиНовое КАК энргПерерасчетРаспределениеЗадолженностиНовое
		|		ПО ШапкаДокумента.Ссылка = энргПерерасчетРаспределениеЗадолженностиНовое.Ссылка
		|			И (энргПерерасчетРаспределениеЗадолженностиНовое.Ссылка = &Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА ШапкаДокумента.ПериодНачисления
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетРаспределениеЗадолженностиНовое.Услуга
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|	КОНЕЦ,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.Абонент,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.КлючПомещения,
		|	ШапкаДокумента.Дата,
		|	ВЫБОР
		|		КОГДА энргПерерасчетРаспределениеЗадолженностиНовое.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня)
		|			ТОГДА энргПерерасчетРаспределениеЗадолженностиНовое.Поставщик
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
		|	КОНЕЦ,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ СписокКлючейПомещений
		|ИЗ
		|	(ВЫБРАТЬ
		|		ШапкаДокумента.КлючПомещения КАК КлючПомещения
		|	ИЗ
		|		ШапкаДокумента КАК ШапкаДокумента
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РаспределениеДолговНовыхАбонентов.КлючПомещения
		|	ИЗ
		|		РаспределениеДолговНовыхАбонентов КАК РаспределениеДолговНовыхАбонентов) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокКлючейПомещений.КлючПомещения КАК КлючПомещения,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ КАК МКД
		|ПОМЕСТИТЬ МКДКлючейПомещений
		|ИЗ
		|	СписокКлючейПомещений КАК СписокКлючейПомещений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО СписокКлючейПомещений.КлючПомещения = энргКлючиПомещений.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШапкаДокумента.Дата КАК Период,
		|	ШапкаДокумента.Организация КАК Организация,
		|	ШапкаДокумента.Район КАК Район,
		|	ПерераспределениеДолговАбонентаШапки.ПериодНачисления КАК ПериодНачисления,
		|	МКДКлючейПомещений.МКД КАК МКД,
		|	ШапкаДокумента.Абонент КАК Абонент,
		|	ПерераспределениеДолговАбонентаШапки.Услуга КАК Услуга,
		|	-ПерераспределениеДолговАбонентаШапки.Задолженность КАК ЗадолженностьРасход,
		|	ПерераспределениеДолговАбонентаШапки.ЗадолженностьНовая КАК ЗадолженностьПриход,
		|	ПерераспределениеДолговАбонентаШапки.ВидЗадолженности КАК ВидЗадолженности
		|ПОМЕСТИТЬ ПерераспределениеДолговАбонентаШапкиКонец
		|ИЗ
		|	ШапкаДокумента КАК ШапкаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПерераспределениеДолговАбонентаШапки КАК ПерераспределениеДолговАбонентаШапки
		|		ПО ШапкаДокумента.Ссылка = ПерераспределениеДолговАбонентаШапки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МКДКлючейПомещений КАК МКДКлючейПомещений
		|		ПО ШапкаДокумента.КлючПомещения = МКДКлючейПомещений.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПерераспределениеДолговАбонентаШапкиКонец.Период КАК Период,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Организация КАК Организация,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Район КАК Район,
		|	ПерераспределениеДолговАбонентаШапкиКонец.ПериодНачисления КАК ПериодНачисления,
		|	ПерераспределениеДолговАбонентаШапкиКонец.МКД КАК МКД,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Абонент КАК Абонент,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Услуга КАК Услуга,
		|	ПерераспределениеДолговАбонентаШапкиКонец.ЗадолженностьРасход КАК Сумма,
		|	ПерераспределениеДолговАбонентаШапкиКонец.ВидЗадолженности КАК ВидЗадолженности
		|ИЗ
		|	ПерераспределениеДолговАбонентаШапкиКонец КАК ПерераспределениеДолговАбонентаШапкиКонец
		|ГДЕ
		|	НЕ ПерераспределениеДолговАбонентаШапкиКонец.ЗадолженностьРасход = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПерераспределениеДолговАбонентаШапкиКонец.Период,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Организация,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Район,
		|	ПерераспределениеДолговАбонентаШапкиКонец.ПериодНачисления,
		|	ПерераспределениеДолговАбонентаШапкиКонец.МКД,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Абонент,
		|	ПерераспределениеДолговАбонентаШапкиКонец.Услуга,
		|	ПерераспределениеДолговАбонентаШапкиКонец.ЗадолженностьПриход,
		|	ПерераспределениеДолговАбонентаШапкиКонец.ВидЗадолженности
		|ИЗ
		|	ПерераспределениеДолговАбонентаШапкиКонец КАК ПерераспределениеДолговАбонентаШапкиКонец
		|ГДЕ
		|	НЕ ПерераспределениеДолговАбонентаШапкиКонец.ЗадолженностьПриход = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаспределениеДолговНовыхАбонентов.Дата,
		|	РаспределениеДолговНовыхАбонентов.Абонент.Организация,
		|	РаспределениеДолговНовыхАбонентов.Абонент.Район,
		|	РаспределениеДолговНовыхАбонентов.ПериодНачисления,
		|	МКДКлючейПомещений.МКД,
		|	РаспределениеДолговНовыхАбонентов.Абонент,
		|	РаспределениеДолговНовыхАбонентов.Услуга,
		|	РаспределениеДолговНовыхАбонентов.Задолженность,
		|	РаспределениеДолговНовыхАбонентов.ВидЗадолженности
		|ИЗ
		|	РаспределениеДолговНовыхАбонентов КАК РаспределениеДолговНовыхАбонентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МКДКлючейПомещений КАК МКДКлючейПомещений
		|		ПО РаспределениеДолговНовыхАбонентов.КлючПомещения = МКДКлючейПомещений.КлючПомещения
		|ГДЕ
		|	НЕ РаспределениеДолговНовыхАбонентов.Задолженность = 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборВзаиморасчеты			  		= Движения.энргВзаиморасчеты;
	НаборВзаиморасчеты.Записывать 		= Истина;
	
	НаборНачислениеПени			  		= Движения.энргНачислениеПени;
	НаборНачислениеПени.Записывать 		= Истина;
	
	Выборка = РезультатЗапроса.Выбрать(); 	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидЗадолженности = Перечисления.энргВидыЗадолженности.ОсновнойДолг Тогда
			Движение = НаборВзаиморасчеты.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ПериодНачисления = ПериодНачисления;
		КонецЕсли;
		
		Если Выборка.ВидЗадолженности = Перечисления.энргВидыЗадолженности.Пеня Тогда 
			Движение = НаборНачислениеПени.Добавить();			
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ПериодРасчета = ПериодНачисления;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

Процедура ОчиститьДвижения()
	Для Каждого Набор Из Движения Цикл
		Набор.Записывать  			= Истина;
		Набор.Очистить();			
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьДанныеБлокировочногоАкта()
	
	КлючПомещенияСтрока 	= Абонент.КлючПомещения;
	ДополнительныеДанные 	= Новый Структура("Период,Активность,ПериодРасчета,Район,Организация,ВидНачисления,НачалоПериода,КонецПериода,Абонент,ЧастныйСектор,Строение,Помещение,КлючПомещения",
								Дата,Истина,ПериодНачисления,Район,Организация,Перечисления.энргВидыНачислений.Перерасчет,НачалоМесяца(ПериодНачисления),КонецМесяца(ПериодНачисления),Абонент,КлючПомещенияСтрока.ЧастныйСектор,КлючПомещенияСтрока.Строение,КлючПомещенияСтрока.Помещение,КлючПомещенияСтрока);	
										
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПерерасчетДанныеБлокировочногоАкта.ПериодНачисления КАК ПериодНачисления,
		|	энргПерерасчетДанныеБлокировочногоАкта.ТочкаУчета КАК ТочкаУчета,
		|	энргПерерасчетДанныеБлокировочногоАкта.Услуга КАК Услуга,
		|	энргПерерасчетДанныеБлокировочногоАкта.ПриборУчета КАК ПриборУчета,
		|	энргПерерасчетДанныеБлокировочногоАкта.СпособНачисления КАК СпособНачисления,
		|	энргПерерасчетДанныеБлокировочногоАкта.ЗначениеТарифа КАК ЗначениеТарифа,
		|	энргПерерасчетДанныеБлокировочногоАкта.Поставщик КАК Поставщик,
		|	энргПерерасчетДанныеБлокировочногоАкта.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	энргПерерасчетДанныеБлокировочногоАкта.Шкала КАК Шкала,
		|	энргПерерасчетДанныеБлокировочногоАкта.ТарифнаяЗона КАК ТарифнаяЗона,
		|	энргПерерасчетДанныеБлокировочногоАкта.Измеритель КАК Измеритель,
		|	энргПерерасчетДанныеБлокировочногоАкта.ОбъемУслуги КАК ОбъемУслуги,
		|	энргПерерасчетДанныеБлокировочногоАкта.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
		|	энргПерерасчетДанныеБлокировочногоАкта.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_ДанныеБлокАкта
		|ИЗ
		|	&ДанныеБлокировочногоАкта КАК энргПерерасчетДанныеБлокировочногоАкта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеБлокАкта.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ДанныеБлокАкта.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ДанныеБлокАкта.Услуга КАК Услуга,
		|	ВТ_ДанныеБлокАкта.ПриборУчета КАК ПриборУчета,
		|	ВТ_ДанныеБлокАкта.СпособНачисления КАК СпособНачисления,
		|	ВТ_ДанныеБлокАкта.ЗначениеТарифа КАК ЗначениеТарифа,
		|	ВТ_ДанныеБлокАкта.Поставщик КАК Поставщик,
		|	ВТ_ДанныеБлокАкта.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ВТ_ДанныеБлокАкта.Шкала КАК Шкала,
		|	ВТ_ДанныеБлокАкта.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ВТ_ДанныеБлокАкта.Измеритель КАК Измеритель,
		|	ВТ_ДанныеБлокАкта.ОбъемУслуги КАК ОбъемУслуги,
		|	ВТ_ДанныеБлокАкта.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
		|	ВТ_ДанныеБлокАкта.Сумма КАК Сумма
		|ИЗ
		|	ВТ_ДанныеБлокАкта КАК ВТ_ДанныеБлокАкта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргОбъемНачислений.ПериодНачисления,
		|	энргОбъемНачислений.ТочкаУчета,
		|	энргОбъемНачислений.Услуга,
		|	энргОбъемНачислений.ПриборУчета,
		|	энргОбъемНачислений.СпособНачисления,
		|	энргОбъемНачислений.ЗначениеТарифа,
		|	энргОбъемНачислений.Поставщик,
		|	энргОбъемНачислений.НаправлениеИспользованияТУ,
		|	энргОбъемНачислений.Шкала,
		|	энргОбъемНачислений.ТарифнаяЗона,
		|	энргОбъемНачислений.Измеритель,
		|	-энргОбъемНачислений.ОбъемУслуги,
		|	-энргОбъемНачислений.ОбъемУслугиПотребленный,
		|	-энргОбъемНачислений.Сумма
		|ИЗ
		|	ВТ_ДанныеБлокАкта КАК ВТ_ДанныеБлокАкта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|		ПО ВТ_ДанныеБлокАкта.ПериодНачисления = энргОбъемНачислений.ПериодНачисления
		|			И ВТ_ДанныеБлокАкта.ТочкаУчета = энргОбъемНачислений.ТочкаУчета
		|			И ВТ_ДанныеБлокАкта.Услуга = энргОбъемНачислений.Услуга
		|			И ВТ_ДанныеБлокАкта.ПриборУчета = энргОбъемНачислений.ПриборУчета
		|			И ВТ_ДанныеБлокАкта.СпособНачисления = энргОбъемНачислений.СпособНачисления
		|			И ВТ_ДанныеБлокАкта.Поставщик = энргОбъемНачислений.Поставщик
		|			И ВТ_ДанныеБлокАкта.НаправлениеИспользованияТУ = энргОбъемНачислений.НаправлениеИспользованияТУ
		|			И ВТ_ДанныеБлокАкта.Шкала = энргОбъемНачислений.Шкала
		|			И ВТ_ДанныеБлокАкта.ТарифнаяЗона = энргОбъемНачислений.ТарифнаяЗона
		|			И ВТ_ДанныеБлокАкта.Измеритель = энргОбъемНачислений.Измеритель
		|			И (энргОбъемНачислений.Организация = &Организация)
		|			И (энргОбъемНачислений.Район = &Район)
		|			И (энргОбъемНачислений.Строение = &Строение)
		|			И (энргОбъемНачислений.Помещение = &Помещение)
		|			И (энргОбъемНачислений.Абонент = &Абонент)";
	
	Запрос.УстановитьПараметр("ДанныеБлокировочногоАкта",ДанныеБлокировочногоАкта.Выгрузить());
	Запрос.УстановитьПараметр("Организация"				,Организация);
	Запрос.УстановитьПараметр("Район"					,Район);
	Запрос.УстановитьПараметр("Строение"				,ДополнительныеДанные.Строение);
	Запрос.УстановитьПараметр("Помещение"				,ДополнительныеДанные.Помещение);
	Запрос.УстановитьПараметр("Абонент"					,ДополнительныеДанные.Абонент);
	
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	Выборка 				= РезультатЗапроса.Выбрать();
	
	НаборОбъемНачислений 	= Движения.энргОбъемНачислений;
	НаборОбъемНачислений.Очистить();	
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НаборОбъемНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ДополнительныеДанные);
	КонецЦикла;
		
КонецПроцедуры

Функция ЕстьБлокировочныйАкт()
										
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеОбъемовНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ДанныеОбъемовНачислений.Строение КАК Строение,
		|	ДанныеОбъемовНачислений.Помещение КАК Помещение,
		|	ДанныеОбъемовНачислений.Абонент КАК Абонент,
		|	ДанныеОбъемовНачислений.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеОбъемовНачислений.Услуга КАК Услуга,
		|	ДанныеОбъемовНачислений.ПриборУчета КАК ПриборУчета,
		|	ДанныеОбъемовНачислений.СпособНачисления КАК СпособНачисления,
		|	ДанныеОбъемовНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
		|	ДанныеОбъемовНачислений.Поставщик КАК Поставщик,
		|	ДанныеОбъемовНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеОбъемовНачислений.Шкала КАК Шкала,
		|	ДанныеОбъемовНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеОбъемовНачислений.Измеритель КАК Измеритель
		|ПОМЕСТИТЬ ДанныеОбъемовНачислений
		|ИЗ
		|	&ДанныеОбъемовНачислений КАК ДанныеОбъемовНачислений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
		|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
		|	энргОбъемНачислений.Услуга КАК Услуга,
		|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
		|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
		|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
		|	энргОбъемНачислений.Поставщик КАК Поставщик,
		|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	энргОбъемНачислений.Шкала КАК Шкала,
		|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
		|	энргОбъемНачислений.Измеритель КАК Измеритель
		|ИЗ
		|	ДанныеОбъемовНачислений КАК ДанныеОбъемовНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
		|			ПО энргОбъемНачислений.Регистратор = энргПерерасчет.Ссылка
		|				И (энргПерерасчет.ВидОперации = &БлокировочныйАкт)
		|		ПО ДанныеОбъемовНачислений.ПериодНачисления = энргОбъемНачислений.ПериодНачисления
		|			И ДанныеОбъемовНачислений.Строение = энргОбъемНачислений.Строение
		|			И ДанныеОбъемовНачислений.Помещение = энргОбъемНачислений.Помещение
		|			И ДанныеОбъемовНачислений.Абонент = энргОбъемНачислений.Абонент
		|			И ДанныеОбъемовНачислений.ТочкаУчета = энргОбъемНачислений.ТочкаУчета
		|			И ДанныеОбъемовНачислений.Услуга = энргОбъемНачислений.Услуга
		|			И ДанныеОбъемовНачислений.ПриборУчета = энргОбъемНачислений.ПриборУчета
		|			И ДанныеОбъемовНачислений.СпособНачисления = энргОбъемНачислений.СпособНачисления
		|			И ДанныеОбъемовНачислений.Поставщик = энргОбъемНачислений.Поставщик
		|			И ДанныеОбъемовНачислений.НаправлениеИспользованияТУ = энргОбъемНачислений.НаправлениеИспользованияТУ
		|			И ДанныеОбъемовНачислений.Шкала = энргОбъемНачислений.Шкала
		|			И ДанныеОбъемовНачислений.ТарифнаяЗона = энргОбъемНачислений.ТарифнаяЗона
		|			И ДанныеОбъемовНачислений.Измеритель = энргОбъемНачислений.Измеритель
		|			И (энргОбъемНачислений.Организация = &Организация)
		|			И (энргОбъемНачислений.Район = &Район)
		|			И (энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет)
		|			И (энргОбъемНачислений.Период <= &Дата)";
	
	Запрос.УстановитьПараметр("ДанныеОбъемовНачислений"	,Движения.энргОбъемНачислений.Выгрузить());
	Запрос.УстановитьПараметр("Организация"				,Организация);
	Запрос.УстановитьПараметр("Район"					,Район);
	Запрос.УстановитьПараметр("Дата"					,Дата);
	Запрос.УстановитьПараметр("БлокировочныйАкт"		,Перечисления.энргВидыОпераций.энргПерерасчет_БлокировочныйАкт);
	
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	Выборка 				= РезультатЗапроса.Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По введенным данным есть Блокировочный акт.");
	КонецЦикла;
	
	Возврат НЕ РезультатЗапроса.Пустой();
		
КонецФункции

#Область ДанныеОплатыОтВидаОперации

Процедура РаспределениеЗадолженности_ДанныеОплаты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПерерасчет.Организация КАК Организация,
		|	энргПерерасчет.ПериодНачисления КАК ПериодНачисления,
		|	энргПерерасчет.Район КАК Район,
		|	энргПерерасчет.КлючПомещения КАК КлючПомещения,
		|	энргПерерасчет.Абонент КАК Абонент,
		|	энргПерерасчет.Дата КАК Дата,
		|	энргПерерасчет.Ссылка КАК ДокРегистратор,
		|	0 КАК СуммаОплаты,
		|	ЛОЖЬ КАК ЭтоОплата,
		|	ЛОЖЬ КАК ЭтоКорректировкаОплаты
		|ПОМЕСТИТЬ ШапкаДокумента
		|ИЗ
		|	Документ.энргПерерасчет КАК энргПерерасчет
		|ГДЕ
		|	энргПерерасчет.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШапкаДокумента.Организация КАК Организация,
		|	ШапкаДокумента.ПериодНачисления КАК ПериодНачисления,
		|	ШапкаДокумента.Район КАК Район,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ КАК МКД,
		|	ШапкаДокумента.Абонент КАК Абонент,
		|	ШапкаДокумента.Дата КАК Дата,
		|	ШапкаДокумента.ДокРегистратор КАК ДокРегистратор,
		|	ШапкаДокумента.СуммаОплаты КАК СуммаОплаты,
		|	ШапкаДокумента.ЭтоОплата КАК ЭтоОплата,
		|	ШапкаДокумента.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты
		|ПОМЕСТИТЬ ИтоговыеДанные
		|ИЗ
		|	ШапкаДокумента КАК ШапкаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО ШапкаДокумента.КлючПомещения = энргКлючиПомещений.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШапкаДокумента.Организация,
		|	ШапкаДокумента.ПериодНачисления,
		|	энргАбоненты.Район,
		|	ВЫБОР
		|		КОГДА энргКлючиПомещений.ЧастныйСектор
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|		ИНАЧЕ энргКлючиПомещений.Строение
		|	КОНЕЦ,
		|	энргПерерасчетРаспределениеЗадолженностиНовое.Абонент,
		|	ШапкаДокумента.Дата,
		|	ШапкаДокумента.ДокРегистратор,
		|	ШапкаДокумента.СуммаОплаты,
		|	ШапкаДокумента.ЭтоОплата,
		|	ШапкаДокумента.ЭтоКорректировкаОплаты
		|ИЗ
		|	ШапкаДокумента КАК ШапкаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.РаспределениеЗадолженностиНовое КАК энргПерерасчетРаспределениеЗадолженностиНовое
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|			ПО энргПерерасчетРаспределениеЗадолженностиНовое.КлючПомещения = энргКлючиПомещений.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|			ПО энргПерерасчетРаспределениеЗадолженностиНовое.Абонент = энргАбоненты.Ссылка
		|		ПО ШапкаДокумента.ДокРегистратор = энргПерерасчетРаспределениеЗадолженностиНовое.Ссылка
		|			И (энргПерерасчетРаспределениеЗадолженностиНовое.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИтоговыеДанные.Организация КАК Организация,
		|	ИтоговыеДанные.ПериодНачисления КАК ПериодНачисления,
		|	ИтоговыеДанные.Район КАК Район,
		|	ИтоговыеДанные.МКД КАК МКД,
		|	ИтоговыеДанные.Абонент КАК Абонент,
		|	ИтоговыеДанные.Дата КАК Дата,
		|	ИтоговыеДанные.ДокРегистратор КАК ДокРегистратор,
		|	ИтоговыеДанные.СуммаОплаты КАК СуммаОплаты,
		|	ИтоговыеДанные.ЭтоОплата КАК ЭтоОплата,
		|	ИтоговыеДанные.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты
		|ИЗ
		|	ИтоговыеДанные КАК ИтоговыеДанные";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ДополнительныеСвойства.Вставить("ДанныеОплаты", РезультатЗапроса);
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли