#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция РезультатАвансыНаГраницуСбитойПоследовательности(МВТ, ОписаниеОтборов, ГраницыПериода) Экспорт 
	
	СхемаЗапроса 	 = Новый СхемаЗапроса;
	ПараметрыСхемы 	 = Новый Структура;
	ПараметрыЗапроса = Новый Структура;	
	
	ПараметрыВТ		= Новый Массив;
	ОтборыВСписке	= Новый Структура;
	Отборы = Новый Структура;
	Отборы.Вставить("Организация", "Организация");
	Отборы.Вставить("Район"		 , "Район");
			
	Если НЕ ОписаниеОтборов.МКД = Неопределено Тогда 
		Отборы.Вставить("МКД", "МКД");
		ПараметрыЗапроса.Вставить("МКД", ОписаниеОтборов.МКД);
	КонецЕсли;
	
	Если ОписаниеОтборов.Свойство("СписокМКД") И НЕ ОписаниеОтборов.СписокМКД = Неопределено Тогда 
		ОтборыВСписке.Вставить("МКД", "СписокМКД");
		ПараметрыЗапроса.Вставить("СписокМКД", ОписаниеОтборов.СписокМКД);
	КонецЕсли;
	
	Если НЕ ОписаниеОтборов.Абонент = Неопределено Тогда 
		Отборы.Вставить("Абонент", "Абонент");
		ПараметрыЗапроса.Вставить("Абонент", ОписаниеОтборов.Абонент);
	КонецЕсли; 
	
	Если ОтборыВСписке.Количество() <> 0 Тогда 
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(ОтборыВСписке));	
	КонецЕсли;
	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Отборы));	
	ПараметрыСхемы.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	ПараметрыСхемы.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериодаРасчета"));
	ПараметрыСхемы.Вставить("НачалоПериода"	, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериодаРасчета"));
	ПараметрыСхемы.Вставить("КонецПериода"	, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КонецПериодаРасчета"));
	
	РегистрыНакопления.энргАвансы.ЗаполнитьСхемуОстаткиНаМоментВремени(СхемаЗапроса, ПараметрыСхемы, "АвансыОстатки");
	РегистрыНакопления.энргАвансы.ЗаполнитьСхемуОборотыЗаПериод(СхемаЗапроса, ПараметрыСхемы, "АвансыОбороты");
	СформироватьИтоговуюВыборкуАвансыНаГраницуСбитойПоследовательности(СхемаЗапроса);	
	
	ПараметрыЗапроса.Вставить("Организация"			, ОписаниеОтборов.Организация);
	ПараметрыЗапроса.Вставить("Район"				, ОписаниеОтборов.Район);
	ПараметрыЗапроса.Вставить("МКД"					, ОписаниеОтборов.МКД);
	ПараметрыЗапроса.Вставить("Абонент"				, ОписаниеОтборов.Абонент);
	ПараметрыЗапроса.Вставить("НачалоПериодаРасчета", ГраницыПериода.НачалоПериодаРасчета);
	ПараметрыЗапроса.Вставить("КонецПериодаРасчета"	, ГраницыПериода.КонецПериодаРасчета);
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПараметрыЗапроса, МВТ);
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьИтоговуюВыборкуАвансыНаГраницуСбитойПоследовательности(СхемаЗапроса)
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(); 	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ДокументОплаты КАК ДокументОплаты,
	|	ВложенныйЗапрос.Разделитель КАК Разделитель,
	|	СУММА(ВложенныйЗапрос.СуммаАванса) КАК СуммаАванса,
	|	ВложенныйЗапрос.ЖивыеДеньги КАК ЖивыеДеньги

	|ИЗ
	|	(ВЫБРАТЬ
	|		РазличныеАбоненты.Организация КАК Организация,
	|		РазличныеАбоненты.ПериодНачисления КАК ПериодНачисления,
	|		РазличныеАбоненты.Район КАК Район,
	|		РазличныеАбоненты.МКД КАК МКД,
	|		РазличныеАбоненты.Абонент КАК Абонент,
	|		АвансыОстатки.ДокументОплаты КАК ДокументОплаты,
	|		АвансыОстатки.Разделитель КАК Разделитель,
	|		АвансыОстатки.СуммаОстаток КАК СуммаАванса,
	|		АвансыОстатки.ЖивыеДеньги КАК ЖивыеДеньги
	|	ИЗ
	|		РазличныеАбоненты КАК РазличныеАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОстатки КАК АвансыОстатки
	|			ПО РазличныеАбоненты.Район = АвансыОстатки.Район
	|				И РазличныеАбоненты.МКД = АвансыОстатки.МКД
	|				И РазличныеАбоненты.Абонент = АвансыОстатки.Абонент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МинимумРегистратор.Организация,
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.МКД,
	|		МинимумРегистратор.Абонент,
	|		АвансыОбороты.ДокументОплаты,
	|		АвансыОбороты.Разделитель,
	|		СУММА(АвансыОбороты.СуммаОборот),
	|		АвансыОбороты.ЖивыеДеньги 
	|	ИЗ
	|		МинимумРегистратор КАК МинимумРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОбороты КАК АвансыОбороты
	|			ПО (ВЫБОР
	|					КОГДА МинимумРегистратор.ДопПорядок = 10  
	|						ТОГДА 
	|							ВЫБОР 
	|								КОГДА АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени 
	|									ТОГДА ЛОЖЬ 
	|								ИНАЧЕ ИСТИНА 
	|							КОНЕЦ
	|					КОГДА МинимумРегистратор.ДатаРегистратора > АвансыОбороты.Период
	|						ТОГДА ИСТИНА
	//|					КОГДА МинимумРегистратор.ДатаРегистратора = АвансыОбороты.Период
	//|						ТОГДА ВЫБОР
	//|								КОГДА МинимумРегистратор.ДопПорядок = 0
	//|										И АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачисление
	//|									ТОГДА ЛОЖЬ
	//|								КОГДА МинимумРегистратор.ДопПорядок = 10
	//|									ТОГДА АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	//|								ИНАЧЕ МинимумРегистратор.ДокРегистратор > АвансыОбороты.Регистратор
	//|										ИЛИ АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	//|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|				И МинимумРегистратор.Район = АвансыОбороты.Район
	|				И МинимумРегистратор.МКД = АвансыОбороты.МКД
	|				И МинимумРегистратор.Абонент = АвансыОбороты.Абонент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимумРегистратор.Организация,
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.МКД,
	|		МинимумРегистратор.Абонент,
	|		АвансыОбороты.ДокументОплаты,
	|		АвансыОбороты.Разделитель,
	|		АвансыОбороты.ЖивыеДеньги) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.ДокументОплаты,
	|	ВложенныйЗапрос.Разделитель,
	|	ВложенныйЗапрос.ЖивыеДеньги
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	Абонент,
	|	ДокументОплаты,
	|	Разделитель");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли