#Область ОбработчикиСобытий

&НаКлиенте
Процедура Завершить(Команда)
	СоотвествиеУслуг  = Новый Соответствие;
	Для Каждого стр из ДанныеСоставныхУслуг цикл
		   СоотвествиеУслуг.Вставить(стр.Услуга,Новый Структура(КлючСтруктуры,стр.Договор));
	КонецЦикла;  	
	Закрыть(Новый Структура("ДанныеИзменены,СоотвествиеУслуг",ИСТИНА,СоотвествиеУслуг));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КлючСтруктуры 					= Параметры.КлючСтруктуры.Поставщик;
	для Каждого КлючЗначение из Параметры.СоотвествиеУслуг цикл
		СтрокаТаблицы  				= ДанныеСоставныхУслуг.Добавить();
		СтрокаТаблицы.Услуга  		= КлючЗначение.Ключ;
		СтрокаТаблицы.Договор	= КлючЗначение.Значение[КлючСтруктуры];
	КонецЦикла; 	
КонецПроцедуры

//&НаКлиенте
//Процедура ДанныеСоставныхУслугПриИзменении(Элемент)
//	ДанныеИзменены = истина;
//КонецПроцедуры



#КонецОбласти
