#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получение списка доступных схем с учетом переданных параметров.
//
// Параметры:
//  Период			 - Дата		 - период, для которого нужно получить схемы.
//  СтруктураОтборов - Структура - структура с параметрами отбора
// 
// Возвращаемое значение:
//  РезультатЗапроса - список схем, удовлетворяющих переданным параметрам.
//
Функция ПолучитьДоступныеСхемы(Период, СтруктураОтборов) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргСхемыПИДОрганизацийСрезПоследних.Схема КАК Схема
	|ИЗ
	|	РегистрСведений.энргСхемыПИДОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент = &Абонент
	|				И ГруппаАбонента = &ГруппаАбонента
	|				И КатегорияДебитора = &КатегорияДебитора
	|				И МКД = &МКД
	|				И Услуга = &Услуга) КАК энргСхемыПИДОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 			Период);
	Если СтруктураОтборов.Свойство("Абонент") Тогда
		Запрос.УстановитьПараметр("Абонент", 			СтруктураОтборов.Абонент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Абонент = &Абонент", "ИСТИНА");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("ГруппаАбонента") Тогда
		Запрос.УстановитьПараметр("ГруппаАбонента", 			СтруктураОтборов.ГруппаАбонента);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГруппаАбонента = &ГруппаАбонента", "ИСТИНА");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("КатегорияДебитора") Тогда
		Запрос.УстановитьПараметр("КатегорияДебитора", 			СтруктураОтборов.КатегорияДебитора);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КатегорияДебитора = &КатегорияДебитора", "ИСТИНА");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("МКД") Тогда
		Запрос.УстановитьПараметр("МКД", 			СтруктураОтборов.МКД);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МКД = &МКД", "ИСТИНА");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("Организация") Тогда
		Запрос.УстановитьПараметр("Организация", 			СтруктураОтборов.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "ИСТИНА");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("Район") Тогда
		Запрос.УстановитьПараметр("Район", 			СтруктураОтборов.Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "ИСТИНА");
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("Услуга") Тогда
		Запрос.УстановитьПараметр("Услуга", 			СтруктураОтборов.Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Услуга = &Услуга", "ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли