#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДополнительныеСвойства") Тогда
		УстановитьОтборПоДополнительнымСвойствам(Параметры.ДополнительныеСвойства);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоДополнительнымСвойствам(ДополнительныеСвойства)
	перем мСсылки; 	
	
	мСсылки 		= Обработки.энргЗначенияНормативовПотребленияМенеджер.БлагоустройстваУслуги(ДополнительныеСвойства);		
	Если мСсылки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 	
	СписокСсылок 	= Новый СписокЗначений;
	СписокСсылок.ЗагрузитьЗначения(мСсылки);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",СписокСсылок,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

#КонецОбласти
