#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	яНаименование 						= "";	
	Коллекция 							= КонтактнаяИнформация;
	СтрокиКИ 							= Коллекция.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресПомещения));
	
	Если СтрокиКИ.Количество() > 0 Тогда
		яНаименование = Справочники.энргПомещения.СформироватьНаименование(СтрокиКИ[0].Значение);  			
		Если ЗначениеЗаполнено(Наименование) Тогда
			Наименование 				= яНаименование;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Отказ		= Истина;
	КонецЕсли;
		
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если ЕстьПомещениеСТакимАдресом() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Уже есть помещение с таким адресом");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый Тогда 
		ЧастныйСектор 						= ?(Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД, Ложь,Истина);
		КлючПомещенияСсылка 				= Справочники.энргКлючиПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор);
		Набор 								= РегистрыСведений.энргКлючиПомещений.СоздатьНаборЗаписей();
		Запись 								= Набор.Добавить();
		Запись.Строение 					= Строение;
		Запись.Помещение 					= Ссылка;
		Запись.КлючПомещения 				= КлючПомещенияСсылка;
		Запись.ЧастныйСектор 				= ЧастныйСектор;
		Попытка
			Набор.Записать(Ложь);
		Исключение
			ВызватьИсключение "Какой то текст";
			Возврат;
		КонецПопытки;
		
		КлючПомещенияОбъект 				= Справочники.энргКлючиПомещений.СоздатьЭлемент();
		КлючПомещенияОбъект.Строение 		= Строение;
		КлючПомещенияОбъект.Помещение 		= Ссылка;
		КлючПомещенияОбъект.ЧастныйСектор 	= ЧастныйСектор;
		КлючПомещенияОбъект.УстановитьСсылкуНового(КлючПомещенияСсылка);
		КлючПомещенияОбъект.Записать();	
		
		ДополнительныеСвойства.Вставить("КлючПомещения",КлючПомещенияСсылка); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьПомещениеСТакимАдресом()
	
	Ответ = Ложь;
	
	НайденнаяСтрока = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.АдресПомещения));
	
	Если НайденнаяСтрока.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	энргПомещенияКонтактнаяИнформация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
		|ГДЕ
		|	энргПомещенияКонтактнаяИнформация.Ссылка <> &Ссылка
		|	И энргПомещенияКонтактнаяИнформация.Вид = &Вид
		|	И энргПомещенияКонтактнаяИнформация.Представление = &Представление
		|	И энргПомещенияКонтактнаяИнформация.Ссылка.Строение = &Строение";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресПомещения);
		Запрос.УстановитьПараметр("Строение", Строение);
		Запрос.УстановитьПараметр("Представление", НайденнаяСтрока[0].Представление);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Ответ = Выборка.Следующий();
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли