
#Область СтандартныеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	
    Схема 				= Обработки.энргПечатьСчетаНаОплатуАбоненту.ПолучитьМакет("ОсновнаяСхемаКомановкиДанных"); 
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
    ИсточникНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
    КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
КонецПроцедуры

#КонецОбласти

