#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет схему запроса остатками.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуЗапросаОстатками(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "НачисленныйСреднийОбъемОстатки") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 							= новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуЗапросаОстатками());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ЧастныйСектор, Строение, Помещение, Абонент, ПериодНачисления, ТочкаУчета, Услуга, НаправлениеИспользованияТУ";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);			
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
	
КонецПроцедуры

// Читает записи по помещению до записи.
//
// Параметры:
//  Набор	-	 РегистрНакопленияНаборЗаписей.энргНачисленныйСреднийОбъем.
//
Процедура ПрочитатьЗаписиПоПомещениюДоЗаписи(Набор) Экспорт
	
	Запрос  = Новый Запрос(ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи());
	Запрос.УстановитьПараметр("Регистратор", 	Набор.ДополнительныеСвойства["ДокРегистратор"]);
	Запрос.УстановитьПараметр("Организация", 	Набор.ДополнительныеСвойства["Организация"]);
	Запрос.УстановитьПараметр("Район", 			Набор.ДополнительныеСвойства["Район"]);
	Запрос.УстановитьПараметр("Строение", 		Набор.ДополнительныеСвойства["Строение"]);
	Запрос.УстановитьПараметр("Помещение", 		Набор.ДополнительныеСвойства["Помещение"]);
	Набор.ДополнительныеСвойства.Вставить("ДанныеНабораДоЗаписи", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Заполняет схему набором записей по ключу помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуНаборомЗаписейПоКлючуПомещения(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаборЗаписейПоКлючуПомещения());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
		
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Период,Организация,ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Услуга,ТочкаУчета,Регистратор";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"НачисленныйСреднийОбъем",ПараметрыСхемы.ПараметрыВТ,ДоступныеПараметры);
		
		ДоступныеПараметры 			= "КлючПомещения";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"КлючиПомещений",ПараметрыСхемы.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет записи по абонентам.
//
// Параметры:
//  НаборОбъемНачислений	-	РегистрНакопленияНаборЗаписей.энргНачисленныйСреднийОбъем.
//
Процедура УдалитьЗаписиПоАбонентам(НаборОбъемНачислений) Экспорт
	
	НаборОбъемНачислений.Прочитать();		
	СтрокиУдалить 							= Новый Массив;
	МассивАбонентов 					= НаборОбъемНачислений.ДополнительныеСвойства["МассивАбонентов"];
	Для Каждого СтрокаНабора ИЗ НаборОбъемНачислений Цикл
		Если МассивАбонентов.Найти(СтрокаНабора.Абонент) = Неопределено Тогда
			Продолжить;
		КонецЕсли;			
		СтрокиУдалить.Добавить(СтрокаНабора);
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		НаборОбъемНачислений.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуЗапросаОстатками()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНачисленныйСреднийОбъемОстатки.Организация КАК Организация,
	|	энргНачисленныйСреднийОбъемОстатки.Район КАК Район,
	|	энргНачисленныйСреднийОбъемОстатки.ЧастныйСектор КАК ЧастныйСектор,
	|	энргНачисленныйСреднийОбъемОстатки.Строение КАК Строение,
	|	энргНачисленныйСреднийОбъемОстатки.Помещение КАК Помещение,
	|	энргНачисленныйСреднийОбъемОстатки.Абонент КАК Абонент,
	|	энргНачисленныйСреднийОбъемОстатки.ПериодНачисления КАК ПериодНачисления,
	|	энргНачисленныйСреднийОбъемОстатки.ТочкаУчета КАК ТочкаУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Услуга КАК Услуга,
	|	энргНачисленныйСреднийОбъемОстатки.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргНачисленныйСреднийОбъемОстатки.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргНачисленныйСреднийОбъемОстатки.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	энргНачисленныйСреднийОбъемОстатки.ПриборУчета КАК ПриборУчета,
	|	энргНачисленныйСреднийОбъемОстатки.Шкала КАК Шкала,
	|	энргНачисленныйСреднийОбъемОстатки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргНачисленныйСреднийОбъемОстатки.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	энргНачисленныйСреднийОбъемОстатки.Поставщик КАК Поставщик,
	|	энргНачисленныйСреднийОбъемОстатки.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	энргНачисленныйСреднийОбъемОстатки.ПриборЗависимой КАК ПриборЗависимой,
	|	энргНачисленныйСреднийОбъемОстатки.СпособНачисления КАК СпособНачисления,
	|	энргНачисленныйСреднийОбъемОстатки.СверхНорматива КАК СверхНорматива,
	|	энргНачисленныйСреднийОбъемОстатки.СуммаОстаток КАК Сумма,
	|	энргНачисленныйСреднийОбъемОстатки.ОбъемУслугиОстаток КАК ОбъемУслуги,
	|	энргНачисленныйСреднийОбъемОстатки.ОбъемУслугиПотребленныйОстаток КАК ОбъемУслугиПотребленный,
	|	энргНачисленныйСреднийОбъемОстатки.ОбъемУслугиПотериОстаток КАК ОбъемУслугиПотери,
	|	энргНачисленныйСреднийОбъемОстатки.ОбъемУслугиПотребленныйПотериОстаток КАК ОбъемУслугиПотребленныйПотери,
	|	энргПомещения.Родитель КАК ПомещениеРодитель,
	|	КлючиПомещений.КлючПомещения КАК КлючПомещения,
	|	энргНачисленныйСреднийОбъемОстатки.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргНачисленныйСреднийОбъемОстатки.НормаПотребления КАК НормаПотребления
	|ИЗ
	|	РегистрНакопления.энргНачисленныйСреднийОбъем.Остатки КАК энргНачисленныйСреднийОбъемОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО энргНачисленныйСреднийОбъемОстатки.Помещение = энргПомещения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК КлючиПомещений
	|		ПО энргНачисленныйСреднийОбъемОстатки.Строение = КлючиПомещений.Строение
	|			И энргНачисленныйСреднийОбъемОстатки.Помещение = КлючиПомещений.Помещение";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи()
	
	Текст  =
	"ВЫБРАТЬ 
	|	Набор.*
	|ИЗ
	|	РегистрНакопления.энргНачисленныйСреднийОбъем КАК Набор
	|ГДЕ
	|	Набор.Регистратор = &Регистратор
	|	И Набор.Организация = &Организация
	|	И Набор.Район = &Район
	|	И Набор.Строение = &Строение
	|	И Набор.Помещение в (&Помещение)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНаборЗаписейПоКлючуПомещения()
	 	
	Текст = 
	"ВЫБРАТЬ
	|НачисленныйСреднийОбъем.*,
	|КлючиПомещений.КлючПомещения
	|ИЗ
	|	РегистрНакопления.энргНачисленныйСреднийОбъем КАК НачисленныйСреднийОбъем
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК КлючиПомещений
	|		ПО НачисленныйСреднийОбъем.Строение = КлючиПомещений.Строение
	|			И НачисленныйСреднийОбъем.Помещение = КлючиПомещений.Помещение
	|			И (НачисленныйСреднийОбъем.Регистратор ССЫЛКА Документ.энргНачисление 
	|				ИЛИ НачисленныйСреднийОбъем.Регистратор ССЫЛКА Документ.энргПерерасчет)";
	
	Возврат Текст;	

КонецФункции

#КонецОбласти

#КонецЕсли