#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.Свойство("ДанныеНабораДоЗаписи") Тогда
		Для Каждого СтрокаНабораДоЗаписи Из ДополнительныеСвойства.ДанныеНабораДоЗаписи Цикл
			
			СтрокаНабора  					= ЭтотОбъект.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНабораДоЗаписи);
			СтрокаНабора.ОбъемУслуги 						= -СтрокаНабора.ОбъемУслуги;
			СтрокаНабора.ОбъемУслугиПотери 					= -СтрокаНабора.ОбъемУслугиПотери;
			СтрокаНабора.ОбъемУслугиПотребленный 			= -СтрокаНабора.ОбъемУслугиПотребленный;
			СтрокаНабора.ОбъемУслугиПотребленныйПотери 		= -СтрокаНабора.ОбъемУслугиПотребленныйПотери;			
			СтрокаНабора.Сумма 								= -СтрокаНабора.Сумма;
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргНачисленныйСреднийОбъем","ДанныеНабора","",Истина,Истина) + "
		|ПОМЕСТИТЬ ДанныеНабора
		|ИЗ
		|	&ДанныеНабора КАК ДанныеНабора
		|;		
		|ВЫБРАТЬ
		|	ДанныеНабора.Организация КАК Организация,
		|	ДанныеНабора.Район КАК Район,
		|	ДанныеНабора.ЧастныйСектор КАК ЧастныйСектор,
		|	ДанныеНабора.Строение КАК Строение,
		|	ДанныеНабора.Помещение КАК Помещение,
		|	ДанныеНабора.Абонент КАК Абонент,
		|	ДанныеНабора.ПериодНачисления КАК ПериодНачисления,
		|	ДанныеНабора.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеНабора.Услуга КАК Услуга,
		|	ДанныеНабора.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеНабора.ЗначениеТарифа КАК ЗначениеТарифа,
		|	ДанныеНабора.ПриборУчета КАК ПриборУчета,
		|	ДанныеНабора.Шкала КАК Шкала,
		|	ДанныеНабора.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеНабора.Поставщик КАК Поставщик,
		|	ДанныеНабора.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
		|	ДанныеНабора.ПриборЗависимой КАК ПриборЗависимой,
		|	ДанныеНабора.СпособНачисления КАК СпособНачисления,
		|	ДанныеНабора.СверхНорматива КАК СверхНорматива,
		|	ДанныеНабора.ТарифнаяГруппа КАК ТарифнаяГруппа,
		|	СУММА(ДанныеНабора.ОбъемУслуги) КАК ОбъемУслуги,
		|	СУММА(ДанныеНабора.ОбъемУслугиПотери) КАК ОбъемУслугиПотери,
		|	СУММА(ДанныеНабора.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
		|	СУММА(ДанныеНабора.ОбъемУслугиПотребленныйПотери) КАК ОбъемУслугиПотребленныйПотери,
		|	СУММА(ДанныеНабора.Сумма) КАК Сумма
		|ИЗ
		|	ДанныеНабора КАК ДанныеНабора
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеНабора.Организация,
		|	ДанныеНабора.Район,
		|	ДанныеНабора.ЧастныйСектор,
		|	ДанныеНабора.Строение,
		|	ДанныеНабора.Помещение,
		|	ДанныеНабора.Абонент,
		|	ДанныеНабора.ПериодНачисления,
		|	ДанныеНабора.ТочкаУчета,
		|	ДанныеНабора.Услуга,
		|	ДанныеНабора.НаправлениеИспользованияТУ,
		|	ДанныеНабора.ЗначениеТарифа,
		|	ДанныеНабора.ПриборУчета,
		|	ДанныеНабора.Шкала,
		|	ДанныеНабора.ТарифнаяЗона,
		|	ДанныеНабора.Поставщик,
		|	ДанныеНабора.ЗависимаяТочкаУчета,
		|	ДанныеНабора.ПриборЗависимой,
		|	ДанныеНабора.СпособНачисления,
		|	ДанныеНабора.СверхНорматива,
		|	ДанныеНабора.ТарифнаяГруппа
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ДанныеНабора.ОбъемУслуги) <> 0
		|		ИЛИ СУММА(ДанныеНабора.ОбъемУслугиПотери) <> 0
		|		ИЛИ СУММА(ДанныеНабора.ОбъемУслугиПотребленный) <> 0
		|		ИЛИ СУММА(ДанныеНабора.ОбъемУслугиПотребленныйПотери) <> 0
		|		ИЛИ СУММА(ДанныеНабора.Сумма) <> 0)";
		
		Запрос.УстановитьПараметр("ДанныеНабора", ЭтотОбъект.Выгрузить());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			ЭтотОбъект.Очистить();
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти