
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(ЭтотОбъект,Отказ,Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
		
	Если ЭтотОбъект.Количество() > 0 Тогда
	//	ДобавитьОтложенныеДвижения(Регистратор);
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
	
	энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей, Замещение);

КонецПроцедуры

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДатаРегистратора 				= ДополнительныеСвойства.ДатаРегистратора;
	Иначе
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("Организация") Тогда
		Организация 					= ДополнительныеСвойства.Организация;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Организация") Тогда
		ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
	Иначе
		ДополнительныеСвойства.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("МКД") Тогда
		МКД 							= ДополнительныеСвойства.МКД;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"МКД") Тогда
		ДополнительныеСвойства.Вставить("МКД", Регистратор.МКД);
	Иначе
		ДополнительныеСвойства.Вставить("МКД", Справочники.энргСтроения.ПустаяСсылка());
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Район") Тогда
		Район 							= ДополнительныеСвойства.Район;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Район") Тогда
		ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
	Иначе
		ДополнительныеСвойства.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПериодНачисления") Тогда
		ПериодНачисления 							= ДополнительныеСвойства.ПериодНачисления;
		
	КонецЕсли;
	
	НаборыЗаписей  						= Новый Структура;
	
	НаборВзаиморасчеты 					= РегистрыНакопления.энргВзаиморасчеты.СоздатьНаборЗаписей();
	НаборВзаиморасчеты.Отбор.Регистратор.установить(Регистратор);
	НаборВзаиморасчеты.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);	
	НаборыЗаписей.Вставить("энргВзаиморасчеты", 		НаборВзаиморасчеты);
	
	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);

КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	НаборВзаиморасчеты =  ДополнительныеСвойства.НаборыЗаписей.энргВзаиморасчеты;
	
	НаборыЗаписей 											= ДополнительныеСвойства.НаборыЗаписей;
	  	
	
	Результат 												= ДанныеВзаиморасчеты(Регистратор);
	Выборка  												= Результат.Выбрать();
		
	Пока Выборка.Следующий() цикл
		
		Пока Выборка.Следующий()  цикл
			// Уменьшаем задолженность абонента.
			Запись  										= НаборВзаиморасчеты.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Запись,Выборка);
			Запись.ПериодНачисления 						= НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора); 						
			КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Функция ДанныеВзаиморасчеты(Регистратор)
	
	Регистратор 					= ЭтотОбъект.Отбор.Регистратор.Значение;
	Запрос 							= Новый Запрос;
	Набор =  ЭтотОбъект.Выгрузить();
	Набор.Свернуть("Абонент,Услуга,Поставщик", "СуммаЛьготы");
	Запрос.УстановитьПараметр("Набор", 			Набор);
	Запрос.УстановитьПараметр("Дата", 			ДополнительныеСвойства.ДатаРегистратора);
	Запрос.УстановитьПараметр("Организация", 	ДополнительныеСвойства.Организация);
	Запрос.УстановитьПараметр("МКД", 			ДополнительныеСвойства.МКД);
	Запрос.УстановитьПараметр("Район", 			ДополнительныеСвойства.Район);
	Запрос.Текст 					= 
	"ВЫБРАТЬ
	|	Набор.Абонент КАК Абонент,
	|	Набор.Услуга КАК Услуга,
	|	Набор.СуммаЛьготы КАК Сумма,
	|	Набор.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&Набор КАК Набор
	|ГДЕ
	|	Набор.СуммаЛьготы <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеОбъемНачислений.Абонент КАК Абонент,
	|	НачислениеОбъемНачислений.Услуга КАК Услуга,
	|	НачислениеОбъемНачислений.Сумма КАК Сумма,
	|	&Организация КАК Организация,
	|	&Дата КАК Период,
	|	&МКД КАК МКД,
	|	&Район КАК Район,
	|	НачислениеОбъемНачислений.Поставщик КАК Поставщик
	|ИЗ
	|	ОбъемНачислений КАК НачислениеОбъемНачислений"; 	
	Результат 						= Запрос.Выполнить();
	Возврат  Результат;
КонецФункции
