#Область ПрограммныйИнтерфейс

// Перед записью.
//
// Параметры:
//  Отказ	-	Булево.
//  Форма	-	ФормаКлиентскогоПриложения.
//
Процедура ПередЗаписью(Отказ, Форма) Экспорт
	Если НЕ ТаблицаФайлСУказаниемТипаСуществует(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	ТипВладельцаФайла 	= ТипЗнч(Форма.Объект.Ссылка);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ВидОперации") Тогда
		ВидОперации = Форма.Объект.ВидОперации;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Этап") Тогда
		ВидОперации = Форма.Объект.Этап;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ТипСобытия") Тогда
		ВидОперации = Форма.Объект.ТипСобытия;
	Иначе 
		ВидОперации = Неопределено;
	КонецЕсли;
	
	ПроверитьОбязательныеФайлы(Отказ, ТипВладельцаФайла, ВидОперации, Форма);	
КонецПроцедуры

// После записи.
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения.
//
Процедура ПослеЗаписи(Форма) Экспорт
	Если НЕ ТаблицаФайлСУказаниемТипаСуществует(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	ПрикрепитьФайлыКВладельцу(Форма);	
КонецПроцедуры

// Открывает форму прикрепления файлов.
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения.
//
Процедура ОткрытьФормуПрикрепленияФайлов(Форма) Экспорт
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФайлыСУказаниемТипа") Тогда
		Возврат;
	КонецЕсли;  	
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПрикрепленияФайловЗавершение", энргРаботаСПрикрепленнымиФайламиКлиент, Новый Структура("Форма", Форма)); 
	ДанныеДляЗаполнения 		= Новый Структура("ТаблицаСДанными", ПолучитьФайлыСУказаниемТипа(Форма));
	ДанныеДляЗаполнения.Вставить("ВладелецФайлов", Форма.Параметры.Ключ);
	ОткрытьФорму("ОбщаяФорма.энргПрисоединитьФайлыСУказаниемТипа", ДанныеДляЗаполнения,,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет действия после прикрепления файла к владельцу.
//
// Параметры:
//  Результат				-	Структура.
//  ДополнительныеПараметры	-	Структура.
//
Процедура ПрикрепитьФайлКВладельцуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка	
		ДополнительныеПараметры.Файл = Результат.ФайлСсылка;
	    энргРаботаСПрикрепленнымиФайламиСервер.ЗарегистрироватьСведенияОФайле(ДополнительныеПараметры);
	Исключение
	
	КонецПопытки;		
КонецПроцедуры

#Область РаботаСФормой

// Возвращает разрешено ли использование прикрепления файла с указанием типа.
// 
// Возвращаемое значение:
//   Булево	-	значение функциональной опции энргИспользоватьПрикреплениеФайловСУказаниемТипа.
//
Функция ИспользованиеПрикрепленияФайлаСУказаниемТипаРазрешено() Экспорт 
	Возврат энргРаботаСПрикрепленнымиФайламиСервер.ИспользованиеПрикрепленияФайлаСУказаниемТипаРазрешено();
КонецФункции

// Возвращает существует ли таблица файл с указанием типа.
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ТаблицаФайлСУказаниемТипаСуществует(Форма) Экспорт 
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФайлыСУказаниемТипа");
КонецФункции

// Выполняет действия после прикрепления файлов.
//
// Параметры:
//  Результат				-	ТаблицаЗначений.
//  ДополнительныеПараметры	-	Структура.
//
Процедура ПрикрепленияФайловЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайлыСУказаниемТипа = ДополнительныеПараметры.Форма.ФайлыСУказаниемТипа; 
	ФайлыСУказаниемТипа.Очистить();
	ОбщегоНазначенияКлиентСервер.ЗаполнитьКоллекциюСвойств(Результат, ФайлыСУказаниемТипа);	
КонецПроцедуры

// Получает файлы с указанием типа.
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения.
// 
// Возвращаемое значение:
//   Массив из Струкутура.
//
Функция ПолучитьФайлыСУказаниемТипа(Форма) Экспорт
	// Получаем описание колонок для формирования массива
	ОписаниеТаблицы = энргРаботаСПрикрепленнымиФайламиСервер.ПолучитьОписаниеТаблицыСПрикрепленнымиФайлами();
	ОписаниеСтроки 	= "";
	Для Каждого ТекКолонка из ОписаниеТаблицы Цикл
		ОписаниеСтроки = ОписаниеСтроки + ТекКолонка.Имя + ",";
	КонецЦикла;
	ОписаниеСтроки 	= Лев(ОписаниеСтроки, СтрДлина(ОписаниеСтроки) - 1);
	
	// Заполняем данные
	МассивДанных 		= Новый Массив; 
	ФайлыСУказаниемТипа = Форма.ФайлыСУказаниемТипа;
	Для Каждого ТекСтрока из ФайлыСУказаниемТипа Цикл
		НСтрока = Новый Структура(ОписаниеСтроки);
		ЗаполнитьЗначенияСвойств(НСтрока,ТекСтрока);
		МассивДанных.Добавить(НСтрока); 
	КонецЦикла;	
	
	Возврат МассивДанных;	
КонецФункции

// Получает структуру вида операции.
//
// Параметры:
//  ВладелецФайла	-	ФормаКлиентскогоПриложения.
// 
// Возвращаемое значение:
//   Структура	-	см. энргРаботаСПрикрепленнымиФайламиСервер.ПолучитьСтруктуруВидаОперации.
//
Функция ПолучитьСтруктуруВидаОперации(ВладелецФайла) Экспорт
	Возврат энргРаботаСПрикрепленнымиФайламиСервер.ПолучитьСтруктуруВидаОперации(ВладелецФайла);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Прикрепляем файл к владельцу
Процедура ПрикрепитьФайлыКВладельцу(Форма)
	ФайлыСУказаниемТипа = Форма.ФайлыСУказаниемТипа;	
	Для Каждого ТекСтрока из ФайлыСУказаниемТипа Цикл
		Если ПустаяСтрока(ТекСтрока.ПутьКФайлу) Тогда 
			Продолжить;
		КонецЕсли;     		
		
		ДополнительныеПараметры = Новый Структура("Файл,ТипФайла,Номер,Дата");
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ТекСтрока);
		
		ОбработчикРезультата = Новый ОписаниеОповещения("ПрикрепитьФайлКВладельцуЗавершение", энргРаботаСПрикрепленнымиФайламиКлиент, ДополнительныеПараметры);
		энргОбщегоНазначенияКлиент.ДобавитьИзФайловойСистемы(ОбработчикРезультата, Форма.Объект.Ссылка, Форма, ТекСтрока.ПутьКФайлу);
	КонецЦикла;
	
	ФайлыСУказаниемТипа.Очистить();		
КонецПроцедуры

Процедура ПроверитьОбязательныеФайлы(Отказ, ТипВладельцаФайла, ВидОперации, Форма)
	МассивВыбранныхТипов 	= Новый Массив;	
	ФайлыСУказаниемТипа 	= Форма.ФайлыСУказаниемТипа;
	Для Каждого ТекСтрока из ФайлыСУказаниемТипа Цикл
		МассивВыбранныхТипов.Добавить(ТекСтрока.ТипФайла);
	КонецЦикла;
	
	Результат = энргРаботаСПрикрепленнымиФайламиСервер.ПроверитьОбязательныеФайлы(Форма.Объект.Ссылка, ТипВладельцаФайла, ВидОперации, МассивВыбранныхТипов);
	Если НЕ ПустаяСтрока(Результат) Тогда 
		Отказ = Истина;
		ПоказатьПредупреждение(, "Не указаны обязательные типы файлов: " + Результат,, "Обязательные файлы");
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти