 
#Область ПрограммныйИнтерфейс
// Функция - Описание документа начисления
//
// Параметры:
//	 ИмяДокумента - Строка
//
// Возвращаемое значение:
//	 Описание
//
Функция ОписаниеДокументаНачисления(ИмяДокумента) Экспорт 
	
	Описание 			= Новый Структура;
	
	МетаданныеДокумета  = Метаданные.Документы[ИмяДокумента];
	
	для Каждого Реквизит из МетаданныеДокумета.Реквизиты цикл
		Описание.Вставить(Реквизит.имя);
	КонецЦикла;
	
	ТаблицаТЧ 			= Новый ТаблицаЗначений;
	
	Для Каждого РеквизитТЧ из Метаданные.РегистрыНакопления.бестОбъемНачисленийНП.Измерения цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);		
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из Метаданные.РегистрыНакопления.бестОбъемНачисленийНП.Ресурсы цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из Метаданные.РегистрыНакопления.бестОбъемНачисленийНП.Реквизиты цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	
	Описание.Вставить("ОбъемНачисленийНП",ТаблицаТЧ);
	Возврат Описание;	
КонецФункции

// Функция - Описание таблицы объемов
//
// Параметры:
//	 ИмяРегистра - Строка
//
// Возвращаемое значение:
//	 Структура
//
Функция ОписаниеТаблицыОбъемов(ИмяРегистра) Экспорт 
		
	ТаблицаТЧ 			= Новый ТаблицаЗначений;
	
	ОбъектМетаданных 	= Метаданные.РегистрыНакопления.Найти(ИмяРегистра);
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.РегистрыСведений.Найти(ИмяРегистра);		
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат ТаблицаТЧ;
	КонецЕсли;
		
	Для Каждого РеквизитТЧ из ОбъектМетаданных.Измерения цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);		
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из ОбъектМетаданных.Ресурсы цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	
	Для Каждого РеквизитТЧ из ОбъектМетаданных.Реквизиты цикл		
		ТаблицаТЧ.Колонки.Добавить(РеквизитТЧ.Имя,РеквизитТЧ.тип);				 
	КонецЦикла;
	
	Возврат ТаблицаТЧ;	
КонецФункции

// Функция - Измерения таблицы объемов
//
// Параметры:
//	 ИмяРегистра - Строка
//
// Возвращаемое значение:
//	 Структура
//
Функция ИзмеренияТаблицыОбъемов(ИмяРегистра) Экспорт 
		
	Описание 				= Новый Структура;
	Измерения 				= "";
	Ресурсы 				= "";
	Реквизиты 				= "";
	ОбъектМетаданных 		= Неопределено;
	
	ОбъектМетаданных 		= Метаданные.РегистрыНакопления.Найти(ИмяРегистра);
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных 	= Метаданные.РегистрыСведений.Найти(ИмяРегистра);		
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Новый Структура("Измерения,Ресурсы,Реквизиты",Измерения,Ресурсы,Реквизиты);
	КонецЕсли;
	
	Сч 						= 0;	
	Для Каждого Измерение из ОбъектМетаданных.Измерения цикл		
		Измерения 			= Измерения + ?(Сч> 0,",","") + Измерение.Имя;
		Сч 					= Сч + 1;
	КонецЦикла;
	
	Сч 						= 0;	
	Для Каждого Ресурс из ОбъектМетаданных.Ресурсы цикл		
		Ресурсы 			= Ресурсы + ?(Сч> 0,",","") + Ресурс.Имя;
		Сч 					= Сч + 1;
	КонецЦикла;
	
	Сч 						= 0;	
	Для Каждого Реквизит из ОбъектМетаданных.Реквизиты цикл		
		Реквизиты 			= Реквизиты + ?(Сч> 0,",","") + Реквизит.Имя;
		Сч 					= Сч + 1;
	КонецЦикла; 
	
	Возврат Новый Структура("Измерения,Ресурсы,Реквизиты",Измерения,Ресурсы,Реквизиты);	
КонецФункции

// Функция - Типы коэффициентов в формулах расчета
//
// Возвращаемое значение:
//	 ТипыКоэффициентов - Структура
//
Функция ТипыКоэффициентовВФормулахРасчета() Экспорт 
	ТипыКоэффициентов  = Новый Структура;
	//ТипыКоэффициентов.Вставить("РасчетныйНормативНаПодогрев",				"Расчетный норматив на подогрев");
	//ТипыКоэффициентов.Вставить("ТемпературныйКоэффициентПоВоздуху", 		"Температурный коэффициент по воздуху");
	//ТипыКоэффициентов.Вставить("ТемпературныйКоэффициентПоВоде",			"Температурный коэффициент по воде");
	ТипыКоэффициентов.Вставить("ПлотностьПодающейСетевойВоды",				"Плотность подающей сетевой воды");
	ТипыКоэффициентов.Вставить("ПлотностьОбратнойСетевойВоды",				"Плотность обратной сетевой воды");
	ТипыКоэффициентов.Вставить("ТемператураПодачи",							"Температура подачи");
	ТипыКоэффициентов.Вставить("ТемператураОбратнойСетевойВоды",			"Температура обратной сетевой воды");
	ТипыКоэффициентов.Вставить("ТемператураХолоднойВоды",					"Температура холодной воды");
	ТипыКоэффициентов.Вставить("КоличествоЧасовРаботыТУ",					"Кол-во часов работы ТУ");
	ТипыКоэффициентов.Вставить("КоличествоЧасовШтатнойРаботыПУ",			"Кол-во часов штатной работы ПУ");
	ТипыКоэффициентов.Вставить("Объем_ПоПриборуПред",						"Объем по ПУ (за предыдущий период)");
	ТипыКоэффициентов.Вставить("РасчетПоНормативу",							"Расчет по нормативу");
	ТипыКоэффициентов.Вставить("КолвоЧасовРаботыТУПред",					"Кол-во часов работы ТУ (за предыдущий период)");
	ТипыКоэффициентов.Вставить("КолвоЧасовШтатнойРаботыПУПред",				"Кол-во часов штатной работы ПУ (за предыдущий период)");
	Возврат ТипыКоэффициентов;
КонецФункции

// Функция - Получить ЦКДля расчета
// Получает массивы ЦК для расчетов
// 
// Возвращаемое значение:
//   Структура 
//
Функция ПолучитьЦКДляРасчета() Экспорт
	ЦКДляРасчетаПоПоказаниям = Новый Массив;
	ЦКДляРасчетаПоПоказаниям.Добавить(Перечисления.бестЦеновыеКатегории.ПустаяСсылка());
	ЦКДляРасчетаПоПоказаниям.Добавить(Перечисления.бестЦеновыеКатегории.ПерваяЦК);
	ЦКДляРасчетаПоПоказаниям.Добавить(Перечисления.бестЦеновыеКатегории.ВтораяЦК);
	
	ЦКДляРасчетаПоПочасовойВедомости = Новый Массив;
	ЦКДляРасчетаПоПочасовойВедомости.Добавить(Перечисления.бестЦеновыеКатегории.ТретьяЦК);
	ЦКДляРасчетаПоПочасовойВедомости.Добавить(Перечисления.бестЦеновыеКатегории.ЧетвертаяЦК);
	ЦКДляРасчетаПоПочасовойВедомости.Добавить(Перечисления.бестЦеновыеКатегории.ПятаяЦК);
	ЦКДляРасчетаПоПочасовойВедомости.Добавить(Перечисления.бестЦеновыеКатегории.ШестаяЦК);

	Возврат Новый Структура("ЦКДляРасчетаПоПоказаниям,ЦКДляРасчетаПоПочасовойВедомости", ЦКДляРасчетаПоПоказаниям, ЦКДляРасчетаПоПочасовойВедомости);
КонецФункции

#КонецОбласти