#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗадачиПринятыеВРаботуПоАбонентам(Период, Абоненты) Экспорт
	ИмяТаблицыЗадачПИД = "ЗадачиПИДАбонентов";
	
	Схема							= Неопределено;
	Параметры 						= Новый Структура;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыОтбора					= Новый Массив;
	
	ОтборПоАбоненту 		= энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("Абонент", 	"Абоненты"));
	ОтборПоЗадачамАбонента 	= энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица(ИмяТаблицыЗадачПИД, Новый Структура("Задача", "Задача"));
	ПараметрыВТ.Добавить(ОтборПоАбоненту);	
	ПараметрыВТ.Добавить(ОтборПоЗадачамАбонента);	
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	ОтборПоЗадачамАбонента 	= энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Статус", "ПринятоВРаботу"));
	ПараметрыОтбора.Добавить(ОтборПоЗадачамАбонента);	
	Параметры.Вставить("ПараметрыОтбора", ПараметрыОтбора); 		
	
	ПолучитьЗадачиПИД(Схема, Параметры, ИмяТаблицыЗадачПИД);
	РегистрыСведений.энргСтатусЗадачи.СтатусЗадач(Схема, Параметры, "ЗадачиПринятыеВРаботуАбонентов");
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ЗадачиПИДАбонентов.Задача КАК Задача,
		|	ЗадачиПИДАбонентов.Абонент КАК Абонент
		|ИЗ
		|	ЗадачиПИДАбонентов КАК ЗадачиПИДАбонентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадачиПринятыеВРаботуАбонентов КАК ЗадачиПринятыеВРаботуАбонентов
		|		ПО ЗадачиПИДАбонентов.Задача = ЗадачиПринятыеВРаботуАбонентов.Задача");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"			, Период);
	ПараметрыЗапроса.Вставить("Абоненты"		, Абоненты); 	
	ПараметрыЗапроса.Вставить("ПринятоВРаботу"	, Перечисления.энргСтатусыЗадач.ПринятаВРаботу);
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);;	
КонецФункции 

Функция ПодчинённыеЗадачи(Задача)
	Результат = Новый Массив;
	
	// Получаем подчиненные задачи
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|ГДЕ
		|	энргЗадачаПИД.Основание = &Задача
		|	И НЕ энргЗадачаПИД.ПометкаУдаления
		|	И энргЗадачаПИД.Ссылка <> &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;		
КонецФункции

Процедура ПолучитьСписокНижележащихЗадач(Задача, СпиокЗадач) Экспорт 

	ПодчинЗадачи = ПодчинённыеЗадачи(Задача);
	Для каждого СледЗадача Из ПодчинЗадачи Цикл
		ПолучитьСписокНижележащихЗадач(СледЗадача, СпиокЗадач);
		СпиокЗадач.Добавить(СледЗадача);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьЗадачуПоОснованию(Основание) Экспорт 
	Задача = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДЗадачиПоИсполнителю.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИДЗадачиПоИсполнителю
		|ГДЕ
		|	энргЗадачаПИДЗадачиПоИсполнителю.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Задача;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Задача = Выборка.Ссылка;
	
	Возврат Задача;

КонецФункции

Функция ПолучитьПараметрыФормыПеренаправления(Задача) Экспорт
	Результат = Новый Структура("ДатаСледующегоЭтапа, Комментарий, Пользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(энргЗадачаПИДИсторияПеренаправленийЗадачи.НомерСтроки) КАК НомерСтроки,
		|	энргЗадачаПИДИсторияПеренаправленийЗадачи.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СтрокаЗадачи
		|ИЗ
		|	Задача.энргЗадачаПИД.ИсторияПеренаправленийЗадачи КАК энргЗадачаПИДИсторияПеренаправленийЗадачи
		|ГДЕ
		|	энргЗадачаПИДИсторияПеренаправленийЗадачи.Ссылка = &Задача
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗадачаПИДИсторияПеренаправленийЗадачи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДИсторияПеренаправленийЗадачи.ПланируемаяДатаВыполнения КАК ДатаСледующегоЭтапа,
		|	энргЗадачаПИДИсторияПеренаправленийЗадачи.Комментарий КАК Комментарий,
		|	энргЗадачаПИДИсторияПеренаправленийЗадачи.НовыйИсполнитель КАК Пользователь
		|ИЗ
		|	ВТ_СтрокаЗадачи КАК ВТ_СтрокаЗадачи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.ИсторияПеренаправленийЗадачи КАК энргЗадачаПИДИсторияПеренаправленийЗадачи
		|		ПО ВТ_СтрокаЗадачи.Ссылка = энргЗадачаПИДИсторияПеренаправленийЗадачи.Ссылка
		|			И ВТ_СтрокаЗадачи.НомерСтроки = энргЗадачаПИДИсторияПеренаправленийЗадачи.НомерСтроки";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЦикла;

	Возврат Результат;
КонецФункции

Процедура ПодтвердитьПеренаправлениеЗадачи(Задача, ПарамПеренапр, ПодтвердитьПеренаправление = Ложь) Экспорт
	ОбъектЗадача = Задача.ПолучитьОбъект();
	
	Если ПодтвердитьПеренаправление И ЗначениеЗаполнено(ОбъектЗадача.ИсторияПеренаправленийЗадачи) Тогда
		СтрокаТЧ = ОбъектЗадача.ИсторияПеренаправленийЗадачи[ОбъектЗадача.ИсторияПеренаправленийЗадачи.Количество()-1];
	Иначе
		СтрокаТЧ = ОбъектЗадача.ИсторияПеренаправленийЗадачи.Добавить();
		
		СтрокаТЧ.ДатаПеренаправления = ТекущаяДатаСеанса();
		СтрокаТЧ.Роль				 = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЗадача.Этап, "Роль");
		СтрокаТЧ.Перенаправил		 = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПарамПеренапр);
	
	ОбъектЗадача.Роль					= СтрокаТЧ.Роль;
	ОбъектЗадача.ТребуетПодтверждения 	= Ложь;
	ОбъектЗадача.Исполнитель 			= ПарамПеренапр.НовыйИсполнитель;
	ОбъектЗадача.ПринятоВРаботу			= Ложь;
	ОбъектЗадача.ДатаПринятияВРаботу	= Неопределено;
	
	ОбъектЗадача.Комментарий = ПарамПеренапр.Комментарий;
	
	Если ЗначениеЗаполнено(ПарамПеренапр.ДатаСледЭтапа) Тогда
		ОбъектЗадача.ДатаСледЭтапа			= ПарамПеренапр.ДатаСледЭтапа;
		СтрокаТЧ.ПланируемаяДатаВыполнения	= ПарамПеренапр.ДатаСледЭтапа;
	КонецЕсли;
	
	ОбъектЗадача.Записать();
КонецПроцедуры

Функция ПолучитьСуммуПениЗадачи(Организация, Район, Договор, ДатаРасчетаПени, Задолженность, РасчетПени) Экспорт
	Если Не ЗначениеЗаполнено(Задолженность) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Парам_Задолженность.ПериодНачисления КАК ПериодНачисления,
		|	Парам_Задолженность.Услуга КАК Услуга,
		|	Парам_Задолженность.Задолженность КАК Задолженность
		|ПОМЕСТИТЬ ТЧ_Задолженность
		|ИЗ
		|	&Задолженность КАК Парам_Задолженность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(энргЗадачаПИДЗадолженность.Задолженность) КАК Задолженность,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_СуммаДолгов
		|ИЗ
		|	ТЧ_Задолженность КАК энргЗадачаПИДЗадолженность
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗадачаПИДЗадолженность.ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СуммаДолгов.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_СуммаДолгов.Задолженность КАК Задолженность,
		|	МАКСИМУМ(энргНастройкиНачисленияПени.Период) КАК Период_Отсрочка,
		|	ВТ_СуммаДолгов.Организация КАК Организация,
		|	ВТ_СуммаДолгов.Район КАК Район,
		|	ВТ_СуммаДолгов.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_Задолженность
		|ИЗ
		|	ВТ_СуммаДолгов КАК ВТ_СуммаДолгов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиНачисленияПени КАК энргНастройкиНачисленияПени
		|		ПО ВТ_СуммаДолгов.ПериодНачисления >= энргНастройкиНачисленияПени.Период
		|			И ВТ_СуммаДолгов.Организация = энргНастройкиНачисленияПени.Организация
		|			И ВТ_СуммаДолгов.Район = энргНастройкиНачисленияПени.Район
		|ГДЕ
		|	ВТ_СуммаДолгов.Договор = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СуммаДолгов.ПериодНачисления,
		|	ВТ_СуммаДолгов.Организация,
		|	ВТ_СуммаДолгов.Район,
		|	ВТ_СуммаДолгов.Задолженность,
		|	ВТ_СуммаДолгов.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задолженность.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_Задолженность.Задолженность КАК Задолженность,
		|	ВТ_Задолженность.Организация КАК Организация,
		|	ВТ_Задолженность.Район КАК Район,
		|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВТ_Задолженность.ПериодНачисления, МЕСЯЦ), СЕКУНДА, 3600 * 24 * ЕСТЬNULL(энргНастройкиНачисленияПени.КрайнийСрокОплаты - 1, 0)) КАК Граница
		|ПОМЕСТИТЬ ВТ_ЗадолженностьСГраницей
		|ИЗ
		|	ВТ_Задолженность КАК ВТ_Задолженность
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиНачисленияПени КАК энргНастройкиНачисленияПени
		|		ПО ВТ_Задолженность.Организация = энргНастройкиНачисленияПени.Организация
		|			И ВТ_Задолженность.Район = энргНастройкиНачисленияПени.Район
		|			И ВТ_Задолженность.Период_Отсрочка = энргНастройкиНачисленияПени.Период
		|ГДЕ
		|	ВТ_Задолженность.Договор = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ_ЗадолженностьСГраницей.Граница) КАК НачалоРасчета,
		|	&ТекущаяДата КАК КонецРасчета
		|ПОМЕСТИТЬ ВТ_ГраницыРасчета
		|ИЗ
		|	ВТ_ЗадолженностьСГраницей КАК ВТ_ЗадолженностьСГраницей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА энргСтавкиРефинансирования.Период > ВТ_ГраницыРасчета.НачалоРасчета
		|			ТОГДА энргСтавкиРефинансирования.Период
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК Период,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргСтавкиРефинансирования.Период <= ВТ_ГраницыРасчета.НачалоРасчета
		|				ТОГДА энргСтавкиРефинансирования.Период
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ) КАК ПериодНаНачало,
		|	ВТ_ГраницыРасчета.НачалоРасчета КАК НачалоРасчета
		|ПОМЕСТИТЬ ВТ_ПериодыСтавкиРефенансирования
		|ИЗ
		|	РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГраницыРасчета КАК ВТ_ГраницыРасчета
		|		ПО энргСтавкиРефинансирования.Период < ВТ_ГраницыРасчета.КонецРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА энргСтавкиРефинансирования.Период > ВТ_ГраницыРасчета.НачалоРасчета
		|			ТОГДА энргСтавкиРефинансирования.Период
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ВТ_ГраницыРасчета.НачалоРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСтавкиРефинансирования.Коэффициент КАК Коэффициент,
		|	ВТ_ПериодыСтавкиРефенансирования.НачалоРасчета КАК Период
		|ПОМЕСТИТЬ ВТ_ИзменениеСтавкиРефенансирования
		|ИЗ
		|	ВТ_ПериодыСтавкиРефенансирования КАК ВТ_ПериодыСтавкиРефенансирования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансирования
		|		ПО ВТ_ПериодыСтавкиРефенансирования.ПериодНаНачало = энргСтавкиРефинансирования.Период
		|ГДЕ
		|	ВТ_ПериодыСтавкиРефенансирования.Период = ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргСтавкиРефинансирования.Коэффициент,
		|	КОНЕЦПЕРИОДА(энргСтавкиРефинансирования.Период, ДЕНЬ)
		|ИЗ
		|	ВТ_ПериодыСтавкиРефенансирования КАК ВТ_ПериодыСтавкиРефенансирования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансирования
		|		ПО ВТ_ПериодыСтавкиРефенансирования.Период = энргСтавкиРефинансирования.Период
		|ГДЕ
		|	ВТ_ПериодыСтавкиРефенансирования.Период <> ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИзменениеСтавкиРефенансирования.Коэффициент КАК Коэффициент,
		|	ВТ_ИзменениеСтавкиРефенансирования.Период КАК ПериодОт,
		|	МИНИМУМ(ЕСТЬNULL(ВТ_ИзменениеСтавкиРефенансированияСлед.Период, &ТекущаяДата)) КАК ПериодДо
		|ПОМЕСТИТЬ ВТ_ПериодыДействияСтавРеф
		|ИЗ
		|	ВТ_ИзменениеСтавкиРефенансирования КАК ВТ_ИзменениеСтавкиРефенансирования
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзменениеСтавкиРефенансирования КАК ВТ_ИзменениеСтавкиРефенансированияСлед
		|		ПО ВТ_ИзменениеСтавкиРефенансирования.Период < ВТ_ИзменениеСтавкиРефенансированияСлед.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИзменениеСтавкиРефенансирования.Коэффициент,
		|	ВТ_ИзменениеСтавкиРефенансирования.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадолженностьСГраницей.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ЗадолженностьСГраницей.Задолженность КАК Задолженность,
		|	ВТ_ЗадолженностьСГраницей.Организация КАК Организация,
		|	ВТ_ЗадолженностьСГраницей.Район КАК Район,
		|	ВТ_ЗадолженностьСГраницей.Граница КАК Граница,
		|	ВЫБОР
		|		КОГДА ВТ_ПериодыДействияСтавРеф.ПериодОт < ВТ_ЗадолженностьСГраницей.Граница
		|			ТОГДА ВТ_ЗадолженностьСГраницей.Граница
		|		ИНАЧЕ ВТ_ПериодыДействияСтавРеф.ПериодОт
		|	КОНЕЦ КАК ПериодОт,
		|	ВТ_ПериодыДействияСтавРеф.ПериодДо КАК ПериодДо,
		|	ВТ_ПериодыДействияСтавРеф.Коэффициент КАК Коэффициент,
		|	РАЗНОСТЬДАТ(ВТ_ЗадолженностьСГраницей.Граница, ВЫБОР
		|			КОГДА ВТ_ПериодыДействияСтавРеф.ПериодОт < ВТ_ЗадолженностьСГраницей.Граница
		|				ТОГДА ВТ_ЗадолженностьСГраницей.Граница
		|			ИНАЧЕ ВТ_ПериодыДействияСтавРеф.ПериодОт
		|		КОНЕЦ, ДЕНЬ) КАК ПросрочкаОт,
		|	РАЗНОСТЬДАТ(ВТ_ЗадолженностьСГраницей.Граница, ВТ_ПериодыДействияСтавРеф.ПериодДо, ДЕНЬ) КАК ПросрочкаДо
		|ПОМЕСТИТЬ ВТ_ЗадолженностьСоСтавРеф
		|ИЗ
		|	ВТ_ЗадолженностьСГраницей КАК ВТ_ЗадолженностьСГраницей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыДействияСтавРеф КАК ВТ_ПериодыДействияСтавРеф
		|		ПО ВТ_ЗадолженностьСГраницей.Граница <= ВТ_ПериодыДействияСтавРеф.ПериодДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетПени.От > 0
		|			ТОГДА РасчетПени.От - 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК От,
		|	РасчетПени.До КАК До,
		|	РасчетПени.Числитель КАК Числитель,
		|	РасчетПени.Знаменатель КАК Знаменатель
		|ПОМЕСТИТЬ ВТ_НастройкаРасчетаПени
		|ИЗ
		|	&РасчетПени КАК РасчетПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадолженностьСоСтавРеф.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ЗадолженностьСоСтавРеф.Организация КАК Организация,
		|	ВТ_ЗадолженностьСоСтавРеф.Район КАК Район,
		|	ВТ_ЗадолженностьСоСтавРеф.Граница КАК Граница,
		|	ВТ_ЗадолженностьСоСтавРеф.ПериодОт КАК ПериодОт,
		|	ВТ_ЗадолженностьСоСтавРеф.ПериодДо КАК ПериодДо,
		|	ВТ_НастройкаРасчетаПени.От КАК От_Пеня,
		|	ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт КАК ПросрочкаОт,
		|	ВЫБОР
		|		КОГДА ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт < ВТ_НастройкаРасчетаПени.От
		|			ТОГДА ВТ_НастройкаРасчетаПени.От
		|		ИНАЧЕ ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт
		|	КОНЕЦ КАК От,
		|	ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо КАК ПросрочкаДо,
		|	ВЫБОР
		|		КОГДА ВТ_НастройкаРасчетаПени.До <> 9999
		|				И ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо > ВТ_НастройкаРасчетаПени.До
		|			ТОГДА ВТ_НастройкаРасчетаПени.До
		|		ИНАЧЕ ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо
		|	КОНЕЦ КАК До,
		|	ВТ_НастройкаРасчетаПени.До КАК До_Пеня,
		|	ВТ_ЗадолженностьСоСтавРеф.Задолженность КАК Задолженность,
		|	ВЫБОР
		|		КОГДА ВТ_НастройкаРасчетаПени.До <> 9999
		|				И ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо > ВТ_НастройкаРасчетаПени.До
		|			ТОГДА ВТ_НастройкаРасчетаПени.До
		|		ИНАЧЕ ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо
		|	КОНЕЦ - ВЫБОР
		|		КОГДА ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт < ВТ_НастройкаРасчетаПени.От
		|			ТОГДА ВТ_НастройкаРасчетаПени.От
		|		ИНАЧЕ ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт
		|	КОНЕЦ КАК КоличествоДней,
		|	ВТ_ЗадолженностьСоСтавРеф.Коэффициент КАК Коэффициент,
		|	ВТ_НастройкаРасчетаПени.Числитель КАК Числитель,
		|	ВТ_НастройкаРасчетаПени.Знаменатель КАК Знаменатель,
		|	ВЫБОР
		|		КОГДА ВТ_НастройкаРасчетаПени.Знаменатель = 0
		|			ТОГДА 0
		|		ИНАЧЕ (ВЫБОР
		|				КОГДА ВТ_НастройкаРасчетаПени.До <> 9999
		|						И ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо > ВТ_НастройкаРасчетаПени.До
		|					ТОГДА ВТ_НастройкаРасчетаПени.До
		|				ИНАЧЕ ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо
		|			КОНЕЦ - ВЫБОР
		|				КОГДА ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт < ВТ_НастройкаРасчетаПени.От
		|					ТОГДА ВТ_НастройкаРасчетаПени.От
		|				ИНАЧЕ ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт
		|			КОНЕЦ) * ВТ_ЗадолженностьСоСтавРеф.Задолженность * ВТ_ЗадолженностьСоСтавРеф.Коэффициент * ВТ_НастройкаРасчетаПени.Числитель / (100 * ВТ_НастройкаРасчетаПени.Знаменатель)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	ВТ_ЗадолженностьСоСтавРеф КАК ВТ_ЗадолженностьСоСтавРеф
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкаРасчетаПени КАК ВТ_НастройкаРасчетаПени
		|		ПО ВТ_ЗадолженностьСоСтавРеф.ПросрочкаДо >= ВТ_НастройкаРасчетаПени.От
		|			И (ВТ_НастройкаРасчетаПени.До = 9999
		|				ИЛИ ВТ_ЗадолженностьСоСтавРеф.ПросрочкаОт <= ВТ_НастройкаРасчетаПени.До)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодНачисления,
		|	ПросрочкаОт
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	ПериодНачисления";
	
	Запрос.УстановитьПараметр("Организация",  	Организация);
	Запрос.УстановитьПараметр("Район",  		Район);
	Запрос.УстановитьПараметр("ТекущаяДата",	КонецДня(ДатаРасчетаПени));
	Запрос.УстановитьПараметр("Задолженность",	Задолженность);
	Запрос.УстановитьПараметр("РасчетПени", 	РасчетПени);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтог.Следующий() И ЗначениеЗаполнено(ВыборкаИтог.Сумма) Тогда
	
		Возврат Окр(ВыборкаИтог.Сумма, 2, РежимОкругления.Окр15как20);
		
	Иначе
		
		Возврат 0;
	
	КонецЕсли;
КонецФункции

Функция ПолучитьЗадолженность(Задолженность, Параметры, ДляДерева = Истина) Экспорт

	Если Не ЗначениеЗаполнено(Задолженность) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос  = Новый Запрос;
	Договор = Неопределено;
	Если Параметры.Свойство("Договор", Договор) И ЗначениеЗаполнено(Договор) Тогда
		Запрос.УстановитьПараметр("Договор",	 Договор);
		
		ТекстЗапросаДолга = 
			"ВЫБРАТЬ // Замена
			|	бестВзаиморасчётыПоУслугамЮрЛицаОстатки.ПериодНачисления КАК ПериодНачисления,
			|	бестВзаиморасчётыПоУслугамЮрЛицаОстатки.Услуга КАК Услуга,
			|	0 КАК СуммаДо,
			|	бестВзаиморасчётыПоУслугамЮрЛицаОстатки.СуммаОстаток + бестВзаиморасчётыПоУслугамЮрЛицаОстатки.СуммаНДСОстаток КАК СуммаОстаток
			|ПОМЕСТИТЬ ВТ_Долги
			|ИЗ
			|	РегистрНакопления.бестВзаиморасчетыПоУслугамЮрЛица.Остатки(
			|			,
			|			Организация = &Организация
			|				И Район = &Район
			|				И Договор = &Договор
			|				И ПериодНачисления = &ПериодНачисления
			|				И Услуга = &Услуга) КАК бестВзаиморасчётыПоУслугамЮрЛицаОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ПериодНачисления,
			|	&Услуга,
			|	&СуммаДо,
			|	0";
	Иначе
		Запрос.УстановитьПараметр("МКД",		 Параметры.МКД);
		Запрос.УстановитьПараметр("Абонент",	 Параметры.Абонент);
		
		ТекстЗапросаДолга = 
			"ВЫБРАТЬ // Замена
			|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
			|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
			|	0 КАК СуммаДо,
			|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК СуммаОстаток
			|ПОМЕСТИТЬ ВТ_Долги
			|ИЗ
			|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
			|			,
			|			Организация = &Организация
			|				И Район = &Район
			|				//И МКД = &МКД
			|				И Абонент = &Абонент
			|				И ПериодНачисления = &ПериодНачисления
			|				И Услуга = &Услуга) КАК энргВзаиморасчетыПоМесяцамОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ПериодНачисления,
			|	&Услуга,
			|	&СуммаДо,
			|	0";
	КонецЕсли;
	
	
	Сч = 1;
	ТекстОбъединения = "";
	Для каждого Отбор Из Задолженность Цикл
		Постфикс = "_" + Формат(Сч, "ЧГ=0");
		
		ТекПодзапрос = СтрЗаменить(ТекстЗапросаДолга, "&ПериодНачисления", 	"&ПериодНачисления" + Постфикс);
		ТекПодзапрос = СтрЗаменить(ТекПодзапрос, 	  "&Услуга", 			"&Услуга" + Постфикс);
		ТекПодзапрос = СтрЗаменить(ТекПодзапрос, 	  "&СуммаДо", 			"&СуммаДо" + Постфикс);
		
		Запрос.УстановитьПараметр("ПериодНачисления" + Постфикс, Отбор.ПериодНачисления);
		Запрос.УстановитьПараметр("Услуга" + Постфикс, 			 Отбор.Услуга);
		ПредДолг	 = ?(Отбор.Свойство("СуммаДо"), Отбор.СуммаДо, 0);
		Запрос.УстановитьПараметр("СуммаДо" + Постфикс, 		 ПредДолг);
		
		ТекстОбъединения = ТекстОбъединения + ТекПодзапрос;
		
		Если Сч = 1 Тогда
			ТекстЗапросаДолга = СтрЗаменить(ТекстЗапросаДолга, "ВЫБРАТЬ // Замена", Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ");
			ТекстЗапросаДолга = СтрЗаменить(ТекстЗапросаДолга, "ПОМЕСТИТЬ ВТ_Долги", 	"");
			ТекстЗапросаДолга = СтрЗаменить(ТекстЗапросаДолга, "КАК ПериодНачисления", 	"");
			ТекстЗапросаДолга = СтрЗаменить(ТекстЗапросаДолга, "КАК Услуга", 			"");
			ТекстЗапросаДолга = СтрЗаменить(ТекстЗапросаДолга, "КАК СуммаОстаток", 		"");
		КонецЕсли;
		
		Сч = Сч + 1;
	КонецЦикла;
	
	Запрос.Текст = 
		ТекстОбъединения + Символы.ПС +
		"
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|" +
		" ВЫБРАТЬ
		|	ВТ_Долги.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_Долги.Услуга КАК Услуга,
		|	СУММА(ВТ_Долги.СуммаОстаток) КАК Задолженность,
		|	СУММА(ВТ_Долги.СуммаДо - ВТ_Долги.СуммаОстаток) КАК Оплата,
		|	СУММА(ВТ_Долги.СуммаДо) КАК СуммаДо
		|ИЗ
		|	ВТ_Долги КАК ВТ_Долги
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Долги.ПериодНачисления,
		|	ВТ_Долги.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодНачисления";
	Если ДляДерева Тогда 
		Запрос.Текст = Запрос.Текст + "
		|
		|ИТОГИ
		|	СУММА(Задолженность),
		|	СУММА(Оплата),
		|	СУММА(СуммаДо)
		|ПО
		|	ОБЩИЕ,
		|	ПериодНачисления";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Район",		 Параметры.Район);
	
	Возврат Запрос.Выполнить();
КонецФункции 

Функция ПолучитьСписокЖильцовЛС(Абонент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.ФизЛицо КАК ФизЛицо,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения,
		|	энргАбоненты.Организация КАК Организация,
		|	энргАбоненты.Район КАК Район
		|ПОМЕСТИТЬ ВТ_Абоненты
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	энргАбоненты.Ссылка = &Абонент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргПроживаниеЖильцовСрезПоследних.Жилец КАК Жилец
		|ПОМЕСТИТЬ ВТ_Жильцы
		|ИЗ
		|	РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
		|			,
		|			(Организация, Район, КлючПомещения) В
		|				(ВЫБРАТЬ
		|					ВТ_Абоненты.Организация КАК Организация,
		|					ВТ_Абоненты.Район КАК Район,
		|					ВТ_Абоненты.КлючПомещения КАК КлючПомещения
		|				ИЗ
		|					ВТ_Абоненты КАК ВТ_Абоненты)) КАК энргПроживаниеЖильцовСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Абоненты.ФизЛицо
		|ИЗ
		|	ВТ_Абоненты КАК ВТ_Абоненты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Жильцы.Жилец КАК Жилец
		|ИЗ
		|	ВТ_Жильцы КАК ВТ_Жильцы";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция ПолучитьГраницуПросрочки(Знач ТекДата, Знач Организация, Знач Район, Знач Абонент) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА энргАбоненты.КоличествоДнейОтсрочки > 0
		|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, -энргАбоненты.КоличествоДнейОтсрочки), МЕСЯЦ, -1), МЕСЯЦ)
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, -энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты), МЕСЯЦ, -1), МЕСЯЦ)
		|	КОНЕЦ КАК ГраницаНачислений
		|ИЗ
		|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Район = &Район) КАК энргНастройкиНачисленияПениСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО энргНастройкиНачисленияПениСрезПоследних.Организация = энргАбоненты.Организация
		|			И энргНастройкиНачисленияПениСрезПоследних.Район = энргАбоненты.Район
		|ГДЕ
		|	энргАбоненты.Ссылка = &Абонент";
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Район) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("Район", Район);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Абонент", Абонент);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ГраницаНачислений;
	Иначе	
		Возврат НачалоМесяца(ТекДата) - 1;
	КонецЕсли;
КонецФункции

Процедура ПрикрепитьФайлы(СтартоваяЗадача, СписокФайлов, Квитанция = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	энргЗадачаПИДПрисоединенныеФайлы.ПометкаУдаления КАК ПометкаУдаления,
		|	энргЗадачаПИДПрисоединенныеФайлы.Наименование КАК Наименование,
		|	энргЗадачаПИДПрисоединенныеФайлы.Расширение КАК Расширение,
		|	энргЗадачаПИДПрисоединенныеФайлы.ПериодНачисления КАК ПериодНачисления
		|ИЗ
		|	Справочник.энргЗадачаПИДПрисоединенныеФайлы КАК энргЗадачаПИДПрисоединенныеФайлы
		|ГДЕ
		|	энргЗадачаПИДПрисоединенныеФайлы.ВладелецФайла = &СтартоваяЗадача
		|	И энргЗадачаПИДПрисоединенныеФайлы.Квитанция = &Квитанция";
	
	Запрос.УстановитьПараметр("Квитанция", Квитанция);
	Запрос.УстановитьПараметр("СтартоваяЗадача", СтартоваяЗадача);
	
	СписокПрикрепленныхФайлов = Запрос.Выполнить().Выгрузить();

	Для каждого ПарамФайла Из СписокФайлов Цикл
	
		РасширениеФайла  = Справочники.энргКомментарииКСудебномуДелу.ПолучитьРасширениеФайла(ПарамФайла.Представление);
		ИмяБезРасширения = СтрЗаменить(ПарамФайла.Представление, "." + РасширениеФайла, "");
		
		ДатаМодификацииФайла		= ТекущаяДата();
		ПараметрыДобавляемогоФайла	= Новый Структура;
		ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов",	 			СтартоваяЗадача);
		ПараметрыДобавляемогоФайла.Вставить("Автор",						Строка(ПараметрыСеанса.ТекущийПользователь));
		ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения",				ИмяБезРасширения);
		ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки",			РасширениеФайла);
		ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения",				МестноеВремя(ДатаМодификацииФайла, ЧасовойПоясСеанса()));
		ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное",	ДатаМодификацииФайла);
		
		
		Если Квитанция Тогда
			Отбор = Новый Структура("ПериодНачисления", ПарамФайла.ПериодНачисления);
		Иначе
			Отбор = Новый Структура("Наименование, Расширение", ИмяБезРасширения, РасширениеФайла);
		КонецЕсли;
		
		СтрокиТЗ = СписокПрикрепленныхФайлов.НайтиСтроки(Отбор);
		
		ТекФайл = Неопределено;
		СнятьПометку = Ложь;
		Если ЗначениеЗаполнено(СтрокиТЗ) Тогда
			ТекФайл = СтрокиТЗ[0].Ссылка;
			ПараметрыДобавляемогоФайла.Вставить("АдресФайлаВоВременномХранилище", ПарамФайла.Значение); 
		 	РаботаСФайлами.ОбновитьФайл(ТекФайл, ПараметрыДобавляемогоФайла);
			СнятьПометку = СтрокиТЗ[0].ПометкаУдаления;
		Иначе
			ТекФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, 	ПарамФайла.Значение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекФайл) Тогда
			ТекФайлОбъект = ТекФайл.ПолучитьОбъект(); 
			Если СнятьПометку Тогда
				ТекФайлОбъект.УстановитьПометкуУдаления(Ложь);
			ИначеЕсли Квитанция Тогда
			
				ТекФайлОбъект.ПериодНачисления 	= ПарамФайла.ПериодНачисления;
				ТекФайлОбъект.Квитанция			= Истина;
				ТекФайлОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьЗадолженностьИОплаты(Задача, Перерасчет) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИД.Организация КАК Организация,
		|	энргЗадачаПИД.Район КАК Район,
		|	энргЗадачаПИД.МКД КАК МКД,
		|	энргЗадачаПИД.Абонент КАК Абонент,
		|	энргЗадачаПИДЗадолженность.Услуга КАК Услуга,
		|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления,
		|	энргЗадачаПИД.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ОтслеживаемаяЗадолженность
		|ИЗ
		|	Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО энргЗадачаПИДЗадолженность.Ссылка = энргЗадачаПИД.Ссылка
		|ГДЕ
		|	энргЗадачаПИД.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.МКД КАК МКД,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик,
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	0 КАК Пеня
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&ТекДата,
		|			(Организация, Район, Абонент, Услуга, ПериодНачисления) В
		|				(ВЫБРАТЬ
		|					ВТ_ОтслеживаемаяЗадолженность.Организация КАК Организация,
		|					ВТ_ОтслеживаемаяЗадолженность.Район КАК Район,
		//|					ВТ_ОтслеживаемаяЗадолженность.МКД КАК МКД,
		|					ВТ_ОтслеживаемаяЗадолженность.Абонент КАК Абонент,
		|					ВТ_ОтслеживаемаяЗадолженность.Услуга КАК Услуга,
		|					ВТ_ОтслеживаемаяЗадолженность.ПериодНачисления КАК ПериодНачисления
		|				ИЗ
		|					ВТ_ОтслеживаемаяЗадолженность КАК ВТ_ОтслеживаемаяЗадолженность)) КАК энргВзаиморасчетыПоМесяцамОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргОбъемыПениОбороты.Организация,
		|	энргОбъемыПениОбороты.Район,
		|	энргОбъемыПениОбороты.МКД,
		|	энргОбъемыПениОбороты.Абонент,
		|	энргОбъемыПениОбороты.Услуга,
		|	энргОбъемыПениОбороты.ПериодНачисления,
		|	NULL,
		|	0,
		|	энргОбъемыПениОбороты.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
		|			&ТекДата,
		|			(Организация, Район, МКД, Абонент, Услуга, ПериодНачисления) В
		|				(ВЫБРАТЬ
		|					ВТ_ОтслеживаемаяЗадолженность.Организация КАК Организация,
		|					ВТ_ОтслеживаемаяЗадолженность.Район КАК Район,
		|					ВТ_ОтслеживаемаяЗадолженность.МКД КАК МКД,
		|					ВТ_ОтслеживаемаяЗадолженность.Абонент КАК Абонент,
		|					ВТ_ОтслеживаемаяЗадолженность.Услуга КАК Услуга,
		|					ВТ_ОтслеживаемаяЗадолженность.ПериодНачисления КАК ПериодНачисления
		|				ИЗ
		|					ВТ_ОтслеживаемаяЗадолженность КАК ВТ_ОтслеживаемаяЗадолженность)) КАК энргОбъемыПениОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцам.Организация,
		|	энргВзаиморасчетыПоМесяцам.Район,
		|	энргВзаиморасчетыПоМесяцам.МКД,
		|	энргВзаиморасчетыПоМесяцам.Абонент,
		|	энргВзаиморасчетыПоМесяцам.Услуга,
		|	энргВзаиморасчетыПоМесяцам.ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцам.Поставщик,
		|	энргВзаиморасчетыПоМесяцам.Сумма,
		|	NULL
		|ИЗ
		|	ВТ_ОтслеживаемаяЗадолженность КАК ВТ_ОтслеживаемаяЗадолженность
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
		|		ПО ВТ_ОтслеживаемаяЗадолженность.Организация = энргВзаиморасчетыПоМесяцам.Организация
		|			И ВТ_ОтслеживаемаяЗадолженность.Район = энргВзаиморасчетыПоМесяцам.Район
		|			И ВТ_ОтслеживаемаяЗадолженность.МКД = энргВзаиморасчетыПоМесяцам.МКД
		|			И ВТ_ОтслеживаемаяЗадолженность.Абонент = энргВзаиморасчетыПоМесяцам.Абонент
		|			И ВТ_ОтслеживаемаяЗадолженность.Услуга = энргВзаиморасчетыПоМесяцам.Услуга
		|			И ВТ_ОтслеживаемаяЗадолженность.ПериодНачисления = энргВзаиморасчетыПоМесяцам.ПериодНачисления
		|ГДЕ
		|	энргВзаиморасчетыПоМесяцам.Регистратор = &Перерасчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоПени.Организация,
		|	энргВзаиморасчетыПоПени.Район,
		|	энргВзаиморасчетыПоПени.МКД,
		|	энргВзаиморасчетыПоПени.Абонент,
		|	энргВзаиморасчетыПоПени.Услуга,
		|	энргВзаиморасчетыПоПени.ПериодНачисления,
		|	NULL,
		|	NULL,
		|	энргВзаиморасчетыПоПени.Сумма
		|ИЗ
		|	ВТ_ОтслеживаемаяЗадолженность КАК ВТ_ОтслеживаемаяЗадолженность
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоПени КАК энргВзаиморасчетыПоПени
		|		ПО ВТ_ОтслеживаемаяЗадолженность.Организация = энргВзаиморасчетыПоПени.Организация
		|			И ВТ_ОтслеживаемаяЗадолженность.Район = энргВзаиморасчетыПоПени.Район
		|			И ВТ_ОтслеживаемаяЗадолженность.МКД = энргВзаиморасчетыПоПени.МКД
		|			И ВТ_ОтслеживаемаяЗадолженность.Абонент = энргВзаиморасчетыПоПени.Абонент
		|			И ВТ_ОтслеживаемаяЗадолженность.Услуга = энргВзаиморасчетыПоПени.Услуга
		|			И ВТ_ОтслеживаемаяЗадолженность.ПериодНачисления = энргВзаиморасчетыПоПени.ПериодНачисления
		|ГДЕ
		|	энргВзаиморасчетыПоПени.Регистратор = &Перерасчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцам.Регистратор КАК Регистратор,
		|	СУММА(энргВзаиморасчетыПоМесяцам.Сумма) КАК Сумма,
		|	ЛОЖЬ КАК Флаг,
		|	энргВзаиморасчетыПоМесяцам.Период КАК Дата,
		|	0 КАК Пеня
		|ПОМЕСТИТЬ ВТ_Оплаты
		|ИЗ
		|	ВТ_ОтслеживаемаяЗадолженность КАК ВТ_ОтслеживаемаяЗадолженность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
		|		ПО ВТ_ОтслеживаемаяЗадолженность.Организация = энргВзаиморасчетыПоМесяцам.Организация
		|			И ВТ_ОтслеживаемаяЗадолженность.Район = энргВзаиморасчетыПоМесяцам.Район
		|			И ВТ_ОтслеживаемаяЗадолженность.МКД = энргВзаиморасчетыПоМесяцам.МКД
		|			И ВТ_ОтслеживаемаяЗадолженность.Абонент = энргВзаиморасчетыПоМесяцам.Абонент
		|			И ВТ_ОтслеживаемаяЗадолженность.Услуга = энргВзаиморасчетыПоМесяцам.Услуга
		|			И ВТ_ОтслеживаемаяЗадолженность.ПериодНачисления = энргВзаиморасчетыПоМесяцам.ПериодНачисления
		|			И ВТ_ОтслеживаемаяЗадолженность.Дата < энргВзаиморасчетыПоМесяцам.Регистратор.Дата
		|ГДЕ
		|	энргВзаиморасчетыПоМесяцам.Регистратор.Дата <= &ТекДата
		|	И энргВзаиморасчетыПоМесяцам.Регистратор <> &Перерасчет
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцам.Регистратор,
		|	энргВзаиморасчетыПоМесяцам.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоПени.Регистратор,
		|	0,
		|	ЛОЖЬ,
		|	энргВзаиморасчетыПоПени.Период,
		|	энргВзаиморасчетыПоПени.Сумма
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоПени КАК энргВзаиморасчетыПоПени
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтслеживаемаяЗадолженность КАК ВТ_ОтслеживаемаяЗадолженность
		|		ПО энргВзаиморасчетыПоПени.Организация = ВТ_ОтслеживаемаяЗадолженность.Организация
		|			И энргВзаиморасчетыПоПени.Район = ВТ_ОтслеживаемаяЗадолженность.Район
		|			И энргВзаиморасчетыПоПени.ПериодНачисления = ВТ_ОтслеживаемаяЗадолженность.ПериодНачисления
		|			И энргВзаиморасчетыПоПени.МКД = ВТ_ОтслеживаемаяЗадолженность.МКД
		|			И энргВзаиморасчетыПоПени.Абонент = ВТ_ОтслеживаемаяЗадолженность.Абонент
		|			И энргВзаиморасчетыПоПени.Регистратор.Дата > ВТ_ОтслеживаемаяЗадолженность.Дата
		|ГДЕ
		|	энргВзаиморасчетыПоПени.Регистратор.Дата <= &ТекДата
		|	И энргВзаиморасчетыПоПени.Регистратор <> &Перерасчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.Организация КАК Организация,
		|	ВТ_Начисления.Район КАК Район,
		|	ВТ_Начисления.МКД КАК МКД,
		|	ВТ_Начисления.Абонент КАК Абонент,
		|	ВТ_Начисления.Услуга КАК Услуга,
		|	ВТ_Начисления.ПериодНачисления КАК ПериодНачисления,
		|	МАКСИМУМ(ВТ_Начисления.Поставщик) КАК Поставщик,
		|	СУММА(ВТ_Начисления.Пеня) КАК Пеня
		|ПОМЕСТИТЬ ВТ_ПеняПоставщиком
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Начисления.Организация,
		|	ВТ_Начисления.Район,
		|	ВТ_Начисления.МКД,
		|	ВТ_Начисления.Абонент,
		|	ВТ_Начисления.Услуга,
		|	ВТ_Начисления.ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.Организация КАК Организация,
		|	ВТ_Начисления.Район КАК Район,
		|	ВТ_Начисления.МКД КАК МКД,
		|	ВТ_Начисления.Абонент КАК Абонент,
		|	ВТ_Начисления.Услуга КАК Услуга,
		|	ВТ_Начисления.ПериодНачисления КАК ПериодНачисления,
		|	ЕСТЬNULL(ВТ_Начисления.Поставщик, ВТ_ПеняПоставщиком.Поставщик) КАК Поставщик,
		|	СУММА(ВТ_Начисления.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ВТ_Начисления.Пеня) КАК Пеня,
		|	0 КАК СуммаНДС
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПеняПоставщиком КАК ВТ_ПеняПоставщиком
		|		ПО ВТ_Начисления.Организация = ВТ_ПеняПоставщиком.Организация
		|			И ВТ_Начисления.Район = ВТ_ПеняПоставщиком.Район
		|			И ВТ_Начисления.МКД = ВТ_ПеняПоставщиком.МКД
		|			И ВТ_Начисления.Абонент = ВТ_ПеняПоставщиком.Абонент
		|			И ВТ_Начисления.Услуга = ВТ_ПеняПоставщиком.Услуга
		|			И ВТ_Начисления.ПериодНачисления = ВТ_ПеняПоставщиком.ПериодНачисления
		|			И (ВТ_Начисления.СуммаОстаток = 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Начисления.Организация,
		|	ВТ_Начисления.Район,
		|	ВТ_Начисления.МКД,
		|	ВТ_Начисления.Абонент,
		|	ВТ_Начисления.Услуга,
		|	ВТ_Начисления.ПериодНачисления,
		|	ЕСТЬNULL(ВТ_Начисления.Поставщик, ВТ_ПеняПоставщиком.Поставщик)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодНачисления,
		|	Услуга
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оплаты.Регистратор КАК Регистратор,
		|	СУММА(ВТ_Оплаты.Сумма) КАК Сумма,
		|	ВТ_Оплаты.Флаг КАК Флаг,
		|	ВТ_Оплаты.Дата КАК Дата,
		|	СУММА(ВТ_Оплаты.Пеня) КАК Пеня
		|ИЗ
		|	ВТ_Оплаты КАК ВТ_Оплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Оплаты.Регистратор,
		|	ВТ_Оплаты.Флаг,
		|	ВТ_Оплаты.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Задача);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Перерасчет", Перерасчет);
	
	Возврат Запрос.ВыполнитьПакет();
КонецФункции

Функция ПолучитьЗадолженностьДляПерерасчета(ТекДата, Организация, Район, Строение, Абонент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
			|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
			|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
			|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик,
			|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК Долг,
			|	0 КАК Пеня
			|ПОМЕСТИТЬ ВТ_Задолженность
			|ИЗ
			|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
			|			&ТекДата,
			|			Организация = &Организация
			|				И Район = &Район
			|				И МКД = &МКД
			|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоМесяцамОстатки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	энргВзаиморасчетыПоПениОстатки.Абонент,
			|	NULL,
			|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления,
			|	NULL,
			|	0,
			|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток
			|ИЗ
			|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
			|			&ТекДата,
			|			Организация = &Организация
			|				И Район = &Район
			|				И МКД = &МКД
			|				И Абонент = &Абонент) КАК энргВзаиморасчетыПоПениОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Задолженность.Абонент КАК Абонент,
			|	ВТ_Задолженность.Услуга КАК Услуга,
			|	ВТ_Задолженность.ПериодНачисления КАК ПериодНачисления,
			|	ВТ_Задолженность.Поставщик КАК Поставщик,
			|	СУММА(ВТ_Задолженность.Долг) КАК СуммаПерерасчет,
			|	СУММА(ВТ_Задолженность.Пеня) КАК Пеня
			|ИЗ
			|	ВТ_Задолженность КАК ВТ_Задолженность
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Задолженность.Абонент,
			|	ВТ_Задолженность.Услуга,
			|	ВТ_Задолженность.ПериодНачисления,
			|	ВТ_Задолженность.Поставщик";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("МКД", Строение);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ЗаполнитьНаименованиеИЭтап(Объект, ПредЭтап = Неопределено, ЭтапНовЗадачи = Неопределено) Экспорт 
	Перем Реквизит, СледЗадача;
	
	СтрукОчистки = Новый Структура("Наименование, ДатаСледЭтапа, Роль");
	ЗаполнитьЗначенияСвойств(Объект, СтрукОчистки);
	
	ДатаЗадачи = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	Если НЕ ЗначениеЗаполнено(Объект.Схема) Тогда
		Если Не ЗаполнитьСхемуОбъекта(ДатаЗадачи, Объект) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтапНовЗадачи = Неопределено Тогда
		Если ПредЭтап = Неопределено И Не ЗначениеЗаполнено(Объект.Основание) Тогда
			ПредЭтап = Справочники.энргВидыОперацийПИД.ПустаяСсылка();
			Если ЗначениеЗаполнено(Объект.Схема.Этапы) Тогда
				Объект.Этап = Объект.Схема.Этапы[0];
			КонецЕсли;
		КонецЕсли;
		Если ПредЭтап <> Неопределено Тогда
			Объект.Этап = Справочники.энргСхемыПИД.ПолучитьСледующийЭтап(Объект.Схема, ПредЭтап);
		КонецЕсли;	
	Иначе
		Объект.Этап = ЭтапНовЗадачи;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Этап) Тогда
		Возврат;
	КонецЕсли;
	Объект.Роль = Объект.Этап.Роль;
	
//подэтапы
	Если Объект.Этап.ЕстьПодэтапы Тогда
		
		РезультатЗапроса = ЗапросСроковПодэтапов(ДатаЗадачи, Объект);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Первая = Истина;
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = Объект.Подэтапы.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			СтрокаТЧ.IDЭтапа = Новый УникальныйИдентификатор;
			Если Первая Тогда
				СтрокаТЧ.Текущий	= Истина;
				СтрокаТЧ.ДатаНачала = ДатаЗадачи;
				Если ЗначениеЗаполнено(СтрокаТЧ.Продолжительность) Тогда
					СтрокаТЧ.ДатаОкончания = ДатаЗадачи + СтрокаТЧ.Продолжительность*24*3600;
				КонецЕсли;
			КонецЕсли;
			
			Первая = ?(СтрокаТЧ.Параллельно, Первая, Ложь);
		КонецЦикла;
	Иначе
		РезультатЗапроса = ЗапросСроковПодэтапов(ДатаЗадачи, Объект);
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Продолжительность) Тогда 
			Объект.ДатаСледЭтапа = ДатаЗадачи + 24 * 3600 * Выборка.Продолжительность;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ЗадачаЮЛ Тогда
		Если Объект.Этап.Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота Тогда
			Объект.Наименование = "Судебное дело по договору """ + Объект.Договор + """ под номером """ + Объект.НомерСудебногоДела;
		ИначеЕсли Объект.Этап.Тип = Перечисления.энргТипыЭтапов.Банкротство Тогда
			Объект.Наименование = "Дело о банкротстве по договору """ + Объект.Договор + """ на этапе """ + Объект.Этап;
		ИначеЕсли Объект.Этап.Тип = Перечисления.энргТипыЭтапов.СписаниеЗадолженности Тогда
			Объект.Наименование = "Дело о списании задолженности по договору """ + Объект.Договор + """ на этапе """ + Объект.Этап;
		Иначе
			Объект.Наименование = "Договор """ + Объект.Договор + """ на этапе """ + Объект.Этап;
		КонецЕсли;
	Иначе
		Если Объект.Этап.Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота Тогда
			Объект.Наименование = "Судебное дело по абоненту """ + Объект.Абонент + """ под номером """ + Объект.НомерСудебногоДела + """";
		Иначе
			Объект.Наименование = "Абонент """ + Объект.Абонент + """ на этапе """ + Объект.Этап + """";
		КонецЕсли;
	КонецЕсли;
	Объект.ДополнительныеСвойства.Вставить("НеМояЗадача", Истина);
КонецПроцедуры

Функция СоздатьПодчиненнуюЗадачу(Отказ, Знач СледЭтап, Знач ОбъектЗадача, Знач ПарамСудебнойРаботы = Неопределено, Знач Задолженность = Неопределено, Знач ЗначРеквизитов = Неопределено, ПропуститьПроверкуНаДублирование = Ложь) Экспорт
	
	Перем Реквизит, СледЗадача;
	
	ЭтоСтрук  	  = ТипЗнч(ОбъектЗадача) = Тип("Структура");
	МетаРеквизиты = Метаданные.Задачи.энргЗадачаПИД.Реквизиты;
	МетаТаблицы	  = Метаданные.Задачи.энргЗадачаПИД.ТабличныеЧасти;
	
	// Добавлено для возврата!-->
	ЕстьСледЗадача = Ложь;

	СледЗадачаПомеченная = ПолучитьЗадачуПоОснованию(ОбъектЗадача.Ссылка);
	Если не СледЗадачаПомеченная = Неопределено Тогда
		СледЗадача 					= СледЗадачаПомеченная.ПолучитьОбъект();
		СледЗадача.ПометкаУдаления 	= Ложь;
		СледЗадача.Исполнитель		= Неопределено;
		
		ЕстьСледЗадача				= Истина;
		
		Для каждого ТабличнаяЧасть Из МетаТаблицы Цикл
			СледЗадача[ТабличнаяЧасть.Имя].Очистить();
		КонецЦикла;
	Иначе
		СледЗадача = Задачи.энргЗадачаПИД.СоздатьЗадачу();
	КонецЕсли;
	
	СледЗадача.ДополнительныеСвойства.Вставить("ПропуститьПроверкуНаДублирование", ПропуститьПроверкуНаДублирование);
	// <--Добавлено для возврата!
		
	Для каждого Реквизит Из МетаРеквизиты Цикл
		Если ЭтоСтрук Тогда
			ОбъектЗадача.Свойство(Реквизит.Имя, СледЗадача[Реквизит.Имя]);
		Иначе
			СледЗадача[Реквизит.Имя] = ОбъектЗадача[Реквизит.Имя]
		КонецЕсли;
	КонецЦикла;
 	СледЗадача.Основание 			= ОбъектЗадача.Ссылка;
	СледЗадача.Этап		 			= СледЭтап;
	СледЗадача.ПринятоВРаботу 		= Ложь;
	СледЗадача.Комментарий 			= "";
	СледЗадача.ТребуетПодтверждения = Ложь;
	СледЗадача.Перерасчет			= Неопределено;
	
	СледЗадача.Дата		 = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ЗначРеквизитов) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СледЗадача, ЗначРеквизитов);
	КонецЕсли;
	
	СледЗадача.ДополнительныеСвойства.Вставить("НеМояЗадача", Истина);
	
	ЗаполнитьНаименованиеИЭтап(СледЗадача,, СледЭтап);
	
	// Перенос задолженности
	СписокДолгов = ?(Задолженность = Неопределено, ОбъектЗадача.Задолженность, Задолженность);

	СледЗадача.Задолженность.Очистить();
	Для каждого СтрокаДолг Из СписокДолгов Цикл
		СтрокаТЧ = СледЗадача.Задолженность.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаДолг);
	КонецЦикла;
	
	Если СледЭтап.Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота Тогда
		СледЗадача.СтатусСудебногоДела = Справочники.энргСтатусыДелСудебнойРаботы.НаРассмотрении;
	КонецЕсли;

	Начисления = Новый Структура("Начисления");
	ЗаполнитьЗначенияСвойств(Начисления, ОбъектЗадача);
	Начисления = Начисления.Начисления;
	Если Начисления <> Неопределено Тогда
		Для каждого ТекРегистратор Из Начисления Цикл
			Если ТипЗнч(Начисления) = Тип("ЗадачаТабличнаяЧасть.энргЗадачаПИД.Начисления") Тогда
				СтрокаТЧ = СледЗадача.Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекРегистратор);
			Иначе
				СтрокаТЧ = СледЗадача.Начисления.Добавить();
				СтрокаТЧ.Регистратор = ТекРегистратор;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Если ПарамСудебнойРаботы <> Неопределено Тогда
	    ЗаполнитьЗначенияСвойств(СледЗадача, ПарамСудебнойРаботы);
		
		Регистраторы = Неопределено;
		Если ПарамСудебнойРаботы.Свойство("Регистраторы", Регистраторы) Тогда
			СледЗадача.Начисления.Очистить();
			Для каждого ТекРегистратор Из Регистраторы Цикл
				Если ЗначениеЗаполнено(ТекРегистратор.Регистратор) Тогда
					СтрокаТЧ = СледЗадача.Начисления.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекРегистратор); 
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	СледЗадача.ТаблицаРасчётаПени.Очистить();
	Если СледЭтап.Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота ИЛИ СледЭтап.Тип = Перечисления.энргТипыЭтапов.ИсполнительнаяРабота Тогда
		ПарамПени = Новый Структура("ТаблицаРасчётаПени", Неопределено);
		ЗаполнитьЗначенияСвойств(ПарамПени, ОбъектЗадача);
		
		Если ЗначениеЗаполнено(ПарамПени.ТаблицаРасчётаПени) Тогда
			
			Для каждого СтрокаТЗ Из ПарамПени.ТаблицаРасчётаПени Цикл
				СтрокаТЧ = СледЗадача.ТаблицаРасчётаПени.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
			КонецЦикла;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	энргНастройкаРасчетаПениСрезПоследних.Организация КАК Организация,
				|	энргНастройкаРасчетаПениСрезПоследних.НастройкаРасчета КАК НастройкаРасчета
				|ИЗ
				|	РегистрСведений.энргНастройкаРасчетаПени.СрезПоследних(&ТекДата, Организация = &Организация) КАК энргНастройкаРасчетаПениСрезПоследних";
			
			Запрос.УстановитьПараметр("Организация", СледЗадача.Организация);
			Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				ТаблицаРасчётаПени = Выборка.НастройкаРасчета.Получить();
				
				Для каждого СтрокаТЗ Из ТаблицаРасчётаПени Цикл
				
					СтрокаТЧ = СледЗадача.ТаблицаРасчётаПени.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
				
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СледЗадача.ТаблицаРасчётаПени.Сортировать("От");	
	
	Для каждого СтрокаТЗ Из ОбъектЗадача.СудебныеИнстанции Цикл
		СтрокаТЧ = СледЗадача.СудебныеИнстанции.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
	КонецЦикла;
	
	Для каждого СтрокаТЗ Из ОбъектЗадача.Суд Цикл
		СтрокаТЧ = СледЗадача.Суд.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
	КонецЦикла;

	Попытка
		СледЗадача.Записать();		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Отказ = Истина;
		Возврат Неопределено;
	КонецПопытки;
	
	// Отправка на почту если это судебное дело и повторная задача
	Если ЕстьСледЗадача и СледЭтап.Тип = Перечисления.энргТипыЭтапов.СудебнаяРабота Тогда
		Результат 	= РегистрыСведений.энргНастройкиЮрОтдела.ПолучитьНачальника(СледЗадача.Организация,СледЗадача.Район);
		Выборка 	= Результат.Выбрать();
		
		Запрос = новый Запрос;
		Запрос.Текст =" 
			|ВЫБРАТЬ
			|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Отправитель
			|ИЗ
			|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
			|ГДЕ
			|	УчетныеЗаписиЭлектроннойПочты.Ссылка = ЗНАЧЕНИЕ(Справочник.УчетныеЗАписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты)";
		РезультатОтправитель = Запрос.Выполнить();
		ВыборкаОтправитель 	= РезультатОтправитель.Выбрать();
		ВыборкаОтправитель.следующий();
		Отправитель 		= ВыборкаОтправитель.Отправитель;
		Если не ЗначениеЗаполнено(Отправитель) Тогда
			ЗаписьЖурналаРегистрации("Уведомление пользователей юридического отдела",УровеньЖурналаРегистрации.Ошибка,,,"Не заполнена системная учетная запись.");
			Возврат Неопределено;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			Попытка 	
				
				Если не ЗначениеЗаполнено(СокрЛП(Выборка.Почта)) Тогда
					//ВызватьИсключение "Не указана почта у пользователя: " + Выборка.Начальник;
					Продолжить;
				КонецЕсли;
				
				Тело 				= "Сотрудник: " + ОбъектЗадача.Ссылка.Исполнитель + " передал юристу: " + СледЗадача.Исполнитель + " изменный пакет документов по абоненту: " + СокрЛП(СледЗадача.Абонент) + "(" + СокрЛП(СледЗадача.ЛицевойСчет) + ") в срок: " + Формат(СледЗадача.СрокВыполненияЗадачи,"ДФ=dd.MM.yyyy");
				ПараметрыОтправки 	= Новый Структура("Кому, Тема, Тело", Выборка.Почта, "Уведомление о возврате на доработку", Тело);
				
				РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Отправитель, ПараметрыОтправки);
				
				УровеньЖурнала 	 = УровеньЖурналаРегистрации.Информация;
				ТекстДляЖурнала  = "Успешно отправлено по начальнику: " + Выборка.Начальник;
				
			Исключение
				УровеньЖурнала 	 = УровеньЖурналаРегистрации.Ошибка;
				ТекстДляЖурнала  = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			КонецПопытки;
			
			ЗаписьЖурналаРегистрации("Уведомление пользователей юридического отдела",УровеньЖурнала,,,ТекстДляЖурнала);
		КонецЦикла;		
	КонецЕсли;
	
	Возврат СледЗадача.Ссылка;
	
КонецФункции

#Область ЗаполнениеПечатныхФорм

Функция ПечатьЗаявлениеОВынесенииСудебногоПриказа(Задача, СписокПрикреплённыхДокументов = Неопределено, СтруктураДолга = Неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Задача,
		|	энргЗадачаПИД.Абонент КАК Абонент,
		|	энргЗадачаПИДСудебныеИнстанции.СудебнаяИинстанция КАК Суд,
		|	Организации.Ссылка КАК Организация,
		|	Организации.НаименованиеПолное КАК НаименованиеПолноеОрганизация,
		|	энргАбоненты.ФизЛицо КАК ФизЛицо,
		|	энргЗадачаПИД.СуммаЗадолженности КАК СуммаЗадолженности,
		|	энргЗадачаПИД.ПериодЗадолженностиНачало КАК ПериодЗадолженностиНачало,
		|	энргЗадачаПИД.ПериодЗадолженностиКонец КАК ПериодЗадолженностиКонец,
		|	энргЗадачаПИД.Дата КАК Дата,
		|	энргЗадачаПИД.СтартоваяЗадача КАК СтартоваяЗадача,
		|	энргАбоненты.ВидОбъекта КАК ВидОбъекта,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения,
		|	энргАбонентыКонтактнаяИнформация.Представление КАК АдресОбъекта,
		|	энргЗадачаПИД.Район КАК Район
		|ПОМЕСТИТЬ ВТ_Задача
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.СудебныеИнстанции КАК энргЗадачаПИДСудебныеИнстанции
		|		ПО энргЗадачаПИД.Ссылка = энргЗадачаПИДСудебныеИнстанции.Ссылка
		|			И (энргЗадачаПИДСудебныеИнстанции.Текущая)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО энргЗадачаПИД.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|			ПО энргАбоненты.Ссылка = энргАбонентыКонтактнаяИнформация.Ссылка
		|				И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыконтактнойИнформации.АдресОбъекта))
		|		ПО энргЗадачаПИД.Абонент = энргАбоненты.Ссылка
		|ГДЕ
		|	энргЗадачаПИД.Ссылка = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Организация КАК Организация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресОрганизация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ТелефонОрганизация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ФаксОрганизация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресЭлектроннойПочтыОрганизация
		|ПОМЕСТИТЬ ВТ_ДанныеОрганизации
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО ВТ_Задача.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
		|			И (ОрганизацииКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Задача.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.ФизЛицо КАК ФизЛицо,
		|	энргКонтрагенты.бестФамилия КАК Фамилия,
		|	энргКонтрагенты.бестИмя КАК Имя,
		|	энргКонтрагенты.бестОтчество КАК Отчество,
		|	энргКонтрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	энргКонтрагенты.ИНН КАК ИНН,
		|	энргКонтрагенты.бестДатаРождения КАК ДатаРождения,
		|	энргКонтрагенты.МестоРождения КАК МестоРождения
		|ПОМЕСТИТЬ ВТ_ДанныеФизЛица
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|		ПО ВТ_Задача.ФизЛицо = энргКонтрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеФизЛица.ФизЛицо КАК ФизЛицо,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЮрАдресАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ФактАдресАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ТелефонАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ФаксАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЭлАдресАбонента
		|ПОМЕСТИТЬ ВТ_ДанныеКонтрагента
		|ИЗ
		|	ВТ_ДанныеФизЛица КАК ВТ_ДанныеФизЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
		|		ПО ВТ_ДанныеФизЛица.ФизЛицо = энргКонтрагентыКонтактнаяИнформация.Ссылка
		|			И (энргКонтрагентыКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеФизЛица.ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Контрагент КАК Абонент,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
		|				ТОГДА ДокументыФизическихЛицСрезПоследних.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Паспорт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СНИЛС)
		|				ТОГДА ДокументыФизическихЛицСрезПоследних.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК СНИЛС
		|ПОМЕСТИТЬ ВТ_ДокументыАбонента
		|ИЗ
		|	РегистрСведений.энргДокументыФизическихЛиц.СрезПоследних(
		|			&ТекДата,
		|			Контрагент В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.Абонент КАК Абонент
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)
		|				И ВидДокумента В (ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортСССР), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СНИЛС))) КАК ДокументыФизическихЛицСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыФизическихЛицСрезПоследних.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Ссылка,
		|	ВТ_Задача.Задача КАК ТекЗадача
		|ПОМЕСТИТЬ ВТ_ПредыдущиеЗадачи
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО ВТ_Задача.СтартоваяЗадача = энргЗадачаПИД.СтартоваяЗадача
		|			И ВТ_Задача.Дата >= энргЗадачаПИД.Дата
		|ГДЕ
		|	НЕ энргЗадачаПИД.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЧислитель) КАК ДоляСобственностиЧислитель,
		|	МАКСИМУМ(энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЗнаменатель) КАК ДоляСобственностиЗнаменатель,
		|	ВТ_Задача.Задача КАК Задача
		|ПОМЕСТИТЬ ВТ_Доля
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
		|				&ТекДата,
		|				(КлючПомещения, Жилец) В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.КлючПомещения КАК КлючПомещения,
		|						ВТ_Задача.ФизЛицо КАК ФизЛицо
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)) КАК энргПроживаниеЖильцовСрезПоследних
		|		ПО ВТ_Задача.КлючПомещения = энргПроживаниеЖильцовСрезПоследних.КлючПомещения
		|			И ВТ_Задача.ФизЛицо = энргПроживаниеЖильцовСрезПоследних.Жилец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Задача.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	СУММА(энргВзаиморасчетыПоПениОстатки.СуммаОстаток) КАК СуммаОстаток
		|ПОМЕСТИТЬ ВТ_Пеня
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
		|				,
		|				(Абонент, Организация) В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.Абонент КАК Абонент,
		|						ВТ_Задача.Организация КАК Организация
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)) КАК энргВзаиморасчетыПоПениОстатки
		|		ПО ВТ_Задача.Абонент = энргВзаиморасчетыПоПениОстатки.Абонент
		|			И ВТ_Задача.Организация = энргВзаиморасчетыПоПениОстатки.Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Задача.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргТипСобственностиАбонентовСрезПоследних.Организация КАК Организация,
		|	энргТипСобственностиАбонентовСрезПоследних.Район КАК Район,
		|	энргТипСобственностиАбонентовСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности КАК ТипСобственности,
		|	энргТипСобственностиАбонентовСрезПоследних.НомерДоговораСоцНайма КАК НомерДоговораСоцНайма,
		|	энргТипСобственностиАбонентовСрезПоследних.ДатаДоговораСоцНайма КАК ДатаДоговораСоцНайма
		|ПОМЕСТИТЬ ВТ_ТипСобственности
		|ИЗ
		|	РегистрСведений.энргТипСобственностиАбонентов.СрезПоследних(
		|			&ТекДата,
		|			(Организация, Район, КлючПомещения) В
		|				(ВЫБРАТЬ
		|					ВТ_Задача.Организация КАК Организация,
		|					ВТ_Задача.Район КАК Район,
		|					ВТ_Задача.КлючПомещения КАК КлючПомещения
		|				ИЗ
		|					ВТ_Задача КАК ВТ_Задача)) КАК энргТипСобственностиАбонентовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Задача КАК ВТ_Задача
		|		ПО энргТипСобственностиАбонентовСрезПоследних.Организация = ВТ_Задача.Организация
		|			И энргТипСобственностиАбонентовСрезПоследних.Район = ВТ_Задача.Район
		|			И энргТипСобственностиАбонентовСрезПоследних.КлючПомещения = ВТ_Задача.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	ВТ_Задача.Абонент КАК Абонент,
		|	ВТ_Задача.Суд КАК Суд,
		|	ВТ_Задача.Организация КАК Организация,
		|	ВТ_Задача.НаименованиеПолноеОрганизация КАК НаименованиеПолноеОрганизация,
		|	ВТ_Задача.ФизЛицо КАК ФизЛицо,
		|	ВТ_Задача.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ВТ_Задача.ПериодЗадолженностиНачало КАК ПериодЗадолженностиНачало,
		|	ВТ_Задача.ПериодЗадолженностиКонец КАК ПериодЗадолженностиКонец,
		|	ВТ_Задача.Дата КАК Дата,
		|	ВТ_Задача.СтартоваяЗадача КАК СтартоваяЗадача,
		|	ВТ_Задача.ВидОбъекта КАК ВидОбъекта,
		|	ВТ_Задача.КлючПомещения КАК КлючПомещения,
		|	ВТ_ДанныеФизЛица.Фамилия КАК Фамилия,
		|	ВТ_ДанныеФизЛица.Имя КАК Имя,
		|	ВТ_ДанныеФизЛица.Отчество КАК Отчество,
		|	ВТ_ДанныеФизЛица.НаименованиеПолное КАК НаименованиеПолное,
		|	ВТ_ДанныеФизЛица.ИНН КАК ИНН,
		|	ВТ_ДанныеФизЛица.ДатаРождения КАК ДатаРождения,
		|	ВТ_ДанныеФизЛица.МестоРождения КАК МестоРождения,
		|	ВТ_ДанныеОрганизации.АдресОрганизация КАК АдресОрганизация,
		|	ВТ_ДанныеОрганизации.ТелефонОрганизация КАК ТелефонОрганизация,
		|	ВТ_ДанныеОрганизации.ФаксОрганизация КАК ФаксОрганизация,
		|	ВТ_ДанныеОрганизации.АдресЭлектроннойПочтыОрганизация КАК АдресЭлектроннойПочтыОрганизация,
		|	ВТ_ДокументыАбонента.Паспорт КАК Паспорт,
		|	ВТ_ДокументыАбонента.СНИЛС КАК СНИЛС,
		|	ВТ_Доля.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	ВТ_Доля.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель,
		|	ВТ_ДанныеКонтрагента.ЮрАдресАбонента КАК ЮрАдресАбонента,
		|	ВТ_ДанныеКонтрагента.ФактАдресАбонента КАК ФактАдресАбонента,
		|	ВТ_ДанныеКонтрагента.ТелефонАбонента КАК ТелефонАбонента,
		|	ВТ_ДанныеКонтрагента.ФаксАбонента КАК ФаксАбонента,
		|	ВТ_ДанныеКонтрагента.ЭлАдресАбонента КАК ЭлАдресАбонента,
		|	ВТ_Задача.АдресОбъекта КАК АдресОбъекта,
		|	ВЫБОР
		|		КОГДА ВТ_Пеня.СуммаОстаток ЕСТЬ NULL
		|				ИЛИ ВТ_Пеня.СуммаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Пеня.СуммаОстаток
		|	КОНЕЦ КАК Пеня,
		|	ВТ_Задача.СуммаЗадолженности + ВЫБОР
		|		КОГДА ВТ_Пеня.СуммаОстаток ЕСТЬ NULL
		|				ИЛИ ВТ_Пеня.СуммаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Пеня.СуммаОстаток
		|	КОНЕЦ КАК ОбщаяСумма,
		|	ВТ_ТипСобственности.ТипСобственности КАК ТипСобственности,
		|	ВТ_ТипСобственности.НомерДоговораСоцНайма КАК НомерДоговораСоцНайма,
		|	ВТ_ТипСобственности.ДатаДоговораСоцНайма КАК ДатаДоговораСоцНайма,
		|	ВТ_Задача.Район КАК Район
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеФизЛица КАК ВТ_ДанныеФизЛица
		|		ПО ВТ_Задача.ФизЛицо = ВТ_ДанныеФизЛица.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОрганизации КАК ВТ_ДанныеОрганизации
		|		ПО ВТ_Задача.Организация = ВТ_ДанныеОрганизации.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыАбонента КАК ВТ_ДокументыАбонента
		|		ПО ВТ_Задача.Абонент = ВТ_ДокументыАбонента.Абонент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доля КАК ВТ_Доля
		|		ПО ВТ_Задача.Задача = ВТ_Доля.Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
		|		ПО ВТ_Задача.ФизЛицо = ВТ_ДанныеКонтрагента.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Пеня КАК ВТ_Пеня
		|		ПО ВТ_Задача.Задача = ВТ_Пеня.Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТипСобственности КАК ВТ_ТипСобственности
		|		ПО ВТ_Задача.Организация = ВТ_ТипСобственности.Организация
		|			И ВТ_Задача.Район = ВТ_ТипСобственности.Район
		|			И ВТ_Задача.КлючПомещения = ВТ_ТипСобственности.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСобытие.Номер КАК Номер,
		|	энргСобытие.Дата КАК Дата,
		|	энргСобытиеАбоненты.Успех КАК Успех,
		|	ВТ_ПредыдущиеЗадачи.ТекЗадача КАК ТекЗадача
		|ИЗ
		|	Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСобытие КАК энргСобытие
		|		ПО энргСобытиеАбоненты.Ссылка = энргСобытие.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПредыдущиеЗадачи КАК ВТ_ПредыдущиеЗадачи
		|		ПО энргСобытиеАбоненты.Основание = ВТ_ПредыдущиеЗадачи.Ссылка
		|ГДЕ
		|	энргСобытиеАбоненты.Успех";
	
	Если СтруктураДолга = Неопределено Тогда
		СтруктураДолга = Новый Структура;
	КонецЕсли;
	ТекДата = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Задача", Задача);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КолПакет		 = РезультатЗапроса.Количество();
	Макет			 = ПолучитьМакет("МакетЗаявлениеОВынесенииСудебногоПриказа");
	
	ОбластьШапка	 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСередина	 		= Макет.ПолучитьОбласть("Середина");
	ОбластьПриложениеШапка	= Макет.ПолучитьОбласть("ПриложениеШапка");
	ОбластьПриложениеСтрока	= Макет.ПолучитьОбласть("ПриложениеСтрока");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	
	Выборка				= РезультатЗапроса[КолПакет-2].Выбрать();
	ВыборкаПредписания	= РезультатЗапроса[КолПакет-1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьПринадлежностьДоля = Макет.ПолучитьОбласть("ПринадлежностьДоля");
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.АвтоМасштаб = Истина;
		
		ВыводШапкиФилиала(ТабДок, Выборка.Район, ОбластьШапка);
		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		
		ПараметрыШапки = Новый Структура;

		АдресОрганизации = "";
		Префикс			 = "";
		АбонентФИО		 = "";
		АбонентФИОКраткое = "";
		АдресАбонента	 = "";
		АбонентПаспортныеДанные = "";
		ДоляАбонента = "";
		Предписания = "";
		НачалоЗадолженности = "";
		КонецЗадолженности = "";
		ОбщаяСуммаПрописью = "";
		СуммаЗадолженностиПрописью = "";
		СуммаПениПрописью = "";
		ТипСобственника = "";
		ДатаДоговораСоцНайма = "";
		СуммаОсновногоДолга = Неопределено;
		Пеня = Неопределено;
		
		Если ЗначениеЗаполнено(Выборка.ДатаДоговораСоцНайма) Тогда
			ДатаДоговораСоцНайма = Формат(Выборка.ДатаДоговораСоцНайма, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		ПараметрыШапки.Вставить("ДатаДоговораСоцНайма", ДатаДоговораСоцНайма);
		
		// Тип собственности
		Если ЗначениеЗаполнено(Выборка.ТипСобственности) Тогда
			Если Выборка.ТипСобственности = Перечисления.энргТипыСобственниковЖилья.МуниципальнаяСобственность
					Или Выборка.ТипСобственности = Перечисления.энргТипыСобственниковЖилья.ФедеральнаяСобственность Тогда
				ТипСобственника = "нанимателя жилого помещения";
				ОбластьПринадлежностьДоля = Макет.ПолучитьОбласть("ПринадлежностьДоговорСоцНайма");
			ИначеЕсли ЗначениеЗаполнено(Выборка.ДоляСобственностиЗнаменатель) И 
					Выборка.ДоляСобственностиЗнаменатель <> Выборка.ДоляСобственностиЗнаменатель Тогда 
				ТипСобственника = "собственника доли жилого помещения (квартиры)";
			Иначе
				ТипСобственника = "собственника жилого помещения";
			КонецЕсли;
		КонецЕсли;
		ПараметрыШапки.Вставить("ТипСобственника", ТипСобственника);
		
		// Данные организации
		Если ЗначениеЗаполнено(Выборка.АдресОрганизация) Тогда
			АдресОрганизации = "Адрес: " + Выборка.АдресОрганизация;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонОрганизация) Тогда
			АдресОрганизации = АдресОрганизации + Префикс + "Тел.: " + Выборка.ТелефонОрганизация;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФаксОрганизация) Тогда
			АдресОрганизации = АдресОрганизации + Префикс + "Факс: " + Выборка.ФаксОрганизация;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.АдресЭлектроннойПочтыОрганизация) Тогда
			АдресОрганизации = АдресОрганизации + Префикс + "Email: " + Выборка.АдресЭлектроннойПочтыОрганизация;
		КонецЕсли;
		ПараметрыШапки.Вставить("АдресОрганизации", АдресОрганизации);
		
		// ФИО абонента
		Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			АбонентФИО = Выборка.Фамилия + ?(ЗначениеЗаполнено(Выборка.Имя), " " + Выборка.Имя, "") 
							+ ?(ЗначениеЗаполнено(Выборка.Отчество), " " + Выборка.Отчество, "");
			АбонентФИОКраткое = Выборка.Фамилия + ?(ЗначениеЗаполнено(Выборка.Имя), " " + Лев(Выборка.Имя, 1) + ".", "") 
							+ ?(ЗначениеЗаполнено(Выборка.Отчество), " " + Лев(Выборка.Отчество, 1) + ".", "");
		Иначе
			АбонентФИО = Строка(Выборка.ФизЛицо);
			АбонентФИОКраткое = Строка(Выборка.ФизЛицо);
		КонецЕсли;
		ПараметрыШапки.Вставить("АбонентФИО", АбонентФИО);
		ПараметрыШапки.Вставить("АбонентФИОКраткое", АбонентФИОКраткое);

		// Данные абонента
		АдресАбонента = "";
		Префикс		  = "";
		Если ЗначениеЗаполнено(Выборка.ЮрАдресАбонента) Тогда
			АдресАбонента = "Адрес: " + Выборка.АдресОрганизация;
			Префикс		  = "; ";
		ИначеЕсли ЗначениеЗаполнено(Выборка.ФактАдресАбонента) Тогда
			АдресАбонента = "Адрес: " + Выборка.ФактАдресАбонента;
			Префикс		  = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонАбонента) Тогда
			АдресАбонента = АдресАбонента + Префикс + "Тел.: " + Выборка.ТелефонАбонента;
			Префикс		  = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФаксАбонента) Тогда
			АдресАбонента = АдресАбонента + Префикс + "Факс: " + Выборка.ФаксАбонента;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ЭлАдресАбонента) Тогда
			АдресАбонента = АдресАбонента + Префикс + "Email: " + Выборка.ЭлАдресАбонента;
		КонецЕсли;
		ПараметрыШапки.Вставить("АдресАбонента", АдресАбонента);
		
		// Паспортные данные абонента
		АбонентПаспортныеДанные = АбонентФИОКраткое;
		Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", " + Выборка.ДатаРождения +
				?(ЗначениеЗаполнено(Выборка.МестоРождения), " в " + Выборка.МестоРождения, "");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Паспорт) Тогда	
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", паспорт " + Выборка.Паспорт;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ИНН) Тогда	
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", ИНН №" + Выборка.ИНН;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СНИЛС) Тогда	
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", СНИЛС " + Выборка.СНИЛС;
		КонецЕсли;
		ПараметрыШапки.Вставить("АбонентПаспортныеДанные", АбонентПаспортныеДанные);
		
		// Вид и доля собственности
		Префикс = "";
		Если ЗначениеЗаполнено(Выборка.ВидОбъекта) Тогда
			Если ЗначениеЗаполнено(Выборка.ДоляСобственностиЗнаменатель) И Выборка.ДоляСобственностиЧислитель <> Выборка.ДоляСобственностиЗнаменатель Тогда
				ДоляАбонента = НРег((Выборка.ВидОбъекта)) + ?(ЗначениеЗаполнено(Выборка.ДоляСобственностиЗнаменатель),
						" в доле " + Выборка.ДоляСобственностиЧислитель + "/" + Выборка.ДоляСобственностиЗнаменатель, "");
			Иначе
				ДоляАбонента = Выборка.ВидОбъекта;
			КонецЕсли;
		КонецЕсли;
		ПараметрыШапки.Вставить("ДоляАбонента", ДоляАбонента);
		
		// Номера предписаний, высланных абоненту
		ВыборкаПредписания.Сбросить();
		Отбор = Новый Структура("ТекЗадача", Выборка.Задача);
		Префикс = "";
		Пока ВыборкаПредписания.НайтиСледующий(Отбор) Цикл
			Предписания = Предписания + Префикс + "№ " + ВыборкаПредписания.Номер + " от " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		    Префикс = "; ";
		КонецЦикла;
		ПараметрыШапки.Вставить("Предписания", Предписания);
		
		// Период и сумма задолженности
		Если ЗначениеЗаполнено(Выборка.ПериодЗадолженностиНачало) Тогда
			НачалоЗадолженности = Формат(Выборка.ПериодЗадолженностиНачало, "ДФ='ММММ гггг'");
		КонецЕсли;
		ПараметрыШапки.Вставить("НачалоЗадолженности", НРег(НачалоЗадолженности));

		Если ЗначениеЗаполнено(Выборка.ПериодЗадолженностиКонец) Тогда
			КонецЗадолженности = Формат(Выборка.ПериодЗадолженностиКонец, "ДФ='ММММ гггг'");
		КонецЕсли;
		ПараметрыШапки.Вставить("КонецЗадолженности", НРег(КонецЗадолженности));
		
		ФормСтрока  = "Л = ru_RU; ДП = Истина";
		ПарПредмета ="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		СтруктураДолга.Свойство("СуммаОсновногоДолга", СуммаОсновногоДолга);
		СтруктураДолга.Свойство("Пеня", Пеня);

		Если ЗначениеЗаполнено(СуммаОсновногоДолга) Тогда
			СуммаЗадолженностиПрописью = Строка(СуммаОсновногоДолга) + "руб. (" + ЧислоПрописью(СуммаОсновногоДолга, ФормСтрока, ПарПредмета) + ")";
		Иначе
			СуммаЗадолженностиПрописью = "0 руб. (ноль рублей)";
			СуммаОсновногоДолга = 0;
		КонецЕсли;
		ПараметрыШапки.Вставить("СуммаЗадолженностиПрописью", НРег(СуммаЗадолженностиПрописью));
		
		Если ЗначениеЗаполнено(Пеня) Тогда
			СуммаПениПрописью = Строка(Пеня) + "руб. (" + ЧислоПрописью(Пеня, ФормСтрока, ПарПредмета) + ")";
		Иначе
			СуммаПениПрописью = "0 руб. (ноль рублей)";
			Пеня = 0;
		КонецЕсли;
		ПараметрыШапки.Вставить("СуммаПениПрописью", НРег(СуммаПениПрописью));
		
		Если ЗначениеЗаполнено(СуммаОсновногоДолга) Тогда
			ОбщаяСуммаПрописью = Строка(СуммаОсновногоДолга + Пеня) + "руб. (" + ЧислоПрописью(СуммаОсновногоДолга + Пеня, ФормСтрока, ПарПредмета) + ")";
		Иначе
			ОбщаяСуммаПрописью = "0 руб. (ноль рублей)";
		КонецЕсли;
		ПараметрыШапки.Вставить("ОбщаяСуммаПрописью", НРег(ОбщаяСуммаПрописью));
		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		
		ОбластьСередина.Параметры.Заполнить(Выборка);
		ОбластьСередина.Параметры.Заполнить(ПараметрыШапки);
		
		ОбластьПринадлежностьДоля.Параметры.Заполнить(Выборка);
		ОбластьПринадлежностьДоля.Параметры.Заполнить(ПараметрыШапки);
		
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьПринадлежностьДоля);
		ТабДок.Вывести(ОбластьСередина);
		
		// Вывод приложения
		Если ЗначениеЗаполнено(СписокПрикреплённыхДокументов) Тогда 
			Сч = 1;
			ТабДок.Вывести(ОбластьПриложениеШапка);
			
			Для каждого СтрокаПриложения Из СписокПрикреплённыхДокументов Цикл
				Приложение = "" + Сч + ". " + СтрокаПриложения;
				ОбластьПриложениеСтрока.Параметры.Приложение = Приложение;
				ТабДок.Вывести(ОбластьПриложениеСтрока);
			    Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		
		// Вывод подвала
		ОбластьПодвал.Параметры.ДатаЗаявления = ТекДата;
		ОбластьПодвал.Параметры.Пользователь  = ПараметрыСеанса.ТекущийПользователь;
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции

Функция ПечатьЗаявленияОВыдачеСудебногоПриказаОВзыскании(Задача, СписокПрикреплённыхДокументов = Неопределено, ОтветНаПритензию = "", СтруктураДолга = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Задача,
		|	энргЗадачаПИД.Абонент КАК Абонент,
		|	энргЗадачаПИДСудебныеИнстанции.СудебнаяИинстанция КАК Суд,
		|	Организации.Ссылка КАК Организация,
		|	Организации.НаименованиеПолное КАК НаименованиеПолноеОрганизация,
		|	энргАбоненты.ФизЛицо КАК ФизЛицо,
		|	энргЗадачаПИД.СуммаЗадолженности КАК СуммаЗадолженности,
		|	энргЗадачаПИД.ПериодЗадолженностиНачало КАК ПериодЗадолженностиНачало,
		|	энргЗадачаПИД.ПериодЗадолженностиКонец КАК ПериодЗадолженностиКонец,
		|	энргЗадачаПИД.Дата КАК Дата,
		|	энргЗадачаПИД.СтартоваяЗадача КАК СтартоваяЗадача,
		|	энргАбоненты.ВидОбъекта КАК ВидОбъекта,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения,
		|	энргАбонентыКонтактнаяИнформация.Представление КАК АдресОбъекта,
		|	энргЗадачаПИД.Район КАК Район,
		|	энргЗадачаПИД.СуммаГоспошлина КАК СуммаГоспошлина,
		|	энргКлючиПомещений.Помещение КАК Помещение,
		|	энргОперацияСЛицевымСчетом.Договор.Дата КАК ДатаДоговораОбслуживания,
		|	энргОперацияСЛицевымСчетом.Договор.Номер КАК НомерДоговораОбслуживания,
		|	энргОперацияСЛицевымСчетомЖильцы.СвидетельствоОРегистрацииНомер КАК СвидетельствоОРегистрацииНомер,
		|	энргОперацияСЛицевымСчетомЖильцы.СвидетельствоОРегистрацииДата КАК СвидетельствоОРегистрацииДата,
		|	энргОперацияСЛицевымСчетомЖильцы.СвидетельствоОРегистрацииСерия КАК СвидетельствоОРегистрацииСерия
		|ПОМЕСТИТЬ ВТ_Задача
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.СудебныеИнстанции КАК энргЗадачаПИДСудебныеИнстанции
		|		ПО энргЗадачаПИД.Ссылка = энргЗадачаПИДСудебныеИнстанции.Ссылка
		|			И (энргЗадачаПИДСудебныеИнстанции.Текущая)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО энргЗадачаПИД.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
		|		ПО энргЗадачаПИД.Организация = энргОперацияСЛицевымСчетом.Организация
		|			И энргЗадачаПИД.Район = энргОперацияСЛицевымСчетом.Район
		|			И энргЗадачаПИД.Абонент = энргОперацияСЛицевымСчетом.Абонент
		|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
		|			И (энргОперацияСЛицевымСчетом.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|			ПО энргАбоненты.Ссылка = энргАбонентыКонтактнаяИнформация.Ссылка
		|				И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыконтактнойИнформации.АдресОбъекта))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
		|		ПО энргЗадачаПИД.Абонент = энргАбоненты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Жильцы КАК энргОперацияСЛицевымСчетомЖильцы
		|		ПО (энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомЖильцы.Ссылка)
		|			И (энргАбоненты.ФизЛицо = энргОперацияСЛицевымСчетомЖильцы.ФизическоеЛицо)
		|ГДЕ
		|	энргЗадачаПИД.Ссылка = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Организация КАК Организация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресОрганизация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ТелефонОрганизация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ФаксОрганизация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресЭлектроннойПочтыОрганизация
		|ПОМЕСТИТЬ ВТ_ДанныеОрганизации
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО ВТ_Задача.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
		|			И (ОрганизацииКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Задача.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.ФизЛицо КАК ФизЛицо,
		|	энргКонтрагенты.бестФамилия КАК Фамилия,
		|	энргКонтрагенты.бестИмя КАК Имя,
		|	энргКонтрагенты.бестОтчество КАК Отчество,
		|	энргКонтрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	энргКонтрагенты.ИНН КАК ИНН,
		|	энргКонтрагенты.бестДатаРождения КАК ДатаРождения,
		|	энргКонтрагенты.МестоРождения КАК МестоРождения
		|ПОМЕСТИТЬ ВТ_ДанныеФизЛица
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|		ПО ВТ_Задача.ФизЛицо = энргКонтрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеФизЛица.ФизЛицо КАК ФизЛицо,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЮрАдресАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ФактАдресАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ТелефонАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ФаксАбонента,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЭлАдресАбонента
		|ПОМЕСТИТЬ ВТ_ДанныеКонтрагента
		|ИЗ
		|	ВТ_ДанныеФизЛица КАК ВТ_ДанныеФизЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
		|		ПО ВТ_ДанныеФизЛица.ФизЛицо = энргКонтрагентыКонтактнаяИнформация.Ссылка
		|			И (энргКонтрагентыКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеФизЛица.ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Контрагент КАК Абонент,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
		|				ТОГДА ДокументыФизическихЛицСрезПоследних.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Паспорт,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СНИЛС)
		|				ТОГДА ДокументыФизическихЛицСрезПоследних.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК СНИЛС
		|ПОМЕСТИТЬ ВТ_ДокументыАбонента
		|ИЗ
		|	РегистрСведений.энргДокументыФизическихЛиц.СрезПоследних(
		|			&ТекДата,
		|			Контрагент В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.Абонент КАК Абонент
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)
		|				И ВидДокумента В (ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортСССР), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.СНИЛС))) КАК ДокументыФизическихЛицСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыФизическихЛицСрезПоследних.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Ссылка,
		|	ВТ_Задача.Задача КАК ТекЗадача
		|ПОМЕСТИТЬ ВТ_ПредыдущиеЗадачи
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО ВТ_Задача.СтартоваяЗадача = энргЗадачаПИД.СтартоваяЗадача
		|			И ВТ_Задача.Дата >= энргЗадачаПИД.Дата
		|ГДЕ
		|	НЕ энргЗадачаПИД.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЧислитель) КАК ДоляСобственностиЧислитель,
		|	МАКСИМУМ(энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЗнаменатель) КАК ДоляСобственностиЗнаменатель,
		|	ВТ_Задача.Задача КАК Задача
		|ПОМЕСТИТЬ ВТ_Доля
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
		|				&ТекДата,
		|				(КлючПомещения, Жилец) В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.КлючПомещения КАК КлючПомещения,
		|						ВТ_Задача.ФизЛицо КАК ФизЛицо
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)) КАК энргПроживаниеЖильцовСрезПоследних
		|		ПО ВТ_Задача.КлючПомещения = энргПроживаниеЖильцовСрезПоследних.КлючПомещения
		|			И ВТ_Задача.ФизЛицо = энргПроживаниеЖильцовСрезПоследних.Жилец
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Задача.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	СУММА(энргВзаиморасчетыПоПениОстатки.СуммаОстаток) КАК СуммаОстаток
		|ПОМЕСТИТЬ ВТ_Пеня
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
		|				,
		|				(Абонент, Организация) В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.Абонент КАК Абонент,
		|						ВТ_Задача.Организация КАК Организация
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)) КАК энргВзаиморасчетыПоПениОстатки
		|		ПО ВТ_Задача.Абонент = энргВзаиморасчетыПоПениОстатки.Абонент
		|			И ВТ_Задача.Организация = энргВзаиморасчетыПоПениОстатки.Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Задача.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргТипСобственностиАбонентовСрезПоследних.Организация КАК Организация,
		|	энргТипСобственностиАбонентовСрезПоследних.Район КАК Район,
		|	энргТипСобственностиАбонентовСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности КАК ТипСобственности,
		|	энргТипСобственностиАбонентовСрезПоследних.НомерДоговораСоцНайма КАК НомерДоговораСоцНайма,
		|	энргТипСобственностиАбонентовСрезПоследних.ДатаДоговораСоцНайма КАК ДатаДоговораСоцНайма
		|ПОМЕСТИТЬ ВТ_ТипСобственности
		|ИЗ
		|	РегистрСведений.энргТипСобственностиАбонентов.СрезПоследних(
		|			&ТекДата,
		|			(Организация, Район, КлючПомещения) В
		|				(ВЫБРАТЬ
		|					ВТ_Задача.Организация КАК Организация,
		|					ВТ_Задача.Район КАК Район,
		|					ВТ_Задача.КлючПомещения КАК КлючПомещения
		|				ИЗ
		|					ВТ_Задача КАК ВТ_Задача)) КАК энргТипСобственностиАбонентовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Задача КАК ВТ_Задача
		|		ПО энргТипСобственностиАбонентовСрезПоследних.Организация = ВТ_Задача.Организация
		|			И энргТипСобственностиАбонентовСрезПоследних.Район = ВТ_Задача.Район
		|			И энргТипСобственностиАбонентовСрезПоследних.КлючПомещения = ВТ_Задача.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(энргСобытие.Номер) КАК Номер,
		|	МАКСИМУМ(энргСобытие.Дата) КАК Дата,
		|	МАКСИМУМ(энргСобытиеАбоненты.Успех) КАК Успех,
		|	ВТ_ПредыдущиеЗадачи.ТекЗадача КАК ТекЗадача
		|ПОМЕСТИТЬ ВТ_ПоследнееПредписание
		|ИЗ
		|	Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСобытие КАК энргСобытие
		|		ПО энргСобытиеАбоненты.Ссылка = энргСобытие.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПредыдущиеЗадачи КАК ВТ_ПредыдущиеЗадачи
		|		ПО энргСобытиеАбоненты.Основание = ВТ_ПредыдущиеЗадачи.Ссылка
		|ГДЕ
		|	энргСобытиеАбоненты.Успех
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПредыдущиеЗадачи.ТекЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	энргПроживаниеЖильцовСрезПоследних.Жилец КАК Жилец,
		|	энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	энргПроживаниеЖильцовСрезПоследних.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель,
		|	энргКонтрагенты.бестДатаРождения КАК бестДатаРождения,
		|	энргКонтрагенты.МестоРождения КАК МестоРождения,
		|	энргКонтрагенты.бестФамилия КАК бестФамилия,
		|	энргКонтрагенты.бестИмя КАК бестИмя,
		|	энргКонтрагенты.бестОтчество КАК бестОтчество
		|ПОМЕСТИТЬ ВТ_Жильцы
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
		|				&ТекДата,
		|				(Организация, Район, КлючПомещения) В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.Организация КАК Организация,
		|						ВТ_Задача.Район КАК Район,
		|						ВТ_Задача.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)) КАК энргПроживаниеЖильцовСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|			ПО энргПроживаниеЖильцовСрезПоследних.Жилец = энргКонтрагенты.Ссылка
		|		ПО ВТ_Задача.Организация = энргПроживаниеЖильцовСрезПоследних.Организация
		|			И ВТ_Задача.Район = энргПроживаниеЖильцовСрезПоследних.Район
		|			И ВТ_Задача.КлючПомещения = энргПроживаниеЖильцовСрезПоследних.КлючПомещения
		|ГДЕ
		|	энргПроживаниеЖильцовСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеЖильцов.Регистрация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	энргАктивностьТочекУчетаСрезПоследних.Организация КАК Организация,
		|	энргАктивностьТочекУчетаСрезПоследних.Район КАК Район,
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ВТ_ТочкиУчета
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|				&ТекДата,
		|				(Организация, Район, КлючПомещения) В
		|					(ВЫБРАТЬ
		|						ВТ_Задача.Организация КАК Организация,
		|						ВТ_Задача.Район КАК Район,
		|						ВТ_Задача.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_Задача КАК ВТ_Задача)) КАК энргАктивностьТочекУчетаСрезПоследних
		|		ПО ВТ_Задача.Организация = энргАктивностьТочекУчетаСрезПоследних.Организация
		|			И ВТ_Задача.Район = энргАктивностьТочекУчетаСрезПоследних.Район
		|			И ВТ_Задача.КлючПомещения = энргАктивностьТочекУчетаСрезПоследних.КлючПомещения
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	ВТ_Задача.Абонент КАК Абонент,
		|	ВТ_Задача.Суд КАК Суд,
		|	ВТ_Задача.Организация КАК Организация,
		|	ВТ_Задача.НаименованиеПолноеОрганизация КАК НаименованиеПолноеОрганизация,
		|	ВТ_Задача.ФизЛицо КАК ФизЛицо,
		|	ВТ_Задача.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ВТ_Задача.ПериодЗадолженностиНачало КАК ПериодЗадолженностиНачало,
		|	ВТ_Задача.ПериодЗадолженностиКонец КАК ПериодЗадолженностиКонец,
		|	ВТ_Задача.Дата КАК Дата,
		|	ВТ_Задача.СтартоваяЗадача КАК СтартоваяЗадача,
		|	ВТ_Задача.ВидОбъекта КАК ВидОбъекта,
		|	ВТ_Задача.КлючПомещения КАК КлючПомещения,
		|	ВТ_ДанныеФизЛица.Фамилия КАК Фамилия,
		|	ВТ_ДанныеФизЛица.Имя КАК Имя,
		|	ВТ_ДанныеФизЛица.Отчество КАК Отчество,
		|	ВТ_ДанныеФизЛица.НаименованиеПолное КАК НаименованиеПолное,
		|	ВТ_ДанныеФизЛица.ИНН КАК ИНН,
		|	ВТ_ДанныеФизЛица.ДатаРождения КАК ДатаРождения,
		|	ВТ_ДанныеФизЛица.МестоРождения КАК МестоРождения,
		|	ВТ_ДанныеОрганизации.АдресОрганизация КАК АдресОрганизация,
		|	ВТ_ДанныеОрганизации.ТелефонОрганизация КАК ТелефонОрганизация,
		|	ВТ_ДанныеОрганизации.ФаксОрганизация КАК ФаксОрганизация,
		|	ВТ_ДанныеОрганизации.АдресЭлектроннойПочтыОрганизация КАК АдресЭлектроннойПочтыОрганизация,
		|	ВТ_ДокументыАбонента.Паспорт КАК Паспорт,
		|	ВТ_ДокументыАбонента.СНИЛС КАК СНИЛС,
		|	ВТ_Доля.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	ВТ_Доля.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель,
		|	ВТ_ДанныеКонтрагента.ЮрАдресАбонента КАК ЮрАдресАбонента,
		|	ВТ_ДанныеКонтрагента.ФактАдресАбонента КАК ФактАдресАбонента,
		|	ВТ_ДанныеКонтрагента.ТелефонАбонента КАК ТелефонАбонента,
		|	ВТ_ДанныеКонтрагента.ФаксАбонента КАК ФаксАбонента,
		|	ВТ_ДанныеКонтрагента.ЭлАдресАбонента КАК ЭлАдресАбонента,
		|	ВТ_Задача.АдресОбъекта КАК АдресОбъекта,
		|	ВЫБОР
		|		КОГДА ВТ_Пеня.СуммаОстаток ЕСТЬ NULL
		|				ИЛИ ВТ_Пеня.СуммаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Пеня.СуммаОстаток
		|	КОНЕЦ КАК Пеня,
		|	ВТ_Задача.СуммаЗадолженности + ВЫБОР
		|		КОГДА ВТ_Пеня.СуммаОстаток ЕСТЬ NULL
		|				ИЛИ ВТ_Пеня.СуммаОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Пеня.СуммаОстаток
		|	КОНЕЦ КАК ОбщаяСумма,
		|	ВТ_ТипСобственности.ТипСобственности КАК ТипСобственности,
		|	ВТ_ТипСобственности.НомерДоговораСоцНайма КАК НомерДоговораСоцНайма,
		|	ВТ_ТипСобственности.ДатаДоговораСоцНайма КАК ДатаДоговораСоцНайма,
		|	ВТ_Задача.СуммаГоспошлина КАК СуммаГоспошлина,
		|	ВТ_Задача.Помещение КАК Помещение,
		|	ВТ_ПоследнееПредписание.Дата КАК ДатаПослПредписания,
		|	ВТ_Задача.ДатаДоговораОбслуживания КАК ДатаДоговораОбслуживания,
		|	ВТ_Задача.НомерДоговораОбслуживания КАК НомерДоговораОбслуживания,
		|	ВТ_Задача.СвидетельствоОРегистрацииНомер КАК СвидетельствоОРегистрацииНомер,
		|	ВТ_Задача.СвидетельствоОРегистрацииДата КАК СвидетельствоОРегистрацииДата,
		|	ВТ_Задача.СвидетельствоОРегистрацииСерия КАК СвидетельствоОРегистрацииСерия,
		|	ВТ_Задача.Район КАК Район
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеФизЛица КАК ВТ_ДанныеФизЛица
		|		ПО ВТ_Задача.ФизЛицо = ВТ_ДанныеФизЛица.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОрганизации КАК ВТ_ДанныеОрганизации
		|		ПО ВТ_Задача.Организация = ВТ_ДанныеОрганизации.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыАбонента КАК ВТ_ДокументыАбонента
		|		ПО ВТ_Задача.Абонент = ВТ_ДокументыАбонента.Абонент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доля КАК ВТ_Доля
		|		ПО ВТ_Задача.Задача = ВТ_Доля.Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеКонтрагента КАК ВТ_ДанныеКонтрагента
		|		ПО ВТ_Задача.ФизЛицо = ВТ_ДанныеКонтрагента.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Пеня КАК ВТ_Пеня
		|		ПО ВТ_Задача.Задача = ВТ_Пеня.Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТипСобственности КАК ВТ_ТипСобственности
		|		ПО ВТ_Задача.Организация = ВТ_ТипСобственности.Организация
		|			И ВТ_Задача.Район = ВТ_ТипСобственности.Район
		|			И ВТ_Задача.КлючПомещения = ВТ_ТипСобственности.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследнееПредписание КАК ВТ_ПоследнееПредписание
		|		ПО ВТ_Задача.Задача = ВТ_ПоследнееПредписание.ТекЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Жильцы.Задача КАК Задача,
		|	ВТ_Жильцы.Жилец КАК Жилец,
		|	ВТ_Жильцы.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
		|	ВТ_Жильцы.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель,
		|	ВТ_Жильцы.бестДатаРождения КАК бестДатаРождения,
		|	ВТ_Жильцы.МестоРождения КАК МестоРождения,
		|	ВТ_Жильцы.бестФамилия КАК бестФамилия,
		|	ВТ_Жильцы.бестИмя КАК бестИмя,
		|	ВТ_Жильцы.бестОтчество КАК бестОтчество
		|ИЗ
		|	ВТ_Жильцы КАК ВТ_Жильцы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТочкиУчета.Задача КАК Задача,
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, энргУслугиТочекУчетаСрезПоследних.Услуга) КАК Услуги
		|ИЗ
		|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|			,
		|			(Организация, Район, КлючПомещения, ТочкаУчета) В
		|				(ВЫБРАТЬ
		|					ВТ_ТочкиУчета.Организация КАК Организация,
		|					ВТ_ТочкиУчета.Район КАК Район,
		|					ВТ_ТочкиУчета.КлючПомещения КАК КлючПомещения,
		|					ВТ_ТочкиУчета.ТочкаУчета КАК ТочкаУчета
		|				ИЗ
		|					ВТ_ТочкиУчета КАК ВТ_ТочкиУчета)) КАК энргУслугиТочекУчетаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТочкиУчета КАК ВТ_ТочкиУчета
		|		ПО энргУслугиТочекУчетаСрезПоследних.Организация = ВТ_ТочкиУчета.Организация
		|			И энргУслугиТочекУчетаСрезПоследних.Район = ВТ_ТочкиУчета.Район
		|			И энргУслугиТочекУчетаСрезПоследних.ТочкаУчета = ВТ_ТочкиУчета.ТочкаУчета
		|			И энргУслугиТочекУчетаСрезПоследних.КлючПомещения = ВТ_ТочкиУчета.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО энргУслугиТочекУчетаСрезПоследних.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТочкиУчета.Задача,
		|	ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Услуга, энргУслугиТочекУчетаСрезПоследних.Услуга)";
	
	Если СтруктураДолга = Неопределено Тогда
		СтруктураДолга = Новый Структура;
	КонецЕсли;
	ТекДата = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Задача", Задача);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КолПакет		 = РезультатЗапроса.Количество();
	Макет			 = ПолучитьМакет("МакетЗаявленияОВыдачеСудебногоПриказаОВзыскании");
	
	ОбластьШапка	 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьПриложениеШапка	= Макет.ПолучитьОбласть("ПриложениеШапка");
	ОбластьПриложениеСтрока	= Макет.ПолучитьОбласть("ПриложениеСтрока");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	
	Выборка			= РезультатЗапроса[КолПакет-3].Выбрать();
	ВыборкаЖильцы	= РезультатЗапроса[КолПакет-2].Выбрать();
	ВыборкаУслуги	= РезультатЗапроса[КолПакет-1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.АвтоМасштаб = Истина;
		
		ВыводШапкиФилиала(ТабДок, Выборка.Район, ОбластьШапка);
		ОбластьШапка.Параметры.Заполнить(Выборка);
		
		ПараметрыШапки = Новый Структура("ОтветНаПритензию", ОтветНаПритензию);

		АдресОрганизации = "";
		Префикс			 = "";
		АбонентФИО		 = "";
		АбонентФИОКраткое = "";
		АдресАбонента	 = "";
		АбонентПаспортныеДанные = "";
		ДоляАбонента = "";
		АбонентыФИОсДМР = "";
		НачалоЗадолженности = "";
		КонецЗадолженности = "";
		СуммаГоспошлиныПрописью = "";
		СуммаЗадолженностиПрописью = "";
		СуммаПениПрописью = "";
		ТипСобственника = "";
		ДатаДоговораСоцНайма = "";
		ДатаПредписания = "";
		ДолжникиФИО = "";
		ДоговорОбслуживания = "";
		ОснованиеПраваСобственности = "";
		ОказываемыеУслуги = "";
		РодственикиАбонента = "";
		СуммаОсновногоДолга = Неопределено;
		Госпошлина = Неопределено;
		Пеня = Неопределено;
		
		Если ЗначениеЗаполнено(Выборка.ДатаДоговораОбслуживания) Тогда
			ОснованиеПраваСобственности = "свидетельства о регистрации №" + Выборка.СвидетельствоОРегистрацииСерия + " " + Выборка.СвидетельствоОРегистрацииНомер + " от " + Формат(Выборка.СвидетельствоОРегистрацииДата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		ПараметрыШапки.Вставить("ОснованиеПраваСобственности", ОснованиеПраваСобственности);
		
		Если ЗначениеЗаполнено(Выборка.ДатаДоговораОбслуживания) Тогда
			ДоговорОбслуживания = "договора обслуживания №" + Выборка.НомерДоговораОбслуживания + " от " + Формат(Выборка.ДатаДоговораОбслуживания, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		ПараметрыШапки.Вставить("ДоговорОбслуживания", ДоговорОбслуживания);
		
		Если ЗначениеЗаполнено(Выборка.ДатаПослПредписания) Тогда
			ДатаПредписания = Формат(Выборка.ДатаПослПредписания, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		ПараметрыШапки.Вставить("ДатаПредписания", ДатаПредписания);
		
		Если ЗначениеЗаполнено(Выборка.ДатаДоговораСоцНайма) Тогда
			ДатаДоговораСоцНайма = Формат(Выборка.ДатаДоговораСоцНайма, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		ПараметрыШапки.Вставить("ДатаДоговораСоцНайма", ДатаДоговораСоцНайма);

		// Данные организации
		Если ЗначениеЗаполнено(Выборка.АдресОрганизация) Тогда
			АдресОрганизации = "Адрес: " + Выборка.АдресОрганизация;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонОрганизация) Тогда
			АдресОрганизации = АдресОрганизации + Префикс + "Тел.: " + Выборка.ТелефонОрганизация;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФаксОрганизация) Тогда
			АдресОрганизации = АдресОрганизации + Префикс + "Факс: " + Выборка.ФаксОрганизация;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.АдресЭлектроннойПочтыОрганизация) Тогда
			АдресОрганизации = АдресОрганизации + Префикс + "Email: " + Выборка.АдресЭлектроннойПочтыОрганизация;
		КонецЕсли;
		ПараметрыШапки.Вставить("АдресОрганизации", АдресОрганизации);
		
		// ФИО абонента
		Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			АбонентФИО = Выборка.Фамилия + ?(ЗначениеЗаполнено(Выборка.Имя), " " + Выборка.Имя, "") 
							+ ?(ЗначениеЗаполнено(Выборка.Отчество), " " + Выборка.Отчество, "");
			АбонентФИОКраткое = Выборка.Фамилия + ?(ЗначениеЗаполнено(Выборка.Имя), " " + Лев(Выборка.Имя, 1) + ".", "") 
							+ ?(ЗначениеЗаполнено(Выборка.Отчество), " " + Лев(Выборка.Отчество, 1) + ".", "");
		Иначе
			АбонентФИО = Строка(Выборка.ФизЛицо);
			АбонентФИОКраткое = Строка(Выборка.ФизЛицо);
		КонецЕсли;
		ПараметрыШапки.Вставить("АбонентФИО", АбонентФИО);
		ПараметрыШапки.Вставить("АбонентФИОКраткое", АбонентФИОКраткое);

		// Данные абонента
		АдресАбонента = "";
		Префикс		  = "";
		Если ЗначениеЗаполнено(Выборка.ЮрАдресАбонента) Тогда
			АдресАбонента = "Адрес: " + Выборка.АдресОрганизация;
			Префикс		  = "; ";
		ИначеЕсли ЗначениеЗаполнено(Выборка.ФактАдресАбонента) Тогда
			АдресАбонента = "Адрес: " + Выборка.ФактАдресАбонента;
			Префикс		  = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТелефонАбонента) Тогда
			АдресАбонента = АдресАбонента + Префикс + "Тел.: " + Выборка.ТелефонАбонента;
			Префикс		  = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ФаксАбонента) Тогда
			АдресАбонента = АдресАбонента + Префикс + "Факс: " + Выборка.ФаксАбонента;
			Префикс			 = "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ЭлАдресАбонента) Тогда
			АдресАбонента = АдресАбонента + Префикс + "Email: " + Выборка.ЭлАдресАбонента;
		КонецЕсли;
		ПараметрыШапки.Вставить("АдресАбонента", АдресАбонента);
		
		// Паспортные данные абонента
		АбонентПаспортныеДанные = АбонентФИОКраткое;
		Если ЗначениеЗаполнено(Выборка.ДатаРождения) Тогда
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", " + Выборка.ДатаРождения +
				?(ЗначениеЗаполнено(Выборка.МестоРождения), " в " + Выборка.МестоРождения, "");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Паспорт) Тогда	
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", паспорт " + Выборка.Паспорт;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ИНН) Тогда	
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", ИНН №" + Выборка.ИНН;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СНИЛС) Тогда	
			АбонентПаспортныеДанные = АбонентПаспортныеДанные + ", СНИЛС " + Выборка.СНИЛС;
		КонецЕсли;
		ПараметрыШапки.Вставить("АбонентПаспортныеДанные", АбонентПаспортныеДанные);
		
		// Вид и доля собственности
		Префикс = "";
		Если ЗначениеЗаполнено(Выборка.ВидОбъекта) Тогда
			Если ЗначениеЗаполнено(Выборка.ДоляСобственностиЗнаменатель) И Выборка.ДоляСобственностиЧислитель <> Выборка.ДоляСобственностиЗнаменатель Тогда
				ДоляАбонента = НРег((Выборка.ВидОбъекта)) + ?(ЗначениеЗаполнено(Выборка.ДоляСобственностиЗнаменатель),
						" в доле " + Выборка.ДоляСобственностиЧислитель + "/" + Выборка.ДоляСобственностиЗнаменатель, "");
			Иначе
				ДоляАбонента = Выборка.ВидОбъекта;
			КонецЕсли;
		КонецЕсли;
		ПараметрыШапки.Вставить("ДоляАбонента", ДоляАбонента);
		
		// Жильцы абонента
		ВыборкаЖильцы.Сбросить();
		Отбор 		= Новый Структура("Задача", Выборка.Задача);
		Префикс		= "";
		ПрефиксФИО	= "";
		ПрефиксРод	= "";
		Пока ВыборкаЖильцы.НайтиСледующий(Отбор) Цикл
			АбонентыФИОсДМР = АбонентыФИОсДМР + Префикс + ?(ЗначениеЗаполнено(ВыборкаЖильцы.бестФамилия), ВыборкаЖильцы.бестФамилия + 
								?(ЗначениеЗаполнено(ВыборкаЖильцы.бестИмя), " " + Лев(ВыборкаЖильцы.бестИмя, 1)+".", "")  +
								?(ЗначениеЗаполнено(ВыборкаЖильцы.бестОтчество), " " + Лев(ВыборкаЖильцы.бестОтчество, 1), "")+".", ВыборкаЖильцы.Жилец) +
					?(ЗначениеЗаполнено(ВыборкаЖильцы.бестДатаРождения), ", д.р. " + Формат(ВыборкаЖильцы.бестДатаРождения, "ДФ=dd.MM.yyyy"), "") +
					?(ЗначениеЗаполнено(ВыборкаЖильцы.МестоРождения), ", м.р. " + Формат(ВыборкаЖильцы.МестоРождения, "ДФ=dd.MM.yyyy"), "");
		    Префикс = ", " + Символы.ПС;
			
			ДолжникиФИО = ДолжникиФИО + ПрефиксФИО + ?(ЗначениеЗаполнено(ВыборкаЖильцы.бестФамилия), ВыборкаЖильцы.бестФамилия + 
								?(ЗначениеЗаполнено(ВыборкаЖильцы.бестИмя), " " + Лев(ВыборкаЖильцы.бестИмя, 1), "")+"." + 
								?(ЗначениеЗаполнено(ВыборкаЖильцы.бестОтчество), " " + Лев(ВыборкаЖильцы.бестОтчество, 1), "")+".", ВыборкаЖильцы.Жилец);
			ПрефиксФИО = ", ";
			Если Выборка.ФизЛицо <> ВыборкаЖильцы.Жилец Тогда
			
				РодственикиАбонента = РодственикиАбонента + ПрефиксРод + ?(ЗначениеЗаполнено(ВыборкаЖильцы.бестФамилия), ВыборкаЖильцы.бестФамилия + 
								?(ЗначениеЗаполнено(ВыборкаЖильцы.бестИмя), " " + Лев(ВыборкаЖильцы.бестИмя, 1), "")+"." + 
								?(ЗначениеЗаполнено(ВыборкаЖильцы.бестОтчество), " " + Лев(ВыборкаЖильцы.бестОтчество, 1), "")+".", ВыборкаЖильцы.Жилец);
								
				ПрефиксРод = ", ";				
			КонецЕсли;
		КонецЦикла;
		ПараметрыШапки.Вставить("АбонентыФИОсДМР", АбонентыФИОсДМР);
		ПараметрыШапки.Вставить("ДолжникиФИО", ДолжникиФИО);
		ПараметрыШапки.Вставить("РодственикиАбонента", РодственикиАбонента);
		
		// Услуги абонента
		ВыборкаУслуги.Сбросить();
		Префикс		= "";
		Пока ВыборкаУслуги.НайтиСледующий(Отбор) Цикл
			ОказываемыеУслуги = ОказываемыеУслуги + Префикс + НРег(ВыборкаУслуги.Услуги);
			Префикс = ", ";
		КонецЦикла;
		ПараметрыШапки.Вставить("ОказываемыеУслуги", ОказываемыеУслуги);
		
		// Период и сумма задолженности
		Если ЗначениеЗаполнено(Выборка.ПериодЗадолженностиНачало) Тогда
			НачалоЗадолженности = Формат(Выборка.ПериодЗадолженностиНачало, "ДЛФ=DD");
		КонецЕсли;
		ПараметрыШапки.Вставить("НачалоЗадолженности", НРег(НачалоЗадолженности));

		Если ЗначениеЗаполнено(Выборка.ПериодЗадолженностиКонец) Тогда
			КонецЗадолженности = Формат(Выборка.ПериодЗадолженностиКонец, "ДЛФ=DD");
		КонецЕсли;
		ПараметрыШапки.Вставить("КонецЗадолженности", НРег(КонецЗадолженности));
		
		ФормСтрока  = "Л = ru_RU; ДП = Истина";
		ПарПредмета ="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		СтруктураДолга.Свойство("СуммаОсновногоДолга", СуммаОсновногоДолга);
		СтруктураДолга.Свойство("Госпошлина", Госпошлина);
		СтруктураДолга.Свойство("Пеня", Пеня);
		Если ЗначениеЗаполнено(СуммаОсновногоДолга) Тогда
			СуммаЗадолженностиПрописью = Строка(СуммаОсновногоДолга) + "руб. (" + ЧислоПрописью(СуммаОсновногоДолга, ФормСтрока, ПарПредмета) + ")";
		Иначе
			СуммаЗадолженностиПрописью = "0 руб. (ноль рублей)";
		КонецЕсли;
		ПараметрыШапки.Вставить("СуммаЗадолженностиПрописью", НРег(СуммаЗадолженностиПрописью));
		
		Если ЗначениеЗаполнено(Госпошлина) Тогда
			СуммаГоспошлиныПрописью = Строка(Госпошлина) + "руб. (" + ЧислоПрописью(Госпошлина, ФормСтрока, ПарПредмета) + ")";
		Иначе
			СуммаГоспошлиныПрописью = "0 руб. (ноль рублей)";
		КонецЕсли;
		ПараметрыШапки.Вставить("СуммаГоспошлиныПрописью", НРег(СуммаГоспошлиныПрописью));
		
		Если ЗначениеЗаполнено(Пеня) Тогда
			СуммаПениПрописью = Строка(Пеня) + "руб. (" + ЧислоПрописью(Пеня, ФормСтрока, ПарПредмета) + ")";
		Иначе
			СуммаПениПрописью = "0 руб. (ноль рублей)";
		КонецЕсли;
		ПараметрыШапки.Вставить("СуммаПениПрописью", НРег(СуммаПениПрописью));
		
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		
		ТабДок.Вывести(ОбластьШапка);
		
		// Вывод приложения
		Если ЗначениеЗаполнено(СписокПрикреплённыхДокументов) Тогда 
			Сч = 1;
			ТабДок.Вывести(ОбластьПриложениеШапка);
			
			Для каждого СтрокаПриложения Из СписокПрикреплённыхДокументов Цикл
				Приложение = "" + Сч + ". " + СтрокаПриложения;
				ОбластьПриложениеСтрока.Параметры.Приложение = Приложение;
				ТабДок.Вывести(ОбластьПриложениеСтрока);
			    Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		
		// Вывод подвала
		ОбластьПодвал.Параметры.ДатаЗаявления = ТекДата;
		ОбластьПодвал.Параметры.Пользователь  = ПараметрыСеанса.ТекущийПользователь;
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции

Функция ПечатьЗаявленияОВозбужденииИсполнительногоПроизводстваНаСервере(Задача, СтруктураДолга = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИД.Ссылка КАК Задача,
		|	энргЗадачаПИД.Дата КАК Дата,
		|	энргЗадачаПИД.ДатаИсполительногоЛиста КАК ДатаИсполительногоЛиста,
		|	энргЗадачаПИД.НомерИсполнительногоЛиста КАК НомерИсполнительногоЛиста,
		|	энргЗадачаПИД.ВыданИсполнительныйЛист КАК ВыданИсполнительныйЛист,
		|	энргСлужбыСудебныхПристовов.НачальникРОСП КАК НачальникРОСП,
		|	энргСлужбыСудебныхПристововКонтактнаяИнформация.Представление КАК АдресСтруктурногоПодразделенияФСПП,
		|	энргЗадачаПИД.НомерСудебногоДела КАК НомерСудебногоДела,
		|	энргАбоненты.ФизЛицо КАК ФизЛицо,
		|	энргКонтрагенты.бестФамилия КАК бестФамилия,
		|	энргКонтрагенты.бестИмя КАК бестИмя,
		|	энргКонтрагенты.бестОтчество КАК бестОтчество,
		|	энргАбонентыКонтактнаяИнформация.Представление КАК АдресОбъекта,
		|	энргЗадачаПИД.СуммаЗадолженности КАК СуммаЗадолженности,
		|	энргФилиалыАбонентовСрезПоследних.Филиал КАК Филиал,
		|	энргЗадачаПИД.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_Задача
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|			ПО энргАбоненты.Ссылка = энргАбонентыКонтактнаяИнформация.Ссылка
		|				И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыконтактнойИнформации.АдресОбъекта))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|			ПО энргАбоненты.ФизЛицо = энргКонтрагенты.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргФилиалыАбонентов.СрезПоследних КАК энргФилиалыАбонентовСрезПоследних
		|			ПО энргАбоненты.Ссылка = энргФилиалыАбонентовСрезПоследних.Абонент
		|		ПО энргЗадачаПИД.Абонент = энргАбоненты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСлужбыСудебныхПристовов КАК энргСлужбыСудебныхПристовов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСлужбыСудебныхПристовов.КонтактнаяИнформация КАК энргСлужбыСудебныхПристововКонтактнаяИнформация
		|			ПО энргСлужбыСудебныхПристовов.Ссылка = энргСлужбыСудебныхПристововКонтактнаяИнформация.Ссылка
		|				И (энргСлужбыСудебныхПристововКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСлужбыСудебныйПристовов))
		|		ПО энргЗадачаПИД.СлужбаСудебныхПристовов = энргСлужбыСудебныхПристовов.Ссылка
		|ГДЕ
		|	энргЗадачаПИД.Ссылка = &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ТелефонОрганизации,
		|	МАКСИМУМ(КлассификаторБанков.Наименование) КАК НаименованиеБанкаПолучателя,
		|	МАКСИМУМ(КлассификаторБанков.Код) КАК БИКБанкаПолучателя,
		|	МАКСИМУМ(КлассификаторБанков.КоррСчет) КАК СчетБанкаПолучателя,
		|	Организации.Ссылка КАК Организация
		|ПОМЕСТИТЬ ВТ_КонтактныеДанныеОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Задача КАК ВТ_Задача
		|		ПО Организации.Ссылка = ВТ_Задача.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
		|			ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
		|		ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Организации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	энргЗадачаПИДЗадачиПоИсполнителю.Ссылка КАК Ссылка,
		|	энргВидыОперацийПИД.Тип КАК Тип,
		|	энргЗадачаПИДЗадачиПоИсполнителю.НомерИсполнительногоЛиста КАК НомерИсполнительногоЛиста,
		|	энргЗадачаПИДЗадачиПоИсполнителю.ДатаИсполительногоЛиста КАК ДатаИсполительногоЛиста,
		|	энргЗадачаПИДЗадачиПоИсполнителю.СлужбаСудебныхПристовов КАК СлужбаСудебныхПристовов
		|ИЗ
		|	Задача.энргЗадачаПИД.ЗадачиПоИсполнителю КАК энргЗадачаПИДЗадачиПоИсполнителю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Задача КАК ВТ_Задача
		|		ПО энргЗадачаПИДЗадачиПоИсполнителю.Ссылка <> ВТ_Задача.Задача
		|			И энргЗадачаПИДЗадачиПоИсполнителю.Абонент.ФизЛицо = ВТ_Задача.ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
		|		ПО энргЗадачаПИДЗадачиПоИсполнителю.Этап = энргВидыОперацийПИД.Ссылка
		|ГДЕ
		|	НЕ энргЗадачаПИДЗадачиПоИсполнителю.Выполнена
		|	И энргВидыОперацийПИД.Тип = ЗНАЧЕНИЕ(Перечисление.энргТипыЭтапов.ИсполнительнаяРабота)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаИсполительногоЛиста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Задача.Задача КАК Задача,
		|	ВТ_Задача.НачальникРОСП КАК НачальникРОСП,
		|	ВТ_Задача.АдресСтруктурногоПодразделенияФСПП КАК АдресСтруктурногоПодразделенияФСПП,
		|	ВТ_Задача.ДатаИсполительногоЛиста КАК ДатаИсполительногоЛиста,
		|	ВТ_Задача.НомерИсполнительногоЛиста КАК НомерИсполнительногоЛиста,
		|	ВТ_Задача.ВыданИсполнительныйЛист КАК ВыданИсполнительныйЛист,
		|	ВТ_Задача.НомерСудебногоДела КАК НомерСудебногоДела,
		|	ВТ_Задача.Дата КАК ДатаСудебногоДела,
		|	ВТ_Задача.ФизЛицо КАК Абонент,
		|	ВТ_Задача.бестФамилия КАК ФамилияАбонента,
		|	ВТ_Задача.бестИмя КАК ИмяАбонента,
		|	ВТ_Задача.бестОтчество КАК ОтчествоАбонента,
		|	ВТ_Задача.АдресОбъекта КАК АдресОбъекта,
		|	ВТ_Задача.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ВТ_Задача.Филиал КАК Филиал,
		|	ВТ_КонтактныеДанныеОрганизации.ТелефонОрганизации КАК ТелефонОрганизации,
		|	ВТ_КонтактныеДанныеОрганизации.НаименованиеБанкаПолучателя КАК НаименованиеБанкаПолучателя,
		|	ВТ_КонтактныеДанныеОрганизации.БИКБанкаПолучателя КАК БИКБанкаПолучателя,
		|	ВТ_КонтактныеДанныеОрганизации.СчетБанкаПолучателя КАК СчетБанкаПолучателя
		|ИЗ
		|	ВТ_Задача КАК ВТ_Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактныеДанныеОрганизации КАК ВТ_КонтактныеДанныеОрганизации
		|		ПО ВТ_Задача.Организация = ВТ_КонтактныеДанныеОрганизации.Организация";
	
	ТекДата = ТекущаяДатаСеанса();    
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("Задача", Задача);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КолПакет		 = РезультатЗапроса.Количество();
	
	Выборка	= РезультатЗапроса[КолПакет-1].Выбрать();
	ВыборкаСводноеДело = РезультатЗапроса[КолПакет-2].Выбрать();
	Если СтруктураДолга = Неопределено Тогда
		СтруктураДолга = Новый Структура;
	КонецЕсли;
	СуммаЗадолженности = Неопределено;
	СтруктураДолга.Свойство("СуммаОсновногоДолга", СуммаЗадолженности);
		
	Пока Выборка.Следующий() Цикл
		ШапкаПарам = Новый Структура("НачальникРОСП, АдресСтруктурногоПодразделенияФСПП, ВыданИсполнительныйЛист, АдресОбъекта, ТелефонОрганизации");
		ЗаполнитьЗначенияСвойств(ШапкаПарам, Выборка);
		
		ШапкаПарам.Вставить("СуммаЗадолженности", СуммаЗадолженности);
		ШапкаПарам.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		ШапкаПарам.Вставить("Пользователь1", ПараметрыСеанса.ТекущийПользователь);
		ШапкаПарам.Вставить("ДатаНомерИсполнительногоЛиста", "№" + Выборка.НомерИсполнительногоЛиста + " от " + Формат(Выборка.ДатаИсполительногоЛиста, "ДФ=dd.MM.yyyy"));
		ШапкаПарам.Вставить("ДатаНомерСудебногоДела", "№" + Выборка.НомерСудебногоДела + " от " + Формат(Выборка.ДатаСудебногоДела, "ДФ=dd.MM.yyyy"));
		
		// ФИО абонента
		Если ЗначениеЗаполнено(Выборка.ФамилияАбонента) Тогда
			АбонентФИОКраткое = Выборка.ФамилияАбонента + ?(ЗначениеЗаполнено(Выборка.ИмяАбонента), " " + Лев(Выборка.ИмяАбонента, 1) + ".", "") 
									+ ?(ЗначениеЗаполнено(Выборка.ОтчествоАбонента), " " + Лев(Выборка.ОтчествоАбонента, 1) + ".", "");
		Иначе
			АбонентФИОКраткое = Выборка.Абонент;
		КонецЕсли;
		ШапкаПарам.Вставить("АбонентФИОКраткое", АбонентФИОКраткое);
		
		БанковскиеРеквизитыОрг = Строка(Выборка.Филиал) + " на р/с " + Выборка.СчетБанкаПолучателя + ", БИК "
									+ Выборка.БИКБанкаПолучателя + ", " + Выборка.НаименованиеБанкаПолучателя;
		ШапкаПарам.Вставить("БанковскиеРеквизитыОрг", БанковскиеРеквизитыОрг);
		
		// Поиск сводного дела
		ВыборкаСводноеДело.Сбросить();
		Отбор 		= Новый Структура("Задача", Выборка.Задача);
		Если ВыборкаСводноеДело.НайтиСледующий(Отбор) Тогда 
			СводноеДело = "Прошу, приобщить исполнительное производство к сводному №" + ВыборкаСводноеДело.НомерИсполнительногоЛиста
				+ " от " + Формат(ВыборкаСводноеДело.ДатаИсполительногоЛиста, "ДФ=dd.MM.yyyy") + ", которое находится на исполнении в " 
				+ ВыборкаСводноеДело.СлужбаСудебныхПристовов; 
			ШапкаПарам.Вставить("СводноеДело", СводноеДело);
		Иначе
			ШапкаПарам.Вставить("СводноеДело", "");
		КонецЕсли;
		
		// получаем макет из объекта обработки
		СсылкаМакет = ПолучитьМакет("МакетЗаявлениеОВозбужденииИсполнительногоПроизводства");

		АдресХранилища = Новый УникальныйИдентификатор();
		ВременныйФайл = ПолучитьИмяВременногоФайла("doc"); 
		СсылкаМакет.Записать(ВременныйФайл);
		
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременныйФайл), АдресХранилища); 
		УдалитьФайлы(ВременныйФайл); 
		
		Возврат Новый Структура("АдресХранилища, ПараметрыШапки", Адрес, ШапкаПарам);
	КонецЦикла;
КонецФункции

Функция ПечатьВыпискиСЛицевогоСчета(Задача, НачПериод, КонПериод) Экспорт
	
	// Заполнение шапки выписки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.КлючПомещения КАК КлючПомещения,
		|	энргАбоненты.ФизЛицо КАК ФизЛицо,
		|	энргАбонентыКонтактнаяИнформация.Представление КАК АдресОбъекта
		|ПОМЕСТИТЬ ВТ_КлючПомещения
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
		|		ПО энргАбоненты.Ссылка = энргАбонентыКонтактнаяИнформация.Ссылка
		|			И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыконтактнойИнформации.АдресОбъекта))
		|ГДЕ
		|	энргАбоненты.Ссылка = &Абонент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)
		|				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбщаяПлощадь,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь)
		|				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЖилаяПлощадь,
		|	NULL КАК КоличествоЖильцов,
		|	NULL КАК ТипСобственности,
		|	NULL КАК СтатусСудебногоДела,
		|	NULL КАК КоличествоЛьготников,
		|	NULL КАК ФизЛицо,
		|	NULL КАК АдресОбъекта
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
		|			&ДатаЗаявки,
		|			КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючПомещения.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючПомещения КАК ВТ_КлючПомещения)
		|				И Организация = &Организация
		|				И Район = &Район
		|				И ВидПлощади В (ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь), ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь))) КАК энргЗначенияПлощадейСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	энргКоличествоПроживающихСрезПоследних.Количество,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
		|			&ДатаЗаявки,
		|			КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючПомещения.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючПомещения КАК ВТ_КлючПомещения)
		|				И Организация = &Организация
		|				И Район = &Район) КАК энргКоличествоПроживающихСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.энргТипСобственностиАбонентов.СрезПоследних(
		|			&ДатаЗаявки,
		|			КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючПомещения.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючПомещения КАК ВТ_КлючПомещения)
		|				И Организация = &Организация
		|				И Район = &Район) КАК энргТипСобственностиАбонентовСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	МАКСИМУМ(энргСтатусыСудебныхДелСрезПоследних.Статус),
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.энргСтатусыСудебныхДел.СрезПоследних(, СудебноеДело = &Ссылка) КАК энргСтатусыСудебныхДелСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргЖильцыЛьготныхКатегорийСрезПоследних.Жилец),
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.энргПроживаниеЖильцов.СрезПоследних(
		|			&ДатаЗаявки,
		|			КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_КлючПомещения.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_КлючПомещения КАК ВТ_КлючПомещения)
		|				И Организация = &Организация
		|				И Район = &Район) КАК энргПроживаниеЖильцовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(&ДатаЗаявки, ) КАК энргЖильцыЛьготныхКатегорийСрезПоследних
		|		ПО энргПроживаниеЖильцовСрезПоследних.Жилец = энргЖильцыЛьготныхКатегорийСрезПоследних.Жилец
		|ГДЕ
		|	энргПроживаниеЖильцовСрезПоследних.Состояние = ЗНАЧЕНИЕ(перечисление.энргСостояниеЖильцов.Регистрация)
		|	И энргЖильцыЛьготныхКатегорийСрезПоследних.Состояние
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ_КлючПомещения.ФизЛицо,
		|	ВТ_КлючПомещения.АдресОбъекта
		|ИЗ
		|	ВТ_КлючПомещения КАК ВТ_КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Данные.ОбщаяПлощадь) КАК ОбщаяПлощадь,
		|	МАКСИМУМ(ВТ_Данные.ЖилаяПлощадь) КАК ЖилаяПлощадь,
		|	МАКСИМУМ(ВТ_Данные.КоличествоЖильцов) КАК КоличествоЖильцов,
		|	МАКСИМУМ(ВТ_Данные.ТипСобственности) КАК ТипСобственности,
		|	МАКСИМУМ(ВТ_Данные.СтатусСудебногоДела) КАК СтатусСудебногоДела,
		|	МАКСИМУМ(ВТ_Данные.КоличествоЛьготников) КАК КоличествоЛьготников,
		|	МАКСИМУМ(ВТ_Данные.ФизЛицо) КАК ФизЛицо,
		|	МАКСИМУМ(ВТ_Данные.АдресОбъекта) КАК АдресОбъекта
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные";
	
	Запрос.УстановитьПараметр("Абонент",	 Задача.Абонент);
	Запрос.УстановитьПараметр("ДатаЗаявки",  Задача.Дата);
	Запрос.УстановитьПараметр("Организация", Задача.Организация);
	Запрос.УстановитьПараметр("Район",		 Задача.Район);
	Запрос.УстановитьПараметр("Ссылка",		 Задача.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	ВыводШапкиФилиала(ТабДок, Задача.Район);
	
	Макет		 = ПолучитьМакет("МакетВыпискаСЛицевогоСчета");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	Если Выборка.Следующий() Тогда 
		ОбластьШапка.Параметры.Заполнить(Выборка);
	КонецЕсли;
	ТабДок.Вывести(ОбластьШапка);
	
	//// Получение данных об тарифах и оплате
	//НачПериод = Задача.Дата;
	//КонПериод = Дата(1,1,1);
	//Для каждого СтрокаТЧ Из Задача.Начисления Цикл
	//	НачПериод = Мин(СтрокаТЧ.ДатаНачисления, НачПериод);
	//	КонПериод = Макс(СтрокаТЧ.ДатаНачисления, КонПериод);
	//КонецЦикла;

	НачПериод = НачалоМесяца(НачПериод);
	КонПериод = КонецМесяца(КонПериод);	
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТЧ_Начисления.Регистратор КАК Регистратор,
	//	|	ТЧ_Начисления.ПросроченнаяЗадолженность КАК ПросроченнаяЗадолженность,
	//	|	ТЧ_Начисления.ДатаНачисления КАК ДатаНачисления
	//	|ПОМЕСТИТЬ ВТ_ТЧ
	//	|ИЗ
	//	|	&ТЧ_Начисления КАК ТЧ_Начисления
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(энргВзаиморасчеты.Сумма) КАК Сумма
	//	|ПОМЕСТИТЬ ВТ_Оплачено
	//	|ИЗ
	//	|	РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
	//	|ГДЕ
	//	|	энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//	|	И энргВзаиморасчеты.Организация = &Организация
	//	|	И энргВзаиморасчеты.Район = &Район
	//	|	И энргВзаиморасчеты.Абонент = &Абонент
	//	|	И энргВзаиморасчеты.Период > &ДатаСудебки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	энргОбъемНачислений.Услуга КАК Услуга,
	//	|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
	//	|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
	//	|	энргОбъемНачислений.Сумма КАК Сумма,
	//	|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
	//	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	//	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	//	|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива
	//	|ПОМЕСТИТЬ ВТ_ОбъёмНачислений
	//	|ИЗ
	//	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	//	|ГДЕ
	//	|	энргОбъемНачислений.Организация = &Организация
	//	|	И энргОбъемНачислений.Район = &Район
	//	|	И энргОбъемНачислений.Абонент = &Абонент
	//	|	И энргОбъемНачислений.ПериодНачисления >= &НачПериод
	//	|	И энргОбъемНачислений.ПериодНачисления <= &КонПериод
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	НАЧАЛОПЕРИОДА(ВТ_ТЧ.ДатаНачисления, МЕСЯЦ) КАК ПериодНачисления,
	//	|	СУММА(ВТ_ТЧ.ПросроченнаяЗадолженность) КАК ПросроченнаяЗадолженность
	//	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоМесяцам
	//	|ИЗ
	//	|	ВТ_ТЧ КАК ВТ_ТЧ
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	НАЧАЛОПЕРИОДА(ВТ_ТЧ.ДатаНачисления, МЕСЯЦ)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ЗадолженностьПоМесяцам.ПериодНачисления КАК ПериодНачисления,
	//	|	СУММА(ВТ_ЗадолженностьПоМесяцам1.ПросроченнаяЗадолженность) КАК НакопленнаяЗадолженность,
	//	|	ВТ_ЗадолженностьПоМесяцам.ПросроченнаяЗадолженность КАК ЗадолженностьЗаМесяц
	//	|ПОМЕСТИТЬ В_НакопительнаяЗадолженность
	//	|ИЗ
	//	|	ВТ_ЗадолженностьПоМесяцам КАК ВТ_ЗадолженностьПоМесяцам
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадолженностьПоМесяцам КАК ВТ_ЗадолженностьПоМесяцам1
	//	|		ПО ВТ_ЗадолженностьПоМесяцам.ПериодНачисления >= ВТ_ЗадолженностьПоМесяцам1.ПериодНачисления
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ЗадолженностьПоМесяцам.ПериодНачисления,
	//	|	ВТ_ЗадолженностьПоМесяцам.ПросроченнаяЗадолженность
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	В_НакопительнаяЗадолженность.ПериодНачисления КАК Месяц,
	//	|	В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц КАК ПросроченнаяЗадолженность,
	//	|	ВЫБОР
	//	|		КОГДА ВТ_Оплачено.Сумма ЕСТЬ NULL
	//	|			ТОГДА 0
	//	|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность < ВТ_Оплачено.Сумма
	//	|			ТОГДА В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
	//	|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - ВТ_Оплачено.Сумма < В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
	//	|			ТОГДА ВТ_Оплачено.Сумма - (В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц)
	//	|		ИНАЧЕ 0
	//	|	КОНЕЦ КАК Оплачено,
	//	|	ВЫБОР
	//	|		КОГДА ВТ_Оплачено.Сумма ЕСТЬ NULL
	//	|			ТОГДА В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
	//	|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность < ВТ_Оплачено.Сумма
	//	|			ТОГДА 0
	//	|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - ВТ_Оплачено.Сумма < В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
	//	|			ТОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - ВТ_Оплачено.Сумма
	//	|		ИНАЧЕ В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
	//	|	КОНЕЦ КАК ИсхСальдо
	//	|ПОМЕСТИТЬ ВТ_ОплатаПоМесяцам
	//	|ИЗ
	//	|	В_НакопительнаяЗадолженность КАК В_НакопительнаяЗадолженность,
	//	|	ВТ_Оплачено КАК ВТ_Оплачено
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	НАЧАЛОПЕРИОДА(ВТ_ОбъёмНачислений.ПериодНачисления, МЕСЯЦ) КАК Месяц,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ВТ_ОбъёмНачислений.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)
	//	|				ТОГДА ВТ_ОбъёмНачислений.Сумма
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК Перерасчеты,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ВТ_ОбъёмНачислений.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)
	//	|				ТОГДА 0
	//	|			ИНАЧЕ ВТ_ОбъёмНачислений.Сумма
	//	|		КОНЕЦ) КАК Начислено,
	//	|	СУММА(ВТ_ОбъёмНачислений.Сумма) КАК ИтогоНачислено
	//	|ПОМЕСТИТЬ ВТ_НачисленияЗаМесяц
	//	|ИЗ
	//	|	ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	НАЧАЛОПЕРИОДА(ВТ_ОбъёмНачислений.ПериодНачисления, МЕСЯЦ)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) КАК СуммаОстаток
	//	|ПОМЕСТИТЬ ВТ_НачСальдо
	//	|ИЗ
	//	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки КАК энргВзаиморасчетыПоМесяцамОстатки
	//	|ГДЕ
	//	|	энргВзаиморасчетыПоМесяцамОстатки.Организация = &Организация
	//	|	И энргВзаиморасчетыПоМесяцамОстатки.Район = &Район
	//	|	И энргВзаиморасчетыПоМесяцамОстатки.Абонент = &Абонент
	//	|	И энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления < &НачПериод
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления КАК ПериодНачисления,
	//	|	СУММА(энргВзаиморасчетыПоМесяцамОбороты.СуммаОборот) КАК Оплаты
	//	|ПОМЕСТИТЬ ВТ_Оплаты
	//	|ИЗ
	//	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Обороты КАК энргВзаиморасчетыПоМесяцамОбороты
	//	|ГДЕ
	//	|	энргВзаиморасчетыПоМесяцамОбороты.Организация = &Организация
	//	|	И энргВзаиморасчетыПоМесяцамОбороты.Район = &Район
	//	|	И энргВзаиморасчетыПоМесяцамОбороты.Абонент = &Абонент
	//	|	И энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления >= &НачПериод
	//	|	И энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления <= &КонПериод
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	энргВзаиморасчетыПоМесяцамОбороты.ПериодНачисления
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ОбъёмНачислений.Услуга КАК Услуга,
	//	|	НАЧАЛОПЕРИОДА(ВТ_ОбъёмНачислений.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	//	|	МАКСИМУМ(ВТ_ОбъёмНачислений.ЗначениеТарифа) КАК ЗначениеТарифа,
	//	|	МАКСИМУМ(ВТ_ОбъёмНачислений.НормаПотребления) КАК НормаПотребления,
	//	|	ВТ_ОбъёмНачислений.Услуга.ЕдиницаИзмерения КАК ЕдИзм
	//	|ИЗ
	//	|	ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений
	//	|ГДЕ
	//	|	НЕ ВТ_ОбъёмНачислений.СверхНорматива
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ОбъёмНачислений.Услуга,
	//	|	НАЧАЛОПЕРИОДА(ВТ_ОбъёмНачислений.ПериодНачисления, МЕСЯЦ),
	//	|	ВТ_ОбъёмНачислений.Услуга.ЕдиницаИзмерения
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Услуга,
	//	|	ПериодНачисления
	//	|ИТОГИ
	//	|	МАКСИМУМ(ЕдИзм)
	//	|ПО
	//	|	Услуга
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЕСТЬNULL(ВТ_НачСальдо.СуммаОстаток, 0) КАК ИсхСальдо,
	//	|	ВТ_НачисленияЗаМесяц.ИтогоНачислено - ЕСТЬNULL(ВТ_Оплаты.Оплаты, 0) КАК Оплачено,
	//	|	ВТ_НачисленияЗаМесяц.Месяц КАК Месяц,
	//	|	ВТ_НачисленияЗаМесяц.Перерасчеты КАК Перерасчеты,
	//	|	ВТ_НачисленияЗаМесяц.Начислено КАК Начислено,
	//	|	ВТ_НачисленияЗаМесяц.ИтогоНачислено КАК ИтогоНачислено
	//	|ИЗ
	//	|	ВТ_НачисленияЗаМесяц КАК ВТ_НачисленияЗаМесяц
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оплаты КАК ВТ_Оплаты
	//	|		ПО ВТ_НачисленияЗаМесяц.Месяц = ВТ_Оплаты.ПериодНачисления
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачСальдо КАК ВТ_НачСальдо
	//	|		ПО (ИСТИНА)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Месяц
	//	|ИТОГИ
	//	|	МАКСИМУМ(ИсхСальдо),
	//	|	СУММА(Оплачено),
	//	|	СУММА(Перерасчеты),
	//	|	СУММА(Начислено),
	//	|	СУММА(ИтогоНачислено)
	//	|ПО
	//	|	ОБЩИЕ,
	//	|	Месяц";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДНачисления.Регистратор КАК Регистратор,
		|	энргЗадачаПИДНачисления.ПросроченнаяЗадолженность КАК ПросроченнаяЗадолженность,
		|	энргЗадачаПИДНачисления.ДатаНачисления КАК ДатаНачисления
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	Задача.энргЗадачаПИД.Начисления КАК энргЗадачаПИДНачисления
		|ГДЕ
		|	энргЗадачаПИДНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	ВложенныйЗапрос.Месяц КАК Месяц,
		|	ВложенныйЗапрос.Услуга КАК Услуга,
		|	ВложенныйЗапрос.Основ КАК Основ
		|ПОМЕСТИТЬ ВТ_Оплачено
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(энргВзаиморасчетыПоМесяцам.Сумма) КАК Сумма,
		|		НАЧАЛОПЕРИОДА(энргВзаиморасчетыПоМесяцам.ПериодНачисления, МЕСЯЦ) КАК Месяц,
		|		энргВзаиморасчетыПоМесяцам.Услуга КАК Услуга,
		|		ИСТИНА КАК Основ
		|	ИЗ
		|		РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
		|	ГДЕ
		|		энргВзаиморасчетыПоМесяцам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И энргВзаиморасчетыПоМесяцам.Организация = &Организация
		|		И энргВзаиморасчетыПоМесяцам.Район = &Район
		|		И энргВзаиморасчетыПоМесяцам.Абонент = &Абонент
		|		И энргВзаиморасчетыПоМесяцам.Период <= &ТекущаяДата
		|		И НЕ энргВзаиморасчетыПоМесяцам.Регистратор ССЫЛКА Документ.энргБанкротство
		|		И НЕ энргВзаиморасчетыПоМесяцам.Регистратор ССЫЛКА Документ.энргСоглашениеПоРассрочке
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НАЧАЛОПЕРИОДА(энргВзаиморасчетыПоМесяцам.ПериодНачисления, МЕСЯЦ),
		|		энргВзаиморасчетыПоМесяцам.Услуга
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(энргЗабалансоваяЗадолженность.СуммаЗадолженности),
		|		НАЧАЛОПЕРИОДА(энргЗабалансоваяЗадолженность.ПериодНачисления, МЕСЯЦ),
		|		энргЗабалансоваяЗадолженность.Услуга,
		|		ЛОЖЬ
		|	ИЗ
		|		РегистрНакопления.энргЗабалансоваяЗадолженность КАК энргЗабалансоваяЗадолженность
		|	ГДЕ
		|		энргЗабалансоваяЗадолженность.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И энргЗабалансоваяЗадолженность.Организация = &Организация
		|		И энргЗабалансоваяЗадолженность.Район = &Район
		|		И энргЗабалансоваяЗадолженность.Абонент = &Абонент
		|		И энргЗабалансоваяЗадолженность.Период <= &ТекущаяДата
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НАЧАЛОПЕРИОДА(энргЗабалансоваяЗадолженность.ПериодНачисления, МЕСЯЦ),
		|		энргЗабалансоваяЗадолженность.Услуга) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Месяц,
		|	ВложенныйЗапрос.Услуга,
		|	ВложенныйЗапрос.Основ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗабалансоваяЗадолженностьОбороты.Период КАК Период,
		|	энргЗабалансоваяЗадолженностьОбороты.Абонент КАК Абонент,
		|	НАЧАЛОПЕРИОДА(энргЗабалансоваяЗадолженностьОбороты.ПериодНачисления, МЕСЯЦ) КАК Месяц,
		|	энргЗабалансоваяЗадолженностьОбороты.Услуга КАК Услуга,
		|	СУММА(энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиРасход) КАК Сумма,
		|	энргЗабалансоваяЗадолженностьОбороты.ВидЗадолженности КАК ВидЗадолженности,
		|	энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиПриход КАК СуммаПриход
		|ПОМЕСТИТЬ ЗабалансовыеСуммы
		|ИЗ
		|	РегистрНакопления.энргЗабалансоваяЗадолженность.Обороты(
		|			,
		|			&ТекущаяДата,
		|			День,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))) КАК энргЗабалансоваяЗадолженностьОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗабалансоваяЗадолженностьОбороты.Услуга,
		|	НАЧАЛОПЕРИОДА(энргЗабалансоваяЗадолженностьОбороты.ПериодНачисления, МЕСЯЦ),
		|	энргЗабалансоваяЗадолженностьОбороты.ВидЗадолженности,
		|	энргЗабалансоваяЗадолженностьОбороты.Абонент,
		|	энргЗабалансоваяЗадолженностьОбороты.Период,
		|	энргЗабалансоваяЗадолженностьОбороты.СуммаЗадолженностиПриход
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗабалансовыеСуммы.Месяц КАК Месяц,
		|	ЗабалансовыеСуммы.Услуга КАК Услуга,
		|	МАКСИМУМ(ЗабалансовыеСуммы.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность)) КАК Морат,
		|	МАКСИМУМ(ЗабалансовыеСуммы.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность)) КАК Рест
		|ПОМЕСТИТЬ ВТ_МораторнРест
		|ИЗ
		|	ЗабалансовыеСуммы КАК ЗабалансовыеСуммы
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗабалансовыеСуммы.Месяц,
		|	ЗабалансовыеСуммы.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргОбъемНачислений.Услуга КАК Услуга,
		|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
		|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
		|	энргОбъемНачислений.Сумма КАК Сумма,
		|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
		|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
		|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
		|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
		|	энргОбъемНачислений.Поставщик КАК Поставщик,
		|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства
		|ПОМЕСТИТЬ ВТ_ОбъёмНачислений
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.Организация = &Организация
		|	И энргОбъемНачислений.Район = &Район
		|	И энргОбъемНачислений.Абонент = &Абонент
		|	И энргОбъемНачислений.ПериодНачисления >= &НачПериод
		|	И энргОбъемНачислений.ПериодНачисления <= &КонПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияТарифов.Услуга КАК Услуга,
		|	энргЗначенияТарифов.Поставщик КАК Поставщик,
		|	МАКСИМУМ(ВЫРАЗИТЬ(энргЗначенияТарифов.Регистратор КАК Документ.энргУстановитьЗначениеТарифа).ДокументОснование) КАК Обоснование,
		|	энргЗначенияТарифов.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ЗначенияТарифов
		|ИЗ
		|	РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
		|ГДЕ
		|	энргЗначенияТарифов.Организация = &Организация
		|	И энргЗначенияТарифов.Район = &Район
		|	И энргЗначенияТарифов.Услуга В
		|			(ВЫБРАТЬ
		|				ВТ_ОбъёмНачислений.Услуга
		|			ИЗ
		|				ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений)
		|	И энргЗначенияТарифов.Поставщик В
		|			(ВЫБРАТЬ
		|				ВТ_ОбъёмНачислений.Поставщик
		|			ИЗ
		|				ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений)
		|	И энргЗначенияТарифов.Период МЕЖДУ &НачГод И &КонГода
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗначенияТарифов.Услуга,
		|	энргЗначенияТарифов.Поставщик,
		|	энргЗначенияТарифов.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргЗначенияТарифовСрезПоследних.Услуга,
		|	энргЗначенияТарифовСрезПоследних.Поставщик,
		|	МАКСИМУМ(ВЫРАЗИТЬ(энргЗначенияТарифовСрезПоследних.Регистратор КАК Документ.энргУстановитьЗначениеТарифа).ДокументОснование),
		|	энргЗначенияТарифовСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
		|			&КонГода,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Услуга В
		|					(ВЫБРАТЬ
		|						ВТ_ОбъёмНачислений.Услуга
		|					ИЗ
		|						ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений)
		|				И Поставщик В
		|					(ВЫБРАТЬ
		|						ВТ_ОбъёмНачислений.Поставщик
		|					ИЗ
		|						ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений)) КАК энргЗначенияТарифовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗначенияТарифовСрезПоследних.Услуга,
		|	энргЗначенияТарифовСрезПоследних.Поставщик,
		|	энргЗначенияТарифовСрезПоследних.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗначенияТарифов.Услуга КАК Услуга,
		|	ВТ_ЗначенияТарифов.Поставщик КАК Поставщик,
		|	ВТ_ЗначенияТарифов.Обоснование КАК Обоснование,
		|	ВТ_ЗначенияТарифов.Период КАК ПериодНачало,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА энргЗначенияТарифов.Период ЕСТЬ NULL
		|				ТОГДА &КонГода
		|			ИНАЧЕ ДОБАВИТЬКДАТЕ(энргЗначенияТарифов.Период, ДЕНЬ, -1)
		|		КОНЕЦ) КАК ПериодЗавершение
		|ПОМЕСТИТЬ ВТ_ЗначенияТарифов_БудущаяДата
		|ИЗ
		|	ВТ_ЗначенияТарифов КАК ВТ_ЗначенияТарифов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
		|		ПО (энргЗначенияТарифов.Организация = &Организация)
		|			И (энргЗначенияТарифов.Район = &Район)
		|			И ВТ_ЗначенияТарифов.Услуга = энргЗначенияТарифов.Услуга
		|			И ВТ_ЗначенияТарифов.Поставщик = энргЗначенияТарифов.Поставщик
		|			И ВТ_ЗначенияТарифов.Период < энргЗначенияТарифов.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗначенияТарифов.Услуга,
		|	ВТ_ЗначенияТарифов.Поставщик,
		|	ВТ_ЗначенияТарифов.Обоснование,
		|	ВТ_ЗначенияТарифов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргКлючиНормативов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_КлючиНормативов
		|ИЗ
		|	Справочник.энргКлючиНормативов КАК энргКлючиНормативов
		|ГДЕ
		|	(энргКлючиНормативов.ВидБлагоустройства В
		|				(ВЫБРАТЬ
		|					ВТ_ОбъёмНачислений.ВидБлагоустройства
		|				ИЗ
		|					ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений)
		|			ИЛИ энргКлючиНормативов.ВидБлагоустройства = ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка))
		|	И НЕ энргКлючиНормативов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
		|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива.ВидБлагоустройства КАК ВидБлагоустройства,
		|	МАКСИМУМ(ВЫРАЗИТЬ(энргЗначенияНормативовПотребленияСрезПоследних.Регистратор КАК Документ.энргУстановитьНормуПотребленияПоУслуге).ДокументОснование) КАК Обоснование
		|ПОМЕСТИТЬ ВТ_ЗначенияНормативов
		|ИЗ
		|	РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючНорматива В
		|					(ВЫБРАТЬ
		|						ВТ_КлючиНормативов.Ссылка
		|					ИЗ
		|						ВТ_КлючиНормативов КАК ВТ_КлючиНормативов)
		|				И Услуга В
		|					(ВЫБРАТЬ
		|						ВТ_ОбъёмНачислений.Услуга
		|					ИЗ
		|						ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений)) КАК энргЗначенияНормативовПотребленияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива.ВидБлагоустройства,
		|	энргЗначенияНормативовПотребленияСрезПоследних.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ВТ_ТЧ.ДатаНачисления, МЕСЯЦ) КАК ПериодНачисления,
		|	СУММА(ВТ_ТЧ.ПросроченнаяЗадолженность) КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ВТ_ЗадолженностьПоМесяцам
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВТ_ТЧ.ДатаНачисления, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадолженностьПоМесяцам.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(ВТ_ЗадолженностьПоМесяцам1.ПросроченнаяЗадолженность) КАК НакопленнаяЗадолженность,
		|	ВТ_ЗадолженностьПоМесяцам.ПросроченнаяЗадолженность КАК ЗадолженностьЗаМесяц
		|ПОМЕСТИТЬ В_НакопительнаяЗадолженность
		|ИЗ
		|	ВТ_ЗадолженностьПоМесяцам КАК ВТ_ЗадолженностьПоМесяцам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадолженностьПоМесяцам КАК ВТ_ЗадолженностьПоМесяцам1
		|		ПО ВТ_ЗадолженностьПоМесяцам.ПериодНачисления >= ВТ_ЗадолженностьПоМесяцам1.ПериодНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗадолженностьПоМесяцам.ПериодНачисления,
		|	ВТ_ЗадолженностьПоМесяцам.ПросроченнаяЗадолженность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	В_НакопительнаяЗадолженность.ПериодНачисления КАК Месяц,
		|	В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц КАК ПросроченнаяЗадолженность,
		|	ВЫБОР
		|		КОГДА ВТ_Оплачено.Сумма ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность < ВТ_Оплачено.Сумма
		|			ТОГДА В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
		|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - ВТ_Оплачено.Сумма < В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
		|			ТОГДА ВТ_Оплачено.Сумма - (В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Оплачено,
		|	ВЫБОР
		|		КОГДА ВТ_Оплачено.Сумма ЕСТЬ NULL
		|			ТОГДА В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
		|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность < ВТ_Оплачено.Сумма
		|			ТОГДА 0
		|		КОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - ВТ_Оплачено.Сумма < В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
		|			ТОГДА В_НакопительнаяЗадолженность.НакопленнаяЗадолженность - ВТ_Оплачено.Сумма
		|		ИНАЧЕ В_НакопительнаяЗадолженность.ЗадолженностьЗаМесяц
		|	КОНЕЦ КАК ИсхСальдо
		|ПОМЕСТИТЬ ВТ_ОплатаПоМесяцам
		|ИЗ
		|	В_НакопительнаяЗадолженность КАК В_НакопительнаяЗадолженность,
		|	ВТ_Оплачено КАК ВТ_Оплачено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ВТ_ОбъёмНачислений.ПериодНачисления, МЕСЯЦ) КАК Месяц,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_ОбъёмНачислений.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)
		|				ТОГДА ВТ_ОбъёмНачислений.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Перерасчеты,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_ОбъёмНачислений.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет)
		|				ТОГДА 0
		|			ИНАЧЕ ВТ_ОбъёмНачислений.Сумма
		|		КОНЕЦ) КАК Начислено,
		|	СУММА(ВТ_ОбъёмНачислений.Сумма) КАК ИтогоНачислено,
		|	ВТ_ОбъёмНачислений.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВТ_НачисленияЗаМесяц
		|ИЗ
		|	ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВТ_ОбъёмНачислений.ПериодНачисления, МЕСЯЦ),
		|	ВТ_ОбъёмНачислений.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбъёмНачислений.Услуга КАК Услуга,
		|	ВТ_ЗначенияТарифов_БудущаяДата.ПериодНачало КАК ПериодНачисления,
		|	МАКСИМУМ(ВТ_ОбъёмНачислений.ЗначениеТарифа) КАК ЗначениеТарифа,
		|	МАКСИМУМ(ВТ_ОбъёмНачислений.НормаПотребления) КАК НормаПотребления,
		|	ВТ_ОбъёмНачислений.Услуга.ЕдиницаИзмерения КАК ЕдИзм,
		|	МАКСИМУМ(ЕСТЬNULL(ВТ_ЗначенияНормативов.Обоснование, """")) КАК ОбоснованиеНорма,
		|	МАКСИМУМ(ЕСТЬNULL(ВТ_ЗначенияТарифов_БудущаяДата.Обоснование, """")) КАК ОбоснованиеТариф,
		|	ВТ_ЗначенияТарифов_БудущаяДата.ПериодЗавершение КАК ПериодЗавершение
		|ИЗ
		|	ВТ_ОбъёмНачислений КАК ВТ_ОбъёмНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияТарифов_БудущаяДата КАК ВТ_ЗначенияТарифов_БудущаяДата
		|		ПО ВТ_ОбъёмНачислений.Услуга = ВТ_ЗначенияТарифов_БудущаяДата.Услуга
		|			И ВТ_ОбъёмНачислений.Поставщик = ВТ_ЗначенияТарифов_БудущаяДата.Поставщик
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияНормативов КАК ВТ_ЗначенияНормативов
		|		ПО ВТ_ОбъёмНачислений.Услуга = ВТ_ЗначенияНормативов.Услуга
		|			И (ВТ_ОбъёмНачислений.ВидБлагоустройства = ВТ_ЗначенияНормативов.ВидБлагоустройства
		|				ИЛИ ВТ_ЗначенияНормативов.ВидБлагоустройства = ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка))
		|ГДЕ
		|	НЕ ВТ_ОбъёмНачислений.СверхНорматива
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбъёмНачислений.Услуга,
		|	ВТ_ОбъёмНачислений.Услуга.ЕдиницаИзмерения,
		|	ВТ_ЗначенияТарифов_БудущаяДата.ПериодЗавершение,
		|	ВТ_ЗначенияТарифов_БудущаяДата.ПериодНачало
		|
		|УПОРЯДОЧИТЬ ПО
		|	Услуга,
		|	ПериодНачисления
		|ИТОГИ
		|	МАКСИМУМ(ЕдИзм),
		|	МАКСИМУМ(ОбоснованиеНорма)
		|ПО
		|	Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НачисленияЗаМесяц.Месяц КАК Месяц,
		|	ВТ_НачисленияЗаМесяц.Услуга КАК Услуга,
		|	ВТ_НачисленияЗаМесяц.Перерасчеты КАК Перерасчеты,
		|	ВТ_НачисленияЗаМесяц.Начислено КАК Начислено,
		|	ВТ_НачисленияЗаМесяц.ИтогоНачислено КАК ИтогоНачислено,
		|	ЕСТЬNULL(ВТ_Оплачено.Сумма, 0) КАК Оплачено,
		|	ЕСТЬNULL(ВТ_МораторнРест.Морат, ЛОЖЬ) КАК Мораторная,
		|	ЕСТЬNULL(ВТ_МораторнРест.Рест, ЛОЖЬ) КАК Реструкт,
		|	ЕСТЬNULL(ВТ_Оплачено.Основ, ЛОЖЬ) КАК Основ
		|ИЗ
		|	ВТ_НачисленияЗаМесяц КАК ВТ_НачисленияЗаМесяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оплачено КАК ВТ_Оплачено
		|		ПО ВТ_НачисленияЗаМесяц.Месяц = ВТ_Оплачено.Месяц
		|			И ВТ_НачисленияЗаМесяц.Услуга = ВТ_Оплачено.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МораторнРест КАК ВТ_МораторнРест
		|		ПО ВТ_НачисленияЗаМесяц.Месяц = ВТ_МораторнРест.Месяц
		|			И ВТ_НачисленияЗаМесяц.Услуга = ВТ_МораторнРест.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц,
		|	Услуга
		|ИТОГИ
		|	СУММА(Перерасчеты),
		|	СУММА(Начислено),
		|	СУММА(ИтогоНачислено),
		|	МАКСИМУМ(Мораторная)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Абонент",		Задача.Абонент);
	Запрос.УстановитьПараметр("Организация",	Задача.Организация);
	Запрос.УстановитьПараметр("Район",			Задача.Район);
	Запрос.УстановитьПараметр("ДатаСудебки",	Задача.ДатаУчётаНачислений);
	Запрос.УстановитьПараметр("КонПериод",		КонПериод);
	Запрос.УстановитьПараметр("НачПериод",		НачПериод);
	Запрос.УстановитьПараметр("Ссылка",			Задача.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата",	ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("КонГода",		КонецГода(КонПериод));
	Запрос.УстановитьПараметр("НачГод",			НачалоГода(НачПериод));
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	КолЗапросов		 = РезультатЗапроса.Количество();
	
	// Вывод тарифов услуг
	ВыборкаУслуга = РезультатЗапроса[КолЗапросов-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуга.Следующий() Цикл
		Выборка = ВыборкаУслуга.Выбрать();
		
		ОбластьУслуга = Макет.ПолучитьОбласть("Услуга");
		ОбластьУслуга.Параметры.Услуга = НРег(ВыборкаУслуга.Услуга);
		ОбластьУслуга.Параметры.ЕдИзм  = ВыборкаУслуга.ЕдИзм;
		Если ЗначениеЗаполнено(ВыборкаУслуга.ОбоснованиеНорма) Тогда
			ОбластьУслуга.Параметры.ОбоснованиеНорма  = "(" + ВыборкаУслуга.ОбоснованиеНорма + ")";
		Иначе
			ОбластьУслуга.Параметры.ОбоснованиеНорма = "";
		КонецЕсли;
		НормаПотребления = 0;
		Пока Выборка.Следующий() Цикл
			НормаПотребления = Выборка.НормаПотребления;
		КонецЦикла;
		ОбластьУслуга.Параметры.НормаПотребления = НормаПотребления;
		ТабДок.Вывести(ОбластьУслуга);
		
		Выборка.Сбросить();
		Сч = 1;
		ТекТариф = Неопределено;
		Пока Выборка.Следующий() Цикл
			//Если ТекТариф = Неопределено Или ТекТариф <> Выборка.ЗначениеТарифа Тогда
				ОбластьСтрокаТариф = Макет.ПолучитьОбласть("СтрокаТариф");
				ОбластьСтрокаТариф.Параметры.Заполнить(Выборка);
				ОбластьСтрокаТариф.Параметры.НомерСтроки = Сч;
				//ОбластьСтрокаТариф.Параметры.ПериодНачисления = НРег(Формат(Выборка.ПериодНачисления, "ДФ='ММММ гггг'")) + " - " + ?(Выборка.ПериодЗавершение = "настоящее время", Выборка.ПериодЗавершение, НРег(Формат(Выборка.ПериодЗавершение, "ДФ='ММММ гггг'")));
				ОбластьСтрокаТариф.Параметры.ПериодНачисления = НРег(Формат(Выборка.ПериодНачисления, "ДФ=dd.MM.yyyy")) + " - " + НРег(Формат(Выборка.ПериодЗавершение, "ДФ=dd.MM.yyyy"));
				
				Если ЗначениеЗаполнено(Выборка.ОбоснованиеТариф) Тогда
					ОбластьСтрокаТариф.Параметры.ОбоснованиеТариф  = "(" + Выборка.ОбоснованиеТариф + ")";
				Иначе
					ОбластьСтрокаТариф.Параметры.ОбоснованиеТариф = "";
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьСтрокаТариф);
				
				ТекТариф = Выборка.ЗначениеТарифа;
				Сч = Сч + 1;
			//КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Вывод сумм
	ВыборкаИтог = РезультатЗапроса[КолЗапросов-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Пока ВыборкаИтог.Следующий() Цикл
		Выборка = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		СоответствиеСумм = Новый Соответствие;
		
		Пока Выборка.Следующий() Цикл
			
			ТекСальдо = СоответствиеСумм.Получить(Выборка.Услуга);
			Если ТекСальдо = Неопределено Тогда
				ТекСальдо = 0;
				СоответствиеСумм.Вставить(Выборка.Услуга, 0);
			КонецЕсли;
			
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьСтрокаТаблицы.Параметры.Заполнить(Выборка);
			
			//ОбластьСтрокаТаблицы.Параметры.ВхСальдо = ВхСальдо;
			//ВхСальдо = ВхСальдо + ОбластьСтрокаТаблицы.Параметры.ИтогоНачислено - ОбластьСтрокаТаблицы.Параметры.Оплачено;
			//ОбластьСтрокаТаблицы.Параметры.ИсхСальдо = ВхСальдо;
			
			ОбластьСтрокаТаблицы.Параметры.ВхСальдо = ТекСальдо;
			ТекСальдо = ТекСальдо + ОбластьСтрокаТаблицы.Параметры.ИтогоНачислено - ОбластьСтрокаТаблицы.Параметры.Оплачено;
			//ВхСальдо = ВхСальдо + ТекСальдо;
			ОбластьСтрокаТаблицы.Параметры.ИсхСальдо = ТекСальдо;
			
			ВидЗадолженности = "";
			
			//ВидЗадолженности = ?(Выборка.Основ, "текущ", "");
			//ВидЗадолженности = ?(Выборка.Мораторная, ВидЗадолженности + ?(ВидЗадолженности = "", "", ", ") + "мораторн", ВидЗадолженности);
			//ВидЗадолженности = ?(Выборка.Реструкт, ВидЗадолженности + ?(ВидЗадолженности = "", "", ", ") + "реструктур", ВидЗадолженности);
			
			Если Выборка.Мораторная И Выборка.Реструкт Тогда
				ВидЗадолженности = "мораторн, реструктур";
			ИначеЕсли Выборка.Мораторная Тогда
				ВидЗадолженности = "мораторн";
			ИначеЕсли Выборка.Реструкт Тогда
				ВидЗадолженности = "реструктур";
			Иначе
				ВидЗадолженности = ?(ВыборкаИтог.Мораторная, "текущ", "просроч");
			КонецЕсли;
			ОбластьСтрокаТаблицы.Параметры.ВидЗадолженности = ВидЗадолженности;
			
			ТабДок.Вывести(ОбластьСтрокаТаблицы);
			
			СоответствиеСумм.Вставить(Выборка.Услуга, ТекСальдо);
			
		КонецЦикла;
		
		ВхСальдо = 0;
		Для каждого Строка Из СоответствиеСумм Цикл
			ВхСальдо = ВхСальдо + Строка.Значение;
		КонецЦикла;
		
		ОбластьИтогТаблицы = Макет.ПолучитьОбласть("ИтогоТаблицы");
		ОбластьИтогТаблицы.Параметры.Заполнить(ВыборкаИтог);
		ОбластьИтогТаблицы.Параметры.ИсхСальдо = ВхСальдо;
		ТабДок.Вывести(ОбластьИтогТаблицы);
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции

#Конецобласти

Функция ЕстьСобытияПоЗадаче(Задача) Экспорт

	Если Не ЗначениеЗаполнено(Задача) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргСобытия.ТипСобытия КАК СпособСвязи,
		|	энргСобытия.Период КАК ДатаОтправки,
		|	ВЫБОР
		|		КОГДА энргСобытия.Успех
		|			ТОГДА ""Отправлено""
		|		ИНАЧЕ энргСобытия.Результат
		|	КОНЕЦ КАК Комментарий,
		|	энргСобытия.Регистратор КАК Регистратор,
		|	энргСобытия.Период КАК ДатаПолучения
		|ИЗ
		|	РегистрСведений.энргСобытия КАК энргСобытия
		|ГДЕ
		|	энргСобытия.Основание = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") И Параметры.Ключ.ЗадачаЮЛ Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма 		 = "ФормаЗадачиЮЛ";
		ИначеЕсли Параметры.Свойство("Ключ") И Параметры.Ключ.ЗадачаНапоминание Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма 		 = "ФормаНапоминания";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбъединитьЗадачиНаСервере(СписокЗадач, Задача) Экспорт

	Если Ложь Тогда
		СписокЗадач = Новый СписокЗначений;
		Задача	 	= Задачи.энргЗадачаПИД.НайтиПоНаименованию("");
	КонецЕсли;
	
	НачатьТранзакцию();
	ОбъектЗадача = Задача.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДПланПогашенияЗадолженности.Дата КАК Дата,
		|	СУММА(энргЗадачаПИДПланПогашенияЗадолженности.Сумма) КАК Сумма
		|ИЗ
		|	Задача.энргЗадачаПИД.ПланПогашенияЗадолженности КАК энргЗадачаПИДПланПогашенияЗадолженности
		|ГДЕ
		|	энргЗадачаПИДПланПогашенияЗадолженности.Ссылка В(&СписокЗадач)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗадачаПИДПланПогашенияЗадолженности.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДНачисления.Регистратор КАК Регистратор,
		|	СУММА(энргЗадачаПИДНачисления.ПросроченнаяЗадолженность) КАК ПросроченнаяЗадолженность,
		|	энргЗадачаПИДНачисления.ДатаНачисления КАК ДатаНачисления
		|ИЗ
		|	Задача.энргЗадачаПИД.Начисления КАК энргЗадачаПИДНачисления
		|ГДЕ
		|	энргЗадачаПИДНачисления.Ссылка В(&СписокЗадач)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗадачаПИДНачисления.Регистратор,
		|	энргЗадачаПИДНачисления.ДатаНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДСудебныеИнстанции.СудебнаяИинстанция КАК СудебнаяИинстанция,
		|	ЛОЖЬ КАК Текущая,
		|	энргЗадачаПИДСудебныеИнстанции.Событие КАК Событие,
		|	энргЗадачаПИДСудебныеИнстанции.Судья КАК Судья,
		|	энргЗадачаПИДСудебныеИнстанции.Статус КАК Статус,
		|	энргЗадачаПИДСудебныеИнстанции.Срок КАК Срок,
		|	энргЗадачаПИДСудебныеИнстанции.Номер КАК Номер,
		|	энргЗадачаПИДСудебныеИнстанции.Дата КАК Дата,
		|	энргЗадачаПИДСудебныеИнстанции.СтатусИнстанции КАК СтатусИнстанции,
		|	энргЗадачаПИДСудебныеИнстанции.ОсновнойДолг КАК ОсновнойДолг,
		|	энргЗадачаПИДСудебныеИнстанции.Пени КАК Пени,
		|	энргЗадачаПИДСудебныеИнстанции.Госпошлина КАК Госпошлина,
		|	энргЗадачаПИДСудебныеИнстанции.СтатусУтверждения КАК СтатусУтверждения,
		|	энргЗадачаПИДСудебныеИнстанции.Суд КАК Суд,
		|	энргЗадачаПИДСудебныеИнстанции.СудебыйУчасток КАК СудебыйУчасток,
		|	энргЗадачаПИДСудебныеИнстанции.Прочие КАК Прочие
		|ИЗ
		|	Задача.энргЗадачаПИД.СудебныеИнстанции КАК энргЗадачаПИДСудебныеИнстанции
		|ГДЕ
		|	энргЗадачаПИДСудебныеИнстанции.Ссылка В(&СписокЗадач)
		|	И энргЗадачаПИДСудебныеИнстанции.Ссылка <> &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДПодэтапы.IDЭтапа КАК IDЭтапа,
		|	энргЗадачаПИДФайлыПодэтапов.Файл КАК Файл
		|ИЗ
		|	Задача.энргЗадачаПИД.Подэтапы КАК энргЗадачаПИДПодэтапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.Подэтапы КАК энргЗадачаПИДПодэтапы_Отменяемые
		|			ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД.ФайлыПодэтапов КАК энргЗадачаПИДФайлыПодэтапов
		|			ПО энргЗадачаПИДПодэтапы_Отменяемые.Ссылка = энргЗадачаПИДФайлыПодэтапов.Ссылка
		|				И энргЗадачаПИДПодэтапы_Отменяемые.IDЭтапа = энргЗадачаПИДФайлыПодэтапов.IDЭтапа
		|		ПО энргЗадачаПИДПодэтапы.Ссылка <> энргЗадачаПИДПодэтапы_Отменяемые.Ссылка
		|			И энргЗадачаПИДПодэтапы.Подэтап = энргЗадачаПИДПодэтапы_Отменяемые.Подэтап
		|ГДЕ
		|	энргЗадачаПИДПодэтапы.Ссылка = &Задача
		|	И энргЗадачаПИДФайлыПодэтапов.Ссылка В(&СписокЗадач)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДЗадолженность.ПериодНачисления КАК ПериодНачисления,
		|	энргЗадачаПИДЗадолженность.Услуга КАК Услуга,
		|	МАКСИМУМ(энргЗадачаПИДЗадолженность.Задолженность) КАК Задолженность
		|ИЗ
		|	Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
		|ГДЕ
		|	энргЗадачаПИДЗадолженность.Ссылка В(&СписокЗадач)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗадачаПИДЗадолженность.ПериодНачисления,
		|	энргЗадачаПИДЗадолженность.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДИсполнительныеДокументы.НомерСтроки КАК НомерСтроки,
		|	энргЗадачаПИДИсполнительныеДокументы.ИсполнительныйДокумент КАК ИсполнительныйДокумент,
		|	энргЗадачаПИДИсполнительныеДокументы.Номер КАК Номер,
		|	энргЗадачаПИДИсполнительныеДокументы.Дата КАК Дата,
		|	энргЗадачаПИДИсполнительныеДокументы.Предъявлен КАК Предъявлен,
		|	энргЗадачаПИДИсполнительныеДокументы.Ответственность КАК Ответственность,
		|	энргЗадачаПИДИсполнительныеДокументы.Долг КАК Долг,
		|	энргЗадачаПИДИсполнительныеДокументы.Пеня КАК Пеня,
		|	энргЗадачаПИДИсполнительныеДокументы.Госпошлина КАК Госпошлина,
		|	энргЗадачаПИДИсполнительныеДокументы.Прочие КАК Прочие
		|ИЗ
		|	Задача.энргЗадачаПИД.ИсполнительныеДокументы КАК энргЗадачаПИДИсполнительныеДокументы
		|ГДЕ
		|	энргЗадачаПИДИсполнительныеДокументы.Ссылка В(&СписокЗадач)
		|	И энргЗадачаПИДИсполнительныеДокументы.Ссылка <> &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	энргЗадачаПИДПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.энргЗадачаПИДПрисоединенныеФайлы КАК энргЗадачаПИДПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО энргЗадачаПИДПрисоединенныеФайлы.ВладелецФайла = энргЗадачаПИД.СтартоваяЗадача
		|ГДЕ
		|	энргЗадачаПИД.Ссылка В(&СписокЗадач)
		|	И энргЗадачаПИД.Ссылка <> &Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	энргСобытиеАбоненты.Ссылка КАК Ссылка,
		|	энргСобытиеАбоненты.Основание КАК Основание
		|ИЗ
		|	Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргСобытие КАК энргСобытие
		|		ПО энргСобытиеАбоненты.Ссылка = энргСобытие.Ссылка
		|ГДЕ
		|	энргСобытиеАбоненты.Основание В(&СписокЗадач)
		|	И энргСобытиеАбоненты.Основание <> &Задача
		|	И НЕ энргСобытие.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОбъектЗадача.ПланПогашенияЗадолженности.Очистить();
	Если Не РезультатЗапроса[0].Пустой() Тогда
		ОбъектЗадача.ПланПогашенияЗадолженности.Загрузить(РезультатЗапроса[0].Выгрузить());
	КонецЕсли;
	
	ОбъектЗадача.Начисления.Очистить();
	Если Не РезультатЗапроса[1].Пустой() Тогда
		ОбъектЗадача.Начисления.Загрузить(РезультатЗапроса[1].Выгрузить());
	КонецЕсли;	
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ОбъектЗадача.СудебныеИнстанции.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ОбъектЗадача.ФайлыПодэтапов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
	ОбъектЗадача.Задолженность.Очистить();
	Если Не РезультатЗапроса[4].Пустой() Тогда
		ОбъектЗадача.Задолженность.Загрузить(РезультатЗапроса[4].Выгрузить());
	КонецЕсли;
	
	Выборка = РезультатЗапроса[5].Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ОбъектЗадача.ИсполнительныеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
	Выборка = РезультатЗапроса[6].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			Попытка
			
				ФайлЗадачи = Выборка.Ссылка.ПолучитьОбъект();
				ФайлЗадачи.ВладелецФайла = ОбъектЗадача.СтартоваяЗадача;
				ФайлЗадачи.Записать();
			
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось объединить задачи по причине: " + ОписаниеОшибки());
				ОтменитьТранзакцию();
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[7].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			Попытка
			
				СобытиеДок = Выборка.Ссылка.ПолучитьОбъект();
				Если Ложь Тогда
				 	СобытиеДок = Документы.энргСобытие.СоздатьДокумент();
				КонецЕсли;
				СобытиеДок.ДополнительныеСвойства.Вставить("Основание", 	  Выборка.Основание);
				СобытиеДок.ДополнительныеСвойства.Вставить("ОснованиеЗамена", ОбъектЗадача.Ссылка);
				СобытиеДок.Записать();
			
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось объединить задачи по причине: " + ОписаниеОшибки());
				ОтменитьТранзакцию();
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекЭлемент Из СписокЗадач Цикл
	
		Если ТекЭлемент.Значение <> Задача Тогда
			
			Попытка
				
				ОбъектУстарЗадача = ТекЭлемент.Значение.ПолучитьОбъект();
				ОбъектУстарЗадача.УстановитьПометкуУдаления(Истина);
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось объединить задачи по причине: " + ОписаниеОшибки());
				ОтменитьТранзакцию();
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
	
		ОбъектЗадача.Записать();
	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось объединить задачи по причине: " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ЭтапПИР_СоответствуетТребованиям(ЗадачаОбъект, Этап) Экспорт
	Перем Строение, Помещение;
	ЗаполнитьПомещениеИСтроениеПоАбоненту(ЗадачаОбъект.Абонент, Строение, Помещение);
	
	НарушеныУсловия = Новый Массив;
	
	РС = РегистрыСведений.энргНастройкаУсловийДляПереходаНаЭтап;
	Если Ложь Тогда
	
		ЗадачаОбъект = Задачи.энргЗадачаПИД.СоздатьЗадачу();
	
	КонецЕсли;
	
	АбонентВИП = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаОбъект.Абонент, "VIPабонент", Истина);
	Если ЗначениеЗаполнено(ЗадачаОбъект.Задолженность) И РС.ЕстьУсловияПоЭтапу(Этап, ЗадачаОбъект.Организация, ЗадачаОбъект.Район, АбонентВИП) Тогда
		Запрос = Новый Запрос;
		
		ТекстЗапросаДолгиНач = 
			"ВЫБРАТЬ
			|	&Услуга_1 КАК Услуга,
			|	&ПериодНачисления_1 КАК ПериодНачисления";
		
		
		ИмяВТ = Символы.ПС + "ПОМЕСТИТЬ ВТ_Долги ";
		Сч = 1;
		
		ДатаОкон = Неопределено;
		Для каждого СрокаТЧ Из ЗадачаОбъект.Задолженность Цикл
			ПарамУслуга = "Услуга_" + Формат(Сч, "ЧГ=0");
			ПарамПериод = "ПериодНачисления_" + Формат(Сч, "ЧГ=0");
			
			Если Сч = 1 Тогда
				ТекстЗапроса 	 = ТекстЗапросаДолгиНач + ИмяВТ;
				ДатаОкон		 = СрокаТЧ.ПериодНачисления;
			Иначе
				ТекстОбъединения = Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС + ТекстЗапросаДолгиНач + Символы.ПС;
				ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "Услуга_1 КАК Услуга", ПарамУслуга);
				ТекстОбъединения = СтрЗаменить(ТекстОбъединения, "ПериодНачисления_1 КАК ПериодНачисления", ПарамПериод);
				
				ТекстЗапроса	 = ТекстЗапроса + ТекстОбъединения;
				ДатаОкон		 = Макс(ДатаОкон, СрокаТЧ.ПериодНачисления);
			КонецЕсли;
			
			Запрос.УстановитьПараметр(ПарамУслуга, СрокаТЧ.Услуга);
			Запрос.УстановитьПараметр(ПарамПериод, СрокаТЧ.ПериодНачисления);
			Сч = Сч + 1;
		КонецЦикла;
		
		Запрос.Текст = ТекстЗапроса + ОкончаниеТесктаЗаросаПроверкаЭтапаПИР();
		
		Запрос.УстановитьПараметр("Абонент", ЗадачаОбъект.Абонент);
		Запрос.УстановитьПараметр("ДатаОкон", ДатаОкон);
		Запрос.УстановитьПараметр("ИспользуютсяТарифныеЗоны", ПолучитьФункциональнуюОпцию("энргИспользоватьТарифныеЗоны"));
		Запрос.УстановитьПараметр("Организация", ЗадачаОбъект.Организация);
		Запрос.УстановитьПараметр("Помещение", Помещение);
		Запрос.УстановитьПараметр("Район", ЗадачаОбъект.Район);
		Запрос.УстановитьПараметр("Строение", Строение);
		Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
		Запрос.УстановитьПараметр("АбонентВИП", АбонентВИП);
		Запрос.УстановитьПараметр("Этап", Этап);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			Если Выборка.СверхСрокиЗадолженности < 0 Тогда
				НарушеныУсловия.Добавить("Недостаточное количество периодов для перехода на этап " + Этап);
			КонецЕсли;
			Если Выборка.СверхСуммаЗадолженности < 0 Тогда
				НарушеныУсловия.Добавить("Недостаточная сумма долга для перехода на этап " + Этап);
			КонецЕсли;
			Если Не Выборка.ВходитВДиапозон Тогда
				НарушеныУсловия.Добавить("Сумма долга не попадает в лимит этапа """ + Этап + """");
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

	Возврат НарушеныУсловия;
КонецФункции


Процедура ИсполнительныйИлиСудебныйЭтап(Знач Этап, Исполнитльный = Ложь, Судебный = Ложь, Досудебный = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА энргВидыОперацийПИД.Тип = ЗНАЧЕНИЕ(Перечисление.энргТипыЭтапов.СудебнаяРабота)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Судебный,
		|	ВЫБОР
		|		КОГДА энргВидыОперацийПИД.Тип = ЗНАЧЕНИЕ(Перечисление.энргТипыЭтапов.ИсполнительнаяРабота)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Исполнитльный,
		|	ВЫБОР
		|		КОГДА энргВидыОперацийПИД.Тип = ЗНАЧЕНИЕ(Перечисление.энргТипыЭтапов.ДосудебнаяРабота)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Досудебный
		|ИЗ
		|	Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
		|ГДЕ
		|	энргВидыОперацийПИД.Ссылка = &Этап";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Исполнитльный = Выборка.Исполнитльный;
		Судебный	  = Выборка.Судебный;
		Досудебный	  = Выборка.Досудебный;
	КонецЦикла;
КонецПроцедуры

#Область ЮЛ

Процедура СоздатьЗадачуПоДанным(ДанныеЗадачи) Экспорт
	НоваяЗадача = Задачи.энргЗадачаПИД.СоздатьЗадачу();
	НоваяЗадача.Дата = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(НоваяЗадача, ДанныеЗадачи); 
	ЗаполнитьНаименованиеИЭтап(НоваяЗадача,,ДанныеЗадачи.Этап);
	Попытка
		НоваяЗадача.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать задачу по договору " + ДанныеЗадачи.Договор);
		Возврат;
	КонецПопытки; 
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создана задача по договору " + ДанныеЗадачи.Договор);
КонецПроцедуры
	 
#Конецобласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерфейса_ПолучениеДанных

Процедура ПолучитьЗадачиПИД(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗадачиПИД());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры = "Ссылка, Абонент";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргЗадачаПИД", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаЗадачиПИД()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргЗадачаПИД.Ссылка КАК Задача,
	|	энргЗадачаПИД.Абонент КАК Абонент
	|ИЗ
	|	Задача.энргЗадачаПИД КАК энргЗадачаПИД";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти      

 Функция ЗапросСроковПодэтапов(ДатаЗадачи, Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВидыОперацийПИД.Ссылка КАК Этап,
		|	ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.Подэтап, ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ПустаяСсылка)) КАК Подэтап,
		|	ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.Порядок, 0) КАК Порядок,
		|	ЕСТЬNULL(энргВидыОперацийПИДПодэтапы.Параллельно, ЛОЖЬ) КАК Параллельно
		|ПОМЕСТИТЬ ВТ_Подэтапы
		|ИЗ
		|	Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыОперацийПИД.Подэтапы КАК энргВидыОперацийПИДПодэтапы
		|		ПО энргВидыОперацийПИД.Ссылка = энргВидыОперацийПИДПодэтапы.Ссылка
		|ГДЕ
		|	энргВидыОперацийПИД.Ссылка = &Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Подэтапы.Этап КАК Этап,
		|	ВТ_Подэтапы.Подэтап КАК Подэтап,
		|	ВТ_Подэтапы.Порядок КАК Порядок,
		|	ВТ_Подэтапы.Параллельно КАК Параллельно,
		|	ЕСТЬNULL(СрокиЭтаповПИДСрезПоследних.Срок, 0) КАК Срок,
		|	2 КАК Приоритет
		|ПОМЕСТИТЬ ВТ_СрокиПодэтапов
		|ИЗ
		|	ВТ_Подэтапы КАК ВТ_Подэтапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСрокиЭтаповПИД.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Район = &Район
		|					И Схема = &Схема
		|					И Юридическая = ЛОЖЬ
		|					И (Этап, Подэтап) В
		|						(ВЫБРАТЬ
		|							ВТ_Подэтапы.Этап КАК Этап,
		|							ВТ_Подэтапы.Подэтап КАК Подэтап
		|						ИЗ
		|							ВТ_Подэтапы КАК ВТ_Подэтапы)) КАК СрокиЭтаповПИДСрезПоследних
		|		ПО (СрокиЭтаповПИДСрезПоследних.Этап = ВТ_Подэтапы.Этап)
		|			И (СрокиЭтаповПИДСрезПоследних.Подэтап = ВТ_Подэтапы.Подэтап)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СрокиПодэтапов.Этап КАК Этап,
		|	ВТ_СрокиПодэтапов.Подэтап КАК Подэтап,
		|	ВТ_СрокиПодэтапов.Порядок КАК Порядок,
		|	ВТ_СрокиПодэтапов.Параллельно КАК Параллельно,
		|	МИНИМУМ(ВТ_СрокиПодэтапов.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ВТ_ПолучитьНужныйПриоритет
		|ИЗ
		|	ВТ_СрокиПодэтапов КАК ВТ_СрокиПодэтапов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СрокиПодэтапов.Этап,
		|	ВТ_СрокиПодэтапов.Подэтап,
		|	ВТ_СрокиПодэтапов.Порядок,
		|	ВТ_СрокиПодэтапов.Параллельно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СрокиПодэтапов.Этап КАК Этап,
		|	ВТ_СрокиПодэтапов.Подэтап КАК Подэтап,
		|	ВТ_СрокиПодэтапов.Порядок КАК Порядок,
		|	ВТ_СрокиПодэтапов.Параллельно КАК Параллельно,
		|	ВТ_СрокиПодэтапов.Срок КАК Продолжительность
		|ИЗ
		|	ВТ_СрокиПодэтапов КАК ВТ_СрокиПодэтапов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПолучитьНужныйПриоритет КАК ВТ_ПолучитьНужныйПриоритет
		|		ПО ВТ_СрокиПодэтапов.Этап = ВТ_ПолучитьНужныйПриоритет.Этап
		|			И ВТ_СрокиПодэтапов.Подэтап = ВТ_ПолучитьНужныйПриоритет.Подэтап
		|			И ВТ_СрокиПодэтапов.Порядок = ВТ_ПолучитьНужныйПриоритет.Порядок
		|			И ВТ_СрокиПодэтапов.Параллельно = ВТ_ПолучитьНужныйПриоритет.Параллельно
		|			И ВТ_СрокиПодэтапов.Приоритет = ВТ_ПолучитьНужныйПриоритет.Приоритет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("Дата",		 ДатаЗадачи);
	Запрос.УстановитьПараметр("Абонент",	 Объект.Абонент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район",		 Объект.Район);
	Запрос.УстановитьПараметр("Этап",		 Объект.Этап);
	Запрос.УстановитьПараметр("Схема",		 Объект.Схема);
	
	Возврат Запрос.Выполнить();

КонецФункции

 Функция ЗаполнитьСхемуОбъекта(Знач ДатаЗадачи, Объект)
	
	Перем Выборка, Запрос, РезультатЗапроса;
	
	Если ЗначениеЗаполнено(Объект.Схема) Тогда
		Возврат Истина;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСхемыПИДОрганизацийСрезПоследних.Схема КАК Схема
		|ИЗ
		|	РегистрСведений.энргСхемыПИДОрганизаций.СрезПоследних(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД
		|				И Абонент = &Абонент
		|				И Юридическая = ЛОЖЬ) КАК энргСхемыПИДОрганизацийСрезПоследних
		|ГДЕ
		|	энргСхемыПИДОрганизацийСрезПоследних.Схема <> ЗНАЧЕНИЕ(Справочник.энргСхемыПИД.ПустаяСсылка)";
	
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда
		Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Абонент = &Абонент","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.МКД) Тогда  
		Запрос.УстановитьПараметр("МКД", Объект.МКД);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И МКД = &МКД","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТекДата",	 ДатаЗадачи);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		Объект.Схема = Выборка.Схема;
		
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

 Процедура ВыводШапкиФилиала(ТабДок, Район, ОбластьШапкаДляВывода = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Константы.энргРеквизитФилиалаАдрес КАК энргРеквизитФилиалаАдрес,
		|	Константы.энргРеквизитФилиалаТелефон КАК энргРеквизитФилиалаТелефон,
		|	Константы.энргРеквизитФилиалаАдресСайта КАК энргРеквизитФилиалаАдресСайта,
		|	Константы.энргРеквизитФилиалаЮридическийАдрес КАК энргРеквизитФилиалаЮридическийАдрес,
		|	Константы.энргРеквизитФилиалаЭлекАдрес КАК энргРеквизитФилиалаЭлекАдрес,
		|	Константы.энргРеквизитФилиалаОКПО КАК энргРеквизитФилиалаОКПО,
		|	Константы.энргРеквизитФилиалаОГРН КАК энргРеквизитФилиалаОГРН,
		|	Константы.энргРеквизитФилиалаИНН КАК энргРеквизитФилиалаИНН,
		|	Константы.энргРеквизитФилиалаКПП КАК энргРеквизитФилиалаКПП,
		|	Константы.энргРеквизитФилиалаФакс КАК энргРеквизитФилиалаФакс
		|ПОМЕСТИТЬ ВТ_РеквизитыФилиала
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдрес
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Адрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаТелефон
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК КонтактныйЦентр_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдресСайта
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресСайта_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЮридическийАдрес
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЮридическийАдрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЭлекАдрес
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЭлекАдрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОКПО
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ОКПО_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОГРН
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ОГРН_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаИНН
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ИНН_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаКПП
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК КПП_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаФакс
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Факс_Филиала,
		|	энргЗоныОтвественности.Ссылка КАК Район,
		|	Организации.Ссылка КАК Организация,
		|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	Организации.НаименованиеСокращённое КАК ОрганизацияНаименованиеСокращённое
		|ИЗ
		|	Справочник.энргЗоныОтвественности.ДополнительныеРеквизиты КАК энргЗоныОтвественностиДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО энргЗоныОтвественности.Организация = Организации.Ссылка
		|		ПО энргЗоныОтвественностиДополнительныеРеквизиты.Ссылка = энргЗоныОтвественности.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеквизитыФилиала КАК ВТ_РеквизитыФилиала
		|		ПО (энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдрес
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаТелефон
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдресСайта
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЮридическийАдрес
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЭлекАдрес
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОКПО
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОГРН
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаИНН
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаКПП
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаФакс)
		|ГДЕ
		|	энргЗоныОтвественности.Ссылка = &Район
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗоныОтвественности.Ссылка,
		|	Организации.Ссылка";
	
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если ОбластьШапкаДляВывода = Неопределено Тогда
		Макет = ПолучитьМакет("МакетБланкФилиала");
		ОбластьБланкФилиала = Макет.ПолучитьОбласть("БланкФилиала");
	Иначе
		ОбластьБланкФилиала = ОбластьШапкаДляВывода;
	КонецЕсли;
	
	ТекОбъект = Новый Структура;
	Если Выборка.Следующий() Тогда 
		ОбластьБланкФилиала.Параметры.Заполнить(Выборка);
		
		ТекОбъект.Вставить("ОрганизацияПрописью", ВРег(Строка(Выборка.Организация)));
		
		Если ЗначениеЗаполнено(Выборка.ЮридическийАдрес_Филиала) И Выборка.ЮридическийАдрес_Филиала <> Выборка.Адрес_Филиала Тогда
			ФактЮрАдрес = "юридический адрес: " + Строка(Выборка.ЮридическийАдрес_Филиала) + Символы.ПС +
							"фактический адрес: " + Строка(Выборка.Адрес_Филиала);
			ТекОбъект.Вставить("ФактЮрАдрес", ФактЮрАдрес);
		Иначе
			ТекОбъект.Вставить("ФактЮрАдрес", Выборка.Адрес_Филиала);
		КонецЕсли;
		ОбластьБланкФилиала.Параметры.Заполнить(ТекОбъект);
	КонецЕсли;
	
	Если ОбластьШапкаДляВывода = Неопределено Тогда
		ТабДок.Вывести(ОбластьБланкФилиала);
	КонецЕсли;
КонецПроцедуры

Функция ОкончаниеТесктаЗаросаПроверкаЭтапаПИР()
	
	ТекстЗапроса = ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
	
	ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	энргОбъемНачислений.Организация КАК Организация,
		|	энргОбъемНачислений.Район КАК Район,
		|	энргОбъемНачислений.Абонент КАК Абонент,
		|	энргОбъемНачислений.Услуга КАК Услуга,
		|	энргОбъемНачислений.Поставщик КАК Поставщик,
		|	МАКСИМУМ(энргОбъемНачислений.ТарифнаяЗона) КАК ТарифнаяЗона,
		|	МАКСИМУМ(энргОбъемНачислений.ЗначениеТарифа) КАК ЗначениеТарифа,
		|	МАКСИМУМ(энргОбъемНачислений.КлючПомещения) КАК КлючПомещения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргОбъемНачислений.ТарифнаяЗона) КАК КоличествоТарифнаяЗона,
		|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления
		|ПОМЕСТИТЬ ВТ_Оплаты
		|ИЗ
		|	ВТ_Долги КАК ВТ_Долги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|		ПО ВТ_Долги.ПериодНачисления = энргОбъемНачислений.ПериодНачисления
		|			И ВТ_Долги.Услуга = энргОбъемНачислений.Услуга
		|ГДЕ
		|	энргОбъемНачислений.Организация = &Организация
		|	И энргОбъемНачислений.Район = &Район
		|	И НЕ энргОбъемНачислений.Распределение
		|	И энргОбъемНачислений.Строение = &Строение
		|	И энргОбъемНачислений.Помещение = &Помещение
		|	И энргОбъемНачислений.Абонент = &Абонент
		|
		|СГРУППИРОВАТЬ ПО
		|	энргОбъемНачислений.Организация,
		|	энргОбъемНачислений.Район,
		|	энргОбъемНачислений.Абонент,
		|	энргОбъемНачислений.Услуга,
		|	энргОбъемНачислений.Поставщик,
		|	энргОбъемНачислений.НормаПотребления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оплаты.Организация КАК Организация,
		|	ВТ_Оплаты.Район КАК Район,
		|	ВТ_Оплаты.Абонент КАК Абонент,
		|	ВТ_Оплаты.Услуга КАК Услуга,
		|	ВТ_Оплаты.Поставщик КАК Поставщик,
		|	ВТ_Оплаты.КлючПомещения КАК КлючПомещения,
		|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки) КАК ТарифнаяЗона
		|ПОМЕСТИТЬ ВТ_ДанныеДляТарифа
		|ИЗ
		|	ВТ_Оплаты КАК ВТ_Оплаты
		|ГДЕ
		|	ВТ_Оплаты.КоличествоТарифнаяЗона > 1
		|	И &ИспользуютсяТарифныеЗоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргГруппыПотребителейАбонентовСрезПоследних.Организация КАК Организация,
		|	энргГруппыПотребителейАбонентовСрезПоследних.Район КАК Район,
		|	энргГруппыПотребителейАбонентовСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргГруппыПотребителейАбонентовСрезПоследних.Услуга КАК Услуга,
		|	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей
		|ПОМЕСТИТЬ ВТ_ГруппаПотребления
		|ИЗ
		|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
		|			&ДатаОкон,
		|			(Организация, Район, КлючПомещения, Услуга) В
		|				(ВЫБРАТЬ
		|					ВТ_ДанныеДляТарифа.Организация КАК Организация,
		|					ВТ_ДанныеДляТарифа.Район КАК Район,
		|					ВТ_ДанныеДляТарифа.КлючПомещения КАК КлючПомещения,
		|					ВТ_ДанныеДляТарифа.Услуга КАК Услуга
		|				ИЗ
		|					ВТ_ДанныеДляТарифа КАК ВТ_ДанныеДляТарифа)) КАК энргГруппыПотребителейАбонентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДляТарифа.Организация КАК Организация,
		|	ВТ_ДанныеДляТарифа.Район КАК Район,
		|	ВТ_ГруппаПотребления.ГруппаПотребителей КАК ГруппаПотребителей,
		|	ВТ_ДанныеДляТарифа.Услуга КАК Услуга,
		|	ВТ_ДанныеДляТарифа.Поставщик КАК Поставщик,
		|	ВТ_ДанныеДляТарифа.ТарифнаяЗона КАК ТарифнаяЗона
		|ПОМЕСТИТЬ ВТ_ИзмеренияТарифнаяЗона
		|ИЗ
		|	ВТ_ДанныеДляТарифа КАК ВТ_ДанныеДляТарифа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппаПотребления КАК ВТ_ГруппаПотребления
		|		ПО ВТ_ДанныеДляТарифа.Организация = ВТ_ГруппаПотребления.Организация
		|			И ВТ_ДанныеДляТарифа.Район = ВТ_ГруппаПотребления.Район
		|			И ВТ_ДанныеДляТарифа.КлючПомещения = ВТ_ГруппаПотребления.КлючПомещения
		|			И ВТ_ДанныеДляТарифа.Услуга = ВТ_ГруппаПотребления.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияТарифовСрезПоследних.Организация КАК Организация,
		|	энргЗначенияТарифовСрезПоследних.Район КАК Район,
		|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
		|	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
		|	энргЗначенияТарифовСрезПоследних.Поставщик КАК Поставщик,
		|	энргЗначенияТарифовСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ВЫБОР
		|		КОГДА энргЗначенияТарифовСрезПоследних.НДСВнутри
		|			ТОГДА энргЗначенияТарифовСрезПоследних.Значение
		|		ИНАЧЕ энргЗначенияТарифовСрезПоследних.Значение * (1 + энргЗначенияТарифовСрезПоследних.СтавкаНДС / 100)
		|	КОНЕЦ КАК ЗначениеТарифа
		|ПОМЕСТИТЬ ВТ_ЗначенияТарифаБезРазбивки
		|ИЗ
		|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
		|			&ДатаОкон,
		|			(Организация, Район, ГруппаПотребителей, Услуга, Поставщик, ТарифнаяЗона) В
		|				(ВЫБРАТЬ
		|					ВТ_ИзмеренияТарифнаяЗона.Организация КАК Организация,
		|					ВТ_ИзмеренияТарифнаяЗона.Район КАК Район,
		|					ВТ_ИзмеренияТарифнаяЗона.ГруппаПотребителей КАК ГруппаПотребителей,
		|					ВТ_ИзмеренияТарифнаяЗона.Услуга КАК Услуга,
		|					ВТ_ИзмеренияТарифнаяЗона.Поставщик КАК Поставщик,
		|					ВТ_ИзмеренияТарифнаяЗона.ТарифнаяЗона КАК ТарифнаяЗона
		|				ИЗ
		|					ВТ_ИзмеренияТарифнаяЗона КАК ВТ_ИзмеренияТарифнаяЗона)) КАК энргЗначенияТарифовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗначенияТарифаБезРазбивки.Организация КАК Организация,
		|	ВТ_ЗначенияТарифаБезРазбивки.Район КАК Район,
		|	ВТ_ЗначенияТарифаБезРазбивки.ГруппаПотребителей КАК ГруппаПотребителей,
		|	ВТ_ЗначенияТарифаБезРазбивки.Услуга КАК Услуга,
		|	ВТ_ЗначенияТарифаБезРазбивки.Поставщик КАК Поставщик,
		|	ВТ_ЗначенияТарифаБезРазбивки.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ВТ_ЗначенияТарифаБезРазбивки.ЗначениеТарифа КАК ЗначениеТарифа,
		|	ВТ_ГруппаПотребления.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_ЗначениеТарифаСКлючемПомещения
		|ИЗ
		|	ВТ_ЗначенияТарифаБезРазбивки КАК ВТ_ЗначенияТарифаБезРазбивки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппаПотребления КАК ВТ_ГруппаПотребления
		|		ПО ВТ_ЗначенияТарифаБезРазбивки.Организация = ВТ_ГруппаПотребления.Организация
		|			И ВТ_ЗначенияТарифаБезРазбивки.Район = ВТ_ГруппаПотребления.Район
		|			И ВТ_ЗначенияТарифаБезРазбивки.Услуга = ВТ_ГруппаПотребления.Услуга
		|			И ВТ_ЗначенияТарифаБезРазбивки.ГруппаПотребителей = ВТ_ГруппаПотребления.ГруппаПотребителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Оплаты.Организация КАК Организация,
		|	ВТ_Оплаты.Район КАК Район,
		|	ВТ_Оплаты.Абонент КАК Абонент,
		|	ВТ_Оплаты.Услуга КАК Услуга,
		|	ЕСТЬNULL(ВТ_ЗначениеТарифаСКлючемПомещения.ЗначениеТарифа, ВТ_Оплаты.ЗначениеТарифа) КАК ЗначениеТарифа,
		|	ВТ_Оплаты.НормаПотребления КАК НормаПотребления
		|ПОМЕСТИТЬ ВТ_НормаИТариф
		|ИЗ
		|	ВТ_Оплаты КАК ВТ_Оплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначениеТарифаСКлючемПомещения КАК ВТ_ЗначениеТарифаСКлючемПомещения
		|		ПО ВТ_Оплаты.Организация = ВТ_ЗначениеТарифаСКлючемПомещения.Организация
		|			И ВТ_Оплаты.Район = ВТ_ЗначениеТарифаСКлючемПомещения.Район
		|			И ВТ_Оплаты.КлючПомещения = ВТ_ЗначениеТарифаСКлючемПомещения.КлючПомещения
		|			И ВТ_Оплаты.Услуга = ВТ_ЗначениеТарифаСКлючемПомещения.Услуга
		|			И ВТ_Оплаты.Поставщик = ВТ_ЗначениеТарифаСКлючемПомещения.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НормаИТариф.Организация КАК Организация,
		|	ВТ_НормаИТариф.Район КАК Район,
		|	ВТ_НормаИТариф.Абонент КАК Абонент,
		|	СУММА(ВТ_НормаИТариф.ЗначениеТарифа * ВТ_НормаИТариф.НормаПотребления * ЕСТЬNULL(энргНастройкаУсловийДляПереходаНаЭтап.КратностьСуммыЗадолженности, 0)) КАК МинЗадолженность,
		|	МАКСИМУМ(ЕСТЬNULL(энргНастройкаУсловийДляПереходаНаЭтап.КоличествоПериодовЗадолженности, 0)) КАК КолПериодов,
		|	МАКСИМУМ(энргНастройкаУсловийДляПереходаНаЭтап.СуммаОт) КАК СуммаОт,
		|	МАКСИМУМ(энргНастройкаУсловийДляПереходаНаЭтап.СуммаДо) КАК СуммаДо,
		|	энргНастройкаУсловийДляПереходаНаЭтап.КатегорияДебитора КАК КатегорияДебитора,
		|	МАКСИМУМ(энргНастройкаУсловийДляПереходаНаЭтап.ТехническаяВозможностьОРП) КАК ТехническаяВозможностьОРП
		|ПОМЕСТИТЬ ВТ_ТребуемаяЗадолженноть
		|ИЗ
		|	ВТ_НормаИТариф КАК ВТ_НормаИТариф
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкаУсловийДляПереходаНаЭтап КАК энргНастройкаУсловийДляПереходаНаЭтап
		|		ПО ВТ_НормаИТариф.Организация = энргНастройкаУсловийДляПереходаНаЭтап.Организация
		|			И ВТ_НормаИТариф.Район = энргНастройкаУсловийДляПереходаНаЭтап.Район
		|ГДЕ
		|	энргНастройкаУсловийДляПереходаНаЭтап.Этап = &Этап
		|	И энргНастройкаУсловийДляПереходаНаЭтап.АбонентВИП = &АбонентВИП
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НормаИТариф.Организация,
		|	ВТ_НормаИТариф.Район,
		|	ВТ_НормаИТариф.Абонент,
		|	энргНастройкаУсловийДляПереходаНаЭтап.КатегорияДебитора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация КАК Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления) КАК КолПериодов,
		|	СУММА(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) КАК Задолженность
		|ПОМЕСТИТЬ ВТ_ТекЗадолженность
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&ТекДата,
		|			Организация = &Организация
		|				И Район = &Район
		|				//И МКД = &Строение
		|				И Абонент = &Абонент
		|				И (ПериодНачисления, Услуга) В
		|					(ВЫБРАТЬ
		|						ВТ_Долги.ПериодНачисления КАК ПериодНачисления,
		|						ВТ_Долги.Услуга КАК Услуга
		|					ИЗ
		|						ВТ_Долги КАК ВТ_Долги)) КАК энргВзаиморасчетыПоМесяцамОстатки
		|ГДЕ
		|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцамОстатки.Организация,
		|	энргВзаиморасчетыПоМесяцамОстатки.Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТребуемаяЗадолженноть.Организация КАК Организация,
		|	ВТ_ТребуемаяЗадолженноть.Район КАК Район,
		|	ВТ_ТребуемаяЗадолженноть.Абонент КАК Абонент,
		|	МАКСИМУМ(ВТ_ТребуемаяЗадолженноть.КатегорияДебитора) КАК КатегорияДебитора
		|ПОМЕСТИТЬ ВТ_КатегорияДебитораТребований
		|ИЗ
		|	ВТ_ТребуемаяЗадолженноть КАК ВТ_ТребуемаяЗадолженноть
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТребуемаяЗадолженноть.Организация,
		|	ВТ_ТребуемаяЗадолженноть.Район,
		|	ВТ_ТребуемаяЗадолженноть.Абонент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТекЗадолженность.Организация КАК Организация,
		|	ВТ_ТекЗадолженность.Район КАК Район,
		|	ВТ_ТекЗадолженность.Абонент КАК Абонент,
		|	ВТ_ТекЗадолженность.КолПериодов - ЕСТЬNULL(ВТ_ТребуемаяЗадолженноть.КолПериодов, 0) КАК СверхСрокиЗадолженности,
		|	ВТ_ТекЗадолженность.Задолженность - ЕСТЬNULL(ВТ_ТребуемаяЗадолженноть.МинЗадолженность, 0) КАК СверхСуммаЗадолженности,
		|	ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ТребуемаяЗадолженноть.СуммаДо, 0) > 0
		|				ТОГДА ЕСТЬNULL(ВТ_ТребуемаяЗадолженноть.СуммаДо, 0) >= ВТ_ТекЗадолженность.Задолженность
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|		И ВТ_ТекЗадолженность.Задолженность >= ЕСТЬNULL(ВТ_ТребуемаяЗадолженноть.СуммаОт, 0) КАК ВходитВДиапозон
		|ИЗ
		|	ВТ_ТекЗадолженность КАК ВТ_ТекЗадолженность
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТребуемаяЗадолженноть КАК ВТ_ТребуемаяЗадолженноть
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КатегорияДебитораТребований КАК ВТ_КатегорияДебитораТребований
		|			ПО ВТ_ТребуемаяЗадолженноть.Организация = ВТ_КатегорияДебитораТребований.Организация
		|				И ВТ_ТребуемаяЗадолженноть.Район = ВТ_КатегорияДебитораТребований.Район
		|				И ВТ_ТребуемаяЗадолженноть.Абонент = ВТ_КатегорияДебитораТребований.Абонент
		|				И ВТ_ТребуемаяЗадолженноть.КатегорияДебитора = ВТ_КатегорияДебитораТребований.КатегорияДебитора
		|		ПО ВТ_ТекЗадолженность.Организация = ВТ_ТребуемаяЗадолженноть.Организация
		|			И ВТ_ТекЗадолженность.Район = ВТ_ТребуемаяЗадолженноть.Район
		|			И ВТ_ТекЗадолженность.Абонент = ВТ_ТребуемаяЗадолженноть.Абонент";
	
	Возврат ТекстЗапроса;

КонецФункции 

Процедура ЗаполнитьПомещениеИСтроениеПоАбоненту(Абонент, Строение, Помещение) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Помещение КАК Помещение,
		|	энргКлючиПомещений.Строение КАК Строение
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
		|		ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
		|ГДЕ
		|	энргАбоненты.Ссылка = &Абонент";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Строение 	= ВыборкаДетальныеЗаписи.Строение;
		Помещение 	= ВыборкаДетальныеЗаписи.Помещение;
	Иначе
		Строение	= Справочники.энргСтроения.ПустаяСсылка();
		Помещение 	= Справочники.энргПомещения.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти





