#Область ОписаниеПеременных

Перем ПараметрыОперации Экспорт; // Стуктура параметров операции
Перем ВнешнийКонтекст Экспорт; // Внешний контекст

#Область ЛокальныеПараметрыОбходаВыборки

#Область Логирование

Перем ИмяСобытия;
Перем Ошибки;
Перем ШаблонОшибки;

#КонецОбласти

Перем НастройкаДиапазонов;
Перем ЛокальнаяНастройкаДиапазонов;
Перем ОписаниеСтрокиНастройкиДиапазонов;
Перем ОтборЗначенияТарифа;
Перем ДоляОбъемаПоПериодам;
Перем ОкруглятьДолюДо;
Перем ОкруглятьОбъемДо;

Перем РезультатРаспределения;
Перем ОписаниеРесурсовРаспределения;
Перем ШаблонТаблицыРаспределения;

Перем ЗначенияТарифов;

#Область ПараметрыСменыКлючаВыборки

Перем ТекЧастныйСектор;
Перем ТекМКД;
Перем ТекАбонент;
Перем ТекБлагоустройство;
Перем ЕстьОшибкаВМКД;
	
#КонецОбласти

#КонецОбласти
 
#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выполняет следующие операции:
//		1. Распределение объемов выходящих за лимит первого диапазона.
// 		2. Заполнение значений тарифов(в зависимости от диапазона) и сумм.
//
Процедура ВыполнитьОперацию() Экспорт
		
	ВалидироватьДанные();
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Если НЕ ЕстьУслугиКУстановкеЗначенияТарифов(МВТ) Тогда 
		Возврат;
	КонецЕсли;
	
	ИнициализироватьГраницыПериода();
	ПрочитатьНастройки(МВТ);
	
	РезультатЗапроса = ДокументыКУстановкеЗначенийТарифов(МВТ);
	МВТ.Закрыть();
	
	ОбработатьРезультатЗапроса(РезультатЗапроса);

	Если Ошибки.Количество() > 0 Тогда 
		ТекстОшибок = СтрСоединить(Ошибки, Символы.ПС);
		ВызватьИсключение ТекстОшибок;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СформироватьСтрокуДляЗапроса(ИмяРегистра, ИмяТаблицы, ИсключаемыеПоля, ПерваяСтрока = Ложь, ПоследняяСтрока = Истина, ЭтоГруппировка = Ложь) Экспорт
	
	ОписаниеТаблицы = энргНачисления.ИзмеренияТаблицыОбъемов(ИмяРегистра); 
	
	ПоляИсключая 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключаемыеПоля,, Истина);
	ПоляИзмерений 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеТаблицы.Измерения,, Истина);
	ПоляРесурсов	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеТаблицы.Ресурсы,, Истина);
	ПоляРеквизитов	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОписаниеТаблицы.Реквизиты,, Истина);
	
	ДобавляемыеПоля = Новый Массив;
	ДобавляемыеПоля.Добавить(ИмяТаблицы + ".Период" + ?(Не ЭтоГруппировка, " КАК Период", ","));
	ДобавляемыеПоля.Добавить(ИмяТаблицы + ".Регистратор" + ?(Не ЭтоГруппировка, " КАК Регистратор", ","));
	ДобавитьПоля(ДобавляемыеПоля, ИмяТаблицы, ПоляИзмерений, ПоляИсключая, ЭтоГруппировка);
	ДобавитьПоля(ДобавляемыеПоля, ИмяТаблицы, ПоляРесурсов, ПоляИсключая, ЭтоГруппировка);
	ДобавитьПоля(ДобавляемыеПоля, ИмяТаблицы, ПоляРеквизитов, ПоляИсключая, ЭтоГруппировка);
	
	Разделитель = "," + Символы.ПС;
	СимволПервойСтроки = ?(ПерваяСтрока, "", Символы.ПС);
	СимволПоследнейСтроки = ?(ПоследняяСтрока, "", ",");
	Результат = СимволПервойСтроки + СтрСоединить(ДобавляемыеПоля, Разделитель) + СимволПоследнейСтроки;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПоля(ДобавляемыеПоля, ИмяТаблицы, ПоляТаблицы, ПоляИсключая, ЭтоГруппировка)
	
	Для Каждого Поле Из ПоляТаблицы Цикл
		
		Если НЕ ПоляИсключая.Найти(Поле) = Неопределено ИЛИ Лев(ВРЕГ(Поле), 7) = "УДАЛИТЬ" Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = ИмяТаблицы + "." + Поле + ?(Не ЭтоГруппировка, " КАК " + Поле, ",");		
		ДобавляемыеПоля.Добавить(Результат);
		
	КонецЦикла;
	
КонецПроцедуры

#Область Валидация

Процедура ВалидироватьДанные()
	
	Ошибки = Новый Массив;
	Если НЕ ЗначениеЗаполнено(ПараметрыОперации.ПериодНачисления) Тогда
		Ошибки.Добавить("Период начисления");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрыОперации.Район) тогда
		Ошибки.Добавить("Район");		
	КонецЕсли;                   
	
	Если Ошибки.Количество() > 0 Тогда
		
		Комментарий = "Не заполнены обязательные поля:" + Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
	
	ПроверитьДатуЗапретаИзменения();
	
КонецПроцедуры 

Процедура ПроверитьДатуЗапретаИзменения()
	
	ОбъектПроверки = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ОбъектПроверки.Организация	= ПараметрыОперации.Организация;
	ОбъектПроверки.Дата			= ПараметрыОперации.ПериодНачисления;
	ОбъектПроверки.Район		= ПараметрыОперации.Район;
	
	Отказ = энргДатыЗапретаИзмененияПереопределяемый.ЗапрещеноИзменятьДанные(ОбъектПроверки);
		
	Если Отказ Тогда
		
		Комментарий = "Для пользователя " + Пользователи.ТекущийПользователь() + 
			" район " + ПараметрыОперации.Район + " период " + ПараметрыОперации.ПериодНачисления + 
			" закрыт для редактирования";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцессРаспределения

Процедура ОбработатьРезультатЗапроса(РезультатЗапроса)
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ЕстьОшибкаВМКД = Ложь;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ТекМКД = Выборка.МКД Тогда
			
			Если НЕ ТекМКД = Неопределено Тогда
				ПриСменеМКД();
			КонецЕсли;
			
			ЕстьОшибкаВМКД = Ложь;
			
		КонецЕсли;
		
		Если НЕ ТекАбонент = Выборка.Абонент Тогда			
			ПриСменеАбонента(Выборка);			
		КонецЕсли;
		
		Если Выборка.ОбъемУслуги < 0 ИЛИ Выборка.ОбъемУслугиПотребленный < 0 ИЛИ ЕстьОшибкаВМКД Тогда
			
			ОбновитьКлючиСмены(Выборка);
			Продолжить;
			
		КонецЕсли;		
		
		РесурсыРаспределения = ОпределитьРесурыРаспределения(Выборка);
		ДоляПоТарифнойЗонеОтОбщегоОбъема = ОпределитьДолюПоТарифнойЗонеОтОбщегоОбъема(Выборка);				
		
		Если НЕ ТекБлагоустройство = Выборка.ВидБлагоустройства Тогда
			ОбновитьНастройкуДиапазонов(Выборка);
		КонецЕсли;		
		
		Попытка
			
			РаспределитьОбъем(Выборка, РесурсыРаспределения, ДоляПоТарифнойЗонеОтОбщегоОбъема);			
			
		Исключение
			
			
			Инфо = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Инфо);
			
			Комментарий = СтрШаблон(
				ШаблонОшибки,
				ПараметрыОперации.ПериодНачисления,
				ПараметрыОперации.Организация,
				ПараметрыОперации.Район,
				Выборка.ЧастныйСектор,
				Выборка.МКД,
				ПодробноеПредставлениеОшибки); 
				
			Ошибки.Добавить(Комментарий);	
				
			ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,,
			Комментарий);
			
			ЕстьОшибкаВМКД = Истина;
			
		КонецПопытки;			
				
		ОбновитьКлючиСмены(Выборка);
		
	КонецЦикла;
	
	Если НЕ ТекМКД = Неопределено Тогда
		ПриСменеМКД();
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьОбъем(Выборка, РесурсыРаспределения, ДоляПоТарифнойЗонеОтОбщегоОбъема)
	
	Списали = 0;		
	СписалиПоТЗ = 0;	 
	
	Постфикс = ?(Выборка.ЭтоОбъемПотребленный, "Потребленный", "");	
	
	ОбъемПериодаОтрицательный = Выборка["ОбъемУслугиПериода" + Постфикс] < 0;
	ОтрицательныйОбъемВнутриПериода = Выборка["ОбъемУслугиПериодаОтрицательный" + Постфикс];
	Если Выборка["ОбъемУслугиПериода" + Постфикс] < 0 Тогда
		ОтрицательныйОбъемВнутриПериода = 0;
	КонецЕсли;
	
	Если (Выборка["ОбъемУслугиПериода" + Постфикс] - ОтрицательныйОбъемВнутриПериода) = 0 Тогда
		ДоляПоТарифнойЗоне	= 0;
	Иначе
		ДоляПоТарифнойЗоне = Окр(Выборка["ОбъемУслуги" + Постфикс] / (Выборка["ОбъемУслугиПериода" + Постфикс] - ОтрицательныйОбъемВнутриПериода), ОкруглятьДолюДо);
	КонецЕсли;
	
	Для Каждого СтрокаНастройкиДиапазона Из ЛокальнаяНастройкаДиапазонов Цикл
		
		Если СтрокаНастройкиДиапазона["ОсталосьСписать" + Постфикс] = 0 Тогда 
			Продолжить;
		КонецЕсли;	
		
		Если Списали = Выборка["ОбщийОбъемУслуги" + Постфикс] Тогда 
			Прервать;
		КонецЕсли;
		
		Если СписалиПоТЗ = Выборка["ОбъемУслуги" + Постфикс] Тогда 
			Прервать;
		КонецЕсли;
		
		Если ОбъемПериодаОтрицательный Тогда
			Списываем = Выборка["ОбъемУслуги" + Постфикс];
		Иначе 
			
			ОбъемУвеличенияОтрицательногоОбъемаВнутриПериода = ?(ПараметрыОперации.Диапазон = СтрокаНастройкиДиапазона.Диапазон, ОтрицательныйОбъемВнутриПериода, 0); 
			ЛимитДиапазона = СтрокаНастройкиДиапазона.Разница - ОбъемУвеличенияОтрицательногоОбъемаВнутриПериода;			
			Если НЕ СтрокаНастройкиДиапазона.ЛимитУвеличен Тогда
				ЛимитДиапазона = Окр(ЛимитДиапазона * ДоляПоТарифнойЗонеОтОбщегоОбъема, ОкруглятьОбъемДо); 
			КонецЕсли;
			
			Списываем = Окр(ЛимитДиапазона * ДоляПоТарифнойЗоне, ОкруглятьОбъемДо); 
			Если СтрокаНастройкиДиапазона.Диапазон = Выборка.МаксимальныйДиапазон Тогда
				Списываем = Выборка["ОбъемУслуги" + Постфикс] - СписалиПоТЗ;
			КонецЕсли;
			
		КонецЕсли;	 
		
		НоваяСтрокаНачисления = РесурсыРаспределения.ТаблицаРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисления, Выборка);
		НоваяСтрокаНачисления.НачалоПериода = Выборка.НачалоПериодаОригинал;
		НоваяСтрокаНачисления.ДиапазонДифференцированногоТарифа = СтрокаНастройкиДиапазона.Диапазон;
		НоваяСтрокаНачисления["ОбъемУслуги" + Постфикс] = Списываем;
		НоваяСтрокаНачисления.ЗначениеТарифа = ЗначениеТарифа(НоваяСтрокаНачисления);
		НоваяСтрокаНачисления.Сумма = 0;
		Если НЕ Выборка.ЭтоОбъемПотребленный Тогда  
			НоваяСтрокаНачисления.Сумма = НоваяСтрокаНачисления.ОбъемУслуги * НоваяСтрокаНачисления.ЗначениеТарифа;
		КонецЕсли;	
		
		СтрокаНастройкиДиапазона["ОсталосьСписать" + Постфикс] = СтрокаНастройкиДиапазона["ОсталосьСписать" + Постфикс] - Списываем;
		Списали = Списали + Списываем;
		СписалиПоТЗ = СписалиПоТЗ + Списываем;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьРесурыРаспределения(Выборка) 
	
	РесурсыРаспределения = РезультатРаспределения[Выборка.Регистратор];  
	Если РесурсыРаспределения = Неопределено Тогда
		
		РесурсыРаспределения = Новый Структура(ОписаниеРесурсовРаспределения);
		РесурсыРаспределения.ТаблицаРаспределения = ШаблонТаблицыРаспределения.Скопировать();
		РесурсыРаспределения.СтрокиУдаления = ШаблонТаблицыРаспределения.Скопировать(, "Абонент,ТочкаУчета");
		
		РезультатРаспределения.Вставить(Выборка.Регистратор, РесурсыРаспределения);
		РесурсыРаспределения = РезультатРаспределения[Выборка.Регистратор];
		
	КонецЕсли;
	
	НоваяСтрокаУдаления = РесурсыРаспределения.СтрокиУдаления.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрокаУдаления, Выборка);

	Возврат РесурсыРаспределения;
	
КонецФункции  

Функция ОпределитьДолюПоТарифнойЗонеОтОбщегоОбъема(Выборка) 
	
	ДоляПоТарифнойЗонеОтОбщегоОбъема = ДоляОбъемаПоПериодам[Выборка.НачалоПериода];  
	Если ДоляПоТарифнойЗонеОтОбщегоОбъема = Неопределено Тогда
		
		ЭтоОбъемПотребленный = Новый Соответствие;
		ЭтоОбъемПотребленный.Вставить(Выборка.ЭтоОбъемПотребленный, ДоляПоТарифнойЗонеОтОбщегоОбъема(Выборка)); 
		
		ДоляОбъемаПоПериодам.Вставить(Выборка.НачалоПериода, ЭтоОбъемПотребленный);
		
	ИначеЕсли ДоляПоТарифнойЗонеОтОбщегоОбъема[Выборка.ЭтоОбъемПотребленный] = Неопределено Тогда 
		
		ДоляПоТарифнойЗонеОтОбщегоОбъема.Вставить(Выборка.ЭтоОбъемПотребленный, ДоляПоТарифнойЗонеОтОбщегоОбъема(Выборка));
		
	КонецЕсли;	
	
	ДоляПоТарифнойЗонеОтОбщегоОбъема = ДоляОбъемаПоПериодам[Выборка.НачалоПериода][Выборка.ЭтоОбъемПотребленный];
	Возврат ДоляПоТарифнойЗонеОтОбщегоОбъема;
	
КонецФункции

Функция ДоляПоТарифнойЗонеОтОбщегоОбъема(Выборка)
	
	Постфикс = ?(Выборка.ЭтоОбъемПотребленный, "Потребленный", "");
	Результат = Окр(Выборка["ОбъемУслугиПериода" + Постфикс] / Выборка["ОбщийОбъемУслуги" + Постфикс], ОкруглятьДолюДо);

	Возврат Результат;
	
КонецФункции

Процедура ОбновитьКлючиСмены(Выборка)
		
	ТекМКД = Выборка.МКД;
	ТекЧастныйСектор = Выборка.ЧастныйСектор;
	ТекАбонент = Выборка.Абонент;
	ТекБлагоустройство = Выборка.ВидБлагоустройства;
	
КонецПроцедуры

Функция ЗначениеТарифа(СтрокаНачисления)
	
	Результат = 0;
	
	ЗаполнитьЗначенияСвойств(ОтборЗначенияТарифа, СтрокаНачисления);
	ОтборЗначенияТарифа.ГруппаПотребителей = СтрокаНачисления.ТарифнаяГруппа;
	ОтборЗначенияТарифа.Диапазон = СтрокаНачисления.ДиапазонДифференцированногоТарифа;
	НайденныеСтроки = ЗначенияТарифов.НайтиСтроки(ОтборЗначенияТарифа);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Результат = НайденныеСтроки[0].Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область СменаКлючаМКД

Процедура ПриСменеМКД()
	
	Если НЕ ЕстьОшибкаВМКД Тогда 
		НаборыЗаписей = Новый Массив;
		Для Каждого КлючЗначениеРегистратор из РезультатРаспределения Цикл 
			
			ПодготовитьДанныеКЗаписи(НаборыЗаписей, КлючЗначениеРегистратор);
			
		КонецЦикла;
		
		ЗаписатьДанные(НаборыЗаписей);
		
	КонецЕсли;

	РезультатРаспределения.Очистить();
	
КонецПроцедуры

Процедура ПодготовитьДанныеКЗаписи(НаборыЗаписей, КлючЗначениеРегистратор)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиУдалить.Абонент КАК Абонент,
		|	СтрокиУдалить.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ СтрокиКУдалению
		|ИЗ
		|	&СтрокиУдалить КАК СтрокиУдалить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	 " + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "энргОбъемНачислений", "", Истина) + "
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтрокиКУдалению КАК СтрокиКУдалению
		|		ПО энргОбъемНачислений.Абонент = СтрокиКУдалению.Абонент
		|			И энргОбъемНачислений.ТочкаУчета = СтрокиКУдалению.ТочкаУчета
		|			И НЕ энргОбъемНачислений.ЭтоСписаниеНачислений
		|			И (ВЫБОР
		|				КОГДА &ЭтоСвязанныйПерерасчет
		|					ТОГДА энргОбъемНачислений.ОбъемУслугиПотребленный > 0
		|							ИЛИ энргОбъемНачислений.ОбъемУслуги > 0
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	энргОбъемНачислений.Регистратор = &Регистратор
		|	И СтрокиКУдалению.Абонент ЕСТЬ NULL";
	
	
	
	Запрос.УстановитьПараметр("Регистратор", КлючЗначениеРегистратор.Ключ);
	Запрос.УстановитьПараметр("СтрокиУдалить", КлючЗначениеРегистратор.Значение.СтрокиУдаления);
	Запрос.УстановитьПараметр("ЭтоСвязанныйПерерасчет", ТипЗнч(КлючЗначениеРегистратор.Ключ) = Тип("ДокументСсылка.энргПерерасчет"));
	
	РезультатЗапроса = Запрос.Выполнить();	
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(КлючЗначениеРегистратор.Значение.ТаблицаРаспределения, ТаблицаДанных);
	
	НаборЗаписи = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыНакопления.энргОбъемНачислений);
	НаборЗаписи.ОбменДанными.Загрузка = Истина;
	НаборЗаписи.Отбор.Регистратор.Установить(КлючЗначениеРегистратор.Ключ);
	НаборЗаписи.Загрузить(ТаблицаДанных);
	
	НаборыЗаписей.Добавить(НаборЗаписи);
	ДополнитьСвязанныеТаблицы(НаборыЗаписей, КлючЗначениеРегистратор, ТаблицаДанных);
		
КонецПроцедуры

Процедура ДополнитьСвязанныеТаблицы(НаборыЗаписей, КлючЗначениеРегистратор, ТаблицаДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	" + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "энргОбъемНачислений", "", Истина, Ложь) + "
	|	ВЫБОР
	|		КОГДА энргОбъемНачислений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргОбъемНачислений.Строение
	|	КОНЕЦ КАК МКД	
	|ПОМЕСТИТЬ ИсходнаяТаблицаДанных
	|ИЗ
	|	&ТаблицаДанных КАК энргОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "ИсходнаяТаблицаДанных", "", Истина) + "
	|ПОМЕСТИТЬ НаборОтложенные
	|ИЗ
	|	ИсходнаяТаблицаДанных КАК ИсходнаяТаблицаДанных
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НеобходимоЗаписыватьСредний
	|				ТОГДА ВЫБОР
	|						КОГДА ИсходнаяТаблицаДанных.УслугаОграничена
	|							ТОГДА ЛОЖЬ
	|						КОГДА ИсходнаяТаблицаДанных.ДоговорЗаключенДоТП
	|							ТОГДА ЛОЖЬ
	|						КОГДА ИсходнаяТаблицаДанных.Поставщик = ИсходнаяТаблицаДанных.ФизЛицо
	|							ТОГДА ЛОЖЬ
	|						КОГДА ИсходнаяТаблицаДанных.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|								И ИсходнаяТаблицаДанных.СниматьНачисленныйСредний
	|								И НЕ ИсходнаяТаблицаДанных.УслугаПолностьюОприборена
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + 
	ТекстЗапросаДанныеНачисленныйСреднийОбъем();
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Услуга КАК Услуга,
	|	СУММА(ОбъемНачислений.Сумма) КАК Сумма,
	|	СУММА(ОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги,
	|	СУММА(ОбъемНачислений.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
	|	СУММА(ОбъемНачислений.ОбъемУслугиПотери) КАК ОбъемУслугиПотери,
	|	СУММА(ОбъемНачислений.ОбъемУслугиПотребленныйПотери) КАК ОбъемУслугиПотребленныйПотери,
	|	МАКСИМУМ(ОбъемНачислений.Организация) КАК Организация,
	|	МАКСИМУМ(ОбъемНачислений.Период) КАК Период,
	|	МАКСИМУМ(&ПериодНачисления) КАК ПериодНачисления,
	|	МАКСИМУМ(ОбъемНачислений.МКД) КАК МКД,
	|	МАКСИМУМ(ОбъемНачислений.Район) КАК Район,
	|	МАКСИМУМ(ОбъемНачислений.Поставщик) КАК Поставщик
	|ИЗ
	|	ИсходнаяТаблицаДанных КАК ОбъемНачислений
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.Услуга
	|
	|ИМЕЮЩИЕ
	|	СУММА(ОбъемНачислений.Сумма) <> 0";
		
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("ПериодНачисления", ПараметрыОперации.ПериодНачисления);
	Запрос.УстановитьПараметр("НеобходимоЗаписыватьСредний", ТипЗнч(КлючЗначениеРегистратор.Ключ) = Тип("ДокументСсылка.энргНачисление"));
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОбщееЧислоПакетов = РезультатЗапроса.Количество();
	Результат = РезультатЗапроса[ОбщееЧислоПакетов - 1].Выгрузить();
	Если НЕ Результат.Количество() = 0 Тогда
		
		НаборЗаписи = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыНакопления.энргВзаиморасчеты);
		НаборЗаписи.ОбменДанными.Загрузка = Истина;
		НаборЗаписи.Отбор.Регистратор.Установить(КлючЗначениеРегистратор.Ключ);
		НаборЗаписи.Загрузить(Результат);
		
		НаборыЗаписей.Добавить(НаборЗаписи);
		
	КонецЕсли;
	
	Результат = РезультатЗапроса[ОбщееЧислоПакетов - 2].Выгрузить();
	Если НЕ Результат.Количество() = 0 Тогда
		
		НаборЗаписи = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыНакопления.энргНачисленныйСреднийОбъем);
		НаборЗаписи.ОбменДанными.Загрузка = Истина;
		НаборЗаписи.Отбор.Регистратор.Установить(КлючЗначениеРегистратор.Ключ);
		НаборЗаписи.Загрузить(Результат);
		
		НаборыЗаписей.Добавить(НаборЗаписи);
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ТекстЗапросаДанныеНачисленныйСреднийОбъем()
	Текст = 
	"ВЫБРАТЬ
	|	Набор.Период КАК Период,
	|	Набор.Район КАК Район,
	|	Набор.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоФормуламРасчета) КАК СпособНачисления,
	|	ВЫБОР
	|		КОГДА Набор.ВладелецЗависимойТочкиУчета = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|			ТОГДА Набор.Абонент
	|		ИНАЧЕ Набор.ВладелецЗависимойТочкиУчета
	|	КОНЕЦ КАК Абонент,
	|	Набор.Услуга КАК Услуга,
	|	Набор.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Набор.ЗависимаяТочкаУчета КАК ТочкаУчета,
	|	ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка) КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(СПравочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	ЗНАЧЕНИЕ(СПравочник.энргТарифныеЗоны.БезРазбивки) КАК ТарифнаяЗона,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	-ВЫБОР
	|		КОГДА Набор.Техническая
	|			ТОГДА Набор.ОбъемУслугиТехнический
	|		ИНАЧЕ Набор.ОбъемУслуги
	|	КОНЕЦ * Набор.КоэффициентФормула КАК ОбъемУслуги,
	|	-Набор.ОбъемУслугиПотребленный * Набор.КоэффициентФормула КАК ОбъемУслугиПотребленный,
	|	-Набор.ОбъемУслугиПотери * Набор.КоэффициентФормула КАК ОбъемУслугиПотери,
	|	-Набор.ОбъемУслугиПотребленныйПотери * Набор.КоэффициентФормула КАК ОбъемУслугиПотребленныйПотери,
	|	-Набор.Сумма * Набор.КоэффициентФормула КАК Сумма,
	|	Набор.Поставщик КАК Поставщик,
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ЧастныйСектор КАК ЧастныйСектор,
	|	Набор.ПериодНачисления КАК ПериодНачисления,
	|	Набор.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	Набор.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Набор.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Набор.КоэффициентФормула КАК КоэффициентФормула,
	|	ЛОЖЬ КАК ИзменятьВзаиморасчеты,
	|	Набор.СверхНорматива КАК СверхНорматива,
	|	Набор.ВидБлагоустройства КАК ВидБлагоустройства,
	|	Набор.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	Набор.НормаПотребления КАК НормаПотребления
	|ПОМЕСТИТЬ Промежуточная_СниматьНачисленныйСреднийПоФормулам
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	(НЕ Набор.Сумма = 0
	|			ИЛИ НЕ Набор.ОбъемУслуги = 0
	|			ИЛИ НЕ Набор.ОбъемУслугиПотребленный = 0)
	|	И Набор.СниматьНачисленныйСреднийПоФормулам
	|	И Набор.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоПриборам)
	|	И НЕ Набор.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Набор.ЗависимаяТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТдляВсехСоставныхУслуг
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	НЕ Набор.СоставнаяУслуга = ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТдляВсехСоставныхУслуг.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВТдляВсехСоставныхУслуг.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТдляСоставныхУслуг
	|ИЗ
	|	ВТдляВсехСоставныхУслуг КАК ВТдляВсехСоставныхУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Промежуточная_СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам1
	|		ПО ВТдляВсехСоставныхУслуг.ТочкаУчета = СниматьНачисленныйСреднийПоФормулам1.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.СоставнаяУслуга КАК СоставнаяУслуга,
	|	Набор.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ СгруппированныеТУ
	|ИЗ
	|	ВТдляСоставныхУслуг КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.СоставнаяУслуга,
	|	Набор.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТдляСоставныхУслуг.ТочкаУчета КАК ТочкаУчета,
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ПОМЕСТИТЬ ТУ_Услуги
	|ИЗ
	|	ВТдляСоставныхУслуг КАК ВТдляСоставныхУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВТдляСоставныхУслуг.СоставнаяУслуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТдляСоставныхУслуг.ТочкаУчета,
	|	энргВидыУслугСоставляющиеУслуг.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ВидБлагоустройства КАК ВидБлагоустройства,
	|	Набор.НормаПотребления КАК НормаПотребления,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТочкаУчета КАК ТочкаУчета,
	|	Набор.Услуга КАК Услуга,
	|	ЗНАЧЕНИЕ(СПравочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТдляВсехТУ
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	Набор.ЗависимаяТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТдляВсехТУ.Строение КАК Строение,
	|	ВТдляВсехТУ.Помещение КАК Помещение,
	|	МАКСИМУМ(ВТдляВсехТУ.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	МАКСИМУМ(ВТдляВсехТУ.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	МАКСИМУМ(ВТдляВсехТУ.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	МАКСИМУМ(ВТдляВсехТУ.НормаПотребления) КАК НормаПотребления,
	|	ВТдляВсехТУ.ТочкаУчета КАК ТочкаУчета,
	|	ВТдляВсехТУ.Услуга КАК Услуга,
	|	ВТдляВсехТУ.Шкала КАК Шкала,
	|	ВТдляВсехТУ.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ВТдляВсехТУСгруппированная
	|ИЗ
	|	ВТдляВсехТУ КАК ВТдляВсехТУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТдляВсехТУ.Строение,
	|	ВТдляВсехТУ.Помещение,
	|	ВТдляВсехТУ.ТочкаУчета,
	|	ВТдляВсехТУ.Услуга,
	|	ВТдляВсехТУ.Шкала,
	|	ВТдляВсехТУ.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Период КАК Период,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Район КАК Район,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Организация КАК Организация,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СпособНачисления КАК СпособНачисления,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Абонент КАК Абонент,
	|	ЕСТЬNULL(СгруппированныеТУ.Услуга, Промежуточная_СниматьНачисленныйСреднийПоФормулам.Услуга) КАК Услуга,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТочкаУчета КАК ТочкаУчета,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ПриборУчета КАК ПриборУчета,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Шкала КАК Шкала,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.ЗначениеТарифа, Промежуточная_СниматьНачисленныйСреднийПоФормулам.ЗначениеТарифа) КАК ЗначениеТарифа,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.ТарифнаяГруппа, Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТарифнаяГруппа) КАК ТарифнаяГруппа,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслуги КАК ОбъемУслуги,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Сумма КАК Сумма,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.Поставщик КАК Поставщик,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.Строение, Промежуточная_СниматьНачисленныйСреднийПоФормулам.Строение) КАК Строение,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.Помещение, Промежуточная_СниматьНачисленныйСреднийПоФормулам.Помещение) КАК Помещение,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ЧастныйСектор КАК ЧастныйСектор,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ПериодНачисления КАК ПериодНачисления,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.КоэффициентФормула КАК КоэффициентФормула,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.СверхНорматива КАК СверхНорматива,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.ВидБлагоустройства, Промежуточная_СниматьНачисленныйСреднийПоФормулам.ВидБлагоустройства) КАК ВидБлагоустройства,
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	ЕСТЬNULL(ВТдляВсехТУСгруппированная.НормаПотребления, Промежуточная_СниматьНачисленныйСреднийПоФормулам.НормаПотребления) КАК НормаПотребления
	|ПОМЕСТИТЬ тестСниматьНачисленныйСреднийПоФормулам
	|ИЗ
	|	Промежуточная_СниматьНачисленныйСреднийПоФормулам КАК Промежуточная_СниматьНачисленныйСреднийПоФормулам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТУ_Услуги КАК СгруппированныеТУ
	|		ПО Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТочкаУчета = СгруппированныеТУ.ТочкаУчета
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.Услуга = СгруппированныеТУ.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТдляВсехТУСгруппированная КАК ВТдляВсехТУСгруппированная
	|		ПО Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТочкаУчета = ВТдляВсехТУСгруппированная.ТочкаУчета
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.Услуга = ВТдляВсехТУСгруппированная.Услуга
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.Шкала = ВТдляВсехТУСгруппированная.Шкала
	|			И Промежуточная_СниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона = ВТдляВсехТУСгруппированная.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.Период КАК Период,
	|	Набор.Организация КАК Организация,
	|	Набор.Район КАК Район,
	|	Набор.СпособНачисления КАК СпособНачисления,
	|	Набор.Абонент КАК Абонент,
	|	Набор.Услуга КАК Услуга,
	|	Набор.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	Набор.ТочкаУчета КАК ТочкаУчета,
	|	Набор.ПриборУчета КАК ПриборУчета,
	|	Набор.Шкала КАК Шкала,
	|	Набор.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Набор.ЗначениеТарифа КАК ЗначениеТарифа,
	|	Набор.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	Набор.ОбъемУслуги * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслуги,
	|	Набор.ОбъемУслугиПотребленный * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслугиПотребленный,
	|	Набор.ОбъемУслугиПотери * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслугиПотери,
	|	Набор.ОбъемУслугиПотребленныйПотери * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйПотери,
	|	Набор.Сумма * ВЫБОР
	|		КОГДА Набор.СпособНачисления = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСпособНачислений.ПоПриборам)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Сумма,
	|	Набор.Поставщик КАК Поставщик,
	|	Набор.Строение КАК Строение,
	|	Набор.Помещение КАК Помещение,
	|	Набор.ЧастныйСектор КАК ЧастныйСектор,
	|	Набор.ПериодНачисления КАК ПериодНачисления,
	|	Набор.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	Набор.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	Набор.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	Набор.КоэффициентФормула КАК КоэффициентФормула,
	|	ЛОЖЬ КАК ИзменятьВзаиморасчеты,
	|	Набор.СверхНорматива КАК СверхНорматива,
	|	Набор.ВидБлагоустройства КАК ВидБлагоустройства, 
	|	Набор.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	Набор.НормаПотребления КАК НормаПотребления
	|ПОМЕСТИТЬ СниматьНачисленныйСредний
	|ИЗ
	|	&НаборОтложенные КАК Набор
	|ГДЕ
	|	(НЕ Набор.Сумма = 0
	|			ИЛИ НЕ Набор.ОбъемУслуги = 0
	|			ИЛИ НЕ Набор.ОбъемУслугиПотребленный = 0)
	|	И (Набор.СниматьНачисленныйСредний
	|			ИЛИ Набор.СниматьНачисленныйСреднийЗависимыхТочек)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	табСниматьНачисленныйСреднийПоФормулам.Период КАК Период,
	|	табСниматьНачисленныйСреднийПоФормулам.Организация КАК Организация,
	|	табСниматьНачисленныйСреднийПоФормулам.Район КАК Район,
	|	табСниматьНачисленныйСреднийПоФормулам.СпособНачисления КАК СпособНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	|	табСниматьНачисленныйСреднийПоФормулам.Абонент КАК Абонент,
	|	табСниматьНачисленныйСреднийПоФормулам.Услуга КАК Услуга,
	|	табСниматьНачисленныйСреднийПоФормулам.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	табСниматьНачисленныйСреднийПоФормулам.ТочкаУчета КАК ТочкаУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.ПриборУчета КАК ПриборУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.Шкала КАК Шкала,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона КАК ТарифнаяЗона,
	|	табСниматьНачисленныйСреднийПоФормулам.ЗначениеТарифа КАК ЗначениеТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	табСниматьНачисленныйСреднийПоФормулам.Сумма КАК Сумма,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслуги КАК ОбъемУслуги,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ табСниматьНачисленныйСреднийПоФормулам.Строение
	|	КОНЕЦ КАК МКД,
	|	табСниматьНачисленныйСреднийПоФормулам.Строение КАК Строение,
	|	табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор КАК ЧастныйСектор,
	|	табСниматьНачисленныйСреднийПоФормулам.Помещение КАК Помещение,
	|	табСниматьНачисленныйСреднийПоФормулам.Поставщик КАК Поставщик,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийПоФормулам КАК СниматьНачисленныйСреднийПоФормулам,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
	|	табСниматьНачисленныйСреднийПоФормулам.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты,
	|	табСниматьНачисленныйСреднийПоФормулам.СверхНорматива КАК СверхНорматива,
	|	табСниматьНачисленныйСреднийПоФормулам.ВидБлагоустройства КАК ВидБлагоустройства,
	|	табСниматьНачисленныйСреднийПоФормулам.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.НормаПотребления КАК НормаПотребления
	|ПОМЕСТИТЬ ПромежуточныйИтог
	|ИЗ
	|	тестСниматьНачисленныйСреднийПоФормулам КАК табСниматьНачисленныйСреднийПоФормулам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	табСниматьНачисленныйСреднийПоФормулам.Период,
	|	табСниматьНачисленныйСреднийПоФормулам.Организация,
	|	табСниматьНачисленныйСреднийПоФормулам.Район,
	|	табСниматьНачисленныйСреднийПоФормулам.СпособНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление),
	|	табСниматьНачисленныйСреднийПоФормулам.Абонент,
	|	табСниматьНачисленныйСреднийПоФормулам.Услуга,
	|	табСниматьНачисленныйСреднийПоФормулам.НаправлениеИспользованияТУ,
	|	табСниматьНачисленныйСреднийПоФормулам.ТочкаУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.ПриборУчета,
	|	табСниматьНачисленныйСреднийПоФормулам.Шкала,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяЗона,
	|	табСниматьНачисленныйСреднийПоФормулам.ЗначениеТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.ТарифнаяГруппа,
	|	табСниматьНачисленныйСреднийПоФормулам.Сумма,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслуги,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленный,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ОбъемУслугиПотребленныйПотери,
	|	табСниматьНачисленныйСреднийПоФормулам.ПериодНачисления,
	|	ВЫБОР
	|		КОГДА табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ табСниматьНачисленныйСреднийПоФормулам.Строение
	|	КОНЕЦ,
	|	табСниматьНачисленныйСреднийПоФормулам.Строение,
	|	табСниматьНачисленныйСреднийПоФормулам.ЧастныйСектор,
	|	табСниматьНачисленныйСреднийПоФормулам.Помещение,
	|	табСниматьНачисленныйСреднийПоФормулам.Поставщик,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийПоФормулам,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСредний,
	|	табСниматьНачисленныйСреднийПоФормулам.СниматьНачисленныйСреднийЗависимыхТочек,
	|	табСниматьНачисленныйСреднийПоФормулам.ИзменятьВзаиморасчеты,
	|	табСниматьНачисленныйСреднийПоФормулам.СверхНорматива,
	|	табСниматьНачисленныйСреднийПоФормулам.ВидБлагоустройства,
	|	табСниматьНачисленныйСреднийПоФормулам.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	табСниматьНачисленныйСреднийПоФормулам.НормаПотребления
	|ИЗ
	|	СниматьНачисленныйСредний КАК табСниматьНачисленныйСреднийПоФормулам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПромежуточныйИтог.Организация КАК Организация,
	|	ПромежуточныйИтог.СпособНачисления КАК СпособНачисления,
	|	ПромежуточныйИтог.ВидНачисления КАК ВидНачисления,
	|	ПромежуточныйИтог.Абонент КАК Абонент,
	|	ПромежуточныйИтог.Услуга КАК Услуга,
	|	ПромежуточныйИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ПромежуточныйИтог.ТочкаУчета КАК ТочкаУчета,
	|	ПромежуточныйИтог.ПриборУчета КАК ПриборУчета,
	|	ПромежуточныйИтог.Шкала КАК Шкала,
	|	ПромежуточныйИтог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПромежуточныйИтог.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ПромежуточныйИтог.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ПромежуточныйИтог.Сумма КАК Сумма,
	|	ПромежуточныйИтог.ОбъемУслуги КАК ОбъемУслуги,
	|	ПромежуточныйИтог.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ПромежуточныйИтог.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	ПромежуточныйИтог.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	ПромежуточныйИтог.Период КАК Период,
	|	ПромежуточныйИтог.ПериодНачисления КАК ПериодНачисления,
	|	ПромежуточныйИтог.МКД КАК МКД,
	|	ПромежуточныйИтог.Строение КАК Строение,
	|	ПромежуточныйИтог.ЧастныйСектор КАК ЧастныйСектор,
	|	ПромежуточныйИтог.Район КАК Район,
	|	ПромежуточныйИтог.Помещение КАК Помещение,
	|	ПромежуточныйИтог.Поставщик КАК Поставщик,
	|	ПромежуточныйИтог.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	ПромежуточныйИтог.ИзменятьВзаиморасчеты КАК ИзменятьВзаиморасчеты,
	|	ПромежуточныйИтог.СверхНорматива КАК СверхНорматива,
	|	ПромежуточныйИтог.ВидБлагоустройства КАК ВидБлагоустройства, 
	|	ПромежуточныйИтог.ДиапазонДифференцированногоТарифа КАК ДиапазонДифференцированногоТарифа,
	|	ПромежуточныйИтог.НормаПотребления КАК НормаПотребления
	|ИЗ
	|	ПромежуточныйИтог КАК ПромежуточныйИтог
	|ГДЕ
	|	(НЕ ПромежуточныйИтог.ОбъемУслуги = 0
	|			ИЛИ НЕ ПромежуточныйИтог.ОбъемУслугиПотребленный = 0)"; 
	
	
	Текст = СтрЗаменить(Текст, "&НаборОтложенные", "НаборОтложенные");	
	Возврат Текст;
	
КонецФункции

Процедура ЗаписатьДанные(НаборыЗаписей)
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого НаборЗаписи Из НаборыЗаписей Цикл
			 
			НаборЗаписи.Записать();
			
		КонецЦикла;
				
		ЗафиксироватьТранзакцию();
	
	Исключение               
		
	    ОтменитьТранзакцию();
		
		Инфо = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Инфо);
		
		Комментарий = СтрШаблон(
			ШаблонОшибки,
			ПараметрыОперации.ПериодНачисления,
			ПараметрыОперации.Организация,
			ПараметрыОперации.Район,
			ТекЧастныйСектор,
			ТекМКД,
			ПодробноеПредставлениеОшибки); 
		
		Ошибки.Добавить(Комментарий);	
		
		ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		Справочники,
		ТекМКД,
		Комментарий);		
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СменаКлючаАбонента

Процедура ПриСменеАбонента(Выборка)
	
	ДоляОбъемаПоПериодам.Очистить();
	ОбновитьНастройкуДиапазонов(Выборка);
	
КонецПроцедуры

Процедура ОбновитьНастройкуДиапазонов(Выборка)
	
	ЛокальнаяНастройкаДиапазонов.Очистить();
	НайденныеСтроки = НастройкаДиапазонов.НайтиСтроки(Новый Структура("Услуга,ВидБлагоустройства", Выборка.Услуга, Выборка.ВидБлагоустройства));		
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		//Если НайденнаяСтрока.Диапазон > Выборка.МаксимальныйДиапазон Тогда
		//	Возврат;
		//КонецЕсли;
		
		ОбщееУвеличениеЛимитаПервогоДиапазона = 0;
		ЛимитУвеличен = Ложь;
		Если НайденнаяСтрока.Диапазон = ПараметрыОперации.Диапазон Тогда			
			ОбщееУвеличениеЛимитаПервогоДиапазона = - Выборка.ОбъемУслугиПериодаОбщийОтрицательный;
			ЛимитУвеличен = Выборка.ОбъемУслугиПериодаОбщийОтрицательный < 0;
		КонецЕсли;
		
		НоваяСтрока = Новый Структура(ОписаниеСтрокиНастройкиДиапазонов);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
		НоваяСтрока.Разница = ((НайденнаяСтрока.До - НайденнаяСтрока.От) * Выборка.КоэффициентИзмененияЛимитаДиапазона) + ОбщееУвеличениеЛимитаПервогоДиапазона;
		НоваяСтрока.ОсталосьСписать = НоваяСтрока.Разница;
		НоваяСтрока.ОсталосьСписатьПотребленный = НоваяСтрока.Разница;
		НоваяСтрока.ЛимитУвеличен = ЛимитУвеличен;
		
		ЛокальнаяНастройкаДиапазонов.Добавить(НоваяСтрока);
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПолучениеДанных

Функция ЕстьУслугиКУстановкеЗначенияТарифов(МВТ)
	
	СпособРасчета = Перечисления.энргТерриториальныеСпособыРасчета.ДифференцированныеТарифы;
	
	Схема = Неопределено;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыОтбора	 = Новый Структура;
	ПараметрыВТ 	 = Новый Массив;
	
	Отборы = Новый Структура(
	"Организация,Район,СпособРасчета", 
	"Организация",
	"Район",	
	"СпособРасчета");
	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Отборы)); 		
	ПараметрыОтбора.Вставить("Период", Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));	
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);

	ПараметрыЗапроса.Вставить("Период", ПараметрыОперации.ПериодНачисления);
	ПараметрыЗапроса.Вставить("Организация", ПараметрыОперации.Организация);
	ПараметрыЗапроса.Вставить("Район", ПараметрыОперации.Район);
	ПараметрыЗапроса.Вставить("СпособРасчета", СпособРасчета);
	
	РегистрыСведений.энргТерриториальныеСпособыРасчета.АктуальныеДанныеСрезПоследних(Схема, ПараметрыОтбора, "УслугиСДифференцированнымТарифом");	
	энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса, МВТ);	
	
	РезультатЗапроса = МВТ.Таблицы[0].ПолучитьДанные();
	Возврат НЕ РезультатЗапроса.Пустой();	
	
КонецФункции 

Процедура ПрочитатьНастройки(МВТ)
	
	Схема = Неопределено;
	ПараметрыЗапроса = Новый Структура;
	ПараметрыОтбора	 = Новый Структура;
	ПараметрыВТ 	 = Новый Массив;
	
	Отборы = Новый Структура(
	"Организация,Район", 
	"Организация",
	"Район");
	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Отборы));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("УслугиСДифференцированнымТарифом", Новый Структура("Услуга", "Услуга")));
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);
	ПараметрыОтбора.Вставить(энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));  

	ПараметрыЗапроса.Вставить("Период", ПараметрыОперации.ПериодНачисления);
	ПараметрыЗапроса.Вставить("Организация", ПараметрыОперации.Организация);
	ПараметрыЗапроса.Вставить("Район", ПараметрыОперации.Район);
	
	РегистрыСведений.энргНастройкаДиапазоновДифференцированногоТарифа.АктуальныеДанныеСрезПоследних(Схема, ПараметрыОтбора, "НастройкиДиапазоновДифференцированногоТарифа");
	РегистрыСведений.энргЗначенияТарифовДиапазоновДифференцированногоТарифа.АктуальныеДанныеСрезПоследних(Схема, ПараметрыОтбора, "ЗначенияТарифовДиапазоновДифференцированногоТарифа");
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса, МВТ);

    НастройкаДиапазонов = МВТ.Таблицы[2].ПолучитьДанные().Выгрузить();
	НастройкаДиапазонов.Сортировать("Услуга, ВидБлагоустройства, ПриоритетДиапазона");
	НастройкаДиапазонов.Индексы.Добавить("Услуга, ВидБлагоустройства");	
	
	ЗначенияТарифов = МВТ.Таблицы[3].ПолучитьДанные().Выгрузить();	
	ЗначенияТарифов.Индексы.Добавить("Услуга, ГруппаПотребителей, ТарифнаяЗона, Диапазон"); 
	
КонецПроцедуры

Функция ДокументыКУстановкеЗначенийТарифов(МВТ)
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = ТекстЗапросаДокументыКУстановкеЗначенийТарифов(); 
	
	Если НЕ ЗначениеЗаполнено(ПараметрыОперации.ЧастныйСектор) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргОбъемНачислений.ЧастныйСектор = &ЧастныйСектор", "");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыОперации.Строения) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргОбъемНачислений.Строение В(&Строения)", "");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыОперации.Абонент) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргОбъемНачислений.Абонент = &Абонент", "");
	КонецЕсли;                                                                                   	
	
	Запрос.УстановитьПараметр("НП", ПараметрыОперации.НачалоОП);
	Запрос.УстановитьПараметр("КП", ПараметрыОперации.ЗавершениеОП - 1);	
	Запрос.УстановитьПараметр("Организация", ПараметрыОперации.Организация);
	Запрос.УстановитьПараметр("Район", ПараметрыОперации.Район);      
	Запрос.УстановитьПараметр("ЧастныйСектор", ПараметрыОперации.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строения", ПараметрыОперации.Строения);
	Запрос.УстановитьПараметр("Абонент", ПараметрыОперации.Абонент);
	Запрос.УстановитьПараметр("Диапазон", ПараметрыОперации.Диапазон);

	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;	
	
КонецФункции

Функция ТекстЗапросаДокументыКУстановкеЗначенийТарифов()
	
	Текст = 
	"ВЫБРАТЬ
	|	" + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "энргОбъемНачислений", "НачалоПериода", Истина, Ложь) + "
	|	ВЫБОР
	|		КОГДА энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет
	|				И ВЫРАЗИТЬ(энргОбъемНачислений.Регистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|				И энргОбъемНачислений.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &НП
	|		ИНАЧЕ энргОбъемНачислений.НачалоПериода
	|	КОНЕЦ КАК НачалоПериода,
	|	энргОбъемНачислений.НачалоПериода КАК НачалоПериодаОригинал,	
	|	ВЫБОР
	|		КОГДА энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргНачисление
	|			ТОГДА 1
	|		КОГДА энргОбъемНачислений.Регистратор ССЫЛКА Документ.энргПерерасчет
	|				И ВЫРАЗИТЬ(энргОбъемНачислений.Регистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриоритетРегистратора
	|ПОМЕСТИТЬ НачисленныеОбъемы
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	энргОбъемНачислений.Период МЕЖДУ &НП И &КП
	|	И энргОбъемНачислений.Организация = &Организация
	|	И энргОбъемНачислений.Район = &Район
	|	И НЕ энргОбъемНачислений.Распределение
	|	И энргОбъемНачислений.ЧастныйСектор = &ЧастныйСектор
	|	И энргОбъемНачислений.Строение В(&Строения)
	|	И энргОбъемНачислений.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленныеОбъемы.Абонент КАК Абонент,
	|	НачисленныеОбъемы.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(НачисленныеОбъемы.ПриоритетРегистратора) КАК ПриоритетРегистратора
	|ПОМЕСТИТЬ МаксимальныйПриоритетРегистратораТочекУчета
	|ИЗ
	|	НачисленныеОбъемы КАК НачисленныеОбъемы
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленныеОбъемы.Абонент,
	|	НачисленныеОбъемы.ТочкаУчета
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(НачисленныеОбъемы.ПриоритетРегистратора) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленныеОбъемы.Абонент КАК Абонент,
	|	НачисленныеОбъемы.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(НачисленныеОбъемы.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ РегистраторыТочекУчета
	|ИЗ
	|	МаксимальныйПриоритетРегистратораТочекУчета КАК МаксимальныйПриоритетРегистратораТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленныеОбъемы КАК НачисленныеОбъемы
	|		ПО МаксимальныйПриоритетРегистратораТочекУчета.Абонент = НачисленныеОбъемы.Абонент
	|			И МаксимальныйПриоритетРегистратораТочекУчета.ТочкаУчета = НачисленныеОбъемы.ТочкаУчета
	|			И МаксимальныйПриоритетРегистратораТочекУчета.ПриоритетРегистратора = НачисленныеОбъемы.ПриоритетРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленныеОбъемы.Абонент,
	|	НачисленныеОбъемы.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст = Текст + КоэффициентыИзмененияЛимитовДифференцированныхТарифов();
	Текст = Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	
	"ВЫБРАТЬ
	|	" + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "НачисленныеОбъемы", "", Истина, Ложь) + "
	|	НачисленныеОбъемы.НачалоПериодаОригинал КАК НачалоПериодаОригинал,
	|	ЕСТЬNULL(КоэффициентыИзмененияЛимитовДифференцированныхТарифов.Коэффициент, 1) КАК КоэффициентИзмененияЛимитаДиапазона
	|ПОМЕСТИТЬ ДанныеКРаспределению
	|ИЗ
	|	РегистраторыТочекУчета КАК РегистраторыТочекУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленныеОбъемы КАК НачисленныеОбъемы	
	|			ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыИзмененияЛимитовДифференцированныхТарифов КАК КоэффициентыИзмененияЛимитовДифференцированныхТарифов
	|			ПО НачисленныеОбъемы.Организация = КоэффициентыИзмененияЛимитовДифференцированныхТарифов.Организация
	|				И НачисленныеОбъемы.Район = КоэффициентыИзмененияЛимитовДифференцированныхТарифов.Район
	|				И НачисленныеОбъемы.Абонент = КоэффициентыИзмененияЛимитовДифференцированныхТарифов.Абонент	
	|		ПО РегистраторыТочекУчета.Абонент = НачисленныеОбъемы.Абонент
	|			И РегистраторыТочекУчета.ТочкаУчета = НачисленныеОбъемы.ТочкаУчета
	|			И РегистраторыТочекУчета.Регистратор = НачисленныеОбъемы.Регистратор
	|			И (ВЫБОР
	|				КОГДА РегистраторыТочекУчета.Регистратор ССЫЛКА Документ.энргПерерасчет
	|						И ВЫРАЗИТЬ(НачисленныеОбъемы.Регистратор КАК Документ.энргПерерасчет).ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет)
	|					ТОГДА НЕ НачисленныеОбъемы.ЭтоСписаниеНачислений
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
    |	МинимальныйПриоритетДиапазона.Абонент КАК Абонент,
    |	МинимальныйПриоритетДиапазона.Услуга КАК Услуга,
    |	МинимальныйПриоритетДиапазона.ВидБлагоустройства КАК ВидБлагоустройства,
    |	МинимальныйПриоритетДиапазона.ОбщийОбъемПоВидуБлагоустройства КАК ОбщийОбъемПоВидуБлагоустройства,
    |	МинимальныйПриоритетДиапазона.ОбщийОбъемПотребленныйПоВидуБлагоустройства КАК ОбщийОбъемПотребленныйПоВидуБлагоустройства,
    |	энргНастройкаДиапазоновДифференцированногоТарифа.Диапазон КАК МаксимальныйДиапазон,
    |	МинимальныйПриоритетДиапазона.ОбщийОбъемУслуги КАК ОбщийОбъемУслуги,
    |	МинимальныйПриоритетДиапазона.ОбщийОбъемУслугиПотребленный КАК ОбщийОбъемУслугиПотребленный
    |ПОМЕСТИТЬ ДиапазоныСтрок
    |ИЗ
    |	(ВЫБРАТЬ
    |		СгруппированныеОбъемы.Абонент КАК Абонент,
    |		СгруппированныеОбъемы.Услуга КАК Услуга,
    |		СгруппированныеОбъемы.ВидБлагоустройства КАК ВидБлагоустройства,
    |		СгруппированныеОбъемы.ОбъемУслуги КАК ОбщийОбъемПоВидуБлагоустройства,
    |		СгруппированныеОбъемы.ОбъемУслугиПотребленный КАК ОбщийОбъемПотребленныйПоВидуБлагоустройства,
    |		СгруппированныеОбъемы.ОбщийОбъемУслуги КАК ОбщийОбъемУслуги,
    |		СгруппированныеОбъемы.ОбщийОбъемУслугиПотребленный КАК ОбщийОбъемУслугиПотребленный,
    |		МИНИМУМ(энргНастройкаДиапазоновДифференцированногоТарифа.ПриоритетДиапазона) КАК ПриоритетДиапазона
    |	ИЗ
    |		(ВЫБРАТЬ
    |			ДанныеКРаспределению.Абонент КАК Абонент,
	|			ДанныеКРаспределению.КоэффициентИзмененияЛимитаДиапазона КАК КоэффициентИзмененияЛимитаДиапазона,
    |			ДанныеКРаспределению.Услуга КАК Услуга,
    |			ДанныеКРаспределению.ВидБлагоустройства КАК ВидБлагоустройства,
    |			СУММА(ДанныеКРаспределению.ОбъемУслуги) КАК ОбъемУслуги,
    |			МАКСИМУМ(ВложенныйЗапрос.ОбъемУслуги) КАК ОбщийОбъемУслуги,
    |			СУММА(ДанныеКРаспределению.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
    |			МАКСИМУМ(ВложенныйЗапрос.ОбъемУслугиПотребленный) КАК ОбщийОбъемУслугиПотребленный
    |		ИЗ
    |			(ВЫБРАТЬ
    |				ДанныеКРаспределению.Абонент КАК Абонент,
	|				МАКСИМУМ(ДанныеКРаспределению.КоэффициентИзмененияЛимитаДиапазона) КАК КоэффициентИзмененияЛимитаДиапазона,	
    |				ДанныеКРаспределению.Услуга КАК Услуга,
    |				СУММА(ДанныеКРаспределению.ОбъемУслуги) КАК ОбъемУслуги,
    |				СУММА(ДанныеКРаспределению.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный
    |			ИЗ
    |				ДанныеКРаспределению КАК ДанныеКРаспределению
    |			
    |			СГРУППИРОВАТЬ ПО
    |				ДанныеКРаспределению.Абонент,
    |				ДанныеКРаспределению.Услуга) КАК ВложенныйЗапрос
    |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеКРаспределению КАК ДанныеКРаспределению
    |				ПО ВложенныйЗапрос.Абонент = ДанныеКРаспределению.Абонент
    |					И ВложенныйЗапрос.Услуга = ДанныеКРаспределению.Услуга
    |		
    |		СГРУППИРОВАТЬ ПО
    |			ДанныеКРаспределению.ВидБлагоустройства,
	|			ДанныеКРаспределению.КоэффициентИзмененияЛимитаДиапазона,
    |			ДанныеКРаспределению.Услуга,
    |			ДанныеКРаспределению.Абонент) КАК СгруппированныеОбъемы
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиДиапазоновДифференцированногоТарифа КАК энргНастройкаДиапазоновДифференцированногоТарифа
    |			ПО СгруппированныеОбъемы.Услуга = энргНастройкаДиапазоновДифференцированногоТарифа.Услуга
    |				И СгруппированныеОбъемы.ВидБлагоустройства = энргНастройкаДиапазоновДифференцированногоТарифа.ВидБлагоустройства
    |				И СгруппированныеОбъемы.ОбщийОбъемУслуги < (энргНастройкаДиапазоновДифференцированногоТарифа.СуммарныйОбъемПредыдущихДиапазоновВключаяТекущий * СгруппированныеОбъемы.КоэффициентИзмененияЛимитаДиапазона)
    |	
    |	СГРУППИРОВАТЬ ПО
    |		СгруппированныеОбъемы.Абонент,
    |		СгруппированныеОбъемы.Услуга,
    |		СгруппированныеОбъемы.ВидБлагоустройства,
    |		СгруппированныеОбъемы.ОбъемУслуги,
    |		СгруппированныеОбъемы.ОбъемУслугиПотребленный,
    |		СгруппированныеОбъемы.ОбщийОбъемУслуги,
    |		СгруппированныеОбъемы.ОбщийОбъемУслугиПотребленный) КАК МинимальныйПриоритетДиапазона
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиДиапазоновДифференцированногоТарифа КАК энргНастройкаДиапазоновДифференцированногоТарифа
    |		ПО МинимальныйПриоритетДиапазона.Услуга = энргНастройкаДиапазоновДифференцированногоТарифа.Услуга
    |			И МинимальныйПриоритетДиапазона.ВидБлагоустройства = энргНастройкаДиапазоновДифференцированногоТарифа.ВидБлагоустройства
    |			И МинимальныйПриоритетДиапазона.ПриоритетДиапазона = энргНастройкаДиапазоновДифференцированногоТарифа.ПриоритетДиапазона
    |ГДЕ
    |	НЕ энргНастройкаДиапазоновДифференцированногоТарифа.Диапазон = &Диапазон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКРаспределению.Абонент КАК Абонент,
	|	ДанныеКРаспределению.Услуга КАК Услуга,
	|	ДанныеКРаспределению.НачалоПериода КАК НачалоПериода,
	|	СУММА(ДанныеКРаспределению.ОбъемУслуги) КАК ОбъемУслугиПериода,
	|	СУММА(ДанныеКРаспределению.ОбъемУслугиПотребленный) КАК ОбъемУслугиПериодаПотребленный
	|ПОМЕСТИТЬ ОбъемыВРазрезеПериодов
	|ИЗ
	|	ДанныеКРаспределению КАК ДанныеКРаспределению
	|ГДЕ
	|	(ДанныеКРаспределению.Абонент, ДанныеКРаспределению.Услуга) В
	|			(ВЫБРАТЬ
	|				ДиапазоныСтрок.Абонент КАК Абонент,
	|				ДиапазоныСтрок.Услуга КАК Услуга
	|			ИЗ
	|				ДиапазоныСтрок КАК ДиапазоныСтрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеКРаспределению.Абонент,
	|	ДанныеКРаспределению.НачалоПериода,
	|	ДанныеКРаспределению.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ	
	|	" + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "ДанныеКРаспределению", "", Истина, Ложь) + "
	|	ВЫБОР
	|		КОГДА ДанныеКРаспределению.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ ДанныеКРаспределению.Строение
	|	КОНЕЦ КАК МКД,
	|	ДанныеКРаспределению.НачалоПериодаОригинал КАК НачалоПериодаОригинал,
	|	ДанныеКРаспределению.КоэффициентИзмененияЛимитаДиапазона КАК КоэффициентИзмененияЛимитаДиапазона,
	|	ДиапазоныСтрок.МаксимальныйДиапазон КАК МаксимальныйДиапазон,
	|	ДиапазоныСтрок.ОбщийОбъемПоВидуБлагоустройства КАК ОбщийОбъемПоВидуБлагоустройства,
	|	ДиапазоныСтрок.ОбщийОбъемУслуги КАК ОбщийОбъемУслуги,
	|	ВЫБОР
	|		КОГДА ДанныеКРаспределению.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Двухтарифный)
	|			ТОГДА 2
	|		КОГДА ДанныеКРаспределению.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Трехтарифный)
	|			ТОГДА 3
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоЗон,
	|	ОбъемыВРазрезеПериодов.ОбъемУслугиПериода КАК ОбъемУслугиПериода,
	|	ДиапазоныСтрок.ОбщийОбъемУслугиПотребленный КАК ОбщийОбъемУслугиПотребленный,
	|	ОбъемыВРазрезеПериодов.ОбъемУслугиПериодаПотребленный КАК ОбъемУслугиПериодаПотребленный
	|ПОМЕСТИТЬ УслугиКРаспределениюНачало
	|ИЗ
	|	ДиапазоныСтрок КАК ДиапазоныСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеКРаспределению КАК ДанныеКРаспределению
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъемыВРазрезеПериодов КАК ОбъемыВРазрезеПериодов
	|			ПО ДанныеКРаспределению.Абонент = ОбъемыВРазрезеПериодов.Абонент
	|				И ДанныеКРаспределению.Услуга = ОбъемыВРазрезеПериодов.Услуга
	|				И ДанныеКРаспределению.НачалоПериода = ОбъемыВРазрезеПериодов.НачалоПериода
	|		ПО ДиапазоныСтрок.Абонент = ДанныеКРаспределению.Абонент
	|			И ДиапазоныСтрок.Услуга = ДанныеКРаспределению.Услуга
	|			И ДиапазоныСтрок.ВидБлагоустройства = ДанныеКРаспределению.ВидБлагоустройства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст = Текст + ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов();
	Текст = Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + 
	
	"
	|ВЫБРАТЬ
	|	" + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "УслугиКРаспределениюНачало", "", Истина, Ложь) + "	
	|	УслугиКРаспределениюНачало.МКД КАК МКД,	
	|	УслугиКРаспределениюНачало.НачалоПериодаОригинал КАК НачалоПериодаОригинал,
	|	УслугиКРаспределениюНачало.КоэффициентИзмененияЛимитаДиапазона КАК КоэффициентИзмененияЛимитаДиапазона,
	|	УслугиКРаспределениюНачало.МаксимальныйДиапазон КАК МаксимальныйДиапазон,
	|	УслугиКРаспределениюНачало.ОбщийОбъемПоВидуБлагоустройства КАК ОбщийОбъемПоВидуБлагоустройства,
	|	УслугиКРаспределениюНачало.ОбщийОбъемУслуги КАК ОбщийОбъемУслуги,
	|	УслугиКРаспределениюНачало.КоличествоЗон КАК КоличествоЗон,
	|	УслугиКРаспределениюНачало.ОбъемУслугиПериода КАК ОбъемУслугиПериода,
	|	УслугиКРаспределениюНачало.ОбщийОбъемУслугиПотребленный КАК ОбщийОбъемУслугиПотребленный,
	|	УслугиКРаспределениюНачало.ОбъемУслугиПериодаПотребленный КАК ОбъемУслугиПериодаПотребленный
	|ПОМЕСТИТЬ УслугиКРаспределению
	|ИЗ
	|	УслугиКРаспределениюНачало КАК УслугиКРаспределениюНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов КАК ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов
	|		ПО УслугиКРаспределениюНачало.Организация = ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов.Организация
	|			И УслугиКРаспределениюНачало.Район = ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов.Район
	|			И УслугиКРаспределениюНачало.Абонент = ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов.Абонент
	|ГДЕ
	|	ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов.Абонент ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	" + СформироватьСтрокуДляЗапроса("энргОбъемНачислений", "УслугиКРаспределению", "", Истина, Ложь) + "
	|	УслугиКРаспределению.МКД КАК МКД,
	|	УслугиКРаспределению.НачалоПериодаОригинал КАК НачалоПериодаОригинал,
	|	УслугиКРаспределению.КоэффициентИзмененияЛимитаДиапазона КАК КоэффициентИзмененияЛимитаДиапазона,
	|	ОтрицательныеОбъемыВнутриПериода.ОбъемУслугиПериодаОтрицательный КАК ОбъемУслугиПериодаОтрицательный,
	|	ОтрицательныеОбъемыВнутриПериода.ОбъемУслугиПериодаОтрицательныйПотребленный КАК ОбъемУслугиПериодаОтрицательныйПотребленный,
	|	УслугиКРаспределению.МаксимальныйДиапазон КАК МаксимальныйДиапазон,
	|	УслугиКРаспределению.ОбщийОбъемУслуги - ЕСТЬNULL(ПериодыСОбщимОбъемомМеньшеНуля.ОбъемУслугиПериодаОбщийОтрицательный, 0) КАК ОбщийОбъемУслуги,
	|	УслугиКРаспределению.ОбъемУслугиПериода КАК ОбъемУслугиПериода,
	|	УслугиКРаспределению.ОбщийОбъемУслугиПотребленный - ЕСТЬNULL(ПериодыСОбщимОбъемомМеньшеНуля.ОбъемУслугиПериодаОбщийОтрицательныйПотребленный, 0) КАК ОбщийОбъемУслугиПотребленный,
	|	УслугиКРаспределению.ОбъемУслугиПериодаПотребленный КАК ОбъемУслугиПериодаПотребленный,
	|	ЕСТЬNULL(ПериодыСОбщимОбъемомМеньшеНуля.ОбъемУслугиПериодаОбщийОтрицательный, 0) КАК ОбъемУслугиПериодаОбщийОтрицательный,
	|	ЕСТЬNULL(ПериодыСОбщимОбъемомМеньшеНуля.ОбъемУслугиПериодаОбщийОтрицательныйПотребленный, 0) КАК ОбъемУслугиПериодаОбщийОтрицательныйПотребленный
	|ИЗ
	|	УслугиКРаспределению КАК УслугиКРаспределению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УслугиКРаспределению.Абонент КАК Абонент,
	|			УслугиКРаспределению.Услуга КАК Услуга,
	|			УслугиКРаспределению.НачалоПериода КАК НачалоПериода,
	|			СУММА(ВЫБОР
	|					КОГДА УслугиКРаспределению.ОбъемУслуги < 0
	|						ТОГДА УслугиКРаспределению.ОбъемУслуги
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ОбъемУслугиПериодаОтрицательный,
	|			СУММА(ВЫБОР
	|					КОГДА УслугиКРаспределению.ОбъемУслугиПотребленный < 0
	|						ТОГДА УслугиКРаспределению.ОбъемУслугиПотребленный
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ОбъемУслугиПериодаОтрицательныйПотребленный
	|		ИЗ
	|			УслугиКРаспределению КАК УслугиКРаспределению
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УслугиКРаспределению.Абонент,
	|			УслугиКРаспределению.Услуга,
	|			УслугиКРаспределению.НачалоПериода) КАК ОтрицательныеОбъемыВнутриПериода
	|		ПО УслугиКРаспределению.Абонент = ОтрицательныеОбъемыВнутриПериода.Абонент
	|			И УслугиКРаспределению.Услуга = ОтрицательныеОбъемыВнутриПериода.Услуга
	|			И УслугиКРаспределению.НачалоПериода = ОтрицательныеОбъемыВнутриПериода.НачалоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОбъемыВРазрезеПериодов.Абонент КАК Абонент,
	|			ОбъемыВРазрезеПериодов.Услуга КАК Услуга,
	|			СУММА(ОбъемыВРазрезеПериодов.ОбъемУслугиПериода) КАК ОбъемУслугиПериодаОбщийОтрицательный,
	|			СУММА(ОбъемыВРазрезеПериодов.ОбъемУслугиПериодаПотребленный) КАК ОбъемУслугиПериодаОбщийОтрицательныйПотребленный
	|		ИЗ
	|			ОбъемыВРазрезеПериодов КАК ОбъемыВРазрезеПериодов
	|		ГДЕ
	|			ОбъемыВРазрезеПериодов.ОбъемУслугиПериода < 0
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОбъемыВРазрезеПериодов.Абонент,
	|			ОбъемыВРазрезеПериодов.Услуга) КАК ПериодыСОбщимОбъемомМеньшеНуля
	|		ПО УслугиКРаспределению.Абонент = ПериодыСОбщимОбъемомМеньшеНуля.Абонент
	|			И УслугиКРаспределению.Услуга = ПериодыСОбщимОбъемомМеньшеНуля.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКД,
	|	Абонент,
	|	Услуга,
	|	ТочкаУчета,
	|	НачалоПериода,
	|	ТарифнаяЗона";
	
	Возврат Текст;
	
КонецФункции

Функция КоэффициентыИзмененияЛимитовДифференцированныхТарифов()
	
	Схема = Неопределено;
	ПоместитьВ = "КоэффициентыИзмененияЛимитовДифференцированныхТарифов";
	ПараметрыОтбора	 = Новый Структура;
	ПараметрыВТ 	 = Новый Массив;

	ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КП"));
	
	ОтборРавно = Новый Структура("Организация,Район", "Организация", "Район");
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(ОтборРавно));
	
	ОтборВ = Новый Структура("Абонент", "Абонент");
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("НачисленныеОбъемы", ОтборВ));
	
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	РегистрыСведений.энргКоэффициентИзмененияЛимитовДифференцированныхТарифов.АктуальныеДанные(Схема, ПараметрыОтбора, ПоместитьВ);
	Текст = Схема.ПолучитьТекстЗапроса();
	
	Возврат Текст;
	
КонецФункции

Функция ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов()
	
	Схема = Неопределено;
	ПоместитьВ = "ИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов";
	ПараметрыОтбора	 = Новый Структура;
	ПараметрыВТ 	 = Новый Массив;

	ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КП"));
	
	ОтборРавно = Новый Структура("Организация,Район", "Организация", "Район");
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(ОтборРавно));
	
	ОтборВ = Новый Структура("Абонент", "Абонент");
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("УслугиКРаспределениюНачало", ОтборВ));
	
	ОтборГдеБольше = Новый Структура("ДатаЗавершенияИсключения", "ДАТАВРЕМЯ(1,1,1)");
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипБольше(ОтборГдеБольше));
	
	ОтборГдеБольшеРавно = Новый Структура("ДатаЗавершенияИсключения", "&НП");
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипБольшеРавно(ОтборГдеБольшеРавно));
	
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	РегистрыСведений.энргИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов.АктуальныеДанные(Схема, ПараметрыОтбора, ПоместитьВ);
	Текст = Схема.ПолучитьТекстЗапроса();
	
	Возврат Текст;
	
КонецФункции

Функция НовыеПараметрыОперации()
	
	Результат = Новый Структура;
	Результат.Вставить("ПериодНачисления", Дата(1,1,1));
	Результат.Вставить("Организация", Справочники.Организации.НашаОрганизация);
	Результат.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());	
	Результат.Вставить("ЧастныйСектор", Неопределено);
	Результат.Вставить("Строения", Неопределено);
	Результат.Вставить("Абонент", Справочники.энргАбоненты.ПустаяСсылка());
	Результат.Вставить("Диапазон", Справочники.энргДиапазоныДифференцированныхТарифов.ДиапазонПоУмолчанию());
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#Область Инициализация

Процедура ИнициализироватьШаблонТаблицыРаспределения()
	
	ФейковыйНабор = РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	ШаблонТаблицыРаспределения = ФейковыйНабор.Выгрузить();
	
КонецПроцедуры

Процедура ИнициализироватьОтборЗначенияТарифа()
	
	ОписаниеОтбораЗначенияТарифа = "Услуга,ГруппаПотребителей,Поставщик,ТарифнаяЗона,Диапазон";
	ОтборЗначенияТарифа = Новый Структура(ОписаниеОтбораЗначенияТарифа);
	
КонецПроцедуры

Процедура ИнициализироватьГраницыПериода()
	
	Если ПараметрыОперации.Свойство("ГраницыПериода") Тогда 
		Возврат;
	КонецЕсли;
	
	ГраницыПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(
	ПараметрыОперации.Организация, 
	ПараметрыОперации.Район, 
	ПараметрыОперации.ПериодНачисления);
	
	ПараметрыОперации.Вставить("НачалоОП",		ГраницыПериода.НачалоОП);
	ПараметрыОперации.Вставить("ЗавершениеОП",	ГраницыПериода.ЗавершениеОП);
	ПараметрыОперации.Вставить("ДнейВПериоде",	ГраницыПериода.ДнейВПериоде);
	
КонецПроцедуры

#Область ЛокальныеПараметрыОбходаВыборки

#Область Логирование

ИмяСобытия = НСтр("ru = 'Распределение объемов по диапазонам'");
Ошибки = Новый Массив;
ШаблонОшибки = "Период начисления: %1
	|Организация: %2
	|Район: %3
	|Частный сектор: %4
	|МКД: %5
	|Причина: %6";
	
#КонецОбласти

ПараметрыОперации = НовыеПараметрыОперации();
ЛокальнаяНастройкаДиапазонов = Новый Массив;
ОписаниеСтрокиНастройкиДиапазонов = "Диапазон,От,До,Разница,ОсталосьСписать,ОсталосьСписатьПотребленный,ЛимитУвеличен";
ДоляОбъемаПоПериодам = Новый Соответствие;
ОкруглятьДолюДо = 8;
ОкруглятьОбъемДо = 2;

РезультатРаспределения = Новый Соответствие;
ОписаниеРесурсовРаспределения = "ТаблицаРаспределения, СтрокиУдаления"; 
ИнициализироватьШаблонТаблицыРаспределения();
ИнициализироватьОтборЗначенияТарифа();

#КонецОбласти

#КонецОбласти