#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргПриходныйКассовыйОрдер(ЭтотОбъект); 			
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
		
		ПриЧтенииСозданииНаСервере(); 	
		
		Если ЗначениеЗаполнено(Объект.Абонент) Тогда
			ДанныеАбонента  		= Новый Структура("Район,Организация,Строение,Помещение,КлючПомещения");			
			ДанныеАбонента.удалить("Абонент");
			энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент,ДанныеАбонента);
			ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ДанныеАбонента,"Район,Организация,КлючПомещения");
			ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеАбонента,"Строение,Помещение");
		ИначеЕсли ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Объект.ИсточникПоступления) Тогда
			Объект.ИсточникПоступления = Справочники.энргИсточникиПоступления.Касса;
		КонецЕсли;
	КонецЕсли;	
	
	ЗаполнитьДокумент  								= Ложь;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		Если Параметры.ЗаполнитьДокумент тогда
			ЗаполнитьДокумент 						= истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		  ЗаполнитьДокумент 						= истина;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) тогда
		ЗаполнитьДокумент 						= истина;		  
	ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Абонент") тогда
		ЗаполнитьДокумент 							= истина;
		ДанныеАбонента								= Справочники.энргАбоненты.ЗначенияРеквизитовОбъекта(Объект.Абонент,Новый ФиксированнаяСтруктура("Район,Организация"));
		
		Объект.Район 								= ДанныеАбонента.Район;
		Объект.Организация 							= ДанныеАбонента.Организация;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда 
		ДанныеЗаполнения = Новый Структура("ЧастныйСектор");
		энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент, ДанныеЗаполнения );
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеЗаполнения);
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Абонент) и ЗаполнитьДокумент тогда
		Если не ЗначениеЗаполнено(Объект.Дата) тогда
			Объект.Дата 							= ТекущаяДата();
		КонецЕсли;
		ЗаполнитьДанныеАбонентаСервер();
	КонецЕсли; 		
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;      	
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	// Фискализация ОФД
	Если ПодсистемаИнтеграцияОФДСуществует() Тогда
		МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
		МодульфискОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Фискализация ОФД
	
	СуммаКРаспределению();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
			
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	ПриЧтенииСозданииНаСервере();
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
	// Фискализация ОФД
	Если ПодсистемаИнтеграцияОФДСуществует() Тогда
		МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
		ДокументФискализирован = МодульфискОбщегоНазначения.ПлатежныйДокументОтправленВСистемуОФД(Объект.Ссылка);
	КонецЕсли;
	// Фискализация ОФД
	
	ЗаполнитьИтоговыеСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    	
	ПересчитатьСуммуКОплате();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.Абонент);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	// Фискализация ОФД
	Если ПодсистемаИнтеграцияОФДСуществует() Тогда
		МодульфискОбщегоНазначения = энргОбщегоНазначения.МодульОбщегоНазначенияИнтеграцииОФД();
		МодульфискОбщегоНазначения.ПослеЗаписи(ЭтотОбъект);
	КонецЕсли;
	// Фискализация ОФД
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);		

КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		ЭтаФорма.ЧастныйСектор 	= Истина;
	КонецЕсли;
	
	ЗаполнитьДанныеАбонентаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;	
	ЗаполнитьДанныеАбонентаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	ЗаполнитьДанныеАбонентаСервер();
КонецПроцедуры 

&НаКлиенте
Процедура ФискальнаяОперацияСтатусОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ФискальнаяОперацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	СтрокиШкал 								= Объект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки));
	Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
		СтрокиТарифныхЗон 					= Объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));
		Для Каждого СтрокаПоказаний Из СтрокиТарифныхЗон Цикл
			Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
		КонецЦикла;
		Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
	КонецЦикла;
	            	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент, Новый Структура("ТочкиСПриборами", Истина)); 
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаЕстьШкалыЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказанияПриборовУчетаТаблицаПриборов

&НаКлиенте
Процедура ПриборыУчетаНовыеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));	
КонецПроцедуры 

#КонецОбласти

#Область СобытияТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)

	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	СтрокиШкал 								= Объект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки));
	Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
		СтрокиТарифныхЗон 					= Объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));
		Для Каждого СтрокаПоказаний Из СтрокиТарифныхЗон Цикл
			Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
		КонецЦикла;
		Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)

	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	СтрокиШкал 								= Объект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки));
	Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
		СтрокиТарифныхЗон 					= Объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки));
		Для Каждого СтрокаПоказаний Из СтрокиТарифныхЗон Цикл
			Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
		КонецЦикла;
		Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#Конецобласти

#Область СобытияТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#Конецобласти 

#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура ВыбратьПериодОплаты(Команда)
	
	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыбратьПериодОплатыЗавершение",ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	
	Диалог.Период.ДатаНачала    = Объект.ПериодОплатыНачало;
	Диалог.Период.ДатаОкончания = Объект.ПериодОплатыКонец;
	Диалог.Показать(ОписаниеОповещенияВыборПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодОплатыЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт 
	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПериодОплатыНачало 	= ИнтервалУстановлен.ДатаНачала;
	Объект.ПериодОплатыКонец 	= ИнтервалУстановлен.ДатаОкончания;
	
	ЗаполнитьДанныеДляОплаты();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДанныеАбонентаСервер(); 	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплату(Команда)
	РаспределитьОплатуСервер();
КонецПроцедуры

#КонецОбласти

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	//ФискальнаяОперацияОбновитьСтатус();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАбонентаСервер()
	ЗаполнитьДанныеДляОплаты();	
	ЗаполнитьСведенияОРассрочке();
	ЗаполнитьИтоговыеСуммы();
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьДанныеДляОплаты()
	// очищаем табличную часть оплаты
	Объект.Услуги.Очистить();
	МКД  			= ?(НЕ ЧастныйСектор,Строение,ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"));
	// выводим данные по подключенным услугам и задолженности
	Граница  		= Новый Граница(Объект.Дата, ВидГраницы.Исключая);	
	Результат 		= ДанныеДляОплатыАбонента(Граница,Объект.Организация,Объект.ПериодНачисления,Объект.Район,МКД,Объект.Абонент);
	Выборка  		= Результат.выбрать();
	Пока Выборка.следующий() цикл
		 СтрокаУслуги  								= Объект.Услуги.Добавить();
		 СтрокаУслуги.ПредставлениеПериодаОплаты 	= Формат(Выборка.периодНачисления,"ДФ='ММММ гггг'");
		 ЗаполнитьЗначенияСвойств(СтрокаУслуги,Выборка); 		 
	 КонецЦикла; 
	//СуммаКОплате = энргРаботаСТочкамиУчетаСервер.ЗадолженностьАбонента(Объект.Дата,Объект.Организация,Объект.Район,МКД,Объект.Абонент); 
	Объект.НачисленияТекущегоПериода.Очистить();
	ЗаполнитьНачисленияТекПериода();
	СуммаКОплате = Объект.Услуги.Итог("Задолженность") + Объект.НачисленияТекущегоПериода.Итог("Сумма");		 

КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьИтоговыеСуммы()

	СтруктураПоиска = Новый Структура("ВидЗадолженности", ПредопределенноеЗначение("Перечисление.энргВидыЗадолженности.ОсновнойДолг")); 
	мОсновнойДолг = Объект.Услуги.НайтиСтроки(СтруктураПоиска);
	табОсновнойДолг = Объект.Услуги.Выгрузить(мОсновнойДолг, "Задолженность");
	ИтоговаяЗадолженностьОсновногоДолга = табОсновнойДолг.Итог("Задолженность");
	
 	СтруктураПоиска = Новый Структура("ВидЗадолженности", ПредопределенноеЗначение("Перечисление.энргВидыЗадолженности.Пеня")); 
	мПеня = Объект.Услуги.НайтиСтроки(СтруктураПоиска);
	табПеня = Объект.Услуги.Выгрузить(мПеня, "Задолженность");
	ИтоговаяЗадолженностьПени = табПеня.Итог("Задолженность");
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьОплатуСервер()
	
	ТекОбъект  		= РеквизитФормыВЗначение("Объект");
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ТекПериодНачисления",	Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("ДанныеТЧ",				ТекОбъект.услуги.выгрузить());
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргКвитанцияУслуги.Услуга,
	|	энргКвитанцияУслуги.ПериодНачисления,
	|	энргКвитанцияУслуги.Задолженность,
	|	энргКвитанцияУслуги.НачисленоПоКвитанции,
	|	энргКвитанцияУслуги.НомерСтроки
	|ПОМЕСТИТЬ ДанныеТЧ
	|ИЗ
	|	&ДанныеТЧ КАК энргКвитанцияУслуги
	|ГДЕ
	|	энргКвитанцияУслуги.Задолженность > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПорядокПогашенияЗадолженности.Услуга,
	|	энргПорядокПогашенияЗадолженности.Порядок
	|ПОМЕСТИТЬ ПорядокРаспределения
	|ИЗ
	|	РегистрСведений.энргПорядокПогашенияЗадолженности КАК энргПорядокПогашенияЗадолженности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.Услуга,
	|	ДанныеТЧ.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеТЧ.Задолженность  КАК Задолженность,
	|	ДанныеТЧ.НомерСтроки,
	|	ПорядокРаспределения.Порядок КАК Порядок,
	|	ВЫБОР
	|		КОГДА ДанныеТЧ.ПериодНачисления = &ТекПериодНачисления
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокПериодНачисления
	|ИЗ
	|	ПорядокРаспределения КАК ПорядокРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТЧ КАК ДанныеТЧ
	|		ПО ПорядокРаспределения.Услуга = ДанныеТЧ.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокПериодНачисления,
	|	ПериодНачисления,
	|	Порядок";
	
	
	НадоРаспределить  					= Объект.СуммаОплаты;
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		СтрокаУслуг 					= Объект.Услуги[Выборка.НомерСтроки - 1];
		Оплачиваем  					= Мин(НадоРаспределить,Выборка.Задолженность);
		СтрокаУслуг.Оплачено 			= Оплачиваем;
		НадоРаспределить 				= НадоРаспределить -  Оплачиваем;		
	КонецЦикла; 	
	
	Если НадоРаспределить > 0 тогда
		для Каждого стр из Объект.ОплатаПоРассрочке цикл
			Оплачиваем  				= Мин(НадоРаспределить,стр.СуммаНеОплаченныхПроцентов);
			СтрокаУслуг.Оплачено 		= Оплачиваем;
			НадоРаспределить 			= НадоРаспределить -  Оплачиваем;
		КонецЦикла;  		
	КонецЕсли;
	
	Если НадоРаспределить > 0 тогда
		Оплачиваем  					= Мин(НадоРаспределить,Объект.СуммаОсновногоДолгаРассрочки);
		ОплатаОсновногоДолгаРассрочки 	= Оплачиваем;
		НадоРаспределить 				= НадоРаспределить -  Оплачиваем; 		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОРассрочке()
	
	Объект.ОплатаПоРассрочке.Очистить();
	МКД  			= ?(Не ЧастныйСектор,Строение,ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"));	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Период",		Объект.Дата);
	Запрос.УстановитьПараметр("Район",		Объект.Район);
	Запрос.УстановитьПараметр("МКД",		МКД);
	Запрос.УстановитьПараметр("Абонент",	Объект.Абонент);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргПроцентыПоРассрочкеОстатки.ПериодНачисления,
	|	энргПроцентыПоРассрочкеОстатки.СуммаЗадолженностиОстаток КАК СуммаНеОплаченныхПроцентов
	|ИЗ
	|	РегистрНакопления.энргПроцентыПоРассрочке.Остатки(
	|			&Период,
	|			Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргПроцентыПоРассрочкеОстатки";
	Результат  = Запрос.Выполнить();
	Выборка  = Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		СтрокаТЧ 							= Объект.ОплатаПоРассрочке.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
	КонецЦикла; 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",		Объект.Дата);
	Запрос.УстановитьПараметр("Район",		Объект.Район);
	Запрос.УстановитьПараметр("МКД",		МКД);
	Запрос.УстановитьПараметр("Абонент",	Объект.Абонент);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргЗадолженностьПоРассрочкеОстатки.СуммаЗадолженностиОстаток
	|ИЗ
	|	РегистрНакопления.энргЗадолженностьПоРассрочке.Остатки(
	|			&Период,
	|			Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргЗадолженностьПоРассрочкеОстатки";
	Результат  								= Запрос.Выполнить();
	Выборка  								= Результат.Выбрать();
	Если не Результат.Пустой() тогда
		Выборка  							= Результат.Выбрать();
		Выборка.Следующий();
		Объект.СуммаОсновногоДолгаРассрочки = Выборка.СуммаЗадолженностиОстаток;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СуммаКРаспределению()	
	СуммаКРаспределению = Объект.СуммаОплаты - Объект.Услуги.Итог("Оплачено");	
КонецПроцедуры

#КонецОбласти

#Область ФискальнаяОперация

&НаСервере
Процедура ФискальнаяОперацияОбновитьСтатус()
	
	ФискальнаяОперацияПодключенноеОборудование = энргПодключаемоеОборудованиеБиллингВызовСервера.ОборудованиеПодключенноеККассе(Объект.Касса);
	ИмяКоманды = "ПробитьЧек";
	
	Элементы.ФискальнаяОперацияСтатус.Видимость = (ФискальнаяОперацияПодключенноеОборудование <> Неопределено);
	Если ФискальнаяОперацияПодключенноеОборудование = Неопределено Тогда
		ФискальнаяОперацияСтатус = "";
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФискальнаяОперацияДанныеЖурнала = энргПодключаемоеОборудованиеБиллингВызовСервера.ДанныеЖурналаФискальныхОпераций(Объект.Ссылка);
	Иначе
		ФискальнаяОперацияДанныеЖурнала = Неопределено;
	КонецЕсли;
	
	Строки = Новый Массив;
	Если ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование.ККТ) Тогда
			
			Строки.Добавить(
			Новый ФорматированнаяСтрока(
			НСтр("ru = 'Пробить чек'"),,
			ЦветаСтиля.энргЦветГиперссылки,,
			ИмяКоманды));
			
		Иначе
			
			Строки.Добавить(
			Новый ФорматированнаяСтрока(
			НСтр("ru = 'Чек не пробит'"),,
			ЦветаСтиля.энргЦветГиперссылки,,
			"НастроитьОборудование"));
			
		КонецЕсли;
		
	Иначе
		
		
		Строки.Добавить(
		Новый ФорматированнаяСтрока(
		СтрШаблон(
		НСтр("ru = 'Пробит чек №%1'"),
		ФискальнаяОперацияДанныеЖурнала.НомерЧекаККМ),,
		ЦветаСтиля.энргЦветГиперссылки,,
		"ОткрытьЗаписьЖурналаФискальныхОпераций"));
		
	КонецЕсли;
	
	ФискальнаяОперацияСтатус = Новый ФорматированнаяСтрока(Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ФискальнаяОперацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
	ТорговыйОбъект = Объект.Касса;
	
	Если "ПробитьЧек" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
		ПараметрыОперации.Вставить("Партнер",                  Объект.Абонент);
		ПараметрыОперации.Вставить("Организация",              Объект.Организация);
		ПараметрыОперации.Вставить("ТорговыйОбъект",           ТорговыйОбъект);
		ПараметрыОперации.Вставить("ПодключенноеОборудование", ФискальнаяОперацияПодключенноеОборудование);
		
		энргПодключаемоеОборудованиеБиллингКлиент.ПробитьЧек(
		ЭтотОбъект,
		ПараметрыОперации,
		РежимЗаписиДокумента.Проведение,
		Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", ЭтотОбъект));
		
	ИначеЕсли "ПробитьЧекИнкассация" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		ПараметрыОперации = Новый Структура;
		ПараметрыОперации.Вставить("Сумма",                    Объект.СуммаДокумента);
		ПараметрыОперации.Вставить("ДокументСсылка",           Объект.Ссылка);
		ПараметрыОперации.Вставить("Организация",              Объект.Организация);
		ПараметрыОперации.Вставить("ТорговыйОбъект",           ТорговыйОбъект);
		ПараметрыОперации.Вставить("ПодключенноеОборудование", ПараметрыКассыККМ.ИдентификаторУстройства);
		
		ПараметрыОперации.Вставить("ВыемкаДенежныхСредствИзКассыККМ", Неопределено);
		
		энргПодключаемоеОборудованиеБиллингКлиент.ПробитьЧекВыемкаДенежныхСредств(
		ЭтотОбъект,
		ПараметрыОперации,
		РежимЗаписиДокумента.Проведение,
		Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", ЭтотОбъект));
		
	ИначеЕсли "ОткрытьЗаписьЖурналаФискальныхОпераций" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		энргПодключаемоеОборудованиеБиллингКлиент.ОткрытьЗаписьЖурналаФискальныхОпераций(ЭтотОбъект, ФискальнаяОперацияДанныеЖурнала);
		
	ИначеЕсли "НастроитьОборудование" = НавигационнаяСсылкаФорматированнойСтроки Тогда
		
		ОткрытьФорму("Обработка.ПредпросмотрЧека.Форма.ОшибкаПодключенияККТ");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФискальнаяОперацияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФискальнаяОперацияОбновитьСтатус();
	
КонецПроцедуры

#КонецОбласти

#Область ФискальныеОперацииОФД

&НаСервереБезКонтекста
Функция ПодсистемаИнтеграцияОФДСуществует() 
	Возврат энргОбщегоНазначения.ПодсистемаИнтеграцияОФДСуществует();
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ТочкиУчетаВидДифференцированностиПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ТочкиУчетаВидДифференцированностиПриИзмененииНаСервере(ТекущаяСтрока.IDСтроки, ТекущаяСтрока.ВидДифференцированности);
	ОтборВТарифныхЗонах(ТекущаяСтрока.IDСтроки);
КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаВидДифференцированностиПриИзмененииНаСервере(Ключ, ВидДифференцированности)
	УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ);
	ЗаполнитьТарифныеЗоныПоВидуДифференцированности(Объект.ПоказанияПриборовУчета, Ключ, ВидДифференцированности);
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ)
	энргРаботаСПриборамиУчетаСервер.УдалитьСтрокиВТарифныеЗоныПоКлючу(Ключ, Объект.ПоказанияПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТарифныеЗоныПоВидуДифференцированности(ТЧ, Ключ, ВидДифференцированности)
	
	СписокТарифныхЗон = энргРаботаСПриборамиУчетаСервер.ПолучитьТарифныеЗоныПоВидуДифференцированности(ВидДифференцированности);
	
	Для каждого стр из СписокТарифныхЗон Цикл
		НовСтрока 				= ТЧ.Добавить();
		НовСтрока.IDСтроки	= Ключ;
		НовСтрока.ТарифнаяЗона 	= стр.ТарифнаяЗона;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВТарифныхЗонах(КлючСтроки)
	Отбор = Новый Структура;
	Отбор.Вставить("IDСтроки", КлючСтроки);
	Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуКОплате()
	//СуммаКОплате = Объект.Услуги.Итог("Задолженность") +Объект.ПоказанияПриборовУчета.Итог("Сумма") ;      
	// выводим данные по задолженности
	//Результат = энргРаботаСТочкамиУчетаСервер.ЗадолженностьАбонента(Объект.Дата,Объект.Организация,Объект.Район,Объект.МКД,Объект.Абонент);
	//Выборка  = Результат.выбрать();
	//Если Выборка.следующий() Тогда
	//	 СуммаКОплате = Выборка.Задолженность;		 
	//КонецЕсли;
	МКД  			= ?(Не ЧастныйСектор,Строение,ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"));
	СуммаКОплате 	= энргРаботаСТочкамиУчетаСервер.ЗадолженностьАбонента(КонецМесяца(Объект.Дата)+1,Объект.Организация,Объект.Район,МКД,Объект.Абонент);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисленияТекПериода()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргОбъемНачисленийОбороты.СуммаОборот КАК Сумма,
	|	энргОбъемНачисленийОбороты.ОбъемУслугиОборот КАК ОбъемУслуги,
	|	энргОбъемНачисленийОбороты.Услуга КАК Услуга,
	|	энргОбъемНачисленийОбороты.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			Район = &Район
	|				И Организация = &Организация
	|				И Абонент = &Абонент) КАК энргОбъемНачисленийОбороты";
	
	Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаНачисления  								= Объект.НачисленияТекущегоПериода.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНачисления,ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиОплаченоПриИзменении(Элемент)
	УслугиОплаченоПриИзмененииНаСервере();
	СуммаКРаспределению();
	
	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущаяСтрока.ВидЗадолженности = ПредопределенноеЗначение("Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность") Тогда
		ПоказатьПредупреждение(,"Не забудьте согласовать с юристом оплату мораторной задолженности");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплатыПриИзменении(Элемент)
	СуммаОплатыПриИзмененииНаСервере();
	СуммаКРаспределению();
КонецПроцедуры


&НаСервере
Процедура УслугиОплаченоПриИзмененииНаСервере()
	ВсегоПоСтрокам 	= Объект.Услуги.Итог("Оплачено");
	
	Если Объект.СуммаОплаты < ВсегоПоСтрокам Тогда
		ТекДанные 			= Объект.Услуги.НайтиПоИдентификатору(Элементы.Услуги.ТекущаяСтрока);
		Разница 			= Объект.СуммаОплаты - (ВсегоПоСтрокам - ТекДанные.Оплачено);
		ТекДанные.Оплачено 	= 0;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма распределения превысила сумму оплаты. Остаток к распределению: " + Разница);
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура СуммаОплатыПриИзмененииНаСервере()
	ВсегоПоСтрокам 	= Объект.Услуги.Итог("Оплачено");
	
	Если Объект.СуммаОплаты < ВсегоПоСтрокам Тогда
		Объект.СуммаОплаты = ВсегоПоСтрокам;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма распределения превысила сумму оплаты.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДанныеДляОплатыАбонента(Период,Организация, ПериодНачисления,Район,Дом,Абонент)
	ДопПараметры = Новый Структура("ПериодОплатыНачало, ПериодОплатыКонец", Объект.ПериодОплатыНачало, Объект.ПериодОплатыКонец);
	Возврат энргРаботаСЛицевымСчетомСервер.ДанныеДляОплатыАбонента(Период, Организация, Район, Дом, Абонент, ДопПараметры);
	
	//Запрос   		= Новый Запрос;
	//Запрос.УстановитьПараметр("Период" ,			Период);
	//Запрос.УстановитьПараметр("Организация",		Организация);
	//Запрос.УстановитьПараметр("ДатаНачала",	Объект.ПериодОплатыНачало);
	//Запрос.УстановитьПараметр("ДатаКонца",	Объект.ПериодОплатыКонец);
	//Запрос.УстановитьПараметр("Район",				Район);
	//Запрос.УстановитьПараметр("МКД",				Дом);
	//Запрос.УстановитьПараметр("Абонент",			Абонент);
	//Запрос.УстановитьПараметр("ТекДата",			ТекущаяДатаСеанса());
	//Запрос.Текст 	=
	//"ВЫБРАТЬ
	//|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодНачисления,
	//|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
	//|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг) КАК ВидЗадолженности,
	//|	энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток КАК Задолженность,
	//|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик
	//|ПОМЕСТИТЬ ТекущиеОстатки
	//|ИЗ
	//|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	//|				И Абонент = &Абонент
	//|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргВзаиморасчетыПоМесяцамОстатки
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	энргВзаиморасчетыПоПениОстатки.ПериодНачисления,
	//|	энргВзаиморасчетыПоПениОстатки.Услуга,
	//|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.Пеня),
	//|	энргВзаиморасчетыПоПениОстатки.СуммаОстаток,
	//|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)
	//|ИЗ
	//|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	//|				И Абонент = &Абонент
	//|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргВзаиморасчетыПоПениОстатки
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	энргЗабалансоваяЗадолженностьОстатки.ПериодНачисления,
	//|	энргЗабалансоваяЗадолженностьОстатки.Услуга,
	//|	энргЗабалансоваяЗадолженностьОстатки.ВидЗадолженности,
	//|	энргЗабалансоваяЗадолженностьОстатки.СуммаЗадолженностиОстаток,
	//|	энргЗабалансоваяЗадолженностьОстатки.Поставщик
	//|ИЗ
	//|	РегистрНакопления.энргЗабалансоваяЗадолженность.Остатки(
	//|			&Период,
	//|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	//|				И Абонент = &Абонент
	//|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность), ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))
	//|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргЗабалансоваяЗадолженностьОстатки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	энргРеструктуризацияДолгаСрезПоследних.Организация КАК Организация,
	//|	энргРеструктуризацияДолгаСрезПоследних.Район КАК Район,
	//|	энргРеструктуризацияДолгаСрезПоследних.Строение КАК Строение,
	//|	энргРеструктуризацияДолгаСрезПоследних.Абонент КАК Абонент,
	//|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты КАК ДатаОплаты,
	//|	энргРеструктуризацияДолгаСрезПоследних.Документ КАК Документ,
	//|	СУММА(ВЫБОР
	//|			КОГДА энргВзаиморасчеты.ВидДвижения ЕСТЬ NULL
	//|				ТОГДА 0
	//|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				ТОГДА энргВзаиморасчеты.Сумма
	//|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|					И энргВзаиморасчеты.Сумма < 0
	//|				ТОГДА -энргВзаиморасчеты.Сумма
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК Сумма,
	//|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом КАК СуммаНарастающимИтогом,
	//|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая КАК СуммаОбщая
	//|ПОМЕСТИТЬ Реструктуризация
	//|ИЗ
	//|	РегистрСведений.энргРеструктуризацияДолга.СрезПоследних(
	//|			&Период,
	//|			Организация = &Организация
	//|				И Район = &Район
	//|				И Строение = &МКД
	//|				И Абонент = &Абонент) КАК энргРеструктуризацияДолгаСрезПоследних
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
	//|		ПО энргРеструктуризацияДолгаСрезПоследних.Организация = энргВзаиморасчеты.Организация
	//|			И энргРеструктуризацияДолгаСрезПоследних.Район = энргВзаиморасчеты.Район
	//|			И энргРеструктуризацияДолгаСрезПоследних.Строение = энргВзаиморасчеты.МКД
	//|			И энргРеструктуризацияДолгаСрезПоследних.Абонент = энргВзаиморасчеты.Абонент
	//|			И энргРеструктуризацияДолгаСрезПоследних.ДатаНачала <= энргВзаиморасчеты.Период
	//|			И энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты >= энргВзаиморасчеты.Период
	//|ГДЕ
	//|	энргРеструктуризацияДолгаСрезПоследних.ДатаПредыдущегоЭтапа <= &ТекДата
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	энргРеструктуризацияДолгаСрезПоследних.Организация,
	//|	энргРеструктуризацияДолгаСрезПоследних.Район,
	//|	энргРеструктуризацияДолгаСрезПоследних.Строение,
	//|	энргРеструктуризацияДолгаСрезПоследних.Абонент,
	//|	энргРеструктуризацияДолгаСрезПоследних.ДатаОплаты,
	//|	энргРеструктуризацияДолгаСрезПоследних.Документ,
	//|	энргРеструктуризацияДолгаСрезПоследних.СуммаНарастающимИтогом,
	//|	энргРеструктуризацияДолгаСрезПоследних.СуммаОбщая
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Реструктуризация.Документ КАК Документ,
	//|	Реструктуризация.СуммаОбщая КАК СуммаОбщая,
	//|	МИНИМУМ(Реструктуризация.Сумма >= Реструктуризация.СуммаНарастающимИтогом) КАК ОтметкаВыполненного
	//|ПОМЕСТИТЬ ВыполненныеРеструктуризации
	//|ИЗ
	//|	Реструктуризация КАК Реструктуризация
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Реструктуризация.Документ,
	//|	Реструктуризация.СуммаОбщая
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	//|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Услуга КАК Услуга,
	//|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Поставщик КАК Поставщик,
	//|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.СуммаЗадолженностиКонечныйОстаток КАК Задолженность
	//|ПОМЕСТИТЬ СуммыЗабаланса
	//|ИЗ
	//|	РегистрНакопления.энргЗабалансоваяЗадолженность.ОстаткиИОбороты(
	//|			,
	//|			&Период,
	//|			Регистратор,
	//|			,
	//|			Организация = &Организация
	//|				И Район = &Район
	//|				И МКД = &МКД
	//|				И Абонент = &Абонент
	//|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.РеструктуризированнаяЗадолженность))
	//|				И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК энргЗабалансоваяЗадолженностьОстаткиИОбороты
	//|ГДЕ
	//|	энргЗабалансоваяЗадолженностьОстаткиИОбороты.Регистратор В
	//|			(ВЫБРАТЬ
	//|				ВыполненныеРеструктуризации.Документ
	//|			ИЗ
	//|				ВыполненныеРеструктуризации КАК ВыполненныеРеструктуризации)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТекущиеОстатки.ПериодНачисления КАК ПериодНачисления,
	//|	ТекущиеОстатки.Услуга КАК Услуга,
	//|	ТекущиеОстатки.ВидЗадолженности КАК ВидЗадолженности,
	//|	ТекущиеОстатки.Задолженность - ЕСТЬNULL(СуммыЗабаланса.Задолженность, 0) КАК Задолженность,
	//|	ТекущиеОстатки.Поставщик КАК Поставщик
	//|ИЗ
	//|	ТекущиеОстатки КАК ТекущиеОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыЗабаланса КАК СуммыЗабаланса
	//|		ПО ТекущиеОстатки.ПериодНачисления = СуммыЗабаланса.ПериодНачисления
	//|			И ТекущиеОстатки.Услуга = СуммыЗабаланса.Услуга
	//|			И ТекущиеОстатки.Поставщик = СуммыЗабаланса.Поставщик
	//|			И (ТекущиеОстатки.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг))
	//|ГДЕ
	//|	ТекущиеОстатки.Задолженность - ЕСТЬNULL(СуммыЗабаланса.Задолженность, 0) > 0"; 
	//
	//Если НЕ ЗначениеЗаполнено(Объект.ПериодОплатыНачало) и НЕ ЗначениеЗаполнено(Объект.ПериодОплатыКонец) Тогда
	//	Запрос.Текст 	= СтрЗаменить(Запрос.Текст, "И (ПериодНачисления МЕЖДУ &ДатаНачала И &ДатаКонца)", "");
	//КонецЕсли;
	//
	//Результат  		= Запрос.Выполнить();
	//Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры
 
