#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//энргЛокализацияСервер.ПриСозданииНаСервере_энргРегистрацияВременногоОтсутствия(ЭтотОбъект);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата, ТекущаяДата()), Объект.Организация,Объект.Район);
				ЗаполнитьУслугиАбонента();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
	//ЗаполнитьУслугиАбонента();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения 
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если  ДанныеДляПерерасчета <>Неопределено тогда
		ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросСозданияПерерасчета",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Открыть документ перерасчета?",РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		ДопСвойства  = ТекущийОбъект.ДополнительныеСвойства;
	Если ДопСвойства.свойство("ДанныеДляПерерасчета") тогда
		ДанныеДляПерерасчета = ДопСвойства.ДанныеДляПерерасчета;		 
	иначе
		ДанныеДляПерерасчета = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляПерерасчета", энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ТекущийОбъект));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьУслугиАбонента();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСозданияПерерасчета(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Да тогда
			энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);
		иначе
			ДанныеДляПерерасчета = Неопределено;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиАбонента()
	Объект.УслугиДляОграничения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ВТ_АктивныеТУ
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_АктивныеТУ.КлючПомещения КАК КлючПомещения,
		|	ВЫБОР
		|		КОГДА энргУслугиТочекУчетаСрезПоследних.Услуга.СоставнаяУслуга
		|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
		|		ИНАЧЕ энргУслугиТочекУчетаСрезПоследних.Услуга
		|	КОНЕЦ КАК Услуга
		|ИЗ
		|	ВТ_АктивныеТУ КАК ВТ_АктивныеТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И КлючПомещения = &КлючПомещения) КАК энргУслугиТочекУчетаСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|			ПО энргУслугиТочекУчетаСрезПоследних.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|		ПО ВТ_АктивныеТУ.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
		|			И ВТ_АктивныеТУ.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета";
	
	Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
		Запрос.УстановитьПараметр("Период", Объект.ДатаФактическогоСобытия);
	Иначе
		Запрос.УстановитьПараметр("Период", Объект.Дата);
	КонецЕсли;
	Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Запрос.УстановитьПараметр("КлючПомещения", Объект.КлючПомещения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
 			СтрокаТЧПлательщики = Объект.УслугиДляОграничения.Добавить();
 			ЗаполнитьЗначенияСвойств(СтрокаТЧПлательщики, Выборка);
 		КонецЦикла;	
 
КонецПроцедуры

&НаКлиенте
Процедура УслугиДляОграниченияНачалоПериодаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.УслугиДляОграничения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.КонецПериода) Тогда 
		Возврат
	КонецЕсли;
	
	НачалоПериода = ТекущиеДанные.началоПериода;
	КонецПериода =ТекущиеДанные.КонецПериода;

	нКоличествоДней = ЗаполнитьКоличествоДней(НачалоПериода,КонецПериода);
	ТекущиеДанные.КоличествоДнейРаботы = нКоличествоДней; 
	
	// Вставить содержимое обработчика.
	нПериодНачисления = ЗаполнитьПериодНачисления(НачалоПериода,КонецПериода);
	ТекущиеДанные.ПериодНачисления = нПериодНачисления;

КонецПроцедуры

&НаСервере
Функция  ЗаполнитьКоличествоДней(НачалоПериода,КонецПериода)
	
	//МенеджерДокумента 				= Документы.энргРегистрацияВременногоОграниченияУслуги;
	ОписаниеДопПараметров			= "Организация, Район, НачалоПериодаНачислений, КонецПериодаНачислений, ПериодС, ПериодПо";
	
	НачалоПериодаНачислений 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(НачалоПериода, Объект.Организация, Объект.Район);
	КонецПериодаНачислений 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(КонецПериода, Объект.Организация, Объект.Район);
	
	Если НачалоПериодаНачислений = КонецПериодаНачислений Тогда
		ДопПараметры = Новый Структура(ОписаниеДопПараметров, Объект.Организация, Объект.Район, НачалоПериодаНачислений, КонецПериодаНачислений, НачалоПериода, КонецПериода);
		КолВоДней = ДобавитьЗаписиПриОтсутствииВГраницеТекущегоПериода(ДопПараметры);
	КонецЕсли; 
	
	Возврат КолВоДней;
	
КонецФункции

&НаСервере
Функция ЗаполнитьПериодНачисления(НачалоПериода,КонецПериода)
	НачалоПериодаНачислений 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(НачалоПериода, Объект.Организация, Объект.Район);
	
	Возврат НачалоПериодаНачислений;
	
КонецФункции

&НаСервере
Функция ДобавитьЗаписиПриОтсутствииВГраницеТекущегоПериода(ДопПараметры) 
	ГраницыНачалаПериодаНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(ДопПараметры.Организация, ДопПараметры.Район, ДопПараметры.НачалоПериодаНачислений, Ложь);		
	ПериодС                         	= ДопПараметры.ПериодС;
	ПериодПо                        	= ДопПараметры.ПериодПо; 	
	
	ДниПервогоПериод 					= РассчитатьКолвоДней(ПериодС, ГраницыНачалаПериодаНачисления.НачалоОП);
	ДниВторогоПериода 					= РассчитатьКолвоДней(ГраницыНачалаПериодаНачисления.ЗавершениеОП, НачалоДня((КонецДня(ПериодПо) + 1)));
	КоличествоДнейРаботы 	= ДниПервогоПериод + ДниВторогоПериода;	
	
	Возврат КоличествоДнейРаботы;
	
КонецФункции

&НаСервере
Функция РассчитатьКолвоДней(ПерваяДата, ВтораяДата)
	Возврат (ПерваяДата - ВтораяДата) / (60 * 60 * 24);
КонецФункции

&НаКлиенте
Процедура УслугиДляОграниченияКонецПериодаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УслугиДляОграничения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТекущиеДанные.началоПериода) Тогда 
		Возврат
	КонецЕсли;

	НачалоПериода = ТекущиеДанные.началоПериода;
	КонецПериода =ТекущиеДанные.КонецПериода;

	нКоличествоДней = ЗаполнитьКоличествоДней(НачалоПериода,КонецПериода);
	ТекущиеДанные.КоличествоДнейРаботы = нКоличествоДней; 
	// Вставить содержимое обработчика.
	нПериодНачисления = ЗаполнитьПериодНачисления(НачалоПериода,КонецПериода);
	ТекущиеДанные.ПериодНачисления = нПериодНачисления;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти