#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	РезультатЗарегистрированныеБанкроты = ПолучитьДанныеБанкротов();
	бестРаботаСПараметрамиРасчетаКонтрагентовСервер.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗарегистрированныеБанкроты,				Движения.бестЗарегистрированныеБанкроты);
	
	
	РезультатМораторнаяЗадолженность = ПолучитьМораторнуюЗадолженность();
	бестРаботаСПараметрамиРасчетаКонтрагентовСервер.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатМораторнаяЗадолженность,					Движения.бестМораторнаяЗадолженность);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеБанкротов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестРегистрацияБанкротства.Организация КАК Организация,
	|	бестРегистрацияБанкротства.Район КАК Район,
	|	бестРегистрацияБанкротства.Договор КАК Договор,
	|	бестРегистрацияБанкротства.ДатаОперации КАК Период,
	|	бестРегистрацияБанкротства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом) КАК ПризнанБанкротом
	|ИЗ
	|	Документ.бестРегистрацияБанкротства КАК бестРегистрацияБанкротства
	|ГДЕ
	|	бестРегистрацияБанкротства.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьМораторнуюЗадолженность()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестРегистрацияБанкротства.Организация КАК Организация,
	|	бестРегистрацияБанкротства.Район КАК Район,
	|	бестРегистрацияБанкротства.Договор КАК Договор,
	|	бестРегистрацияБанкротства.ДатаОперации КАК Период,
	|	бестРегистрацияБанкротстваДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	бестРегистрацияБанкротстваДанныеЗадолженности.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ВЫБОР
	|		КОГДА бестРегистрацияБанкротства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом)
	|			ТОГДА бестРегистрацияБанкротстваДанныеЗадолженности.Сумма
	|		ИНАЧЕ -бестРегистрацияБанкротстваДанныеЗадолженности.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА бестРегистрацияБанкротства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом)
	|			ТОГДА бестРегистрацияБанкротстваДанныеЗадолженности.СуммаНДС
	|		ИНАЧЕ -бестРегистрацияБанкротстваДанныеЗадолженности.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	бестРегистрацияБанкротства.ДатаПубликации КАК ДатаПубликации
	|ИЗ
	|	Документ.бестРегистрацияБанкротства.ДанныеЗадолженности КАК бестРегистрацияБанкротстваДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРегистрацияБанкротства КАК бестРегистрацияБанкротства
	|		ПО бестРегистрацияБанкротстваДанныеЗадолженности.Ссылка = бестРегистрацияБанкротства.Ссылка
	|ГДЕ
	|	бестРегистрацияБанкротства.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли