#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

перем ПараметрыФункции;
перем ОбъектМенеджер;
перем ИмяМетода;
перем СтрокаПорядкаПараметров;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Вызывает функцию и возвращает ее результат.
//
// Параметры:
//  ДополнительныеПараметры	-	Структура.
// 
// Возвращаемое значение:
//   Произвольный	-	результат вызываемой функции.
//
Функция Вызвать(Знач ДополнительныеПараметры  = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	мПорядокПараметров  		= СтрРазделить(СтрЗаменить(СтрокаПорядкаПараметров," ",""),",",Ложь);
	мАргументы 					= Новый Массив;
	Для Индекс = 0 По мПорядокПараметров.ВГраница() Цикл
		Если ДополнительныеПараметры.Свойство(мПорядокПараметров[Индекс]) Тогда
			ЗначениеАргумента 	= ДополнительныеПараметры[мПорядокПараметров[Индекс]];
		ИначеЕсли ПараметрыФункции.Свойство(мПорядокПараметров[Индекс]) Тогда
			ЗначениеАргумента 	= ПараметрыФункции[мПорядокПараметров[Индекс]];
		Иначе
			Продолжить;
		КонецЕсли;
		мАргументы.Добавить(ЗначениеАргумента);
	КонецЦикла;  
	
	Возврат ОбщегоНазначения.ВызватьФункциюОбъекта(ОбъектМенеджер,ИмяМетода,мАргументы);
	
КонецФункции

// Устанавливает значение параметра.
//
// Параметры:
//  Ключ		-	Строка.
//  Значение	-	Произвольный.
// 
// Возвращаемое значение:
//   ОбработкаОбъект.энргФункция;
//
Функция УстановитьЗначениеПараметра(Ключ, Значение) Экспорт 
	
	Если ПараметрыФункции = Неопределено Тогда
		ПараметрыФункции = Новый Структура;
	КонецЕсли;
	
	ПараметрыФункции.Вставить(Ключ, Значение);
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Инициализировать(яМенеджер,Знач яИмяМетода,Знач яСтрокаПорядкаПараметров, Знач яПараметрыФункции=Неопределено ) Экспорт
	
	Если ПараметрыФункции = Неопределено Тогда
		ПараметрыФункции 		= Новый Структура;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из яПараметрыФункции Цикл
		ПараметрыФункции.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	ОбъектМенеджер 				= яМенеджер;
	ИмяМетода 					= яИмяМетода;
	СтрокаПорядкаПараметров 	= яСтрокаПорядкаПараметров;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли