
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеРасположения 					= ПолучитьСхемуПрисоединения(Объект.СтруктураСети);
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	бестЛокализацияСервер.ПриСозданииНаСервере_бестИзменитьПараметрыТочкиУчета(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда 
		АдресОбъекта = бестРаботаСОбъектамиНПСервер.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);	
	КонецЕсли;
	
	ЗаполнитьДокумент = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") Тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ТочкаУчета) И ЗаполнитьДокумент тогда
		ЗаполнитьРеквизитыБыло();		
	КонецЕсли;
	
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);  
	
		// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	бестПользовательскийВводСервер.ЗаполнитьМКДНаФорме(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьМассивТочекПоставок();
	Если ИспользоватьТарифныеЗоны Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПотериВидПотерь", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПотериТарифнаяЗона", "Видимость", Истина);
		Элементы.Потери.КоманднаяПанель.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСНезависимымСбытом.ДополнительныеПараметрыЗаписиДатыИзменения(ТекущийОбъект, ЭтотОбъект.Модифицированность, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьМассивТочекПоставок(); 
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда 
		МКД = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "МКД");
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	Иначе
		МКД = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыборУслугиИТочкиУчета();
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаПриИзменении(Элемент)
	Если ИспользоватьТарифныеЗоны Тогда
		ЗаполнитьТаблицуПотерь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиПриИзменении(Элемент)
	Объект.СтруктураСети 				= ПолучитьСтруктуруСетиТочкиПоставки(Объект.ТочкаПоставки);
	ДанныеРасположения 					= ПолучитьСхемуПрисоединения(Объект.СтруктураСети);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.ЗагрузитьЗначения(ТочкиПоставкиОбъекта.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета()
	СтруктураОтбора = Новый Структура("Период,Организация,Район,Договор,ОбъектРасчета",?(ЗначениеЗаполнено(Объект.Дата), КонецДня(Объект.Дата), КонецДня(ТекущаяДата())));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца,ВыводитьСоставные", СтруктураОтбора, "НП", Истина);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		Объект.ТочкаУчета = РезультатЗакрытия.ТочкаУчета;
		ЗаполнитьРеквизитыБыло();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыБыло()
	Объект.НетВозможностьУстановкиПУБыло 	= РегистрыСведений.бестТехническаяВозможностьУстановкиПУ.ПолучитьВозможностьУстановкиПУ(Объект.Дата, Объект.Организация, Объект.Район,  Объект.ТочкаУчета);
	Объект.ЦеноваяКатегорияБыло 			= РегистрыСведений.бестЦеновыеКатегорииТочекУчета.ПолучитьЦеновуюКатегорию(Объект.Дата, Объект.Организация, Объект.Район, МКД, Объект.ОбъектРасчета, Объект.ТочкаУчета);
	Объект.НетВозможностьУстановкиПУ 		= Объект.НетВозможностьУстановкиПУБыло;
	Объект.ЦеноваяКатегория	 				= Объект.ЦеноваяКатегорияБыло;
	
	Объект.ТочкаПоставкиБыло 				= РегистрыСведений.бестТочкиПоставкиТочекУчетаЮЛ.ПолучитьТочкуПоставки(Объект.Дата, Объект.Организация, Объект.Район,  МКД, Объект.ОбъектРасчета,Объект.ТочкаУчета);
	Объект.СтруктураСетиБыло 				= РегистрыСведений.бестСтруктураСетиТочекУчетаНП.ПолучитьСтруктуруСетиТУ(Объект.Дата, Объект.Организация, Объект.Район, МКД, Объект.ОбъектРасчета, Объект.ТочкаУчета);
	Объект.ТочкаПоставки 					= Объект.ТочкаПоставкиБыло;
	Объект.СтруктураСети	 				= Объект.СтруктураСетиБыло;
	ДанныеРасположения 						= ПолучитьСхемуПрисоединения(Объект.СтруктураСети);
	Если ИспользоватьТарифныеЗоны Тогда
		ЗаполнитьТаблицуПотерь();
	Иначе
		Объект.Потери.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМассивТочекПоставок()
	ПараметрыЗапроса = Новый Структура("Период, Организация, Район, МКД, ОбъектРасчета",Объект.Дата,Объект.Организация,Объект.Район,МКД,Объект.ОбъектРасчета);
	
	мТочекПоставок = бестРаботаСТочкамиУчетаНПСервер.ПолучитьМассивТочекПоставки(ПараметрыЗапроса);
	ТочкиПоставкиОбъекта.Очистить();
	ТочкиПоставкиОбъекта.ЗагрузитьЗначения(мТочекПоставок);
	
	МаксимальнаяМощность = ПолучитьМаксимальнуюМощность(Объект.Дата, мТочекПоставок);
	Элементы.ИнформацияОМощности.Заголовок = бестРаботаСТочкамиУчетаНПКлиент.ПолучитьРасшифровкуМощности(МаксимальнаяМощность);
	
	мЦК = бестРаботаСТочкамиУчетаНПКлиент.ПолучитьСписокЦК(МаксимальнаяМощность);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", мЦК);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ЦеноваяКатегория.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

&НаСервере
Функция ПолучитьМаксимальнуюМощность(Период, мТочекПоставок)
	  Возврат РегистрыСведений.энргПараметрыТочекПоставки.ПолучитьМаксимальнуюМощность(Период, мТочекПоставок);
КонецФункции

&НаСервере
Функция ПолучитьСхемуПрисоединения(ТекСтруктураСети)
	Возврат Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ТекСтруктураСети);
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСетиТочкиПоставки(ТекТочка)
	мТочек = Новый Массив;
	мТочек.Добавить(ТекТочка);
	РезультатЗапроса = РегистрыСведений.энргПараметрыТочекПоставки.АктуальныеПараметрыТочкиПоставкиПоСсылке(мТочек);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтруктураСети;
	КонецЦикла;
КонецФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПотерь()
	
	МВТ = Новый МенеджерВременныхТаблиц;
	бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата, Объект.Организация, Объект.Район, Объект.ОбъектРасчета, Ложь,, МВТ,,Объект.ТочкаУчета);
	ТаблицаПотерь = Документы.бестИзменитьПараметрыТочкиУчета.ТаблицаПотерь(МВТ, Объект.Дата, Объект.Организация, Объект.Район, Объект.ОбъектРасчета, Объект.ТочкаУчета); 
	Объект.Потери.Загрузить(ТаблицаПотерь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПотери

&НаКлиенте
Процедура ПотериФиксированныйОбъемПотерьПриИзменении(Элемент)
	Если Не ИспользоватьТарифныеЗоны Тогда
		ТекСтрока = Элементы.Потери.ТекущиеДанные;
		ТекСтрока.ПроцентПотерь = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотериПроцентПотерьПриИзменении(Элемент)
	Если Не ИспользоватьТарифныеЗоны Тогда
		ТекСтрока = Элементы.Потери.ТекущиеДанные;
		ТекСтрока.ФиксированныйОбъемПотерь = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотериПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ИспользоватьТарифныеЗоны Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПотериПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не ИспользоватьТарифныеЗоны И НоваяСтрока Тогда
		ТекСтрока = Элементы.Потери.ТекущиеДанные;
		ТекСтрока.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.БезРазбивки");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти
