#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Процедура МассивПриборов() Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ВыводПрибораУчета",	?(ВидОперации = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие,Истина,ложь));
	Если энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД() ИЛИ ВидОперации = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие Тогда
		Запрос.Текст  	= 
		"ВЫБРАТЬ
		|	ТаблицаПриборов.ПриборУчета КАК ПриборУчета,
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.энргОткрытиеМКД.ТочкиУчета КАК ТаблицаПриборов
		|ГДЕ
		|	ТаблицаПриборов.Ссылка = &ссылка
		|	И НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	Иначе 
		Запрос.Текст  	= 
		"ВЫБРАТЬ
		|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель
		|ИЗ
		|	Документ.энргОткрытиеМКД.ТочкиУчета КАК ТаблицаТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОткрытиеМКД.ПриборыУзловУчета КАК ТаблицаПриборов
		|		ПО ТаблицаТочкиУчета.Ссылка = ТаблицаПриборов.Ссылка
		|			И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
		|			И (ТаблицаПриборов.Ссылка = &Ссылка)
		|			И ТаблицаТочкиУчета.IDСтроки = ТаблицаПриборов.IDСтроки
		|			И (НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	КонецЕсли;

	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
		
	Если ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие тогда
		МКД 					= Справочники.энргСтроения.ПустаяСсылка();
		Для Каждого стр из ТочкиУчета цикл
			стр.ТочкаУчета	 	= Справочники.энргТочкиУчета.ПустаяСсылка();
			стр.ПриборУчета 	= Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();		
		КонецЦикла;
	КонецЕсли;   
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие тогда
		ПроверяемыеРеквизиты.добавить("Адрес");
		//ПроверяемыеРеквизиты.добавить("ВидБлагоустройства");
		ПроверяемыеРеквизиты.добавить("КоличествоЭтажей");
		
		ПроверяемыеРеквизиты.добавить("ОбщаяПлощадь");		
		ПроверяемыеРеквизиты.Добавить("ЗначениеПлощадей");
		ПроверяемыеРеквизиты.Добавить("Поставщики");
		
		Для Каждого СтрокаТЧ Из  ТочкиУчета Цикл 
			Если ЗначениеЗаполнено(СтрокаТЧ.УдалитьЗаводскойНомер) И  Не ЗначениеЗаполнено(СтрокаТЧ.УдалитьВидДифференцированности) Тогда 
				  Отказ 		= Истина;
				  ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле Вид дифференцированности",ЭтотОбъект,"ТочкиУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ВидДифференцированности");
			КонецЕсли; 			
		КонецЦикла;
		
		Если РегистрыСведений.энргФормыУправленияМКД.ПроверятьУК(ФормаУправления) Тогда
			ПроверяемыеРеквизиты.Добавить("УК");
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();					
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 	
	Документы.энргОткрытиеМКД.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	
	ДополнительныеСвойства.Вставить("МоментВремени", МоментВремени());
	Документы.энргОткрытиеМКД.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли