#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает возможность установки ПУ.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  ТочкаУчета	-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ПолучитьВозможностьУстановкиПУ(Период, Организация, Район, ТочкаУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестТехническаяВозможностьУстановкиПУСрезПоследних.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ
		|ИЗ
		|	РегистрСведений.бестТехническаяВозможностьУстановкиПУ.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета) КАК бестТехническаяВозможностьУстановкиПУСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.НетВозможностьУстановкиПУ;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

#КонецОбласти

#КонецЕсли