#Область ПрограммныйИнтерфейс

// Процедура - Зарегистрировать в последовательности НППри записи
// Вызывается из подписки на событие бестСтабильныеПериодыПоследовательностьНППриЗаписи
//
// Параметры:
//  Источник - см в подписке 
//  Отказ	 - Булево 
//
Процедура ЗарегистрироватьВПоследовательностиНППриЗаписи(Источник, Отказ) Экспорт

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ВидОперации")
		И Источник.ВидОперации = Перечисления.бестВидыОпераций.ОперацияСПриборомУчета_ЗаменаВспомогательногоПУ Тогда
		Возврат;
	КонецЕсли;
	
	Инструменты         = бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиСобытияНП();
	Инструменты.ЗарегистрироватьВПоследовательностиНППриЗаписи(Источник, Отказ);
	
КонецПроцедуры

// Процедура - Зарегистрировать в последовательности показания ПУНППри записи
// Вызывается из подписки на событие бестПоказанияПУНППоследовательностьПриЗаписи
//
// Параметры:
//  Источник - см в подписке 
//  Отказ	 - Булево 
//
Процедура ЗарегистрироватьВПоследовательностиПоказанияПУНППриЗаписи(Источник, Отказ) Экспорт
		
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиСобытияНП();
	Инструменты.ЗарегистрироватьВПоследовательностиПоказанияПУНППриЗаписи(Источник, Отказ);
	
КонецПроцедуры  

// Процедура - Зарегистрировать в последовательности взаиморасчеты
// Вызывается из подписки на событие бестВзаиморасчетыПоследовательностьПриЗаписи
//
// Параметры:
//  Источник - см в подписке 
//  Отказ	 - Булево 
//
Процедура ЗарегистрироватьВПоследовательностиВзаиморасчеты(Источник, Отказ) Экспорт
	
	Инструменты  		= бестЗащитаСерверПовтИсп.РаботаСПоследовательностямиСобытияНП();
	Инструменты.ЗарегистрироватьВПоследовательностиВзаиморасчеты(Источник, Отказ);
		
КонецПроцедуры

#КонецОбласти
