#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем РодительскийЭтап;
	
	Если Параметры.Свойство("РодительскийЭтап", РодительскийЭтап) Тогда
	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение	= ПолучитьПодэтапы(РодительскийЭтап);
	
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоОРП") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапОРП", Параметры.ТолькоОРП, 
				ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеМетоды

&НаСервереБезКонтекста
Функция ПолучитьПодэтапы(Этап)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВидыОперацийПИДПодэтапы.Подэтап КАК Подэтап
		|ИЗ
		|	Справочник.энргВидыОперацийПИД.Подэтапы КАК энргВидыОперацийПИДПодэтапы
		|ГДЕ
		|	энргВидыОперацийПИДПодэтапы.Ссылка = &Этап";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СписокЭтапов = Новый СписокЗначений;
	СписокЭтапов.ЗагрузитьЗначения(РезультатЗапроса.ВыгрузитьКолонку(0));
	
	Возврат СписокЭтапов;
КонецФункции

#КонецОбласти

