#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗаполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестОперацияСУслугамиНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестОперацияСУслугамиНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестОперацияСУслугамиНП",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестОперацияСУслугамиНП");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
		
КонецПроцедуры

// Заполняет список команд создания на основании закрытие ЛС.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииОперацияСУслугами(КомандыСоздатьНаОсновании);  	
		
КонецФункции

// Возвращает все ТУ с признаком до ТП
// 
// Параметры:
//  Период - Дата
//  Организация - СправочникСсылка.Организации
//  Район - СправочникСсылка.энргЗоныОтвественности
//  ОбъектРасчета - СправочникСсылка.бестОбъектыРасчета
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
//
Функция ТочкиУчетаДоТП(Период, Организация, Район, ОбъектРасчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	               |	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	               |	энргТочкиУчета.Расположение КАК Расположение,
	               |	энргТочкиУчета.Головная КАК Головная,
	               |	бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ГБП КАК ГБП,
	               |	энргВидыУслуг.СоставнаяУслуга КАК ЭтоСоставнаяУслуга
	               |ПОМЕСТИТЬ ВТ_ТУ
	               |ИЗ
	               |	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И ОбъектРасчета = &ОбъектРасчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ОбъектРасчета = &ОбъектРасчета) КАК бестУслугиТочекУчетаНПСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	               |			ПО бестУслугиТочекУчетаНПСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	               |		ПО бестАктивностьТочекУчетаНПСрезПоследних.Организация = бестУслугиТочекУчетаНПСрезПоследних.Организация
	               |			И бестАктивностьТочекУчетаНПСрезПоследних.Район = бестУслугиТочекУчетаНПСрезПоследних.Район
	               |			И бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета
	               |			И бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета = бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТочкиУчета КАК энргТочкиУчета
	               |		ПО бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета = энргТочкиУчета.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестРасположениеТочекУчетаОтносительноГБП.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестРасположениеТочекУчетаОтносительноГБПСрезПоследних
	               |		ПО бестАктивностьТочекУчетаНПСрезПоследних.Организация = бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Организация
	               |			И бестАктивностьТочекУчетаНПСрезПоследних.Район = бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.Район
	               |			И бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета = бестРасположениеТочекУчетаОтносительноГБПСрезПоследних.ТочкаУчета
	               |ГДЕ
	               |	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	               |	ВТ_ТУ.Услуга КАК Услуга,
	               |	ВТ_ТУ.Расположение КАК Расположение,
	               |	ВТ_ТУ.Головная КАК Головная,
	               |	ВТ_ТУ.ГБП КАК ГБП,
	               |	ВТ_ТУ.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	               |	бестПоставщикиУслугНПСрезПоследних.Поставщик КАК Поставщик,
	               |	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	               |ИЗ
	               |	ВТ_ТУ КАК ВТ_ТУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ОбъектРасчета = &ОбъектРасчета
	               |					И ТочкаУчета В
	               |						(ВЫБРАТЬ
	               |							ВТ_ТУ.ТочкаУчета
	               |						ИЗ
	               |							ВТ_ТУ КАК ВТ_ТУ)) КАК бестПоставщикиУслугНПСрезПоследних
	               |		ПО ВТ_ТУ.ТочкаУчета = бестПоставщикиУслугНПСрезПоследних.ТочкаУчета
	               |			И ВТ_ТУ.Услуга = бестПоставщикиУслугНПСрезПоследних.Услуга
	               |			И (НЕ ВТ_ТУ.ЭтоСоставнаяУслуга)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ОбъектРасчета = &ОбъектРасчета
	               |					И ТочкаУчета В
	               |						(ВЫБРАТЬ
	               |							ВТ_ТУ.ТочкаУчета
	               |						ИЗ
	               |							ВТ_ТУ КАК ВТ_ТУ)) КАК бестДоговорыТочекУчетаСрезПоследних
	               |		ПО ВТ_ТУ.ТочкаУчета = бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета
	               |			И ВТ_ТУ.Услуга = бестДоговорыТочекУчетаСрезПоследних.Услуга
	               |			И (НЕ ВТ_ТУ.ЭтоСоставнаяУслуга)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("Период", Период);
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции

// Возвращает поставщики услуг
// 
// Параметры:
//  Период - Дата
//  Организация - СправочникСсылка.Организации
//  Район - СправочникСсылка.энргЗоныОтвественности
//  ТочкиУчета - ТаблицаЗначений
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
//
Функция ПоставщикиУслуг(Период, Организация, Район, ТочкиУчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТочкиУчета.IDСтроки КАК IDСтроки,
	               |	ТочкиУчета.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ВТ_ТУ
	               |ИЗ
	               |	&ТочкиУчета КАК ТочкиУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТУ.IDСтроки КАК IDСтроки,
	               |	бестПоставщикиУслугНПСрезПоследних.ЧастьСоставной КАК ЧастьСоставнойУслуги,
	               |	бестПоставщикиУслугНПСрезПоследних.Поставщик КАК Поставщик
	               |ИЗ
	               |	ВТ_ТУ КАК ВТ_ТУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ТочкаУчета В
	               |						(ВЫБРАТЬ
	               |							ВТ_ТУ.ТочкаУчета
	               |						ИЗ
	               |							ВТ_ТУ КАК ВТ_ТУ)) КАК бестПоставщикиУслугНПСрезПоследних
	               |		ПО ВТ_ТУ.ТочкаУчета = бестПоставщикиУслугНПСрезПоследних.ТочкаУчета";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкиУчета", ТочкиУчета);
	Запрос.УстановитьПараметр("Период", Период);
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции

// Возвращает договоры услуг
// 
// Параметры:
//  Период - Дата
//  Организация - СправочникСсылка.Организации
//  Район - СправочникСсылка.энргЗоныОтвественности
//  ТочкиУчета - ТаблицаЗначений
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
//
Функция ДоговорыУслуг(Период, Организация, Район, ТочкиУчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТочкиУчета.IDСтроки КАК IDСтроки,
	               |	ТочкиУчета.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ВТ_ТУ
	               |ИЗ
	               |	&ТочкиУчета КАК ТочкиУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТУ.IDСтроки КАК IDСтроки,
	               |	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК ЧастьСоставнойУслуги,
	               |	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	               |ИЗ
	               |	ВТ_ТУ КАК ВТ_ТУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ТочкаУчета В
	               |						(ВЫБРАТЬ
	               |							ВТ_ТУ.ТочкаУчета
	               |						ИЗ
	               |							ВТ_ТУ КАК ВТ_ТУ)) КАК бестДоговорыТочекУчетаСрезПоследних
	               |		ПО ВТ_ТУ.ТочкаУчета = бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкиУчета", ТочкиУчета);
	Запрос.УстановитьПараметр("Период", Период);
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции

// Процедура - Инициализировать данные документа
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка.бестОперацияСУслугамиНП 
//  ДополнительныеСвойства	 - Структура 
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт 
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	ИнициализироватьИсходныеДанныеДокумента(Схема);
		
	ДобавитьТекстЗапросабестАктивностьТочекУчетаНП(Схема, "бестАктивностьТочекУчетаНП");  
	ДобавитьТекстЗапросабестТочкиПоставкиТочекУчетаЮЛ(Схема, "бестТочкиПоставкиТочекУчетаЮЛ"); 
	
	ДобавитьТекстЗапросаПереопределяемая(Схема);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема)
	ПолучитьШапкуДокумента(Схема);
	ПолучитьТаблицуТочекУчета(Схема); 
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.Дата
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Район КАК Район,
	|	Шапка.Договор КАК Договор,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	Шапка.ОбъектРасчета КАК ОбъектРасчета,
	|	Шапка.ОбъектРасчета.МКД КАК МКД
	|ПОМЕСТИТЬ РеквизитыДокумента
	|ИЗ
	|	Документ.бестОперацияСУслугамиНП КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)");	
КонецПроцедуры  

Процедура ПолучитьТаблицуТочекУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.Ссылка КАК Ссылка,
	|	ТаблицаТочекУчета.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТочекУчета.IDСтроки КАК IDСтроки,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочекУчета.УзелУчета КАК УзелУчета,
	|	ТаблицаТочекУчета.Услуга КАК Услуга,
	|	ТаблицаТочекУчета.Поставщик КАК Поставщик,
	|	ТаблицаТочекУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	ТаблицаТочекУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаТочекУчета.НомерПломбы КАК НомерПломбы,
	|	ТаблицаТочекУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	ТаблицаТочекУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	ТаблицаТочекУчета.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
	|	ТаблицаТочекУчета.ДатаВыпуска КАК ДатаВыпуска,
	|	ТаблицаТочекУчета.ОписаниеТочки КАК ОписаниеТочки,
	|	ТаблицаТочекУчета.ОписаниеПрибора КАК ОписаниеПрибора,
	|	ТаблицаТочекУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	ТаблицаТочекУчета.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
	|	ТаблицаТочекУчета.ГБП КАК ГБП,
	|	ТаблицаТочекУчета.ТипУзлаУчета КАК ТипУзлаУчета,
	|	ТаблицаТочекУчета.IDТочкиУчета КАК IDТочкиУчета,
	|	ТаблицаТочекУчета.ИдентификаторТУ КАК ИдентификаторТУ,
	|	ТаблицаТочекУчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ТаблицаТочекУчета.IDОбъектаРасчета КАК IDОбъектаРасчета,
	|	ТаблицаТочекУчета.Флаг КАК Флаг,
	|	ТаблицаТочекУчета.Договор КАК Договор,
	|	ТаблицаТочекУчета.СтруктураСети КАК СтруктураСети,
	|	ТаблицаТочекУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ТаблицаТочекУчета.Техническая КАК Техническая,
	|	ТаблицаТочекУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ТаблицаТочекУчета.РассчитыватьРеактивнуюЭнергию КАК РассчитыватьРеактивнуюЭнергию,
	|	ТаблицаТочекУчета.РассчитыватьПотери КАК РассчитыватьПотери,
	|	ТаблицаТочекУчета.tgφ КАК tgφ,
	|	ТаблицаТочекУчета.ТочкаПоставки КАК ТочкаПоставки,
	|	ТаблицаТочекУчета.РасчетПоГрафикуГП КАК РасчетПоГрафикуГП,
	|	ТаблицаТочекУчета.ДлинаТрубы КАК ДлинаТрубы,
	|	ТаблицаТочекУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям
	|ПОМЕСТИТЬ ТаблицаТочекУчета
	|ИЗ
	|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК ТаблицаТочекУчета
	|ГДЕ
	|	ТаблицаТочекУчета.Ссылка В(&мДокументы)");	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

Процедура ДобавитьТекстЗапросабестАктивностьТочекУчетаНП(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.Дата КАК ПериодРегистрации,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена) КАК Состояние,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	РеквизитыДокумента.ОбъектРасчета КАК ОбъектРасчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка
	|ГДЕ
	|	РеквизитыДокумента.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги), ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслугиПослеТП))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.Организация,
	|	РеквизитыДокумента.Район,
	|	РеквизитыДокумента.Дата,
	|	РеквизитыДокумента.ПериодНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена),
	|	ТаблицаТочекУчета.ТочкаУчета,
	|	РеквизитыДокумента.ОбъектРасчета
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка
	|ГДЕ
	|	РеквизитыДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ОперацияСУслугами_ОтключениеУслуги)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестТочкиПоставкиТочекУчетаЮЛ(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Период,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.Район КАК Район,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	РеквизитыДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	РеквизитыДокумента.МКД КАК МКД,
	|	ТаблицаТочекУчета.ТочкаПоставки КАК ТочкаПоставки
	|ИЗ
	|	РеквизитыДокумента КАК РеквизитыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|		ПО РеквизитыДокумента.Ссылка = ТаблицаТочекУчета.Ссылка";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПереопределяемая(Схема)
	// Процедура для добавления новых движений в расширениях проектов	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли