#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) Тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия), Ссылка), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату фактического события";
	Иначе
		Момент 			= Новый Граница(МоментВремени(), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;	
		
	УслугиТочекОтлючены 	= Истина;
	ПриборыВыведены 		= Истина;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги тогда
		Если Не СоставУзлаКорректен() Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		//ПроверкаНаличияНагрузокДоговора();
		
		// проверка если ПУ Уже активен в регистре бестСостояниеПриборовУчетаНП
		Пакет = ПолучитьДанныеТЧ();
		СостоянияУзлов					= Пакет[1];
		ВыборкаСостоянияУзлов = СостоянияУзлов.Выбрать();
		
		Пока ВыборкаСостоянияУзлов.Следующий() Цикл
			ПУ = ВыборкаСостоянияУзлов.ПриборУчета;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
			|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние КАК Состояние
			|ИЗ
			|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
			|			,
			|			ПриборУчета = &ПриборУчета
			|				И Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)) КАК бестСостояниеПриборовУчетаНПСрезПоследних";
			Запрос.УстановитьПараметр("ПриборУчета",ПУ);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				ОбщегоНазначения.СообщитьПользователю("Проведение отменено. Прибор учета " + Строка(ПУ) + " Уже активен на другой точке учета / объекте расчета. ");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		ОперацииПриПодключенииУслуги(ДанныеШапки);
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСУслугами_ОтключениеУслуги тогда
		
		Для Каждого СтрокаТЧ Из ПоказанияПриборовУчета Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ТекущиеПоказания) И Не СтрокаТЧ.ТекущиеПоказания = СтрокаТЧ.ПредыдущиеПоказания  Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнены текущие показания",ЭтотОбъект,"ПоказанияПриборовУчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТекущиеПоказания");				
			КонецЕсли;	
		КонецЦикла;
		
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
		ОперацииПриОтключенииУслуги(ДанныеШапки);	
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСУслугами_ОграничениеУслуги Тогда
		ОперацииПриОграниченииУслуги(ДанныеШапки);
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСУслугами_ВозобновлениеУслуги Тогда
		ОперацииПриВозобновленииУслуги(ДанныеШапки);
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслугиПослеТП Тогда
		Документы.бестОперацияСУслугамиНП.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		бестПроведениеСерверНП.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	КонецЕсли;   	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	Организация = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Подключение_Услуги

Процедура ОперацииПриПодключенииУслуги(ДанныеШапки)
	Пакет = ПолучитьДанныеТЧ();
	
	ДанныеТочекУчета				= Пакет[0];
	СостоянияУзлов					= Пакет[1];
	ДанныеПриборовУзловУчета		= Пакет[2];
	ДанныеПоказанийПриборовУчета 	= Пакет[3];
	ДанныеКаналовПриборовУчета		= Пакет[4];
	ДанныеСоставныхУслуг			= Пакет[5];
	ДанныеПараметрыИзмерителей		= Пакет[6];	
	ДанныеДоговоров					= Пакет[7];
	ДанныеКомУчета					= Пакет[8];
	ДанныеВведенныеПУУзлов			= Пакет[9];
	ДанныеНомераПломб				= Пакет[10];
	ДанныеПотери					= Пакет[11];
	ДанныеПоставщики				= Пакет[12];
	ДанныеРасчетТолькоПоПоказаниям	= Пакет[13];
	ДанныеТиповТарифа				= Пакет[14];
	
	//Пока СостоянияУзлов.Следующий Цикл
	//	ПУ = СостоянияУсзлов.ПриборУчета;
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	//	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние КАК Состояние
	//	|ИЗ
	//	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	//	|			,
	//	|			ПриборУчета = &ПриборУчета
	//	|				И Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)) КАК бестСостояниеПриборовУчетаНПСрезПоследних"
	//	Запрос.УстановитьПараметры("ПриборУчета",ПУ);
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		ОбщегоНазначения.СообщитьПользователю("Проведение отменено. Прибор учета" + Строка(ПУ) + "Уже активен на другой точке учета / объекте расчета. ");
	//		Возврат;
	//	КонецЕсли;
	//КонецЦикла;
	//
	// точки учета
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.энргВладельцыТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестУслугиТочекУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестАктивностьТочекУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестРасположениеТочекУчетаОтносительноГБП);	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеСоставныхУслуг,	Движения.бестСпособНачисленияНормативаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестСтруктураСетиТочекУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестТочкиПоставкиТочекУчетаЮЛ);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестЦеновыеКатегорииТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТиповТарифа,		Движения.бестТипыТарифовТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестТарифныеСеткиТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестЗначенияСкидкиТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,		Движения.бестТехническаяВозможностьУстановкиПУ);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоставщики,		Движения.бестПоставщикиУслугНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеРасчетТолькоПоПоказаниям, Движения.бестСвойствоРасчетТолькоПоПоказаниямТочекУчета);
	энргРаботаСТочкамиУчетаСервер.УстановитьФормулуРасчетаУслугТочкиУчетаМКД(Движения, ДанныеШапки, ФормулыРасчетаУслуг());
	
	
	
	
	//Узлы
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(СостоянияУзлов,	Движения.бестПриборыТочекУчетаНП);//Теперь это УЗЕЛ!
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(СостоянияУзлов,	Движения.бестСостояниеПриборовУчетаНП);//Теперь это состояние УЗЛА!  		
		
	// приборы учета
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеВведенныеПУУзлов,		Движения.бестПриборыУзловУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПараметрыИзмерителей,	Движения.бестПараметрыИзмерителей);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовУзловУчета,		Движения.бестКоэффциентыПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовУзловУчета,		Движения.бестДатыПоверкиПрибораУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеКомУчета,					Движения.бестДопускПриборовУчетаККоммерческомуУчету);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеКаналовПриборовУчета,		Движения.бестВидыДифференцированностиПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеДоговоров,				Движения.бестДоговорыТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеНомераПломб,				Движения.бестНомерПломбПриборовУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПотери,					Движения.бестПотериТочекУчета);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,				Движения.бестТУРассчитываемыеПоГрафикуГП);

	
	//бестРаботаСПоставщикамиПомещенийСервер.ЗаписатьПоставщикаУслуг(ДанныеШапки,Движения,"Поставщик");
	
КонецПроцедуры

Функция ПолучитьДанныеТЧ()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),ДатаФактическогоСобытия,Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);  	
	Текст 		= 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&ОбъектРасчета КАК ОбъектРасчета,
		|	&ОбъектРасчета КАК АбонентВладелец,
		|	&МКД КАК МКД,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена) КАК Состояние,
		|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаТочкиУчета.Услуга КАК Услуга,
		|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаТочкиУчета.НомерПломбы КАК НомерПломбы,
		|	ТаблицаТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
		|	ТаблицаТочкиУчета.КоэффициентПУ КАК Коэффициент,
		|	ТаблицаТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверки,
		|	ТаблицаТочкиУчета.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
		|	ТаблицаТочкиУчета.Ссылка КАК Ссылка,
		|	ТаблицаТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	ТаблицаТочкиУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	ТаблицаТочкиУчета.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
		|	ТаблицаТочкиУчета.ГБП КАК ГБП,
		|	ТаблицаТочкиУчета.Договор КАК Договор,
		|	ТаблицаТочкиУчета.СтруктураСети КАК СтруктураСети,
		|	ТаблицаТочкиУчета.ЦеноваяКатегория КАК ЦеноваяКатегория,
		|	ТаблицаТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
		|	ТаблицаТочкиУчета.ТочкаПоставки КАК ТочкаПоставки,
		|	ТаблицаТочкиУчета.Поставщик КАК Поставщик,
		|	ТаблицаТочкиУчета.РасчетПоГрафикуГП КАК РасчетПоГрафикуГП,
		|	ТаблицаТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
		|	ТаблицаТочкиУчета.ПоставщикПокупатель КАК ПоставщикПокупатель,
		|	ТаблицаТочкиУчета.Техническая КАК Техническая,
		|	ТаблицаТочкиУчета.ТипТарифа КАК ТипТарифа,
		|	ТаблицаТочкиУчета.ТарифнаяСетка КАК ТарифнаяСетка,
		|	ТаблицаТочкиУчета.ЗначениеСкидки КАК ЗначениеСкидки
		|ПОМЕСТИТЬ ВТ_ТУ
		|ИЗ
		|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК ТаблицаТочкиУчета
		|ГДЕ
		|	ТаблицаТочкиУчета.Ссылка = &ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.АбонентВладелец КАК АбонентВладелец,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.Услуга КАК Услуга,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ТУ.Ссылка КАК Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
		|	ВТ_ТУ.МКД КАК МКД
		|ПОМЕСТИТЬ ВТ_СостояниеУзла
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
		|	ВТ_ТУ.Ссылка КАК Ссылка,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ОбъектРасчета КАК АбонентВладелец,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.Услуга КАК Услуга,
		|	ВТ_ТУ.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
		|	бестОперацияСУслугамиНПИзмерители.ПриборУчета КАК ПриборУчета,
		|	бестОперацияСУслугамиНПИзмерители.НомерПломбы КАК НомерПломбы,
		|	бестОперацияСУслугамиНПИзмерители.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
		|	бестОперацияСУслугамиНПИзмерители.КоэффициентПУ КАК Коэффициент,
		|	бестОперацияСУслугамиНПИзмерители.ДатаПоверкиСчетчика КАК ДатаПоверки,
		|	ВТ_ТУ.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	ВТ_ТУ.IDСтроки КАК IDСтроки,
		|	бестОперацияСУслугамиНПИзмерители.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	бестОперацияСУслугамиНПИзмерители.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
		|	ВТ_ТУ.ГБП КАК ГБП,
		|	ВТ_ТУ.ПриборУчета КАК УзелУчета,
		|	бестОперацияСУслугамиНПИзмерители.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
		|	бестОперацияСУслугамиНПИзмерители.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	ВТ_ТУ.МКД КАК МКД,
		|	бестОперацияСУслугамиНПИзмерители.IDСтроки КАК IDСтрокиИзмерителя
		|ПОМЕСТИТЬ ВТ_ПУ
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.Измерители КАК бестОперацияСУслугамиНПИзмерители
		|		ПО ВТ_ТУ.Ссылка = бестОперацияСУслугамиНПИзмерители.Ссылка
		|			И ВТ_ТУ.IDСтроки = бестОперацияСУслугамиНПИзмерители.IDСтрокиТочкиУчета
		|			И (бестОперацияСУслугамиНПИзмерители.Ссылка = &Ссылка)
		|			И (бестОперацияСУслугамиНПИзмерители.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
		|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) КАК ПричинаОтклонения,
		|	ЛОЖЬ КАК КС,
		|	ТаблицаПоказанийПриборовУчета.Переворот КАК Переворот,
		|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ШкалыПриборовУчета.Шкала КАК Шкала,
		|	ВТ_ТУ.МКД КАК МКД
		|ПОМЕСТИТЬ ВТ_ПоказанияПУ
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ШкалыПриборовУчета КАК ШкалыПриборовУчета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
		|			ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
		|				И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
		|				И (ТаблицаПоказанийПриборовУчета.Ссылка = &ссылка)
		|		ПО ВТ_ТУ.Ссылка = ШкалыПриборовУчета.Ссылка
		|			И (ШкалыПриборовУчета.Ссылка = &ссылка)
		|			И ВТ_ТУ.IDСтроки = ШкалыПриборовУчета.IDСтрокиТочкиУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	ТаблицаШкалыПриборов.Шкала КАК Шкала,
		|	ВЫБОР
		|		КОГДА ТаблицаШкалыПриборов.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
		|		ИНАЧЕ ТаблицаШкалыПриборов.ВидДифференцированности
		|	КОНЕЦ КАК ВидДифференцированности,
		|	ВТ_ТУ.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ШкалыПУ
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ШкалыПриборовУчета КАК ТаблицаШкалыПриборов
		|		ПО (ТаблицаШкалыПриборов.Ссылка = &Ссылка)
		|			И (ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
		|			И ВТ_ТУ.IDСтроки = ТаблицаШкалыПриборов.IDСтрокиТочкиУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВЫБОР
		|		КОГДА ВТ_ТУ.ЭтоСоставнаяУслуга
		|			ТОГДА бестОперацияСУслугамиНПСпособыРасчетаНормативаСоставныхУслуг.ЧастьСоставнойУслуги
		|		ИНАЧЕ ВТ_ТУ.Услуга
		|	КОНЕЦ КАК Услуга,
		|	ВЫБОР
		|		КОГДА ВТ_ТУ.ЭтоСоставнаяУслуга
		|			ТОГДА бестОперацияСУслугамиНПСпособыРасчетаНормативаСоставныхУслуг.СпособРасчетаНорматива
		|		ИНАЧЕ ВТ_ТУ.Договор
		|	КОНЕЦ КАК СпособРасчетаНорматива,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.Техническая КАК Техническая
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.СпособыРасчетаНормативаСоставныхУслуг КАК бестОперацияСУслугамиНПСпособыРасчетаНормативаСоставныхУслуг
		|		ПО (ВТ_ТУ.ЭтоСоставнаяУслуга)
		|			И ВТ_ТУ.IDСтроки = бестОперацияСУслугамиНПСпособыРасчетаНормативаСоставныхУслуг.IDСтроки
		|			И (бестОперацияСУслугамиНПСпособыРасчетаНормативаСоставныхУслуг.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.ПриборУчета КАК Измеритель,
		|	ТаблицаШкалыПриборов.Шкала КАК Шкала,
		|	ВТ_ТУ.Период КАК Период,
		|	ТаблицаШкалыПриборов.ВидПараметра КАК ВидПараметра
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ШкалыПриборовУчета КАК ТаблицаШкалыПриборов
		|		ПО ВТ_ТУ.Ссылка = ТаблицаШкалыПриборов.Ссылка
		|			И (ТаблицаШкалыПриборов.Ссылка = &Ссылка)
		|			И (ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
		|			И (ТаблицаШкалыПриборов.ВидПараметра <> ЗНАЧЕНИЕ(Справочник.бестВидыПараметровИзмерителей.ПустаяСсылка))
		|			И ВТ_ТУ.IDСтроки = ТаблицаШкалыПриборов.IDСтрокиТочкиУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВЫБОР
		|		КОГДА ВТ_ТУ.ЭтоСоставнаяУслуга
		|			ТОГДА бестОперацияСУслугамиНПДоговорыСоставныхУслуг.ЧастьСоставнойУслуги
		|		ИНАЧЕ ВТ_ТУ.Услуга
		|	КОНЕЦ КАК Услуга,
		|	ВЫБОР
		|		КОГДА ВТ_ТУ.ЭтоСоставнаяУслуга
		|			ТОГДА бестОперацияСУслугамиНПДоговорыСоставныхУслуг.Договор
		|		ИНАЧЕ ВТ_ТУ.Договор
		|	КОНЕЦ КАК Договор,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ДоговорыСоставныхУслуг КАК бестОперацияСУслугамиНПДоговорыСоставныхУслуг
		|		ПО (ВТ_ТУ.ЭтоСоставнаяУслуга)
		|			И ВТ_ТУ.IDСтроки = бестОперацияСУслугамиНПДоговорыСоставныхУслуг.IDСтроки
		|			И (бестОперацияСУслугамиНПДоговорыСоставныхУслуг.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ТУ.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
		|	ВТ_ТУ.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	ВТ_ТУ.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.пустаяссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПУ.Период КАК Период,
		|	ВТ_ПУ.Организация КАК Организация,
		|	ВТ_ПУ.Район КАК Район,
		|	ВТ_ПУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ПУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ПУ.Состояние КАК Состояние,
		|	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ПУ.УзелУчета КАК УзелУчета,
		|	ВТ_ПУ.ТипИзмерителя КАК ТипИзмерителя,
		|	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ПУ.МКД КАК МКД
		|ИЗ
		|	ВТ_ПУ КАК ВТ_ПУ
		|ГДЕ
		|	ВТ_ПУ.УзелУчета <> ВТ_ПУ.ПриборУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПУ.Период КАК Период,
		|	ВТ_ПУ.Организация КАК Организация,
		|	ВТ_ПУ.Район КАК Район,
		|	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
		|	бестОперацияСУслугамиНПНомераПломб.НомерПломбы КАК НомерПломбы,
		|	бестОперацияСУслугамиНПНомераПломб.КлючСтроки КАК МестоУстановки,
		|	бестОперацияСУслугамиНПНомераПломб.ДатаУстановкиПломбы КАК ДатаОперацииСПломбой,
		|	бестОперацияСУслугамиНПНомераПломб.ЛицоУстановившееПломбу КАК ОтветственноеЛицо,
		|	бестОперацияСУслугамиНПНомераПломб.ВидПломбы КАК ВидПломбы,
		|	ИСТИНА КАК Состояние
		|ИЗ
		|	ВТ_ПУ КАК ВТ_ПУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.НомераПломб КАК бестОперацияСУслугамиНПНомераПломб
		|		ПО ВТ_ПУ.Ссылка = бестОперацияСУслугамиНПНомераПломб.Ссылка
		|			И ВТ_ПУ.IDСтрокиИзмерителя = бестОперацияСУслугамиНПНомераПломб.IDСтрокиИзмерителя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	бестОперацияСУслугамиНППотери.ТарифнаяЗона КАК ТарифнаяЗона,
		|	бестОперацияСУслугамиНППотери.ВидПотерь КАК ВидПотерь,
		|	бестОперацияСУслугамиНППотери.ФиксированныйОбъемПотерь КАК ФиксированныйОбъемПотерь,
		|	бестОперацияСУслугамиНППотери.ПроцентПотерь КАК ПроцентПотерь
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.Потери КАК бестОперацияСУслугамиНППотери
		|		ПО ВТ_ТУ.Ссылка = бестОперацияСУслугамиНППотери.Ссылка
		|			И ВТ_ТУ.IDСтроки = бестОперацияСУслугамиНППотери.IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.Услуга КАК Услуга,
		|	ВЫБОР
		|		КОГДА бестОперацияСУслугамиНППоставщикиСоставныхУслуг.Поставщик ЕСТЬ NULL
		|			ТОГДА ВТ_ТУ.Услуга
		|		ИНАЧЕ бестОперацияСУслугамиНППоставщикиСоставныхУслуг.ЧастьСоставнойУслуги
		|	КОНЕЦ КАК ЧастьСоставной,
		|	ВЫБОР
		|		КОГДА бестОперацияСУслугамиНППоставщикиСоставныхУслуг.Поставщик ЕСТЬ NULL
		|			ТОГДА ВТ_ТУ.Поставщик
		|		ИНАЧЕ бестОперацияСУслугамиНППоставщикиСоставныхУслуг.Поставщик
		|	КОНЕЦ КАК Поставщик,
		|	ВТ_ТУ.ПоставщикПокупатель КАК ПоставщикПокупатель,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ПоставщикиСоставныхУслуг КАК бестОперацияСУслугамиНППоставщикиСоставныхУслуг
		|		ПО ВТ_ТУ.Ссылка = бестОперацияСУслугамиНППоставщикиСоставныхУслуг.Ссылка
		|			И ВТ_ТУ.IDСтроки = бестОперацияСУслугамиНППоставщикиСоставныхУслуг.IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТУ.Период КАК Период,
		|	ВТ_ТУ.Организация КАК Организация,
		|	ВТ_ТУ.Район КАК Район,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	МАКСИМУМ(ВТ_ТУ.ТипТарифа) КАК ТипТарифа,
		|	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТУ.МКД КАК МКД
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТУ.Период,
		|	ВТ_ТУ.Организация,
		|	ВТ_ТУ.Район,
		|	ВТ_ТУ.ОбъектРасчета,
		|	ВТ_ТУ.ПериодРегистрации,
		|	ВТ_ТУ.ПериодНачисления,
		|	ВТ_ТУ.МКД";
		
		
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Область Отключение_Услуги

Процедура ОперацииПриОтключенииУслуги(ДанныеШапки)
	
	Пакет = ПолучитьДанныеТЧДляЗакрытия(Истина);
	ДанныеТочекУчета				= Пакет[0];
	ДанныеПриборовТУ				= Пакет[1];
	ДанныеПоказанийПриборовУчета	= Пакет[2];
 
	// Работа с точками учета
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТочекУчета,	Движения.бестАктивностьТочекУчетаНП);
	
	// Работа с узлами учета
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,	Движения.бестСостояниеПриборовУчетаНП);	

	// Работа с приборами учета
	//бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,	Движения.бестПриборыУзловУчетаНП);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,	Движения.бестВыводПриборовУчетаНП);
	
	// показания приборов учета 
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);

КонецПроцедуры

Функция ПолучитьДанныеТЧДляЗакрытия(НеУчитыватьФлаг = Истина)
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	Запрос.УстановитьПараметр("ПериодДо",			Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);  	
	Запрос.УстановитьПараметр("НеУчитыватьФлаг",	НеУчитыватьФлаг);
	Текст 		= 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&ОбъектРасчета КАК ОбъектРасчета,
		|	&ОбъектРасчета КАК АбонентВладелец,
		|	&МКД КАК МКД,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена) КАК Состояние,
		|	ТаблицаТочкиУчета.Ссылка КАК Ссылка,
		|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
		|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	ТаблицаТочкиУчета.Услуга КАК Услуга,
		|	ТаблицаТочкиУчета.УзелУчета КАК УзелУчета,
		|	ТаблицаТочкиУчета.УзелУчета.ТипУзлаУчета КАК ТипУзлаУчета,
		|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
		|	ТаблицаТочкиУчета.ПриборУчета.ТипПрибораУчета КАК ТипПрибораУчета
		|ПОМЕСТИТЬ ВТ_ТУ
		|ИЗ
		|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК ТаблицаТочкиУчета
		|ГДЕ
		|	ТаблицаТочкиУчета.Ссылка = &ссылка
		|	И (ТаблицаТочкиУчета.Флаг
		|			ИЛИ &НеУчитыватьФлаг)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&Район КАК Район,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
		|	ВТ_ТУ.Ссылка КАК Ссылка,
		|	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ТУ.АбонентВладелец КАК АбонентВладелец,
		|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ВТ_ТУ.Услуга КАК Услуга,
		|	ВТ_ТУ.ПриборУчета КАК ПриборУчета,
		|	ВТ_ТУ.IDСтроки КАК IDСтроки,
		|	ВТ_ТУ.IDСтроки КАК IDСтрокиШкалы,
		|	ВТ_ТУ.УзелУчета КАК УзелУчета,
		|	ВТ_ТУ.МКД КАК МКД,
		|	ВТ_ТУ.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
		|	ВТ_ТУ.ТипУзлаУчета КАК ТипУзлаУчета
		|ПОМЕСТИТЬ ВТ_ПУ
		|ИЗ
		|	ВТ_ТУ КАК ВТ_ТУ
		|ГДЕ
		|	НЕ ВТ_ТУ.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПУ.Период КАК Период,
		|	ВТ_ПУ.Организация КАК Организация,
		|	ВТ_ПУ.Район КАК Район,
		|	ВТ_ПУ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_ПУ.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ПУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ПУ.ПриборУчета КАК ПриборУчета,
		|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
		|	ТаблицаПоказанийПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
		|	ТаблицаПоказанийПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
		|	ЛОЖЬ КАК КС,
		|	ТаблицаПоказанийПриборовУчета.Переворот КАК Переворот,
		|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
		|	ВТ_ПУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ШкалыПриборовУчета.Шкала КАК Шкала
		|ПОМЕСТИТЬ ВТ_ПоказанияПУ
		|ИЗ
		|	ВТ_ПУ КАК ВТ_ПУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ШкалыПриборовУчета КАК ШкалыПриборовУчета
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
		|			ПО ШкалыПриборовУчета.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
		|				И ШкалыПриборовУчета.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
		|				И (ТаблицаПоказанийПриборовУчета.Ссылка = &ссылка)
		|		ПО ВТ_ПУ.Ссылка = ШкалыПриборовУчета.Ссылка
		|			И ВТ_ПУ.IDСтрокиШкалы = ШкалыПриборовУчета.IDСтрокиТочкиУчета
		|			И (ШкалыПриборовУчета.Ссылка = &ссылка)";
	
		
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Область Ограничение_Услуги

Процедура ОперацииПриОграниченииУслуги(ДанныеШапки)
	
	Пакет = ПолучитьДанныеТЧДляЗакрытия(Ложь);
	ДанныеПоказанийПриборовУчета	= Пакет[2];
	
	
	// показания приборов учета 
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);
	
КонецПроцедуры

#КонецОбласти

#Область Возобновление_Услуги

Процедура ОперацииПриВозобновленииУслуги(ДанныеШапки)
	
	Пакет = ПолучитьДанныеТЧДляЗакрытия(Истина);
	ДанныеПоказанийПриборовУчета	= Пакет[2];
	
	
	// показания приборов учета 
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета,	Движения.бестПоказанияПриборовУчетаНП);
	
		
КонецПроцедуры

#КонецОбласти

Процедура МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ОбъектРасчета",		ОбъектРасчета);
	Запрос.УстановитьПараметр("МКД",				ОбъектРасчета.МКД);
	Запрос.УстановитьПараметр("ВыводПрибораУчета",	?(ВидОперации = Перечисления.бестВидыОпераций.ОперацияСУслугами_ОтключениеУслуги,Истина,ложь));
	//Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСУслугами_ПодключениеУслуги Тогда
	//	
	//	Запрос.Текст  	=		
	//	"ВЫБРАТЬ
	//	|	&ОбъектРасчета КАК ОбъектРасчета,
	//	|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	//	|	ТаблицаТочкиУчета.IDСтроки КАК IDСтроки,
	//	|	ТаблицаТочкиУчета.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ ВТ_ТУ
	//	|ИЗ
	//	|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК ТаблицаТочкиУчета
	//	|ГДЕ
	//	|	ТаблицаТочкиУчета.Ссылка = &ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ТУ.Ссылка КАК Ссылка,
	//	|	ВТ_ТУ.ОбъектРасчета КАК ОбъектРасчета,
	//	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	//	|	ВТ_ТУ.IDСтроки КАК IDСтроки,
	//	|	ТаблицаПриборыУзловУчета.IDСтрокиШкалы КАК IDСтрокиШкалы
	//	|ПОМЕСТИТЬ ВТ_ПУ
	//	|ИЗ
	//	|	ВТ_ТУ КАК ВТ_ТУ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ПриборыУзловУчета КАК ТаблицаПриборыУзловУчета
	//	|		ПО ВТ_ТУ.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	//	|			И ВТ_ТУ.IDСтроки = ТаблицаПриборыУзловУчета.IDСтроки
	//	|			И (ТаблицаПриборыУзловУчета.Ссылка = &Ссылка)
	//	|			И (ТаблицаПриборыУзловУчета.ПриборУчета <> ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ТаблицаПриборыУзловУчета.ОбъектРасчета КАК ОбъектРасчета,
	//	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	//	|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
	//	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	//	|	0 КАК Разделитель,
	//	|	&МКД КАК МКД
	//	|ИЗ
	//	|	ВТ_ПУ КАК ТаблицаПриборыУзловУчета";
	//	
	//иначе
		
		Запрос.Текст  	= 
		"ВЫБРАТЬ
		|	ТаблицаПУ.ПриборУчета КАК ПриборУчета,
		|	&ОбъектРасчета КАК ОбъектРасчета,
		|	&ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
		|	0 КАК Разделитель,
		|	&МКД КАК МКД
		|ИЗ
		|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК ТаблицаПУ
		|ГДЕ
		|	ТаблицаПУ.Ссылка = &ссылка
		|	И НЕ ТаблицаПУ.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
		
	//КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецПроцедуры

Функция МассивОбъектовРасчета() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	бестОперацияСУслугамиНПТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	""ТочкиУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	бестОперацияСУслугамиНПТочкиУчета.ОбъектРасчета КАК ОбъектРасчета
	|ИЗ
	|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК бестОперацияСУслугамиНПТочкиУчета";
	
	ДополнительныеСвойства.Вставить("МассивОбъектовРасчета",Запрос.Выполнить());

	
КонецФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("ТочкиУчета",				ТочкиУчета);
	ДанныеШапки.Вставить("Отключение",				?(ВидОперации=Перечисления.бестВидыОпераций.ОперацияСУслугами_ОтключениеУслуги,истина,ложь));
	ДанныеШапки.Вставить("ИмяДокумента",			"бестОперацияСУслугамиНП");
	ДанныеШапки.Вставить("Документ",				Ссылка);
	ДанныеШапки.Вставить("ОбъектРасчета",			ОбъектРасчета);
	//ДанныеШапки.Вставить("Контрагент",				Договор.Контрагент);
 	ДанныеШапки.Вставить("Дата",					Дата);
	
	Возврат ДанныеШапки;	
КонецФункции

Функция ФормулыРасчетаУслуг();
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ФормулыРасчетаУслуг.Услуга КАК Услуга,
	|	ФормулыРасчетаУслуг.ФормулаРасчета КАК ФормулаРасчета
	|ИЗ
	|	Документ.бестОперацияСУслугамиНП.ТочкиУчета КАК ТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестОперацияСУслугамиНП.ФормулыРасчетаУслуг КАК ФормулыРасчетаУслуг
	|		ПО ТочкиУчета.Ссылка = ФормулыРасчетаУслуг.Ссылка
	|			И ТочкиУчета.IDСтроки = ФормулыРасчетаУслуг.IDСтрокиТочкиУчета
	|			И (ТочкиУчета.Ссылка = &Ссылка)
	|			И (ФормулыРасчетаУслуг.Ссылка = &Ссылка)";
	
	Возврат Запрос.Выполнить();	
	
КонецФункции

Функция СоставУзлаКорректен()
	
	Данные = Новый Структура;
	Данные.Вставить("Период",					Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Данные.Вставить("Район",					Район);
	Данные.Вставить("Организация",			    Организация);		
	Данные.Вставить("ОбъектРасчета",			ОбъектРасчета); 
	Данные.Вставить("Ссылка",					Ссылка);
	
	Возврат энргРаботаСприборамиУчетаСервер.СоставУзлаКорректенНП(Данные);
	 	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли