#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
	
#КонецОбласти


#Область СобытияРеквизитов

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	УстановитьДоступностьПриИзмененииСтроения();
	ОчиститьПоляПриУстановкеСтроения();
КонецПроцедуры


&НаКлиенте
Процедура ТекущийОтветственныйПриИзменении(Элемент)
	ПустойПользователь 	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ОчиститьЗначение 	= ПроверитьИзменениеОтветственного(ПустойПользователь);
	Если ОчиститьЗначение Тогда 
		ТекущийОтветственный = ПустойПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПИРПриИзменении(Элемент)
	ПустойПользователь 	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ОчиститьЗначение = ПроверитьИзменениеОтветственного(ПустойПользователь);
	Если ОчиститьЗначение Тогда 
		Объект.ОтветственныйПИР = ПустойПользователь;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьИзменениеОтветственного(ПустойПользователь)	
	Если НЕ Объект.ОтветственныйПИР = ТекущийОтветственный ИЛИ 
		(Объект.ОтветственныйПИР = ПустойПользователь И ТекущийОтветственный = ПустойПользователь) Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции


&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	УлицаНомерДомаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура НомерДомаПриИзменении(Элемент)
	УлицаНомерДомаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура УлицаНомерДомаПриИзменении()
	УстановитьДоступностьПриИзмененииУлицы();
	ОчиститьПоляПриУстановкеУлицы();
КонецПроцедуры

#КонецОбласти

#Область РаботаСТаблицейАбонентов

&НаКлиенте
Процедура Заполнить(Команда)		
	Если Объект.СписокСтроений.Количество() = 0 Тогда
		ЗаполнитьНаСервере(Ложь);
		Возврат;
	КонецЕсли;
	
	Режим 		= РежимДиалогаВопрос.ДаНетОтмена;
	Оповещение 	= Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Очистить список?", Режим);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьНаСервере(Истина);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 		
		ЗаполнитьНаСервере(Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ОчищатьТаблицу)
	Если ОчищатьТаблицу Тогда
		Объект.СписокСтроений.Очистить();
	КонецЕсли;
	Отборы 				= ИнициализироватьОтборы();
	ТаблицаЗаполнения 	= Объект.СписокСтроений;
	Документы.бестНазначениеОтветственногоПИР.ЗаполнитьТаблицуДанными(ТаблицаЗаполнения, Отборы);
КонецПроцедуры

#КонецОбласти


#Область РаботаСоСвойствамиЭлементов

&НаКлиенте
Процедура УстановитьДоступностьПриИзмененииСтроения()
	ЗначениеСвойства = НЕ ЗначениеЗаполнено(Строение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Улица"		, "Доступность", ЗначениеСвойства);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерДома"	, "Доступность", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляПриУстановкеСтроения()
	Улица 		= "";
	НомерДома 	= 0;
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьПриИзмененииУлицы()
	ЗначениеСвойства = НЕ (ЗначениеЗаполнено(Улица) ИЛИ ЗначениеЗаполнено(НомерДома));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Строение", "Доступность", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляПриУстановкеУлицы()
	Строение = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
КонецПроцедуры

#КонецОбласти

#Область РаботаСОтборами

&НаСервере
Функция ИнициализироватьОтборы()
	Результат 							= Документы.бестНазначениеОтветственногоПИР.ПолучитьСтруктуруОтборов();
	Результат.Период					= Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	Результат.Организация 				= Объект.Организация;	
	Результат.Район 					= Объект.Район;
	Результат.ОтветственныйКУстановке 	= Объект.ОтветственныйПИР;	
	
	ИнициализироватьНеобязательныеОтборы(Результат);		
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ИнициализироватьНеобязательныеОтборы(Результат)
	НеобязательныеОтборы = Новый Структура;
	
	Если ЗначениеЗаполнено(Строение) Тогда
		НеобязательныеОтборы.Вставить("Строение", Строение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОтветственный) Тогда
		НеобязательныеОтборы.Вставить("ТекущийОтветственный", ТекущийОтветственный);
	КонецЕсли;
	Если ЗначениеЗаполнено(Улица) Тогда
		НеобязательныеОтборы.Вставить("Улица", Улица);
	КонецЕсли;
	Если НомерДома > 0 Тогда
		НеобязательныеОтборы.Вставить("НомерДома", НомерДома);
	КонецЕсли;
	Если НомерКвДо > 0 Тогда
		НеобязательныеОтборы.Вставить("НомерКвДо", НомерКвДо);
	КонецЕсли;
	Если НомерКвОт > 0 Тогда
		НеобязательныеОтборы.Вставить("НомерКвОт", НомерКвОт);
	КонецЕсли;	
	
	Если НЕ НеобязательныеОтборы.Количество() = 0 Тогда 
		Результат.НеобязательныеОтборы = НеобязательныеОтборы;	
	КонецЕсли;
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

