#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет стабильные периоды МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СтабильныеПериодыМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтабильныеПериодыМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, Услуга, ТочкаУчета, НомерПозиции, ПериодРегистрации, ДатаРегистратора, ДокРегистратор";
		ИмяТаблицы 					= "СтабильныеПериоды";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Заполняет значение площадей МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеПлощадейМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначениеПлощадейМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, Услуга";
		ИмяТаблицы 					= "СтабильныеПериодыМКД";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет стабильные периоды шкалы.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СтабильныеПериодыШкалы(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтабильныеПериодыШкалы());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, ТочкаУчета, НомерПозиции";
		ИмяТаблицы 					= "СтабильныеПериодыШкалы";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет значение площадей МКД коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗначениеПлощадейМКДКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаЗначениеПлощадейМКДКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, Услуга";
		ИмяТаблицы 					= "СтабильныеПериодыМКД";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса стабильные периоды МКД.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСтабильныеПериодыМКД() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	СтабильныеПериоды.*,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслугЗависимыеУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	|		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|	КОНЕЦ КАК ЗависитОтУслуги,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания,0) КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(энргВидыУслуг.ВидПлощадиМКД, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощадиУслуги,
	|	ЕСТЬNULL(энргВидыУслуг.НеПрименятьЗависимостьЕслиБольшеОднойТочки, ЛОЖЬ) КАК НеПрименятьЗависимостьЕслиБольшеОднойТочки
	|	,ЕСТЬNULL(энргВидыУслуг.ИспользоватьКоэффициентСдерживанияРостаПлаты,ЛОЖЬ) КАК ИспользоватьКоэффициентСдерживанияРостаПлаты
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО СтабильныеПериоды.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.ЗависимыеУслуги КАК энргВидыУслугЗависимыеУслуги
	|		ПО СтабильныеПериоды.СоставнаяУслуга = энргВидыУслугЗависимыеУслуги.Ссылка
	|			И СтабильныеПериоды.Услуга = энргВидыУслугЗависимыеУслуги.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО СтабильныеПериоды.ПриборУчета = энргПриборыУчетаАбонента.Ссылка";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначениеПлощадейМКД()
	Текст  = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыМКД.Организация КАК Организация,
	|	СтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыМКД.Район КАК Район,
	|	СтабильныеПериодыМКД.МКД КАК МКД,
	|	СтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(СтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыМКД.Организация КАК Организация,
	|		СтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыМКД.Район КАК Район,
	|		СтабильныеПериодыМКД.МКД КАК МКД,
	|		СтабильныеПериодыМКД.Услуга КАК Услуга,
	|		СтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(СтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериодыМКД
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериодыМКД.Организация,
	|		СтабильныеПериодыМКД.ПериодНачисления,
	|		СтабильныеПериодыМКД.Район,
	|		СтабильныеПериодыМКД.МКД,
	|		СтабильныеПериодыМКД.Услуга,
	|		СтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = СтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = СтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = СтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = СтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = СтабильныеПериодыМКД.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыМКД.Организация,
	|	СтабильныеПериодыМКД.ПериодНачисления,
	|	СтабильныеПериодыМКД.Район,
	|	СтабильныеПериодыМКД.МКД,
	|	СтабильныеПериодыМКД.Услуга";
	
	Возврат Текст;
КонецФункции

Функция ТексЗапросаЗначениеПлощадейМКДКоллекцияПериодов()
	
	Текст = 
	"ВЫБРАТЬ
	|	СтабильныеПериодыМКД.Организация КАК Организация,
	|	СтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыМКД.Район КАК Район,
	|	СтабильныеПериодыМКД.МКД КАК МКД,
	|	СтабильныеПериодыМКД.Услуга КАК Услуга,
	|	МАКСИМУМ(СтабильныеПериодыМКД.ЗначениеПлощади) КАК ПлощадьМОП
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыМКД.Организация КАК Организация,
	|		СтабильныеПериодыМКД.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыМКД.Район КАК Район,
	|		СтабильныеПериодыМКД.МКД КАК МКД,
	|		СтабильныеПериодыМКД.Услуга КАК Услуга,
	|		СтабильныеПериодыМКД.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(СтабильныеПериодыМКД.НомерПозиции) КАК НомерПозиции
	|	ИЗ
	|		РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериодыМКД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО СтабильныеПериодыМКД.Организация = ТаблицаПериодов.Организация
	|				И СтабильныеПериодыМКД.Район = ТаблицаПериодов.Район
	|				И СтабильныеПериодыМКД.ПериодНачисления = ТаблицаПериодов.ПериодНачисления
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтабильныеПериодыМКД.Организация,
	|		СтабильныеПериодыМКД.ПериодНачисления,
	|		СтабильныеПериодыМКД.Район,
	|		СтабильныеПериодыМКД.МКД,
	|		СтабильныеПериодыМКД.Услуга,
	|		СтабильныеПериодыМКД.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериодыМКД
	|		ПО ВложенныйЗапрос.Организация = СтабильныеПериодыМКД.Организация
	|			И ВложенныйЗапрос.ПериодНачисления = СтабильныеПериодыМКД.ПериодНачисления
	|			И ВложенныйЗапрос.Район = СтабильныеПериодыМКД.Район
	|			И ВложенныйЗапрос.МКД = СтабильныеПериодыМКД.МКД
	|			И ВложенныйЗапрос.Услуга = СтабильныеПериодыМКД.Услуга
	|			И ВложенныйЗапрос.ТочкаУчета = СтабильныеПериодыМКД.ТочкаУчета
	|			И ВложенныйЗапрос.НомерПозиции = СтабильныеПериодыМКД.НомерПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериодыМКД.Организация,
	|	СтабильныеПериодыМКД.ПериодНачисления,
	|	СтабильныеПериодыМКД.Район,
	|	СтабильныеПериодыМКД.МКД,
	|	СтабильныеПериодыМКД.Услуга";
	
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаСтабильныеПериодыШкалы()

	Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыМКДШкалы КАК СтабильныеПериодыШкалы";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли