
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание") тогда		
		Абонент 			= Параметры.Основание.Абонент;
		Период 				= Параметры.Основание.Дата;
		ПериодНачисления	= Параметры.Основание.ПериодНачисления;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Абонент) и ЗначениеЗаполнено(Период) тогда 		
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета,"ФОРМИРОВАНИЕОТЧЕТА");
		Если не ОбновитьОтчетСервер() тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",2,Истина);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Период, Организация);
КонецПроцедуры

#КонецОбласти


#Область КомандыФормы

&НаКлиенте
Процедура ОбновитьОтчет(Команда)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета,"ФОРМИРОВАНИЕОТЧЕТА");

	Если не ОбновитьОтчетСервер() тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",2,Истина);
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()  
	
	ПараметрыОбработчикаОжидания = Новый Структура("ТекущийИнтервал,КоэффициентУвеличенияИнтервала,МаксимальныйИнтервал",2,1,10);
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			РезультатОтчета = ПолучитьИзВременногоХранилища(АдресХранилища);
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета,"НЕИСПОЛЬЗОВАТЬ");   
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Функция ОбновитьОтчетСервер()
		
	ПараметрыКарточки  					= Новый Структура("Период,ПериодНачисления,Абонент",Период,ПериодНачисления,Абонент);
	АдресХранилища 						= ПоместитьВоВременноеХранилище(Неопределено,ЭтаФорма.УникальныйИдентификатор);
	
	МассивПараметров  					= Новый Массив();
	МассивПараметров.Добавить(ПараметрыКарточки); 		
	МассивПараметров.Добавить(АдресХранилища);
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	Иначе
		ИдентификаторЗадания = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	
	ИмяМетода  							= "";
		
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяМетода);
	ПараметрыЗадания.Добавить(ПараметрыКарточки);
	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторЗадания);
	//ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Сопоставление объектов'");

	
	ПараметрыЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗапуска.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выполнение отчета: %1'"), "Предполагаемые начисления абонента");
	ПараметрыЗапуска.ОжидатьЗавершение = Ложь;
	ПараметрыЗапуска.ЗапуститьНеВФоне = Ложь;
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне("Отчеты.энргПредполагаемыеНачисленияАбонента.СформироватьОтчет", 
					ПараметрыКарточки, ПараметрыЗапуска);

	
	
	
	
	
	//Задание 							= ДлительныеОперации.ЗапуститьФоновоеЗаданиеСКонтекстомКлиента(ИмяМетода,МассивПараметров);

	//ИдентификаторЗадания 				= РезультатФоновогоЗадания.ИдентификаторЗадания;		
	//	
	//Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
	//	РезультатОтчета = ПолучитьИзВременногоХранилища(АдресХранилища);
	//	Возврат Истина;
	//иначе
	//	Возврат Ложь;
	//КонецЕсли;   
	//
	
	Если РезультатФоновогоЗадания.Статус = "Ошибка" Тогда
		//ПоказатьОшибкиФормирования(РезультатФоновогоЗадания.КраткоеПредставлениеОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторЗадания  = РезультатФоновогоЗадания.ИдентификаторЗадания;
	АдресХранилища = РезультатФоновогоЗадания.АдресРезультата;
	
	Если РезультатФоновогоЗадания.Статус = "Выполнено" Тогда
		РезультатОтчета = ПолучитьИзВременногоХранилища(АдресХранилища);
		Возврат Истина;
	Иначе
		//ОтображениеСостояния = Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния;
		//ОтображениеСостояния.Видимость                      = Истина;
		//ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		//ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
		//ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
		
		Возврат Ложь;
	КонецЕсли;
	
	//Возврат ЗаданиеЗапущено;

КонецФункции 

&НаСервере
Процедура БезФоновогоЗаданияНаСервере()
	ПараметрыКарточки  					= Новый Структура("Период,ПериодНачисления,Абонент",Период,ПериодНачисления,Абонент);
	АдресХранилища 						= ПоместитьВоВременноеХранилище(Неопределено,ЭтаФорма.УникальныйИдентификатор);
	
	МассивПараметров  					= Новый Массив();
	МассивПараметров.Добавить(ПараметрыКарточки); 		
	МассивПараметров.Добавить(АдресХранилища);
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	Иначе
		ИдентификаторЗадания = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	
	ИмяМетода  							= "";
		
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяМетода);
	ПараметрыЗадания.Добавить(ПараметрыКарточки);
	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторЗадания);
	//ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Сопоставление объектов'");

	
	ПараметрыЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗапуска.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выполнение отчета: %1'"), "Предполагаемые начисления абонента");
	ПараметрыЗапуска.ОжидатьЗавершение = Ложь;
	ПараметрыЗапуска.ЗапуститьНеВФоне = Ложь;
	
	Отчеты.энргПредполагаемыеНачисленияАбонента.СформироватьОтчет(ПараметрыКарточки, АдресХранилища);
//	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне("Отчеты.энргПредполагаемыеНачисленияАбонента.СформироватьОтчет", 
//					ПараметрыКарточки, ПараметрыЗапуска);

					
КонецПроцедуры

&НаКлиенте
Процедура БезФоновогоЗадания(Команда)
	БезФоновогоЗаданияНаСервере();
КонецПроцедуры

#КонецОбласти




