#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("СписокЗадач", СписокЗадач);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура СписокЗадачПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, СписокЗадач.Получить(ВыбраннаяСтрока).Значение);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКоманд
&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	Если ПометитьНаУдалениеНаСервере() Тогда 
		Оповестить("ВернутьВРаботу");
		Закрыть();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ДопорлнительныеМетоды
&НаСервере
Функция ПометитьНаУдалениеНаСервере()
	НачатьТранзакцию();
	Попытка
	
		Для каждого ТекЗадача Из СписокЗадач Цикл
		
			ОбъектЗадача = ТекЗадача.Значение.ПолучитьОбъект();
			ОбъектЗадача.УстановитьПометкуУдаления(Истина);
		
		КонецЦикла;
	
	Исключение
	  	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось пометить на удаление задачу: " + ТекЗадача.Значение 
					+ " по причине: " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
КонецФункции
#КонецОбласти
