#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("ДатаНачала", 	ДатаНач);                
	ПараметрыОтчета.Вставить("ДатаКонца", 	ДатаКон);
	

	СформироватьНаСервере(РезультатОтчета, ПараметрыОтчета);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере(ТабДок, ПараметрыОтчета)
	ПараметрыОтчета.Вставить("ТН", 		Справочники.энргВидыУслуг.НайтиПоКоду("000000053"));
	ПараметрыОтчета.Вставить("ТЭ", 		Справочники.энргВидыУслуг.НайтиПоКоду("000000051"));
	ПараметрыОтчета.Вставить("Тепло", 		Справочники.энргВидыУслуг.НайтиПоКоду("000000046"));
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	ТекОбъект.СформироватьОтчет(ТабДок, ПараметрыОтчета);
КонецПроцедуры

#КонецОбласти