#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда              

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 		= Пользователи.ТекущийПользователь();	
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	
	//ДанныеШапки = ДанныеШапки();
	//энргРаботаСТочкамиУчетаСервер.УстановитьСпособРаспределенияОбъемаМКД(ДанныеШапки,Движения,"ТочкиУчета");
	
	ДанныедляПроведенияДокумента= РезультатДокумента();
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныедляПроведенияДокумента,	Движения.энргСпособРаспределенияОбъемаМКДНаАбонентов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатДокумента()
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовТочкиУчета.ТочкаУчета КАК ТочкаУчета,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовТочкиУчета.Услуга КАК Услуга,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовТочкиУчета.РаспределятьНаАбонентов КАК РаспределятьНаАбонентов,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.Дата КАК ПериодРегистрации,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.ПериодНачисления КАК ПериодНачисления,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.Район КАК Район,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.Организация КАК Организация,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.МКД КАК МКД,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.Ссылка КАК Ссылка,
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовТочкиУчета.IDСтроки КАК IDСтроки,
		|	ВЫБОР
		|		КОГДА НЕ энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.ДатаФактическогоСобытия
		|		ИНАЧЕ энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.Дата
		|	КОНЕЦ КАК Период
		|ПОМЕСТИТЬ ВТ_ПростыеУслуги
		|ИЗ
		|	Документ.энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.ТочкиУчета КАК энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовТочкиУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов КАК энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов
		|		ПО энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовТочкиУчета.Ссылка = энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.Ссылка
		|ГДЕ
		|	энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПростыеУслуги.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_ПростыеУслуги.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ПростыеУслуги.Район КАК Район,
		|	ВТ_ПростыеУслуги.Организация КАК Организация,
		|	ВТ_ПростыеУслуги.МКД КАК МКД,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_ПростыеУслуги.ЭтоСоставнаяУслуга
		|				ТОГДА энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовПоставщикиСоставныхУслуг.РаспределятьНаАбонентов
		|			ИНАЧЕ ВТ_ПростыеУслуги.РаспределятьНаАбонентов
		|		КОНЕЦ) КАК Распределять,
		|	ВТ_ПростыеУслуги.Период КАК Период,
		|	ВТ_ПростыеУслуги.ПериодРегистрации КАК ПериодРегистрации
		|ИЗ
		|	ВТ_ПростыеУслуги КАК ВТ_ПростыеУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов.ПоставщикиСоставныхУслуг КАК энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовПоставщикиСоставныхУслуг
		|		ПО ВТ_ПростыеУслуги.Ссылка = энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовПоставщикиСоставныхУслуг.Ссылка
		|			И ВТ_ПростыеУслуги.IDСтроки = энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентовПоставщикиСоставныхУслуг.IDСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПростыеУслуги.ТочкаУчета,
		|	ВТ_ПростыеУслуги.ПериодНачисления,
		|	ВТ_ПростыеУслуги.Район,
		|	ВТ_ПростыеУслуги.Организация,
		|	ВТ_ПростыеУслуги.МКД,
		|	ВТ_ПростыеУслуги.Период,
		|	ВТ_ПростыеУслуги.ПериодРегистрации";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли