#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Пакет = ПолучитьДанныеДляПроведения();
	
	ДанныеЗначенияНерегулируемойЦены			= Пакет[1];
	ДанныеПочасовыеЗначенияНерегулируемойЦены	= Пакет[2];
	ДанныеЗначенияНерегулируемойЦеныНаМощность	= Пакет[3];

	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеЗначенияНерегулируемойЦены,				Движения.бестЗначенияНерегулируемойЦены);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПочасовыеЗначенияНерегулируемойЦены,		Движения.бестПочасовыеЗначенияНерегулируемойЦены);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеЗначенияНерегулируемойЦеныНаМощность,		Движения.бестЗначенияНерегулируемойЦеныНаМощность);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Ссылка КАК Ссылка,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Организация КАК Организация,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Район КАК Район
	      		  |ПОМЕСТИТЬ Шапка
	      		  |ИЗ
	      		  |	Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены
	      		  |ГДЕ
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Ссылка = &Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	Шапка.Организация КАК Организация,
	      		  |	Шапка.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Поставщик КАК Поставщик,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Услуга КАК Услуга,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.ТарифнаяЗона КАК ТарифнаяЗона,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Значение КАК Значение,
	      		  |	Шапка.Район КАК Район
	      		  |ИЗ
	      		  |	Шапка КАК Шапка
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ЗначенияНерегулируемойЦены КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены
	      		  |		ПО Шапка.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	Шапка.Организация КАК Организация,
	      		  |	Шапка.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.ТипЦены КАК ТипЦены,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Поставщик КАК Поставщик,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Услуга КАК Услуга,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.День КАК День,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.Час КАК Час,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.Значение КАК Значение,
	      		  |	Шапка.Район КАК Район
	      		  |ИЗ
	      		  |	Шапка КАК Шапка
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.РазрезыПочасовыхЗначений КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений
	      		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ПочасовыеЗначения КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения
	      		  |			ПО (бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Ссылка)
	      		  |				И (бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.IDСтроки = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.IDСтроки)
	      		  |		ПО Шапка.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	Шапка.Организация КАК Организация,
	      		  |	Шапка.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Поставщик КАК Поставщик,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Услуга КАК Услуга,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Значение КАК Значение,
	      		  |	Шапка.Район КАК Район
	      		  |ИЗ
	      		  |	Шапка КАК Шапка
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ЦеныНаМощность КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность
	      		  |		ПО Шапка.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли