#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Закрытие(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСообщенияОбработкиОповещения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекПользователь", Пользователи.ТекущийПользователь());
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бестОповещенияПользователей.Пользователь КАК Пользователь,
	               |	бестОповещенияПользователей.Сообщение.Текст КАК Текст,
	               |	бестОповещенияПользователей.Инициатор КАК Инициатор,
	               |	бестОповещенияПользователей.Сообщение КАК Сообщение
	               |ИЗ
	               |	РегистрСведений.бестОповещенияПользователей КАК бестОповещенияПользователей
	               |ГДЕ
	               |	бестОповещенияПользователей.Пользователь = &ТекПользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестОповещенияПользователей.Сообщение.Текст,
	               |	бестОповещенияПользователей.Инициатор,
	               |	бестОповещенияПользователей.Пользователь,
	               |	бестОповещенияПользователей.Сообщение";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура("Пользователь,Текст,Инициатор",Выборка.Пользователь,Выборка.Текст,Выборка.Инициатор);	
		МассивДанных.Добавить(Структура);
		
		НаборЗаписей = РегистрыСведений.бестОповещенияПользователей.СоздатьНаборЗаписей();		
		НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь);
		НаборЗаписей.Отбор.Сообщение.Установить(Выборка.Сообщение);
		
		НаборЗаписей.Записать();		
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции

#КонецОбласти
