#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);		
	КонецЕсли;
			
	Если Параметры.Ключ.Пустая() и Параметры.ЗначенияЗаполнения.Свойство("Помещения") тогда
		Помещения 								= Параметры.ЗначенияЗаполнения.Помещения;
		Для Сч = 0 По Помещения.ВГраница() Цикл
			ДанныеПомещения 					= Помещения[Сч];
			СтрокиПомещения						= Объект.Помещения.НайтиСтроки(Новый Структура("КлючПомещения", ДанныеПомещения.КлючПомещения));
			Если СтрокиПомещения.Количество() = 0 Тогда
				СтрокаПомещения  				= Объект.Помещения.Добавить();
				СтрокаПомещения.КлючПомещения  	= ДанныеПомещения.КлючПомещения;
				СтрокаПомещения.Абонент  		= ДанныеПомещения.Абонент;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПраваДокументаПерерасчет(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.Строение,Объект.КлючПомещения.Помещение,Объект.Абонент);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТЗОплат = ТекущийОбъект.КорректировкаОплаты.Выгрузить(,"ДокументОплаты,Разделитель");
	ТЗОплат.Свернуть("ДокументОплаты,Разделитель");
	Если ТЗОплат.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе корректировка оплаты можно корректировать только один документ!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
	ЗаполнитьПериодНачисленияСервер();
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПодборОплаты(Команда)
	
	мАбоненты  				= Новый Массив;
	Для Каждого СтрокаАбонента Из Объект.Помещения Цикл
		мАбоненты.Добавить(СтрокаАбонента.Абонент);
	КонецЦикла;
	
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ПодборОплатыАбонентаЗавершение",ЭтаФорма);
	ПараметрыОплаты  		= Новый Структура;
	ПараметрыОплаты.Вставить("Абонент", мАбоненты[0]);
	ПараметрыОплаты.Вставить("Ссылка", Объект.Ссылка);
	ОткрытьФорму("Обработка.энргЖурналОплатыАбонента.Форма.Форма",ПараметрыОплаты,,,,,ОповещениеЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкиОповещения

&НаКлиенте
Процедура ПодборОплатыАбонентаЗавершение(Результат,ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Сч = 0 По Результат.ВГраница() Цикл
			СтрокаКорректироки 						= Объект.КорректировкаОплаты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКорректироки,Результат[Сч]);
			СтрокаКорректироки.СуммаБыло  			= Результат[Сч].СуммаОплаты;
			СтрокаКорректироки.УслугаБыло  			= Результат[Сч].Услуга;
			СтрокаКорректироки.ПоставщикБыло  		= Результат[Сч].Поставщик;
			СтрокаКорректироки.ПериодНачисленияБыло = Результат[Сч].ПериодОплаты;
			СтрокаКорректироки.АбонентБыло			= Результат[Сч].Абонент;
			СтрокаКорректироки.Разделитель			= Результат[Сч].Разделитель;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Объект.ИсточникПоступления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан Источник поступления!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ВспомогательныеПроцедурыИФункции

&НаСервере 
Процедура ПроверитьПраваДокументаПерерасчет(Отказ) 
	
	ЕстьПравоЧтение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Чтение"); 
	ЕстьПравоИзменение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Изменение");
	Если Не ЕстьПравоИзменение И (Не ЕстьПравоЧтение Или ЕстьПравоЧтение И Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		Отказ = Истина;
		ВызватьИсключение "Нарушение прав доступа";
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр = ЕстьПравоЧтение И Не ЕстьПравоИзменение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОсновании", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);	
	
КонецПроцедуры



#КонецОбласти

#КонецОбласти
