#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Сформировать печатную форму этапа
//
// Параметры:
//  МассивОбъектов		 - Массив 				- Массив объектов. 
//  ИмяМакета			 - Строка 				- Имя макета. 
//  ТабличныйДокумент	 - ТабличныйДокумент 	- Табличный документ.
//  ОбластиМакета		 - Структура 			- Области макета. 
//  ТекстОшибки			 - Строка 				- Текст ошибки. 
// 
// Возвращаемое значение:
//  Булево - Сформирована печатная форма или нет. 
//
Функция СформироватьПечатнуюФормуЭтапа(МассивОбъектов, ИмяМакета, ТабличныйДокумент, ОбластиМакета = Неопределено, ТекстОшибки = "") Экспорт 
	Результат = Ложь;
	
	Если ОбластиМакета = Неопределено Тогда
		ОбластиМакета = Новый Структура;
		ОбластиМакета.Вставить("БланкФилиала");
		ОбластиМакета.Вставить("Шапка");
		ОбластиМакета.Вставить("Квитанция");
	КонецЕсли;
		
	Попытка
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.энргВидыОперацийПИД." + ИмяМакета);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Для каждого КлючЗначение из ОбластиМакета Цикл
		Попытка
			ОбластиМакета[КлючЗначение.Ключ] = Макет.ПолучитьОбласть(КлючЗначение.Ключ);
		Исключение
			ОбластиМакета[КлючЗначение.Ключ] = Неопределено;
		КонецПопытки;
	КонецЦикла;
			
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(энргКонтрагенты.бестФамилия, """") КАК Фамилия,
		|	ЕСТЬNULL(энргКонтрагенты.бестИмя, """") КАК Имя,
		|	ЕСТЬNULL(энргКонтрагенты.бестОтчество, """") КАК Отчество,
		|	энргЗадачаПИД.АдресОбъекта КАК АдресОбъекта,
		|	энргЗадачаПИД.ЛицевойСчет КАК ЛицевойСчет,
		|	энргЗадачаПИД.СуммаЗадолженности КАК СуммаЗадолженности,
		|	энргЗадачаПИД.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	энргЗадачаПИД.Ссылка КАК Задача,
		|	Организации.ИНН КАК ИНН,
		|	БанковскиеСчета.НомерСчета КАК РасчСчет,
		|	БанковскиеСчета.Банк КАК Банк,
		|	Банки.Наименование КАК БанкНаименование,
		|	Банки.Код КАК БИК,
		|	Банки.КоррСчет КАК КоррСчет,
		|	Организации.Наименование КАК Организация,
		|	энргАбоненты.ВидОбъекта КАК ВидОбъекта,
		|	энргЗадачаПИД.Абонент КАК Абонент,
		|	энргАбоненты.КлючПомещения.Строение КАК МКД,
		|	ВЫБОР
		|		КОГДА энргЗадачаПИД.Район.НаименованиеПоставщика = """"
		|			ТОГДА энргЗадачаПИД.Район
		|		ИНАЧЕ энргЗадачаПИД.Район.НаименованиеПоставщика
		|	КОНЕЦ КАК Район,
		|	энргЗадачаПИД.Организация КАК ОрганизацияСсылка,
		|	энргЗадачаПИД.Дата КАК Дата,
		|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	Организации.НаименованиеСокращённое КАК ОрганизацияНаименованиеСокращённое,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения,
		|	энргЗадачаПИД.Номер КАК НомерЗадачи,
		|	энргЗадачаПИД.Район КАК РайонСсылка,
		|	ВЫБОР
		|		КОГДА энргЗадачаПИД.Этап = ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Уведомление)
		|			ТОГДА ""УФ""
		|		КОГДА энргЗадачаПИД.Этап = ЗНАЧЕНИЕ(Справочник.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Предупреждение)
		|			ТОГДА ""ПФ""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Постфикс,
		|	энргЗадачаПИД.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО энргЗадачаПИД.Абонент = энргАбоненты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО энргЗадачаПИД.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|		ПО (ВЫБОР
		|				КОГДА энргЗадачаПИД.Договор <> ЗНАЧЕНИЕ(справочник.энргДоговорыКонтрагентов.пустаяссылка)
		|					ТОГДА ДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
		|				КОГДА энргЗадачаПИД.Абонент <> ЗНАЧЕНИЕ(справочник.энргабоненты.пустаяссылка)
		|					ТОГДА энргАбоненты.ФизЛицо = энргКонтрагенты.Ссылка
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК Банки
		|				ПО БанковскиеСчета.Банк = Банки.Ссылка
		|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
		|		ПО энргЗадачаПИД.Организация = Организации.Ссылка
		|ГДЕ
		|	энргЗадачаПИД.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗоныОтвественностиФилиалы.Ссылка КАК Район,
		|	энргФилиалыИзменяемыеРеквизиты.Организация КАК Организация,
		|	МАКСИМУМ(энргФилиалыИзменяемыеРеквизиты.НомерСтроки) КАК НомерСтроки_Филиал,
		|	энргЗоныОтвественностиФилиалы.НомерСтроки КАК НомерСтроки_Район
		|ПОМЕСТИТЬ ВТ_ВсеФилиалы
		|ИЗ
		|	Справочник.энргЗоныОтвественности.Филиалы КАК энргЗоныОтвественностиФилиалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргФилиалы.ИзменяемыеРеквизиты КАК энргФилиалыИзменяемыеРеквизиты
		|		ПО энргЗоныОтвественностиФилиалы.Филиал = энргФилиалыИзменяемыеРеквизиты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ПО энргЗоныОтвественностиФилиалы.Ссылка = ВТ_ОсновныеДанные.РайонСсылка
		|			И (энргФилиалыИзменяемыеРеквизиты.Организация = ВТ_ОсновныеДанные.ОрганизацияСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗоныОтвественностиФилиалы.Ссылка,
		|	энргФилиалыИзменяемыеРеквизиты.Организация,
		|	энргЗоныОтвественностиФилиалы.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеФилиалы.Район КАК Район,
		|	ВТ_ВсеФилиалы.Организация КАК Организация,
		|	МАКСИМУМ(ВТ_ВсеФилиалы.НомерСтроки_Район) КАК НомерСтроки_Район
		|ПОМЕСТИТЬ ВТ_НомерСтрокиРайон
		|ИЗ
		|	ВТ_ВсеФилиалы КАК ВТ_ВсеФилиалы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеФилиалы.Район,
		|	ВТ_ВсеФилиалы.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеФилиалы.Район КАК Район,
		|	ВТ_ВсеФилиалы.Организация КАК Организация,
		|	энргКонтрагенты.КодПоОКПО КАК ОКПО_Филиала,
		|	энргКонтрагенты.ОГРН КАК ОГРН_Филиала,
		|	энргКонтрагенты.ИНН КАК ИНН_Филиала,
		|	энргКонтрагенты.КПП КАК КПП_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЮридическийАдрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Адрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК КонтактныйЦентр_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СайтКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресСайта_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЭлекАдрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Факс_Филиала,
		|	энргЗоныОтвественности.Префикс КАК Префикс,
		|	энргКонтрагенты.Наименование КАК НаименованиеРайона,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресАбонПунктаПоставщикаУслуг)
		|				ТОГДА энргКонтрагентыКонтактнаяИнформация.Представление
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресБлижайшегоПункта_Филиала
		|ПОМЕСТИТЬ ВТ_ДанныеФилиала
		|ИЗ
		|	ВТ_ВсеФилиалы КАК ВТ_ВсеФилиалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НомерСтрокиРайон КАК ВТ_НомерСтрокиРайон
		|		ПО ВТ_ВсеФилиалы.Организация = ВТ_НомерСтрокиРайон.Организация
		|			И ВТ_ВсеФилиалы.Район = ВТ_НомерСтрокиРайон.Район
		|			И ВТ_ВсеФилиалы.НомерСтроки_Район = ВТ_НомерСтрокиРайон.НомерСтроки_Район
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности.Филиалы КАК энргЗоныОтвественностиФилиалы
		|		ПО ВТ_ВсеФилиалы.Район = энргЗоныОтвественностиФилиалы.Ссылка
		|			И ВТ_ВсеФилиалы.НомерСтроки_Район = энргЗоныОтвественностиФилиалы.НомерСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргФилиалы.ИзменяемыеРеквизиты КАК энргФилиалыИзменяемыеРеквизиты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
		|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация.Ссылка
		|					И (энргКонтрагентыКонтактнаяИнформация.Вид В (ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СайтКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагента), ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресАбонПунктаПоставщикаУслуг)))
		|			ПО энргФилиалыИзменяемыеРеквизиты.Контрагент = энргКонтрагенты.Ссылка
		|		ПО ВТ_ВсеФилиалы.НомерСтроки_Филиал = энргФилиалыИзменяемыеРеквизиты.НомерСтроки
		|			И (энргЗоныОтвественностиФилиалы.Филиал = энргФилиалыИзменяемыеРеквизиты.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
		|		ПО ВТ_ВсеФилиалы.Район = энргЗоныОтвественности.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеФилиалы.Район,
		|	ВТ_ВсеФилиалы.Организация,
		|	энргКонтрагенты.КодПоОКПО,
		|	энргКонтрагенты.ОГРН,
		|	энргКонтрагенты.ИНН,
		|	энргКонтрагенты.КПП,
		|	энргЗоныОтвественности.Префикс,
		|	энргКонтрагенты.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД)
		|				ТОГДА энргЗначениеПлощадейМКДСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбщаяПлощадьМКД,
		|	энргЗначениеПлощадейМКДСрезПоследних.МКД КАК МКД,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПлощадьМОП)
		|				ТОГДА энргЗначениеПлощадейМКДСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПлощатьМОП
		|ПОМЕСТИТЬ ВТ_ПлощадьМКД
		|ИЗ
		|	РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
		|			&Период,
		|			(Организация, Район, МКД) В
		|					(ВЫБРАТЬ
		|						ВТ.ОрганизацияСсылка,
		|						ВТ.РайонСсылка,
		|						ВТ.МКД
		|					ИЗ
		|						ВТ_ОсновныеДанные КАК ВТ)
		|				И ВидПлощади В (ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД), ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПлощадьМОП))) КАК энргЗначениеПлощадейМКДСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗначениеПлощадейМКДСрезПоследних.МКД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияПлощадейСрезПоследних.Организация КАК Организация,
		|	энргЗначенияПлощадейСрезПоследних.Район КАК Район,
		|	энргЗначенияПлощадейСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)
		|				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПлощадьПомещения,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗначенияПлощадейСрезПоследних.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь)
		|				ТОГДА энргЗначенияПлощадейСрезПоследних.Площадь
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЖилаяПлощадьПомещения
		|ПОМЕСТИТЬ ВТ_ПлощадьПомещения
		|ИЗ
		|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения) В
		|				(ВЫБРАТЬ
		|					ВТ_ОсновныеДанные.ОрганизацияСсылка КАК Организация,
		|					ВТ_ОсновныеДанные.РайонСсылка КАК Район,
		|					ВТ_ОсновныеДанные.КлючПомещения КАК КлючПомещения
		|				ИЗ
		|					ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)) КАК энргЗначенияПлощадейСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗначенияПлощадейСрезПоследних.Организация,
		|	энргЗначенияПлощадейСрезПоследних.Район,
		|	энргЗначенияПлощадейСрезПоследних.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргФормыУправленияМКДСрезПоследних.УК КАК УК,
		|	энргФормыУправленияМКДСрезПоследних.МКД КАК МКД
		|ПОМЕСТИТЬ ВТ_УКМКД
		|ИЗ
		|	РегистрСведений.энргФормыУправленияМКД.СрезПоследних(
		|			&Период,
		|			(Организация, Район, МКД) В
		|				(ВЫБРАТЬ
		|					ВТ.ОрганизацияСсылка,
		|					ВТ.РайонСсылка,
		|					ВТ.МКД
		|				ИЗ
		|					ВТ_ОсновныеДанные КАК ВТ)) КАК энргФормыУправленияМКДСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	энргКоличествоПрописанныхСрезПоследних.Количество КАК Количество,
		|	энргКоличествоПрописанныхСрезПоследних.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_Прописанные
		|ИЗ
		|	РегистрСведений.энргКоличествоПрописанных.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения) В
		|				(ВЫБРАТЬ
		|					ВТ.ОрганизацияСсылка КАК ОрганизацияСсылка,
		|					ВТ.РайонСсылка КАК Район,
		|					ВТ.КлючПомещения КАК КлючПомещения
		|				ИЗ
		|					ВТ_ОсновныеДанные КАК ВТ)) КАК энргКоличествоПрописанныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	энргКоличествоПроживающихСрезПоследних.Количество КАК Количество,
		|	энргКоличествоПроживающихСрезПоследних.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ВТ_Проживающие
		|ИЗ
		|	РегистрСведений.энргКоличествоПроживающих.СрезПоследних(
		|			&Период,
		|			(Организация, Район, КлючПомещения) В
		|				(ВЫБРАТЬ
		|					ВТ.ОрганизацияСсылка КАК ОрганизацияСсылка,
		|					ВТ.РайонСсылка КАК Район,
		|					ВТ.КлючПомещения КАК КлючПомещения
		|				ИЗ
		|					ВТ_ОсновныеДанные КАК ВТ)) КАК энргКоличествоПроживающихСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОсновныеДанные.Абонент КАК Абонент,
		|	NULL КАК Договор,
		|	ВТ_ОсновныеДанные.РайонСсылка КАК Район,
		|	МАКСИМУМ(энргВзаиморасчеты.Период) КАК ДатаПослОплаты,
		|	ВТ_ОсновныеДанные.ОрганизацияСсылка КАК ОрганизацияСсылка
		|ПОМЕСТИТЬ ВТ_ДанныеПослОплаты
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ПО энргВзаиморасчеты.Абонент = ВТ_ОсновныеДанные.Абонент
		|			И энргВзаиморасчеты.Организация = ВТ_ОсновныеДанные.ОрганизацияСсылка
		|			И энргВзаиморасчеты.Район = ВТ_ОсновныеДанные.РайонСсылка
		|ГДЕ
		|	энргВзаиморасчеты.ВидДвижения = &ВидДвиженияРасход
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОсновныеДанные.Абонент,
		|	ВТ_ОсновныеДанные.РайонСсылка,
		|	ВТ_ОсновныеДанные.ОрганизацияСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ВТ_ОсновныеДанные.Договор,
		|	ВТ_ОсновныеДанные.РайонСсылка,
		|	МАКСИМУМ(бестВзаиморасчетыПоСФЮрЛица.Период),
		|	ВТ_ОсновныеДанные.ОрганизацияСсылка
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестВзаиморасчетыПоСФЮрЛица КАК бестВзаиморасчетыПоСФЮрЛица
		|		ПО ВТ_ОсновныеДанные.ОрганизацияСсылка = бестВзаиморасчетыПоСФЮрЛица.Организация
		|			И ВТ_ОсновныеДанные.РайонСсылка = бестВзаиморасчетыПоСФЮрЛица.Район
		|			И ВТ_ОсновныеДанные.Договор = бестВзаиморасчетыПоСФЮрЛица.Договор
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОсновныеДанные.ОрганизацияСсылка,
		|	ВТ_ОсновныеДанные.РайонСсылка,
		|	ВТ_ОсновныеДанные.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗадачаПИДЗадолженность.Ссылка КАК Ссылка,
		|	МИНИМУМ(энргЗадачаПИДЗадолженность.ПериодНачисления) КАК ЗадолженностьНачало,
		|	МАКСИМУМ(энргЗадачаПИДЗадолженность.ПериодНачисления) КАК ЗадолженностьОкончание
		|ПОМЕСТИТЬ ВТ_ПериодЗадолженности
		|ИЗ
		|	Задача.энргЗадачаПИД.Задолженность КАК энргЗадачаПИДЗадолженность
		|ГДЕ
		|	энргЗадачаПИДЗадолженность.Ссылка = &МассивОбъектов
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗадачаПИДЗадолженность.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Константы.энргРеквизитФилиалаАдрес КАК энргРеквизитФилиалаАдрес,
		|	Константы.энргРеквизитФилиалаТелефон КАК энргРеквизитФилиалаТелефон,
		|	Константы.энргРеквизитФилиалаАдресСайта КАК энргРеквизитФилиалаАдресСайта,
		|	Константы.энргРеквизитФилиалаЮридическийАдрес КАК энргРеквизитФилиалаЮридическийАдрес,
		|	Константы.энргРеквизитФилиалаЭлекАдрес КАК энргРеквизитФилиалаЭлекАдрес,
		|	Константы.энргРеквизитФилиалаОКПО КАК энргРеквизитФилиалаОКПО,
		|	Константы.энргРеквизитФилиалаОГРН КАК энргРеквизитФилиалаОГРН,
		|	Константы.энргРеквизитФилиалаИНН КАК энргРеквизитФилиалаИНН,
		|	Константы.энргРеквизитФилиалаКПП КАК энргРеквизитФилиалаКПП,
		|	Константы.энргРеквизитФилиалаФакс КАК энргРеквизитФилиалаФакс
		|ПОМЕСТИТЬ ВТ_РеквизитыФилиала
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргЗоныОтвественностиДополнительныеРеквизиты.Ссылка КАК Филиал,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдрес
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Адрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаТелефон
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК КонтактныйЦентр_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдресСайта
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК АдресСайта_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЮридическийАдрес
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЮридическийАдрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЭлекАдрес
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ЭлекАдрес_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОКПО
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ОКПО_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОГРН
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ОГРН_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаИНН
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ИНН_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаКПП
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК КПП_Филиала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаФакс
		|				ТОГДА энргЗоныОтвественностиДополнительныеРеквизиты.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Факс_Филиала,
		|	энргЗоныОтвественности.Префикс КАК Префикс
		|ПОМЕСТИТЬ ВТ_ДопРеквизитыФилиала
		|ИЗ
		|	Справочник.энргЗоныОтвественности.ДополнительныеРеквизиты КАК энргЗоныОтвественностиДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ПО энргЗоныОтвественностиДополнительныеРеквизиты.Ссылка = ВТ_ОсновныеДанные.РайонСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеквизитыФилиала КАК ВТ_РеквизитыФилиала
		|		ПО (энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдрес
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаТелефон
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаАдресСайта
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЮридическийАдрес
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаЭлекАдрес
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОКПО
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаОГРН
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаИНН
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаКПП
		|				ИЛИ энргЗоныОтвественностиДополнительныеРеквизиты.Свойство = ВТ_РеквизитыФилиала.энргРеквизитФилиалаФакс)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
		|		ПО энргЗоныОтвественностиДополнительныеРеквизиты.Ссылка = энргЗоныОтвественности.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗоныОтвественностиДополнительныеРеквизиты.Ссылка,
		|	энргЗоныОтвественности.Префикс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ОсновныеДанные.Фамилия КАК Фамилия,
		|	ВТ_ОсновныеДанные.Имя КАК Имя,
		|	ВТ_ОсновныеДанные.Отчество КАК Отчество,
		|	ВТ_ОсновныеДанные.АдресОбъекта КАК АдресОбъекта,
		|	ВТ_ОсновныеДанные.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ_ОсновныеДанные.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ВТ_ПериодЗадолженности.ЗадолженностьНачало КАК ЗадолженностьНачало,
		|	ВТ_ПериодЗадолженности.ЗадолженностьОкончание КАК ЗадолженностьОкончание,
		|	ВТ_ОсновныеДанные.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	ВТ_ОсновныеДанные.Задача КАК Задача,
		|	ВТ_ОсновныеДанные.ИНН КАК ИНН,
		|	ВТ_ОсновныеДанные.РасчСчет КАК РасчСчет,
		|	ВТ_ОсновныеДанные.Банк КАК Банк,
		|	ВТ_ОсновныеДанные.БИК КАК БИК,
		|	ВТ_ОсновныеДанные.КоррСчет КАК КоррСчет,
		|	ВТ_ОсновныеДанные.Организация КАК Организация,
		|	ВТ_ОсновныеДанные.ВидОбъекта КАК ВидОбъекта,
		|	ВТ_ОсновныеДанные.Абонент КАК Абонент,
		|	ВТ_ОсновныеДанные.МКД КАК МКД,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.НаименованиеРайона, ВТ_ОсновныеДанные.Район) КАК Район,
		|	ВТ_ОсновныеДанные.БанкНаименование КАК БанкНаименование,
		|	ВТ_ДанныеПослОплаты.ДатаПослОплаты КАК ДатаПослОплаты,
		|	ВТ_Проживающие.Количество КАК Проживающие,
		|	ВТ_Прописанные.Количество КАК Прописанные,
		|	ВТ_ПлощадьМКД.ОбщаяПлощадьМКД КАК ПлощадьДома,
		|	ВТ_ПлощадьМКД.ПлощатьМОП КАК ПлощадьМОП,
		|	ВТ_УКМКД.УК КАК УК,
		|	ЕСТЬNULL(ВТ_ПлощадьМКД.ОбщаяПлощадьМКД, 0) - ЕСТЬNULL(ВТ_ПлощадьМКД.ПлощатьМОП, 0) КАК ПлощадьЖП,
		|	энргТипСобственностиАбонентовСрезПоследних.ТипСобственности КАК ТипСобственности,
		|	ВТ_ОсновныеДанные.Дата КАК Дата,
		|	ВТ_ОсновныеДанные.ОрганизацияНаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ВТ_ОсновныеДанные.ОрганизацияНаименованиеСокращённое КАК ОрганизацияНаименованиеСокращённое,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.Адрес_Филиала, ВТ_ДопРеквизитыФилиала.Адрес_Филиала) КАК Адрес_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.ЮридическийАдрес_Филиала, ВТ_ДопРеквизитыФилиала.ЮридическийАдрес_Филиала) КАК ЮридическийАдрес_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.КонтактныйЦентр_Филиала, ВТ_ДопРеквизитыФилиала.КонтактныйЦентр_Филиала) КАК КонтактныйЦентр_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.Факс_Филиала, ВТ_ДопРеквизитыФилиала.Факс_Филиала) КАК Факс_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.ЭлекАдрес_Филиала, ВТ_ДанныеФилиала.ЭлекАдрес_Филиала) КАК ЭлекАдрес_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.АдресСайта_Филиала, ВТ_ДопРеквизитыФилиала.АдресСайта_Филиала) КАК АдресСайта_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.ОКПО_Филиала, ВТ_ДопРеквизитыФилиала.ОКПО_Филиала) КАК ОКПО_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.ОГРН_Филиала, ВТ_ДопРеквизитыФилиала.ОГРН_Филиала) КАК ОГРН_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.КПП_Филиала, ВТ_ДопРеквизитыФилиала.КПП_Филиала) КАК КПП_Филиала,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.ИНН_Филиала, ВТ_ДопРеквизитыФилиала.ИНН_Филиала) КАК ИНН_Филиала,
		|	ВТ_ОсновныеДанные.НомерЗадачи КАК НомерЗадачи,
		|	ВТ_ПлощадьПомещения.ПлощадьПомещения КАК ОбщаяПлощадь,
		|	ВТ_ПлощадьПомещения.ЖилаяПлощадьПомещения КАК ЖилаяПлощадь,
		|	ЕСТЬNULL(ВТ_ДанныеФилиала.Префикс, ВТ_ДанныеФилиала.Префикс) КАК Префикс,
		|	ВТ_ОсновныеДанные.Постфикс КАК Постфикс,
		|	ВТ_ОсновныеДанные.Договор КАК Договор,
		|	ВТ_ДанныеФилиала.АдресБлижайшегоПункта_Филиала КАК АдресБлижайшегоПункта_Филиала
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПослОплаты КАК ВТ_ДанныеПослОплаты
		|		ПО (ВЫБОР
		|				КОГДА ВТ_ОсновныеДанные.Договор <> ЗНАЧЕНИЕ(справочник.энргДоговорыКонтрагентов.пустаяссылка)
		|					ТОГДА ВТ_ОсновныеДанные.Договор = ВТ_ДанныеПослОплаты.Договор
		|				КОГДА ВТ_ОсновныеДанные.Абонент <> ЗНАЧЕНИЕ(справочник.энргабоненты.пустаяссылка)
		|					ТОГДА ВТ_ОсновныеДанные.Абонент = ВТ_ДанныеПослОплаты.Абонент
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|			И ВТ_ОсновныеДанные.Район = ВТ_ДанныеПослОплаты.Район
		|			И ВТ_ОсновныеДанные.ОрганизацияСсылка = ВТ_ДанныеПослОплаты.ОрганизацияСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Прописанные КАК ВТ_Прописанные
		|		ПО ВТ_ОсновныеДанные.КлючПомещения = ВТ_Прописанные.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проживающие КАК ВТ_Проживающие
		|		ПО ВТ_ОсновныеДанные.КлючПомещения = ВТ_Проживающие.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадьМКД КАК ВТ_ПлощадьМКД
		|		ПО ВТ_ОсновныеДанные.МКД = ВТ_ПлощадьМКД.МКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УКМКД КАК ВТ_УКМКД
		|		ПО ВТ_ОсновныеДанные.МКД = ВТ_УКМКД.МКД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргТипСобственностиАбонентов.СрезПоследних(
		|				,
		|				(Организация, Район, КлючПомещения) В
		|					(ВЫБРАТЬ
		|						ВТ.Организация,
		|						ВТ.Район,
		|						ВТ.КлючПомещения
		|					ИЗ
		|						ВТ_ОсновныеДанные КАК ВТ)) КАК энргТипСобственностиАбонентовСрезПоследних
		|		ПО ВТ_ОсновныеДанные.КлючПомещения = энргТипСобственностиАбонентовСрезПоследних.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеФилиала КАК ВТ_ДанныеФилиала
		|		ПО ВТ_ОсновныеДанные.РайонСсылка = ВТ_ДанныеФилиала.Район
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлощадьПомещения КАК ВТ_ПлощадьПомещения
		|		ПО ВТ_ОсновныеДанные.ОрганизацияСсылка = ВТ_ПлощадьПомещения.Организация
		|			И ВТ_ОсновныеДанные.РайонСсылка = ВТ_ПлощадьПомещения.Район
		|			И ВТ_ОсновныеДанные.КлючПомещения = ВТ_ПлощадьПомещения.КлючПомещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодЗадолженности КАК ВТ_ПериодЗадолженности
		|		ПО ВТ_ОсновныеДанные.Задача = ВТ_ПериодЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопРеквизитыФилиала КАК ВТ_ДопРеквизитыФилиала
		|		ПО ВТ_ОсновныеДанные.РайонСсылка = ВТ_ДопРеквизитыФилиала.Филиал";
	
	Запрос.УстановитьПараметр("МассивОбъектов",		МассивОбъектов);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период",				ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Префикс = "";
	СтрокаСтрук = "";
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтрокаСтрук = СтрокаСтрук + Префикс + Колонка.Имя;
		Префикс = ", ";
	КонецЦикла;
	
	СпиокОбъектов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ТекОбъект = Новый Структура(СтрокаСтрук);
		ЗаполнитьЗначенияСвойств(ТекОбъект, Выборка);
		
		ТекОбъект.ЗадолженностьНачало 	= Формат(ТекОбъект.ЗадолженностьНачало, "ДФ=dd.MM.yyyy");
		ТекОбъект.ЗадолженностьОкончание= Формат(ТекОбъект.ЗадолженностьОкончание, "ДФ=dd.MM.yyyy");
		Если Не ЗначениеЗаполнено(ТекОбъект.ДатаСледЭтапа) Или НачалоДня(ТекОбъект.Дата) = ТекОбъект.ДатаСледЭтапа Тогда
			ТекОбъект.ДатаСледЭтапа		= Формат(ТекОбъект.Дата+30*24*3600, "ДФ=dd.MM.yyyy");
		Иначе
			ТекОбъект.ДатаСледЭтапа		= Формат(ТекОбъект.ДатаСледЭтапа, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		ТекОбъект.Вставить("ТекДата", ТекущаяДатаСеанса());
		ТекОбъект.НомерЗадачи = Строка(Выборка.Префикс) + "-" + УбратьЛидирующиеНули(ТекОбъект.НомерЗадачи) + ?(ЗначениеЗаполнено(Выборка.Постфикс), "/" + Выборка.Постфикс, "");

		ТекОбъект.Дата					= Формат(ТекОбъект.Дата, "ДФ=dd.MM.yyyy");
		ТекОбъект.ДатаПослОплаты		= ?(ЗначениеЗаполнено(ТекОбъект.ДатаПослОплаты), Формат(ТекОбъект.ДатаПослОплаты, "ДФ=dd.MM.yyyy"), "");
		Если Не ЗначениеЗаполнено(Выборка.Фамилия) Тогда
			ТекОбъект.Вставить("ФИО", Строка(Выборка.Абонент));
		Иначе
			ТекОбъект.Вставить("ФИО", Выборка.Фамилия + " " + ?(ЗначениеЗаполнено(Выборка.Имя), Лев(Выборка.Имя, 1) + ".", "")
									 + ?(ЗначениеЗаполнено(Выборка.Отчество), Лев(Выборка.Отчество, 1) + ".", ""));
		КонецЕсли;
		
		ТекОбъект.Вставить("ИО_Абонента", Выборка.Имя + ?(ЗначениеЗаполнено(Выборка.Отчество), " " + Выборка.Отчество, ""));
		ТекОбъект.Вставить("СуммаЗадолженностиРуб", Цел(Выборка.СуммаЗадолженности));
		ТекОбъект.Вставить("СуммаЗадолженностиКоп", Цел((Выборка.СуммаЗадолженности - ТекОбъект.СуммаЗадолженностиРуб) * 100));
		ТекОбъект.Вставить("ЛицевойСчет", СокрЛП(Выборка.ЛицевойСчет));
		ТекОбъект.Вставить("ОрганизацияПрописью", ВРег(Строка(Выборка.Организация)));
		Если ЗначениеЗаполнено(Выборка.ЮридическийАдрес_Филиала) И Выборка.ЮридическийАдрес_Филиала <> Выборка.Адрес_Филиала Тогда
			ФактЮрАдрес = "юридический адрес: " + Строка(Выборка.ЮридическийАдрес_Филиала) + Символы.ПС +
							"фактический адрес: " + Строка(Выборка.Адрес_Филиала);
			ТекОбъект.Вставить("ФактЮрАдрес", ФактЮрАдрес);
		Иначе
			ТекОбъект.Вставить("ФактЮрАдрес", Выборка.Адрес_Филиала);
		КонецЕсли;
		
		СпиокОбъектов.Добавить(ТекОбъект);
		
		
		РеквизитыКвитанции = Новый Структура;
		
		РеквизитыКвитанции.Вставить("ТекстПолучателя", 			СокрЛП(Выборка.Организация));
		РеквизитыКвитанции.Вставить("НомерСчетаПолучателя", 			Выборка.РасчСчет);
		РеквизитыКвитанции.Вставить("НаименованиеБанкаПолучателя", 		Выборка.БанкНаименование);
		РеквизитыКвитанции.Вставить("БИКБанкаПолучателя", 				Выборка.БИК);
		РеквизитыКвитанции.Вставить("СчетБанкаПолучателя", 				Выборка.КоррСчет);
		РеквизитыКвитанции.Вставить("СуммаЧислом",		 				Выборка.СуммаЗадолженности);
		РеквизитыКвитанции.Вставить("НомерЛицевогоСчетаПлательщика", 	ТекОбъект.ЛицевойСчет);
		ПериодОплаты = Формат(Выборка.Дата, "ДФ=MM")+"-"+Формат(Выборка.Дата, "ДФ=MM")+"."+Формат(Выборка.Дата, "ДФ=yyyy"); 
		РеквизитыКвитанции.Вставить("ПериодОплаты", 					ПериодОплаты);
		РеквизитыКвитанции.Вставить("ФамилияПлательщика", 				СокрЛП(Выборка.Абонент)); 
		
		ЗаполРекQR = Ложь;
		Если Не ЗначениеЗаполнено(РеквизитыКвитанции.ТекстПолучателя) Тогда
			ТекОбъект.Вставить("КартинкаQRКодаОшибка", "Не заполнена организация");
		ИначеЕсли Не ЗначениеЗаполнено(РеквизитыКвитанции.НомерСчетаПолучателя)Тогда
			ТекОбъект.Вставить("КартинкаQRКодаОшибка", "Не корректно заполнен основной банковский счёт организации");
		ИначеЕсли Не ЗначениеЗаполнено(РеквизитыКвитанции.БИКБанкаПолучателя) Или Не ЗначениеЗаполнено(РеквизитыКвитанции.НаименованиеБанкаПолучателя) Или Не ЗначениеЗаполнено(РеквизитыКвитанции.СчетБанкаПолучателя) Тогда
		    ТекОбъект.Вставить("КартинкаQRКодаОшибка", "Не корректно заполнен банк в основном банковском счёте организации");
		Иначе 
			ЗаполРекQR = Истина;
		КонецЕсли;
		
		Если ЗаполРекQR Тогда
			QRСтрока		= УправлениеПечатью.ФорматнаяСтрокаУФЭБС(РеквизитыКвитанции);
			
			Если Не ПустаяСтрока(QRСтрока) Тогда
				ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 1, 120);
				Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
					Шаблон 			= Нстр("ru = 'Не удалось сформировать QR-код для абонента %1. Технические подробности см. в журнале регистрации.'");
					ТекстСообщения 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Выборка.Абонент);
					ТекОбъект.Вставить("КартинкаQRКодаОшибка", ТекстСообщения);
				Иначе
					КартинкаQRКода								= Новый Картинка(ДанныеQRКода);
					ТекОбъект.Вставить("КартинкаQRКода", КартинкаQRКода);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	Для каждого ОбъектПечати из СпиокОбъектов Цикл
		СписокОбл   = Новый Массив;
		ОшибкаQRКод = "";
		
		Для каждого ТекОбласть Из ОбластиМакета Цикл
		 	Если ТекОбласть = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекОбласть.Значение.Параметры.Заполнить(ОбъектПечати);
			Для каждого ТекРисунок Из ТекОбласть.Значение.Рисунки Цикл
				Если ТекРисунок.Имя = "QRКод" Тогда 
					ТекстОшибки = "";
					Если ОбъектПечати.Свойство("КартинкаQRКодаОшибка", ТекстОшибки) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
						ОшибкаQRКод = ОшибкаQRКод + ?(ЗначениеЗаполнено(ОшибкаQRКод), "; ", "") + ТекстОшибки;
					Иначе
						ОбъектПечати.Свойство("КартинкаQRКода", ТекРисунок.Картинка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			СписокОбл.Добавить(ТекОбласть.Значение);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОшибкаQRКод) Тогда
			ТекстОшибки = "Ошибка при формирование QRКода: " + ОшибкаQRКод;
			Возврат Истина;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		
		Для каждого ТекОбласть Из СписокОбл Цикл
			Результат = Истина;
			ТабличныйДокумент.Вывести(ТекОбласть);
		КонецЦикла;
		
		ПервыйДокумент = Ложь;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УбратьЛидирующиеНули(Знач НомерДокумента)
	Если Не ЗначениеЗаполнено(НомерДокумента) Тогда
		Возврат "";
	КонецЕсли;
	
	Пока Лев(НомерДокумента, 1) = "0" И СтрДлина(НомерДокумента) > 8 Цикл
		НомерДокумента = Прав(НомерДокумента, СтрДлина(НомерДокумента)-1);
	КонецЦикла;
	
	Возврат НомерДокумента;
КонецФункции 

Функция ПолучитьСписокМакетовПечати() Экспорт 
	Результат		 = Новый СписокЗначений;
	МетаСпрЭтаповПИД = Метаданные.Справочники.энргВидыОперацийПИД;
	СпрЭтаповПИД	 = Справочники.энргВидыОперацийПИД;
	
	Для каждого ТекМакет Из МетаСпрЭтаповПИД.Макеты Цикл
		Префикс		  = "ПФ_MXL_";
		ДлинаПрефикса = СтрДлина(Префикс);
		Если Префикс <> Лев(ТекМакет.Имя, ДлинаПрефикса) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЭтапа	 = Сред(ТекМакет.Имя, ДлинаПрефикса+1);
		ИмяПредЭтапа = "ЭтапПретензионноИсковойДеятельности_" + ИмяЭтапа;
		ЭтапИмя 	 = Новый Структура(ИмяПредЭтапа);
		ЗаполнитьЗначенияСвойств(ЭтапИмя, СпрЭтаповПИД);
		Если Не ЗначениеЗаполнено(ЭтапИмя[ИмяПредЭтапа]) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ТекМакет.Имя, Строка(ЭтапИмя[ИмяПредЭтапа]));
	КонецЦикла;

	Возврат Результат;
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТолькоОРП = Неопределено;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
	Запрос.УстановитьПараметр("ТолькоОРП", ?(Параметры.Свойство("ТолькоОРП", ТолькоОРП), ТолькоОРП, Ложь));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	энргВидыОперацийПИД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.энргВидыОперацийПИД КАК энргВидыОперацийПИД
		|ГДЕ
		|	НЕ энргВидыОперацийПИД.ПометкаУдаления
		|	И энргВидыОперацийПИД.Наименование ПОДОБНО &СтрокаПоиска
		|	И ВЫБОР
		|			КОГДА энргВидыОперацийПИД.Тип = ЗНАЧЕНИЕ(Перечисление.энргТипыЭтапов.ОграничениеРежимаПотребления)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ = &ТолькоОРП";
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли