#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерфейса_РаботаСГИЖКХ

Процедура ЗаполнитьСхемуОбъектыДляПередачиВГИСЖКХ(Схема,ПараметрыСхемы,ТаблицаДляПомещения  = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъектыДляПередачиВГИСЖКХ());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
		
КонецПроцедуры

Процедура ЗаполнитьСхемуОбъектыДляПередачиВГИСЖКХПоказанияПриборовУчета(Схема,ПараметрыСхемы,ТаблицаДляПомещения  = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъектыДляПередачиВГИСЖКХПоказанияПриборовУчета());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуОбъектыДляПередачиВГИСЖКХНачисленияПоУслугам(Схема,ПараметрыСхемы,ТаблицаДляПомещения  = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъектыДляПередачиВГИСЖКХНачисленияПоУслугам());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуОбъектыДляПередачиВГИСЖКХОснованияПерерасчетовПоУслугам(Схема,ПараметрыСхемы,ТаблицаДляПомещения  = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъектыДляПередачиВГИСЖКХОснованияПерерасчетаПоУслугам());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

#КонецОбласти

Процедура ПечатьЕПД(МассивДок) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаОбъектыДляПередачиВГИСЖКХ()
	
	Текст  =
	"ВЫБРАТЬ
	|	табШапка.Ссылка КАК Ссылка,
	|	МАКСИМУМ(табШапка.Абонент) КАК Абонент,
	|	МАКСИМУМ(табШапка.ПериодНачисления) КАК ПериодНачисления,
	|	МАКСИМУМ(табШапка.Номер) КАК ПлатежныйДокументНомер,
	|	МАКСИМУМ(табШапка.Дата) КАК ПлатежныйДокументДата,
	|	МАКСИМУМ(0) КАК ИтогоКОплатеСУчетомЗадолженности,
	|	МАКСИМУМ(табШапка.НачисленоЗаПериод) КАК ИтогоКОплатеПоВсемУслугам,
	|	МАКСИМУМ(табШапка.НачисленоЗаПериод) КАК КОплатеСуммаЗаРасчетныйПериод,
	|	МАКСИМУМ(табШапка.КОплате) КАК ИтогоКОплатеПоВсемуДокументу,
	|	МАКСИМУМ(табШапка.ЗадолженностьНаНачало) - МАКСИМУМ(табШапка.ОплатаЗаПериод) КАК ЗадолженностьЗаПредыдущиеПериоды, 
	|	СУММА(ЕСТЬNULL(бестЕдиныйПлатежныйДокументРаздел4Пеня.СуммаПени, 0)) КАК ИтогоКОплатеПоВсемНеустойкам,
	|	МАКСИМУМ(табШапка.ОплатаЗаПериод) КАК ОплаченоСумма,
	|	МАКСИМУМ(ДЕНЬ(табШапка.Дата)) КАК НомерДняДоКоторогоУчтеныПлатежи
	|ИЗ
	|	Документ.бестЕдиныйПлатежныйДокумент КАК табШапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЕдиныйПлатежныйДокумент.Раздел4Пеня КАК бестЕдиныйПлатежныйДокументРаздел4Пеня
	|		ПО (бестЕдиныйПлатежныйДокументРаздел4Пеня.Ссылка = табШапка.Ссылка)
	|ГДЕ
	|	табШапка.Ссылка В(&мИзменения)
	|
	|СГРУППИРОВАТЬ ПО
	|	табШапка.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъектыДляПередачиВГИСЖКХПоказанияПриборовУчета()
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ЗаводскойНомерПрибораУчета КАК ЗаводскойНомерПрибораУчета,
	|	ВложенныйЗапрос.КонечныеПоказания КАК КонечныеПоказания,
	|	ВложенныйЗапрос.НачальныеПоказания КАК НачальныеПоказания,
	|	"""" КАК КодЕдиницыИзмерения
	//|	энргТипыПриборовУчета.КодЕдиницыИзмерения КАК КодЕдиницыИзмерения
	|ИЗ
	|	(ВЫБРАТЬ
	|		табПоказанияПриборовУчета.Ссылка КАК Ссылка,
	|		табПоказанияПриборовУчета.Услуга КАК Услуга,
	|		энргПриборыУчетаАбонента.Код КАК ЗаводскойНомерПрибораУчета,
	|		табПоказанияПриборовУчета.НачальныеПоказания КАК НачальныеПоказания,
	|		табПоказанияПриборовУчета.КонечныеПоказания КАК КонечныеПоказания,
	|		энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета
	|	ИЗ
	|		Документ.бестЕдиныйПлатежныйДокумент.Раздел4 КАК табПоказанияПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО табПоказанияПриборовУчета.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|	ГДЕ
	|		табПоказанияПриборовУчета.Ссылка В(&мИзменения)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	|		ПО ВложенныйЗапрос.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъектыДляПередачиВГИСЖКХНачисленияПоУслугам()
	Текст  =
	"ВЫБРАТЬ
	|	табНачисленияПоУслугам.Ссылка КАК Ссылка,
	|	табНачисленияПоУслугам.Услуга КАК Услуга,
	|	табНачисленияПоУслугам.СуммаВсегоСПовКоэф - табНачисленияПоУслугам.Льгота КАК КОплатеЗаПериодБезПениШтрафов,
	|	табНачисленияПоУслугам.СуммаВсего КАК СуммаНачисленоЗаПериодБезПерерасчетов,
	|	табНачисленияПоУслугам.ЗадолженностьНаНачало КАК ЗадолженностьЗаПредыдущиеПериоды,
	|	табНачисленияПоУслугам.СуммаВсегоПоСтроке КАК КОплатеСУчетомЗадолженностиСПенейШтрафами,
	|	табНачисленияПоУслугам.Перерасчет КАК СуммаПерерасчета,
	|	табНачисленияПоУслугам.Льгота КАК СуммаСкидки,
	|	табНачисленияПоУслугам.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ВЫБОР
	|		КОГДА НЕ табНачисленияПоУслугам.СуммаПоПовышКоэф = 0
	|			ТОГДА 1.5
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПовышающийКоэффициент,
	|	табНачисленияПоУслугам.ИндОбъемПоСреднему + табНачисленияПоУслугам.ИндОбъемПоПрибору КАК НачисленныйОбъемПоПрибору,
	|	табНачисленияПоУслугам.ИндОбъемПоНормативу КАК НачисленныйОбъемПоНормативу,
	|	ЕСТЬNULL(бестЕдиныйПлатежныйДокументРаздел4.НормативПотребления, 0) КАК ЗначениеНормативаПотребления,
	|	ЕСТЬNULL(бестЕдиныйПлатежныйДокументРаздел4.КонечныеПоказания, 0) КАК КонечныеПоказания
	|ИЗ
	|	Документ.бестЕдиныйПлатежныйДокумент.Раздел3 КАК табНачисленияПоУслугам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЕдиныйПлатежныйДокумент.Раздел4 КАК бестЕдиныйПлатежныйДокументРаздел4
	|		ПО табНачисленияПоУслугам.Ссылка = бестЕдиныйПлатежныйДокументРаздел4.Ссылка
	|			И табНачисленияПоУслугам.Услуга = бестЕдиныйПлатежныйДокументРаздел4.Услуга
	|ГДЕ
	|	табНачисленияПоУслугам.Ссылка В(&мИзменения)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъектыДляПередачиВГИСЖКХОснованияПерерасчетаПоУслугам()
	Текст  =
	"ВЫБРАТЬ
	|	табНачисленияПоУслугам.Ссылка КАК Ссылка,
	|	табНачисленияПоУслугам.Услуга КАК Услуга,
	|	табОснованияПерерасчетов.СуммаИП КАК СуммаПеререрасчета,
	|	ПРЕДСТАВЛЕНИЕ(табОснованияПерерасчетов.ИндПерерасчет) КАК ОснованиеПерерасчета
	|ИЗ
	|	Документ.бестЕдиныйПлатежныйДокумент.Раздел3 КАК табНачисленияПоУслугам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЕдиныйПлатежныйДокумент.Раздел5 КАК табОснованияПерерасчетов
	|		ПО табНачисленияПоУслугам.Ссылка = табОснованияПерерасчетов.Ссылка
	|			И табНачисленияПоУслугам.Услуга = табОснованияПерерасчетов.Услуга
	|ГДЕ
	|	табНачисленияПоУслугам.Ссылка В(&мИзменения)
	|	И табОснованияПерерасчетов.Ссылка В(&мИзменения)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли