
#Область Команды

&НаКлиенте
Процедура Сформировать(Команда)
	ОбъектПечати = ПредопределенноеЗначение("Документ.бестРеструктуризацияЗадолженности.ПустаяСсылка");
	Результат = Новый Структура("ОбъектПечати,Период,Организация,Район,Договор", 
	ОбъектПечати,Период,Организация,Район,Договор);
		
	МассивОбъектов = ОбъектПечати;
	                        
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.бестРеструктуризацияЗадолженности","ПФ_MXL_ЖурналУчетаГрафиковПогашения",МассивОбъектов,ЭтотОбъект,Результат);
КонецПроцедуры

#КонецОбласти