#Область ПрограммныйИнтерфейс

// Создание событе для этапа.
//
// Параметры:
//  Задача		-	Документ.Задача			-	объект задачи, для которой создается событие.
//  IDЭтапа		-	УникальныйИдентификатор	-	идентификатор этапа задачи.
//  Подэтапы	-	Массив, ТаблицаЗначений:
//  					* IDЭтапа	-	УникальныйИдентификатор	-	идентификатор этапа задачи.
//  					* Подэтап	-	Строка					-	наименование подэтапа.
//  					* Текущий	-	Булево					-	является ли текущим.
//  					* Выполнен	-	Булево					-	выполнен ли.
//  					* Отменен	-	Булево					-	отменен ли.
//  Владелец	-	ФормаКлиентскогоПриложения		-	форма владелец, из которой вызывается создание события.
//  Оповещение	-	Строка							-	имя процедуры обратного вызова после закрытия формы события.
//  ТипСобытия	-	ПеречислениеСсылка.ТипыСобытий	-	тип создаваемого события.
//
Процедура СоздатьСобытеДляЭтапа(Задача, IDЭтапа, Подэтапы, Владелец, Оповещение, ТипСобытия = Неопределено) Экспорт 
	ПарамФормы 		= Новый Структура("Организация, Район, Одинарный, ВРамкахЭтапа", Задача.Организация, Задача.Район, Истина, Задача.Этап);
	ЭтоЗадачаЮр 	= ЗначениеЗаполнено(Задача.Договор);
	
	Если ЭтоЗадачаЮр Тогда
		Договоры 		= Новый Массив;
		СтрокаДоговоры 	= Новый Структура("Абонент, Основание, IDЭтапа", Задача.Договор, Задача.Ссылка, IDЭтапа);
		Договоры.Добавить(СтрокаДоговоры);
		
		ПарамФормы.Вставить("Договоры", Договоры);
	Иначе	
		Абоненты 		= Новый Массив;
		СтрокаАбоненты 	= Новый Структура("Абонент, Основание, IDЭтапа", Задача.Абонент, Задача.Ссылка, IDЭтапа);
		Абоненты.Добавить(СтрокаАбоненты);
		
		ПарамФормы.Вставить("Абоненты", Абоненты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подэтапы) Тогда
		ПодэтапыПарам = Новый Массив;
	
		Для каждого СтроткаТЧ Из Подэтапы Цикл
		
			СтрокаПодэтапы = Новый Структура("IDЭтапа, Подэтап, Текущий, Выполнен, Отменен");
			ЗаполнитьЗначенияСвойств(СтрокаПодэтапы, СтроткаТЧ);
			
			ПодэтапыПарам.Добавить(СтрокаПодэтапы);
		КонецЦикла;
		
		ПарамФормы.Вставить("Подэтапы", ПодэтапыПарам);
	КонецЕсли;
	
	ПарамФормы.Вставить("ТипСобытия", ТипСобытия);
	ФормаКакСтрока = энргОбщегоНазначенияКлиент.ПолучитьФормыПИРДляОтображенияКакСтрока();
	//ОткрытьФорму("Документ.энргСобытие.Форма.ФормаДокумента", ПарамФормы, Владелец,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму(ФормаКакСтрока.ФормаДокумента, ПарамФормы, Владелец,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти