#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.бестСобственникиОбъектовРасчета.Записывать = Истина;
	
	ПроведениеПоРегистрам();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПоРегистрам()
	РезультатЗапроса 					= ПолучитьДанныеЗапроса();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса,		Движения.бестСобственникиОбъектовРасчета);	
КонецПроцедуры

Функция ПолучитьДанныеЗапроса()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестИзменениеСобственникаОбъектаРасчета.Ссылка КАК Регистратор,
	|	бестИзменениеСобственникаОбъектаРасчета.Дата КАК Период,
	|	бестИзменениеСобственникаОбъектаРасчета.Организация КАК Организация,
	|	бестИзменениеСобственникаОбъектаРасчета.Район КАК Район,
	|	бестИзменениеСобственникаОбъектаРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестИзменениеСобственникаОбъектаРасчета.Собственник КАК Собственник
	|ИЗ
	|	Документ.бестИзменениеСобственникаОбъектаРасчета КАК бестИзменениеСобственникаОбъектаРасчета
	|ГДЕ
	|	бестИзменениеСобственникаОбъектаРасчета.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестИзменениеСобственникаОбъектаРасчета.Ссылка,
	|	бестИзменениеСобственникаОбъектаРасчета.Дата,
	|	бестИзменениеСобственникаОбъектаРасчета.Организация,
	|	бестИзменениеСобственникаОбъектаРасчета.Район,
	|	бестИзменениеСобственникаОбъектаРасчета.ОбъектРасчета,
	|	бестИзменениеСобственникаОбъектаРасчета.Собственник";
	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли