#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Для Каждого СтрокаТЧ из Площади цикл
		//Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВидПлощади) Тогда
		//	Отказ 		= Истина;
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Вид площади""",ЭтотОбъект,"Площади["+(СтрокаТЧ.НомерСтроки-1)+"].ВидПлощади");				
		//КонецЕсли;			
	//КонецЦикла;
	Для Каждого СтрокаТЧ из Площади цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Площадь) Тогда
			Отказ 		= Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Площадь""",ЭтотОбъект,"Площади["+(СтрокаТЧ.НомерСтроки-1)+"].Площадь");				
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	ДанныеШапки = ДанныеШапки();
	
	бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки,Движения.бестЗначенияПлощадейНП,"Площади");  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("ОбъектРасчета",			ОбъектРасчета);
	ДанныеШапки.Вставить("Площади",					ПолучитьПлощади());
	Возврат ДанныеШапки;
КонецФункции

Функция ПолучитьПлощади()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП) КАК ВидПлощади,
		|	бестУстановитьЗначениеПлощадиНППлощади.Площадь КАК Площадь
		|ИЗ
		|	Документ.бестУстановитьЗначениеПлощадиНП.Площади КАК бестУстановитьЗначениеПлощадиНППлощади
		|ГДЕ
		|	бестУстановитьЗначениеПлощадиНППлощади.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли