#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьДопустимыеНастройки() Экспорт
	
	Имя 								= Метаданные.Обработки.энргПечатьДоговора.Имя;	
	МассивНастроек  					= Новый Массив;
	МассивНастроек.Добавить("Должность");
	МассивНастроек.Добавить("НомерДоверенности");
	МассивНастроек.Добавить("ДатаДоверенности");
	МассивНастроек.Добавить("ТерриториальныйМенеджер");
	
	для Каждого ЗначениеНастройки из МассивНастроек цикл
		Набор 								= РегистрыСведений.энргНастройкиПечатныхФорм.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектМетаданных.установить("Обработка." + Имя);
		Набор.Отбор.Параметр.установить(ЗначениеНастройки);
		Набор.Прочитать();
		Если Набор.Количество() = 0 тогда
			СтрокаНабора  					= Набор.Добавить();
			СтрокаНабора.ОбъектМетаданных 	= "Обработка." + Имя;
			СтрокаНабора.Параметр 			= ЗначениеНастройки;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли