#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Ответственный 	= Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия),Ссылка), ВидГраницы.Исключая) ;
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= Новый Граница(МоментВремени(), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;
	
	
	ПроведениеПоРегистрам();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(ОбъектыРасчета) тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ТЧ не может быть пустой");	
	Иначе 
		Для Каждого СтрокаТЧ из ОбъектыРасчета цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТемпературныйГрафик) и НЕ ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчета) Тогда
				Отказ 		= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""Объект расчета""",ЭтотОбъект,"ОбъектыРасчета["+(СтрокаТЧ.НомерСтроки-1)+"].ОбъектРасчета");				
			КонецЕсли;
			
			Если СтрокаТЧ.ТемпературныйГрафикПредЗн = СтрокаТЧ.ТемпературныйГрафик Тогда 
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " значение температурного графика не изменилось ",ЭтотОбъект,"ОбъектыРасчета["+(СтрокаТЧ.НомерСтроки-1)+"].ТемпературныйГрафик");				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПоРегистрам()
	
	ДанныеТемпГрафики			 	= ПолучитьТаблицуПроведения();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеТемпГрафики,				Движения.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами);
	Движения.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами.Записывать = Истина;
	
КонецПроцедуры

Функция ПолучитьТаблицуПроведения()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	Запрос.УстановитьПараметр("ПериодРегистрации",	Дата);	
	Запрос.Текст  = "ВЫБРАТЬ
	                |	&Организация КАК Организация,
	                |	&Район КАК Район,
	                |	&ПериодНачисления КАК ПериодНачисления,
	                |	&ПериодРегистрации КАК ПериодРегистрации,
	                |	бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.ОбъектРасчета КАК ОбъектРасчета,
	                |	бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.ТемпературныйГрафик КАК ТемпературныйГрафик,
	                |	&Период КАК Период
	                |ИЗ
	                |	Документ.бестИзменениеТемпературногоГрафикаОбъектов КАК бестИзменениеТемпературногоГрафикаОбъектов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестИзменениеТемпературногоГрафикаОбъектов.ОбъектыРасчета КАК бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета
	                |		ПО (бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.Ссылка = бестИзменениеТемпературногоГрафикаОбъектов.Ссылка)
	                |			И (бестИзменениеТемпературногоГрафикаОбъектовОбъектыРасчета.Флаг)
	                |ГДЕ
	                |	бестИзменениеТемпературногоГрафикаОбъектов.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	
	Возврат Результат;	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли