#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестПерерасчетЭЭ(ЭтотОбъект);
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
		Для Каждого СтрокаТЧ Из Объект.Движения.бестОбъемНачисленийЭлектроэнергии Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Организация) Тогда
				СтрокаТЧ.Организация = Объект.Организация;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Район) Тогда
				СтрокаТЧ.Район = Объект.Район;
			КонецЕсли;
		КонецЦикла;
	
		Для Каждого СтрокаТЧ Из Объект.Движения.бестОбъемНачисленийЭлектроэнергии Цикл
		
		СчетчикОшибок = 0;
		Если СтрокаТЧ.Договор <> Объект.Договор Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("Строка "  + строка(СтрокаТЧ.НомерСтроки) + " Договор не соответствует договору в шапке документа"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Период) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "Период"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ОбъектРасчета) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "ОбъектРасчета"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТочкаУчета) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "ТочкаУчета"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПериодНачисления) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "ПериодНачисления"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Поставщик) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "Поставщик"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "Услуга"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Договор) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "Договор"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НачалоПериода) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "НачалоПериода"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;

		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.КонецПериода) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "КонецПериода"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;

		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЦеноваяКатегория) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "ЦеноваяКатегория"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.УровеньНапряженияРасчетный) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка "  + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "УровеньНапряженияРасчетный"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Тариф) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "Строка " + строка(СтрокаТЧ.НомерСтроки) + " не заполненно значение " + "Тариф"));
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецЕсли;
		
		Если СчетчикОшибок <> 0 Тогда
			Отказ = Истина
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
	Попытка
		Для Каждого СтрокаТЧ Из Объект.Движения.бестОбъемНачисленийЭлектроэнергии Цикл
			ЗаполнитьПериод();
			
			ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
			ПослеЗаполненияТочкиУчета(ТекДанные);
			ЗаполнитьТарифСредневзвешенный(ТекДанные);
			ПерерасчетатьТариф(ТекДанные);
			ПерерасчитатьСуммы();
		КонецЦикла
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовТабличнойЧастиДвижениябестОбъемНачисленийЭлектроэнергии

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	
	ВыборУслугиИТочкиУчета(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииОбъектРасчетаПриИзменении(Элемент)
	ДвижениябестОбъемНачисленийЭлектроэнергииОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	ТекДанные.МКД = 	ПолучитьМКДНаСервере(ТекДанные.ОбъектРасчета);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииПериодНачисленияПриИзменении(Элемент)
	ДвижениябестОбъемНачисленийЭлектроэнергииПериодНачисленияПриИзмененииПереопределяемый(Элемент);
	
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	ТекДанные.ПериодНачисления = НачалоМесяца(ТекДанные.ПериодНачисления);
	ТекДанные.ПериодРасчета = НачалоМесяца(ТекДанные.ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииТарифнаяЗонаПриИзменении(Элемент)
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;

	ЗаполнитьТарифСредневзвешенный(ТекДанные);
	ПерерасчетатьТариф(ТекДанные);
	ПерерасчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииТарифПриИзменении(Элемент)
	ПерерасчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииСтавкаНДСПриИзменении(Элемент)
	ПерерасчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииТарифСредневзвешенныйПриИзменении(Элемент)
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	
	ПерерасчетатьТариф(ТекДанные);
	ПерерасчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииТарифЗаСбытовуюНадбавкуПриИзменении(Элемент)
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;

	ПерерасчетатьТариф(ТекДанные);
	ПерерасчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииТарифЗаУслугиПоПередачиПриИзменении(Элемент)
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;

	ПерерасчетатьТариф(ТекДанные);
	ПерерасчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииТарифНаИныеУслугиПриИзменении(Элемент)
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;

	ПерерасчетатьТариф(ТекДанные);
	ПерерасчитатьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииПериодПриИзменении(Элемент)
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	ТекДанные.ПериодНачисления = НачалоМесяца(ТекДанные.ПериодНачисления);
	ТекДанные.ПериодРасчета = НачалоМесяца(ТекДанные.ПериодНачисления);
	
	ТекДанные.СтавкаНДС = ПолучитьНДСНаДатуНаСервере(ТекДанные.ПериодРасчета, объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииОбъемУслугиПриИзменении(Элемент)
	
	ПерерасчитатьСуммы();

КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииУслугаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	УровеньНапряженияМощностьТочкаПоставки	= ПолучитьУровеньНапряженияРасчетныйМощностьТочкуПоставкиНаСервере(ТекДанные.ОбъектРасчета, ТекДанные.ТочкаУчета, ТекДанные.ПериодРасчета);
	//УровеньнапрИМощность = ПолучитьУровеньНапряженияРасчетныйМощностьТочкуПоставки(ТекДанные.ОбъектРасчета, ТекДанные.ТочкаУчета, ТекДанные.ПериодРасчета);
	МаксМощность = УровеньНапряженияМощностьТочкаПоставки.МаксимальнаяМощность;
	
	ЗаполнитьТарифСредневзвешенный(ТекДанные);
	ЗаполнитьТарифыНеНаселение(ТекДанные, МаксМощность);
	ПерерасчетатьТариф(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		ЗаполнитьПериод();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета,ПростыеУслуги");
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	СтруктураОтбора.ОбъектРасчета 	= ТекДанные.ОбъектРасчета;
	СтруктураОтбора.Период 			= Объект.Дата;
	СтруктураОтбора.ПростыеУслуги	= Истина;
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца,ВыводитьСоставные", СтруктураОтбора, "НП",Ложь);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("СтруктураОтбора, ТекДанные", СтруктураОтбора, ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		ТекДанные		= ДополнительныеПараметры.ТекДанные;
		СтруктураОтбора	= ДополнительныеПараметры.СтруктураОтбора;
		СтруктураОтбора.Вставить("ТочкаУчета", 	РезультатЗакрытия.ТочкаУчета);
		СтруктураОтбора.Вставить("Услуга", 		РезультатЗакрытия.Услуга);
		
		СтруктураОтбора.Вставить("Поставщик", 	ТекДанные.Поставщик);
		СтруктураОтбора.Вставить("ТарифнаяЗона",ТекДанные.ТарифнаяЗона);
		
		ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора);
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураОтбора);
		
		ПослеЗаполненияТочкиУчета(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора)
	
	ПараметрыСхемы		= Новый Структура;
	Схема 							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Организация", 		"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ОбъектРасчета", 	"ОбъектРасчета"), 		Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Услуга",	 		"Услуга"), 			Неопределено));
	
	ПараметрыСхемы.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
	ПараметрыСхемы.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	РегистрыСведений.бестТарифныеКатегорииНП.ТарифнаяКатегорияЮЛ(Схема,ПараметрыСхемы,"");
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 	СтруктураОтбора.Организация);
	ПараметрыЗапроса.Вставить("Район", 			СтруктураОтбора.Район);
	ПараметрыЗапроса.Вставить("ОбъектРасчета", 	СтруктураОтбора.ОбъектРасчета);
	ПараметрыЗапроса.Вставить("Услуга", 		СтруктураОтбора.Услуга);
	ПараметрыЗапроса.Вставить("Период", 		СтруктураОтбора.Период);
	
	Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Выборка 						= Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.Вставить("ТарифнаяГруппа", 		Выборка.ТарифнаяКатегория);
		
		ПараметрыСхемы		= Новый Структура;
		Схема 							= Неопределено;
		ПараметрыВТ 					= Новый Массив;
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоответствиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Организация", 		"Организация"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоответствиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Район", 			"Район"), 			Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоответствиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ГруппаПотребителей","ГруппаПотребителей"), 		Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоответствиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Услуга",	 		"Услуга"), 			Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоответствиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Поставщик", 		"Поставщик"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоответствиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ТарифнаяЗона",	 	"ТарифнаяЗона"), 			Неопределено));
		
		ПараметрыСхемы.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
		ПараметрыСхемы.Вставить("ПараметрыВТ", 		ПараметрыВТ);
		
		
		РегистрыСведений.энргЗначенияТарифов.ЗначенияТарифов(Схема,ПараметрыСхемы,"");
		ПараметрыЗапроса 				= Новый Структура;
		ПараметрыЗапроса.Вставить("Организация", 	СтруктураОтбора.Организация);
		ПараметрыЗапроса.Вставить("Район", 			СтруктураОтбора.Район);
		ПараметрыЗапроса.Вставить("ГруппаПотребителей", 		Выборка.ТарифнаяКатегория);
		Если НЕ ЗначениеЗаполнено(СтруктураОтбора.ТарифнаяЗона) Тогда
			СтруктураОтбора.ТарифнаяЗона = Справочники.энргТарифныеЗоны.БезРазбивки;
		КонецЕсли;
		ПараметрыЗапроса.Вставить("ТарифнаяЗона", 	СтруктураОтбора.ТарифнаяЗона);
		ПараметрыЗапроса.Вставить("Услуга", 		СтруктураОтбора.Услуга);
		ПараметрыЗапроса.Вставить("Поставщик", 		СтруктураОтбора.Поставщик);
		ПараметрыЗапроса.Вставить("Период", 		СтруктураОтбора.Период);
		
		Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
		Выборка 						= Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтруктураОтбора.Вставить("ЗначениеТарифа", 	Выборка.Значение);
			СтруктураОтбора.Вставить("СтавкаНДС", 		Выборка.СтавкаНДС);
			СтруктураОтбора.Вставить("НДСВнутри", 		Выборка.НДСВнутри);
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(СтруктураОтбора.Организация, СтруктураОтбора.Район, СтруктураОтбора.Период,,СтруктураОтбора.ОбъектРасчета,СтруктураОтбора.ТочкаУчета,СтруктураОтбора.Услуга);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.Вставить("Договор", 	Выборка.Договор);
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.бестПоставщикиУслугНП.ПолучитьДанныеПоставщиков(СтруктураОтбора.Организация, СтруктураОтбора.Район, СтруктураОтбора.Период,,СтруктураОтбора.ТочкаУчета,СтруктураОтбора.Услуга);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.Вставить("Поставщик", 	Выборка.Поставщик);
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.бестПриборыТочекУчетаНП.ПолучитьДанныеПрибораУчета(СтруктураОтбора.Организация, СтруктураОтбора.Район, СтруктураОтбора.Период,,СтруктураОтбора.ОбъектРасчета,СтруктураОтбора.ТочкаУчета);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураОтбора.Вставить("ПриборУчета", 	Выборка.ПриборУчета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииПериодНачисленияПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериод()
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	ТекДанные.Период = Объект.Дата;
	ТекДанные.ПериодНачисления = НачалоМесяца(Объект.Дата);
	ТекДанные.ПериодРасчета = НачалоМесяца(Объект.Дата);
	ТекДанные.СтавкаНДС = ПолучитьНДСНаДатуНаСервере(ТекДанные.ПериодРасчета, Объект.Организация);
	ТекДанные.НачалоПериода = ТекДанные.ПериодНачисления;
	ТекДанные.КонецПериода  = НачалоМесяца(ДобавитьМесяц(ТекДанные.ПериодНачисления,1));
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетатьТариф(ТекДанные)
	
	Если ТекДанные.ЦеноваяКатегория <> Неопределено Тогда
		Если ТекДанные.ЦеноваяКатегория <> ЦеноваяКатегорияНаселение() Тогда
			ТекДанные.Тариф = ТекДанные.ТарифСредневзвешенный + ТекДанные.ТарифЗаСбытовуюНадбавку + ТекДанные.ТарифЗаУслугиПоПередачи + ТекДанные.ТарифНаИныеУслуги;
		Иначе
			ТекДанные.Тариф = ПолучитьТарифНаселениеНаСервере(Объект.Организация, ТекДанные.ПериодНачисления, ТекДанные.Поставщик, ТекДанные.ТарифнаяЗона, ТекДанные.ТарифнаяГруппа, ТекДанные.Услуга, Объект.Район);
			ТекДанные.НДСВнутри = Истина;
		КонецЕсли
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерерасчитатьСуммы()

	ТекДанные 							= Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	ТекДанные.Сумма 					= ТекДанные.Тариф * ТекДанные.ОбъемУслуги;
	
	Если ЗначениеЗаполнено(ТекДанные.НДСВнутри) Тогда
		Если НЕ ТекДанные.НДСВнутри Тогда
			ТекДанные.СуммаНДС 	= (ТекДанные.Сумма * ТекДанные.СтавкаНДС) / 100;
		Иначе
			ТекДанные.СуммаНДС 	= (ТекДанные.Сумма * ТекДанные.СтавкаНДС) / (100 + ТекДанные.СтавкаНДС);
		КонецЕсли;
	Иначе	
		Если ТекДанные.ЦеноваяКатегория <> Неопределено Тогда
			Если ТекДанные.ЦеноваяКатегория <> ЦеноваяКатегорияНаселение() Тогда
				ТекДанные.СуммаНДС 	= (ТекДанные.Сумма * ТекДанные.СтавкаНДС) / 100;
			Иначе
				ТекДанные.СуммаНДС 	= (ТекДанные.Сумма * ТекДанные.СтавкаНДС) / (100 + ТекДанные.СтавкаНДС);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТекДанные.СуммаСредневзвешенная 	= ТекДанные.ТарифСредневзвешенный * ТекДанные.ОбъемУслуги;
	ТекДанные.СуммаСредневзвешеннаяНДС 	= (ТекДанные.СуммаСредневзвешенная * ТекДанные.СтавкаНДС) / 100; 
	
	ТекДанные.СуммаЗаУслугиПоПередачи = ТекДанные.ТарифЗаУслугиПоПередачи * ТекДанные.ОбъемУслуги;
	ТекДанные.СуммаЗаУслугиПоПередачиНДС = (ТекДанные.СуммаЗаУслугиПоПередачи * ТекДанные.СтавкаНДС) / 100;
	
	ТекДанные.СуммаЗаСбытовуюНадбавку = ТекДанные.ТарифЗаСбытовуюНадбавку * ТекДанные.ОбъемУслуги;
	ТекДанные.СуммаЗаСбытовуюНадбавкуНДС = (ТекДанные.СуммаЗаСбытовуюНадбавку * ТекДанные.СтавкаНДС) / 100;
	
	ТекДанные.СуммаЗаИныеУслуги = ТекДанные.ТарифНаИныеУслуги * ТекДанные.ОбъемУслуги;
	ТекДанные.СуммаЗаИныеУслугиНДС = (ТекДанные.СуммаЗаИныеУслуги * ТекДанные.СтавкаНДС) / 100;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияТочкиУчета(ТекДанные)
	
	Если ТекДанные.ОбъектРасчета <> Неопределено Тогда

		ДанныеДляЗаполненияТЧ = ПолучитьДанныеДляЗаполненияТЧНаСервере(ТекДанные.ОбъектРасчета,ТекДанные.ТочкаУчета,ТекДанные.ПериодРасчета,ТекДанные.ПериодНачисления,ТекДанные.ПриборУчета);
		
		ТекДанные.ЦеноваяКатегория 					= ДанныеДляЗаполненияТЧ.ЦеноваяКатегория;
		ТекДанные.ТарифнаяГруппа 					=ДанныеДляЗаполненияТЧ.ТарифнаяКатегория;
		ТекДанные.ВидДифференцированности 		= ДанныеДляЗаполненияТЧ.ВидДифференцированности;

		УровеньНапряженияМощностьТочкаПоставки	= ПолучитьУровеньНапряженияРасчетныйМощностьТочкуПоставкиНаСервере(ТекДанные.ОбъектРасчета, ТекДанные.ТочкаУчета, ТекДанные.ПериодРасчета);
		ТекДанные.УровеньНапряженияРасчетный 		= УровеньНапряженияМощностьТочкаПоставки.УровеньНапряженияРасчетный;
		МаксМощность 								= УровеньНапряженияМощностьТочкаПоставки.МаксимальнаяМощность;
		ТекДанные.ТочкаПоставки 					= УровеньНапряженияМощностьТочкаПоставки.ТочкаПоставки;
		
		ЗаполнитьТарифСредневзвешенный(ТекДанные); // так как услуга заполняется при выборе точки учета
		ЗаполнитьТарифыНеНаселение(ТекДанные, МаксМощность);
		ПерерасчетатьТариф(ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТарифСредневзвешенный(ТекДанные)
	ТекДанные.ТарифСредневзвешенный = ПолучитьТарифСредневзвешенныйНаСервере(ТекДанные.ПериодНачисления, ТекДанные.Поставщик, ТекДанные.ТарифнаяЗона, ТекДанные.Услуга, ТекДанные.ЦеноваяКатегория, Объект.Район );
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТарифыНеНаселение(ТекДанные, МаксМощность)
	Если ТекДанные.ЦеноваяКатегория <> Неопределено Тогда
		Если ТекДанные.ЦеноваяКатегория <> ЦеноваяКатегорияНаселение() Тогда
			ТарифыНеНаселение = ПолучитьТарифыНеНаселениеНаСервере(МаксМощность, Объект.Организация, ТекДанные.ПериодРасчета, ТекДанные.Поставщик, ТекДанные.УровеньНапряженияРасчетный, ТекДанные.Услуга, ТекДанные.ЦеноваяКатегория, Объект.Район);
			ТекДанные.ТарифЗаСбытовуюНадбавку 	= ТарифыНеНаселение.ТарифЗаСбытовуюНадбавку;
			ТекДанные.ТарифЗаУслугиПоПередачи 		= ТарифыНеНаселение.ТарифЗаУслугиПоПередачи;
			ТекДанные.ТарифНаИныеУслуги 			= ТарифыНеНаселение.ТарифНаИныеУслуги;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвижениябестОбъемНачисленийЭлектроэнергииОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТекДанные = Элементы.ДвижениябестОбъемНачисленийЭлектроэнергии.ТекущиеДанные;
	Если ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда
		СтандартнаяОбработка = Ложь;
		
		ОписаниеОповещения 		= Новый ОписаниеОповещения("ОбъектРасчетаОкончаниеВыбора", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные));
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Район", Объект.Район);
		ПараметрыФормы.Вставить("Договор", Объект.Договор);
		ПараметрыФормы.Вставить("Период", Объект.Дата);
		
		ОткрытьФорму("Справочник.бестОбъектыРасчета.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаОкончаниеВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	
	Если Не РезультатЗакрытия = Неопределено Тогда 
		Модифицированность = Истина;
		ТекДанные = ДополнительныеПараметры.ТекДанные;
		ТекДанные.ОбъектРасчета = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦеноваяКатегорияНаселение()
	НаселениеКатегория = Перечисления.бестЦеновыеКатегории.Население; 
	Возврат НаселениеКатегория;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМКДНаСервере(ОбъектРасчета)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчета, "МКД");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТарифыНеНаселениеНаСервере(МаксМощность, Организация, ПериодРасчета, Поставщик, УровеньНапряженияРасчетный, Услуга, ЦеноваяКатегория, Район)
	
	Возврат Документы.бестПерерасчетЭЭ.ПолучитьТарифыНеНаселение(МаксМощность, Организация, ПериодРасчета, Поставщик, УровеньНапряженияРасчетный, Услуга, ЦеноваяКатегория, Район);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТарифСредневзвешенныйНаСервере(ПериодНачисления, Поставщик, ТарифнаяЗона, Услуга, ЦеноваяКатегория, Район )
	
	Возврат Документы.бестПерерасчетЭЭ.ПолучитьТарифСредневзвешенный(ПериодНачисления, Поставщик, ТарифнаяЗона, Услуга, ЦеноваяКатегория, Район);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТарифНаселениеНаСервере(Организация, ПериодНачисления, Поставщик, ТарифнаяЗона, ТарифнаяКатегория, Услуга, Район)

	ПараметрыСхемы		= Новый Структура;
	Схема 							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Организация",	 		"Организация"), 				Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Район",	 				"Район"), 					Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("ГруппаПотребителей", 	"ГруппаПотребителей"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("Услуга", 					"Услуга"), 					Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Поставщик", 				"Поставщик"), 				Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ТарифнаяЗона",	 		"ТарифнаяЗона"), 			Неопределено));
	
	ПараметрыСхемы.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
	ПараметрыСхемы.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	РегистрыСведений.энргЗначенияТарифов.ЗначенияТарифов(Схема,ПараметрыСхемы,"");
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 			Организация);
	ПараметрыЗапроса.Вставить("Район", 					Район);
	ПараметрыЗапроса.Вставить("ГруппаПотребителей", 	ТарифнаяКатегория);
	ПараметрыЗапроса.Вставить("Услуга", 					Услуга);
	ПараметрыЗапроса.Вставить("Поставщик", 				Поставщик); 
	ПараметрыЗапроса.Вставить("ТарифнаяЗона", 			ТарифнаяЗона);
	ПараметрыЗапроса.Вставить("Период", 					ПериодНачисления);
	
	Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Выборка 						= Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляЗаполненияТЧНаСервере(ОбъектРасчета, ТочкаУчета, ПериодРасчета, ПериодНачисления, ПриборУчета)
	
	Возврат Документы.бестПерерасчетЭЭ.ПолучитьДанныеДляЗаполненияТЧ(ОбъектРасчета, ТочкаУчета, ПериодРасчета, ПериодНачисления, ПриборУчета);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУровеньНапряженияРасчетныйМощностьТочкуПоставкиНаСервере(ОбъектРасчета, ТочкаУчета, ПериодРасчета)
	
	Возврат Документы.бестПерерасчетЭЭ.ПолучитьУровеньНапряженияРасчетныйМощностьТочкуПоставки(ОбъектРасчета, ТочкаУчета, ПериодРасчета);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНДСНаДатуНаСервере(ПериодРасчета, Организация)
	
	Возврат РегистрыСведений.бестСтавкиНДС.ПолучитьСтавкуНДС(ПериодРасчета, Организация);
	
КонецФункции

#КонецОбласти
