#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов	-	ТаблицаЗначений	-	состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		-	Структура.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			= "" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргБанкротство",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргБанкротство",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргБанкротство",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргБанкротство");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗадолженность(Объект, ДатаНач = Неопределено, ДатаОкон = Неопределено, Услуга = Неопределено, Поставщик = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления КАК ПериодЗадолженности,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
		|	СУММА(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) КАК СуммаСписания,
		|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик КАК Поставщик
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент
		|				И ПериодНачисления >= &ДатаНач
		|				И ПериодНачисления <= &ДатаОкон
		|				И МКД = &МКД
		|				И Услуга = &Услуга
		|				И Поставщик = &Поставщик) КАК энргВзаиморасчетыПоМесяцамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцамОстатки.ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга,
		|	энргВзаиморасчетыПоМесяцамОстатки.Поставщик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодЗадолженности,
		|	Услуга";
	
	Запрос.УстановитьПараметр("Абонент",	 Объект.Абонент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район",		 Объект.Район);
	Запрос.УстановитьПараметр("МКД",		 ?(Объект.Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД, Объект.Строение, Справочники.энргСтроения.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Период",		 Объект.Дата);
	Если ЗначениеЗаполнено(ДатаНач) Тогда
		Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Иначе
		Текст = СтрЗаменить(Текст, "И ПериодНачисления >= &ДатаНач", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкон) Тогда
		Запрос.УстановитьПараметр("ДатаОкон", ДатаОкон);
	Иначе
		Текст = СтрЗаменить(Текст, "И ПериодНачисления <= &ДатаОкон", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга", Услуга);
	Иначе
		Текст = СтрЗаменить(Текст, "И Услуга = &Услуга", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(Поставщик) Тогда
		Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Иначе
		Текст = СтрЗаменить(Текст, "И Поставщик = &Поставщик", "");
	КонецЕсли;
	
	Запрос.Текст = Текст;
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
КонецФункции

Функция ДанныеПоЗабалансовойЗадолженности(Объект, ДатаНач = Неопределено, ДатаОкон = Неопределено, Услуга = Неопределено, Поставщик = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Текст = 
		"ВЫБРАТЬ
		|	энргЗабалансоваяЗадолженностьОстатки.ПериодНачисления КАК ПериодЗадолженности,
		|	энргЗабалансоваяЗадолженностьОстатки.Услуга КАК Услуга,
		|	СУММА(энргЗабалансоваяЗадолженностьОстатки.СуммаЗадолженностиОстаток) КАК СуммаСписания,
		|	энргЗабалансоваяЗадолженностьОстатки.Поставщик КАК Поставщик
		|ИЗ
		|	РегистрНакопления.энргЗабалансоваяЗадолженность.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Абонент = &Абонент
		|				И ПериодНачисления >= &ДатаНач
		|				И ПериодНачисления <= &ДатаОкон
		|				И МКД = &МКД
		|				И Услуга = &Услуга
		|				И Поставщик = &Поставщик) КАК энргЗабалансоваяЗадолженностьОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗабалансоваяЗадолженностьОстатки.ПериодНачисления,
		|	энргЗабалансоваяЗадолженностьОстатки.Услуга,
		|	энргЗабалансоваяЗадолженностьОстатки.Поставщик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодЗадолженности,
		|	Услуга";
	
	Запрос.УстановитьПараметр("Абонент",	 Объект.Абонент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район",		 Объект.Район);
	Запрос.УстановитьПараметр("МКД",		 ?(Объект.Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД, Объект.Строение, Справочники.энргСтроения.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Период",		 Объект.Дата);
	Если ЗначениеЗаполнено(ДатаНач) Тогда
		Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Иначе
		Текст = СтрЗаменить(Текст, "И ПериодНачисления >= &ДатаНач", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкон) Тогда
		Запрос.УстановитьПараметр("ДатаОкон", ДатаОкон);
	Иначе
		Текст = СтрЗаменить(Текст, "И ПериодНачисления <= &ДатаОкон", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга", Услуга);
	Иначе
		Текст = СтрЗаменить(Текст, "И Услуга = &Услуга", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(Поставщик) Тогда
		Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Иначе
		Текст = СтрЗаменить(Текст, "И Поставщик = &Поставщик", "");
	КонецЕсли;
	
	Запрос.Текст = Текст;
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаВзаиморасчетыПоМесяцам(Схема, Регистры);		
	ДобавитьТекстЗапросаВзаиморасчеты(Схема, Регистры);		
	ДобавитьТекстЗапросаЗабалансоваяЗадолженность(Схема, Регистры);		
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("Строение", 						ДополнительныеСвойства.ДанныеСтроения.Строение);
	ПараметрыЗапроса.Вставить("МКД",	 						?(ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка() ,ДополнительныеСвойства.ДанныеСтроения.Строение));
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаВзаиморасчетыПоМесяцам(Схема, Регистры)
	
	ИмяРегистра = "энргВзаиморасчетыПоМесяцам";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргБанкротствоДанныеСписания.ПериодЗадолженности, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Абонент КАК Абонент,
	|	энргБанкротствоДанныеСписания.Услуга КАК Услуга,
	|	энргБанкротствоДанныеСписания.Поставщик КАК Поставщик,
	|	энргБанкротствоДанныеСписания.СуммаСписания КАК Сумма,
	|	&МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодРегистрации
	|ИЗ
	|	Документ.энргБанкротство.ДанныеСписания КАК энргБанкротствоДанныеСписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргБанкротство КАК Шапка
	|		ПО энргБанкротствоДанныеСписания.Ссылка = Шапка.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (энргБанкротствоДанныеСписания.Ссылка В (&мДокументы))
	|			И (НЕ энргБанкротствоДанныеСписания.СуммаСписания = 0)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВзаиморасчеты(Схема, Регистры)
	
	ИмяРегистра = "энргВзаиморасчеты";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргБанкротствоДанныеСписания.ПериодЗадолженности, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Абонент КАК Абонент,
	|	энргБанкротствоДанныеСписания.Услуга КАК Услуга,
	|	энргБанкротствоДанныеСписания.Поставщик КАК Поставщик,
	|	энргБанкротствоДанныеСписания.СуммаСписания КАК Сумма,
	|	&МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ КАК ВидДвижения
	|ИЗ
	|	Документ.энргБанкротство.ДанныеСписания КАК энргБанкротствоДанныеСписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргБанкротство КАК Шапка
	|		ПО энргБанкротствоДанныеСписания.Ссылка = Шапка.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (энргБанкротствоДанныеСписания.Ссылка В (&мДокументы))
	|			И (НЕ энргБанкротствоДанныеСписания.СуммаСписания = 0)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗабалансоваяЗадолженность(Схема, Регистры)
	
	ИмяРегистра = "энргЗабалансоваяЗадолженность";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргБанкротствоДанныеСписания.ПериодЗадолженности, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.Дата КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Абонент КАК Абонент,
	|	энргБанкротствоДанныеСписания.Услуга КАК Услуга,
	|	энргБанкротствоДанныеСписания.Поставщик КАК Поставщик,
	|	энргБанкротствоДанныеСписания.СуммаСписания КАК СуммаЗадолженности,
	|	&МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.МораторнаяЗадолженность) КАК ВидЗадолженности
	|ИЗ
	|	Документ.энргБанкротство.ДанныеСписания КАК энргБанкротствоДанныеСписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргБанкротство КАК Шапка
	|		ПО энргБанкротствоДанныеСписания.Ссылка = Шапка.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (энргБанкротствоДанныеСписания.Ссылка В (&мДокументы))
	|			И (НЕ энргБанкротствоДанныеСписания.СуммаСписания = 0)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли