#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва данные оплаты.
//
Процедура ДанныеОплаты() Экспорт 
	
	ГраницыПериода  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, Ссылка);
	Запрос.УстановитьПараметр("ЧастныйСектор"	, ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор);
	
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	СУММА(энргБанкротствоДанныеСписания.СуммаСписания) КАК СуммаОплаты,
	|	энргБанкротствоДанныеСписания.ПериодЗадолженности КАК ПериодОплатыНачало,
	|	ВЫБОР
	|		КОГДА энргБанкротство.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОплата,
	|	энргБанкротство.Организация КАК Организация,
	|	энргБанкротствоДанныеСписания.ПериодЗадолженности КАК ПериодНачисления,
	|	энргБанкротство.Район КАК Район,
	|	ВЫБОР
	|		КОГДА &ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргБанкротство.Строение
	|	КОНЕЦ КАК МКД,
	|	энргБанкротство.Абонент КАК Абонент,
	|	энргБанкротство.Дата КАК Дата,
	|	энргБанкротство.Дата КАК ПериодРегистрации
	|ИЗ
	|	Документ.энргБанкротство.ДанныеСписания КАК энргБанкротствоДанныеСписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргБанкротство КАК энргБанкротство
	|		ПО энргБанкротствоДанныеСписания.Ссылка = энргБанкротство.Ссылка
	|ГДЕ
	|	энргБанкротство.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргБанкротствоДанныеСписания.ПериодЗадолженности,
	|	энргБанкротство.Район,
	|	энргБанкротство.Дата,
	|	энргБанкротство.Организация,
	|	энргБанкротство.Абонент,
	|	ВЫБОР
	|		КОГДА энргБанкротство.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргБанкротство.Строение
	|	КОНЕЦ,
	|	энргБанкротствоДанныеСписания.ПериодЗадолженности,
	|	энргБанкротство.Дата
	|
	|ИМЕЮЩИЕ
	|	СУММА(энргБанкротствоДанныеСписания.СуммаСписания) <> 0";
		
	ДополнительныеСвойства.Вставить("ДанныеОплаты", Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ПериодНачисления = НачалоМесяца(Дата);
	
	ДополнительныеСвойства.Вставить("Кассир"				, Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления"	, Справочники.энргИсточникиПоступления.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ГруппаАбонентов"		, ЗначениеЗаполнено(Абонент));
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	энргПроведениеСервер.ПрочитатьДанныеСтроения(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ВидОперации = Перечисления.энргВидыОпераций.энргБанкротство_ВосстановлениеИзЗабалансаФЛ
		ИЛИ ВидОперации = Перечисления.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ Тогда
		
		ДанныеОплаты();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы.энргБанкротство.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	РезультатЗарегистрированныеБанкроты = ПолучитьДанныеБанкротов();
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗарегистрированныеБанкроты, Движения.энргБанкроты);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеБанкротов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргБанкротство.Организация КАК Организация,
		|	энргБанкротство.Район КАК Район,
		|	энргБанкротство.Абонент КАК Абонент,
		|	энргБанкротство.Дата КАК Период,
		|	энргБанкротство.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ) КАК ПризнанБанкротом
		|ИЗ
		|	Документ.энргБанкротство КАК энргБанкротство
		|ГДЕ
		|	энргБанкротство.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли