#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПользователиКлиентСервер.АвторизованныйПользователь();
	КонецЕсли;
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	// Заполнение вспомогательного ревизита "Последняя дата погашения задолженности"
	ПоследняяДатаПогашенияЗадолженности = Неопределено;
	Для каждого СтрокаТЧ Из ПланПогашенияЗадолженности Цикл
		ПоследняяДатаПогашенияЗадолженности = Макс(ПоследняяДатаПогашенияЗадолженности, СтрокаТЧ.Дата);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.энргЗадачаПИД") Тогда
		Абонент = ДанныеЗаполнения.Абонент;
		Организация = ДанныеЗаполнения.Организация;
		Район = ДанныеЗаполнения.Район;
		Основание = ДанныеЗаполнения;
		ВидОперации = Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ;
	КонецЕсли;
	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ЗаполнитьРеструктуризациюДолга();
	
	ЗаполнитьДокументыРеструктуризации();
	
	СписатьНаЗабаланс();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеструктуризациюДолга()
	
	СуммаНарастающимИтогом = 0;
	ПредыдущаяДата = Дата;
	
	Если ВидОперации = Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ Тогда
		
		Для каждого Строка Из ПланПогашенияЗадолженности Цикл
			
			СуммаНарастающимИтогом = СуммаНарастающимИтогом + Строка.Сумма;
			
			Запись = Движения.энргРеструктуризацияДолга.Добавить();
			Запись.Период = Дата;
			Запись.Организация = Организация;
			Запись.Район = Район;
			Запись.Строение = Строение;
			Запись.Абонент = Абонент;
			Запись.ДатаОплаты = КонецДня(Строка.Дата);
			Запись.Документ = Ссылка;
			Запись.Сумма = Строка.Сумма;
			Запись.СуммаНарастающимИтогом = СуммаНарастающимИтогом;
			Запись.СуммаОбщая = СуммаКРаспределению;
			Запись.ДатаНачала = Дата;
			Запись.ДатаПредыдущегоЭтапа = ПредыдущаяДата;
			
			ПредыдущаяДата = Запись.ДатаОплаты;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДокументыРеструктуризации()
	
	Если ВидОперации = Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Дата КАК Период,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Ссылка КАК ДокументРеструктуризации,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Документ КАК ДокументРасходов,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Услуга КАК Услуга,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Поставщик КАК Поставщик,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Сумма КАК Сумма
		|ИЗ
		|	Документ.энргСоглашениеПоРассрочке.ТекущиеЗадолженности КАК энргСоглашениеПоРассрочкеТекущиеЗадолженности
		|ГДЕ
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Ссылка = &Ссылка
		|	И энргСоглашениеПоРассрочкеТекущиеЗадолженности.Отметка";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Запись = Движения.энргДокументыРеструктуризации.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СписатьНаЗабаланс()
	
	Если ВидОперации = Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Услуга КАК Услуга,
		|	СУММА(энргСоглашениеПоРассрочкеТекущиеЗадолженности.Сумма) КАК Сумма,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Поставщик КАК Поставщик
		|ИЗ
		|	Документ.энргСоглашениеПоРассрочке.ТекущиеЗадолженности КАК энргСоглашениеПоРассрочкеТекущиеЗадолженности
		|ГДЕ
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Ссылка = &Ссылка
		|	И энргСоглашениеПоРассрочкеТекущиеЗадолженности.Отметка
		|
		|СГРУППИРОВАТЬ ПО
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.ПериодНачисления,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Услуга,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Поставщик";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			//Запись  					= Движения.энргВзаиморасчетыПоМесяцам.ДобавитьРасход();
			//Запись.Период 				= Дата;
			//Запись.Организация			= Организация;
			//Запись.Район 				= Район;
			//Запись.МКД 					= Строение;
			//Запись.Абонент				= Абонент;
			//Запись.Услуга				= ВыборкаДетальныеЗаписи.Услуга;
			//Запись.ПериодНачисления		= ВыборкаДетальныеЗаписи.ПериодНачисления;
			//Запись.Поставщик			= ВыборкаДетальныеЗаписи.Поставщик;
			//Запись.Сумма				= ВыборкаДетальныеЗаписи.Сумма;
			//
			Запись  					= Движения.энргЗабалансоваяЗадолженность.ДобавитьПриход();
			Запись.Период 				= Дата;
			Запись.Организация			= Организация;
			Запись.Район 				= Район;
			Запись.МКД 					= Строение;
			Запись.Абонент				= Абонент;
			Запись.ПериодНачисления		= ВыборкаДетальныеЗаписи.ПериодНачисления;
			Запись.Услуга				= ВыборкаДетальныеЗаписи.Услуга;
			Запись.СуммаЗадолженности 	= ВыборкаДетальныеЗаписи.Сумма;
			Запись.ВидЗадолженности		= Перечисления.энргВидыЗадолженности.РеструктуризированнаяЗадолженность;
			Запись.Поставщик			= ВыборкаДетальныеЗаписи.Поставщик;
			
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&Абонент КАК Абонент,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.ПериодНачисления КАК ПериодНачисления,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Услуга КАК Услуга,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Поставщик КАК Поставщик,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Сумма КАК Сумма
		|ИЗ
		|	Документ.энргСоглашениеПоРассрочке.ТекущиеЗадолженности КАК энргСоглашениеПоРассрочкеТекущиеЗадолженности
		|ГДЕ
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.ПериодНачисления,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Услуга,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Поставщик,
		|	энргСоглашениеПоРассрочкеТекущиеЗадолженности.Сумма";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТекущаяДата", Дата);
		Запрос.УстановитьПараметр("Абонент", Абонент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
			Запись  					= Движения.энргЗабалансоваяЗадолженность.ДобавитьРасход();
			Запись.Период 				= Дата;
			Запись.Организация			= Организация;
			Запись.Район 				= Район;
			Запись.МКД 					= Строение;
			Запись.Абонент				= Абонент;
			Запись.ПериодНачисления		= ВыборкаДетальныеЗаписи.ПериодНачисления;
			Запись.Услуга				= ВыборкаДетальныеЗаписи.Услуга;
			Запись.СуммаЗадолженности 	= ВыборкаДетальныеЗаписи.Сумма;
			Запись.ВидЗадолженности		= Перечисления.энргВидыЗадолженности.РеструктуризированнаяЗадолженность;
			Запись.Поставщик			= ВыборкаДетальныеЗаписи.Поставщик;
			
			//Запись  					= Движения.энргВзаиморасчетыПоМесяцам.ДобавитьПриход();
			//Запись.Период 				= Дата;
			//Запись.Организация			= Организация;
			//Запись.Район 				= Район;
			//Запись.МКД 					= Строение;
			//Запись.Абонент				= Абонент;
			//Запись.Услуга				= ВыборкаДетальныеЗаписи.Услуга;
			//Запись.ПериодНачисления		= ВыборкаДетальныеЗаписи.ПериодНачисления;
			//Запись.Поставщик			= ВыборкаДетальныеЗаписи.Поставщик;
			//Запись.Сумма				= ВыборкаДетальныеЗаписи.Сумма;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли