
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДокумент  = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли;
	Если ЗаполнитьДокумент Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("ДопЗначенияЗаполнения") Тогда
			ДопЗначенияЗаполнения = Параметры.ЗначенияЗаполнения.ДопЗначенияЗаполнения;
			Если ДопЗначенияЗаполнения <> Неопределено 
					И ДопЗначенияЗаполнения.Свойство("МассивТП") Тогда 
				МассивТП = ДопЗначенияЗаполнения.МассивТП;
				Для Каждого ТП Из МассивТП Цикл
					СтрокаТП = Объект.ТочкиПоставки.Добавить();
					СтрокаТП.ТочкаПоставки = ТП;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#Конецобласти
