#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуБанковскиеРеквизиты(Схема,ПараметрыСхемы,ТаблицаДляПомещения) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаБансковскиеРеквизиты());	
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
	ОтборСхемы 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Отбор;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаБансковскиеРеквизиты()
	
	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НомерСчета КАК НомерСчета,
	|	КлассификаторБанков.Код КАК БИК
	|ИЗ
	|	(ВЫБРАТЬ
	|		Организации.Ссылка КАК Организация,
	|		БанковскиеСчета.НомерСчета КАК НомерСчета,
	|		БанковскиеСчета.Банк КАК Банк
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|	ГДЕ
	|		Организации.Ссылка = &Организация) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО ВложенныйЗапрос.Банк = КлассификаторБанков.Ссылка";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли