#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Район", Параметры.Район);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если СтрокаСписка <> Неопределено Тогда
		Закрыть(ЗадолженностьПоДоговору(СтрокаСписка.Организация, СтрокаСписка.Район, СтрокаСписка.Договор));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗадолженностьПоДоговору(Организация, Район, Договор)
	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестЗадолженностьПоРешениюСудаОстатки.Договор КАК Договор,
		|	бестЗадолженностьПоРешениюСудаОстатки.ПериодНачисления КАК ПериодНачисления,
		|	бестЗадолженностьПоРешениюСудаОстатки.ВидДолга КАК ВидДолга,
		|	бестЗадолженностьПоРешениюСудаОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.бестЗадолженностьПоРешениюСуда.Остатки(
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестЗадолженностьПоРешениюСудаОстатки";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = Новый Структура("Договор, ПериодНачисления, ВидДолга, Сумма");
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
		
		Результат.Добавить(СтрокаТЗ);
	КонецЦикла;

	Возврат Результат;
КонецФункции

#КонецОбласти
