#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргРегистрацияВременногоОтсутствия",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргРегистрацияВременногоОтсутствия");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДобавитьЗаписиПриОтсутствииВГраницеТекущегоПериода(ТаблицаДней, ДопПараметры) Экспорт
	ГраницыНачалаПериодаНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(ДопПараметры.Организация, ДопПараметры.Район, ДопПараметры.НачалоПериодаНачислений, Ложь);		
	ПериодС                         	= ДопПараметры.ПериодС;
	ПериодПо                        	= ДопПараметры.ПериодПо; 	
	
	НоваяСтрока 						= ТаблицаДней.Добавить();
	НоваяСтрока.ПериодНачисления 		= ДопПараметры.НачалоПериодаНачислений;
	
	ДниПервогоПериод 					= РассчитатьКолвоДней(ПериодС, ГраницыНачалаПериодаНачисления.НачалоОП);
	ДниВторогоПериода 					= РассчитатьКолвоДней(ГраницыНачалаПериодаНачисления.ЗавершениеОП, НачалоДня((КонецДня(ПериодПо) + 1)));
	
	Если ПериодС = ДопПараметры.ПериодС И ПериодПо = ДопПараметры.ПериодС Тогда
		НоваяСтрока.КоличествоДнейРаботы 	= 	ГраницыНачалаПериодаНачисления.ДнейВПериоде;
	Иначе
		НоваяСтрока.КоличествоДнейРаботы 	= ДниПервогоПериод + ДниВторогоПериода;
	КонецЕсли;
КонецФункции

Функция ДобавитьЗаписиПриОтсутствииБольшеОдногоПериодаНачислений(ТаблицаДней, ДопПараметры, ПерваяСтрока) Экспорт
	
	Организация						= ДопПараметры.Организация;
	Район 							= ДопПараметры.Район;
	ПериодС                         = ДопПараметры.ПериодС;
	ПериодПо                        = ДопПараметры.ПериодПо;
	НачалоПериодаНачислений 		= ДопПараметры.НачалоПериодаНачислений;
	КонецПериодаНачислений 			= ДопПараметры.КонецПериодаНачислений;	
	
	ГраницыНачалаПериодаНачисления 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, НачалоПериодаНачислений, Ложь);
	
	НоваяСтрока 					= ТаблицаДней.Добавить();
	НоваяСтрока.ПериодНачисления 	= НачалоПериодаНачислений;	
	НоваяСтрока.ДнейВПериоде		= ГраницыНачалаПериодаНачисления.ДнейВПериоде;
	
	Если ПерваяСтрока Тогда
		//ГраницыНачалаПериодаНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, НачалоПериодаНачислений, Ложь);
		НоваяСтрока.КоличествоДнейРаботы 	= РассчитатьКолвоДней(ПериодС, ГраницыНачалаПериодаНачисления.НачалоОП);
		ПерваяСтрока 						= Ложь;
	ИначеЕсли НачалоПериодаНачислений = КонецПериодаНачислений Тогда 
		//ГраницыНачалаПериодаНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, НачалоПериодаНачислений, Ложь);
		НоваяСтрока.КоличествоДнейРаботы 	= РассчитатьКолвоДней(ГраницыНачалаПериодаНачисления.ЗавершениеОП, НачалоДня((КонецДня(ПериодПо) + 1)));
	Иначе 
		НоваяСтрока.КоличествоДнейРаботы 	= 0;
	КонецЕсли;
	
КонецФункции

Функция РассчитатьКолвоДней(ПерваяДата, ВтораяДата) Экспорт
	Возврат (ПерваяДата - ВтораяДата) / 86400;
КонецФункции

#Область ПолучениеТекстаЗапросов

Функция ПолучитьДокументСрезПоследнего(Абонент, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргРегистрацияВременногоОтсутствия.Ссылка КАК Ссылка,
		|	энргРегистрацияВременногоОтсутствия.ПериодС КАК ПериодС,
		|	энргРегистрацияВременногоОтсутствия.ПериодПо КАК ПериодПо
		|ИЗ
		|	Документ.энргРегистрацияВременногоОтсутствия КАК энргРегистрацияВременногоОтсутствия
		|ГДЕ
		|	энргРегистрацияВременногоОтсутствия.Проведен
		|	И энргРегистрацияВременногоОтсутствия.Абонент = &Абонент
		|	И энргРегистрацияВременногоОтсутствия.Дата <= &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	энргРегистрацияВременногоОтсутствия.Дата УБЫВ,
		|	Ссылка УБЫВ"; 	
	Запрос.УстановитьПараметр("Абонент" , Абонент);
	Запрос.УстановитьПараметр("Дата"	, Дата);
	РезультатЗапроса = Запрос.Выполнить();  	
	Возврат РезультатЗапроса;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли