#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);		
	КонецЕсли; 			

	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	ОбновитьКолонкуСуммуОстатка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПраваДокументаПерерасчет(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если не Объект.ПометкаУдаления Тогда
		ПроверитьСуммыНаКорректность(Отказ, ТекущийОбъект);	
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СоздатьОбновитьРКО(ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьКолонкуСуммуОстатка();
	ПоказатьФормуРКО(ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	ОчиститьТаблицы();
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПодборОплаты(Команда)
	
	мАбоненты  				= Новый Массив;
	Для Каждого СтрокаАбонента Из Объект.Помещения Цикл
		мАбоненты.Добавить(СтрокаАбонента.Абонент);
	КонецЦикла;
	
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ПодборОплатыАбонентаЗавершение",ЭтаФорма);
	ПараметрыОплаты  		= Новый Структура;
	ПараметрыОплаты.Вставить("Абонент", Объект.Абонент);
	ПараметрыОплаты.Вставить("Ссылка", Объект.Ссылка);
	ОткрытьФорму("Обработка.энргЖурналОплатыАбонента.Форма.Форма",ПараметрыОплаты,,,,,ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовОплат(Команда)
	
	Если Объект.КорректировкаОплаты.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ оплаты уже выбран");
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ПодборДокументовОплатЗавершение", ЭтаФорма);
	ПараметрыОплаты  		= Новый Структура("Дата, Организация, Район, Абонент, ТекущийДокумент", Объект.Дата, Объект.Организация, Объект.Район, Объект.Абонент, Объект.Ссылка);
	ОткрытьФорму("Обработка.энргЖурналОплатыАбонента.Форма.ФормаПодбораДокументовОплаты", ПараметрыОплаты,,,,, ОповещениеЗавершения);
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработкиОповещения

&НаКлиенте
Процедура ПодборОплатыАбонентаЗавершение(Результат,ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Сч = 0 По Результат.ВГраница() Цикл
			СтрокаКорректироки 						= Объект.КорректировкаОплаты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКорректироки,Результат[Сч]);
			СтрокаКорректироки.СуммаБыло  			= Результат[Сч].СуммаОплаты;
			СтрокаКорректироки.УслугаБыло  			= Результат[Сч].Услуга;
			СтрокаКорректироки.ПоставщикБыло  		= Результат[Сч].Поставщик;
			СтрокаКорректироки.ПериодНачисленияБыло = Результат[Сч].ПериодОплаты;
			СтрокаКорректироки.АбонентБыло			= Результат[Сч].Абонент;
			СтрокаКорректироки.IDСтроки             = Новый УникальныйИдентификатор;
			
			ЗаполнитьЗадолженностиПоДокументуОплаты(СтрокаКорректироки.ДокументОплаты, СтрокаКорректироки.IDСтроки);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовОплатЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументовОплат 		= Результат.МассивДокументовОплат;
	СоответствиеРаспределения	= Результат.СоответствиеРаспределения;
	Для Сч = 0 По МассивДокументовОплат.ВГраница() Цикл
		СтрокаДокументаОплаты 					= МассивДокументовОплат[Сч];
		Если Объект.КорректировкаОплаты.НайтиСтроки(Новый Структура("ДокументОплаты,Разделитель", СтрокаДокументаОплаты.ДокументОплаты,СтрокаДокументаОплаты.Разделитель)).Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ: " + СтрокаДокументаОплаты.ДокументОплаты + " уже добавлен");
			Продолжить;
		КонецЕсли;			
		
		СтрокаКорректировки 						= Объект.КорректировкаОплаты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКорректировки, СтрокаДокументаОплаты);
		СтрокаКорректировки.СуммаБыло  			= СтрокаДокументаОплаты.Сумма;		
		//СтрокаКорректироки.АбонентБыло			= Объект.Абонент;
		СтрокаКорректировки.IDСтроки             = Новый УникальныйИдентификатор;
		
		МассивРаспределения = СоответствиеРаспределения[СтрокаДокументаОплаты.ДокументОплаты];
		Если МассивРаспределения = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		Для Каждого ТекСтрокаРаспределения из МассивРаспределения Цикл 
			СтрокаРаспределения = Объект.ЗадолженностьБыла.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРаспределения, ТекСтрокаРаспределения);	
			СтрокаРаспределения.IDСтрокиКорректировкаБыло = СтрокаКорректировки.IDСтроки;
		КонецЦикла;	
		
	КонецЦикла;
	
	ОбновитьКолонкуСуммуОстатка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Объект.ИсточникПоступления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан Источник поступления!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗадолженностиПоДокументуОплаты(ДокументОплаты, IDСтроки)
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие") Тогда
		Для каждого стр из ДокументОплаты.Задолженность Цикл
			НовСтр = Объект.ЗадолженностьБыла.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, стр);
			НовСтр.IDСтрокиКорректировкаБыло = IDСтроки;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.энргПриходныйКассовыйОрдер") Тогда
		Для каждого стр из ДокументОплаты.Услуги Цикл
			НовСтр = Объект.ЗадолженностьБыла.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, стр);
			НовСтр.СуммаОплаты = стр.Оплачено;
			НовСтр.IDСтрокиКорректировкаБыло = IDСтроки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицы()
	Объект.КорректировкаОплаты.Очистить();
	Объект.ЗадолженностьБыла.Очистить();
	Объект.КорректировкаОплатыСтало.Очистить();
	Объект.ЗадолженностьСтала.Очистить();
КонецПроцедуры

&НаСервере
Функция ПроверитьСуммыНаКорректность(Отказ, ТекущийОбъект)
	МассивОшибок = Новый Массив;

	ОбщаяСуммаОплаты 		= 0;
	ОбщаяСуммаВозврата 		= 0;
	ОбщаяСуммаРаспределения = 0;	
	
	Для Каждого ТекСтрока из ТекущийОбъект.КорректировкаОплаты Цикл 
		Если ТекСтрока.СуммаБыло < ТекСтрока.СуммаВозврата Тогда
			МассивОшибок.Добавить("В платежных документах в строке №" + ТекСтрока.НомерСтроки + " сумма оплаты меньше суммы возврата");		
		КонецЕсли;
			
		СуммаРаспределения 			= 0;
		МассивСтрокРаспределения 	= ТекущийОбъект.КорректировкаОплатыСтало.НайтиСтроки(Новый Структура("IDСтрокиКорректировкаБыло", ТекСтрока.IDСтроки));
		Для каждого СтрокаРаспределения Из МассивСтрокРаспределения Цикл
			СуммаРаспределения 			= СуммаРаспределения + СтрокаРаспределения.Сумма;
				
			СуммаРаспределенияПоУслугам = ТекущийОбъект.ЗадолженностьСтала.Выгрузить(Новый Структура("IDСтрокиКорректировкаСтала", СтрокаРаспределения.IDСтроки), "СуммаОплаты").Итог("СуммаОплаты");
			
			Если СтрокаРаспределения.Сумма <  СуммаРаспределенияПоУслугам Тогда
				МассивОшибок.Добавить("В таблице переноса в строке №" + СтрокаРаспределения.НомерСтроки + " сумма распределения по услугам превышает сумму к распределению");		
			КонецЕсли;
		КонецЦикла;
		
		Если (ТекСтрока.СуммаБыло - ТекСтрока.СуммаВозврата) - СуммаРаспределения < 0 Тогда
			МассивОшибок.Добавить("В платежных документах в строке №" + ТекСтрока.НомерСтроки + " сумма распределения превышает сумму оплаты по документу");		
		КонецЕсли;			
		
		ОбщаяСуммаОплаты 		= ОбщаяСуммаОплаты + ТекСтрока.СуммаБыло;
		ОбщаяСуммаВозврата 		= ОбщаяСуммаВозврата + ТекСтрока.СуммаВозврата;
		ОбщаяСуммаРаспределения = ОбщаяСуммаРаспределения + СуммаРаспределения;
	КонецЦикла;
	
	Если ОбщаяСуммаОплаты - ОбщаяСуммаВозврата - ОбщаяСуммаРаспределения > 0 Тогда
		МассивОшибок.Добавить("Общая сумма оплаты распределена не полностью");		
	КонецЕсли; 
	
	Если МассивОшибок.Количество()> 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивОшибок, ". "));
		Отказ = Истина;
	КонецЕсли; 	
КонецФункции

&НаСервере
Процедура ОбновитьКолонкуСуммуОстатка()
	
	Для Каждого ТекСтрока из Объект.КорректировкаОплаты Цикл	
		ОтборСтрок 				= Новый Структура("IDСтрокиКорректировкаБыло", ТекСтрока.IDСтроки);
		СуммаРаспределения 		= Объект.КорректировкаОплатыСтало.Выгрузить(ОтборСтрок, "Сумма").Итог("Сумма");		
		ТекСтрока.СуммаОстатка 	= ТекСтрока.СуммаБыло - ТекСтрока.СуммаВозврата - СуммаРаспределения;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбновитьРКО(ТекущийОбъект, ДополнительныеПараметры)
	СуммаВозврата = 0;
	Для Каждого ТекСтрока Из ТекущийОбъект.КорректировкаОплаты Цикл 
		СуммаВозврата = СуммаВозврата + ТекСтрока.СуммаВозврата;
	КонецЦикла;
	
	НайденныйРКО 	= Документы.энргПерерасчет.ПолучитьСвязанныйРКО(ТекущийОбъект.Ссылка);
	ЕстьДокумент	= Ложь;
	Если НайденныйРКО = Неопределено Тогда
		Если СуммаВозврата > 0 Тогда 
			ДокументРКО = Документы.энргРасходныйКассовыйОрдер.СоздатьДокумент();
			ДокументРКО.Дата 				= ТекущийОбъект.Дата;
			ДокументРКО.ДокументОснование 	= ТекущийОбъект.Ссылка;
			ДокументРКО.Сумма 				= СуммаВозврата;
			
			ЕстьДокумент					= Истина;
		КонецЕсли; 		
		
	Иначе
		ДокументРКО		 				= НайденныйРКО.ПолучитьОбъект();
		ДокументРКО.Сумма 				= СуммаВозврата;
		ЕстьДокумент					= Истина;
	КонецЕсли;
	
	ДанныеПерерасчета = ВводНаОснованииБиллингВызовСервера.ДанныеДляЗаполненияРасходныйКассовыйОрдерНаОсновании(ТекущийОбъект.Ссылка); 
	
	Если ЕстьДокумент Тогда 
		ЗаполнитьЗначенияСвойств(ДокументРКО, ДанныеПерерасчета);
		Попытка
			Если СуммаВозврата = 0 Тогда 
				Если ДокументРКО.Проведен Тогда
					ДокументРКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Иначе 
				ДокументРКО.Записать();
				ДополнительныеПараметры.Вставить("РКО", ДокументРКО.Ссылка);
			КонецЕсли; 			
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуРКО(ДополнительныеПараметры)
		
	Если ДополнительныеПараметры.Свойство("РКО") Тогда
		ОткрытьЗначение(ДополнительныеПараметры.РКО);
	КонецЕсли;			
	
КонецПроцедуры

&НаСервере 
Процедура ПроверитьПраваДокументаПерерасчет(Отказ) 
	
	ЕстьПравоЧтение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Чтение"); 
	ЕстьПравоИзменение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Изменение");
	Если Не ЕстьПравоИзменение И (Не ЕстьПравоЧтение Или ЕстьПравоЧтение И Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		Отказ = Истина;
		ВызватьИсключение "Нарушение прав доступа";
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр = ЕстьПравоЧтение И Не ЕстьПравоИзменение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КорректировкаОплатыПодборДокументовОплат", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КорректировкаОплатыПодборОплаты", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОсновании", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);	
КонецПроцедуры
	
#КонецОбласти

#Область СобытияТЧКорректировкаОплаты

&НаКлиенте
Процедура КорректировкаОплатыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.КорректировкаОплаты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ЗадолженностьБыла,Неопределено,ТекДанные.IDСтроки,,"КорректировкаБыло");
	//энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.КорректировкаОплатыСтало,Неопределено,ТекДанные.IDСтроки,,"КорректировкаБыло");
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОплатыПередУдалением(Элемент, Отказ)
	IDСтроки = Элементы.КорректировкаОплаты.ТекущиеДанные.IDСтроки;
	ОчиститьСвязанныеТаблицы(IDСтроки);
КонецПроцедуры

&НаСервере
Процедура ОчиститьСвязанныеТаблицы(IDСтроки)
	Объект.ЗадолженностьБыла.Очистить();
	Объект.КорректировкаОплатыСтало.Очистить();
	Объект.ЗадолженностьСтала.Очистить();	
	//Отбор = Новый Структура("IDСтрокиКорректировкаБыло", IDСтроки);
	//
	//энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ЗадолженностьБыла, Отбор);
	//энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ЗадолженностьСтала, Отбор);
	//энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.КорректировкаОплатыСтало, Отбор);
КонецПроцедуры


&НаКлиенте
Процедура КорректировкаОплатыСуммаВозвратаПриИзменении(Элемент)
	ОбновитьКолонкуСуммуОстатка();
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧКорректировкаОплатыСтало

&НаКлиенте
Процедура КорректировкаОплатыСталоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ДанныеДокументовОплаты = Элементы.КорректировкаОплаты.ТекущиеДанные;
	Если ДанныеДокументовОплаты = Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите документ оплаты");
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные 								= Элементы["КорректировкаОплатыСтало"].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки						= Новый УникальныйИдентификатор;
		ТекущиеДанные.IDСтрокиКорректировкаБыло		= ДанныеДокументовОплаты.IDСтроки;
		ТекущиеДанные.ДокументОплаты				= ДанныеДокументовОплаты.ДокументОплаты;
	КонецЕсли;
	
	КорректировкаОплатыСталоПриАктивизацииСтроки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОплатыСталоПередУдалением(Элемент, Отказ)
	ТекДанные 	= Элементы.КорректировкаОплатыСтало.ТекущиеДанные;
	УдалитьСтрокиЗадолженностьСталаПоIDСтроки(ТекДанные.IDСтроки);
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиЗадолженностьСталаПоIDСтроки(IDСтроки)
	Отбор 		= Новый Структура("IDСтрокиКорректировкаСтала", IDСтроки);	
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ЗадолженностьСтала, Отбор);
КонецПроцедуры


&НаКлиенте
Процедура КорректировкаОплатыСталоПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.КорректировкаОплатыСтало.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ЗадолженностьСтала,Неопределено,ТекДанные.IDСтроки,,"КорректировкаСтала");
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОплатыСталоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ДанныеДокументовОплаты = Элементы.КорректировкаОплаты.ТекущиеДанные;
	Если ДанныеДокументовОплаты = Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите документ оплаты");
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КорректировкаОплатыСталоАбонентСталоПриИзменении(Элемент)
	ТекДанные 	= Элементы.КорректировкаОплатыСтало.ТекущиеДанные;
	Абонент		= ТекДанные.Абонент;
	Если АбонентДобавлен(Абонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Абонент уже выбран");
		ТекДанные.Абонент = ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка");
		Возврат;
	КонецЕсли;            	
	
	ДанныеАбонента  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();		
	ДанныеАбонента.Удалить("Абонент");
	ДанныеАбонента.Вставить("IDСтрокиКорректировкаСтала", ТекДанные.IDСтроки);
	
	ЗаполнитьДанныеДляОплатыАбонента(Абонент, ДанныеАбонента);
	ДополнитьДаннымиРаспределенияДокументаОплаты(Абонент, ДанныеАбонента);
КонецПроцедуры

&НаСервере
Функция АбонентДобавлен(Абонент)
	Возврат Объект.КорректировкаОплатыСтало.НайтиСтроки(Новый Структура("Абонент", Абонент)).Количество() > 1;
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеДляОплатыАбонента(Абонент, ДанныеАбонента)		 	
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.ЗадолженностьСтала, Новый Структура("IDСтрокиКорректировкаСтала", ДанныеАбонента.IDСтрокиКорректировкаСтала));
	
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Абонент, ДанныеАбонента);	
	Результат 	= энргРаботаСЛицевымСчетомСервер.ДанныеДляОплатыАбонента(Объект.Дата, ДанныеАбонента.Организация, ДанныеАбонента.Район, ДанныеАбонента.МКД, Абонент); 
	Выборка  	= Результат.Выбрать();
	Пока Выборка.следующий() цикл
		СтрокаУслуги 							= Объект.ЗадолженностьСтала.Добавить();
		СтрокаУслуги.IDСтрокиКорректировкаСтала = ДанныеАбонента.IDСтрокиКорректировкаСтала;
		ЗаполнитьЗначенияСвойств(СтрокаУслуги,Выборка); 		 
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ДополнитьДаннымиРаспределенияДокументаОплаты(Абонент, ДанныеАбонента)
	Если НЕ Абонент = Объект.Абонент Тогда 
		Возврат;	
	КонецЕсли;
	
	Для Каждого Выборка Из Объект.ЗадолженностьБыла Цикл
		СтрокаУслуги 							= Объект.ЗадолженностьСтала.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУслуги, Выборка);
		СтрокаУслуги.IDСтрокиКорректировкаСтала = ДанныеАбонента.IDСтрокиКорректировкаСтала;			
		СтрокаУслуги.Задолженность 				= Выборка.СуммаОплаты;
		СтрокаУслуги.СуммаОплаты 				= 0;
	КонецЦикла;		
	
	КолонкиГруппировок 	= "IDСтрокиКорректировкаСтала,Услуга,ВидЗадолженности,ПериодНачисления,Поставщик";
	КолонкиСуммирования = "Задолженность,СуммаОплаты";
	
	ДанныеЗадолженности = Объект.ЗадолженностьСтала.Выгрузить();
	ДанныеЗадолженности.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	ДанныеЗадолженности.Сортировать("ПериодНачисления, ВидЗадолженности");
	Объект.ЗадолженностьСтала.Загрузить(ДанныеЗадолженности);
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОплатыСталоСуммаСталоПриИзменении(Элемент)
	ОбновитьКолонкуСуммуОстатка();
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОплатыСталоПослеУдаления(Элемент)
	ОбновитьКолонкуСуммуОстатка();
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧЗадолженностьСтала

&НаКлиенте
Процедура ЗадолженностьСталаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ДанныеДокументовОплаты = Элементы.КорректировкаОплатыСтало.ТекущиеДанные;
	Если ДанныеДокументовОплаты = Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите документ оплаты");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьСталаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ДанныеДокументовОплаты = Элементы.КорректировкаОплатыСтало.ТекущиеДанные;
	Если ДанныеДокументовОплаты = Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите документ оплаты");
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные 								= Элементы.ЗадолженностьСтала.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиКорректировкаСтала	= ДанныеДокументовОплаты.IDСтроки;
		ТекущиеДанные.IDСтрокиКорректировкаБыло		= ДанныеДокументовОплаты.IDСтрокиКорректировкаБыло;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти