#Область ОбработчикиСобытий

Процедура ПоставщикАвтоПодбор(Форма,ТекСтрока,Свойства = Неопределено,ИмяТЧ="ПоставщикиСоставныхУслуг",ИмяФормы="энргФормаВыбораПоставщика",ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт 
	
	Если Свойства = Неопределено Тогда
		Свойства = Новый Структура("ИмяСвойстваПоставщик","Поставщик");
	КонецЕсли;
	
	ИмяСвойстваПоставщик		= Свойства["ИмяСвойстваПоставщик"];
	ИмяСвойстваПлательщик		= "Плательщик";
	ИмяСвойстваПоставщикПосле = "ПоставщикПосле";
	
	ЕстьДанныеРаспределения = Ложь;
	
	Если Свойства.Свойство("ИмяСвойстваПлательщик")   тогда
		ИмяСвойстваПлательщик 	= Свойства["ИмяСвойстваПлательщик"];
	КонецЕсли;
	
	Если Свойства.Свойство("ИмяСвойстваПоставщикПосле")   тогда
		ИмяСвойстваПоставщикПосле 	= Свойства["ИмяСвойстваПоставщикПосле"];
	КонецЕсли;	

	Если ТекСтрока.ЭтоСоставнаяУслуга тогда 
		ЕстьПлательщик			= ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекСтрока,"Плательщик");		
		ЕстьПоставщикПосле		= ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекСтрока,"ПоставщикПосле");
		
		СтандартнаяОбработка 	= Ложь;
		Соотвествие  			= Новый Соответствие;
		СтрокиСоотвествия  		= Форма.Объект[ИмяТЧ].НайтиСтроки(Новый Структура("IDСтроки",ТекСтрока.IDСтроки));
		
		для Каждого СтрокаСоотвествия из СтрокиСоотвествия  цикл
			ДанныеСтроки 		= Новый Структура;
			Для Каждого КлючЗначение Из Свойства Цикл
				 ДанныеСтроки.Вставить(КлючЗначение.Значение, СтрокаСоотвествия[КлючЗначение.Значение]);
			 КонецЦикла; 			
		 
			 Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекСтрока,"РаспределятьНаАбонентов") и СтрокаСоотвествия.Свойство("РаспределятьНаАбонентов") Тогда
				 ЕстьДанныеРаспределения = Истина;
			 КонецЕсли;

			Если ЕстьДанныеРаспределения   Тогда
				ДанныеСтроки.Вставить("РаспределятьНаАбонентов", СтрокаСоотвествия["РаспределятьНаАбонентов"]);
			КонецЕсли;			
			Соотвествие.Вставить(СтрокаСоотвествия.ЧастьСоставнойУслуги,ДанныеСтроки);
		КонецЦикла; 		
		ОписаниеЗаверешения  	= Новый ОписаниеОповещения("ВыборПоставщикаСоставныхУслуг",ЭтотОбъект,Новый Структура("IDСтроки,Форма,Свойства,ИмяТЧ,ИмяРеквизитаФормы, ЕстьДанныеРаспределения",ТекСтрока.IDСтроки,Форма,Свойства,ИмяТЧ,ИмяРеквизитаФормы,ЕстьДанныеРаспределения));
		ПараметрыОткрытия  		= Новый Структура("СоотвествиеУслуг,КлючСтруктуры, ЕстьДанныеРаспределения, ЕстьПлательщик,ЕстьПоставщикПосле",Соотвествие,Новый Структура("Поставщик,Плательщик,ПоставщикПосле",ИмяСвойстваПоставщик,ИмяСвойстваПлательщик, ИмяСвойстваПоставщикПосле), ЕстьДанныеРаспределения, ЕстьПлательщик,ЕстьПоставщикПосле);
		ОткрытьФорму("ОбщаяФорма."+ИмяФормы,ПараметрыОткрытия,,,,,ОписаниеЗаверешения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииУслуги(Форма,ТекДанные,ОписаниеУслуги) Экспорт 
	
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга и не ЗначениеЗаполнено(ТекДанные.IDСтроки) тогда
	//Если  не ЗначениеЗаполнено(ТекДанные.IDСтроки) тогда

		ТекДанные.IDСтроки 					= Новый УникальныйИдентификатор;
	КонецЕсли;
		
	ПоставщикПоУмолчанию 					= Форма.ПараметрыПоставщиков.ПоставщикПоУмолчанию;
	ТекДанные.ЭтоСоставнаяУслуга 			= ОписаниеУслуги.ЭтоСоставнаяУслуга; 	
	
	// ищем строки 
	СтрокиСоотвествия 						= Форма.Объект.ПоставщикиСоставныхУслуг.НайтиСтроки(Новый Структура("IDСтроки",ТекДанные.IDСтроки));	
	для Каждого СтрокаСоотвествия из СтрокиСоотвествия цикл
		Форма.Объект.ПоставщикиСоставныхУслуг.Удалить(СтрокаСоотвествия);
	КонецЦикла;
	
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
		для Каждого Строка из ОписаниеУслуги.Услуги цикл
			СтрокаТЧ  						= Форма.Объект.ПоставщикиСоставныхУслуг.Добавить();
			СтрокаТЧ.IDСтроки 				= ТекДанные.IDСтроки;
			СтрокаТЧ.ЧастьСоставнойУслуги 	= Строка;
			СтрокаТЧ.Поставщик 				= ПоставщикПоУмолчанию;
		КонецЦикла;
	иначе
		ТекДанные.Поставщик 				= ПоставщикПоУмолчанию; 
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Форма,ТекДанные) Экспорт 
	
	//Если не ТекДанные.ЭтоСоставнаяУслуга тогда
	//	Возврат;
	//КонецЕсли;
	
	// удаляем строки из табличной часть ПоставщикиСоставныхУслуг
	ТабЧасть  	= Форма.объект.ПоставщикиСоставныхУслуг ;
	СтрокиТЧ 	= ТабЧасть.найтиСтроки(Новый Структура("IDСтроки",ТекДанные.IDСтроки));
	для Каждого СтрокаТЧ из СтрокиТЧ цикл
		 ТабЧасть.удалить(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыборПоставщикаСоставныхУслуг(РезультатЗакрытия,ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Форма		  												= ДополнительныеПараметры.Форма;
	// ищем строки 
	IDСтроки 													= ДополнительныеПараметры.IDСтроки;
	Свойства 													= ДополнительныеПараметры.Свойства;
	ИмяТЧ														= ДополнительныеПараметры.ИмяТЧ;
	ИмяРеквизитаФормы											= ДополнительныеПараметры.ИмяРеквизитаФормы;
	ЕстьДанныеРаспределения 									= ДополнительныеПараметры.ЕстьДанныеРаспределения;
	Если РезультатЗакрытия.ДанныеИзменены тогда		
		СтрокиСоотвествия 										= Форма.Объект[ИмяТЧ].НайтиСтроки(Новый Структура("IDСтроки",IDСтроки));	
		//ДнныеСтроки 											=
		ПредставлениеПоставщика  								= "";
		ПредставлениеПоставщикаПосле  							= "";
		
		ПредставлениеПлательщика  								= "";
		ПредставлениеРаспределять 								= "";
		НайденныеУслуги 										= Новый Массив;
		для Каждого СтрокаСоотвествия из СтрокиСоотвествия цикл
			Если РезультатЗакрытия.СоотвествиеУслуг.получить(СтрокаСоотвествия.ЧастьСоставнойУслуги)  = Неопределено тогда
				Форма.Объект[ИмяТЧ].удалить(СтрокаСоотвествия);
				Продолжить;
			КонецЕсли;			
			ДанныеСтроки 										= РезультатЗакрытия.СоотвествиеУслуг[СтрокаСоотвествия.ЧастьСоставнойУслуги];
			СтрокаСоотвествия[Свойства["ИмяСвойстваПоставщик"]] = ДанныеСтроки[Свойства["ИмяСвойстваПоставщик"]];
			Представление										= ?(ЗначениеЗаполнено(СтрокаСоотвествия[Свойства["ИмяСвойстваПоставщик"]]), СтрокаСоотвествия[Свойства["ИмяСвойстваПоставщик"]], "<не указан>");
			ПредставлениеПоставщика 							= ПредставлениеПоставщика + ?(ЗначениеЗаполнено(ПредставлениеПоставщика),"/","") + Представление;
			
			Если Свойства.Свойство("ИмяСвойстваПлательщик") Тогда
				СтрокаСоотвествия[Свойства["ИмяСвойстваПлательщик"]]		= ДанныеСтроки[Свойства["ИмяСвойстваПлательщик"]];
				Представление												= ?(ЗначениеЗаполнено(СтрокаСоотвествия[Свойства["ИмяСвойстваПлательщик"]]), СтрокаСоотвествия[Свойства["ИмяСвойстваПлательщик"]], "<не указан>");
				ПредставлениеПлательщика 									= ПредставлениеПлательщика + ?(ЗначениеЗаполнено(ПредставлениеПлательщика),"/","") + Представление;
			КонецЕсли;
			
			Если ЕстьДанныеРаспределения  Тогда
				ПредставлениеРаспределять 									= ПредставлениеРаспределять + ?(ЗначениеЗаполнено(ПредставлениеРаспределять),"/","") + Формат(ДанныеСтроки["РаспределятьНаАбонентов"],"БЛ=Нет; БИ=Да"); 
				СтрокаСоотвествия["РаспределятьНаАбонентов"] 				= ДанныеСтроки["РаспределятьНаАбонентов"];
			КонецЕсли;			
			
			Если Свойства.Свойство("ИмяСвойстваПоставщикПосле") Тогда
				СтрокаСоотвествия[Свойства["ИмяСвойстваПоставщикПосле"]]	= ДанныеСтроки[Свойства["ИмяСвойстваПоставщикПосле"]];
				Представление												= ?(ЗначениеЗаполнено(СтрокаСоотвествия[Свойства["ИмяСвойстваПоставщикПосле"]]), СтрокаСоотвествия[Свойства["ИмяСвойстваПоставщикПосле"]], "<не указан>");
				ПредставлениеПоставщикаПосле 								= ПредставлениеПоставщикаПосле + ?(ЗначениеЗаполнено(ПредставлениеПоставщикаПосле),"/","") + Представление;
			КонецЕсли;			

			НайденныеУслуги.Добавить(СтрокаСоотвествия.ЧастьСоставнойУслуги);
		КонецЦикла;
		
		для Каждого КлючЗначение из РезультатЗакрытия.СоотвествиеУслуг цикл
			Если НЕ НайденныеУслуги.Найти(КлючЗначение.Ключ) = Неопределено тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЧ  											= Форма.Объект[ИмяТЧ].Добавить();
			СтрокаТЧ.IDСтроки 									= IDСтроки;
			СтрокаТЧ.ЧастьСоставнойУслуги 						= КлючЗначение.Ключ;
			СтрокаТЧ[Свойства["ИмяСвойстваПоставщик"]] 			= КлючЗначение.Значение["Поставщик"];
			ПредставлениеПоставщика 							= ПредставлениеПоставщика + ?(ЗначениеЗаполнено(ПредставлениеПоставщика),"/","") +  КлючЗначение.Значение[Свойства["ИмяСвойстваПоставщик"]];
			
			Если Свойства.Свойство("ИмяСвойстваПлательщик") Тогда
				СтрокаТЧ[Свойства["ИмяСвойстваПлательщик"]] 		= КлючЗначение.Значение["Плательщик"];
				ПредставлениеПлательщика 							= ПредставлениеПлательщика + ?(ЗначениеЗаполнено(ПредставлениеПлательщика),"/","") +  КлючЗначение.Значение[Свойства["ИмяСвойстваПлательщик"]];
			КонецЕсли;
			
			Если ЕстьДанныеРаспределения   Тогда
				СтрокаТЧ["РаспределятьНаАбонентов"] 			= КлючЗначение.Значение["РаспределятьНаАбонентов"];
				ПредставлениеРаспределять 						= ПредставлениеРаспределять + ?(ЗначениеЗаполнено(ПредставлениеРаспределять),"/","") + Формат(КлючЗначение.Значение["РаспределятьНаАбонентов"],"БЛ=Нет; БИ=Да"); 
			КонецЕсли;
			
			Если Свойства.Свойство("ИмяСвойстваПоставщикПосле") Тогда
				СтрокаТЧ[Свойства["ИмяСвойстваПоставщикПосле"]] = КлючЗначение.Значение["ПоставщикПосле"];
				ПредставлениеПоставщикаПосле 					= ПредставлениеПоставщикаПосле + ?(ЗначениеЗаполнено(ПредставлениеПоставщикаПосле),"/","") +  КлючЗначение.Значение[Свойства["ИмяСвойстваПоставщикПосле"]];
			КонецЕсли;			
	
		КонецЦикла; 
	иначе
		ПредставлениеПоставщика  								= "";
		ПредставлениеПоставщикаПосле							= "";
		ПредставлениеПлательщика 								= "";
		ПредставлениеРаспределять 								= "";
		для Каждого КлючЗначение из РезультатЗакрытия.СоотвествиеУслуг цикл
			ПредставлениеПоставщика 							= ПредставлениеПоставщика + ?(ЗначениеЗаполнено(ПредставлениеПоставщика),"/","") +  КлючЗначение.Значение[Свойства["ИмяСвойстваПоставщик"]];
			
			Если Свойства.Свойство("ИмяСвойстваПлательщик") Тогда
				ПредставлениеПлательщика 						= ПредставлениеПлательщика + ?(ЗначениеЗаполнено(ПредставлениеПлательщика),"/","") +  КлючЗначение.Значение[Свойства["ИмяСвойстваПлательщик"]];
			КонецЕсли;
			
			Если ЕстьДанныеРаспределения Тогда
				ПредставлениеРаспределять 						= ПредставлениеРаспределять + ?(ЗначениеЗаполнено(ПредставлениеРаспределять),"/","") + Формат(КлючЗначение.Значение["РаспределятьНаАбонентов"],"БЛ=Нет; БИ=Да"); 
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;

	ПараметрыПоставщика 										= ДополнительныеПараметры.Форма[ИмяРеквизитаФормы].ДанныеСоставныхУслуг;
	Если ПараметрыПоставщика[IDСтроки] = Неопределено тогда
		ДанныеСтроки	= Новый Структура(Свойства["ИмяСвойстваПоставщик"],ПредставлениеПоставщика);
		Если Свойства.Свойство("ИмяСвойстваПлательщик") Тогда
			ДанныеСтроки.Вставить(Свойства["ИмяСвойстваПлательщик"], ПредставлениеПлательщика);
		КонецЕсли;
		
		Если Свойства.Свойство("ИмяСвойстваПоставщикПосле") Тогда
			ДанныеСтроки.Вставить(Свойства["ИмяСвойстваПоставщикПосле"], ПредставлениеПоставщикаПосле);
		КонецЕсли;

		ПараметрыПоставщика.вставить(IDСтроки,ДанныеСтроки);
	Иначе
		ПараметрыПоставщика[IDСтроки].вставить(Свойства["ИмяСвойстваПоставщик"],ПредставлениеПоставщика);
		Если Свойства.Свойство("ИмяСвойстваПлательщик") Тогда 
			ПараметрыПоставщика[IDСтроки].вставить(Свойства["ИмяСвойстваПлательщик"],ПредставлениеПлательщика);
		КонецЕсли;
		Если Свойства.Свойство("ИмяСвойстваПоставщикПосле") Тогда 
			ПараметрыПоставщика[IDСтроки].вставить(Свойства["ИмяСвойстваПоставщикПосле"],ПредставлениеПоставщикаПосле);
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЕстьДанныеРаспределения Тогда		
		Если ПараметрыПоставщика[IDСтроки] = Неопределено тогда
			ДанныеСтроки	= Новый Структура("РаспределятьНаАбонентов",ПредставлениеРаспределять);
			ПараметрыПоставщика.вставить(IDСтроки,ДанныеСтроки);
		Иначе
			ПараметрыПоставщика[IDСтроки].Вставить("РаспределятьНаАбонентов", ПредставлениеРаспределять);
		КонецЕсли;
	КонецЕсли;
	
	//Форма.УстановитьУсловноеОФормлениеФормыКлиент(Свойства["ИмяСвойстваПоставщик"], ИмяРеквизитаФормы,IDСтроки, РезультатЗакрытия.СоотвествиеУслуг);
	Форма.УстановитьУсловноеОФормлениеФормыКлиент(Свойства["ИмяСвойстваПоставщик"],ИмяРеквизитаФормы);
		
КонецПроцедуры

#КонецОбласти

