#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияРеквизитовОбъекта(АбонентСсылка, ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].ЗначенияРеквизитовОбъекта(АбонентСсылка, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	мПолучаемыеСвойства = СтрРазделить(ПолучаемыеСвойства, "," , Ложь);
	ОпределитьФилиал 	= НеобходимоОпределитьВспомогательноеПоле(мПолучаемыеСвойства, "Филиал");
	ОпределитьДоговор 	= НеобходимоОпределитьВспомогательноеПоле(мПолучаемыеСвойства, "Договор");	
	яПолучаемыеСвойства = СтрСоединить(мПолучаемыеСвойства, ",");
	
	Результат = Справочники.энргАбоненты.ЗначенияРеквизитовОбъекта(АбонентСсылка, яПолучаемыеСвойства);
	
	Если ОпределитьФилиал Тогда
		Результат.Вставить("Филиал", Обработки.энргФилиалыСтроенийМенеджер.ФилиалАбонента(АбонентСсылка));
	КонецЕсли;
	
	Если ОпределитьДоговор Тогда
		Результат.Вставить("Договор", ПолучитьДоговорАбонента(Дата(1, 1, 1), АбонентСсылка));
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.ЗначенияРеквизитовОбъекта";
		ПараметрыМетода 			= Новый Структура("АбонентСсылка, ПолучаемыеСвойства", АбонентСсылка, ПолучаемыеСвойства); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьДанныеАбонента(ОбъектФормы) Экспорт 
	
	ДанныеАбонента  				= Новый Структура;
	
	ДанныеАбонента.Вставить("ФизЛицо", "" + Справочники.ФизическиеЛица.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.ФизЛицо) Тогда
		ДанныеАбонента.ФизЛицо 					= "" + ОбъектФормы.ФизЛицо.УникальныйИдентификатор();
	КонецЕсли;
			
	ДанныеАбонента.Вставить("ВидОбъекта", "" + Справочники.энргВидыОбъектовАбонента.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.ВидОбъекта) Тогда
		ДанныеАбонента.ВидОбъекта 				= "" + ОбъектФормы.ВидОбъекта.УникальныйИдентификатор();
	КонецЕсли;
	
	ДанныеАбонента.Вставить("МуниципальноеОбразование", "" + Справочники.энргМуниципальноеОбразование.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.МуниципальноеОбразование) Тогда
		ДанныеАбонента.МуниципальноеОбразование =  "" + ОбъектФормы.МуниципальноеОбразование.УникальныйИдентификатор();
	КонецЕсли;  	
			
	ДанныеАбонента.Вставить("Филиал", "" + Справочники.энргФилиалы.ПустаяСсылка().УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ОбъектФормы.Филиал) Тогда
		ДанныеАбонента.Филиал 					= "" + ОбъектФормы.Филиал.УникальныйИдентификатор();
	КонецЕсли;
	
	Запись 										= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись,ДанныеАбонента);
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ЗначенияРеквизитовИзСтрокиJSON(ОписаниеАбонента, ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].ЗначенияРеквизитовИзСтрокиJSON(ОписаниеАбонента, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Чтение  								= Новый ЧтениеJSON;	
	Чтение.УстановитьСтроку(ОписаниеАбонента);
	ДанныеАбонента 							= ПрочитатьJSON(Чтение);
	
	Результат 								= Новый Структура(ПолучаемыеСвойства);
	мПолучаемыеСвойства 					= СтрРазделить(ПолучаемыеСвойства,",",Ложь);
	
	Если ДанныеАбонента.Свойство("ФизЛицо") и НЕ мПолучаемыеСвойства.Найти("Контрагент") = Неопределено Тогда
		Результат["Контрагент"] 			= Справочники.энргКонтрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.ФизЛицо));
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("ВидОбъекта") И НЕ мПолучаемыеСвойства.Найти("ВидОбъекта") = Неопределено Тогда
		Результат["ВидОбъекта"] 		 	= Справочники.энргВидыОбъектовАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.ВидОбъекта));
	КонецЕсли;
	
	Если ДанныеАбонента.Свойство("Филиал") И НЕ мПолучаемыеСвойства.Найти("Филиал") = Неопределено Тогда
		Результат["Филиал"]  				= Справочники.энргФилиалы.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.Филиал));
	КонецЕсли;	
	
	Если ДанныеАбонента.Свойство("МуниципальноеОбразование") И НЕ мПолучаемыеСвойства.Найти("МуниципальноеОбразование") = Неопределено Тогда
		Результат["МуниципальноеОбразование"] = Справочники.энргМуниципальноеОбразование.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАбонента.МуниципальноеОбразование)); 
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.ЗначенияРеквизитовИзСтрокиJSON";
		ПараметрыМетода 			= Новый Структура("ОписаниеАбонента, ПолучаемыеСвойства",ОписаниеАбонента, ПолучаемыеСвойства); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция МассивСсылокПолноТекствогоПоиска(СтрокаПоиска) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].МассивСсылокПолноТекствогоПоиска(СтрокаПоиска);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат  						= Справочники.энргАбоненты.МассивСсылокПолноТекствогоПоиска(СтрокаПоиска);
		
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.МассивСсылокПолноТекствогоПоиска";
		ПараметрыМетода 			= Новый Структура("ОписаниеАбонента",СтрокаПоиска); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПоКлючевымПараметрам(ДатаДокумента,Организация,Район,КлючПомещения,ФизЛицо,Поставщик,Услуги) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат Обработки["слжАбонентыМенеджер"].СсылкаПоКлючевымПараметрам(ДатаДокумента,Организация,Район,КлючПомещения,ФизЛицо,Поставщик,Услуги);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Результат 						= Справочники.энргАбоненты.СсылкаПоКлючевымПараметрам(ДатаДокумента,Организация,Район,КлючПомещения,ФизЛицо,Поставщик,Услуги);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргАбоненты.СсылкаПоКлючевымПараметрам";
		ПараметрыМетода 			= Новый Структура("Организация,Район,КлючПомещения,ФизЛицо",Организация,Район,КлючПомещения,ФизЛицо); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПоЛицевомуСчету(ЛицевойСчет) Экспорт 
	Результат = Справочники.энргАбоненты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.Ссылка КАК Абонент
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	энргАбоненты.ЛицевойСчет = &ЛицевойСчет";
	
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.Абонент;
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьОбъектПоОписанию(ОписаниеОбъекта, ЭтоНоваяСсылка, Период) Экспорт 
	перем ЛицевойСчет;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжАбонентыМенеджер") = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	 	
	Организация 					= ОписаниеОбъекта.Организация;
	Район 							= ОписаниеОбъекта.Район;
	КлючПомещения					= ОписаниеОбъекта.КлючПомещения;
	ФизЛицо 						= ОписаниеОбъекта.ФизЛицо;
	ГруппаАбонента 					= ОписаниеОбъекта.ГруппаАбонента;	
	АбонентСсылка 					= ОписаниеОбъекта.Ссылка;
	Филиал 							= ОписаниеОбъекта.Филиал;
	
	Если ЭтоНоваяСсылка Тогда
		ЛицевойСчет 				= Обработки.энргНомераЛицевыхСчетовМенеджер.СФормироватьЛицевойСчет(Организация,Район,ГруппаАбонента, Филиал);
	КонецЕсли;	
	
	Справочники.энргАбоненты.ЗаполнитьОбъектПоОписанию(АбонентСсылка, ОписаниеОбъекта, ЛицевойСчет, ЭтоНоваяСсылка);
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		МЗ 							= РегистрыСведений.энргФилиалыАбонентов.СоздатьМенеджерЗаписи();
		МЗ.Абонент					= АбонентСсылка;
		МЗ.Период					= Период;
		МЗ.Филиал					= Филиал;
		МЗ.Записать(Истина);
		// ЗаполнитьЗначенияСвойств(АбонентОбъект,ДанныеАбонента,"Филиал");
	КонецЕсли;

	
КонецПроцедуры

Функция ПолучитьДоговорАбонента(Период, Абонент) Экспорт
	
	Результат = Обработки.энргДоговорыКонтрагентовМенеджер.ПолучитьДоговорАбонента(Период, Абонент);
	Возврат Результат;
	
КонецФункции

Функция РезультатЗапросаСостоянияЛС(Период, Организация, Район, Абонент) Экспорт
	
	СхемаЗапроса	= Неопределено;
	ПараметрыОтбора	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация", "Организация"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район", "Район"))); 
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Абонент", "Абонент"))); 
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	КонецЕсли;
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(СхемаЗапроса, ПараметрыОтбора);	 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"	, Период);
	ПараметрыЗапроса.Вставить("Организация"	, Организация);		
	ПараметрыЗапроса.Вставить("Район"	, Район);		
	ПараметрыЗапроса.Вставить("Абонент"	, Абонент);		
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПараметрыЗапроса);
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ОписаниеОбъекта() Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", 					Справочники.энргАбоненты.ПустаяСсылка());
	Результат.Вставить("Организация", 				Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Район", 					Справочники.энргЗоныОтвественности.ПустаяСсылка());
	Результат.Вставить("КлючПомещения", 			Справочники.энргКлючиПомещений.ПустаяСсылка());
	Результат.Вставить("ФизЛицо", 					Справочники.ФизическиеЛица.ПустаяСсылка());
	Результат.Вставить("ГруппаАбонента", 			Справочники.энргАбоненты.ПустаяСсылка());
	Результат.Вставить("ВидОбъекта", 				Справочники.энргВидыОбъектовАбонента.ПустаяСсылка());
	Результат.Вставить("СтарыйЛС",					"");
	Результат.Вставить("Филиал",					Справочники.энргФилиалы.ПустаяСсылка());
	Результат.Вставить("МуниципальноеОбразование",	Справочники.энргМуниципальноеОбразование.ПустаяСсылка());
	Результат.Вставить("Поставщик",					Справочники.энргКонтрагенты.ПустаяСсылка());
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НеобходимоОпределитьВспомогательноеПоле(мПолучаемыеСвойства, ИмяСвойства)
	
	Результат = Ложь;
	ИндексСвойстваФилиал = мПолучаемыеСвойства.Найти(ИмяСвойства);
	
	Если НЕ ИндексСвойстваФилиал = Неопределено Тогда
		мПолучаемыеСвойства.Удалить(ИндексСвойстваФилиал);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#КонецЕсли