#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 
	Если ЗначениеЗаполнено(Объект.Район) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
 			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Абонент.Организация,Объект.Абонент.Район);
 
		КонецЕсли;
	КонецЕсли;
			
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
 			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры  

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);  	
	Объект.СуммаЗадолженности = ПолучитьДЗ();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
 		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
  		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
 
КонецПроцедуры
// Конец Стандарт
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Период(Команда)
	Диалог 						= Новый ДиалогРедактированияСтандартногоПериода();
    
    Диалог.Период.ДатаНачала    = Объект.НачПериода;
    Диалог.Период.ДатаОкончания = Объект.КонПериода;
    
    Если Диалог.Редактировать() Тогда        
        Объект.НачПериода 		= Диалог.Период.ДатаНачала;
        Объект.КонПериода 		= Диалог.Период.ДатаОкончания;     
    КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура СформироватьМакет(Команда)
	
	ПараметрыОтчета = Новый Структура("Абонент,ЛицевойСчет,АдресОбъекта,НачПериода,КонПериода,Дата,СуммаЗадолженности, Организация, Район",
	Объект.Абонент,Объект.ЛицевойСчет,Объект.АдресОбъекта,Объект.НачПериода,Объект.КонПериода,Объект.Дата,Объект.СуммаЗадолженности, Объект.Организация, Объект.Район);	
	Отказ = Ложь;
			
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(Объект.Ссылка);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.энргРасчетДебиторскойЗадолженности", "энргРасчетДебиторскойЗадолженности",
		ПараметрКоманды, ЭтотОбъект, Новый Структура("ПараметрыОтчета", ПараметрыОтчета)); 
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДЗ()
	
	Сумма = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаОборот, 0)) КАК Сумма
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчеты.ОстаткиИОбороты(&НачПериод, &КонПериод, , , Абонент = &Абонент) КАК энргВзаиморасчетыОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Запрос.УстановитьПараметр("КонПериод", Объект.КонПериода);
	Запрос.УстановитьПараметр("НачПериод", Объект.НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Сумма = ВыборкаДетальныеЗаписи.Сумма;
		
	КонецЕсли;
	
	Возврат Сумма;
	 
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
 
#КонецОбласти

