#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Актуальные данные
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция АктуальныеДанные(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанные());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод = Параметры[0];
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		ДоступныеПараметры = "Организация, Район, Абонент";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			Параметры[1],
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);	
			
		ДоступныеПараметры = "ДатаЗавершенияИсключения";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(
			ОператорВыбора.Отбор,
			"ТаблицаСрезПоследних",
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);		
					
	КонецЕсли;	 	
		
	ВспомогательныеПоля = "Период,Регистратор,НомерСтроки,Активность";	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		
		мВспомогательныеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			
			Выражение = Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса актуальные данные.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаАктуальныеДанные() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаСрезПоследних.Район КАК Район,
	|	ТаблицаСрезПоследних.Абонент КАК Абонент,
	|	ТаблицаСрезПоследних.ДатаЗавершенияИсключения КАК ДатаЗавершенияИсключения
	|ИЗ
	|	РегистрСведений.энргИсключенныеАбонентыИзРаспределенияДифференцированныхТарифов.СрезПоследних КАК ТаблицаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли