#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
	
		
	//Если НЕ ПометкаУдаления и НЕ ДополнительныеСвойства.Свойство("ПроведениеРазрешено") тогда
	//	Отказ 								= истина;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ создается автоматически из меню ""Выполнение начислений""");
	//	Возврат;
	//КонецЕсли;

	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 							= Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты",Истина);
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",				Истина);
	ДополнительныеСвойства.Вставить("ПараметрыПроведения",			Новый Структура());
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Если ПометкаУдаления Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Записать();
		КонецЦикла;		
	КонецЕсли;

		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли