#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает активные объекты расчета.
//
// Параметры:
//  МВТ			-	МенеджерВременныхТаблиц.
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  ИмяТаблицы	-	Строка.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьАктивныеОбъектыРасчета(МВТ, Период, Организация, Район, ИмяТаблицы = "") Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Период",			Период);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("Организация",	Организация);
	
	Запрос.Текст = ПолучитьТекстЗапросаАктивныеОбъектыРасчета(ИмяТаблицы);
	Результат    = Запрос.Выполнить();
	Если НЕ ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Возврат  Результат;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаАктивныеОбъектыРасчета(ИмяТаблицы)
	Возврат "ВЫБРАТЬ
	        |	бестАктивностьОбъектовРасчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	        | " + ?(ЗначениеЗаполнено(ИмяТаблицы), "ПОМЕСТИТЬ "+ ИмяТаблицы, "") + Символы.ПС + 
	        "ИЗ
	        |	РегистрСведений.бестАктивностьОбъектовРасчета.СрезПоследних(
	        |			&Период,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестАктивностьОбъектовРасчетаСрезПоследних
	        |ГДЕ
	        |	бестАктивностьОбъектовРасчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)"; 
КонецФункции

#КонецОбласти

#КонецЕсли