#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс 

Функция РезультатДанныеЗаполненияТаблицыПоказаний(Организация,Район, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем = Ложь) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжПоказанияПриборовУчетаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжПоказанияПриборовУчетаМенеджер"].РезультатДанныеЗаполненияТаблицыПоказаний(Организация, тзТаблицаПоказаний, МоментВремени);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= энргРаботаСПоказаниямиПриборовУчетаСервер.РезультатДанныеЗаполненияТаблицыПоказаний(Организация,Район, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "слжПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний";
		ПараметрыМетода 			= Новый Структура("Организация, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем", Организация, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Организация,Район, тзТаблицаПоказаний, МоментВремени, тзПриборыДляОтклоненияПоказаний, КонтрольныйСъем = Ложь) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжПоказанияПриборовУчетаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжПоказанияПриборовУчетаМенеджер"].РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Организация, тзТаблицаПоказаний, МоментВремени, тзПриборыДляОтклоненияПоказаний);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= энргРаботаСПоказаниямиПриборовУчетаСервер.РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения(Организация,Район, тзТаблицаПоказаний, МоментВремени, тзПриборыДляОтклоненияПоказаний, КонтрольныйСъем);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "слжПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказанийСУчетомОтклонения";
		ПараметрыМетода 			= Новый Структура("Организация, тзТаблицаПоказаний, МоментВремени, КонтрольныйСъем", Организация, тзТаблицаПоказаний, МоментВремени, тзПриборыДляОтклоненияПоказаний, КонтрольныйСъем);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли