#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ГруппаПотребителя");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Результат = ПолучитьДанныеДляПроведения();
		
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(Результат,	Движения.бестНастройкаРасчетаПениНП);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛ.Дата КАК Период,
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛ.Организация КАК Организация,
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛ.ГруппаПотребителя КАК ГруппаПотребителя,
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛЧастиСтавкиРефинансирования.От КАК От,
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛЧастиСтавкиРефинансирования.До КАК До,
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛЧастиСтавкиРефинансирования.Числитель КАК Числитель,
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛЧастиСтавкиРефинансирования.Знаменатель КАК Знаменатель
	      		  |ИЗ
	      		  |	Документ.бестИзменитьНастройкиРасчетаПениЮЛ.ЧастиСтавкиРефинансирования КАК бестИзменитьНастройкиРасчетаПениЮЛЧастиСтавкиРефинансирования
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьНастройкиРасчетаПениЮЛ КАК бестИзменитьНастройкиРасчетаПениЮЛ
	      		  |		ПО бестИзменитьНастройкиРасчетаПениЮЛЧастиСтавкиРефинансирования.Ссылка = бестИзменитьНастройкиРасчетаПениЮЛ.Ссылка
	      		  |ГДЕ
	      		  |	бестИзменитьНастройкиРасчетаПениЮЛ.Ссылка = &Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли