#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда              

#Область ПрограммныйИнтерфейс

// Выставляет в дополнителные свойства массив приборов.
//
Функция МассивПриборов() Экспорт
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаПриборов.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргПриходныйКассовыйОрдер.ТочкиУчета КАК ТаблицаПриборов
	|ГДЕ
	|	ТаблицаПриборов.Ссылка = &Ссылка
	|	И НЕ ТаблицаПриборов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("РежимКонвертации") тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();	
		 	
	ДополнительныеСвойства.Вставить("Кассир",				Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	?(ЗначениеЗаполнено(ИсточникПоступления), ИсточникПоступления, Справочники.энргИсточникиПоступления.Касса));
	ДополнительныеСвойства.Вставить("ЭтоОплата", 			Истина);
			
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ДополнительныеСвойства.свойство("РежимКонвертации") тогда
		Возврат;
	КонецЕсли;
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
					
	ПроведениеПриборыУчета(); 	
	УменьшитьЗадолженностьАбонента();		
	УменьшитьЗадолженностьПоРассрочке();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента") Тогда
		КлючПомещения 		= ДанныеЗаполнения.КлючПомещения;
		Абонент 			= ДанныеЗаполнения.Абонент;
		Организация 		= ДанныеЗаполнения.Организация;
		Район		 		= ДанныеЗаполнения.Район;
		ДокументОснование 	= ДанныеЗаполнения;
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	//	Абонент 			= ДанныеЗаполнения.Абонент;
	//	Если ДанныеЗаполнения.Свойство("КлючПомещения") Тогда
	//		КлючПомещения 		= ДанныеЗаполнения.КлючПомещения;
	//	Иначе
	//		КлючПомещения = Абонент.КлючПомещения;
	//	КонецЕсли;
	//	Если ДанныеЗаполнения.Свойство("Организация") Тогда
	//		Организация 		= ДанныеЗаполнения.Организация;
	//	Иначе
	//		Организация = Абонент.Организация;
	//	КонецЕсли;
	//	Если ДанныеЗаполнения.Свойство("Район") Тогда
	//		Район 		= ДанныеЗаполнения.Район;
	//	Иначе
	//		Район = Абонент.Район;
	//	КонецЕсли;
	Иначе
		энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	КонецЕсли;	
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПриборыУчета()			
	ДанныеШапки  = Новый Структура;
	ДанныеШапки.Вставить("Документ", 				Ссылка);
	ДанныеШапки.Вставить("Дата",	 				Дата);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	энргРаботаСприборамиУчетаСервер.ЗаписатьПоказанияРезультатЗапроса(ДанныеШапки,Движения);
	
	Результат = ПолучитьОбъемыПУ(); 	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(Результат, Движения.энргЗарегистрированныйОбъемПриборов);
	
	Выборка 				= Результат.Выбрать();
	НаборРасчетСреднего 	= РегистрыСведений.энргРасчетСреднегоОбъема.СоздатьНаборЗаписей();
	НаборРасчетСреднего.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",истина);
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНабор  			= НаборРасчетСреднего.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНабор,Выборка);	
		СтрокаНабор.ОбъемУслуги = Выборка.ОбъемУслугиПотребленный;
		
	КонецЦикла;
	НаборРасчетСреднего.Записать(Ложь);
КонецПроцедуры

Процедура УменьшитьЗадолженностьАбонента()
	
	Если СуммаОплаты <= 0 Тогда
		Возврат;
	КонецЕсли;
		
	ДанныеСтроения 				= ДополнительныеСвойства.ДанныеСтроения;
	МКД	 						= ?(НЕ ДанныеСтроения.ЧастныйСектор, ДанныеСтроения.Строение, Справочники.энргСтроения.ПустаяСсылка());
	
	Запись 						= Движения.энргВзаиморасчеты.ДобавитьРасход();
	Запись.Период 				= Дата;
	Запись.Организация			= Организация;
	Запись.Район 				= Район;
	Запись.МКД 					= МКД;
	Запись.Абонент 				= Абонент;
	Запись.Сумма 				= СуммаОплаты;
	Запись.ПериодНачисления		= НачалоМесяца(Дата);
		
	// регистр сведений оплата услуг
	Запись						= Движения.энргИсторияОплаты.Добавить();
	Запись.Период 				= Дата;
	Запись.Организация			= Организация;
	Запись.Район 				= Район;
	Запись.Абонент 				= Абонент;
	Запись.ДатаПлатежа			= Дата;
	Запись.СуммаПлатежа			= СуммаОплаты;
	Запись.ИсточникПоступления	= ИсточникПоступления;
				
КонецПроцедуры

Процедура УменьшитьЗадолженностьПоРассрочке()
	
	Если ОплатаОсновногоДолгаРассрочки > 0 тогда		
		Запись 							= Движения.энргЗадолженностьПоРассрочке.ДобавитьРасход();
		Запись.Период 					= Дата;
		Запись.Район 					= Район;
		Запись.Организация 				= Организация;
		Запись.МКД 						= КлючПомещения.Строение;
		Запись.Абонент 					= Абонент;
		Запись.СуммаЗадолженности 		= ОплатаОсновногоДолгаРассрочки;
	КонецЕсли;
	
	для Каждого стр из ОплатаПоРассрочке цикл
		Если стр.Оплачено > 0 тогда
			Запись 						= Движения.энргПроцентыПоРассрочке.ДобавитьРасход();
			Запись.Период 				= Дата;
			Запись.Район 				= Район;
			Запись.Организация 			= Организация;
			Запись.МКД 					= КлючПомещения.Строение;
			Запись.Абонент 				= Абонент;
			Запись.ПериодНачисления		= стр.ПериодНачисления;
			Запись.СуммаЗадолженности 	= стр.Оплачено; 
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьОбъемыПУ()
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ДокументСсылка КАК ДокРегистратор,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Шкала КАК Шкала,
	               |	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ТаблицаПоказанийПриборовУчета.Разница КАК ОбъемУслугиПотребленный,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	энргКлючиПомещений.Строение КАК Строение,
	               |	энргКлючиПомещений.Помещение КАК Помещение,
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаПриборовУчета.Ссылка КАК Ссылка,
	               |		ТаблицаПриборовУчета.ПриборУчета КАК ПриборУчета,
	               |		ТаблицаШкал.Шкала КАК Шкала,
	               |		ТаблицаШкал.IDСтроки КАК IDСтроки,
	               |		ТаблицаДокумента.Организация КАК Организация,
	               |		ТаблицаДокумента.Район КАК Район,
	               |		ТаблицаДокумента.КлючПомещения КАК КлючПомещения,
	               |		ТаблицаДокумента.ПериодНачисления КАК ПериодНачисления,
	               |		ТаблицаПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	               |		ТаблицаПриборовУчета.ПриборУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	               |		&Период КАК Период
	               |	ИЗ
	               |		Документ.энргПриходныйКассовыйОрдер.ТочкиУчета КАК ТаблицаПриборовУчета
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПриходныйКассовыйОрдер.ШкалыПриборовУчета КАК ТаблицаШкал
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаШкал.Ссылка
	               |				И ТаблицаПриборовУчета.IDСтроки = ТаблицаШкал.IDСтрокиТочкиУчета
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаШкал.Ссылка = &ДокументСсылка)
	               |				И (НЕ ТаблицаПриборовУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПриходныйКассовыйОрдер КАК ТаблицаДокумента
	               |			ПО ТаблицаПриборовУчета.Ссылка = ТаблицаДокумента.Ссылка
	               |				И (ТаблицаПриборовУчета.Ссылка = &ДокументСсылка)
	               |				И (ТаблицаДокумента.Ссылка = &ДокументСсылка)) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПриходныйКассовыйОрдер.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	               |		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанийПриборовУчета.IDСтроки
	               |			И (ТаблицаПоказанийПриборовУчета.Ссылка = &ДокументСсылка)
	               |			И (ВложенныйЗапрос.РегистрируетОбъем)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.Ссылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка"	,Ссылка);
	Запрос.УстановитьПараметр("Период"			,Дата);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли