#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если ЭтоНовый() Или  НЕ Ссылка.Проведен Тогда
		ПроверитьНаличиеСуществующихЗаписей(Отказ);	
	КонецЕсли;
	ДанныеШапки = ДанныеШапки();
	
	бестПроведениеСерверНП.ВыполнитьДвижение(ДанныеШапки, Движения.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",						?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",						Район);
	ДанныеШапки.Вставить("Организация",					Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",			Дата);
	ДанныеШапки.Вставить("ПериодНачисления",			ПериодНачисления);
	ДанныеШапки.Вставить("ПроектнаяТемпература",		ПроектнаяТемпература);
	Возврат ДанныеШапки; 
КонецФункции

Процедура ПроверитьНаличиеСуществующихЗаписей(Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 				?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия,Дата));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования
	               |ГДЕ
	               |	бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.Период <= &Дата
	               |	И бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.Организация = &Организация
	               |	И бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.Район = &Район
	               |	И НАЧАЛОПЕРИОДА(бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.ПериодНачисления, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.Регистратор";
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные по введенным организации и району уже введены! Документ " + Выборка.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли