#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Период(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    
    Диалог.Период.ДатаНачала    = Объект.НачПериода;
    Диалог.Период.ДатаОкончания = Объект.КонПериода;
    
    Если Диалог.Редактировать() Тогда
        
        Объект.НачПериода = Диалог.Период.ДатаНачала;
        Объект.КонПериода = Диалог.Период.ДатаОкончания;
    
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗ(Команда)
	ЗаполнитьТЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Стр Из Объект.ДокументыДЗ Цикл
		Стр.Загружать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Стр Из Объект.ДокументыДЗ Цикл
		Стр.Загружать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	ЗаполнитьДанныеНаСервере(); 	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок 						= Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб 			= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;  	
	ЗаполнитьТабДок(ТабДок);   	
	ТабДок.Показать();      	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ЗаполнитьТЗНаСервере()
	Объект.ДокументыДЗ.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРасчетДебиторскойЗадолженности.Абонент,
		|	энргРасчетДебиторскойЗадолженности.Ссылка КАК Документ
		|ИЗ
		|	Документ.энргРасчетДебиторскойЗадолженности КАК энргРасчетДебиторскойЗадолженности
		|ГДЕ
		|	энргРасчетДебиторскойЗадолженности.Дата МЕЖДУ &НачПериод И &КонПериод
		|	И энргРасчетДебиторскойЗадолженности.Проведен";
	
	Запрос.УстановитьПараметр("КонПериод", Объект.КонПериода);
	Запрос.УстановитьПараметр("НачПериод", Объект.НачПериода);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Объект.ДокументыДЗ.Загрузить(ТЗ);
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДанныеНаСервере()
	
	Для Каждого Стр Из Объект.ДокументыДЗ Цикл 
		
		Если Стр.Загружать Тогда
			НоваяСтрока = Объект.Данные.Добавить();
			НоваяСтрока.ЛС 		= Стр.Абонент.ЛицевойСчет;
			НоваяСтрока.Абонент = Стр.Абонент;
			НоваяСтрока.Адрес 	= Стр.Документ.МКД;
			НоваяСтрока.Период 	= "" + Строка(Формат(Стр.Документ.НачПериода,"ДФ=dd.MM.yyyy"))+ "-" +Строка(Формат(Стр.Документ.КонПериода,"ДФ=dd.MM.yyyy"));//"" + Строка(Стр.Документ.ДатаПоследнегоРасчета)+ "-" +Строка(Стр.Документ.КонецПериода);
			НоваяСтрока.Сумма 	= Стр.Документ.СуммаЗадолженности;//Стр.Документ.СуммаВсего;
			НоваяСтрока.НомерСп = Объект.НомерРеестра;
			НоваяСтрока.СС		= "?";
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабДок(ТабДок)
	
	Макет = ПолучитьМакет(); 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	ОбластьИтог	  = Макет.ПолучитьОбласть("Итог");

	
	ОбластьШапка.Параметры.Номер = Объект.НомерРеестра;
	ОбластьШапка.Параметры.Дата  = Строка(Формат(Объект.Дата,"ДЛФ=D")) +" г.";
	ОбластьШапка.Параметры.Число = Объект.Данные.Количество();
	ТабДок.Вывести(ОбластьШапка);
	
	Счетчик = 0;
	Сумма = 0;
	Для Каждого Стр Из Объект.Данные Цикл
		Счетчик = Счетчик + 1;
		Сумма = Сумма + Стр.Сумма;
		ОбластьДанные.Параметры.пп = Счетчик;
		ОбластьДанные.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	ОбластьИтог.Параметры.Итого = Сумма;
	ТабДок.Вывести(ОбластьИтог);

КонецФункции

&НаСервере
Функция ПолучитьМакет()
	Возврат  РеквизитФормыВЗначение("Объект").ПолучитьМакет("РеестрДЗ");
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
