#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает номера пломб.
//
// Параметры:
//  Период			-	Дата.
//  мПриборыУчета	-	Массив из СправочникСсылка.энргПриборыУчетаАбонента.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьНомераПломб(Период, мПриборыУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.МестоУстановки КАК МестоУстановки,
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.НомерПломбы КАК НомерПломбы,
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.ВидПломбы КАК ВидПломбы
		|ИЗ
		|	РегистрСведений.бестНомерПломбПриборовУчетаНП.СрезПоследних(&Период, ПриборУчета В (&мПриборыУчета)) КАК бестНомерПломбПриборовУчетаНПСрезПоследних
		|ГДЕ
		|	бестНомерПломбПриборовУчетаНПСрезПоследних.Состояние
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриборУчета";
	
	Запрос.УстановитьПараметр("мПриборыУчета", мПриборыУчета);
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить();
	

КонецФункции

#КонецОбласти

#КонецЕсли