#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргУстановитьЗначениеПлощадиМКД(ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли; 
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ЗаполнитьПлощадьДоИзменения();
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьПлощадьДоИзменения();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадьДоИзменения()	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗначениеПлощадейМКДСрезПоследних.Услуга КАК Услуга,
		|	энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади КАК ВидПлощади,
		|	энргЗначениеПлощадейМКДСрезПоследних.Площадь КАК Площадь
		|ИЗ
		|	РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(, Период < &Период) КАК энргЗначениеПлощадейМКДСрезПоследних
		|ГДЕ
		|	энргЗначениеПлощадейМКДСрезПоследних.Организация = &Организация
		|	И энргЗначениеПлощадейМКДСрезПоследних.Район = &Район
		|	И энргЗначениеПлощадейМКДСрезПоследних.МКД = &МКД";
	
	Запрос.УстановитьПараметр("МКД", Объект.МКД);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для Каждого СтрокаПл Из Объект.ЗначениеПлощадей Цикл
			Если СтрокаПЛ.Услуга = ВыборкаДетальныеЗаписи.Услуга И СтрокаПл.ВидПлощади = ВыборкаДетальныеЗаписи.ВидПлощади Тогда
				СтрокаПЛ.ПлощадьДоИзменения = ВыборкаДетальныеЗаписи.Площадь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Элементы.ЗначениеПлощадейПлощадьДоИзменения.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьТЧСПлощадьмиНаСервере();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	иначе
		Объект.Район 			= ПредопределенноеЗначение("Справочник.энргЗоныОтвественности.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьТЧСПлощадьмиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧСПлощадьмиНаСервере()
	Объект.ЗначениеПлощадей.Очистить();
	
	Результат 		= энргРаботаСЛицевымСчетомСервер.ЗаполнитьПлощадьМКД(Новый Граница(Объект.Дата,ВидГраницы.Исключая), Объект.Организация, Объект.Район, Объект.МКД);	
	Выборка 		= Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ЗначениеПлощадей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	ЗаполнитьПлощадьДоИзменения();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧасти

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьТЧСПлощадьмиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПлощадиПриИзменении(Элемент)
	ТекДанные = Элементы.ЗначениеПлощадей.ТекущиеДанные;
	Если ТекДанные <> Неопределено И Не ЗначениеЗаполнено(ТекДанные.ВидПлощади) Тогда
		ТекДанные.ВидПлощади = ПредопределенноеЗначение("Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПлощадейПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "ЗначениеПлощадей");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти