
&НаКлиенте
Процедура ТаблицаОплатПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные 							= Элементы.ТаблицаОплат.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПП(Команда)
	
	
	Массив = Новый Массив;
	
	Для Каждого Стр Из ТаблицаОплат Цикл
		
		Массив.Добавить(Стр);
		
	КонецЦикла;
	
	ЗакрытьФорму(Массив);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Массив)
	Если Массив <> Неопределено Тогда
		Закрыть(Массив);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОплатАбонентПриИзменении(Элемент)

	ТекущиеДанные 							= Элементы.ТаблицаОплат.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекущиеДанные.Абонент) Тогда
		ТекущиеДанные.КлючПомещения = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Абонент, "КлючПомещения");
	Иначе 
		ТекущиеДанные.КлючПомещения = ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОплатСуммаОплатыПриИзменении(Элемент)
	ТекущиеДанные 							= Элементы.ТаблицаОплат.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные.СуммаОстаток = ТекущиеДанные.СуммаОплаты;

КонецПроцедуры
