  
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестЗагрузкаСредневзвешеннойНерегулируемойЦеныСАТС(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область События_Шапки 

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	ПериодНачисления = НачалоМесяца(ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Файл = ДиалогВыбораФайла.ПолноеИмяФайла;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Если НЕ МобильныйКлиент Тогда

#Область События_Команды 

&НаКлиенте
Процедура Загрузить(Команда)
	ExcelApp = Новый COMОбъект("Excel.Application");
	Попытка
		Книга = ExcelApp.Workbooks.Open(Файл);
	Исключение                                                                        
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось открыть файл. Возможно, он открыт в другом приложении.'"));
		Возврат;
	КонецПопытки; 	
	Попытка
		Страница = Книга.Worksheets(1);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка: Не удалось найти лист в файле.'"));
		ExcelApp.Quit();
		Возврат;
	КонецПопытки;
	
	ПрочитатьЛистExcel(Страница);
	ExcelApp.Quit();
	ЗагрузитьЦены();
	ЗначенияНерегулируемойЦены.Очистить();
	ПочасовыеЗначения.Очистить();
 
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена!");
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область События_РаботаСФайлом 

&НаКлиенте
Процедура ПрочитатьЛистExcel(ЛистЭксель) 
	НомерСтрокиОтсчета = ПолучитьСтрокуОтсчета(ЛистЭксель);
	Если НомерСтрокиОтсчета = -1 Тогда
		Возврат;
	КонецЕсли; 
	
	ЦенаНаМощность = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(НомерСтрокиОтсчета + 23,2).Text));
	ЦенаНаЭлектроэнергию = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(НомерСтрокиОтсчета + 24,2).Text));
		
	НовСтр = ЗначенияНерегулируемойЦены.Добавить();
	НовСтр.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.Ночь");
	НовСтр.Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(НомерСтрокиОтсчета + 2,2).Text));
	
	НовСтр = ЗначенияНерегулируемойЦены.Добавить();
	НовСтр.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.Полупик");
	НовСтр.Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(НомерСтрокиОтсчета + 3,2).Text));
	
	НовСтр = ЗначенияНерегулируемойЦены.Добавить();
	НовСтр.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.Пик");
	НовСтр.Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(НомерСтрокиОтсчета + 4,2).Text));
	
	НовСтр = ЗначенияНерегулируемойЦены.Добавить();
	НовСтр.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.День");
	НовСтр.Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(НомерСтрокиОтсчета + 7,2).Text));
	
	НовСтр = ЗначенияНерегулируемойЦены.Добавить();
	НовСтр.Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(НомерСтрокиОтсчета + 23,2).Text));
	
	НомерПервойКолонки 	= 3;
	НомерПервойСтроки 	= ?(ШаблонДоАпреля2024, НомерСтрокиОтсчета + 39, НомерСтрокиОтсчета + 49);
	ВсегоСтрок 			= День(КонецМесяца(ПериодНачисления))*24 + НомерПервойСтроки - 1;
	ВсегоКолонок 		= 6;
		
	Для Строка = НомерПервойСтроки По ВсегоСтрок Цикл
		НоваяСтрока = ПочасовыеЗначения.Добавить();
		НоваяСтрока.День = СтроковыеФункцииКлиентСервер.СтрокаВДату(СокрЛП(ЛистЭксель.Cells(Строка,1).Text));
		НоваяСтрока.Час  = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(Строка,2).Text));
		Для Колонка = НомерПервойКолонки По ВсегоКолонок Цикл
			НоваяСтрока["Цена" + Колонка] = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(ЛистЭксель.Cells(Строка,Колонка).Text));      				
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуОтсчета(ЛистЭксель) 
	НомерПервойСтроки = 1;
	ВсегоСтрок			= ЛистЭксель.Cells.SpecialCells(11).Row;
	Для Строка = НомерПервойСтроки По ВсегоСтрок Цикл 
		Если СокрЛП(ЛистЭксель.Cells(Строка,1).Text) = "Дифференцированные по зонам суток расчетного периода средневзвешенные нерегулируемые цены на электрическую энергию (мощность) на оптовом рынке и средневзвешенные нерегулируемые цены на электрическую энергию на оптовом рынке, определяемые для соответствующих зон суток, руб/МВтч" Тогда
			Возврат Строка;
		КонецЕсли;
	КонецЦикла;
    Возврат -1;
КонецФункции
	
#КонецОбласти

#Область События_ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ЗагрузитьЦены() 
	СоздатьбестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены();
	СоздатьбестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК();
КонецПроцедуры

&НаСервере
Процедура СоздатьбестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены() 
	ДокументОб = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены
		|ГДЕ
		|	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ПериодНачисления = &ПериодНачисления
		|	И бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Организация = &Организация
		|	И бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Район = &Район";
	
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если ДокументОб = Неопределено Тогда
		ДокументОб 					= Документы.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.СоздатьДокумент();
		ДокументОб.Организация 		= Организация; 
		ДокументОб.Район 			= Район;
		ДокументОб.ПериодНачисления = ПериодНачисления;
		ДокументОб.Дата				= ТекущаяДатаСеанса();
	Иначе
		ДокументОб.ЗначенияНерегулируемойЦены.Очистить();
		ДокументОб.РазрезыПочасовыхЗначений.Очистить();
		ДокументОб.ПочасовыеЗначения.Очистить();
	КонецЕсли;
		
	Для каждого стр из ЗначенияНерегулируемойЦены Цикл
		Если ЗначениеЗаполнено(стр.ТарифнаяЗона) Тогда
			
			НовСтр2ЦК = ДокументОб.ЗначенияНерегулируемойЦены.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтр2ЦК, стр);
			НовСтр2ЦК.Поставщик = Поставщик;
			НовСтр2ЦК.Услуга = Электроэнергия;
			НовСтр2ЦК.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ВтораяЦК;
		Иначе
			НовСтр3ЦК = ДокументОб.ЦеныНаМощность.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр3ЦК, стр);
			НовСтр3ЦК.Поставщик = Поставщик;
			НовСтр3ЦК.Услуга = Мощность;
			НовСтр3ЦК.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ТретьяЦК;
			
			НовСтр4ЦК = ДокументОб.ЦеныНаМощность.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр4ЦК, НовСтр3ЦК);
			НовСтр4ЦК.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ЧетвертаяЦК;
			
			НовСтр5ЦК = ДокументОб.ЦеныНаМощность.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр5ЦК, НовСтр3ЦК);
			НовСтр5ЦК.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ПятаяЦК;
			
			НовСтр6ЦК = ДокументОб.ЦеныНаМощность.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр6ЦК, НовСтр3ЦК);
			НовСтр6ЦК.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ШестаяЦК;
		КонецЕсли;
	КонецЦикла;
		
	НовСтр3ЦКФакт 					= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	НовСтр3ЦКФакт.IDСтроки 			= Новый УникальныйИдентификатор;
	НовСтр3ЦКФакт.Поставщик 		= Поставщик;
	НовСтр3ЦКФакт.ТипЦены 			= Перечисления.бестТипыЦенНаЭЭ.ФактическоеЗначение;
	НовСтр3ЦКФакт.Услуга 			= Электроэнергия;
	НовСтр3ЦКФакт.ЦеноваяКатегория 	= Перечисления.бестЦеновыеКатегории.ТретьяЦК;
	
	НовСтр4ЦКФакт 					= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр4ЦКФакт,НовСтр3ЦКФакт); 
	НовСтр4ЦКФакт.IDСтроки 			= Новый УникальныйИдентификатор;
	НовСтр4ЦКФакт.ЦеноваяКатегория 	= Перечисления.бестЦеновыеКатегории.ЧетвертаяЦК;
	
	НовСтр5ЦКФакт 					= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр5ЦКФакт,НовСтр3ЦКФакт); 
	НовСтр5ЦКФакт.IDСтроки 			= Новый УникальныйИдентификатор;
	НовСтр5ЦКФакт.ЦеноваяКатегория 	= Перечисления.бестЦеновыеКатегории.ПятаяЦК;
	
	НовСтр6ЦКФакт 					= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр6ЦКФакт,НовСтр3ЦКФакт); 
	НовСтр6ЦКФакт.IDСтроки 			= Новый УникальныйИдентификатор;
	НовСтр6ЦКФакт.ЦеноваяКатегория 	= Перечисления.бестЦеновыеКатегории.ШестаяЦК;
	
	НовСтр5ЦКПревышениеНадФактом 			= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр5ЦКПревышениеНадФактом,НовСтр5ЦКФакт); 
	НовСтр5ЦКПревышениеНадФактом.IDСтроки 	= Новый УникальныйИдентификатор;
	НовСтр5ЦКПревышениеНадФактом.ТипЦены 	= Перечисления.бестТипыЦенНаЭЭ.ПревышениеНадФактом;
	
	НовСтр6ЦКПревышениеНадФактом 			= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр6ЦКПревышениеНадФактом,НовСтр5ЦКПревышениеНадФактом); 
	НовСтр6ЦКПревышениеНадФактом.IDСтроки 	= Новый УникальныйИдентификатор;
	НовСтр6ЦКПревышениеНадФактом.ЦеноваяКатегория 	= Перечисления.бестЦеновыеКатегории.ШестаяЦК;
		
	НовСтр5ЦКПревышениеНадПланом 			= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр5ЦКПревышениеНадПланом,НовСтр5ЦКФакт); 
	НовСтр5ЦКПревышениеНадПланом.IDСтроки 	= Новый УникальныйИдентификатор;
	НовСтр5ЦКПревышениеНадПланом.ТипЦены 	= Перечисления.бестТипыЦенНаЭЭ.ПревышениеНадПланом;
	
	НовСтр6ЦКПревышениеНадПланом 			= ДокументОб.РазрезыПочасовыхЗначений.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр6ЦКПревышениеНадПланом,НовСтр5ЦКПревышениеНадПланом); 
	НовСтр6ЦКПревышениеНадПланом.IDСтроки 	= Новый УникальныйИдентификатор;
	НовСтр6ЦКПревышениеНадПланом.ЦеноваяКатегория 	= Перечисления.бестЦеновыеКатегории.ШестаяЦК;

	Для каждого стр из ПочасовыеЗначения Цикл
		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр3ЦКФакт.IDСтроки;
		НовСтр.Значение = стр.Цена6;

		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр4ЦКФакт.IDСтроки;
		НовСтр.Значение = стр.Цена6;
		
		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр5ЦКПревышениеНадПланом.IDСтроки;
		НовСтр.Значение = стр.Цена4;

		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр6ЦКПревышениеНадПланом.IDСтроки;
		НовСтр.Значение = стр.Цена4;

		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр5ЦКПревышениеНадФактом.IDСтроки;
		НовСтр.Значение = стр.Цена5;

		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр6ЦКПревышениеНадФактом.IDСтроки;
		НовСтр.Значение = стр.Цена5;

		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр6ЦКФакт.IDСтроки;
		НовСтр.Значение = стр.Цена3;

		НовСтр = ДокументОб.ПочасовыеЗначения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, стр);
		НовСтр.IDСтроки = НовСтр5ЦКФакт.IDСтроки;
		НовСтр.Значение = стр.Цена3;

	КонецЦикла;
	
	ДокументОб.ФайлЗагрузки = Файл;
	Попытка
		ДокументОб.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДокументОб.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	СозданныйДокумент = ДокументОб.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьбестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК() 
	ДокументОб = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК КАК бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК
		|ГДЕ
		|	бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК.ПериодНачисления = &ПериодНачисления
		|	И бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК.Организация = &Организация
		|	И бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК.Район = &Район";
	
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	Если ДокументОб = Неопределено Тогда
		ДокументОб 					= Документы.бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК.СоздатьДокумент();
		ДокументОб.Организация 		= Организация; 
		ДокументОб.Район 			= Район;
		ДокументОб.ПериодНачисления = ПериодНачисления;
		ДокументОб.Дата				= ТекущаяДатаСеанса();
	КонецЕсли;
		
	ДокументОб.ФайлЗагрузки 		= Файл; 
	ДокументОб.Поставщик 			= Поставщик; 
	ДокументОб.Услуга 				= Электроэнергия;
	ДокументОб.ТарифнаяЗона 		= Справочники.энргТарифныеЗоны.БезРазбивки;  
	ДокументОб.ЦенаНаЭлектроэнергию = ЦенаНаЭлектроэнергию;
	ДокументОб.ЦенаНаМощность 		= ЦенаНаМощность;
	
	
	Попытка
		ДокументОб.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ДокументОб.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	СозданныйДокументДанныхДляРасчета = ДокументОб.Ссылка;
	
КонецПроцедуры

#КонецОбласти
