#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииОперацииСЛС(КомандыСоздатьНаОсновании);
	
	Возврат Документы.энргОперацияСЛицевымСчетом.ДобавитьКомандуСоздатьНаОснованииЗакрытияЛС(КомандыСоздатьНаОсновании);
	
КонецФункции

// Заполняет список команд создания на основании закрытие ЛС.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииЗакрытияЛС(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргОперацияСЛицевымСчетом) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "ВводНаОснованииБиллингКлиент.ОткрытиеЛицевогоСчетаНаОснованииЗакрытияЛС";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ОткрытиеЛицевогоСчетаНаОснованииЗакрытияЛС";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Открытие лс'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Заполняет список команд создания на основании договора контрагента.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 СтрокаТаблицыЗначений
//
Функция ДобавитьКомандуСоздатьНаОснованииДоговораКонтрагента(КомандыСоздатьНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргОперацияСЛицевымСчетом) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик 		= "бестВводНаОснованииКлиент.ОткрытиеЛицевогоСчетаНаОснованииДоговораКонтрагента";
		КомандаСоздатьНаОсновании.Идентификатор 	= "ОткрытиеЛицевогоСчетаНаОснованииДоговораКонтрагента";
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Открытие лс'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд создания открытия ЛС на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияОткрытияЛицевогоСчетаНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииОперацииСЛС(КомандыСоздатьНаОсновании);
	
КонецФункции

// Заполняет ключи помещения и строения.
//
// Параметры:
//	 Ссылка - энргОперацияСЛицевымСчетом.Ссылка
//
// Возвращаемое значение:
//	 Массив
Функция ПроверкаИзмененийДанныхДокумента (Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетом.КлючПомещения.Строение КАК КлючПомещенияСтроение,
	|	энргОперацияСЛицевымСчетом.КлючПомещения.Помещение КАК КлючПомещенияПомещение
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

#Область РеализацияИнтерфейса_СозданиеНаОсновании

// Получает данные заполнения на основании операции с лицевым счетом.
//
// Параметры:
//  ДокументСсылка	-	ДокументСсылка.энргОперацияСЛицевымСчетом.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ДанныеЗполненияНаОснованииОперацииСЛицевымСчетом(ДокументСсылка) Экспорт 
	
	Текст 						= 
	"ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ ДанныеШапки
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка = &ДокументСсылка";
	
	Схема  						= Новый СхемаЗапроса;
	Пакет 						= Схема.ПакетЗапросов[0];
	Пакет.УстановитьТекстЗапроса(Текст);
	
	ПараметрыКлючиПомещений		= Новый Структура;
	ПараметрыКлючиПомещений.Вставить("Отбор", Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВременнаяТаблица", Новый Структура("КлючПомещения","КлючПомещения"), "ДанныеШапки"));
	РегистрыСведений.энргКлючиПомещений.ДанныеПомещения(Схема,ПараметрыКлючиПомещений,"ДанныеПомещения");
	
	ПараметрыПомещения 			= Новый Структура;
	ПараметрыПомещения.Вставить("ПараметрыВТ", Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,КлючПомещения","Организация","Район","КлючПомещения"), "ДанныеШапки"));
	
	РегистрыСведений.энргКоличествоКомнат.ТекстСрезПоследних(Схема,			ПараметрыПомещения,	"КоличествоКомнатПомещения");
	РегистрыСведений.энргКоличествоПроживающих.КоличествоПроживающихПомещения(Схема,	ПараметрыПомещения,	"КоличествоПроживающихПомещения");
	РегистрыСведений.энргКоличествоПрописанных.КоличествоПрописанныхПомещения(Схема,	ПараметрыПомещения,	"КоличествоПрописанныхПомещения");
	РегистрыСведений.энргКоличествоСобственников.КоличествоСобственниковПомещения(Схема,	ПараметрыПомещения,	"КоличествоСобственниковПомещения");
	РегистрыСведений.энргТипСобственностиАбонентов.ТекстСрезПоследних(Схема,ПараметрыПомещения,	"ТипСобственностиПомещения");
	
	ПараметрыВТМКД 				= Новый Массив;
	ПараметрыВТМКД.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район","Организация","Район"), "ДанныеШапки"));
	ПараметрыВТМКД.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВременнаяТаблица", Новый Структура("МКД","МКД"), "ДанныеПомещения"));
	ПараметрыМКД 				= Новый Структура;
	ПараметрыМКД.Вставить("ПараметрыВТ", ПараметрыВТМКД);
	РегистрыСведений.бестРабочиеПостановленияМКД.ТекстСрезПоследних(Схема,	ПараметрыМКД,	"РабочиеПостановленияМКД");
	
	ПараметрыМаршрутПомещения 	= Новый Структура;
	ПараметрыМаршрутПомещения.Вставить("Отбор", Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВременнаяТаблица", Новый Структура("КлючПомещения","КлючПомещения"), "ДанныеШапки"));
	Справочники.энргМаршрутыКонтроллеров.ТекстМаршрутПоКлючуПомещения(Схема, ПараметрыМаршрутПомещения, "МаршрутКонтроллера");
	
	ПакетСвойстваПомещения		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	ПакетСвойстваПомещения.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоКомнат) КАК КоличествоКомнат,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоПроживающих) КАК КоличествоПроживающих,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоПрописанных) КАК КоличествоПрописанных,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоСобственников) КАК КоличествоСобственников,
	|	МАКСИМУМ(ВложенныйЗапрос.ТипСобственностиЖилья) КАК ТипСобственностиЖилья,
	|	МАКСИМУМ(ВложенныйЗапрос.НомерДоговораСоцНайма) КАК НомерДоговораСоцНайма,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаДоговораСоцНайма) КАК ДатаДоговораСоцНайм
	|ПОМЕСТИТЬ СвойстваПомещения
	|ИЗ
	|	(ВЫБРАТЬ
	|		КоличествоКомнатПомещения.Организация КАК Организация,
	|		КоличествоКомнатПомещения.Район КАК Район,
	|		КоличествоКомнатПомещения.КлючПомещения КАК КлючПомещения,
	|		КоличествоКомнатПомещения.Количество КАК КоличествоКомнат,
	|		0 КАК КоличествоПроживающих,
	|		0 КАК КоличествоПрописанных,
	|		0 КАК КоличествоСобственников,
	|		ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка) КАК ТипСобственностиЖилья,
	|		"""" КАК НомерДоговораСоцНайма,
	|		ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДоговораСоцНайма
	|	ИЗ
	|		КоличествоКомнатПомещения КАК КоличествоКомнатПомещения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КоличествоПроживающихПомещения.Организация,
	|		КоличествоПроживающихПомещения.Район,
	|		КоличествоПроживающихПомещения.КлючПомещения,
	|		0,
	|		КоличествоПроживающихПомещения.Количество,
	|		0,
	|		0,
	|		ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка),
	|		"""",
	|		ДАТАВРЕМЯ(1, 1, 1)
	|	ИЗ
	|		КоличествоПроживающихПомещения КАК КоличествоПроживающихПомещения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КоличествоПрописанныхПомещения.Организация,
	|		КоличествоПрописанныхПомещения.Район,
	|		КоличествоПрописанныхПомещения.КлючПомещения,
	|		0,
	|		0,
	|		КоличествоПрописанныхПомещения.Количество,
	|		0,
	|		ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка),
	|		"""",
	|		ДАТАВРЕМЯ(1, 1, 1)
	|	ИЗ
	|		КоличествоПрописанныхПомещения КАК КоличествоПрописанныхПомещения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КоличествоСобственниковПомещения.Организация,
	|		КоличествоСобственниковПомещения.Район,
	|		КоличествоСобственниковПомещения.КлючПомещения,
	|		0,
	|		0,
	|		0,
	|		КоличествоСобственниковПомещения.Количество,
	|		ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка),
	|		"""",
	|		ДАТАВРЕМЯ(1, 1, 1)
	|	ИЗ
	|		КоличествоСобственниковПомещения КАК КоличествоСобственниковПомещения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РабочиеПостановленияМКД.Организация,
	|		РабочиеПостановленияМКД.Район,
	|		ДанныеПомещения.КлючПомещения,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ПустаяСсылка),
	|		"""",
	|		ДАТАВРЕМЯ(1, 1, 1)
	|	ИЗ
	|		РабочиеПостановленияМКД КАК РабочиеПостановленияМКД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПомещения КАК ДанныеПомещения
	|			ПО РабочиеПостановленияМКД.МКД = ДанныеПомещения.МКД
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТипСобственностиПомещения.Организация,
	|		ТипСобственностиПомещения.Район,
	|		ТипСобственностиПомещения.КлючПомещения,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ТипСобственностиПомещения.ТипСобственности,
	|		ТипСобственностиПомещения.НомерДоговораСоцНайма,
	|		ТипСобственностиПомещения.ДатаДоговораСоцНайма
	|	ИЗ
	|		ТипСобственностиПомещения КАК ТипСобственностиПомещения) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения");  			
	
	ПакетРезультирующий 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	ПакетРезультирующий.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.Район КАК Район,
	|	ДанныеШапки.КлючПомещения КАК КлючПомещения,
	|	ДанныеПомещения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеПомещения.Строение КАК Строение,
	|	ДанныеПомещения.Помещение КАК Помещение,
	|	СвойстваПомещения.КоличествоКомнат КАК КоличествоКомнат,
	|	СвойстваПомещения.КоличествоПроживающих КАК КоличествоПроживающих,
	|	СвойстваПомещения.КоличествоПрописанных КАК КоличествоПрописанных,
	|	СвойстваПомещения.КоличествоСобственников КАК КоличествоСобственников,
	|	СвойстваПомещения.ТипСобственностиЖилья КАК ТипСобственностиЖилья,
	|	СвойстваПомещения.ВидОбъекта КАК ВидОбъекта,
	|	СвойстваПомещения.НомерДоговораСоцНайма КАК НомерДоговораСоцНайма,
	|	СвойстваПомещения.ДатаДоговораСоцНайма КАК ДатаДоговораСоцНайма,
	|	МаршрутКонтроллера.Контроллер КАК Контроллер,
	|	МаршрутКонтроллера.МаршрутКонтроллера КАК МаршрутКонтроллера
	|ИЗ
	|	ДанныеШапки КАК ДанныеШапки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвойстваПомещения КАК СвойстваПомещения
	|		ПО ДанныеШапки.Организация = СвойстваПомещения.Организация
	|			И ДанныеШапки.Район = СвойстваПомещения.Район
	|			И ДанныеШапки.КлючПомещения = СвойстваПомещения.КлючПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаршрутКонтроллера КАК МаршрутКонтроллера
	|		ПО ДанныеШапки.КлючПомещения = МаршрутКонтроллера.КлючПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПомещения КАК ДанныеПомещения
	|		ПО ДанныеШапки.КлючПомещения = ДанныеПомещения.КлючПомещения");
	
	ДанныеЗаполнения 		= Новый Структура;
	Запрос 					= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Результат		 		= Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат ДанныеЗаполнения;
	КонецЕсли;
	
	Выборка 				= Результат.Выбрать();
	Выборка.Следующий();
	
	Для Каждого КолонкаРезультат Из Результат.Колонки Цикл
		ДанныеЗаполнения.Вставить(КолонкаРезультат.Имя, Выборка[КолонкаРезультат.Имя]);
	КонецЦикла;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

// Получает изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответсвие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета = Новый Соответствие; 
	
	ИзменяемыеПараметры = Новый Массив;
	ИзменяемыеПараметры.Добавить("*");
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры = Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета,Услуга","ЛСОткрыт,УслугаПодключена,ДатаСостоянияЛицевогоСчета,Плательщик"));
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета,Услуга","Абонент,ЛСОткрыт,УслугаПодключена,ДатаСостоянияПрибора,КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников,ДатаСостоянияЛицевогоСчета,Плательщик, ДопСоциальнаяНормаПотребления"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры = Новый Массив; 
	ИзменяемыеПараметры.Добавить(Новый Структура("Ресурсы","ЛСОткрыт,УслугаПодключена,ПриборВведен,ДатаСостоянияЛицевогоСчета,ПериодНачисленияВыводаПрибора"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС, ИзменяемыеПараметры); 	
	
	// Для связанных помещений вид операции будет пустой
	ИзменяемыеПараметры = Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ресурсы,СвойстваСоставаЖильцов", "СоставЖильцов, КоличествоКомнат", "КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	
	Возврат ИзменяемыеПараметрыРасчета;
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт 
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамОткрытиеЛицевогоСчета(Схема,ВыбираемыеТаблицы);	
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамЗакрытиеЛицевогоСчета(Схема,ВыбираемыеТаблицы);
	ПолучитьДанныеДляПроведенияПоСтабильнымПериодамСменаСобственника(Схема,ВыбираемыеТаблицы);
КонецПроцедуры

// Получает данные изменения площади.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеИзмененияПлощади(Схема,ВыбираемыеТаблицы) Экспорт 
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеПлощадиОткрытиеЛС";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияПлощади());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
КонецПроцедуры

// Получает данные изменения состава шкал.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеИзмененияСоставаШкал(Схема,ВыбираемыеТаблицы) Экспорт
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеСоставаШкалОткрытиеЛС";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияСоставаШкал());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
КонецПроцедуры

// Получает данные изменения измерителей.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеИзмененияИзмерителей(Схема,ВыбираемыеТаблицы) Экспорт
	
	перем Пакет;
	
	ИмяТаблицы 											= "ИзменениеИзмеретелйОткрытиеЛС";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстПолучитьДанныеИзмененияИзмерителей());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

// Получает льготу контрагента.
//
// Параметры:
//  Контрагент	-	СправочникСсылка.энргКонтрагенты.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Период		-	Дата.
// 
// Возвращаемое значение:
//   СправочникСсылка.энргЛьготныеКатегории.
//
Функция ПолучитьЛьготуКонтрагента(Контрагент, Организация, Район, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЖильцыЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория КАК ЛьготнаяКатегория
	|ИЗ
	|	РегистрСведений.энргЖильцыЛьготныхКатегорий.СрезПоследних(
	|			&Период,
	|			Жилец = &Жилец
	|				И Организация = &Организация
	|				И Район = &Район) КАК бестЖильцыЛьготныхКатегорийСрезПоследних";
	
	Запрос.УстановитьПараметр("Жилец", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат  ВыборкаДетальныеЗаписи.ЛьготнаяКатегория;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Получает процент льготы.
//
// Параметры:
//  ЛьготнаяКатегория	-	СправочникСсылка.энргЛьготныеКатегории.
//  Организация			-	СправочникСсылка.Организации.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Период				-	Дата.
// 
// Возвращаемое значение:
//   Число.
//
Функция ПолучитьПроцентЛьготы(ЛьготнаяКатегория, Организация, Район, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЗначенияЛьготныхКатегорийСрезПоследних.ПроцентОтНачислений КАК ПроцентОтНачислений
	|ИЗ
	|	РегистрСведений.энргЗначенияЛьготныхКатегорий.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ЛьготнаяКатегория = &ЛьготнаяКатегория) КАК бестЗначенияЛьготныхКатегорийСрезПоследних";
	
	Запрос.УстановитьПараметр("ЛьготнаяКатегория", ЛьготнаяКатегория);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат  ВыборкаДетальныеЗаписи.ПроцентОтНачислений;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Основание				= Неопределено;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ключ, "ВидОперации");//Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСЛицевымСчетом",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСЛицевымСчетом",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСЛицевымСчетом",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;			
		ИначеЕсли  Параметры.свойство("Основание", Основание) И ТипЗнч(Основание) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда
			ВидОперации 		= Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСЛицевымСчетом",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОперацияСЛицевымСчетом");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует данные документа.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.энргОперацияСЛицевымСчетом.
//  ДополнительныеСвойства	-	Структура.
//  Регистры				-	Произвольный.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	ИнициализироватьИсходныеДанныеДокумента(Схема);
	
	ДобавитьТекстЗапросаАбонентыПомещений(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеЛС(Схема, Регистры);
	ДобавитьТекстЗапросаЗакрытиеЛС(Схема, Регистры);
	ДобавитьТекстЗапросаКоличествоПроживающих(Схема, Регистры);
	ДобавитьТекстЗапросаКоличествоПрописанных(Схема, Регистры);
	ДобавитьТекстЗапросаКоличествоСобственников(Схема, Регистры);
	ДобавитьТекстЗапросаКоличествоКомнат(Схема, Регистры);
	ДобавитьТекстЗапросаСобственникиПомещений(Схема, Регистры);
	ДобавитьТекстЗапросаТипСобственностиАбонентов(Схема, Регистры);
	
	ДобавитьТекстЗапросаПроживаниеЖильцов(Схема, Регистры);
	
	ДобавитьТекстЗапросаЗначенияПлощадей(Схема, Регистры);
	ДобавитьТекстЗапросаВидБлагоустройствАбонента(Схема, Регистры);
	ДобавитьТекстЗапросаГруппыПотребителейАбонентов(Схема, Регистры);
	
	ДобавитьТекстЗапросаВладельцыТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаРодителейТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаАктивностьТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаУслугиТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаПриборыТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУ(Схема, Регистры);
	ДобавитьТекстЗапросаСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаДиаметрСеченияТочекУчета(Схема, Регистры);	
	ДобавитьТекстЗапросаНаправлениеИспользованияТочекУчета(Схема, Регистры);
	
	ДобавитьТекстЗапросаЗначенияИзмерителейТочекУчета(Схема, Регистры);
	
	ДобавитьТекстЗапросаПоставщикиУслугАбонента(Схема, Регистры);
	
	ДобавитьТекстЗапросаПлательщикиУслугАбонента(Схема, Регистры);
	
	ДобавитьТекстЗапросаКоэффциентыПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаВидыДифференцированностиПриборовУчета(Схема, Регистры); 	
	ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема, Регистры); 
	ДобавитьТекстЗапросаСостояниеПриборовУчетаАбонента(Схема, Регистры);
	ДобавитьТекстЗапросаСоставУзлаУчета(Схема, Регистры);
	
	ДобавитьТекстЗапросаДоговорыАбонентов(Схема, Регистры);
	
	ДобавитьТекстЗапросаСостояниеВидовПотерьТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаЗначенияПотерьТочекУчета(Схема, Регистры);
	
	ДобавитьТекстЗапросаТУНаСтруктуреСети(Схема, Регистры);
	
	ДобавитьТекстЗапросаТочкиПоставкиТочекУчета(Схема, Регистры);
	
	ДобавитьТекстЗапросаЖильцыЛьготныхКатегорий(Схема, Регистры);
	ДобавитьТекстЗапросаСпособыДоставкиКвитанции(Схема, Регистры);
	ДобавитьТекстЗапросаНазначенияПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаТочкиПоставкиСНТ(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", 	ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыТаблицыПодмены(Запрос, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

// Инициализирует таблицы для контроля.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.энргОперацияСЛицевымСчетом.
//  ДополнительныеСвойства	-	Структура.
//
Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
	
	КлючиТаблицКонтроля  						= Новый Структура;
	
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции мкд закрыт'"); 
	ДанныеСтроения 								= ДополнительныеСвойства.ДанныеСтроения;
	
	Запрос  									= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 								ДокументСсылка);
	Запрос.УстановитьПараметр("ЧастныйСектор",								ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение", 									ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

#Область РеализацияИнтерфейса_РаботаСГИЖКХ

// Заполняет схему строение помещения для передачи в ГИСЖКХ.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуСтроенияПомещенияДляПередачиВГИСЖКХ(Схема,ПараметрыСхемы,ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтроенияПомещенияДляПередачиВГИСЖКХ());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

#Область Договоры

// Заполняет схему заключение договоров для передачи в ГИСЖКХ.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуЗаключениеДоговоровДляПередачиВГИСЖКХ(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеЗаключениеДоговоров());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

// Заполняет схему расторжение договоров для передачи в ГИСЖКХ.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуРасторжениеДоговоровДляПередачиВГИСЖКХ(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДанныеРасторжениеДоговоров());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

// Заполняет схему услуги договоров для передачи.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуУслугиДоговоровДляПередачи(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаУслугиДоговоровДляПередачи());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

#КонецОбласти

#Область ЛицевыеСчета

// Заполняет схему лицевых счетов для передачи в ГИСЖКХ.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуЛицевыеСчетаДляПередачиВГИСЖКХ(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗначенияПлощадейСменаСобственника());
	Пакет.ТаблицаДляПомещения 	= "ЗначенияПлощадейСменаСобственника";
	
	Пакет 						= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЛицевыеСчетаДляПередачи());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

// Заполняет схему закрытие лицевых счетов в ГИСЖКХ.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуЗакрытиеЛицевыхСчетовВГИСЖКХ(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗакрытиеЛицевыхСчетовГИСЖКХ());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

#КонецОбласти

#Область ПриборыУчета

// Заполняет схему приборов учета для передачи.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуПриборыУчетаДляПередачи(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляПередачи());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
КонецПроцедуры

// Заполняет схему приборов учета для обновления.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуПриборыУчетаДляОбновления(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт 

	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляОбновления());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
КонецПроцедуры

// Заполняет схему приборов учета для архивации.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыСхемы		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуПриборыУчетаДляАрхивации(Схема, ПараметрыСхемы, ТаблицаДляПомещения= "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить();
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПриборыУчетаДляАрхивации());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаСДоговоромДоТП

// Получает документ открытия лицевого счета с договором до ТП.
//
// Параметры:
//  Абонент	-	СправочникСсылка.энргАбоненты.
// 
// Возвращаемое значение:
//   ДокументСсылка.энргОперацияСЛицевымСчетом.
//
Функция ДокументОткрытияЛицевогоСчетаСДоговоромДоТП(Абонент) Экспорт 
	
	Результат = ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
		|ГДЕ
		|	энргОперацияСЛицевымСчетом.Проведен
		|	И энргОперацияСЛицевымСчетом.ДоговорЗаключенДоТП
		|	И энргОперацияСЛицевымСчетом.Абонент = &Абонент";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	Если РезультатЗапроса.Пустой() Тогда
		Результат  = Документы.энргВводНачальныхОстатков.ПолучениеДанныхЛицевогоСчетаСДоговоромДоТП(Абонент);
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.Ссылка;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет есть ли точки СОРП.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЕстьТочкиСОРП(Период, Организация, Район, КлючПомещения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние КАК Состояние,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ОРП)";
	
	Запрос.УстановитьПараметр("КлючПомещения"	, КлючПомещения);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Район"			, Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема)
	ПолучитьШапкуДокумента(Схема);
	ПолучитьТаблицуТочекУчета(Схема);
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Дата,
	|	Шапка.ДатаФактическогоСобытия КАК ДатаФактическогоСобытия,
	|	Шапка.Организация КАК Организация,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Район КАК Район,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.АбонентСмена КАК АбонентСмена,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	Шапка.КоличествоКомнат КАК КоличествоКомнат,
	|	Шапка.КоличествоПроживающих КАК КоличествоПроживающих,
	|	Шапка.КоличествоПрописанных КАК КоличествоПрописанных,
	|	Шапка.КоличествоСобственников КАК КоличествоСобственников,
	|	Шапка.Контроллер КАК Контроллер,
	|	Шапка.МаршрутКонтроллера КАК МаршрутКонтроллера,
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.ТипСобственностиЖилья КАК ТипСобственностиЖилья,
	|	Шапка.ТипПлиты КАК ТипПлиты,
	|	Шапка.НомерДоговораСоцНайма КАК НомерДоговораСоцНайма,
	|	Шапка.ДатаДоговораСоцНайма КАК ДатаДоговораСоцНайма,
	|	Шапка.ДолеваяСобственность КАК ДолеваяСобственность,
	|	Шапка.Договор КАК Договор,
	|	Шапка.СпособДоставкиЕПД КАК СпособДоставкиЕПД,
	|	Шапка.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ ШапкаДокумента
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)");	
КонецПроцедуры  

Процедура ПолучитьТаблицуТочекУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетомТочкиУчета.Ссылка КАК Ссылка,
	|	энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки,
	|	энргОперацияСЛицевымСчетомТочкиУчета.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ДатаПриемки КАК ДатаПриемки,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ДатаУстановкиСчетчика КАК ДатаУстановкиСчетчика,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ДиаметрСечения КАК ДиаметрСечения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОперацияСЛицевымСчетомТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОперацияСЛицевымСчетомТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	энргОперацияСЛицевымСчетомТочкиУчета.НомерПломбы КАК НомерПломбы,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Поставщик КАК Поставщик,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.РассчитыватьПоДиаметруСечения КАК РассчитыватьПоДиаметруСечения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.СтруктураСети КАК СтруктураСети,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Техническая КАК Техническая,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Услуга КАК Услуга,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Энергоназначение КАК Энергоназначение,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	энргОперацияСЛицевымСчетомТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Плательщик КАК Плательщик
	|ПОМЕСТИТЬ ТаблицаТочекУчета
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|ГДЕ
	|	энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В(&мДокументы)");	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапроса

Процедура ДобавитьТекстЗапросаАбонентыПомещений(Схема, Регистры)
	
	ИмяРегистра = "энргАбонентыПомещений";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_Сменасобственника)
	|			ТОГДА Шапка.АбонентСмена
	|		ИНАЧЕ Шапка.Абонент
	|	КОНЕЦ КАК Абонент,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)
	|	И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|			ИЛИ Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеЛС(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеЛС";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.Абонент КАК Абонент,
	|	ИСТИНА КАК Состояние,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.Абонент,
	|	ЛОЖЬ,
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.АбонентСмена,
	|	ИСТИНА,
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.Абонент,
	|	ЛОЖЬ,
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗакрытиеЛС(Схема, Регистры)
	
	ИмяРегистра = "энргЗакрытыеЛС";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетом.Абонент КАК Абонент
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС)
	|	И энргОперацияСЛицевымСчетом.Абонент <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетом.Абонент
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)
	|	И энргОперацияСЛицевымСчетом.Абонент <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоПроживающих(Схема, Регистры)
	
	ИмяРегистра = "энргКоличествоПроживающих";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетом.КоличествоПроживающих КАК Количество,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения,
	|	энргОперацияСЛицевымСчетом.КоличествоПроживающих,
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоПрописанных(Схема, Регистры)
	
	ИмяРегистра = "энргКоличествоПрописанных";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетом.КоличествоПрописанных КАК Количество,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения,
	|	энргОперацияСЛицевымСчетом.КоличествоПрописанных,
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоСобственников(Схема, Регистры)
	
	ИмяРегистра = "энргКоличествоСобственников";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетом.КоличествоСобственников КАК Количество,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения,
	|	энргОперацияСЛицевымСчетом.КоличествоСобственников,
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоКомнат(Схема, Регистры)
	
	ИмяРегистра = "энргКоличествоКомнат";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетом.КоличествоКомнат КАК Количество,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТипСобственностиАбонентов(Схема, Регистры)
	
	ИмяРегистра = "энргТипСобственностиАбонентов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетом.ТипСобственностиЖилья КАК ТипСобственности,
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ТипСобственностиЖилья = ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.МуниципальнаяСобственность)
	|				И НЕ энргОперацияСЛицевымСчетом.ТипСобственностиЖилья = ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ФедеральнаяСобственность)
	|			ТОГДА """"
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.НомерДоговораСоцНайма
	|	КОНЕЦ КАК НомерДоговораСоцНайма,
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ТипСобственностиЖилья = ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.МуниципальнаяСобственность)
	|				И НЕ энргОперацияСЛицевымСчетом.ТипСобственностиЖилья = ЗНАЧЕНИЕ(Перечисление.энргТипыСобственниковЖилья.ФедеральнаяСобственность)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.ДатаДоговораСоцНайма
	|	КОНЕЦ КАК ДатаДоговораСоцНайма,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗначенияПлощадей(Схема, Регистры) 
	
	ИмяРегистра = "энргЗначенияПлощадей";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомЗначениеПлощадей.ВидПлощади КАК ВидПлощади,
	|	энргОперацияСЛицевымСчетомЗначениеПлощадей.Значение КАК Площадь,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЗначениеПлощадей КАК энргОперацияСЛицевымСчетомЗначениеПлощадей
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомЗначениеПлощадей.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомЗначениеПлощадей.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВидБлагоустройствАбонента(Схема, Регистры) 
	
	ИмяРегистра = "энргВидБлагоустройствАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройства,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ВидыБлагоустройстваТарифныеКатегории КАК энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаГруппыПотребителейАбонентов(Схема, Регистры) 
	
	ИмяРегистра = "энргГруппыПотребителейАбонентов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория КАК ГруппаПотребителей,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ВидыБлагоустройстваТарифныеКатегории КАК энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВладельцыТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргВладельцыТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК АбонентВладелец,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаАктивностьТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргАктивностьТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетом.ДоговорЗаключенДоТП
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	КОНЕЦ КАК Состояние,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|				ИЛИ энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Отключена),
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаУслугиТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргУслугиТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Услуга КАК Услуга,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Техническая КАК Техническая,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборыТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|			И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУ(Схема, Регистры)
	
	ИмяРегистра = "энргТехническаяВозможностьУстановкиПУ";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТУНаСтруктуреСети(Схема, Регистры)
	
	ИмяРегистра = "бестТУНаСтруктуреСети";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	энргОперацияСЛицевымСчетомТочкиУчета.СтруктураСети КАК СтруктураСети
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргСвойствоРасчетТолькоПоПоказаниямТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	энргОперацияСЛицевымСчетомТочкиУчета.РасчетТолькоПоПоказаниям
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНаправлениеИспользованияТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНаправлениеИспользованияТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗначенияИзмерителейТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргЗначенияИзмерителейТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомЗначенияИзмерителей.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОперацияСЛицевымСчетомЗначенияИзмерителей.Значение КАК Значение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Регистратор,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетом.Район КАК Район,
	|		энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСЛицевымСчетомТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|	ИЗ
	|		ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|				И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЗначенияИзмерителей КАК энргОперацияСЛицевымСчетомЗначенияИзмерителей
	|		ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомЗначенияИзмерителей.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомЗначенияИзмерителей.IDСтроки
	|			И (энргОперацияСЛицевымСчетомЗначенияИзмерителей.Ссылка В (&мДокументы))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДиаметрСеченияТочекУчета(Схема, Регистры) 
	
	ИмяРегистра = "энргДиаметрСеченияТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.РассчитыватьПоДиаметруСечения КАК Использовать,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ДиаметрСечения КАК ДиаметрСечения,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПроживаниеЖильцов(Схема, Регистры)
	
	ИмяРегистра = "энргПроживаниеЖильцов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомЖильцы.ФизическоеЛицо КАК Жилец,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеЖильцов.Регистрация) КАК Состояние,
	|	энргОперацияСЛицевымСчетомЖильцы.ДоляСобственностиЧислитель КАК ДоляСобственностиЧислитель,
	|	энргОперацияСЛицевымСчетомЖильцы.ДоляСобственностиЗнаменатель КАК ДоляСобственностиЗнаменатель
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Жильцы КАК энргОперацияСЛицевымСчетомЖильцы
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомЖильцы.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомЖильцы.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоставщикиУслугАбонента(Схема, Регистры)
	
	ИмяРегистра = "энргПоставщикиУслугАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетом.Район КАК Район,
	|		энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСЛицевымСчетомТочкиУчета.Услуга КАК Услуга,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		энргОперацияСЛицевымСчетомТочкиУчета.Поставщик КАК Поставщик,
	|		энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Регистратор
	|	ИЗ
	|		ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|				И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоставщикиСоставныхУслуг КАК энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг
	|		ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.IDСтроки"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПлательщикиУслугАбонента(Схема, Регистры)
	
	ИмяРегистра = "энргПлательщикиУслугАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ВЫБОР
	|					КОГДА энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|						ТОГДА ВложенныйЗапрос.Абонент
	|					ИНАЧЕ энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВложенныйЗапрос.Плательщик = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|					ТОГДА ВложенныйЗапрос.Абонент
	|				ИНАЧЕ ВложенныйЗапрос.Плательщик
	|			КОНЕЦ
	|	КОНЕЦ КАК Плательщик,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетом.Район КАК Район,
	|		энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСЛицевымСчетомТочкиУчета.Услуга КАК Услуга,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		энргОперацияСЛицевымСчетомТочкиУчета.Плательщик КАК Плательщик,
	|		энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Регистратор,
	|		энргОперацияСЛицевымСчетом.Абонент КАК Абонент
	|	ИЗ
	|		ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|				И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоставщикиСоставныхУслуг КАК энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг
	|		ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.IDСтроки"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоэффциентыПриборовУчета(Схема, Регистры) 
	
	ИмяРегистра = "энргКоэффциентыПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.КоэффициентПУ = 0
	|			ТОГДА 1
	|		ИНАЧЕ энргОперацияСЛицевымСчетомТочкиУчета.КоэффициентПУ
	|	КОНЕЦ КАК Коэффициент,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|			И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНомерПломбПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНомерПломбПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаНомераПломб.КлючСтроки КАК МестоУстановки,
	|	таблицаНомераПломб.НомерПломбы КАК НомерПломбы,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	таблицаНомераПломб.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	таблицаНомераПломб.ЛицоУстановившееПломбу КАК ЛицоУстановившееПломбу,
	|	таблицаНомераПломб.ВидПломбы КАК ВидПломбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табШапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.КлючПомещения,
	|		табИзмерители.ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.Ссылка,
	|		табИзмерители.IDСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА табШапка.ДатаФактическогоСобытия
	|				ИНАЧЕ табШапка.Дата
	|			КОНЕЦ КАК Период,
	|			табШапка.Организация КАК Организация,
	|			табШапка.Район КАК Район,
	|			табШапка.КлючПомещения КАК КлючПомещения,
	|			табШапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табШапка.Ссылка КАК Ссылка,
	|			табТочкиУчета.IDСтроки КАК IDСтроки
	|		ИЗ
	|			ШапкаДокумента КАК табШапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|				ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|					И (табШапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Измерители КАК табИзмерители
	|			ПО ВложенныйЗапрос.Ссылка = табИзмерители.Ссылка
	|				И ВложенныйЗапрос.IDСтроки = табИзмерители.IDСтрокиТочкиУчета
	|				И (табИзмерители.Ссылка В (&мДокументы))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.НомераПломб КАК таблицаНомераПломб
	|		ПО ВложенныйЗапрос.Ссылка = таблицаНомераПломб.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаНомераПломб.IDСтрокиИзмерителя
	|			И (таблицаНомераПломб.Ссылка В (&мДокументы))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВидыДифференцированностиПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргВидыДифференцированностиПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСЛицевымСчетомШкалыПриборовУчета.Шкала КАК Шкала,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомШкалыПриборовУчета.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|		ИНАЧЕ энргОперацияСЛицевымСчетомШкалыПриборовУчета.ВидДифференцированности
	|	КОНЕЦ КАК ВидДифференцированности,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетом.Район КАК Район,
	|		энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Регистратор
	|	ИЗ
	|		ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|				И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|				И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ШкалыПриборовУчета КАК энргОперацияСЛицевымСчетомШкалыПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомШкалыПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомШкалыПриборовУчета.IDСтрокиТочкиУчета";
	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДатыПоверкиПрибораУчета(Схема, Регистры)
	
	ИмяРегистра = "энргДатыПоверкиПрибораУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверки,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|			И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеПриборовУчетаАбонента(Схема, Регистры)
	
	ИмяРегистра 	= "энргСостояниеПриборовУчетаАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|			И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.Организация,
	|	энргОперацияСЛицевымСчетом.Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод),
	|	энргОперацияСЛицевымСчетом.Дата,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ)
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС))
	|			И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры) 
	
	ИмяРегистра 	= "энргПоказанияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	0 КАК Разделитель,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка) КАК ПричинаОтклонения,
	|	ЛОЖЬ КАК КС,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка) КАК ИсточникПоказаний,
	|	ЛОЖЬ КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		энргОперацияСЛицевымСчетомШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетомШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|			КОНЕЦ КАК Период,
	|			энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|			энргОперацияСЛицевымСчетом.Район КАК Район,
	|			энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|			энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|			энргОперацияСЛицевымСчетом.Ссылка КАК Регистратор
	|		ИЗ
	|			ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|				ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|					И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|					И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|					И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|					И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ШкалыПриборовУчета КАК энргОперацияСЛицевымСчетомШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргОперацияСЛицевымСчетомШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоказанияПриборовУчета КАК энргОперацияСЛицевымСчетомПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомПоказанияПриборовУчета.IDСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ТарифнаяЗона,
	|	0,
	|	ВЫБОР
	|		КОГДА энргПриборыУчетаАбонента.РегистрируетОбъем
	|			ТОГДА энргОперацияСЛицевымСчетомПоказанияПриборовУчета.Разница
	|		ИНАЧЕ энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ТекущиеПоказания
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.СостояниеПоказаний,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ПричинаОтклонения,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка),
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.Переворот,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.НомерСтроки,
	|	ВложенныйЗапрос.ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		энргОперацияСЛицевымСчетомШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетомШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|			КОНЕЦ КАК Период,
	|			энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|			энргОперацияСЛицевымСчетом.Район КАК Район,
	|			энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|			энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|			энргОперацияСЛицевымСчетом.Ссылка КАК Регистратор
	|		ИЗ
	|			ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|				ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|					И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|					И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|					И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС))
	|					И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ШкалыПриборовУчета КАК энргОперацияСЛицевымСчетомШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргОперацияСЛицевымСчетомШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоказанияПриборовУчета КАК энргОперацияСЛицевымСчетомПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомПоказанияПриборовУчета.IDСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ТарифнаяЗона,
	|	0,
	|	ВЫБОР
	|		КОГДА энргПриборыУчетаАбонента.РегистрируетОбъем
	|			ТОГДА энргОперацияСЛицевымСчетомПоказанияПриборовУчета.Разница
	|		ИНАЧЕ энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ТекущиеПоказания
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.СостояниеПоказаний,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ПричинаОтклонения,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	энргОперацияСЛицевымСчетомПоказанияПриборовУчета.НомерСтроки,
	|	ВложенныйЗапрос.ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		энргОперацияСЛицевымСчетомШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетомШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|			КОНЕЦ КАК Период,
	|			энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|			энргОперацияСЛицевымСчетом.Район КАК Район,
	|			энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|			энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|			энргОперацияСЛицевымСчетом.Ссылка КАК Регистратор
	|		ИЗ
	|			ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|				ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|					И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|					И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|					И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))
	|					И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ШкалыПриборовУчета КАК энргОперацияСЛицевымСчетомШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргОперацияСЛицевымСчетомШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоказанияПриборовУчета КАК энргОперацияСЛицевымСчетомПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = энргОперацияСЛицевымСчетомПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомПоказанияПриборовУчета.IDСтроки
	|			И (энргОперацияСЛицевымСчетомПоказанияПриборовУчета.ПоказанияПредоставлены)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаРодителейТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргРодительТочкиУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(ТаблицаРодителейТочекУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК РодительТочкиУчета
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаТочекУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТаблицаРодителейТочекУчета
	|			ПО ТаблицаТочекУчета.Ссылка = ТаблицаРодителейТочекУчета.Ссылка
	|				И (ТаблицаРодителейТочекУчета.Ссылка В (&мДокументы))
	|				И ТаблицаТочекУчета.IDСтрокиРодитель = ТаблицаРодителейТочекУчета.IDСтроки
	|		ПО энргОперацияСЛицевымСчетом.Ссылка = ТаблицаТочекУчета.Ссылка
	|			И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|			И (ТаблицаТочекУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаТочекУчета.ТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка))
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДоговорыАбонентов(Схема, Регистры)
	
	ИмяРегистра = "энргДоговорыАбонентов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Абонент КАК Абонент,
	|	энргОперацияСЛицевымСчетом.Договор КАК Договор
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|	И энргОперацияСЛицевымСчетом.Договор <> ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ,
	|	энргОперацияСЛицевымСчетом.АбонентСмена,
	|	энргОперацияСЛицевымСчетом.Договор
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)
	|	И энргОперацияСЛицевымСчетом.Договор <> ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.ПустаяСсылка)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВидовПотерьТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеВидовПотерь";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	энргОперацияСЛицевымСчетомПотери.ВидПотерь КАК ВидПотерь,
	|	ИСТИНА КАК Состояние
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетом.Район КАК Район,
	|		энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка,
	|		энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|				И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Потери КАК энргОперацияСЛицевымСчетомПотери
	|		ПО ВложенныйЗапрос.Ссылка = энргОперацияСЛицевымСчетомПотери.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомПотери.IDСтроки
	|			И (энргОперацияСЛицевымСчетомПотери.Ссылка В (&мДокументы))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЗначенияПотерьТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргЗначенияПотерь";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	энргОперацияСЛицевымСчетомПотери.ВидПотерь КАК ВидПотерь,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомПотери.ФиксированныйОбъемПотерь > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСпособыРасчетаПотерь.ФиксированныйОбъем)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСпособыРасчетаПотерь.Процент)
	|	КОНЕЦ КАК СпособРасчетаПотерь,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомПотери.ФиксированныйОбъемПотерь > 0
	|			ТОГДА энргОперацияСЛицевымСчетомПотери.ФиксированныйОбъемПотерь
	|		ИНАЧЕ энргОперацияСЛицевымСчетомПотери.ПроцентПотерь
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетом.Район КАК Район,
	|		энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(энргОперацияСЛицевымСчетом.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка,
	|		энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|				И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Потери КАК энргОперацияСЛицевымСчетомПотери
	|		ПО ВложенныйЗапрос.Ссылка = энргОперацияСЛицевымСчетомПотери.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргОперацияСЛицевымСчетомПотери.IDСтроки
	|			И (энргОперацияСЛицевымСчетомПотери.Ссылка В (&мДокументы))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСоставУзлаУчета(Схема, Регистры)
	
	ИмяРегистра = "энргСоставУзлаУчетаПомещения";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаИзмерители.ПриборУчета КАК Измеритель,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табШапка.КлючПомещения КАК КлючПомещения,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Измерители КАК таблицаИзмерители
	|		ПО ВложенныйЗапрос.Ссылка = таблицаИзмерители.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаИзмерители.IDСтрокиТочкиУчета
	|			И (таблицаИзмерители.Ссылка В (&мДокументы))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСобственникиПомещений(Схема, Регистры)
	
	ИмяРегистра = "энргСобственникиПомещений";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табЖильцы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ИСТИНА КАК Активна,
	|	Шапка.ДолеваяСобственность КАК ДолеваяСобственность,
	|	ВЫБОР
	|		КОГДА Шапка.ДолеваяСобственность
	|			ТОГДА табЖильцы.ДоляСобственностиЧислитель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляСобственностиЧислитель,
	|	ВЫБОР
	|		КОГДА Шапка.ДолеваяСобственность
	|			ТОГДА табЖильцы.ДоляСобственностиЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляСобственностиЗнаменатель,
	|	табЖильцы.СвидетельствоОРегистрацииНомер КАК СвидетельствоОРегистрацииНомер,
	|	табЖильцы.СвидетельствоОРегистрацииДата КАК СвидетельствоОРегистрацииДата,
	|	табЖильцы.СвидетельствоОРегистрацииСерия КАК СвидетельствоОРегистрацииСерия,
	|	табЖильцы.СвидетельствоОРегистрацииКемВыдан КАК СвидетельствоОРегистрацииКемВыдан,
	|	табЖильцы.Собственник КАК Собственник,
	|	табЖильцы.Проживаюший КАК Проживаюший,
	|	табЖильцы.Прописанный КАК Прописанный,
	|	табЖильцы.РодственныеСвязи КАК РодственныеСвязи,
	|	табЖильцы.СолидарнаяОплата КАК СолидарнаяОплата
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Жильцы КАК табЖильцы
	|		ПО Шапка.Ссылка = табЖильцы.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)
	|	И табЖильцы.Ссылка В(&мДокументы)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ,
	|	Шапка.Организация,
	|	Шапка.Район,
	|	Шапка.КлючПомещения,
	|	табЖильцы.ФизическоеЛицо,
	|	ИСТИНА,
	|	Шапка.ДолеваяСобственность,
	|	ВЫБОР
	|		КОГДА Шапка.ДолеваяСобственность
	|			ТОГДА табЖильцы.ДоляСобственностиЧислитель
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Шапка.ДолеваяСобственность
	|			ТОГДА табЖильцы.ДоляСобственностиЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	табЖильцы.СвидетельствоОРегистрацииНомер,
	|	табЖильцы.СвидетельствоОРегистрацииДата,
	|	табЖильцы.СвидетельствоОРегистрацииСерия,
	|	табЖильцы.СвидетельствоОРегистрацииКемВыдан,
	|	табЖильцы.Собственник,
	|	табЖильцы.Проживаюший,
	|	табЖильцы.Прописанный,
	|	табЖильцы.РодственныеСвязи,
	|	табЖильцы.СолидарнаяОплата
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.Жильцы КАК табЖильцы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК Шапка
	|		ПО табЖильцы.Ссылка = Шапка.Ссылка
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)
	|	И табЖильцы.Ссылка В(&мДокументы)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;  	
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТочкиПоставкиТочекУчета(Схема, Регистры)
	ИмяРегистра = "энргТочкиПоставкиТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиПоставок.ТочкаПоставки КАК ТочкаПоставки,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.Услуга КАК Услуга,
	|		табТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		табТочкиУчета.Поставщик КАК Поставщик,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		Шапка.КлючПомещения КАК КлючПомещения
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиПоставок КАК табТочкиПоставок
	|		ПО ВложенныйЗапрос.Ссылка = табТочкиПоставок.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табТочкиПоставок.IDСтроки";	
	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаЖильцыЛьготныхКатегорий(Схема, Регистры)
	
	ИмяРегистра = "энргЖильцыЛьготныхКатегорий";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Жилец КАК Жилец,
	|	ТабЛьготныеКатегории.Категория КАК ЛьготнаяКатегория,
	|	ТабЛьготныеКатегории.Процент КАК ПроцентЛьготы,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|			ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|		КОНЕЦ КАК Период,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетом.Район КАК Район,
	|		энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|		энргОперацияСЛицевымСчетомЖильцы.ФизическоеЛицо КАК Жилец,
	|		энргОперацияСЛицевымСчетом.Абонент КАК Абонент,
	|		энргОперацияСЛицевымСчетомЖильцы.IDСтроки КАК IDСтроки,
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка,
	|		энргОперацияСЛицевымСчетом.ПериодНачисления КАК ПериодНачисления,
	|		энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации
	|	ИЗ
	|		ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Жильцы КАК энргОперацияСЛицевымСчетомЖильцы
	|			ПО энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетомЖильцы.Ссылка
	|				И (энргОперацияСЛицевымСчетом.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетомЖильцы.Ссылка В (&мДокументы))
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЛьготныеКатегории КАК ТабЛьготныеКатегории
	|		ПО ВложенныйЗапрос.Ссылка = ТабЛьготныеКатегории.Ссылка
	|			И (ТабЛьготныеКатегории.Категория <> ЗНАЧЕНИЕ(Справочник.энргЛьготныеКатегории.ПустаяСсылка))
	|			И ВложенныйЗапрос.IDСтроки = ТабЛьготныеКатегории.IDСтроки";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСпособыДоставкиКвитанции(Схема, Регистры)
	
	ИмяРегистра = "энргСпособыДоставкиКвитанции";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	энргОперацияСЛицевымСчетом.КлючПомещения КАК КлючПомещения,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|			ТОГДА энргОперацияСЛицевымСчетом.Абонент
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.АбонентСмена
	|	КОНЕЦ КАК Абонент,
	|	энргОперацияСЛицевымСчетом.ПериодНачисления КАК ПериодНачисления,
	|	энргОперацияСЛицевымСчетом.Дата КАК ПериодРегистрации,
	|	энргОперацияСЛицевымСчетом.СпособДоставкиЕПД КАК СпособДоставки
	|ИЗ
	|	ШапкаДокумента КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|			ИЛИ энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))";	
	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНазначенияПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргНазначенияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	ТаблицаТочек.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочек.НазначениеПУ КАК НазначениеПУ,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаТочек
	|		ПО Шапка.Ссылка = ТаблицаТочек.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (ТаблицаТочек.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|			И (ТаблицаТочек.НазначениеПУ <> ЗНАЧЕНИЕ(Перечисление.энргНазначениеПУ.пустаяссылка))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО Шапка.КлючПомещения = энргКлючиПомещений.Ссылка";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТочкиПоставкиСНТ(Схема, Регистры)
	
	ИмяРегистра = "энргТочкиПоставкиСНТ";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.СНТДНТПривязан КАК СНТДНТПривязан,
	|	Шапка.СНТДНТПотребление КАК СНТДНТПотребление,
	|	Шапка.ТочкаПоставкиЮЛПотребление КАК ТочкаПоставки
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|ГДЕ
	|	Шапка.ТочкаПоставкиЮЛПотребление <> ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)
	|	И Шапка.Ссылка В (&мДокументы)";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	НЕ ПараметрыКонтроля.ЧастныйСектор
	|	И (НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка,
	|	энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|	энргОперацияСЛицевымСчетом.Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР
	|		КОГДА &ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
	|		ИНАЧЕ &Строение
	|	КОНЕЦ КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка В(&мДокументы)
	|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамОткрытиеЛицевогоСчета(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовОткрытиеЛС";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамОткрытиеЛицевогоСчета());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
	ИмяТаблицы 											= "ДанныеДокументовОткрытиеЛССвязанныеПомещения";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамОткрытиеЛицевогоСчетаСвязанныеПомещения());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамЗакрытиеЛицевогоСчета(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовЗакрытиеЛС";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамЗакрытиеЛицевогоСчета());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 	
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
	ИмяТаблицы 											= "ДанныеДокументовЗакрытиеЛССвязанныеПомещения";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамОткрытиеЗакрытиеЛицевогоСчетаСвязанныеПомещения());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодамСменаСобственника(Схема,ВыбираемыеТаблицы)
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовСменаСобственника";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамСменаСобсвенника());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстДляПроведенияПоСтабильнымПериодамОткрытиеЛицевогоСчета()
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	энргОперацияСЛицевымСчетом.Ссылка КАК ДокРегистратор,
	|	энргОперацияСЛицевымСчетом.Дата КАК ДатаРегистратора,
	|	энргОперацияСЛицевымСчетом.Абонент КАК Абонент,
	|	ИСТИНА КАК ЛСОткрыт,
	|	энргОперацияСЛицевымСчетом.КоличествоПрописанных КАК КоличествоПрописанных,
	|	энргОперацияСЛицевымСчетом.КоличествоКомнат КАК КоличествоКомнат,
	|	энргОперацияСЛицевымСчетом.КоличествоПроживающих КАК КоличествоПроживающих,
	|	энргОперацияСЛицевымСчетом.КоличествоСобственников КАК КоличествоСобственников,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС) КАК ВидОперации,
	|	энргОперацияСЛицевымСчетом.ТипСобственностиЖилья КАК ВидСобственности,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСЛицевымСчетом.ПериодНачисления
	|		ИНАЧЕ энргОперацияСЛицевымСчетом.ДатаФактическогоСобытия
	|	КОНЕЦ КАК ДатаСостоянияЛицевогоСчета,
	|	энргОперацияСЛицевымСчетом.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ ШапкаОткрытиеЛС
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргОперацияСЛицевымСчетом.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = энргОперацияСЛицевымСчетом.КлючПомещения
	|			И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.Организация КАК Организация,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Район КАК Район,
	|	Шапка.ЧастныйСектор КАК ЧастныйСектор,
	|	Шапка.Строение КАК Строение,
	|	Шапка.Помещение КАК Помещение,
	|	Шапка.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.ДокРегистратор КАК ДокРегистратор,
	|	Шапка.ДатаРегистратора КАК ДатаРегистратора,
	|	Шапка.ВидОперации КАК ВидОперации,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.ВидСобственности КАК ВидСобственности,
	|	ЕСТЬNULL(энргОперацияСЛицевымСчетомТочкиУчета.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|	ЕСТЬNULL(энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.Пустаяссылка)) КАК ТочкаУчета,
	|	Шапка.ЛСОткрыт КАК ЛСОткрыт,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.Услуга ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УслугаПодключена,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПриборВведен,
	|	ЕСТЬNULL(энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)) КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ Шапка.ПериодНачисления
	|	КОНЕЦ КАК ДатаСостоянияПрибора,
	|	Шапка.КоличествоПрописанных КАК КоличествоПрописанных,
	|	Шапка.КоличествоПроживающих КАК КоличествоПроживающих,
	|	Шапка.КоличествоСобственников КАК КоличествоСобственников,
	|	Шапка.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	Шапка.КоличествоКомнат КАК КоличествоКомнат,
	|	ЕСТЬNULL(энргОперацияСЛицевымСчетомТочкиУчета.КоэффициентПУ, 0) КАК КоэффициентПУ,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Поставщик КАК Поставщик,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Плательщик КАК Плательщик,
	|	энргОперацияСЛицевымСчетомТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки КАК IDСтроки,
	|	энргОперацияСЛицевымСчетомТочкиУчета.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|	энргОперацияСЛицевымСчетомТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	энргОперацияСЛицевымСчетомТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргОперацияСЛицевымСчетомТочкиУчета.Техническая КАК Техническая,
	|	энргОперацияСЛицевымСчетомТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ энргОперацияСЛицевымСчетомТочкиУчета.ДатаПоверкиСчетчика
	|	КОНЕЦ КАК ДатаПоверки,
	|	ВЫБОР
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ Шапка.ДатаРегистратора
	|	КОНЕЦ КАК ДатаРегистрацииПоверки,
	|	Шапка.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ ДанныеТочекУчетаОткрытиеЛС
	|ИЗ
	|	ШапкаОткрытиеЛС КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|		ПО Шапка.ДокРегистратор = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|	ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|	ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.Плательщик КАК Плательщик,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.IDСтроки КАК IDСтроки,
	|	ВложенныйЗапрос.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|	ВложенныйЗапрос.Техническая КАК Техническая,
	|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	СУММА(табПотери.ФиксированныйОбъемПотерь) КАК ПотериОбъем,
	|	СУММА(табПотери.ПроцентПотерь) КАК ПотериПроцент,
	|	ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ УслугиОткрытиеЛС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеТочекУчета.Организация КАК Организация,
	|		ДанныеТочекУчета.ПериодНачисления КАК ПериодНачисления,
	|		ДанныеТочекУчета.Район КАК Район,
	|		ДанныеТочекУчета.ЧастныйСектор КАК ЧастныйСектор,
	|		ДанныеТочекУчета.Строение КАК Строение,
	|		ДанныеТочекУчета.Помещение КАК Помещение,
	|		ДанныеТочекУчета.ПериодРегистрации КАК ПериодРегистрации,
	|		ДанныеТочекУчета.ДокРегистратор КАК ДокРегистратор,
	|		ДанныеТочекУчета.ДатаРегистратора КАК ДатаРегистратора,
	|		ДанныеТочекУчета.ВидОперации КАК ВидОперации,
	|		ДанныеТочекУчета.Абонент КАК Абонент,
	|		ДанныеТочекУчета.ВидСобственности КАК ВидСобственности,
	|		ВЫБОР
	|			КОГДА энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеТочекУчета.Услуга
	|			ИНАЧЕ энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги
	|		КОНЕЦ КАК Услуга,
	|		ВЫБОР
	|			КОГДА НЕ энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеТочекУчета.Услуга
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|		КОНЕЦ КАК СоставнаяУслуга,
	|		ДанныеТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеТочекУчета.ЛСОткрыт КАК ЛСОткрыт,
	|		ДанныеТочекУчета.УслугаПодключена КАК УслугаПодключена,
	|		ДанныеТочекУчета.ПриборВведен КАК ПриборВведен,
	|		ДанныеТочекУчета.ПриборУчета КАК ПриборУчета,
	|		ДанныеТочекУчета.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|		ДанныеТочекУчета.КоличествоПрописанных КАК КоличествоПрописанных,
	|		ДанныеТочекУчета.КоличествоПроживающих КАК КоличествоПроживающих,
	|		ДанныеТочекУчета.КоличествоСобственников КАК КоличествоСобственников,
	|		ДанныеТочекУчета.КоличествоКомнат КАК КоличествоКомнат,
	|		ДанныеТочекУчета.КоэффициентПУ КАК КоэффициентПУ,
	|		ВЫБОР
	|			КОГДА энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеТочекУчета.Поставщик
	|			ИНАЧЕ энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Поставщик
	|		КОНЕЦ КАК Поставщик,
	|		ВЫБОР
	|			КОГДА энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ДанныеТочекУчета.Плательщик
	|			ИНАЧЕ энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик
	|		КОНЕЦ КАК Плательщик,
	|		ДанныеТочекУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|		ДанныеТочекУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ДанныеТочекУчета.IDСтроки КАК IDСтроки,
	|		ДанныеТочекУчета.IDСтрокиРодитель КАК IDСтрокиРодитель,
	|		ДанныеТочекУчета.Техническая КАК Техническая,
	|		ДанныеТочекУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|		ДанныеТочекУчета.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|		ДанныеТочекУчета.ДатаПоверки КАК ДатаПоверки,
	|		ДанныеТочекУчета.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|		ДанныеТочекУчета.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|	ИЗ
	|		ДанныеТочекУчетаОткрытиеЛС КАК ДанныеТочекУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоставщикиСоставныхУслуг КАК энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг
	|			ПО (ДанныеТочекУчета.ЭтоСоставнаяУслуга)
	|				И ДанныеТочекУчета.ДокРегистратор = энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка
	|				И ДанныеТочекУчета.IDСтроки = энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.IDСтроки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.Потери КАК табПотери
	|		ПО ВложенныйЗапрос.ДокРегистратор = табПотери.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПотери.IDСтроки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.ВидСобственности,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.СоставнаяУслуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.ЛСОткрыт,
	|	ВложенныйЗапрос.УслугаПодключена,
	|	ВложенныйЗапрос.ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоПроживающих,
	|	ВложенныйЗапрос.КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоКомнат,
	|	ВложенныйЗапрос.КоэффициентПУ,
	|	ВложенныйЗапрос.Поставщик,
	|	ВложенныйЗапрос.Плательщик,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.IDСтроки,
	|	ВложенныйЗапрос.IDСтрокиРодитель,
	|	ВложенныйЗапрос.Техническая,
	|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета,
	|	ВложенныйЗапрос.ДатаПоверки,
	|	ВложенныйЗапрос.ДатаРегистрацииПоверки,
	|	ВложенныйЗапрос.ДоговорЗаключенДоТП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|	ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|	ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.Плательщик КАК Плательщик,
	|	ИСТИНА КАК МенялосьСостояниеПУ,
	|	ИСТИНА КАК МенялосьСостояниеФормулы,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.Техническая КАК Техническая,
	|	ВложенныйЗапрос.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	0 КАК Порядок,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	ВложенныйЗапрос.ПотериОбъем КАК ПотериОбъем,
	|	ВложенныйЗапрос.ПотериПроцент КАК ПотериПроцент,
	|	ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ИЗ
	|	(ВЫБРАТЬ
	|		Услуги.Организация КАК Организация,
	|		Услуги.ПериодНачисления КАК ПериодНачисления,
	|		Услуги.Район КАК Район,
	|		Услуги.ЧастныйСектор КАК ЧастныйСектор,
	|		Услуги.Строение КАК Строение,
	|		Услуги.Помещение КАК Помещение,
	|		Услуги.ПериодРегистрации КАК ПериодРегистрации,
	|		Услуги.ДокРегистратор КАК ДокРегистратор,
	|		Услуги.ДатаРегистратора КАК ДатаРегистратора,
	|		Услуги.ВидОперации КАК ВидОперации,
	|		Услуги.Абонент КАК Абонент,
	|		Услуги.ВидСобственности КАК ВидСобственности,
	|		Услуги.Услуга КАК Услуга,
	|		Услуги.ТочкаУчета КАК ТочкаУчета,
	|		Услуги.ЛСОткрыт КАК ЛСОткрыт,
	|		Услуги.УслугаПодключена КАК УслугаПодключена,
	|		Услуги.ПриборВведен КАК ПриборВведен,
	|		Услуги.ПриборУчета КАК ПриборУчета,
	|		Услуги.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|		Услуги.КоличествоПрописанных КАК КоличествоПрописанных,
	|		Услуги.КоличествоПроживающих КАК КоличествоПроживающих,
	|		Услуги.КоличествоСобственников КАК КоличествоСобственников,
	|		Услуги.КоличествоКомнат КАК КоличествоКомнат,
	|		Услуги.КоэффициентПУ КАК КоэффициентПУ,
	|		энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройства,
	|		энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория КАК ТарифнаяГруппа,
	|		Услуги.Поставщик КАК Поставщик,
	|		Услуги.Плательщик КАК Плательщик,
	|		Услуги.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|		Услуги.СоставнаяУслуга КАК СоставнаяУслуга,
	|		Услуги.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		Услуги.Техническая КАК Техническая,
	|		Услуги.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|		ЕСТЬNULL(энргОперацияСЛицевымСчетомТочкиУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчетаРодитель,
	|		Услуги.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|		Услуги.ДатаПоверки КАК ДатаПоверки,
	|		Услуги.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|		Услуги.ПотериОбъем КАК ПотериОбъем,
	|		Услуги.ПотериПроцент КАК ПотериПроцент,
	|		Услуги.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|	ИЗ
	|		УслугиОткрытиеЛС КАК Услуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО Услуги.Услуга = энргВидыУслуг.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ПО Услуги.ДокРегистратор = энргОперацияСЛицевымСчетомТочкиУчета.Ссылка
	|				И Услуги.IDСтрокиРодитель = энргОперацияСЛицевымСчетомТочкиУчета.IDСтроки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ВидыБлагоустройстваТарифныеКатегории КАК энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории
	|			ПО Услуги.ДокРегистратор = энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Ссылка
	|				И Услуги.Услуга = энргОперацияСЛицевымСчетомВидыБлагоустройстваТарифныеКатегории.Услуга) КАК ВложенныйЗапрос";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамОткрытиеЛицевогоСчетаСвязанныеПомещения()
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	Шапка.КоличествоКомнат КАК КоличествоКомнат,
	|	Шапка.КоличествоПроживающих,
	|	Шапка.КоличествоПрописанных,
	|	Шапка.КоличествоСобственников,
	|	Шапка.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ ШапкаОткрытиеЛС
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И (НЕ ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения)
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамОткрытиеЗакрытиеЛицевогоСчетаСвязанныеПомещения()
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	0 КАК СоставЖильцов,
	|	Шапка.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ ШапкаОткрытиеЛС
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И (НЕ ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения)
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС))";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамЗакрытиеЛицевогоСчета()
	Текст  	= 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Ссылка КАК ДокРегистратор,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС) КАК ВидОперации,
	|	ЛОЖЬ КАК ЛСОткрыт,
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ПериодНачисления
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ КАК ДатаСостоянияЛицевогоСчета,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисленияВыводаПрибора,
	|	0 КАК Порядок
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС))";
	
	Возврат Текст;
КонецФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамСменаСобсвенника()
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Ссылка КАК ДокРегистратор,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника) КАК ВидОперации,
	|	ЛОЖЬ КАК ЛСОткрыт,
	|	ЛОЖЬ КАК УслугаПодключена,
	|	НЕОПРЕДЕЛЕНО КАК Абонент,
	|	НЕОПРЕДЕЛЕНО КАК КоличествоПроживающих,
	|	НЕОПРЕДЕЛЕНО КАК КоличествоПрописанных,
	|	НЕОПРЕДЕЛЕНО КАК КоличествоСобственников,
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ПериодНачисления
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ КАК ДатаСостоянияЛицевогоСчета,
	|	0 КАК Порядок,
	|	ТЧТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТЧСоставныхУслуг.Плательщик КАК Плательщик,
	|	ЕСТЬNULL(ТЧСоставныхУслуг.ЧастьСоставнойУслуги, ТЧТочкиУчета.Услуга) КАК Услуга,
	|	НЕОПРЕДЕЛЕНО КАК ДатаСостоянияПрибора
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТЧТочкиУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоставщикиСоставныхУслуг КАК ТЧСоставныхУслуг
	|			ПО ТЧТочкиУчета.Ссылка = ТЧСоставныхУслуг.Ссылка
	|				И ТЧТочкиУчета.IDСтроки = ТЧСоставныхУслуг.IDСтроки
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТЧТочкиУчета.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация,
	|	ДокументыДляПроведения.ПериодНачисления,
	|	ДокументыДляПроведения.Район,
	|	ДокументыДляПроведения.ЧастныйСектор,
	|	ДокументыДляПроведения.Строение,
	|	ДокументыДляПроведения.Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации,
	|	Шапка.Ссылка,
	|	Шапка.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника),
	|	ИСТИНА,
	|	ИСТИНА,
	|	Шапка.АбонентСмена,
	|	Шапка.КоличествоПроживающих,
	|	Шапка.КоличествоПрописанных,
	|	Шапка.КоличествоСобственников,
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ПериодНачисления
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ,
	|	1,
	|	ТЧТочкиУчета.ТочкаУчета,
	|	ТЧСоставныхУслуг.Плательщик,
	|	ЕСТЬNULL(ТЧСоставныхУслуг.ЧастьСоставнойУслуги, ТЧТочкиУчета.Услуга),
	|	ВЫБОР
	|		КОГДА ТЧТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПУстаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ Шапка.ПериодНачисления
	|	КОНЕЦ КАК ДатаСостоянияПрибора
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТЧТочкиУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоставщикиСоставныхУслуг КАК ТЧСоставныхУслуг
	|			ПО ТЧТочкиУчета.Ссылка = ТЧСоставныхУслуг.Ссылка
	|				И ТЧТочкиУчета.IDСтроки = ТЧСоставныхУслуг.IDСтроки
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТЧТочкиУчета.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстПолучитьДанныеИзмененияПлощади()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	энргОперацияСЛицевымСчетомЗначениеПлощадей.ВидПлощади КАК ВидПлощади,
	|	энргОперацияСЛицевымСчетомЗначениеПлощадей.Значение КАК Значение
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЗначениеПлощадей КАК энргОперацияСЛицевымСчетомЗначениеПлощадей
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргОперацияСЛицевымСчетомЗначениеПлощадей.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстПолучитьДанныеИзмененияСоставаШкал()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаШкалПриборовУчета.Шкала КАК Шкала,
	|	ТаблицаШкалПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	0 КАК Порядок,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|		ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|		ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ШкалыПриборовУчета КАК ТаблицаШкалПриборовУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = ТаблицаШкалПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалПриборовУчета.IDСтрокиТочкиУчета";	
	Возврат Текст;	
КонецФункции

Функция ТекстПолучитьДанныеИзмененияИзмерителей()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаИзмерителей.НаправлениеИспользованияТУ КАК Измеритель,
	|	ТаблицаИзмерителей.Значение КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыДляПроведения.Организация КАК Организация,
	|		ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|		ДокументыДляПроведения.Район КАК Район,
	|		ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|		ДокументыДляПроведения.Строение КАК Строение,
	|		ДокументыДляПроведения.Помещение КАК Помещение,
	|		ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|		ТаблицаТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТаблицаТочекУчета.IDСтроки КАК IDСтрокиТочкиУчета
	|	ИЗ
	|		ДокументыДляПроведения КАК ДокументыДляПроведения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаТочекУчета
	|			ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочекУчета.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|			ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|				И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЗначенияИзмерителей КАК ТаблицаИзмерителей
	|		ПО ВложенныйЗапрос.ДокРегистратор = ТаблицаИзмерителей.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаИзмерителей.IDСтроки";	
	Возврат Текст;
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаСтроенияПомещенияДляПередачиВГИСЖКХ()
	
	Текст =
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(табЗначениеОбщихПлощадейПлощадей.Значение, 0) КАК ОбщаяПлощадь
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЗначениеПлощадей КАК табЗначениеОбщихПлощадейПлощадей
	|		ПО Шапка.Ссылка = табЗначениеОбщихПлощадейПлощадей.Ссылка
	|			И (табЗначениеОбщихПлощадейПлощадей.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))
	|ГДЕ
	|	Шапка.Ссылка В(&мИзменения)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)";
	
	Возврат Текст;
	
КонецФункции

#Область Договоры

Функция ТекстЗапросаДанныеЗаключениеДоговоров()
	
	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ДатаВступленияВСилу КАК ДатаВступленияВСилу,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.МожетБытьУстановленПриборУчета КАК МожетБытьУстановленПриборУчета,
	|	ЕСТЬNULL(энргАбоненты.ЛицевойСчет,"""") КАК НомерДоговора
	|ИЗ
	|	(ВЫБРАТЬ
	|		Шапка.Ссылка КАК Ссылка,
	|		Шапка.Абонент КАК Договор,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		ВЫБОР
	|			КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.Дата
	|			ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|		КОНЕЦ КАК ДатаВступленияВСилу,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		ИСТИНА КАК МожетБытьУстановленПриборУчета
	|	ИЗ
	|		Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|	ГДЕ
	|		Шапка.Ссылка В(&мИзменения)
	|		И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Шапка.Ссылка,
	|		Шапка.АбонентСмена,
	|		Шапка.Организация,
	|		Шапка.Район,
	|		ВЫБОР
	|			КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.Дата
	|			ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|		КОНЕЦ,
	|		Шапка.КлючПомещения,
	|		ИСТИНА
	|	ИЗ
	|		Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|	ГДЕ
	|		Шапка.Ссылка В(&мИзменения)
	|		И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО ВложенныйЗапрос.Договор = энргАбоненты.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаУслугиДоговоровДляПередачи()
	
	Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.СоставнаяУслуга
	|				И НЕ энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДокументыДляПередачи.Ссылка КАК Ссылка,
	|		ДокументыДляПередачи.Договор КАК Договор,
	|		табТочкиУчета.Услуга КАК Услуга
	|	ИЗ
	|		Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК табТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляПередачиЗаключениеДоговора КАК ДокументыДляПередачи
	|			ПО табТочкиУчета.Ссылка = ДокументыДляПередачи.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|			ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДанныеРасторжениеДоговоров()
	
	Текст =
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Абонент КАК Договор,
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.Дата
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ КАК ДатаРасторжения,
	|	Шапка.ПричинаЗакрытияЛС КАК ПричинаЗакрытия
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мИзменения)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	Шапка.Абонент,
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.Дата
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.энргПричинаЗакрытияЛС.ПустаяСсылка)
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мИзменения)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ЛицевыеСчета

Функция ТекстЗапросаЛицевыеСчетаДляПередачи()
	
	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Абонент КАК Договор,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ЛицевойСчет КАК ЛицевойСчет,
	|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	энргКонтрагенты.бестФамилия КАК ФизЛицоФамилия,
	|	энргКонтрагенты.бестИмя КАК ФизЛицоИмя,
	|	энргКонтрагенты.бестОтчество КАК ФизЛицоОтчество,
	|	ИСТИНА КАК МожетБытьУстановленПриборУчета,
	|	ВложенныйЗапрос.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	ВложенныйЗапрос.ОбщаяПлощадь КАК ОтапливаемаяПлощадь,
	|	ВложенныйЗапрос.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.ДатаВступленияВСилу КАК ДатаВступленияВСилу,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|		ВложенныйЗапрос.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|		энргАбоненты.ЛицевойСчет КАК ЛицевойСчет,
	|		энргАбоненты.ФизЛицо КАК ФизЛицо
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Шапка.Ссылка КАК Ссылка,
	|			Шапка.Абонент КАК Абонент,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			ВЫБОР
	|				КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА Шапка.Дата
	|				ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|			КОНЕЦ КАК ДатаВступленияВСилу,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			Шапка.КоличествоПроживающих КАК КоличествоПроживающих,
	|			ЕСТЬNULL(табЗначениеОбщихПлощадейПлощадей.Значение, 0) КАК ОбщаяПлощадь,
	|			ЕСТЬNULL(табЗначениеЖилыхПлощадейПлощадей.Значение, 0) КАК ЖилаяПлощадь
	|		ИЗ
	|			Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЗначениеПлощадей КАК табЗначениеОбщихПлощадейПлощадей
	|				ПО Шапка.Ссылка = табЗначениеОбщихПлощадейПлощадей.Ссылка
	|					И (табЗначениеОбщихПлощадейПлощадей.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ЗначениеПлощадей КАК табЗначениеЖилыхПлощадейПлощадей
	|				ПО Шапка.Ссылка = табЗначениеЖилыхПлощадейПлощадей.Ссылка
	|					И (табЗначениеЖилыхПлощадейПлощадей.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь))
	|		ГДЕ
	|			Шапка.Ссылка В(&мИзменения)
	|			И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Шапка.Ссылка,
	|			Шапка.АбонентСмена,
	|			Шапка.Организация,
	|			Шапка.Район,
	|			ВЫБОР
	|				КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА Шапка.Дата
	|				ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|			КОНЕЦ,
	|			Шапка.КлючПомещения,
	|			Шапка.КоличествоПроживающих,
	|			ЕСТЬNULL(ЗначенияПлощадейСменаСобственника.ОбщаяПлощадь, 0),
	|			ЕСТЬNULL(ЗначенияПлощадейСменаСобственника.ЖилаяПлощадь, 0)
	|		ИЗ
	|			Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|				ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейСменаСобственника КАК ЗначенияПлощадейСменаСобственника
	|				ПО Шапка.Ссылка = ЗначенияПлощадейСменаСобственника.Ссылка
	|		ГДЕ
	|			Шапка.Ссылка В(&мИзменения)
	|			И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО ВложенныйЗапрос.Абонент = энргАбоненты.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|		ПО ВложенныйЗапрос.ФизЛицо = энргКонтрагенты.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗначенияПлощадейСменаСобственника()
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(энргЗначенияПлощадейЖилаяПлощадь.Площадь, 0) КАК ЖилаяПлощадь,
	|	ЕСТЬNULL(энргЗначенияПлощадейОбщаяПлощадь.Площадь, 0) КАК ОбщаяПлощадь
	|ИЗ
	|	(ВЫБРАТЬ
	|		Шапка.Ссылка КАК Ссылка,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.КлючПомещения КАК КлючПомещения,
	|		МАКСИМУМ(ЕСТЬNULL(энргЗначенияПлощадейОбщаяПлощадь.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодОбщаяПлощадь,
	|		МАКСИМУМ(ЕСТЬNULL(энргЗначенияПлощадейЖилаяПлощадь.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодЖилаяПлощадь
	|	ИЗ
	|		Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадейОбщаяПлощадь
	|			ПО Шапка.КлючПомещения = энргЗначенияПлощадейОбщаяПлощадь.КлючПомещения
	|				И Шапка.Организация = энргЗначенияПлощадейОбщаяПлощадь.Организация
	|				И Шапка.Район = энргЗначенияПлощадейОбщаяПлощадь.Район
	|				И (энргЗначенияПлощадейОбщаяПлощадь.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))
	|				И (ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ > энргЗначенияПлощадейОбщаяПлощадь.Период)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадейЖилаяПлощадь
	|			ПО Шапка.КлючПомещения = энргЗначенияПлощадейЖилаяПлощадь.КлючПомещения
	|				И Шапка.Организация = энргЗначенияПлощадейЖилаяПлощадь.Организация
	|				И Шапка.Район = энргЗначенияПлощадейЖилаяПлощадь.Район
	|				И (энргЗначенияПлощадейЖилаяПлощадь.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь))
	|				И (ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ > энргЗначенияПлощадейЖилаяПлощадь.Период)
	|	ГДЕ
	|		Шапка.Ссылка В(&мИзменения)
	|		И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Шапка.Ссылка,
	|		Шапка.Организация,
	|		Шапка.Район,
	|		Шапка.КлючПомещения) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадейОбщаяПлощадь
	|		ПО ВложенныйЗапрос.КлючПомещения = энргЗначенияПлощадейОбщаяПлощадь.КлючПомещения
	|			И ВложенныйЗапрос.Организация = энргЗначенияПлощадейОбщаяПлощадь.Организация
	|			И ВложенныйЗапрос.Район = энргЗначенияПлощадейОбщаяПлощадь.Район
	|			И (энргЗначенияПлощадейОбщаяПлощадь.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь))
	|			И ВложенныйЗапрос.ПериодОбщаяПлощадь = энргЗначенияПлощадейОбщаяПлощадь.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадейЖилаяПлощадь
	|		ПО ВложенныйЗапрос.КлючПомещения = энргЗначенияПлощадейЖилаяПлощадь.КлючПомещения
	|			И ВложенныйЗапрос.Организация = энргЗначенияПлощадейЖилаяПлощадь.Организация
	|			И ВложенныйЗапрос.Район = энргЗначенияПлощадейЖилаяПлощадь.Район
	|			И (энргЗначенияПлощадейЖилаяПлощадь.ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ЖилаяПлощадь))
	|			И ВложенныйЗапрос.ПериодЖилаяПлощадь = энргЗначенияПлощадейЖилаяПлощадь.Период";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗакрытиеЛицевыхСчетовГИСЖКХ()
	
	Текст = 
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Абонент КАК Абонент,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	ЗНАЧЕНИЕ(Справочник.энргПричинаЗакрытияЛС.ПустаяСсылка) КАК ПричинаЗакрытия,
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.Дата
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ КАК ДатаЗакрытия
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мИзменения)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	Шапка.Абонент,
	|	Шапка.КлючПомещения,
	|	Шапка.ПричинаЗакрытияЛС,
	|	ВЫБОР
	|		КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.Дата
	|		ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|	КОНЕЦ
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&мИзменения)
	|	И Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС)";	
		
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ПриборыУчета

Функция ТекстЗапросаПриборыУчетаДляПередачи()
	
	Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.СоставнаяУслуга
	|				И НЕ энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
	|	ВложенныйЗапрос.НаименованиеМодели КАК НаименованиеМодели,
	|	ВложенныйЗапрос.НаименованиеМарки КАК НаименованиеМарки,
	|	ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки,
	|	ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.Дата КАК Дата,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		табПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|		ВложенныйЗапрос.НаименованиеМодели КАК НаименованиеМодели,
	|		ВложенныйЗапрос.НаименованиеМарки КАК НаименованиеМарки,
	|		ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|		ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|		ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|		ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки,
	|		ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Ссылка КАК Ссылка,
	|			ВложенныйЗапрос.Дата КАК Дата,
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			табШкалы.ВидДифференцированности КАК ВидДифференцированности,
	|			табШкалы.IDСтроки КАК IDСтрокиШкалы,
	|			ТипыПриборовУчета.Наименование КАК НаименованиеМодели,
	|			ТипыПриборовУчета.Ссылка КАК ТипПрибораУчета,
	|			ПРЕДСТАВЛЕНИЕ(ТипыПриборовУчета.МаркаПУ) КАК НаименованиеМарки,
	|			ВложенныйЗапрос.ЗаводскойНомер КАК ЗаводскойНомер,
	|			ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|			ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ДатаСледующейПоверкиСчетчика, МЕСЯЦ, -ТипыПриборовУчета.бестМежповерочныйИнтервал) КАК ДатаПоверки,
	|			ВложенныйЗапрос.ДатаУстановки КАК ДатаУстановки
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Шапка.Ссылка КАК Ссылка,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ КАК Дата,
	|				Шапка.Абонент КАК Абонент,
	|				Шапка.КлючПомещения КАК КлючПомещения,
	|				табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|				табТочкиУчета.Услуга КАК Услуга,
	|				табТочкиУчета.IDСтроки КАК IDСтроки,
	|				табТочкиУчета.ДатаПоверкиСчетчика КАК ДатаСледующейПоверкиСчетчика,
	|				ВЫБОР
	|					КОГДА Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Шапка.Дата
	|					ИНАЧЕ Шапка.ДатаФактическогоСобытия
	|				КОНЕЦ КАК ДатаУстановки,
	|				ПриборыУчетаАбонента.Код КАК ЗаводскойНомер,
	|				ПриборыУчетаАбонента.ТипПрибораУчета КАК МодельПрибораУчета,
	|				ПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем
	|			ИЗ
	|				Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК табТочкиУчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|					ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|						И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК ПриборыУчетаАбонента
	|					ПО табТочкиУчета.ПриборУчета = ПриборыУчетаАбонента.Ссылка
	|			ГДЕ
	|				Шапка.Ссылка В(&мИзменения)
	|				И табТочкиУчета.Ссылка В(&мИзменения)) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ШкалыПриборовУчета КАК табШкалы
	|				ПО ВложенныйЗапрос.Ссылка = табШкалы.Ссылка
	|					И ВложенныйЗапрос.IDСтроки = табШкалы.IDСтрокиТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК ТипыПриборовУчета
	|				ПО ВложенныйЗапрос.МодельПрибораУчета = ТипыПриборовУчета.Ссылка) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|			ПО ВложенныйЗапрос.Ссылка = табПоказанияПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиШкалы = табПоказанияПриборовУчета.IDСтроки) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|			И (энргВидыУслугСоставляющиеУслуг.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ВложенныйЗапрос.Услуга = энргВидыУслуг.Ссылка";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПриборыУчетаДляОбновления()
	
	Текст = 
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.АбонентСмена КАК Абонент,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	Шапка.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК табТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|ГДЕ
	|	Шапка.Ссылка В(&мИзменения)
	|	И табТочкиУчета.Ссылка В(&мИзменения)";
	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаПриборыУчетаДляАрхивации()
	
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПричинаЗаменыПрибораУчета КАК ПричинаЗаменыПрибораУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка,
	|		энргОперацияСЛицевымСчетом.Организация КАК Организация,
	|		энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Справочник.энргПричиныАрхивацииПУ.ПустаяСсылка) КАК ПричинаЗаменыПрибораУчета
	|	ИЗ
	|		Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК энргОперацияСЛицевымСчетомТочкиУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
	|			ПО (энргОперацияСЛицевымСчетом.Ссылка = энргОперацияСЛицевымСчетом.Ссылка)
	|				И (энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС))
	|				И (НЕ энргОперацияСЛицевымСчетомТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|	ГДЕ
	|		энргОперацияСЛицевымСчетом.Ссылка В(&мИзменения)
	|		И энргОперацияСЛицевымСчетомТочкиУчета.Ссылка В(&мИзменения)) КАК ВложенныйЗапрос";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли