#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ЗначенияЗаполнения);
	ВыборОперации 							= Параметры.ВыборОперации;	
	Если ВыборОперации тогда 
		бестРаботаСВидамиОперацийСервер.ЗаполнитьСписокВозможныхОперацийФормаСписка(Параметры.ИмяДокумента,СписокОпераций);
		ИмяДокумента 						= Параметры.ИмяДокумента;
		Основание 							= Параметры.Основание;
		ЭтаФорма.Заголовок 					= "Выбор вида операции";
	иначе
		СписокОпераций 						= Параметры.ВозможныеЗначения;
		ЭтаФорма.Заголовок 					= "Тип выбираемого объекта";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбранноеЗначение  	= СписокОпераций[ВыбраннаяСтрока].Значение;
	Если ВыборОперации тогда
		ПрефиксФормы 		= бестРаботаСВидамиОперацийВызовСервера.ПрефиксФормы(ИмяДокумента,ВыбранноеЗначение);
		Парам = Новый Структура;
		Парам.Вставить("Основание",Основание);
		
		Если ЗначениеЗаполнено(Договор) Тогда
			СтруктураЗаполнения = Новый Структура;
			Если Не ПрефиксФормы = "ОткрытиеДоговора" Тогда  
				СтруктураЗаполнения.Вставить("Договор",Договор);
				Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
					СтруктураЗаполнения.Вставить("ОбъектРасчета", ОбъектРасчета);
				КонецЕсли;
				Если ЗначениеЗаполнено(ТочкаУчета) Тогда
					СтруктураЗаполнения.Вставить("ТочкаУчета", ТочкаУчета);
				КонецЕсли;
				Если ЗначениеЗаполнено(ПриборУчета) Тогда
					СтруктураЗаполнения.Вставить("ПриборУчета", ПриборУчета);
				КонецЕсли;
			КонецЕсли;
			
			Соответствие = Новый Соответствие;
			Соответствие.Вставить("Район");
			Соответствие.Вставить("Организация");
			Соответствие.Вставить("Контрагент");
			
			энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(, Договор, Соответствие);
			
			СтруктураЗаполнения.Вставить("Район",Соответствие["Район"]);
			СтруктураЗаполнения.Вставить("Организация",Соответствие["Организация"]);
			СтруктураЗаполнения.Вставить("Контрагент",Соответствие["Контрагент"]);
			
			Парам.Вставить("ЗначенияЗаполнения",СтруктураЗаполнения);
			Парам.Вставить("ЗаполнитьДокумент",Истина);
		КонецЕсли;
		бестРаботаСВидамиОперацийКлиент.ОткрытьФормуНовогоДокументаПоВидуОперации(ИмяДокумента,ВыбранноеЗначение,ПрефиксФормы, Парам);
		ЭтаФорма.Закрыть();
	иначе
		ОповеститьОВыборе(ВыбранноеЗначение);
	КонецЕсли;  	
КонецПроцедуры

// Стандартная не работает, заменил временно на это!
&НаКлиенте
Процедура Выбрать(Команда)
	СписокОперацийВыбор(Элементы.СписокОпераций, ТекущийЭлемент.ТекущаяСтрока, Элементы.СписокОпераций.ТекущийЭлемент, Истина);
КонецПроцедуры

#КонецОбласти
