#Область СлужебныйПрограммныйИнтерфейс

#Область Интерфейс

Функция ПолучитьМассивКнопок(БизнесПроцесс, ТочкаМаршрута) Экспорт
	
	МассивКнопок		= Новый Массив;
	ТипЗнчБизнесПроцесс	= ТипЗнч(БизнесПроцесс);
	
	Если ТипЗнчБизнесПроцесс = Тип("БизнесПроцессСсылка.бестПроверкаКомплектаДокументов") Тогда
		
		Если ТочкаМаршрута = БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.ПрикрепитьДокументы Тогда
			
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "ОтказВЗаключенииДоговора", "Отказ в заключении договора"));
			
		ИначеЕсли ТочкаМаршрута = БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.НаправитьУведомлениеОбОтсутствииДокументов
			ИЛИ ТочкаМаршрута = БизнесПроцессы.бестПроверкаКомплектаДокументов.ТочкиМаршрута.УведомлениеОбОтказе Тогда
			
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "ОтправитьПоЭлПочтеСмс", "Отправить по эл.почте/смс"));
						
		КонецЕсли;
		
	ИначеЕсли ТипЗнчБизнесПроцесс = Тип("БизнесПроцессСсылка.бестПодготовкаПроектаДоговора") Тогда
		Если ТочкаМаршрута = БизнесПроцессы.бестПодготовкаПроектаДоговора.ТочкиМаршрута.ОтправитьПодписанныйДоговор Тогда
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "ОтправитьПоЭлПочтеСмс", "Отправить по эл.почте/смс"));
		КонецЕсли;
		
	ИначеЕсли ТипЗнчБизнесПроцесс = Тип("БизнесПроцессСсылка.бестНаправлениеДокументаРуководителю") Тогда
		Если ТочкаМаршрута = БизнесПроцессы.бестНаправлениеДокументаРуководителю.ТочкиМаршрута.ПодписьДокументаРуководителем Тогда
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "ВернутьНаДоработку", "Вернуть на доработку"));
		КонецЕсли;
	ИначеЕсли ТипЗнчБизнесПроцесс = Тип("БизнесПроцессСсылка.бестНаправлениеПротоколаРазногласийЮристам") Тогда
		Если ТочкаМаршрута = БизнесПроцессы.бестНаправлениеПротоколаРазногласийЮристам.ТочкиМаршрута.НаправитьПротоколСогласованияРазногласийПотребителю Тогда
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "ВернутьНаДоработку", "Вернуть на доработку"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "ОтправитьПоЭлПочтеСмс", "Отправить по эл.почте/смс"));
		ИначеЕсли ТочкаМаршрута = БизнесПроцессы.бестНаправлениеПротоколаРазногласийЮристам.ТочкиМаршрута.ОценитьНеобходимостьСоставленияПротоколаСогласованияРазногласий Тогда
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "СоставитьПротоколСогласованияРазногласий", "Составить протокол согласования разногласий"));
		КонецЕсли;
	ИначеЕсли ТипЗнчБизнесПроцесс = Тип("БизнесПроцессСсылка.бестЗаключениеДоговора") Тогда
		Если ТочкаМаршрута = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ПолучитьОтветПотребителя 
			ИЛИ ТочкаМаршрута = БизнесПроцессы.бестЗаключениеДоговора.ТочкиМаршрута.ПолучитьОтветНаРазногласийПотребителя Тогда
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
			МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "ПолученПротоколРазногласий", "Получен протокол разногласий"));
		КонецЕсли;
	КонецЕсли;
	
	Если МассивКнопок.Количество() = 0 Тогда
		МассивКнопок.Добавить(Новый Структура("ИмяКнопки, Заголовок", "Выполнено", "Выполнено"));
	КонецЕсли;
	
	Возврат МассивКнопок
	
КонецФункции 

#КонецОбласти

#КонецОбласти