#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает значения свойств объекта.
//
// Параметры:
//  Строение			-	СправочникСсылка.энргСтроения.
//  ПолучаемыеСвойства	-	Структура.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияСвойствОбъекта(Строение, ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСтроенияМенеджер") = Неопределено Тогда
				Возврат Обработки["слжСтроенияМенеджер"].ЗначенияСвойствОбъекта(Строение, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргСтроения.ЗначенияСвойствОбъекта(Строение, ПолучаемыеСвойства);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргСтроения.ЗначенияСвойствОбъекта";
		ПараметрыМетода 			= Новый Структура("Строение, ПолучаемыеСвойства", Строение, ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат; 	
	
КонецФункции

// Возвращает виды благоустройства, тарифные категории и строения.
//
// Параметры:
//  Строение	-	СправочникСсылка.энргСтроения.
//  мВидыУслуг	-	Массив.
// 
// Возвращаемое значение:
//    РезультатЗапроса.
//
Функция ВидыБлагоустройстваТарифныеКатегорииСтроения(Строение,мВидыУслуг) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСтроенияМенеджер") = Неопределено Тогда
				Возврат Обработки["слжСтроенияМенеджер"].ВидыБлагоустройстваТарифныеКатегорииСтроения(Строение, мВидыУслуг);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргСтроения.ВидыБлагоустройстваТарифныеКатегорииСтроения(Строение, мВидыУслуг);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргСтроения.ЗначенияСвойствОбъекта";
		ПараметрыМетода 			= Новый Структура("Строение,мВидыУслуг", Строение,мВидыУслуг);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультатЗапросаКодом(ИмяМетода, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет состояние лицевых счетов ВМКД.
//
// Параметры:
//  СхемаЗапроса	-	СхемаЗапроса.
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  МКД				-	СправочникСсылка.энргСтроения.
//
Процедура СостояниеЛицевыхСчетовВМКД(СхемаЗапроса, Период, Организация, Район, МКД) Экспорт
	
	Если СхемаЗапроса = Неопределено Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		Пакет 	= СхемаЗапроса.ПакетЗапросов[0];
	Иначе
		Пакет 	= СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргКлючиПомещений.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ КлючиПомещенийМКД
	|ИЗ
	|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|ГДЕ
	|	энргКлючиПомещений.Строение = &МКД");
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргАбоненты.Ссылка КАК Абонент
	|ПОМЕСТИТЬ АбонентыКлючейПомещенийМКД
	|ИЗ
	|	КлючиПомещенийМКД КАК КлючиПомещенийМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО КлючиПомещенийМКД.Ссылка = энргАбоненты.КлючПомещения");	
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргСостояниеЛССрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ АктивныеЛСМКД
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						АбонентыКлючейПомещенийМКД.Абонент КАК Абонент
	|					ИЗ
	|						АбонентыКлючейПомещенийМКД КАК АбонентыКлючейПомещенийМКД)) КАК энргСостояниеЛССрезПоследних
	|ГДЕ
	|	энргСостояниеЛССрезПоследних.Состояние");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли