#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вызывается при переходе на версию конфигурации 2.1.3.16.
//
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииФилиалы() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаВидовКонтактнойИнформацииОбъект = Справочники.ВидыКонтактнойИнформации.СправочникотэкСудебныеУчастки.ПолучитьОбъект();
	ГруппаВидовКонтактнойИнформацииОбъект.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаВидовКонтактнойИнформацииОбъект);
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ПараметрыВида = МодульУправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресСудебногоУчастка;  	
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	ПараметрыВида.ОбязательноеЗаполнение = Ложь;
	МодульУправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

// Функция - Получить судебное учреждение по строению
//
// Параметры:
//  Строение - СправочникСсылка.энргСтроения - Строение.
// 
// Возвращаемое значение:
//  СправочникСсылка.энргСудебныеУчастки - Судебный участок. 
//
Функция ПолучитьСудебноеУчреждениеПоСтроению(Строение) Экспорт 
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	отэкСудебныеУчастки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.энргСудебныеУчастки.Строения КАК отэкСудебныеУчасткиСтроения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргСудебныеУчастки КАК отэкСудебныеУчастки
	               |		ПО отэкСудебныеУчасткиСтроения.Ссылка = отэкСудебныеУчастки.Ссылка
	               |ГДЕ
	               |	отэкСудебныеУчасткиСтроения.Строение = &Строение";
	
	Запрос.УстановитьПараметр("Строение", Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Выборка		= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат 	= Выборка.Ссылка;
	
	Возврат Результат;	
КонецФункции

#КонецОбласти   

#КонецЕсли
