#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОбходнойЛист(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
			
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация); 		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	ИмяТаблицыПоказания						= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПриборыУчетаТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));	
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	 ЗагрузитьИзXML();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоАбоненту(Команда)
	Если НЕ ЗначениеЗаполнено(Абонент) Тогда
		ПоказатьПредупреждение(,"Заполните Абонента");
		Возврат;
	КонецЕсли;
	
	Если ДанныеПоОтборуЕсть("Абонент", Абонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту: " + СокрЛП(Абонент) + " данные заполнены.");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеДляЗаполненияПоАбоненту();	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДляЧтенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 		= Ложь;
	Диалог 						= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "xml|*.xml";
	//Диалог.Фильтр 	= "Электронная таблица (*.dbf)|*.dbf";
	Если Диалог.Выбрать() тогда
		Объект.ФайлДляЧтения 	= Диалог.ПолноеИмяФайла;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура ЗагрузитьИзXML()
	
	Если не ЗначениеЗаполнено(Объект.ФайлДляЧтения) и не ЗначениеЗаполнено(Объект.URLДляЧтения) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите файл или url для чтения",,"ФайлДляЧтения","ФайлДляЧтения");
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(объект.ФайлДляЧтения) тогда
		СЗ = ПрочитатьиРазобратьХМЛ(объект.ФайлДляЧтения);
	иначеЕсли ЗначениеЗаполнено(объект.URLДляЧтения) тогда;
		СЗ = ПрочитатьиРазобратьХМЛ(объект.URLДляЧтения);
	КонецЕсли;
	отправитьНаОбработку(СЗ);
КонецПроцедуры

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

#Область ЗагрузкиДанных

&наклиенте
Функция   ПрочитатьиРазобратьХМЛ(ФайлДляЧтения)
	Файл = Новый ДвоичныеДанные(ФайлДляЧтения);
	Адрес = ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
	СЗ = РазобратьХМЛ(Адрес);
	Возврат СЗ;
КонецФункции

&НаСервере
Функция РазобратьХМЛ(Адрес)
	обработка = Обработки.энргЗагрузкаИзВнешнихИсточников_ОбходнойЛист.Создать();
	СЗ = обработка.РазобратьХМЛ(Адрес);
	возврат СЗ;
КонецФункции

&НаКлиенте
Процедура ИсправитьДанные(Команда)
	ИсправитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправитьДанныеНаСервере()
	ТЗ = сформироватьТЗ();
	обработка = Обработки.энргЗагрузкаИзВнешнихИсточников_ОбходнойЛист.Создать();
	ТЗБаза = обработка.ЗаполнитьТочкиУчетаСервер(объект, ТЗ);
	для каждого строка из ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказания цикл
		Если строка.НомерПрибораУчета<>""  тогда
			// обходим первую таблицу и ищем во второй строки с таким же номером прибора учета
			Отбор = Новый Структура("приборучета", Справочники.энргПриборыУчетаАбонента.НайтиПоКоду(строка.НомерПрибораУчета));
			Если ЗначениеЗаполнено(Отбор.приборучета) тогда
				МассивСтрок = ТЗБаза.НайтиСтроки(Отбор);
			КонецЕсли;
		КонецЕсли;
		
		Если МассивСтрок.количество()>0 или не ЗначениеЗаполнено(Отбор.приборучета) Тогда // ничего не нашли
			продолжить;
		иначе
			для каждого строкамассива из массивстрок цикл
				если ЗначениеЗаполнено(строкамассива.приборучета) тогда
					стротбора = новый структура;
					стротбора.Вставить("НомерПрибораУчета", строка.НомерПрибораУчета);
					нДокТУ = объект.ТочкиУчета.Добавить();
					ЗначИзБазы  = ТЗБаза.найти(строкамассива.ПриборУчета, "ПриборУчета");
					нДокТУ.ПриборУчета = ЗначИзБазы.ПриборУчета;
					нДокТУ.ТочкаУчета = ЗначИзБазы.ТочкаУчета;
					нДокНЕТУ = ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказания.НайтиСтроки(стротбора);
					IDудаляемойстроки = нДокНЕТУ[0].IDСтроки;
					стротбора = новый структура;
					стротбора.Вставить("IDСтроки", IDудаляемойстроки);
					ПоказанияТУФорма = ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.НайтиСтроки(стротбора);
				КонецЕсли;
				
			ТекущийПриборУчета = Обработка.получитьДанныеПрибораУчета(строкамассива.ПриборУчета);
			Обработка.ЗаполнитьДанныеПриборовУчета(Отбор.приборучета, ПоказанияТУФорма,ТекущийПриборУчета, объект, ТЗ);
			КонецЦикла;

			// удаление строка, которые перенесли в другую ТЧ
			ПУДляУдаления = Новый Массив;
			для каждого строка из ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказания цикл
				если строка.IDСтроки = IDудаляемойстроки тогда
					  ПУДляУдаления.Добавить(строка);
				КонецЕсли;
			КонецЦикла;
			для счетчик = 0 по ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказания.НайтиСтроки(стротбора).Количество()-1 цикл
				ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказания.Удалить(ПУДляУдаления[счетчик]);
			КонецЦикла;

			ПоказанияДляУдаления = Новый Массив;
			для каждого строка из ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона цикл
				если строка.IDСтроки = IDудаляемойстроки тогда
					  ПоказанияДляУдаления.Добавить(строка);
				КонецЕсли;
			КонецЦикла;
			для счетчик = 0 по ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.НайтиСтроки(стротбора).Количество()-1 цикл
				ЭтаФорма.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.Удалить(ПоказанияДляУдаления[счетчик]);
			КонецЦикла;
			
		КонецЕсли;
		
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьДанныеДляЗаполненияПоАбоненту()
	Результат = энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Объект.Дата,Объект.Организация,Объект.Район,Абонент.КлючПомещения); 
	
	ЗаполнитьПоказанияНаСервере(Результат);
КонецФункции

&НаСервере
Процедура отправитьНаОбработку(СЗ)
	
	ТЗ = сформироватьТЗ();
	обработка = Обработки.энргЗагрузкаИзВнешнихИсточников_ОбходнойЛист.Создать();
	обработка.ЗаполнитьДокумент(СЗ, объект, ТЗ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказанияНаСервере(Результат)

	Выборка  									= Результат.выбрать();
	ТекКлючПомещения							= Неопределено;
	ТекТочкаУчета 								= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() Цикл 
		НоваяТочка = Ложь;
		Если Не ТекКлючПомещения = Выборка.КлючПомещения Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.КлючПомещения 		= Выборка.КлючПомещения;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона; 
		
		ТекКлючПомещения 						= Выборка.КлючПомещения;
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
	    ТекШкала 								= Выборка.Шкала
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация, Объект.Район,ТаблицаПоказанийДляЗаполнения,Объект.Дата,Истина);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
	Объект.ТочкиУчета.Сортировать("Строение,Помещение");
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	ЗаполнитьАбонентов();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСостояниеЛСАбонента(Организация, Район, Абонент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСостояниеЛССрезПоследних.Период КАК Период,
		|	энргСостояниеЛССрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
		|			&ТекДата,
		|			Абонент = &Абонент
		|				И Район = &Район
		|				И Организация = &Организация) КАК энргСостояниеЛССрезПоследних";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Новый Структура("Период, Состояние", Выборка.Период, Выборка.Состояние);
	КонецЦикла;

КонецФункции

&НаСервере
Процедура ЗаполнитьАбонентов()
	Ключи 		= новый Массив;
	ДанныеСтрок = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("Абонент", Справочники.энргАбоненты.ПустаяСсылка()));
	Для Каждого ТекСтр из ДанныеСтрок Цикл 
		Ключи.Добавить(ТекСтр.КлючПомещения);
	КонецЦикла;	
	
	//Ключи = Объект.ТочкиУчета.Выгрузить(,"КлючПомещения").ВыгрузитьКолонку("КлючПомещения");
	КлючиАбонентов = АбонентыКлючейПомещений(Ключи);
	Для Каждого СтрТУ Из ДанныеСтрок Цикл
		СтрТУ.Абонент = КлючиАбонентов.Получить(СтрТУ.КлючПомещения);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция АбонентыКлючейПомещений(Ключи)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.Ссылка КАК Абонент,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	НЕ энргАбоненты.ПометкаУдаления
		|	И энргАбоненты.КлючПомещения В(&КлючПомещения)
		|	И энргАбоненты.Организация = &Организация";
	
	Запрос.УстановитьПараметр("КлючПомещения", Ключи);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.КлючПомещения,ВыборкаДетальныеЗаписи.Абонент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеПоОтборуЕсть(ИмяРеквизита, ЗначениеРеквизита)
	Возврат Объект.ТочкиУчета.НайтиСтроки(Новый Структура(ИмяРеквизита, ЗначениеРеквизита)).Количество() > 0;
КонецФункции

&НаСервере
Функция СформироватьТЗ()
	ТЗ = новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("абонент", новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	ТЗ.Колонки.Добавить("ИспользоватьТарифныеЗоны", новый ОписаниеТипов("булево"));
	ТЗ.Колонки.Добавить("ИспользоватьШкалыПриборовУчета", новый ОписаниеТипов("булево"));
	ТЗ.Колонки.Добавить("НеЗагруженныеДанныеНеЗагруженныеПоказания", новый ОписаниеТипов("ДанныеФормыКоллекция"));
	ТЗ.Колонки.Добавить("НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона", новый ОписаниеТипов("ДанныеФормыКоллекция"));
	ТЗ.Колонки.Добавить("ПрефиксТочекУчета", новый ОписаниеТипов("строка"));
	ТЗ.Колонки.Добавить("ТочкаУчетаОтбор", новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	строкаТЗ = тз.Добавить();
	строкаТЗ.абонент												 = этаформа.Абонент;
	строкаТЗ.ИспользоватьТарифныеЗоны								 = ЭтаФорма.ИспользоватьТарифныеЗоны;
	строкаТЗ.ИспользоватьШкалыПриборовУчета						 = ЭтаФорма.ИспользоватьШкалыПриборовУчета;
	строкаТЗ.НеЗагруженныеДанныеНеЗагруженныеПоказания			 = этаформа.НеЗагруженныеДанныеНеЗагруженныеПоказания;
	строкаТЗ.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона = этаформа.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона;
	строкаТЗ.ПрефиксТочекУчета 									 = ЭтаФорма.ПрефиксТочекУчета;
	строкаТЗ.ТочкаУчетаОтбор										 = ЭтаФорма.ТочкаУчетаОтбор;	

	возврат ТЗ;
КонецФункции

#КонецОбласти