#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗапуститьОбработкуОчередиМногопоточно(ПараметрыФункции, Потоки, УникальныйИдентификатор) Экспорт
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор); 
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Загрузка данных почасовой ведомости";
    Обработчик = "Обработка.бестВыгрузкаИнтервальныхДанныхExcel.МодульОбъекта.ПрочитатьПотокФайлов";  
	
	МассивДО = Новый Массив;
	Для Каждого Очередь из Потоки Цикл   
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, Обработчик, ПараметрыФункции, Очередь.Значение); 
		МассивДО.Добавить(ДлительнаяОперация);
	КонецЦикла;
	
	Возврат МассивДО; 
КонецФункции 

#КонецОбласти

#КонецЕсли