#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСОбработкамиЗагрузкиДанных

Функция НаборОбработокЗагрузкиДанных() Экспорт 
	МассивИмен = Новый Массив;
	ДополнитьНаборИменОбработокЗагрузкиДанных(МассивИмен);
		
	СсылкиИдентификаторов 	= ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(МассивИмен);
	МассивИдентификаторов	= Новый Массив;
	Для Каждого ТекКлючЗначение из СсылкиИдентификаторов Цикл
		МассивИдентификаторов.Добавить(ТекКлючЗначение.Значение);	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ИдентификаторыМетаданных
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.Ссылка В(&МассивИдентификаторов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИдентификаторыМетаданных.Ссылка КАК Ссылка
		|ИЗ
		|	ИдентификаторыМетаданных КАК ИдентификаторыМетаданных
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИдентификаторыМетаданных.Ссылка.Родитель
		|ИЗ
		|	ИдентификаторыМетаданных КАК ИдентификаторыМетаданных";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Процедура ДополнитьНаборИменОбработокЗагрузкиДанных(Результат) Экспорт
	ПроверитьИДобавитьОбработкуЗарузкиДанных(Результат, "энргЗагрузкаПоказанийПирамида");
	ПроверитьИДобавитьОбработкуЗарузкиДанных(Результат, "энргЗагрузкаПоказанийПолитариф");
	ПроверитьИДобавитьОбработкуЗарузкиДанных(Результат, "энргЗагрузкаПоказанийГИСЖКХ");
	ПроверитьИДобавитьОбработкуЗарузкиДанных(Результат, "энргЗагрузкаПоказанийПирамидаЧерезExcel");
	ПроверитьИДобавитьОбработкуЗарузкиДанных(Результат, "бестЗагрузкаПоказанийПирамидаЧерезExcel");
КонецПроцедуры

Процедура ПроверитьИДобавитьОбработкуЗарузкиДанных(Результат, ИмяОбработки)
	МетаОбработка = Метаданные.Обработки.Найти(ИмяОбработки);
	Если НЕ МетаОбработка = Неопределено Тогда
		Результат.Добавить(МетаОбработка.ПолноеИмя());
	КонецЕсли;	
КонецПроцедуры


Функция ПолучитьИсточникПоПолномуИмениОбработки(ИмяОбработки) Экспорт
	Результат			 = Справочники.энргИсточникиПоказаний.ПустаяСсылка();
	СсылкаИдентификатора = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяОбработки); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргИсточникиПоказаний.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргИсточникиПоказаний КАК энргИсточникиПоказаний
	|ГДЕ
	|	НЕ энргИсточникиПоказаний.ПометкаУдаления
	|	И энргИсточникиПоказаний.ОбработкаЗагрузки = &ОбработкаЗагрузки";
	
	Запрос.УстановитьПараметр("ОбработкаЗагрузки", СсылкаИдентификатора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли