#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
		
	Ответственный 			= Пользователи.ТекущийПользователь();
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли; 	
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ОтветПроверки = энргРаботаСПоказаниямиПриборовУчетаСервер.ПроверитьПоказанияПоВсемЗонамСуток(ЭтотОбъект);
	Если НЕ ОтветПроверки.Успешно Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОтветПроверки.ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Документы.энргУстановитьСхемуПодчиненностиТочекУчета.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	Документы.энргУстановитьСхемуПодчиненностиТочекУчета.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") и ДанныеЗаполнения.Свойство("Абонент") Тогда		
		Соответствие = Новый Соответствие;
		Соответствие.Вставить("КлючПомещения");
		Соответствие.Вставить("Район");
		Соответствие.Вставить("Организация");
		энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(, ДанныеЗаполнения.Абонент, Соответствие);
		ДанныеЗаполнения.Вставить("КлючПомещения"		,Соответствие["КлючПомещения"]);
		ДанныеЗаполнения.Вставить("Район"				,Соответствие["Район"]);
		ДанныеЗаполнения.Вставить("Организация"			,Соответствие["Организация"]);
		ДанныеЗаполнения.Вставить("ЗаполнитьДокумент"	,Истина);		
	КонецЕсли;
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочекУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	ТаблицаТочекУчета.Ссылка КАК Регистратор,
	|	ТаблицаТочекУчета.Ссылка.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ПриборыУчета
	|ИЗ
	|	Документ.энргУстановитьСхемуПодчиненностиТочекУчета.ТочкиУчета КАК ТаблицаТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргУстановитьСхемуПодчиненностиТочекУчета.ШкалыПриборовУчета КАК ТаблицаШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьСхемуПодчиненностиТочекУчета.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|			ПО ТаблицаШкалыПриборовУчета.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки
	|				И (НЕ ТаблицаПоказанияПриборовУчета.ПоказанияПредоставлены)
	|		ПО ТаблицаТочекУчета.IDСтроки = ТаблицаШкалыПриборовУчета.IDСтрокиТочкиУчета
	|ГДЕ
	|	ТаблицаТочекУчета.Ссылка = &ссылка
	|	И НЕ ТаблицаТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	|	И ТаблицаПоказанияПриборовУчета.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА энргМаксимальныеПоказанияСрез.Организация ЕСТЬ NULL
	|			ТОГДА ПриборыУчета.ПериодНачисления
	|		ИНАЧЕ энргМаксимальныеПоказанияСрез.ПериодНачисления
	|	КОНЕЦ КАК ПериодНачисления,
	|	ПриборыУчета.ПриборУчета КАК ПриборУчета,
	|	ПриборыУчета.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ПриборыУчета.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ПриборыУчета.Разделитель КАК Разделитель
	|ИЗ
	|	ПриборыУчета КАК ПриборыУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|		ПО ПриборыУчета.Регистратор = энргМаксимальныеПоказанияСрез.ДокРегистратор
	|			И ПриборыУчета.ПриборУчета = энргМаксимальныеПоказанияСрез.ПриборУчета
	|			И (ПриборыУчета.Регистратор.ПометкаУдаления)";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить()); 
	
КонецФункции

Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
		
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли