#Область ПрограммныйИнтерфейс

// Получает представление периода регистрации.
//
// Параметры:
//  ПериодРегистрации	-	Дата.
//  КалендарныйПериод	-	Строка.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации, КалендарныйПериод = "Месяц") Экспорт
	
	Если КалендарныйПериод = "Месяц" Тогда
		Возврат Формат(ПериодРегистрации, "ДФ='MMMM yyyy'")
	ИначеЕсли КалендарныйПериод = "Квартал" Тогда
		Возврат ПредставлениеПериода(НачалоКвартала(ПериодРегистрации), КонецКвартала(ПериодРегистрации));
	КонецЕсли;
	
КонецФункции

// Увеличивает или уменьшает значение периода на одно значение.
//
// Параметры:
//  Направление                     - Число  - "1", если шагаем на следующий месяц, "-1", если шагаем в предыдущий месяц.
//  СтандартнаяОбработка            - Булево - Признак стандартной обработки события.
//  ПериодРегистрации               - Дата   - Переменная, в которую помещается значение следующего или предыдущего месяца.
//  ПредставлениеПериодаРегистрации - Строка - Представление месяца ПериодаРегистрации.
//
Процедура РегулированиеПредставленияПериодаРегистрации(Направление, СтандартнаяОбработка, ПериодРегистрации, ПредставлениеПериодаРегистрации) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Направление = 1 Тогда
		ПериодРегистрации = КонецМесяца(ПериодРегистрации) + 1;
	ИначеЕсли Направление = -1 Тогда
		ПериодРегистрации = НачалоМесяца(ПериодРегистрации - 1);
	КонецЕсли;
	
	ПредставлениеПериодаРегистрации = ПолучитьПредставлениеПериодаРегистрации(ПериодРегистрации);
	
КонецПроцедуры

// Проверяет заполнения района и организации.
//
// Параметры:
//  ЭтаФорма	-	ФормаКлиентскогоПриложения.
//  Объект		-	ДокументОбъект.бестИзменениеТиповСхемГВСМКД.
//  Отказ		-	Булево.
//  СписокПолей	-	Структура.
//
Процедура ПроверкаЗаполненияРайонаИОрганизации(ЭтаФорма, Объект, Отказ, СписокПолей = Неопределено) Экспорт 
	Если СписокПолей = Неопределено Тогда 
		СписокПолей = Новый Структура("Организация, Район");
	КонецЕсли;
	
	Для каждого ТекПоле Из СписокПолей Цикл
		Если Не ЗначениеЗаполнено(Объект[ТекПоле.Ключ]) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле: " + ТекПоле.Ключ,, ТекПоле.Ключ, "Объект");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

#Область Макросы

// Печатает макросы объекта.
//
// Параметры:
//  ОбъектСсылка		-	ЛюбаяСсылка.
//  ВыбранноеЗначение	-	Строка.
//  ОткрытьДокумент		-	Булево.
//
Процедура ПечатьМакросовОбъекта(ОбъектСсылка, ВыбранноеЗначение, ОткрытьДокумент=Истина) Экспорт 
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОбъектСсылка", ОбъектСсылка);
	ПараметрыОповещения.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	ПараметрыОповещения.Вставить("ОткрытьДокумент", ОткрытьДокумент);
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		// Попробуем подключить расширение работы с файлами
		
		РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
		Если НЕ РасширениеПодключено Тогда
			// Расширение не установлено, пробуем установить
			ПараметрыОповещения.Вставить("ДоПодключения", Истина);
			ОбработкаОкончанияУстановкиРасширения = Новый ОписаниеОповещения("Обработчик_Завершения_УстановкиРасширения", ЭтотОбъект, ПараметрыОповещения); 
			НачатьУстановкуРасширенияРаботыСФайлами(ОбработкаОкончанияУстановкиРасширения);
			Возврат;
		КонецЕсли;
				
	КонецЕсли;
	
	ПараметрыОповещения.Вставить("ДоПодключения", Ложь);
	Обработчик_Завершения_УстановкиРасширения(ПараметрыОповещения);
	
	
	
КонецПроцедуры

// Выполняет завершения установки расширения.
//
// Параметры:
//  ДопПараметры	-	Структура.
//
Процедура Обработчик_Завершения_УстановкиРасширения(ДопПараметры) Экспорт
	ОбъектСсылка  = ДопПараметры.ОбъектСсылка;
	ВыбранноеЗначение = ДопПараметры.ВыбранноеЗначение;
	ОткрытьДокумент = ДопПараметры.ОткрытьДокумент;
	Если ДопПараметры.ДоПодключения Тогда
		РасширениеПодключено =  ПодключитьРасширениеРаботыСФайлами();
		Если Не РасширениеПодключено Тогда
			// Расширение не удалось установить, сообщаем об этом пользователю
			ПоказатьПредупреждение( , НСтр("ru = 'Для выполнения данной операции нужно установить расширение работы с файлами.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	РеквизитыОбъекта = Новый Соответствие;
	РеквизитыОбъекта.Вставить("Наименование");
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(, ВыбранноеЗначение, РеквизитыОбъекта);
	
	ПечатнаяФорма = энргОбщегоНазначения.ПолучитьПечатнуюФорму(ВыбранноеЗначение);
	
	Если Не ЗначениеЗаполнено(ПечатнаяФорма) Тогда 
		Возврат; 
	КонецЕсли;
	
	ИндТочки = Найти(РеквизитыОбъекта["Наименование"], ".");
	ТекДатаСтрока = Строка(ТекущаяДата());
	ТекДатаСтрока = СтрЗаменить(ТекДатаСтрока, ":","_");
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Попытка
			ДополнительныеПараметры = Новый Соответствие;
			ДополнительныеПараметры.Вставить("ОбъектСсылка", ОбъектСсылка);
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаСохраненияФайлов", ЭтотОбъект, ДополнительныеПараметры);
			ИмяФайла =  Лев(РеквизитыОбъекта["Наименование"], ИндТочки - 1)  + " " + ТекДатаСтрока + Прав(РеквизитыОбъекта["Наименование"], СтрДлина(РеквизитыОбъекта["Наименование"]) - ИндТочки + 1);   
			Адрес = ПоместитьВоВременноеХранилище(ПечатнаяФорма);
			Файл = Новый ОписаниеПередаваемогоФайла(ИмяФайла, Адрес);
			
			ПолучаемыеФайлы = Новый Массив;
			ПолучаемыеФайлы.Добавить(Файл);
			
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			
			НачатьПолучениеФайлов(ОписаниеОповещения,ПолучаемыеФайлы, ДиалогОткрытияФайла, Истина);
			
		Исключение
			Возврат;
		КонецПопытки;
	Иначе
		ПутьКФайлу = КаталогВременныхФайлов() + Лев(РеквизитыОбъекта["Наименование"], ИндТочки - 1)  + " " + ТекДатаСтрока + Прав(РеквизитыОбъекта["Наименование"], СтрДлина(РеквизитыОбъекта["Наименование"]) - ИндТочки + 1);	
		Попытка
			ПечатнаяФорма.Записать(ПутьКФайлу);
		Исключение
			энргОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		COMОбъект = ПолучитьCOMОбъект(ПутьКФайлу);	
		COMДокумент = COMОбъект.Application.Documents(1);  
		ЗаменитьМакросыПечати(ОбъектСсылка, COMДокумент);
		 COMОбъект.save();
		Попытка
			ЗапуститьПриложение(ПутьКФайлу);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось запустить приложение: '" + ПутьКФайлу + "'" + " по причине:");
		КонецПопытки;
		
		COMОбъект   = Неопределено;
		COMДокумент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#Если НЕ МобильныйКлиент Тогда

// Обрабатывает и сохраняет файлы.
//
// Параметры:
//  ПомещенныеФайлы			-	Массив из Файл.
//  ДополнительныеПараметры	-	Структура.
//
Процедура ОбработкаСохраненияФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(ПомещенныеФайлы) Тогда
		Попытка
			ПутьКФайлу = ПомещенныеФайлы[0].ПолноеИмя;
			COMОбъектШаблон = Новый COMОбъект("Word.Application");       
			COMДокумент = COMОбъектШаблон.Documents.Open(ПутьКФайлу);     
 
			ЗаменитьМакросыПечати(ДополнительныеПараметры.ОбъектСсылка, COMДокумент);
			
			ЗапуститьПриложение(ПутьКФайлу);
			
			COMОбъектШаблон   = Неопределено;
			COMДокумент = Неопределено;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("Не удалось обработать файл: " + ПутьКФайлу));
		КонецПопытки;
		
	КонецЕсли;	
КонецПроцедуры

#КонецЕсли

// Заменяет макросы печати.
//
// Параметры:
//  ОбъектСсылка	-	СправочникСсылка.макрМакросы..
//  COMДокумент		-	COMОбъект.
//
Процедура ЗаменитьМакросыПечати(ОбъектСсылка, COMДокумент) Экспорт 	
	МакросыОбъекта = энргОбщегоНазначения.ПолучитьМакросыОбъекта(ОбъектСсылка);
	МассивЗакладки= Новый Массив;
	Если COMДокумент.Bookmarks.Count >= 1 Тогда   
		Для инд=1 по COMДокумент.Bookmarks.Count Цикл
			МассивЗакладки.Добавить(COMДокумент.Bookmarks(инд).Name);
		КонецЦикла;
	КонецЕсли;
	Для Каждого Стр Из МакросыОбъекта Цикл
		Если энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"ВерхнийКолонтитул") Тогда
			Замена = COMДокумент.Sections(1).Headers(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерВерхнегоКолонтитула")).Range;
		ИначеЕсли энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НижнийКолонтитул") Тогда
			Замена = COMДокумент.Sections(1).Footers(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерНижнегоКолонтитула")).Range;
		Иначе
			Замена = COMДокумент.Content;
		КонецЕсли;
		Если энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"ИскатьВТаблицах") и энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерТаблицы") <> 0 Тогда
			Замена = Замена.Tables(энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.МакросСсылка,"НомерТаблицы")).Range;
		КонецЕсли;
		Замена = Замена.Find;
		Результат = энргОбщегоНазначения.ВыполнитьМакрос(ОбъектСсылка, Стр.МакросНаименование, Стр.ИсполняемыйКод, Ложь);
		
		Если Результат = NULL Тогда Продолжить; КонецЕсли;
		
		МаксДлина = 255;proceed="§§§";
		
		Если СтрДлина(Результат)<МаксДлина Тогда
			Замена.Execute(Стр.МакросНаименование, Ложь, Истина, Ложь, , , Истина, , Ложь, Результат,2);
		Иначе
			МассивСтрок = Новый Массив; Инд=0;
			Пока СтрДлина(Результат)>МаксДлина Цикл
				РазбитаяСтрока = Лев(Результат, МаксДлина-3);
				ПоследнийСимвол = Прав(РазбитаяСтрока, 1);
				Если ПоследнийСимвол = "^" Тогда
					МассивСтрок.Добавить(Лев(Результат, МаксДлина-4));
					Результат = Сред(Результат, СтрДлина(МассивСтрок[Инд]+1));
				Иначе
					МассивСтрок.Добавить(Лев(Результат, МаксДлина-3));
					Результат = Сред(Результат, СтрДлина(МассивСтрок[Инд]+1));
				КонецЕсли;				
				Инд = Инд + 1;
			КонецЦикла;
			Если СтрДлина(Результат)>0 Тогда МассивСтрок.Добавить(Результат); КонецЕсли;
			Для Инд=0 По МассивСтрок.Количество()-2 Цикл 
				МассивСтрок[Инд]=МассивСтрок[Инд]+proceed; 
			КонецЦикла;
			Замена.Execute(Стр.МакросНаименование, Ложь, Истина, Ложь, , , Истина, , Ложь, МассивСтрок[0],2);
			Для Инд=1 По МассивСтрок.Количество()-1 Цикл
				Замена.Execute(proceed, Ложь, Истина, Ложь, , , Истина, , Ложь, МассивСтрок[Инд],2);
			КонецЦикла;
		КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяЗакладки из МассивЗакладки Цикл
		//Если СтрНайти(ИмяЗакладки,"Таблица") > 0 Тогда
		СтруктураМакроса =  энргОбщегоНазначения.ПолучитьКодМакросаПоЗакладке(ИмяЗакладки, ОбъектСсылка);
		Результат = энргОбщегоНазначения.ВыполнитьМакрос(ОбъектСсылка, ИмяЗакладки, СтруктураМакроса.ИсполняемыйКод, Истина);
		
		COMДокумент.Bookmarks(ИмяЗакладки).Select();
		
		Табл= COMДокумент.Application.Selection.Range;
		СтрокаТаблицы = "";
		Если ТипЗнч(Результат) <> Тип("Строка") Тогда
			Для каждого стр из Результат Цикл
				Для каждого КолонкаТЗ из стр Цикл
					СтрокаТаблицы = СтрокаТаблицы + КолонкаТЗ + "*";
				КонецЦикла;
				Табл.InsertAfter(Лев(СтрокаТаблицы, СтрДлина(СтрокаТаблицы) - 1));
				Табл.InsertParagraphAfter();
				СтрокаТаблицы = "";
			КонецЦикла;
		КонецЕсли;
		
		Табл.ConvertToTable("*");
		НомерФормируемойТаблицы =	COMДокумент.Range(0, Табл.Tables(1).Range.End).Tables.Count;
		COMДокумент.Tables(НомерФормируемойТаблицы).AutoFormat(16);
		
	КонецЦикла;
КонецПроцедуры

// Открывает форму команд дополнительных отчетов и обработок макросов.
//
// Параметры:
//  ПараметрКоманды				-	Массив.
//  ПараметрыВыполненияКоманды	-	Структура.
//  Вид							-	Строка.
//  ИмяРаздела					-	Строка.
//
Процедура ОткрытьФормуКомандДополнительныхОтчетовИОбработокМакросные(ПараметрКоманды, ПараметрыВыполненияКоманды, Вид, ИмяРаздела = "") Экспорт
													
	ПараметрКомандыСписок = Новый СписокЗначений;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда // назначаемая обработка
		ПараметрКомандыСписок.ЗагрузитьЗначения(ПараметрКоманды);
	КонецЕсли;
	
	Параметры = Новый Структура("ОбъектыНазначения,Вид,ИмяРаздела",
				ПараметрКомандыСписок,
				Вид,
				ИмяРаздела);
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда // назначаемая обработка
		Параметры.Вставить("ИмяФормы", ПараметрыВыполненияКоманды.Источник.ИмяФормы);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.макрДополнительныеОтчетыИОбработкиМакросные",
				Параметры,
				ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

// Возвращает каталог выгрузки.
// 
// Возвращаемое значение:
//   Строка.
//
Функция КаталогВыгрузки() Экспорт
	ДиалогВыбораФайла 	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.МножественныйВыбор 	= Ложь;
	ДиалогВыбораФайла.Заголовок 			= НСтр("ru = 'Выбор каталога выгрузки'");	
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = ДиалогВыбораФайла.Каталог;
	Возврат Результат;
КонецФункции	

// Добавдяет файл из файловой системы.
//
// Параметры:
//  ОбработчикРезультата	-	ОписаниеОповещения.
//  ВладелецФайла			-	СправочникОбъект
//  						-	ДокументОбъект
//  						-	ОбработкаОбъект
//  						-	ЗадачаОбъект.
//  ФормаВладелец			-	ФормаКлиентскогоПриложения.
//  ПутьКФайлу				-	Строка.
//
Процедура ДобавитьИзФайловойСистемы(ОбработчикРезультата = Неопределено, ВладелецФайла, ФормаВладелец, ПутьКФайлу) Экспорт 
	Если ОбработчикРезультата = Неопределено Тогда
		ОбработчикРезультата 	= Новый ОписаниеОповещения("ДобавитьИзФайловойСистемыЗавершение", энргОбщегоНазначенияКлиент);
	КонецЕсли;
	
	ПараметрыВыполнения 	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОбработчикРезультата"						, ОбработчикРезультата);
	ПараметрыВыполнения.Вставить("ВладелецФайла"							, ВладелецФайла);
	ПараметрыВыполнения.Вставить("ФормаВладелец"							, ФормаВладелец);
	ПараметрыВыполнения.Вставить("ТолькоОдинФайл"							, Истина);
	ПараметрыВыполнения.Вставить("НеОткрыватьКарточкуПослеСозданияИзФайла"	, Истина);
	
	Если РаботаСФайламиСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда
		ПараметрыВыполнения.Вставить("ПолноеИмяФайла", ПутьКФайлу);
		РаботаСФайламиСлужебныйКлиент.ДобавитьИзФайловойСистемыСРасширением(ПараметрыВыполнения);
	Иначе
		ДобавитьИзФайловойСистемыБезРасширения(ПараметрыВыполнения, ПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры

// После завершение добавление из файловой системы.
//
// Параметры:
//  Результат				-	РезультатЗапроса.
//  ДополнительныеПараметры	-	Структура.
// 
// Возвращаемое значение:
//   Произвольный.
//
Функция ДобавитьИзФайловойСистемыЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
КонецФункции

#КонецОбласти

#Область РаботаСПочтой

// Отправляет файлы по почте.
//
// Параметры:
//  МассивФайлов				-	Массив из Файл.
//  ИдентификаторФормы			-	УникальныйИдентификатор.
//  ПараметрыОтправки			-	Структура.
//  ЭтоФайл						-	Булево.
//  ОповещениеОЗакрытииФормы	-	ОписаниеОповещения.
//
Процедура ОтправитьФайлыПоПочте(МассивФайлов, ИдентификаторФормы, ПараметрыОтправки, ЭтоФайл = Ложь, ОповещениеОЗакрытииФормы) Экспорт
	
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("МассивФайлов"				, МассивФайлов);
	Параметры.Вставить("ИдентификаторФормы"			, ИдентификаторФормы);
	Параметры.Вставить("ЭтоФайл"					, ЭтоФайл);
	Параметры.Вставить("ПараметрыОтправки"			, ПараметрыОтправки);
	Параметры.Вставить("ОповещениеОЗакрытииФормы"	, ОповещениеОЗакрытииФормы);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьФайлыПоПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект, Параметры);
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

// При настройке учетной записи отправляет файлы по почте.
//
// Параметры:
//  УчетнаяЗаписьНастроена	-	Булево.
//  ДополнительныеПараметры	-	Структура.
//
Процедура ОтправитьФайлыПоПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	ОповещениеОЗакрытииФормы 	= ДополнительныеПараметры.ОповещениеОЗакрытииФормы;
	ДополнительныеПараметры.Удалить("ОповещениеОЗакрытииФормы");	
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗакрытииФормы, Истина);  
		Возврат;
	КонецЕсли;    
	
	СписокВложений 				= РаботаСФайламиСлужебныйВызовСервера.ПоместитьФайлыВоВременноеХранилище(ДополнительныеПараметры);
	ПараметрыОтправки 			= ДополнительныеПараметры.ПараметрыОтправки;
	
	ПараметрыОтправки.Вставить("Вложения", СписокВложений);
	ПараметрыОтправки.Вставить("УдалятьФайлыПослеОтправки", Истина);
	
	МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
	МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки, ОповещениеОЗакрытииФормы);
	
КонецПроцедуры

// После завершение отправляет файлы по почте.
//
// Параметры:
//  Результат				-	РезультатЗапроса.
//  ДополнительныеПараметры	-	Структура.
//
Процедура ОтправитьФайлыПоПочтеЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
КонецПроцедуры 

#КонецОбласти

#Область РаботаСФормамиПИР

// Получает формы ПИРДля отображения как строка
// 
// Возвращаемое значение:
//   Структура:
	//* ФормаДокумента	-	Строка.
	//* ФормаСписка		-	Строка.
//
Функция ПолучитьФормыПИРДляОтображенияКакСтрока() Экспорт
	Возврат энргОбщегоНазначения.ПолучитьФормыПИРДляОтображенияКакСтрока();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьИзФайловойСистемыБезРасширения(ПараметрыВыполнения, ПутьКФайлу)
	Обработчик = Новый ОписаниеОповещения("ДобавитьИзФайловойСистемыБезРасширенияПослеЗагрузкиФайла", РаботаСФайламиСлужебныйКлиент, ПараметрыВыполнения);
	НачатьПомещениеФайла(Обработчик, , ПутьКФайлу, , ПараметрыВыполнения.ФормаВладелец.УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти