#Область ОбработчикиСобытий

&НаКлиенте
Процедура Завершить(Команда)
	СоотвествиеУслуг  = Новый Соответствие;
	Для Каждого стр из ДанныеСоставныхУслуг цикл
		ДанныеСтроки  = Новый Структура("Поставщик,Плательщик,РаспределятьНаАбонентов,ПоставщикПосле",стр.Поставщик ,стр.Плательщик,стр.РаспределятьНаАбонентов,стр.ПоставщикПосле);				
		СоотвествиеУслуг.Вставить(стр.Услуга,ДанныеСтроки);
	КонецЦикла;  	
	Закрыть(Новый Структура("ДанныеИзменены,СоотвествиеУслуг",ДанныеИзменены,СоотвествиеУслуг));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 	
	
	ЕстьПлательщик									= Параметры.ЕстьПлательщик;
	ЕстьПоставщикПосле 								= Параметры.ЕстьПоставщикПосле;
	
	КолонкаФормы  									= Элементы.ДанныеСоставныхУслугПоставщикПосле;
	КолонкаФормы.Видимость 							= ЕстьПоставщикПосле;
	
	КолонкаФормы  									= Элементы.ДанныеСоставныхУслугПоставщик;
	КолонкаФормы.ТолькоПросмотр 					= ЕстьПоставщикПосле;
	
	КолонкаФормы  									= Элементы.ДанныеСоставныхУслугПлательщик;
	КолонкаФормы.Видимость 							= ЕстьПлательщик;
	
	ЕстьДанныеРаспределения 						= Параметры.ЕстьДанныеРаспределения;
	КолонкаФормы  									= Элементы.ДанныеСоставныхУслугРаспределятьНаАбонентов;
	КолонкаФормы.Видимость 							= ЕстьДанныеРаспределения;
	
	КлючСтруктуры 									= Параметры.КлючСтруктуры;
	для Каждого КлючЗначение из Параметры.СоотвествиеУслуг цикл
		СтрокаТаблицы  								= ДанныеСоставныхУслуг.Добавить();
		СтрокаТаблицы.Услуга  						= КлючЗначение.Ключ;
		СтрокаТаблицы.Поставщик  					= КлючЗначение.Значение[КлючСтруктуры["Поставщик"]];
		Если ЕстьПлательщик Тогда 
			СтрокаТаблицы.Плательщик  				= КлючЗначение.Значение[КлючСтруктуры["Плательщик"]];
		КонецЕсли;
		
		Если ЕстьПоставщикПосле Тогда 
			СтрокаТаблицы.ПоставщикПосле  			= КлючЗначение.Значение[КлючСтруктуры["ПоставщикПосле"]];
		КонецЕсли;

		Если ЕстьДанныеРаспределения   Тогда
			СтрокаТаблицы.РаспределятьНаАбонентов  	= КлючЗначение.Значение["РаспределятьНаАбонентов"];
		КонецЕсли;		
	КонецЦикла;	
	ДанныеИзменены=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСоставныхУслугПриИзменении(Элемент)
	ДанныеИзменены = истина;
КонецПроцедуры 

#КонецОбласти
