#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидыДокументов.Добавить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС);
	ВидыДокументов.Добавить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС);
	ВидыДокументов.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ);
	ВидыДокументов.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ);
	ВидыДокументов.Добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ);
	ВидыДокументов.Добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги);
	ВидыДокументов.Добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги);
	ВидыДокументов.Добавить("Приходный кассовый ордер");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидДокумента = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС");
	ПроверимВидДокументаИУстановимЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериод(Команда)
 	ОписаниеОповещенияВыборПериода = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    
    Диалог.Период.ДатаНачала    = Отчет.ДатаНач;
    Диалог.Период.ДатаОкончания = Отчет.ДатаКон;
	Диалог.Показать(ОписаниеОповещенияВыборПериода);	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт	
	Если ИнтервалУстановлен = Неопределено тогда
		Возврат;
	КонецЕсли;	
	Отчет.ДатаНач = ИнтервалУстановлен.ДатаНачала;
	Отчет.ДатаКон = ИнтервалУстановлен.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	ПроверимВидДокументаИУстановимЗначения();	
КонецПроцедуры

&НаКлиенте
Процедура ПроверимВидДокументаИУстановимЗначения()
	//Если ВидДокумента = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС") Тогда
	//	Отчет.ЗакрытиеЛС 	= Истина;	
	//	Отчет.АктВводаПУ 	= Ложь;
	//	Отчет.АктВыводаПУ	= Ложь;
	//ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ") Тогда
	//	Отчет.ЗакрытиеЛС 	= Ложь;	
	//	Отчет.АктВводаПУ 	= Истина;
	//	Отчет.АктВыводаПУ	= Ложь;		
	//иначеЕсли ВидДокумента = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ") Тогда
	//	Отчет.ЗакрытиеЛС 	= Ложь;	
	//	Отчет.АктВводаПУ 	= Ложь;
	//	Отчет.АктВыводаПУ	= Истина;		
	//КонецЕсли;
	//Отчет.ВидДокумента
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ВидыДокументов;
КонецПроцедуры

#КонецОбласти
