#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	//
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение и ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда
	//	
	//	СоотвествиеКолонок  = Новый Структура;
	//	СоотвествиеКолонок.Вставить("Наименование",	"НаименованиеТочки");
	//	СоотвествиеКолонок.Вставить("Расположение",	"Расположение");
	//	СоотвествиеКолонок.Вставить("Головная",		"Головная");
	//	
	////	энргРаботаСТочкамиУчетаСервер.ПроверитьИСоздатьТочкиУчета(ЭтотОбъект,"ТочкиУчета",СоотвествиеКолонок);
	//	
	//	
	//КонецЕсли;			  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	  //энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаФактическогоСобытия) тогда
		Момент 			= Новый Граница(Новый МоментВремени(КонецДня(ДатаФактическогоСобытия),Ссылка), ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату фактического события";
	иначе
		Момент 			= Новый Граница(МоментВремени(),ВидГраницы.Исключая);
		СтрокаОтказа 	= "На дату операции";
	КонецЕсли;	
	
	ДоговорОткрыт=бестПроверкаДанныхКонтрагентаСервер.ДоговорЗаключен(Момент,организация, район, Договор);
	
	Если Не ДоговорОткрыт Тогда
		Отказ			= Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " договор закрыт");
	КонецЕсли;
	
	МодульРаботаСТочкамиУчетаПомещенийСервер = ОбщегоНазначения.ОбщийМодуль("бестРаботаСТочкамиУчетаПомещенийСервер");
	
	ОбъектыОтлючены = МодульРаботаСТочкамиУчетаПомещенийСервер.ОбъектыДоговораОтлючены(Новый Структура("МоментВремени,
		|Район,Организация,Договор,МассивОбъектов", Момент, Район, Организация, Договор,
		ОбъектыРасчета.ВыгрузитьКолонку("ОбъектРасчета")));
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ПодключениеОбъекта И Не ОбъектыОтлючены Тогда
		Отказ			= Истина;   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " выбранные объекты уже подключены");
	КонецЕсли;
		
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта И ОбъектыОтлючены Тогда 
		Отказ			= Истина;   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + СтрокаОтказа + " выбранные объекты уже отключены");
	КонецЕсли;
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ЗаменаДоговораУОбъекта Тогда 
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Отключена, Договор);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");
		
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Включена, ДоговорНов);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестВладельцыОбъектовРасчета, "ОбъектыРасчета");
		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ПодключениеОбъекта Тогда 
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Включена, Договор);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестВладельцыОбъектовРасчета, "ОбъектыРасчета");
		
	ИначеЕсли ВидОперации = Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта Тогда 
		
		ДанныеШапки = ДанныеШапки(Перечисления.энргСостояниеТочекУчета.Отключена, Договор);	
		бестПроведениеСерверНП.ВыполнитьДвижения(ДанныеШапки, Движения.бестАктивностьОбъектовРасчета, "ОбъектыРасчета");	
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки(ТекВидОперации, ТекДоговор)
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Период",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("Район",					Район);
	ДанныеШапки.Вставить("Договор",					ТекДоговор);
	ДанныеШапки.Вставить("Состояние",				ТекВидОперации);//?(ВидОперации=Перечисления.бестВидыОпераций.ОперацияСОбъектами_ОтключениеОбъекта,  Перечисления.энргСостояниеТочекУчета.Отключена, Перечисления.энргСостояниеТочекУчета.Включена));
	ДанныеШапки.Вставить("ОбъектыРасчета",			ОбъектыРасчета);
	
	Возврат ДанныеШапки;	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли