#Если Сервер Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета; 
		
	ТабличныйДокумент 		= СформироватьДоговорMXL(МассивОбъектов,ИмяМакета);
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
						КоллекцияПечатныхФорм,
						ИмяМакета,СинонимМакета,
						ТабличныйДокумент, ,
						"Обработка.энргПечатьДоговора." + ИмяМакета);
	КонецЕсли;

КонецПроцедуры

Функция СформироватьДоговорMXL(МассивОбъектов,ИмяМакета) 
	Для Каждого Абонент из МассивОбъектов цикл
		
		СоотвествиеПараметров					= СоотвествиеПараметровСвойствам("Обработка.энргПечатьДоговора");
		
		ЗначениеДопСвойства 					= УправлениеСвойствами.ПолучитьЗначенияСвойств(Абонент.Район);
		
		Макет 									= УправлениеПечатью.МакетПечатнойФормы("Обработка.энргПечатьДоговора." +ИмяМакета);
		
		//Организация  							= ОрганизацииСлужебный.ОрганизацияПоУмолчанию();
		Организация  							= Абонент.Организация;
		
		ТабДок 									= Новый ТабличныйДокумент;
		
		ОбластиМакета = Новый Структура;
		ОбластиМакета.Вставить("Шапка");
		ОбластиМакета.Вставить("ЗаголовокСобственников");
		ОбластиМакета.Вставить("Жильцы");
		ОбластиМакета.Вставить("Собственники");
		ОбластиМакета.Вставить("ПустаяСтрока");
		ОбластиМакета.Вставить("Прочее");
		ОбластиМакета.Вставить("ДопИнфо");
		
		для Каждого КлючЗначение из ОбластиМакета  цикл
			ОбластиМакета[КлючЗначение.ключ]	= Макет.получитьОбласть(КлючЗначение.ключ);
		КонецЦикла;  	
		
		ДанныеАбонента 							= Новый Структура("АдресОбъекта");
		ДанныеФизЛица 							= Новый Структура("ДомашнийТелефон,РабочийТелефон,ЭлектроннаяПочта,ПаспортныеДанные,МестоРождения,ДатаРождения","","","",Новый Структура,"","");
		Жильцы  								= Новый Структура("ВсеЖильцы,Собственники");
		ДанныеЗаполнения 						= Новый Структура("
		|ДанныеАбонента,ДанныеФизЛица,ЗначенияПлощадей,КоличествоПрописанных,ДанныеДоговора,Жильцы",
		ДанныеАбонента,ДанныеФизЛица,Неопределено,0,Новый Структура,Жильцы);
		
		энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаАбонента(Абонент,ТекущаяДата(),ДанныеЗаполнения);
		
		Область  								= ОбластиМакета.Шапка;
		Область.Параметры.ДеньДатаДоговора 		= "«" + Формат(ДанныеЗаполнения.ДанныеДоговора.ДатаПодписания,"ДФ=дд") + "»";
		Область.Параметры.МесяцДатаДоговора 	= Формат(ДанныеЗаполнения.ДанныеДоговора.ДатаПодписания,"ДФ=ММ");
		Область.Параметры.ГодДатаДоговора 		= Формат(ДанныеЗаполнения.ДанныеДоговора.ДатаПодписания,"ДФ=гггг");
		
		Область.Параметры.НомерДоговора			= ДанныеЗаполнения.ДанныеДоговора.НомерДоговора;
		Область.Параметры.Абонент	 			= Абонент;
		
		
		Область.Параметры.Поставщик	 			= Организация.Наименование;
		
		
		
		// Паспортные данные
		Область.Параметры.Серия					= ДанныеЗаполнения.ДанныеФизЛица.ПаспортныеДанные.Серия;	
		Область.Параметры.Номер					= ДанныеЗаполнения.ДанныеФизЛица.ПаспортныеДанные.Номер;
		Область.Параметры.Выдан					= ДанныеЗаполнения.ДанныеФизЛица.ПаспортныеДанные.КемВыдан;
		Область.Параметры.Выдан					= ДанныеЗаполнения.ДанныеФизЛица.ПаспортныеДанные.КемВыдан;
		Область.Параметры.ДатаВыдачи 			= Формат(ДанныеЗаполнения.ДанныеФизЛица.ПаспортныеДанные.ДатаВыдачи,"ДФ=dd.MM.yyyy");
		Область.Параметры.ДатаРегистрации 		= Формат(ДанныеЗаполнения.ДанныеФизЛица.ПаспортныеДанные.Период,"ДФ=dd.MM.yyyy");
		
		// Данные физлица
		Область.Параметры.МестоРождения			= ДанныеЗаполнения.ДанныеФизЛица.МестоРождения;
		Область.Параметры.ДатаРождения			= Формат(ДанныеЗаполнения.ДанныеФизЛица.ДатаРождения,"ДФ=dd.MM.yyyy");
		
		Область.Параметры.Адрес					= ДанныеЗаполнения.ДанныеАбонента.АдресОбъекта; 
		Область.Параметры.КолРегистр 			= ДанныеЗаполнения.КоличествоПрописанных;
		
		// Выводим доп параметры
		для Каждого стр из СоотвествиеПараметров цикл
			СтрокаДопСвойства  					= ЗначениеДопСвойства.Найти(СоотвествиеПараметров[стр.ключ],"Свойство");
			Если СтрокаДопСвойства <> Неопределено тогда
				Если ТипЗнч(СтрокаДопСвойства.Значение) = Тип("Дата") тогда
					Область.Параметры[стр.ключ] = Формат(СтрокаДопСвойства.Значение,"ДФ=dd.MM.yyyy");
				иначе
					Область.Параметры[стр.ключ]= СтрокаДопСвойства.Значение;
				КонецЕсли; 
			иначе
				Область.Параметры[стр.ключ] 	= "";
			КонецЕсли;
		КонецЦикла; 	
		ТабДок.Вывести(Область);
		
		МассивЖильцы	 						= ДанныеЗаполнения.Жильцы.ВсеЖильцы;
		
		Область  								= ОбластиМакета.Жильцы;
		для Каждого Жилец из МассивЖильцы цикл
			Область.Параметры.ФИОЖильцов 		= Жилец;
			ТабДок.Вывести(Область);
		КонецЦикла;	
		
		ТабДок.Вывести(ОбластиМакета.ЗаголовокСобственников);  	
		//
		МассивСобственники 						= ДанныеЗаполнения.Жильцы.Собственники;
		Область  								= ОбластиМакета.Собственники;
		для Каждого Собственник из МассивСобственники цикл
			Область.Параметры.ФИОСобственников 	= Жилец;
			ТабДок.Вывести(Область);
		КонецЦикла;
		
		ТабДок.Вывести(ОбластиМакета.ПустаяСтрока);
		
		Область  								= ОбластиМакета.Прочее;
		Область.Параметры.ПлощадьКв 			= ?(ДанныеЗаполнения.ЗначенияПлощадей[Перечисления.энргВидыПлощадей.ОбщаяПлощадь]=Неопределено,0,ДанныеЗаполнения.ЗначенияПлощадей[Перечисления.энргВидыПлощадей.ОбщаяПлощадь]);
		Область.Параметры.ПлощадьПолива 		= ?(ДанныеЗаполнения.ЗначенияПлощадей[Перечисления.энргВидыПлощадей.Поливная]=Неопределено,0,ДанныеЗаполнения.ЗначенияПлощадей[Перечисления.энргВидыПлощадей.Поливная]);
		Область.Параметры.Телефон 				= ?(ДанныеЗаполнения.ДанныеФизЛица.ДомашнийТелефон = "",ДанныеЗаполнения.ДанныеФизЛица.РабочийТелефон,ДанныеЗаполнения.ДанныеФизЛица.ДомашнийТелефон);
		Область.Параметры.Почта		 			= ДанныеЗаполнения.ДанныеФизЛица.ЭлектроннаяПочта;
		Область.Параметры.Абонент		 		= Абонент;
		Область.Параметры.Поставщик				= Организация.Наименование;
		ТабДок.Вывести(Область);
		
		ТабДок.Вывести(ОбластиМакета.ДопИнфо);  
	КонецЦикла;
	Возврат ТабДок;	  	
КонецФункции

Функция СоотвествиеПараметровСвойствам(ОбъектМетаданных)
	
	Соотвествие 	= Новый Структура;
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектМетаданных",ОбъектМетаданных);
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргНастройкиПечатныхФорм.Параметр,
	|	энргНастройкиПечатныхФорм.ЗначениеПараметра
	|ИЗ
	|	РегистрСведений.энргНастройкиПечатныхФорм КАК энргНастройкиПечатныхФорм
	|ГДЕ
	|	энргНастройкиПечатныхФорм.ОбъектМетаданных = &ОбъектМетаданных";
	Результат  	= Запрос.Выполнить();
	Выборка  	= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		Соотвествие.Вставить(Выборка.Параметр,Выборка.ЗначениеПараметра);
	КонецЦикла;   
	
	Возврат Соотвествие;
КонецФункции

#КонецОбласти

#КонецЕсли