#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ГраницыОП	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация, Объект.Район, Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район)) ;
		
		Объект.ПериодНачисления	= ГраницыОП.ПериодНачисления;
		Объект.Дата				= ГраницыОП.НачалоОП;
	КонецЕсли;
	
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,,"Пени");
	
	
	ЗаполнитьДокумент=Ложь; 
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда 
		ЗаполнитьДокумент=Истина;
	КонецЕсли;
	
	Если ЗаполнитьДокумент тогда 
		ЗаполнитьПениНаСервере();
	КонецЕсли;	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		врПараметрыВТ 				= Новый Массив;
		врПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", Новый Структура("Абонент","Абонент")));
		врПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", Новый Структура("Регистратор","Регистратор")));
		врПараметры  				= Новый Структура("ПараметрыВТ", врПараметрыВТ);
		//врПараметры.Вставить("НачалоПериода",	Новый Структура("ИмяПараметра", "НачалоПериода"));
		//врПараметры.Вставить("ОкончаниеПериода",Новый Структура("ИмяПараметра", "ОкончаниеПериода"));
		
		Схема	= Неопределено;
		РегистрыНакопления.энргНачислениеПени.НаборЗаписейОбъемаНачисленийПениЗаПериод(Схема,врПараметры);	
		Запрос  									= Новый Запрос(Схема.ПолучитьТекстЗапроса());
		Запрос.УстановитьПараметр("Абонент",		Объект.Абонент);
		Запрос.УстановитьПараметр("Регистратор",	Объект.Ссылка);
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Свернуть("","Сумма");
		Если Результат.Количество() > 0 Тогда	
			ФактическаяСумма	= Результат[0].Сумма;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.МКД 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
	
	ЗаполнитьПениНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли; 
	
	ЗаполнитьПениНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.МКД) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.МКД 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	Объект.Абонент = энргПользовательскийВводСервер.ПрочитатьАбонентаПомещения(Объект.КлючПомещения,Объект.Район,Объект.Организация,Объект.Дата);
	ЗаполнитьПениНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	Объект.Абонент = энргПользовательскийВводСервер.ПрочитатьАбонентаПомещения(Объект.КлючПомещения,Объект.Район,Объект.Организация,Объект.Дата);
	ЗаполнитьПениНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	
	ГраницыОП	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация, Объект.Район, Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район)) ;

	Объект.ПериодНачисления	= ГраницыОП.ПериодНачисления;
	Объект.Дата				= ГраницыОП.НачалоОП;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПениНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	энргНачислениеПени.Услуга КАК Услуга,
	//	|	энргНачислениеПени.Поставщик КАК Поставщик,
	//	|	энргНачислениеПени.ПериодРасчета КАК ПериодРасчета,
	//	|	энргНачислениеПени.ПериодНачисления КАК ПериодНачисления,
	//	|	энргНачислениеПени.Сумма КАК Сумма
	//	|ИЗ
	//	|	РегистрНакопления.энргНачислениеПени КАК энргНачислениеПени
	//	|ГДЕ
	//	|	энргНачислениеПени.Организация = &Организация
	//	|	И энргНачислениеПени.Район = &Район
	//	|	И энргНачислениеПени.Абонент = &Абонент
	//	|	И энргНачислениеПени.МКД = &МКД";
	////Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
	////	Запрос.УстановитьПараметр("Период", Объект.ДатаФактическогоСобытия);
	////Иначе
	////	Запрос.УстановитьПараметр("Период", Объект.Дата);
	////КонецЕсли;
	//Запрос.УстановитьПараметр("Период", Объект.Дата);
	//Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	//Запрос.УстановитьПараметр("МКД", Объект.МКД);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("Район", Объект.Район);
	//
	//Результат = Запрос.Выполнить();
	//
	//Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Объект.Пени.Очистить();
	//Пока Выборка.Следующий() Цикл
	//	СтрокаТЧПени = Объект.Пени.Добавить();
	//	СтрокаТЧПени.IDСтроки = Новый УникальныйИдентификатор;
	//	ЗаполнитьЗначенияСвойств(СтрокаТЧПени, Выборка);
	//КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПениУслугаПриИзменении(Элемент)
	
	ТекущиеДанные 							= Элементы.Пени.ТекущиеДанные;
	//ЗаполнитьНаименование(ТекущиеДанные);  			
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
	// энргРаботаСПоставщиками }
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьТЧ(Команда)
	Если ЗначениеЗаполнено(ПериодНачисления.ДатаНачала) И ЗначениеЗаполнено(ПериодНачисления.ДатаОкончания) Тогда 
		ДополнитьТЧНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьТЧНаСервере()
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	Результат = ОбъектЗначение.УслугиПоПериодам(ПериодНачисления, Услуги, ОбъектЗначение.Пени.Выгрузить());
	
	ТЧ = Результат.Выгрузить();
	ОбъектЗначение.Пени.Загрузить(ТЧ);
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиУслугамиАбонентаНаСервере()
	Результат = Обработки.энргСостояниеТочекУчетаМенеджер.УслугиДействующихТочек(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, Неопределено,Новый Структура("ТолькоОткрытыеЛС", Истина)); 
	ТЗ = Результат.Выгрузить();
	ТЗ.Свернуть("Услуга");
	Услуги.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("Услуга"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиУслугамиАбонента(Команда)
	ЗаполнитьВсемиУслугамиАбонентаНаСервере();
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
