#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет показания действующих приборов учета помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПоказанияДействующихПриборовУчетаПомещения(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;

	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПоказанияДействующихПриборовУчетаПомещения());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 				= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, КлючПомещения, ПриборУчета, Шкала, ТарифнаяЗона, Разделитель";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет схему история показаний помещения.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуИсторияПоказанийПомещения(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;

	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуИсторияПоказанийПомещения());
	   
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Период,Регистратор,Организация,Район,КлючПомещения,Строение,Помещение,ПриборУчета,Шкала,ТарифнаяЗона,ПериодНачисления";
		ОтборТаблицы 						= Пакет.Операторы[0].Отбор;
		ИмяТаблицыВЗапросе 					= "ПоказанияПриборовУчета";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОтборТаблицы,ИмяТаблицыВЗапросе,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет схему история показаний помещения с учетом корректировки.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуИсторияПоказанийПомещенияСУчетомКорректировки(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;

	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуИсторияПоказанийПомещения());
	Пакет.ТаблицаДляПомещения 		= "ПоказанияПриборовУчетаДоКорректировки";
   
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Период,Регистратор,Организация,Район,КлючПомещения,Строение,Помещение,ПриборУчета,Шкала,ТарифнаяЗона,ПериодНачисления";
		ОтборТаблицы 						= Пакет.Операторы[0].Отбор;
		ИмяТаблицыВЗапросе 					= "ПоказанияПриборовУчета";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОтборТаблицы,ИмяТаблицыВЗапросе,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	РегистрыСведений.энргКорректировкаПоказаний.СкорректированныеПоказания(Схема,ПараметрыОтбора,"ПоказанияПриборовУчетаКорректировка");
	
	Пакет 									= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСкорректированныхПоказаний());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПоказанияДействующихПриборовУчетаПомещения()
	
	Текст  =
		"ВЫБРАТЬ
		|	энргПоказанияПриборовУчетаСрезПоследних.Организация КАК Организация,
		|	энргПоказанияПриборовУчетаСрезПоследних.Район КАК Район,
		|	энргПоказанияПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	энргПоказанияПриборовУчетаСрезПоследних.Шкала КАК Шкала,
		|	энргПоказанияПриборовУчетаСрезПоследних.ТарифнаяЗона КАК ТарифнаяЗона,
		|	энргПоказанияПриборовУчетаСрезПоследних.Разделитель КАК Разделитель,
		|	энргПоказанияПриборовУчетаСрезПоследних.Показание КАК Показание,
		|	энргПоказанияПриборовУчетаСрезПоследних.СостояниеПоказаний КАК СостояниеПоказаний,
		|	энргПоказанияПриборовУчетаСрезПоследних.КС КАК КС,
		|	энргПоказанияПриборовУчетаСрезПоследних.ИсточникПоказаний КАК ИсточникПоказаний,
		|	энргПоказанияПриборовУчетаСрезПоследних.ПричинаОтклонения КАК ПричинаОтклонения
		|ИЗ
		|	РегистрСведений.энргПоказанияПриборовУчета.СрезПоследних КАК энргПоказанияПриборовУчетаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьСхемуИсторияПоказанийПомещения()
	Текст 	=
	"ВЫБРАТЬ
	|	ПоказанияПриборовУчета.КлючПомещения КАК КлючПомещения,
	|	ПоказанияПриборовУчета.Период КАК ДатаПоказаний,
	|	ПоказанияПриборовУчета.Регистратор КАК РегистраторПоказаний,
	|	ПоказанияПриборовУчета.Разделитель КАК Разделитель,
	|	ПоказанияПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	ПоказанияПриборовУчета.Шкала КАК Шкала,
	|	ПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ПоказанияПриборовУчета.Показание КАК Показание,
	|	ПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ПоказанияПриборовУчета.КС КАК КС,
	|	ПоказанияПриборовУчета.Переворот КАК Переворот,
	|	ПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета КАК ПоказанияПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ПоказанияПриборовУчета.КлючПомещения = энргКлючиПомещений.КлючПомещения";
	Возврат Текст;
КонецФункции

Функция ТекстЗапросаСкорректированныхПоказаний()
	Текст =
	"ВЫБРАТЬ
	|	ПоказанияПриборовУчетаДоКорректировки.КлючПомещения КАК КлючПомещения,
	|	ПоказанияПриборовУчетаДоКорректировки.ДатаПоказаний КАК ДатаПоказаний,
	|	ПоказанияПриборовУчетаДоКорректировки.РегистраторПоказаний КАК РегистраторПоказаний,
	|	ПоказанияПриборовУчетаДоКорректировки.Разделитель КАК Разделитель,
	|	ПоказанияПриборовУчетаДоКорректировки.ПериодНачисления КАК ПериодНачисления,
	|	ПоказанияПриборовУчетаДоКорректировки.ПриборУчета КАК ПриборУчета,
	|	ПоказанияПриборовУчетаДоКорректировки.Шкала КАК Шкала,
	|	ПоказанияПриборовУчетаДоКорректировки.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ЕСТЬNULL(ПоказанияПриборовУчетаКорректировка.ПоказанияПосле, ПоказанияПриборовУчетаДоКорректировки.Показание) КАК Показание,
	|	ПоказанияПриборовУчетаДоКорректировки.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ПоказанияПриборовУчетаДоКорректировки.КС КАК КС,
	|	ПоказанияПриборовУчетаДоКорректировки.Переворот КАК Переворот,
	|	ПоказанияПриборовУчетаДоКорректировки.ТочкаУчета КАК ТочкаУчета,
	|	ПоказанияПриборовУчетаДоКорректировки.Строение КАК Строение,
	|	ПоказанияПриборовУчетаДоКорректировки.Помещение КАК Помещение,
	|	ПоказанияПриборовУчетаДоКорректировки.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	ПоказанияПриборовУчетаДоКорректировки КАК ПоказанияПриборовУчетаДоКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоказанияПриборовУчетаКорректировка КАК ПоказанияПриборовУчетаКорректировка
	|		ПО ПоказанияПриборовУчетаДоКорректировки.ПриборУчета = ПоказанияПриборовУчетаКорректировка.ПриборУчета
	|			И ПоказанияПриборовУчетаДоКорректировки.Шкала = ПоказанияПриборовУчетаКорректировка.Шкала
	|			И ПоказанияПриборовУчетаДоКорректировки.ТарифнаяЗона = ПоказанияПриборовУчетаКорректировка.ТарифнаяЗона
	|			И ПоказанияПриборовУчетаДоКорректировки.Разделитель = ПоказанияПриборовУчетаКорректировка.Разделитель
	|			И ПоказанияПриборовУчетаДоКорректировки.РегистраторПоказаний = ПоказанияПриборовУчетаКорректировка.ДокРегистратор
	|			И ПоказанияПриборовУчетаДоКорректировки.ПериодНачисления = ПоказанияПриборовУчетаКорректировка.ПериодНачисления
	|			И ПоказанияПриборовУчетаДоКорректировки.Показание = ПоказанияПриборовУчетаКорректировка.ПоказанияДо
	|			И ПоказанияПриборовУчетаДоКорректировки.КлючПомещения = ПоказанияПриборовУчетаКорректировка.КлючПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоказанияПриборовУчетаКорректировка КАК ПоказанияПриборовУчетаКорректировкаОтПерерасчета
	|		ПО ПоказанияПриборовУчетаДоКорректировки.ПриборУчета = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.ПриборУчета
	|			И ПоказанияПриборовУчетаДоКорректировки.Шкала = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.Шкала
	|			И ПоказанияПриборовУчетаДоКорректировки.ТарифнаяЗона = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.ТарифнаяЗона
	|			И ПоказанияПриборовУчетаДоКорректировки.Разделитель = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.Разделитель
	|			И ПоказанияПриборовУчетаДоКорректировки.РегистраторПоказаний = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.Регистратор
	|			И ПоказанияПриборовУчетаДоКорректировки.ПериодНачисления = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.ПериодНачисления
	|			И ПоказанияПриборовУчетаДоКорректировки.Показание = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.ПоказанияПосле
	|			И ПоказанияПриборовУчетаДоКорректировки.КлючПомещения = ПоказанияПриборовУчетаКорректировкаОтПерерасчета.КлючПомещения
	|ГДЕ
	|	ПоказанияПриборовУчетаКорректировкаОтПерерасчета.ПриборУчета ЕСТЬ NULL";
	
	Возврат Текст;
	

КонецФункции

#КонецОбласти

#КонецЕсли