#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса = Новый Структура;
	Схема = Неопределено;
	
	ДобавитьТекстЗапросаЗапретРедактированияДоговора(Схема, Регистры);
	
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", ДокументСсылка);
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаЗапретРедактированияДоговора(Схема, Регистры)
	
	ИмяРегистра = "бестНастройкиЗапретаРедактированияДоговоровКонтрагентов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	бестЗапретРедактированияДоговораКонтрагента.Дата КАК Период,
	|	бестЗапретРедактированияДоговораКонтрагента.Организация КАК Организация,
	|	бестЗапретРедактированияДоговораКонтрагента.Статус КАК Статус,
	|	бестЗапретРедактированияДоговораКонтрагентаСотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.бестЗапретРедактированияДоговораКонтрагента КАК бестЗапретРедактированияДоговораКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестЗапретРедактированияДоговораКонтрагента.Сотрудники КАК бестЗапретРедактированияДоговораКонтрагентаСотрудники
	|		ПО (бестЗапретРедактированияДоговораКонтрагентаСотрудники.Ссылка = бестЗапретРедактированияДоговораКонтрагента.Ссылка)
	|ГДЕ
	|	бестЗапретРедактированияДоговораКонтрагента.Ссылка В(&мДокументы)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли