#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//энргОбщегоНазначения.УстановитьСписокРайонов(Объект.Район,Элементы.Район); 
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			энргРаботаСЛицевымСчетомСервер.ПрочитатьДанныеПомещения(ЭтотОбъект, ДанныеПомещенияРезультат);			
		КонецЕсли;		
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если не ЗначениеЗаполнено(Объект.ОкончаниеПотребления) Тогда
		Объект.ОкончаниеПотребления = ?(Не ЗначениеЗаполнено(Объект.Дата), ТекущаяДата(), Объект.Дата);
		ОпределитьНачалоПериода();
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьДокумент") Тогда 
		Параметры.ЗначенияЗаполнения.Свойство("ТочкаУчета", ТочкаУчетаОтбор);
		ЗаполнитьАктивнымиУслугами();		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//энргРаботаСЛицевымСчетомСервер.ПрочитатьДанныеПомещения(ЭтотОбъект,ТекущийОбъект);
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
	энргРаботаСЛицевымСчетомСервер.ПрочитатьДанныеПомещения(ЭтотОбъект, ДанныеПомещенияРезультат);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисления();
	КонецЕсли;
	
	Объект.ОкончаниеПотребления = Объект.Дата;
	ОпределитьНачалоПериода();
	ЗаполнитьАктивнымиУслугами();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисления() 
	
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.Организация		= Неопределено;
		Объект.Район			= Неопределено;
		Объект.КлючПомещения	= Неопределено;
		Помещение 				= Неопределено;
		Строение 				= Неопределено;
	КонецЕсли;
	
	ОпределитьНачалоПериода();
	ЗаполнитьАктивнымиУслугами();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПотребленияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ОкончаниеПотребления) И Объект.ОкончаниеПотребления < Объект.НачалоПотребления Тогда
		Объект.НачалоПотребления = Неопределено;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПотребленияПриИзменении(Элемент)
	Если Объект.ОкончаниеПотребления < Объект.НачалоПотребления Тогда
		Объект.ОкончаниеПотребления = Неопределено;
	иначе 
		ОпределитьНачалоПериода();
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТЧ", "Услуги");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	
	ПроверкаУдаленияСтроки(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда	
			Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьАктивнымиУслугами()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");   
	ДокументОбъект.ЗаполнитьАктивнымиУслугами(ТочкаУчетаОтбор);     
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОпределитьНачалоПериода()
	Если не ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
		Объект.НачалоПотребления = ДобавитьМесяц(Объект.ОкончаниеПотребления, -3);
		
	иначе 
		Объект.НачалоПотребления = Документы.энргАктНесанкционированногоПодключенияВмешательства.ОпределитьНачалоПериода(Объект.ОкончаниеПотребления, Объект.Организация, Объект.Район, Объект.КлючПомещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Документы.энргАктНесанкционированногоПодключенияВмешательства.РассчитатьОбъемНачислений(Объект, Объект.Движения.энргОбъемНачислений);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	ЭтоПодключение = Объект.ВидОперации = Перечисления.энргВидыОпераций.энргАктНесанкционированногоПодключенияВмешательства_Подключение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МощностьПодключаемогоОборудования", "Видимость", ЭтоПодключение);
КонецПроцедуры

#Область РаботаСПечатнойФормой

&НаКлиенте
Процедура Печать(Команда)
	ТабДок 	= Неопределено;
	Макет 	= СформироватьНаСервере(ТабДок);
	ТабДок.Показать(Макет); 
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(ТабДок)
	ТабДок 	= Документы.энргАктНесанкционированногоПодключенияВмешательства.СформироватьТабДок(Объект, Элементы);
	Возврат ТабДок;
КонецФункции

#КонецОбласти

#КонецОбласти
