
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОписаниеОшибки") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.ОписаниеОшибки);
		ЗаписьТекста  		= Новый ЗаписьТекста;
		Для Сч = 0 По Параметры.ОписаниеОшибки.Ошибки.ВГраница() Цикл
			 ТекстСообщения = ТекстСообщения + ?(Сч > 0, Символы.ПС,"") + Параметры.ОписаниеОшибки.Ошибки[Сч].Текст;
		 КонецЦикла;		
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяОперации") Тогда
		ВыполняемаяОперация = Параметры.ИмяОперации; 
	КонецЕсли;
	
КонецПроцедуры
