&НаКлиенте
Процедура ДокументСистемыОтборОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ДокументСистемыОтборТип = Неопределено;
	
	ЗаполнитьПрисоединенныеФайлы();
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект);
	
	ФункциональнаяОпцияЕсть 			= энргОбщегоНазначения.ЗначениеФункциональнойОпции("энргИспользоватьНаправленияИспользованияТУ");
	ИмяРеквизитаВТЧТочекУчета 			= "ТочкиУчета" + ПрефиксТочекУчета + "НаправлениеИспользованияТУ";	
    УстановитьОперации();
	
	//Элементы[ИмяРеквизитаВТЧТочекУчета].Видимость 			= ФункциональнаяОпцияЕсть;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СуммаКОплате.Заголовок = "Задолженность, с учетом тек. периода";
	Элементы.СуммаКОплатеПени.Заголовок = "в том числе пени";
	КолвоМесяцевДоПоверки			= 2;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыАбонента,"Абонент",ТекАбонент);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЖильцыЛьготныхКатегорий,"Абонент",ТекАбонент);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЖильцыЛьготныхКатегорий,"Период",ТекущаяДата());	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЛицевойСчет",
		"Видимость",
		Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"АдресОбъекта",
		"Видимость",
		Ложь);	
	
	УстановитьВидимостьДанныхТочекУчета(Ложь);
	
	#Если ВебКлиент Тогда
		Элементы.СтрокаПоискаАбонента.Видимость = Ложь;
		Элементы.НайтиАбонентаПоСтрокеПоиска.Видимость = Ложь;
	#Иначе
		Элементы.НайтиАбонентаПоСтрокеПоискаГиперссылка.Видимость = Ложь;
	#КонецЕсли
	
КонецПроцедуры   

&НаКлиенте
Процедура СтраницыСведенияОбАбонентеПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницыСведенияОбАбоненте.ПодчиненныеЭлементы.СтраницаКарточкаАбонента тогда
		Если ТекАбонент <> АбонентКарточка тогда			
			ПериодФормированияКонец 					= КонецМесяца(ТекущаяДата()) + 1;
			ПериодФормированияНачало  					= ДобавитьМесяц(ПериодФормированияКонец, -4);
			
			ПериодФормированияКарточки.ДатаНачала 		= ПериодФормированияНачало;
			ПериодФормированияКарточки.ДатаОкончания 	= ПериодФормированияКонец;
			
			ОбновитьКарточкуКлиент(ПериодФормированияНачало,ПериодФормированияКонец);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницыСведенияОбАбоненте.ПодчиненныеЭлементы.СтраницаПриборыСИстекающимСрокомПоверки 
		И ПриборыСИстекающимСрокомПоверки.Количество() = 0 тогда
		
		ОбновитьПриборыСИстекающимСрокомПоверкиНаСервере();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницыСведенияОбАбоненте.ПодчиненныеЭлементы.СтраницаПрикрепленныеФайлы Тогда
		ЗаполнитьПрисоединенныеФайлы();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницыСведенияОбАбоненте.ПодчиненныеЭлементы.СтраницаИсторияОплаты Тогда
		ОбновитьТаблицуИсторииОплат();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПрописанныхНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"энргКоличествоПрописанных",СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПроживающихНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"энргКоличествоПроживающих",СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСобственниковНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"энргКоличествоСобственников",СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЛСНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"энргСостояниеЛС",СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура КонтроллерНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"",СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"",СтандартнаяОбработка);
КонецПроцедуры  

&НаКлиенте
Процедура ДатаСостоянияЛСНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"энргСостояниеЛС",СтандартнаяОбработка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКомнатНажатие(Элемент, СтандартнаяОбработка)
	ОбработкаОткрытияСсылки(Элемент,"энргКоличествоКомнат",СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаАбонентаПриИзменении(Элемент)
	НайтиАбонентаПоСтрокеПоиска();
КонецПроцедуры

&НаКлиенте
Процедура ТекТочкаУчетаПриИзменении(Элемент)
	Префикс		= "_РекПУ_";
	ИменаГрупп	= Новый Структура("ГруппаИнфТУ_, ГруппаИнфПУ_, ГруппаПоказания_");
	
	ПрефиксБлага				= "_РекВидБлага_";
	ИменаГруппБлага				= Новый Структура("ГруппаВидБлагаПоУслуге_");
	мКодыУслуг					= Новый Массив;
	
	мПриборыУчета 				= ДанныеПоПрибору();
	ПолучаемыеРеквизитыПрибора 	= "РегистрируетОбъем";
	ЗначенияРеквизитовПриборов 	= ЗначенияРеквизитовПриборовСервер(мПриборыУчета, ПолучаемыеРеквизитыПрибора);
	
	Для каждого ТекСтрока Из ТочкиУчета Цикл
		
		Ид = Формат(ТекСтрока.ПолучитьИдентификатор(), "ЧН=0; ЧГ=0");
		Видимость = ТекСтрока.ТочкаУчета = ТекТочкаУчета;
		
		Для каждого ИмяГруппы Из ИменаГрупп Цикл
			ТекГруппа = Элементы.Найти(Префикс + ИмяГруппы.Ключ + Ид);
			Если ТекГруппа <> Неопределено Тогда
				ТекГруппа.Видимость = Видимость;
			КонецЕсли;
		КонецЦикла;
		
		Если Видимость Тогда			
			мКодыУслуг = ПолучитьМассивКодовСоставляющихУслуги(ТекСтрока.Услуга);
			Если НЕ ЗначенияРеквизитовПриборов[ТекСтрока.ПриборУчета] = Неопределено Тогда
				ТекПриборУчетаОбъем = ЗначенияРеквизитовПриборов[ТекСтрока.ПриборУчета]["РегистрируетОбъем"];
			КонецЕсли;			
		КонецЕсли;				
	КонецЦикла;
	
	Для Каждого СтрокаБлага ИЗ ВидыБлагоустройстваТарифныеКатегории Цикл
		
		Видимость = мКодыУслуг.Найти(СтрокаБлага.КодУслуги) <> Неопределено;
		
		Для каждого ИмяГруппы Из ИменаГруппБлага Цикл
			ТекГруппа = Элементы.Найти(ПрефиксБлага + ИмяГруппы.Ключ + СтрокаБлага.КодУслуги);
			Если ТекГруппа <> Неопределено Тогда
				ТекГруппа.Видимость = Видимость;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИмяРеквизитаПоказания) И Элементы.Найти(ИмяРеквизитаПоказания)<> Неопределено Тогда
		Если ТекПриборУчетаОбъем Тогда
			Элементы[ИмяРеквизитаПоказания].Заголовок = "Объем";
		Иначе
			Элементы[ИмяРеквизитаПоказания].Заголовок = "Показания";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СокращенныйПриИзменении(Элемент)
	
	Видимость = НЕ Сокращенный;
	
	Элементы.ПриборыСИстекающимСрокомПоверкиГруппа3.Видимость = Видимость;
	Элементы.ПриборыСИстекающимСрокомПоверкиТарифнаяЗона.Видимость = Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДанныеКоманда(Команда)
	ЗаполнитьОбщиеДанныеАбонента();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДанныеЛС(Команда)
	
	Видимость = НЕ Элементы.ГруппаДанныеАбонента.Видимость;
	УстановитьВидимостьДанныхТочекУчета(Видимость);
	//Если Команда = Неопределено Тогда
	//	Элементы.СкрытьДанныеЛС.Видимость = не Элементы.ГруппаДанныеАбонента.Видимость;
	//КонецЕсли;
	//
	//Элементы.СкрытьДанныеЛС.Заголовок 			= ?(Элементы.ГруппаДанныеАбонента.Видимость,"Показать","Скрыть") + " данные абонента";
	//Элементы.ГруппаДанныеАбонента.Видимость 	= не Элементы.ГруппаДанныеАбонента.Видимость;
	//
	//Если Элементы.ГруппаДанныеАбонента.Видимость Тогда 
	//	ЗаполнитьДанныеТочек();		
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЗначенияПлощадей(Команда)
	Элементы.СкрытьЗначенияПлощадей.Заголовок 	= ?(Элементы.ЗначенияПлощадей.Видимость,"Показать","Скрыть")  + " значения площадей";
	Элементы.ИзменитьПлощадь.Видимость 			= не Элементы.ЗначенияПлощадей.Видимость;
	Элементы.ЗначенияПлощадей.Видимость 		= не Элементы.ЗначенияПлощадей.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьТарифныеГруппы(Команда)
	Элементы.СкрытьТарифныеГруппы.Заголовок 				= ?(Элементы.ВидыБлагоустройстваТарифныеКатегории.Видимость,"Показать","Скрыть")  + " виды благоустройства, тарифные категории";
	Элементы.ВыполнитьОперациюСЛС.Видимость					= не Элементы.ВидыБлагоустройстваТарифныеКатегории.Видимость;
	Элементы.ВидыБлагоустройстваТарифныеКатегории.Видимость = не Элементы.ВидыБлагоустройстваТарифныеКатегории.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДанныеЗадолженности(Команда)
	Элементы.СкрытьДанныеЗадолженности.Заголовок = ?(Элементы.Задолженность.Видимость,"Показать","Скрыть") + " данные по задолженности за предыдущие периоды";
	Элементы.Задолженность.Видимость = не Элементы.Задолженность.Видимость;	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДанныеТочекУчета(Команда)
	ТаблицаФормы 															= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	Элементы.СкрытьДанныеТочекУчета.Заголовок 								= ?(ТаблицаФормы.Видимость,"Показать","Скрыть") + " данные точек учета";
	Видимость 																= не ТаблицаФормы.Видимость;
	ТаблицаФормы.Видимость 													= Видимость;
	
	// TODO FIX ME
	// Измнить название группы если к ней происходить обращение
	Элементы.ГруппаОбщаяИнформацияЛеваяСторона.Видимость = Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюСЛС(Команда) 	
	СписокоОпераций  = СписокОперацийСЛС();
	ВыбратьОперациюИзСписка(СписокоОпераций,Элементы.ВыполнитьОперациюСЛС);	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюСТочкамиУчета(Команда)
	СписокоОпераций  = СписокОперацийСТочкамиУчета();
	ВыбратьОперациюИзСписка(СписокоОпераций,Элементы.ВыполнитьОперациюСТочкамиУчета);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовыйЛС(Команда)
	ОткрытьФормуНовогоДокумента("энргОперацияСЛицевымСчетом","энргОперацияСЛС_ОткрытиеЛС",Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарточку(Команда)
	ОбновитьКарточкуКлиент(ПериодФормированияКарточки.ДатаНачала,КонецДня(ПериодФормированияКарточки.ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияПоказаний(Команда)
	ВыбратьОперациюИзСпискаЗавершение(Новый Структура("Значение", "энргРегистрацияПоказанийАбонента__энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента"),Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриходныйКассовыйОрдер(Команда)
	ВыбратьОперациюИзСпискаЗавершение(Новый Структура("Значение", "энргПриходныйКассовыйОрдер"),Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАбонента(Команда)
	Если ЗначениеЗаполнено(ТекАбонент) Тогда
		ПоказатьЗначение(,ТекАбонент);
	Иначе
		НайтиАбонентаПоСтрокеПоиска();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоКомнат(Команда)
	ОткрытьФормуНовогоДокумента("энргУстановитьКоличествоКомнат", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоПрописанных(Команда)
	ОткрытьФормуНовогоДокумента("энргУстановитьКоличествоПрописанных", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоПроживающих(Команда)
	ОткрытьФормуНовогоДокумента("энргУстановитьКоличествоПроживающих", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоСобственников(Команда)
	ОткрытьФормуНовогоДокумента("энргУстановитьКоличествоСобственников", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПлощадь(Команда)
	ДопЗначЗапол = Новый Структура;
	
	ВидыПлощадей = Новый Массив;
	Для каждого СтрокаТЗ Из ЗначенияПлощадей Цикл
		ВидыПлощадей.Добавить(СтрокаТЗ.ВидПлощади);
	КонецЦикла;
	ДопЗначЗапол.Вставить("ВидыПлощадей", ВидыПлощадей);
	
	ОткрытьФормуНовогоДокумента("энргУстановитьЗначениеПлощади", Неопределено,, ДопЗначЗапол);
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПараметровМКД(Команда)
	ОткрытьФорму("Обработка.бестМассовоеИзменениеПараметровМКД.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеРеквизитовЛС(Команда)
	ОткрытьФорму("Обработка.бестМассовоеИзменениеРеквизитовЛС.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура МассовыйВводЛС(Команда)
	ОткрытьФорму("Обработка.бестМассовыйВводЛицевыхСчетов.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадолженностьНаДату(Команда)
	ДанныхОперативнойзадолженностиНаДату(ТекАбонент,ДанныеЗадолженностиНа);	
КонецПроцедуры

&НаКлиенте
Процедура НайтиАбонентаПоСтрокеПоиска(Команда = Неопределено)
	ПараметрыФормы = Новый Структура("СтрокаНачальногоПоиска,ТекущаяСтрока", СтрокаПоискаАбонента, ТекАбонент);
	ТекущийАбонент = Неопределено;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораАбонентаНаКлиенте", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.энргАбоненты.Форма.ФормаВыбораСАдресом", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНаправленияИспользованияТУ(Команда)
	ПарамФормы = Новый Структура("Организация, Район, КлючПомещения, ТочкаУчета", ТекОрганизация, текРайон, ТекКлючПомещения, ТекТочкаУчета);
	ОткрытьФорму("ОбщаяФорма.энргФормаНаправленияИспользованияТУ", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормулыРасчетаТочекУчета(Команда)
	СписокТУ = Новый СписокЗначений;
	//Для каждого ТекСтрока Из ТочкиУчета Цикл
	//	Если ТекСтрока.РасчетПоФормуле Тогда
	//		СписокТУ.Добавить(ТекСтрока.ТочкаУчета);
	//	КонецЕсли;
	//КонецЦикла;
	
	ПарамФормы = Новый Структура("Организация, Район, КлючПомещения, ТочкаУчета, СписокТУ_ПоФормуле", ТекОрганизация, текРайон, ТекКлючПомещения, ТекТочкаУчета, СписокТУ);
	ОткрытьФорму("ОбщаяФорма.энргФормаФормулРасчетаТочекУчета", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуПоверки(Команда)
	ДопЗначЗапол = Новый Структура("ТочкаУчета", ТекТочкаУчета);
	ОткрытьФормуНовогоДокумента("энргУстановитьДатуПоверкиПУ", "энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод",,ДопЗначЗапол);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюПоказанийПриборовУчета(Команда)
	//Префикс	= "_РекПУ_";
	//
	//СтрокиТУ = ТочкиУчета.НайтиСтроки(Новый Структура("ТочкаУчета", ТекТочкаУчета));
	//Если ЗначениеЗаполнено(СтрокиТУ) Тогда
	//	СтрокаТУ = СтрокиТУ[0];
	//Иначе	
	//	Возврат;
	//КонецЕсли;
	//
	//Ид	= Формат(СтрокаТУ.ПолучитьИдентификатор(), "ЧН=0; ЧГ=0");
	//ИдПоказаний = СтрЗаменить(ТекущийЭлемент.Имя, Префикс + "КомандаПоказатьИсториюПоказанийПриборовУчета_" + Ид + "_", "");
	//ИдПоказаний = Число(ИдПоказаний);  
	//СтрокаПоказ = ПоказанияПриборовУчета.НайтиПоИдентификатору(ИдПоказаний);
	//
	//Если СтрокаПоказ = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СтрокиШкалы = ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаПоказ.IDСтроки));
	//Если ЗначениеЗаполнено(СтрокиШкалы) Тогда
	//	СтрокаШкалы = СтрокиШкалы[0];
	//Иначе
	//	Возврат;
	//КонецЕсли;

	ПарамФормы = Новый Структура("Организация, Район, КлючПомещения, ПриборУчета, Шкала, ТарифнаяЗона", ТекОрганизация, текРайон, ТекКлючПомещения, ТекПриборУчета);
	ОткрытьФорму("ОбщаяФорма.энргФормаИсторияПоказаний", ПарамФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказанияПриборовУчета(Команда)
	ИмяЭлем 			= СтрЗаменить(ТекущийЭлемент.Имя, "_Изменить", "");
	ПарамФормы 			= Новый Структура("Элемент", Элементы[ИмяЭлем]);
	ПараметрыФормы 		= Новый Структура("ТекПриборУчетаОбъем", ТекПриборУчетаОбъем);
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ВводНовогоПоказанияПУ", ЭтотОбъект, ПарамФормы);
	ОткрытьФорму("Документ.энргРегистрацияПоказанийАбонента.Форма.ФормаБыстрогоВводаПоказаний",ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументЖурнала(Команда)
	
	СписокЗначений  = СписокОперацийЖурналаДокументовАбонента();
	ВыбратьОперациюИзСписка(СписокЗначений,Элементы.ДокументыАбонента)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПриборыСИстекающимСрокомПоверки(Команда)
	ОбновитьПриборыСИстекающимСрокомПоверкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Начисление(Команда)
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВыполнятьВФоне"	, Ложь);
	ПараметрыЗаполнения.Вставить("Организация"		, ТекОрганизация);
	ПараметрыЗаполнения.Вставить("Район"			, текРайон);
	
	СтруктураВозврат = ПолучитьСтроение();
	ПараметрыЗаполнения.Вставить("ОтборПоДому"	, СтруктураВозврат.ОтборПоДому);
	ПараметрыЗаполнения.Вставить("Дом"			, СтруктураВозврат.Дом);
	ОткрытьФорму("ОбщаяФорма.энргВыполнениеНачислений",Новый Структура("ПараметрыЗаполнения",ПараметрыЗаполнения),,Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацииСПриборамиУчета(Команда)
	СписокоОпераций  = СписокОперацийСПриборамУчета();
	КнопкаКоманды = Элементы.Найти("ВыполнитьОперацииСПриборамиУчета");
	ВыбратьОперациюИзСписка(СписокоОпераций,КнопкаКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОплат(Команда)
	
	ЗначениеОтбора 	= Новый Структура ("Абонент",ТекАбонент);
	ПараметрыОтбора = Новый Структура ("Отбор", ЗначениеОтбора);
	ОткрытьФорму("Документ.энргПриходныйКассовыйОрдер.ФормаСписка",ПараметрыОтбора,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыДокументыАбонента

&НаКлиенте
Процедура ДокументыАбонентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДокументыАбонента.ТекущиеДанные;
	
	Если ТекДанные.Тип = Тип("ДокументСсылка.энргВводНачальныхОстатков") Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", ВыбраннаяСтрока);
		ПараметрыФормы.Вставить("Абонент", ТекАбонент);
		ОткрытьФорму("Документ.энргВводНачальныхОстатков.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

// TODO FIX ME
// Это что за дичь вообще???
&НаСервере
Процедура ЗаполнитьПрисоединенныеФайлы()
	
	Если НЕ ЗначениеЗаполнено(ПериодФайловОтбор.ДатаНачала) Тогда
		ПериодФайловОтбор.ДатаНачала 	= НачалоГода(ТекущаяДата());
		ПериодФайловОтбор.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл,
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ВладелецФайла КАК ДокументСистемы,
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ВладелецФайла.Абонент КАК Абонент
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Справочник.энргОперацияСЛицевымСчетомПрисоединенныеФайлы КАК энргОперацияСЛицевымСчетомПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.Ссылка,
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ВладелецФайла,
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ДатаСоздания,
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ВладелецФайла.АбонентСмена
	|ИЗ
	|	Справочник.энргОперацияСЛицевымСчетомПрисоединенныеФайлы КАК энргОперацияСЛицевымСчетомПрисоединенныеФайлы
	|ГДЕ
	|	энргОперацияСЛицевымСчетомПрисоединенныеФайлы.ВладелецФайла.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_СменаСобственника)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОперацияСПриборомУчетаПрисоединенныеФайлы.Ссылка,
	|	энргОперацияСПриборомУчетаПрисоединенныеФайлы.ВладелецФайла,
	|	энргОперацияСПриборомУчетаПрисоединенныеФайлы.ДатаСоздания,
	|	энргОперацияСПриборомУчетаПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргОперацияСПриборомУчетаПрисоединенныеФайлы КАК энргОперацияСПриборомУчетаПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьВидБлагоустройстваАбонентаПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьВидБлагоустройстваАбонентаПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьВидБлагоустройстваАбонентаПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьВидБлагоустройстваАбонентаПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьВидБлагоустройстваАбонентаПрисоединенныеФайлы КАК энргУстановитьВидБлагоустройстваАбонентаПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьГруппуПотребителейАбонентаПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьГруппуПотребителейАбонентаПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьГруппуПотребителейАбонентаПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьГруппуПотребителейАбонентаПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьГруппуПотребителейАбонентаПрисоединенныеФайлы КАК энргУстановитьГруппуПотребителейАбонентаПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьЗначениеПлощадиПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьЗначениеПлощадиПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьЗначениеПлощадиПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьЗначениеПлощадиПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьЗначениеПлощадиПрисоединенныеФайлы КАК энргУстановитьЗначениеПлощадиПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьКоличествоКомнатПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьКоличествоКомнатПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьКоличествоКомнатПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьКоличествоКомнатПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьКоличествоКомнатПрисоединенныеФайлы КАК энргУстановитьКоличествоКомнатПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьКоличествоПрописанныхПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьКоличествоПрописанныхПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьКоличествоПрописанныхПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьКоличествоПрописанныхПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьКоличествоПрописанныхПрисоединенныеФайлы КАК энргУстановитьКоличествоПрописанныхПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьКоличествоПроживающихПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьКоличествоПроживающихПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьКоличествоПроживающихПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьКоличествоПроживающихПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьКоличествоПроживающихПрисоединенныеФайлы КАК энргУстановитьКоличествоПроживающихПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьКоличествоСобственниковПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьКоличествоСобственниковПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьКоличествоСобственниковПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьКоличествоСобственниковПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьКоличествоСобственниковПрисоединенныеФайлы КАК энргУстановитьКоличествоСобственниковПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргИзменениеЛьготыЖильцамПрисоединенныеФайлы.Ссылка,
	|	энргИзменениеЛьготыЖильцамПрисоединенныеФайлы.ВладелецФайла,
	|	энргИзменениеЛьготыЖильцамПрисоединенныеФайлы.ДатаСоздания,
	|	энргИзменениеЛьготыЖильцамПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргИзменениеЛьготыЖильцамПрисоединенныеФайлы КАК энргИзменениеЛьготыЖильцамПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановкаСнятиеОграниченияПрисоединенныеФайлы.Ссылка,
	|	энргУстановкаСнятиеОграниченияПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановкаСнятиеОграниченияПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановкаСнятиеОграниченияПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановкаСнятиеОграниченияПрисоединенныеФайлы КАК энргУстановкаСнятиеОграниченияПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргСменаПоставщикаПрисоединенныеФайлы.Ссылка,
	|	энргСменаПоставщикаПрисоединенныеФайлы.ВладелецФайла,
	|	энргСменаПоставщикаПрисоединенныеФайлы.ДатаСоздания,
	|	энргСменаПоставщикаПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргСменаПоставщикаПрисоединенныеФайлы КАК энргСменаПоставщикаПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьТехническуюВозможностьУстановкиПУПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьТехническуюВозможностьУстановкиПУПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьТехническуюВозможностьУстановкиПУПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьТехническуюВозможностьУстановкиПУПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьТехническуюВозможностьУстановкиПУПрисоединенныеФайлы КАК энргУстановитьТехническуюВозможностьУстановкиПУПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргАктированиеНедопускаДопускаВПомещениеПрисоединенныеФайлы.Ссылка,
	|	энргАктированиеНедопускаДопускаВПомещениеПрисоединенныеФайлы.ВладелецФайла,
	|	энргАктированиеНедопускаДопускаВПомещениеПрисоединенныеФайлы.ДатаСоздания,
	|	энргАктированиеНедопускаДопускаВПомещениеПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргАктированиеНедопускаДопускаВПомещениеПрисоединенныеФайлы КАК энргАктированиеНедопускаДопускаВПомещениеПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.Ссылка,
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.ВладелецФайла,
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.ДатаСоздания,
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы КАК энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьДатуПоверкиПУПрисоединенныеФайлы КАК энргУстановитьДатуПоверкиПУПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.Ссылка,
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.ВладелецФайла,
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.ДатаСоздания,
	|	энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы КАК энргИзменитьНомерПломбыПрибораУчетаАбонентыПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.Ссылка,
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.ВладелецФайла,
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.ДатаСоздания,
	|	энргУстановитьДатуПоверкиПУПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргУстановитьДатуПоверкиПУПрисоединенныеФайлы КАК энргУстановитьДатуПоверкиПУПрисоединенныеФайлы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргАктБездоговорногоПотребленияПрисоединенныеФайлы.Ссылка,
	|	энргАктБездоговорногоПотребленияПрисоединенныеФайлы.ВладелецФайла,
	|	энргАктБездоговорногоПотребленияПрисоединенныеФайлы.ДатаСоздания,
	|	энргАктБездоговорногоПотребленияПрисоединенныеФайлы.ВладелецФайла.Абонент
	|ИЗ
	|	Справочник.энргАктБездоговорногоПотребленияПрисоединенныеФайлы КАК энргАктБездоговорногоПотребленияПрисоединенныеФайлы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втДанные.ПрисоединенныйФайл КАК ПрисоединенныйФайл,
	|	втДанные.ДокументСистемы КАК ДокументСистемы,
	|	втДанные.ДатаСоздания КАК ДатаСоздания
	|ИЗ
	|	втДанные КАК втДанные
	|ГДЕ
	|	втДанные.Абонент = &Абонент
	|	И ВЫБОР
	|			КОГДА &ДокументСистемы = ТИПЗНАЧЕНИЯ(НЕОПРЕДЕЛЕНО)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТИПЗНАЧЕНИЯ(втДанные.ДокументСистемы) = &ДокументСистемы
	|		КОНЕЦ
	|	И втДанные.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка,
	|	энргДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла,
	|	энргДоговорыКонтрагентовПрисоединенныеФайлы.ДатаСоздания
	|ИЗ
	|	Справочник.энргДоговорыКонтрагентовПрисоединенныеФайлы КАК энргДоговорыКонтрагентовПрисоединенныеФайлы
	|ГДЕ
	|	энргДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла.Контрагент = &Контрагент
	|	И ВЫБОР
	|			КОГДА &ДокументСистемы = ТИПЗНАЧЕНИЯ(НЕОПРЕДЕЛЕНО)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТИПЗНАЧЕНИЯ(энргДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка) = &ДокументСистемы
	|		КОНЕЦ
	|	И энргДоговорыКонтрагентовПрисоединенныеФайлы.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("Абонент"			, ТекАбонент);
	Запрос.УстановитьПараметр("Контрагент"		, ТекАбонент.ФизЛицо);
	Запрос.УстановитьПараметр("ДокументСистемы"	, ?(ДокументСистемыОтборТип = Неопределено, Тип("Неопределено"), ДокументСистемыОтборТип));
	Запрос.УстановитьПараметр("ДатаНачала"		, ПериодФайловОтбор.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, ПериодФайловОтбор.ДатаОкончания);
	
	ПрикрепленныеФайлы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#Область СобытияВкладкиКарточкаАбонента

&НаКлиенте
Процедура ОбновитьКарточкуКлиент(ПериодФормированияНачало,ПериодФормированияКонец) 
	Ошибка = Ложь;
	Если НЕ ЗначениеЗаполнено(ТекАбонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран абонент");
		Ошибка = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПериодФормированияКарточки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран период формирования");
		Ошибка = Истина;
	КонецЕсли;
	
	Если Ошибка Тогда 
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчетаКарточка, "ФормированиеОтчета");
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ОбновитьКарточкуСервер(ПериодФормированияНачало, ПериодФормированияКонец, ТекАбонент, ТекКлючПомещения, ТекОрганизация);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗадания", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьКарточкуСервер(НачалоПериода,КонецПериода,Абонент,КлючПомещения,Организация) 
	
	ПараметрыКарточки = Новый Структура(
		"НачалоПериода,КонецПериода,Район,МКД,Абонент,КлючПомещения,Организация,МораторнаяЗадолженность,РеструктуризированнаяЗадолженность",
		НачалоПериода,КонецПериода,Район,?(КлючПомещения.ЧастныйСектор,Справочники.энргСтроения.ПустаяСсылка(),КлючПомещения.Строение),Абонент,КлючПомещения,Организация,Истина,Истина);
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	КонецЕсли;
	Если ЗначениеЗаполнено(АдресХранилища) Тогда 
		УдалитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;
	
	ИдентификаторАдресаХранилища = Новый УникальныйИдентификатор;
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторАдресаХранилища);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование карточки абонента'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"Отчеты.энргКарточкаАбонента.СформироватьСобытияАбонента", 
		ПараметрыКарточки,
		АдресХранилища);
	
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	АбонентКарточка = ТекАбонент;
	РезультатОтчетаКарточка.Очистить();
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		РезультатОтчетаКарточка = ПолучитьИзВременногоХранилища(АдресХранилища);
		СменитьСостояниеОтображенияКарточкиАбонента(Элементы.РезультатОтчетаКарточка);	
		УдалитьИзВременногоХранилища(АдресХранилища);
	КонецЕсли;  
	
	Возврат ДлительнаяОперация; 
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания(Результат, ДополнительныеПараметры) Экспорт  
	
	СменитьСостояниеОтображенияКарточкиАбонента(Элементы.РезультатОтчетаКарточка);
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		УдалитьИзВременногоХранилища(АдресХранилища);
		ПоказатьПредупреждение( ,Результат.КраткоеПредставлениеОшибки);
		
		Возврат;
	КонецЕсли;
	
	РезультатОтчетаКарточка = ПолучитьИзВременногоХранилища(АдресХранилища);
	УдалитьИзВременногоХранилища(АдресХранилища);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СменитьСостояниеОтображенияКарточкиАбонента(РезультатОтчетаКарточка)
	
	ОтображениеСостояния = РезультатОтчетаКарточка.ОтображениеСостояния;
	ОтображениеСостояния.Видимость 	= Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыбратьОперациюИзСписка(СписокОпераций,Элемент)
	
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВыбратьОперациюИзСпискаЗавершение",ЭтотОбъект);
	
	Если Элемент = Неопределено Тогда
		ПоказатьВыборИзМеню(ОписаниеОповещения,СписокОпераций,);
	Иначе
		ПоказатьВыборИзМеню(ОписаниеОповещения,СписокОпераций,Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОперациюИзСпискаЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено тогда
		Возврат;
	КонецЕсли;
	ВидОперации 		= Неопределено;
	МассивСтрок  		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыбранныйЭлемент.значение,"__");
	ИмяДокумента  		= МассивСтрок[0];
	Если МассивСтрок.количество()> 1 тогда
		ВидОперации 	= МассивСтрок[1]; 
	КонецЕсли;
	
	ОткрытьФормуНовогоДокумента(ИмяДокумента,ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНовогоДокумента(ИмяДокумента,ВидОперации,ЗаполнитьДокумент = истина, ДопЗначЗапол = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ЗаполнитьДокумент",ЗаполнитьДокумент);
	Если ЗаполнитьДокумент тогда
		ЗначенияЗаполнения  				= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
		ЗначенияЗаполнения.КлючПомещения  	= ТекКлючПомещения;
		ЗначенияЗаполнения.Организация  	= ТекОрганизация;
		ЗначенияЗаполнения.Район		  	= текРайон;
		ЗначенияЗаполнения.Абонент  		= ТекАбонент; 
		ЗначенияЗаполнения.Вставить("Дата", ТекущаяДата());
	иначе
		ЗначенияЗаполнения = Новый Структура;
	КонецЕсли;
	
	Если ТипЗнч(ДопЗначЗапол) = Тип("Структура") Тогда
		Для каждого ТекЗнач Из ДопЗначЗапол Цикл
			ЗначенияЗаполнения.Вставить(ТекЗнач.Ключ, ТекЗнач.Значение);
		КонецЦикла;
	КонецЕсли;
	ЕСли ВидОперации <>Неопределено тогда
		ЗначенияЗаполнения.Вставить("ВидОперации",ПредопределенноеЗначение("Перечисление.энргВидыОпераций." + ВидОперации));
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	ОткрытьФорму("Документ." + ИмяДокумента +".ФормаОбъекта",ПараметрыФормы); 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОткрытияСсылки(Элемент,ТаблицаИстории,СтандартнаяОбработка, ОтборПоАбоненту = Ложь)
	Если ТаблицаИстории = "" тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка 	= Ложь;
	
	СтруктураОтбора  = Новый Структура;
	Если ОтборПоАбоненту Тогда
		СтруктураОтбора.Вставить("Абонент",ТекАбонент);	
	Иначе
		СтруктураОтбора.Вставить("КлючПомещения",ТекКлючПомещения);
	КонецЕсли;
	
	ПараметрыОткрытия  = Новый Структура("Отбор",СтруктураОтбора);
	ОткрытьФорму("РегистрСведений." + ТаблицаИстории + ".ФормаСписка",ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Функция СписокОперацийСЛС()
	
	Список  = Новый СписокЗначений;
	Список.Добавить("энргУстановитьВидБлагоустройстваАбонента","Установить вид благоустройства абонента");
	Список.Добавить("энргУстановитьГруппуПотребителейАбонента","Установить тарифную категорию абонента");
	//Список.Добавить("энргУстановитьЗначениеПлощади","Установить значение площади");
	//Список.Добавить("энргУстановитьКоличествоКомнат","Установить количество комнат");
	//Список.Добавить("энргУстановитьКоличествоПрописанных","Установить количество прописанных");
	//Список.Добавить("энргУстановитьКоличествоПроживающих","Установить количество проживающих");
	//Список.Добавить("энргОперацияСЛицевымСчетом__энргОперацияСЛС_ЗакрытиеЛС","Закрыть лицевой счет");
	Возврат Список;
	
КонецФункции

&НаКлиенте
Функция СписокОперацийСТочкамиУчета()
	
	Список  = Новый СписокЗначений;
	Список.Добавить("энргОперацияСПриборомУчета__энргОперацияСПриборомУчета_ВводПУ","Ввод прибора учета");
	Список.Добавить("энргОперацияСПриборомУчета__энргОперацияСПриборомУчета_ВыводПУ","Вывод прибора учета");
	Список.Добавить("энргОперацияСПриборомУчета__энргОперацияСПриборомУчета_ЗаменаПУ","Замена прибора учета");
	Список.Добавить("энргОперацияСУслугами__энргОперацияСУслугами_ПодключениеУслуги","Подключение услуги");
	Список.Добавить("энргОперацияСУслугами__энргОперацияСУслугами_ОтключениеУслуги","Отключение услуги");
	//Список.Добавить("энргУстановитьФормулуРасчетаТочекУчета","Установить формулу расчета точки учета");
	//Список.Добавить("энргУстановитьДатуПоверкиПУ","Установить дату поверки прибора учета");
	Возврат Список;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВидыБлагоустройстваТарифныеКатегории(Период,Организация,Район,КлючПомещения)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргВидБлагоустройствАбонентаСрезПоследних.Услуга КАК Услуга,
	               |	энргВидБлагоустройствАбонентаСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройства,
	               |	"""" КАК ГруппаПотребителей
	               |ПОМЕСТИТЬ ВТ_ВидБлагоустройства
	               |ИЗ
	               |	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И КлючПомещения = &КлючПомещения) КАК энргВидБлагоустройствАбонентаСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	энргГруппыПотребителейАбонентовСрезПоследних.Услуга,
	               |	"""",
	               |	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей
	               |ИЗ
	               |	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И КлючПомещения = &КлючПомещения) КАК энргГруппыПотребителейАбонентовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВидБлагоустройства.Услуга КАК Услуга,
	               |	МАКСИМУМ(ВТ_ВидБлагоустройства.ВидБлагоустройства) КАК ВидБлагоустройстваИндивидуальный,
	               |	МАКСИМУМ(ВТ_ВидБлагоустройства.ГруппаПотребителей) КАК ТарифнаяКатегория
	               |ПОМЕСТИТЬ ВТ_Услуги
	               |ИЗ
	               |	ВТ_ВидБлагоустройства КАК ВТ_ВидБлагоустройства
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВидБлагоустройства.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргПоставщикиУслугАбонентаСрезПоследних.Услуга КАК Услуга,
	               |	МАКСИМУМ(энргПоставщикиУслугАбонентаСрезПоследних.Поставщик) КАК Поставщик
	               |ПОМЕСТИТЬ ВТ_Поставщики
	               |ИЗ
	               |	РегистрСведений.энргПоставщикиУслугАбонента.СрезПоследних(
	               |			&Период,
	               |			КлючПомещения = &КлючПомещения
	               |				И Организация = &Организация
	               |				И Район = &Район) КАК энргПоставщикиУслугАбонентаСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргПоставщикиУслугАбонентаСрезПоследних.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Услуги.Услуга КАК Услуга,
	               |	ВТ_Услуги.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройстваИндивидуальный,
	               |	ВТ_Услуги.ТарифнаяКатегория КАК ТарифнаяКатегория,
	               |	ВТ_Поставщики.Поставщик КАК Поставщик
	               |ПОМЕСТИТЬ ВТ_ПоставщикиИУслуги
	               |ИЗ
	               |	ВТ_Услуги КАК ВТ_Услуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поставщики КАК ВТ_Поставщики
	               |		ПО ВТ_Услуги.Услуга = ВТ_Поставщики.Услуга
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргЗначенияТарифовСрезПоследних.Услуга КАК Услуга,
	               |	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	               |	МАКСИМУМ(энргЗначенияТарифовСрезПоследних.Значение) КАК Значение
	               |ПОМЕСТИТЬ ВТ_Тарифы
	               |ИЗ
	               |	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Район = &Район
	               |				И (Услуга, Поставщик, ГруппаПотребителей) В
	               |					(ВЫБРАТЬ
	               |						вт.Услуга,
	               |						вт.Поставщик,
	               |						вт.ТарифнаяКатегория
	               |					ИЗ
	               |						ВТ_ПоставщикиИУслуги КАК вт)) КАК энргЗначенияТарифовСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	энргЗначенияТарифовСрезПоследних.Услуга,
	               |	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Норматив.ЗначениеНорматива КАК ЗначениеНорматива,
	               |	Норматив.ВидБлагоустройства КАК ВидБлагоустройства,
	               |	Норматив.Услуга КАК Услуга
	               |ПОМЕСТИТЬ ВТ_Норматив
	               |ИЗ
	               |	ВТ_ПоставщикиИУслуги КАК ВТ_ПоставщикиИУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			энргКлючиНормативов.ВидБлагоустройства КАК ВидБлагоустройства,
	               |			энргЗначенияНормативовПотребленияСрезПоследних.Услуга КАК Услуга,
	               |			МАКСИМУМ(энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива) КАК ЗначениеНорматива
	               |		ИЗ
	               |			РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	               |					&Период,
	               |					Организация = &Организация
	               |						И Район = &Район
	               |						И Услуга В
	               |							(ВЫБРАТЬ
	               |								вт.Услуга
	               |							ИЗ
	               |								ВТ_ПоставщикиИУслуги КАК вт)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиНормативов КАК энргКлючиНормативов
	               |				ПО энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива = энргКлючиНормативов.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			энргЗначенияНормативовПотребленияСрезПоследних.Услуга,
	               |			энргКлючиНормативов.ВидБлагоустройства) КАК Норматив
	               |		ПО ВТ_ПоставщикиИУслуги.Услуга = Норматив.Услуга
	               |			И ВТ_ПоставщикиИУслуги.ВидБлагоустройстваИндивидуальный = Норматив.ВидБлагоустройства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Тарифы.Значение КАК ЗначениеТарифа,
	               |	ВТ_Норматив.ЗначениеНорматива КАК НормаТарифа,
	               |	ВТ_ПоставщикиИУслуги.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройстваИндивидуальный,
	               |	ВТ_ПоставщикиИУслуги.Услуга КАК Услуга,
	               |	ВТ_ПоставщикиИУслуги.ТарифнаяКатегория КАК ТарифнаяКатегория,
	               |	ВТ_ПоставщикиИУслуги.Услуга.Код КАК КодУслуги,
	               |	ВТ_ПоставщикиИУслуги.Поставщик КАК Поставщик
	               |ИЗ
	               |	ВТ_ПоставщикиИУслуги КАК ВТ_ПоставщикиИУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Тарифы КАК ВТ_Тарифы
	               |		ПО ВТ_ПоставщикиИУслуги.Услуга = ВТ_Тарифы.Услуга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Норматив КАК ВТ_Норматив
	               |		ПО ВТ_ПоставщикиИУслуги.Услуга = ВТ_Норматив.Услуга" ;
	
	Запрос.УстановитьПараметр("КлючПомещения"	, КлючПомещения);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Район"			, Район);
	
	
	//Запрос.УстановитьПараметр("Услуга"			, Услуга);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ВидыБлагоустройстваТарифныеКатегории.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖильцыЛьготныхКатегорийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,Элементы.ЖильцыЛьготныхКатегорий.ТекущиеДанные.Регистратор);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтроение()
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ОтборПоДому", Ложь);
	СтруктураВозврат.Вставить("Дом", Справочники.энргСтроения.ПустаяСсылка());
	Если ТекКлючПомещения.Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД Тогда
		СтруктураВозврат.ОтборПоДому = Истина;
		СтруктураВозврат.Дом = ТекКлючПомещения.Строение;
	ИначеЕсли ТекКлючПомещения.Строение.ТипСтроения = Перечисления.энргТипыСтроений.ЖД Тогда
		СтруктураВозврат.ОтборПоДому = Истина;
	КонецЕсли;
	Возврат СтруктураВозврат;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокДляУдаления(СписокЭлементовУдалить, СписокРеквизитовУдалить, Элемент)
	
	Для каждого ТекЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ТекЭлемент) = Тип("ГруппаФормы") Тогда
			
			ЗаполнитьСписокДляУдаления(СписокЭлементовУдалить, СписокРеквизитовУдалить, ТекЭлемент);
		ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ПолеФормы") Тогда
			СписокРеквизитовУдалить.Добавить(ТекЭлемент.Имя);
		КонецЕсли;
		
		СписокЭлементовУдалить.Добавить(ТекЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНовогоПоказанияПУ(Результат, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если Результат <> Неопределено Тогда  
		УстановитьПоказаниеПУ(Элемент.Имя, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоказаниеПУ(ИмяЭлемента, Результат)
	Префикс		= "_РекПУ_";
	Показание   = Результат.Показание;
	
	СтрокиТУ = ТочкиУчета.НайтиСтроки(Новый Структура("ТочкаУчета", ТекТочкаУчета));
	Если ЗначениеЗаполнено(СтрокиТУ) Тогда
		СтрокаТУ = СтрокиТУ[0];
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран прибор учета.");
		Возврат;
	КонецЕсли;
	
	Ид	= Формат(СтрокаТУ.ПолучитьИдентификатор(), "ЧН=0; ЧГ=0");
	ИдПоказаний = СтрЗаменить(ИмяЭлемента, Префикс + Ид + "_", "");
	ИдПоказаний = СтрЗаменить(ИдПоказаний, "_ПредыдущиеПоказания", "");
	ИдПоказаний = Число(ИдПоказаний);
	СтрокаПоказ = ПоказанияПриборовУчета.НайтиПоИдентификатору(ИдПоказаний);
	
	Если СтрокаПоказ = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить показания прибора учета.");
		Возврат;
	Иначе
		СтрокиШкалы = ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаПоказ.IDСтроки));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокиШкалы) Тогда
		СтрокаШкалы = СтрокиШкалы[0];
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить показания прибора учета.");
		Возврат;
	КонецЕсли;
	
	// Создание и заполнение документа, для регистрации показаний
	ДокОбъект = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ШапкаДок = Новый Структура("Абонент, КлючПомещения, Организация, Район, Дата", ТекАбонент, ТекКлючПомещения, ТекОрганизация, текРайон, Результат.Дата);
	ШапкаДок.Вставить("ВидОперации"			, Перечисления.энргВидыОпераций.энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента);
	ШапкаДок.Вставить("ИсточникПоказаний"	, Результат.ИсточникПоказаний);
	ШапкаДок.Вставить("ПериодНачисления"	, Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ШапкаДок.Дата, ТекОрганизация,текРайон));
	ЗаполнитьЗначенияСвойств(ДокОбъект, ШапкаДок);
	
	ИдТУ    = Новый УникальныйИдентификатор;
	ИдШкала = Новый УникальныйИдентификатор;
	
	СтрокаДокТочкиУчета = ДокОбъект.ТочкиУчета.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДокТочкиУчета, СтрокаТУ);
	СтрокаДокТочкиУчета.IDСтроки = ИдТУ;
	
	СтрокаДокШкалыПУ = ДокОбъект.ШкалыПриборовУчета.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДокШкалыПУ, СтрокаШкалы);
	СтрокаДокШкалыПУ.IDСтроки			= ИдШкала;
	СтрокаДокШкалыПУ.IDСтрокиТочкиУчета = ИдТУ;
	
	СтрокаДокПоказанияПУ = ДокОбъект.ПоказанияПриборовУчета.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДокПоказанияПУ, СтрокаПоказ);
	СтрокаДокПоказанияПУ.IDСтроки = ИдШкала;
	
	СтрокаДокПоказанияПУ.Переворот = Ложь;
	Если СтрокаДокТочкиУчета.ПриборУчета.РегистрируетОбъем Тогда
		СтрокаДокПоказанияПУ.Разница = Показание;
		СтрокаДокПоказанияПУ.ПредыдущиеПоказания = 0;
	Иначе
		СтрокаДокПоказанияПУ.Разница = Показание-СтрокаДокПоказанияПУ.ПредыдущиеПоказания;
	КонецЕсли;
	СтрокаДокПоказанияПУ.СостояниеПоказаний 	= Перечисления.энргСостояниеПоказаний.Приняты;
	СтрокаДокПоказанияПУ.ТекущиеПоказания		= Показание;
	СтрокаДокПоказанияПУ.ПоказанияПредоставлены = Истина;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить показания прибора учета по причине: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(ТекОрганизация, ДокОбъект.ПериодНачисления, текРайон, ТекКлючПомещения.ЧастныйСектор,ТекКлючПомещения.Строение, ТекКлючПомещения.Помещение);
	СтрокаПоказ.ПредыдущиеПоказания		= Показание;
	СтрокаПоказ.ДатаПоследнихПоказаний  = ДокОбъект.Дата;
	ЭтаФорма[ИмяЭлемента]				= Показание;
	ИмяЭлеДатаПоказ						= СтрЗаменить(ИмяЭлемента, "_ПредыдущиеПоказания", "_ДатаПоследнихПоказаний");
	ЭтаФорма[ИмяЭлеДатаПоказ]			= ДокОбъект.Дата;
КонецПроцедуры 

&НаКлиенте
Процедура СуммаКОплатеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ПериодНачисления  		= ВернутьПериодНАчисления();
	
	ПараметрыОткрытия 		= новый Структура();
	ПараметрыОткрытия.Вставить("Период"				, НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1)) );
	ПараметрыОткрытия.Вставить("ПериодНачисления"	, ПериодНачисления);
	ПараметрыОткрытия.Вставить("Организация"		, ТекОрганизация);
	ПараметрыОткрытия.Вставить("Район"				, текРайон);
	ПараметрыОткрытия.Вставить("МКД"				, МКД);
	ПараметрыОткрытия.Вставить("Абонент"			, ТекАбонент);
	ОткрытьФорму("РегистрНакопления.энргВзаиморасчетыПоМесяцам.Форма.ФормаДетализацияЗадолженности",ПараметрыОткрытия);
КонецПроцедуры

&НаСервере
Функция  ВернутьПериодНачисления()
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ТекущаяДата(), Организация,Район);
	
	Возврат ПериодНачисления;
КонецФункции

&НаКлиенте
Процедура НаправлениеИспользованияТУПриНажатии(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура();
	ФормаСписка = ПолучитьФорму("РегистрСведений.энргЗначенияИзмерителейТочекУчета.Форма.ФормаПоказаний", ПараметрыОтбора, ЭтаФорма);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	ФормаСписка.Список,
	"Родитель",
	ЭтаФорма[Элемент.Имя],
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	ФормаСписка.Список,
	"ТочкаУчета",
	ТекТочкаУчета,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Истина);		
	
	ФормаСписка.Открыть();
	
КонецПроцедуры

Функция РазницаДатВМесяцах(Дата1, Дата2) 
	
	ДатаНач	= ?(Дата1 < Дата2, Дата1, Дата2);
	ДатаКон	= ?(Дата1 < Дата2, Дата2, Дата1);
	
	Годы    = Год( датаКон ) - Год( датаНач );
	Месяцы  = Месяц( датаКон ) - Месяц( датаНач );
	
	Разность = месяцы + годы * 12;
	
	Возврат Разность;
	
КонецФункции

Функция СписокОперацийСПриборамУчета()
	Список  = Новый СписокЗначений;
	Список.Добавить("энргОперацияСПриборомУчета__энргОперацияСПриборомУчета_ВводПУ","Ввод прибора учета");
	Список.Добавить("энргОперацияСПриборомУчета__энргОперацияСПриборомУчета_ВыводПУ","Вывод прибора учета");
	Список.Добавить("энргОперацияСПриборомУчета__энргОперацияСПриборомУчета_ЗаменаПУ","Замена прибора учета");
	
	Возврат Список;
КонецФункции

&НаКлиенте
Функция СписокОперацийЖурналаДокументовАбонента()
	
	Список  = Новый СписокЗначений;
	
	Список.Добавить("энргПоступлениеОплатыЧерезКонтроллера"						, "(не используется) Поступление оплаты через контроллера");
	Список.Добавить("энргОперацияСПриборомУчета"								, "Акт ввода/вывода/замены прибора учёта");
	Список.Добавить("энргБанкротство"											, "Банкротство" );
	Список.Добавить("энргВводНачальныхОстатков"									, "Ввод начальных остатков");
	Список.Добавить("энргУстановитьВидБлагоустройстваАбонента"					, "Установить вид благоустройства абонента");
	//Список.Добавить("энргУстановитьВидДифференцированностиПриборУчета", "Изменить вид дифференцированости прибора учета");
	Список.Добавить("энргУстановитьДатуПоверкиПУ"								, "Установить дату поверки прибора учета");
	Список.Добавить("энргУстановитьЗначениеПлощади"								, "Установить значение площади");
	Список.Добавить("энргУстановитьКоличествоКомнат"							, "Установить количество комнат");
	Список.Добавить("энргУстановитьКоличествоПроживающих"						, "Установить количество проживающих");
	Список.Добавить("энргУстановитьКоличествоПрописанных"						, "Установить количество прописанных");
	Список.Добавить("энргСменаПоставщика"										, "Изменить поставщика услуг");
	Список.Добавить("энргУстановитьСтатусАбонентовОтключаемыхВНеполивнойСезон"	, "Изменить статус абонентов, отключаемых в неполивной сезон");
	Список.Добавить("энргУстановитьГруппуПотребителейАбонента"					, "Изменить тарифную категорию абонента");
	Список.Добавить("энргУстановитьТехническийСтатусТочкиУчета"					, "Изменить технический статус точки учета");
	Список.Добавить("энргИзменитьПризнакРасчетаТолькоПоПоказаниям"				, "Изменить признак расчета только по показаниям");
	Список.Добавить("энргУстановитьСхемуПодчиненностиТочекУчета"				, "Изменить схему подчиненности точек учета");
	Список.Добавить("энргУстановитьТехническуюВозможностьУстановкиПУ"			, "Изменить техническую возможность установки ПУ");
	Список.Добавить("энргУстановитьФормулуРасчетаТочекУчета"					, "Изменить формулу расчета точек учета");
	Список.Добавить("энргОбходнойЛист"											, "Обходной лист");
	Список.Добавить("энргОперацияПоПлатежнойКарте"								, "Операция по платежной карте");
	Список.Добавить("энргОперацияСЛицевымСчетом"								, "Открытие/закрытие лс физического лица");	
	Список.Добавить("энргПерерасчет"											, "Перерасчет");
	Список.Добавить("энргРучноеИзменениеПени"									, "Ручное изменение пени");
	список.Добавить("энргПлатежноеПоручениеВходящие"							, "Платежное поручение (входящие)");
	Список.Добавить("энргОперацияСУслугами"										, "Подключение/отключение услуг");
	Список.Добавить("энргПриходныйКассовыйОрдер"								, "Приходный кассовый ордер");
	Список.Добавить("энргРасходныйКассовыйОрдер"								, "Расходный кассовый ордер");
	//Список.Добавить("энргРасчетДебиторскойЗадолженности", "Расчет дебиторской задолженности");
	Список.Добавить("энргРегистрацияВременногоОтсутствия"						, "Регистрация временного отсутствия абонента");
	Список.Добавить("энргРегистрацияВременногоОтключенияУслуги"					, "Регистрация временного отключения услуги");
	Список.Добавить("энргУстановитьДополнительнуюСоциальнуюНорму"				, "Установить дополнительную соц. норму");
	Список.Добавить("энргРегистрацияПоказанийАбонента"							, "Регистрация показаний абонента");
	Список.Добавить("энргУстановитьКоличествоСобственников"						, "Установить количество собственников");
	Список.Добавить("энргУстановкаСнятиеОграничения"							, "Установка/Снятие ограничения");	
	Список.Добавить("рксЕдиныйПлатежныйДокумент"								, "Платежный документ");	
	Список.Добавить("энргИзменитьПлательщикаУслуги"								, "Изменить плательщика услуги");
	Список.Добавить("энргБанкротство"											, "Списание/Восстановление задолженности");
	
	Новыйспик = Новый СписокЗначений;
	Новыйспик.Добавить("Док1"								, "Док 1");
	Новыйспик.Добавить("Док2"								, "Док 2");
	Список.Добавить(Новыйспик								, "Верхний уровень");
	
	
	Возврат Список;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивКодовСоставляющихУслуги(Услуга)
	
	мКодыУслуг = Новый Массив;
	
	Если НЕ Услуга.СоставнаяУслуга Тогда				
		
		мКодыУслуг.Добавить(Услуга.Код);
		Возврат мКодыУслуг;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга.Код КАК Код,
	|	энргВидыУслугСоставляющиеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Услуга);
	Результат = Запрос.Выполнить();
	
	мКодыУслуг = Результат.Выгрузить().ВыгрузитьКолонку("Код");
	
	Возврат мКодыУслуг;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеТарифа(ТочкиУчета)
	ЗначениеТарифа = 0;
	Для Каждого Строка Из ТочкиУчета Цикл
		Если ЗначениеЗаполнено(Строка.ЗначениеТарифа) 
			И ЗначениеТарифа < Число(Строка.ЗначениеТарифа) Тогда
			ЗначениеТарифа = Число(Строка.ЗначениеТарифа);
		КонецЕсли;
	КонецЦикла;
	Возврат ЗначениеТарифа;
КонецФункции

&НаСервере
Процедура ОбновитьПриборыСИстекающимСрокомПоверкиНаСервере()
	ПриборыСИстекающимСрокомПоверки.Очистить();
	
	Схема 				= Неопределено;
	СтруктураПараметров = Новый Структура;	
	СтруктураПараметров.Вставить("Период",  Новый Структура("ИмяПараметра", "Период"));	
	
	РегистрыСведений.энргДатыПоверкиПрибораУчета.ДатыПоверокДействующихПриборовУчета(Схема, СтруктураПараметров,"ДатыПоверокДействующихПриборовУчета");
	//РегистрыСведений.энргАбонентыПомещений.ТекущийАбонентВПомещении(Схема, СтруктураПараметров, "АбонентыПомещений");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВведенныеПриборыДействующихТочек.Организация КАК Организация,
	|	ВведенныеПриборыДействующихТочек.Район КАК Район,
	|	АбонентыПомещений.Абонент КАК Абонент,
	|	ВведенныеПриборыДействующихТочек.КлючПомещения КАК КлючПомещения,
	|	ВведенныеПриборыДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|	ВведенныеПриборыДействующихТочек.ПриборУчета КАК ПриборУчета,
	|	ДатыПоверокДействующихПриборовУчета.ДатаПоверки КАК ДатаПоверки,
	|	энргАбоненты.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ СрокПоверок
	|ИЗ
	|	ДействующиеПриборыУчетаПомещения КАК ВведенныеПриборыДействующихТочек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыПоверокДействующихПриборовУчета КАК ДатыПоверокДействующихПриборовУчета
	|		ПО ВведенныеПриборыДействующихТочек.Организация = ДатыПоверокДействующихПриборовУчета.Организация
	|			И ВведенныеПриборыДействующихТочек.Район = ДатыПоверокДействующихПриборовУчета.Район
	|			И ВведенныеПриборыДействующихТочек.КлючПомещения = ДатыПоверокДействующихПриборовУчета.КлючПомещения
	|			И ВведенныеПриборыДействующихТочек.ПриборУчета = ДатыПоверокДействующихПриборовУчета.ПриборУчета
	|			И (РАЗНОСТЬДАТ(&НачалоПериода, НАЧАЛОПЕРИОДА(ДатыПоверокДействующихПриборовУчета.ДатаПоверки, МЕСЯЦ), МЕСЯЦ) <= &СрокПоверки)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АбонентыПомещений КАК АбонентыПомещений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО АбонентыПомещений.Абонент = энргАбоненты.Ссылка
	|		ПО ВведенныеПриборыДействующихТочек.Организация = АбонентыПомещений.Организация
	|			И ВведенныеПриборыДействующихТочек.Район = АбонентыПомещений.Район
	|			И ВведенныеПриборыДействующихТочек.КлючПомещения = АбонентыПомещений.КлючПомещения");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	энргВидыДифференцированностиПриборовУчетаСрезПоследних.Организация КАК Организация,
	|	энргВидыДифференцированностиПриборовУчетаСрезПоследних.Район КАК Район,
	|	энргВидыДифференцированностиПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргВидыДифференцированностиПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргВидыДифференцированностиПриборовУчетаСрезПоследних.Шкала КАК Шкала,
	|	энргВидыДифференцированностиПриборовУчетаСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВидДифференцированностиВведенныхПриборов
	|ИЗ
	|	РегистрСведений.энргВидыДифференцированностиПриборовУчета.СрезПоследних(
	|			&Период,
	|			(Организация, Район, КлючПомещения, ПриборУчета) В
	|				(ВЫБРАТЬ
	|					СрокПоверок.Организация,
	|					СрокПоверок.Район,
	|					СрокПоверок.КлючПомещения,
	|					СрокПоверок.ПриборУчета
	|				ИЗ
	|					СрокПоверок КАК СрокПоверок)) КАК энргВидыДифференцированностиПриборовУчетаСрезПоследних");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	МАКСИМУМ(ВложенныйЗапрос.Адрес) КАК Адрес,
	|	МАКСИМУМ(ВложенныйЗапрос.Телефон) КАК Телефон,
	|	МАКСИМУМ(ВложенныйЗапрос.Почта) КАК Почта
	|ПОМЕСТИТЬ ДанныеАбонентов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрокПоверок.Абонент КАК Абонент,
	|		ЕСТЬNULL(энргАбонентыКонтактнаяИнформация.Представление, """") КАК Адрес,
	|		"""" КАК Телефон,
	|		"""" КАК Почта
	|	ИЗ
	|		СрокПоверок КАК СрокПоверок
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|			ПО СрокПоверок.Абонент = энргАбонентыКонтактнаяИнформация.Ссылка
	|				И (энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргАбонентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъекта))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СрокПоверок.Абонент,
	|		"""",
	|		ВЫБОР
	|			КОГДА энргКонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|					И энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|				ТОГДА ЕСТЬNULL(энргКонтрагентыКонтактнаяИнформация.Представление, """")
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА энргКонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
	|				ТОГДА ЕСТЬNULL(энргКонтрагентыКонтактнаяИнформация.Представление, """")
	|			ИНАЧЕ """"
	|		КОНЕЦ
	|	ИЗ
	|		СрокПоверок КАК СрокПоверок
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|			ПО СрокПоверок.ФизЛицо = энргКонтрагентыКонтактнаяИнформация.Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Абонент");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрокПоверок.Организация КАК Организация,
	|		СрокПоверок.Район КАК Район,
	|		СрокПоверок.Абонент КАК Абонент,
	|		СрокПоверок.КлючПомещения КАК КлючПомещения,
	|		СрокПоверок.ТочкаУчета КАК ТочкаУчета,
	|		СрокПоверок.ПриборУчета КАК ПриборУчета,
	|		СрокПоверок.ДатаПоверки КАК ДатаПоверки,
	|		энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности
	|	ИЗ
	|		СрокПоверок КАК СрокПоверок
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО СрокПоверок.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Вложенныйзапрос.Организация КАК Организация,
	|	Вложенныйзапрос.Район КАК Район,
	|	Вложенныйзапрос.Абонент КАК Абонент,
	|	Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
	|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|	Вложенныйзапрос.ДатаПоверки КАК ДатаПоверки,
	|	Вложенныйзапрос.Шкала КАК Шкала,
	|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ПОМЕСТИТЬ ПриборыДляПолученияПоказаний
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоПриборам.Организация КАК Организация,
	|		ДанныеПоПриборам.Район КАК Район,
	|		ДанныеПоПриборам.Абонент КАК Абонент,
	|		ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
	|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|		ДанныеПоПриборам.ДатаПоверки КАК ДатаПоверки,
	|		ДанныеПоПриборам.Шкала КАК Шкала,
	|		ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности
	|	ИЗ
	|		ДанныеПоПриборам КАК ДанныеПоПриборам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
	|			ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
	|				И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
	|				И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
	|				И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
	|				И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО Вложенныйзапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриборыДляПолученияПоказаний.Организация КАК Организация,
	|	ПриборыДляПолученияПоказаний.Район КАК Район,
	|	ПриборыДляПолученияПоказаний.Абонент КАК Абонент,
	|	ПриборыДляПолученияПоказаний.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыДляПолученияПоказаний.ПриборУчета КАК ПриборУчета,
	|	ПриборыДляПолученияПоказаний.ДатаПоверки КАК ДатаПоверки,
	|	ПриборыДляПолученияПоказаний.Шкала КАК Шкала,
	|	ПриборыДляПолученияПоказаний.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргПоказанияПриборовУчетаСрезПоследних.Период КАК ДатаПоказаний,
	|	энргПоказанияПриборовУчетаСрезПоследних.Показание КАК ПоследниеПоказания,
	|	ДанныеАбонентов.Адрес КАК Адрес,
	|	ДанныеАбонентов.Телефон КАК Телефон,
	|	ДанныеАбонентов.Почта КАК Email
	|ИЗ
	|	ПриборыДляПолученияПоказаний КАК ПриборыДляПолученияПоказаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета.СрезПоследних(
	|				&Период,
	|				(Организация, Район, КлючПомещения, ПриборУчета, Шкала, ТарифнаяЗона) В
	|					(ВЫБРАТЬ
	|						ПриборыДляПолученияПоказаний.Организация КАК Организация,
	|						ПриборыДляПолученияПоказаний.Район КАК Район,
	|						ПриборыДляПолученияПоказаний.КлючПомещения КАК КлючПомещения,
	|						ПриборыДляПолученияПоказаний.ПриборУчета КАК ПриборУчета,
	|						ПриборыДляПолученияПоказаний.Шкала КАК Шкала,
	|						ПриборыДляПолученияПоказаний.ТарифнаяЗона КАК ТарифнаяЗона
	|					ИЗ
	|						ПриборыДляПолученияПоказаний КАК ПриборыДляПолученияПоказаний)) КАК энргПоказанияПриборовУчетаСрезПоследних
	|		ПО ПриборыДляПолученияПоказаний.Организация = энргПоказанияПриборовУчетаСрезПоследних.Организация
	|			И ПриборыДляПолученияПоказаний.Район = энргПоказанияПриборовУчетаСрезПоследних.Район
	|			И ПриборыДляПолученияПоказаний.КлючПомещения = энргПоказанияПриборовУчетаСрезПоследних.КлючПомещения
	|			И ПриборыДляПолученияПоказаний.ПриборУчета = энргПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	|			И ПриборыДляПолученияПоказаний.Шкала = энргПоказанияПриборовУчетаСрезПоследних.Шкала
	|			И ПриборыДляПолученияПоказаний.ТарифнаяЗона = энргПоказанияПриборовУчетаСрезПоследних.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеАбонентов КАК ДанныеАбонентов
	|		ПО ПриборыДляПолученияПоказаний.Абонент = ДанныеАбонентов.Абонент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоверки");
	
	Текст = Схема.ПолучитьТекстЗапроса();
	СтрокаПоиска = 
	"энргВладельцыТочекУчета.Период <= &Период";
	СтрокаЗамены =
	"энргВладельцыТочекУчета.Период <= &Период И энргВладельцыТочекУчета.АбонентВладелец = &КлючПомещения"; 
	
	Текст 		= СтрЗаменить(Текст,СтрокаПоиска,СтрокаЗамены);
	Запрос  	= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Период"			,	ТекущаяДата());	
	Запрос.УстановитьПараметр("НачалоПериода"	,	НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("СрокПоверки"		,	КолвоМесяцевДоПоверки);	
	Запрос.УстановитьПараметр("КлючПомещения"	,   ТекКлючПомещения);
	Результат  	= Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = ПриборыСИстекающимСрокомПоверки.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОтчетаКарточкаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.энргВводНачальныхОстатков") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ", Расшифровка);
		ПараметрыФормы.Вставить("Абонент",АбонентКарточка);
		ОткрытьФорму("Документ.энргВводНачальныхОстатков.ФормаОбъекта", ПараметрыФормы,ЭтаФорма);
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ДокументСсылка.энргНачисление") И ЗначениеЗаполнено(АбонентКарточка) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы 		= Новый Структура("Ключ", Расшифровка);
		ФормаДокумента 		= ПолучитьФорму("Документ.энргНачисление.ФормаОбъекта",ПараметрыФормы,ЭтаФорма);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ФормаДокумента.ОбъемНачислений,
		"Абонент",
		АбонентКарточка,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
		"Абонент");
		
		ФормаДокумента.Открыть();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДанныхОперативнойзадолженностиНаДату(Знач Абонент, Знач ПериодЗадолженности)
	Схема 										= Неопределено;
	ПараметрыСхемы 								= Новый Структура;
	ПараметрыВТ 								= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", Новый Структура("Организация,Район,МКД,Абонент", "Организация","Район","МКД","Абонент")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	ПараметрыСхемы.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
	РегистрыНакопления.энргВзаиморасчеты.ДанныеОперативнойЗадолженности(Схема,ПараметрыСхемы,"");
	ПараметрыЗапроса 							= Новый Структура("Период,Организация,Район,МКД,Абонент", ПериодЗадолженности,Организация,Район,МКД,Абонент);
	
	Результат  									= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	СуммаЗадолженностиНаДату					= 0;
	Если Не Результат.Пустой() Тогда
		Выборка 								= Результат.Выбрать();
		Выборка.Следующий();
		СуммаЗадолженностиНаДату 				= Выборка.Сумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументСистемыОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДокументСистемыОтборТип = ВыбранноеЗначение;
	
	ЗаполнитьДокументСистемыОтбор();
	ЗаполнитьПрисоединенныеФайлы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументСистемыОтбор()
	
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ДокументСистемыОтборТип);	
	ДокументСистемыОтбор = МетаданныеДокумента.Синоним;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодФайловОтборПриИзменении(Элемент)
	ЗаполнитьПрисоединенныеФайлы();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ПрикрепленныеФайлы.ТекущиеДанные;
	
	Если Поле.Имя = "ПрикрепленныеФайлыДокументСистемы" Тогда
		
		ИмяМетаданных = ПолучитьИмяМетаданных(ТекДанные.ДокументСистемы);
		ПараметрыОткрытия = Новый Структура("Ключ", ТекДанные.ДокументСистемы);
		ОткрытьФорму(ИмяМетаданных + ".ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
		
	ИначеЕсли Поле.Имя = "ПрикрепленныеФайлыПрисоединенныйФайл" Тогда
		
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекДанные.ПрисоединенныйФайл, Неопределено, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяМетаданных(Элемент)
	
	Если ТипЗнч(Элемент) = Тип("Тип") Тогда
		ТипМетаданных = Элемент;
	Иначе
		ТипМетаданных = ТипЗнч(Элемент);
	КонецЕсли;
	
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипМетаданных);
	
	Возврат МетаданныеДокумента.ПолноеИмя();
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовПриборовСервер(мПриборыУчета, ПолучаемыеРеквизитыПрибора)
	Возврат Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета,ПолучаемыеРеквизитыПрибора);
КонецФункции

Функция ДанныеПоПрибору()
	Возврат ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета");
КонецФункции

&НаСервере
Функция ПолучитьСостояниеЛСАбонента(Организация, Район, Абонент)
	Результат = Новый Структура("Период, Состояние", Дата(1,1,1), Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Период КАК Период,
	|	энргСостояниеЛССрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&ТекДата,
	|			Абонент = &Абонент
	|				И Район = &Район
	|				И Организация = &Организация) КАК энргСостояниеЛССрезПоследних";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат =  Новый Структура("Период, Состояние", Выборка.Период, Выборка.Состояние);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Процедура УстановитьОперации()
	
	// Лицевые счета
	СоздатьКнопкуОперации("энргОперацияСЛицевымСчетом", "Открытие/ закрытие/ смена ЛС", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета, Истина);
	СоздатьКнопкуОперации("энргУстановитьКоличествоПроживающих", "Изменить кол-во проживающих", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);
	СоздатьКнопкуОперации("энргУстановитьКоличествоПрописанных", "Изменить кол-во прописанных", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);
	СоздатьКнопкуОперации("энргУстановитьКоличествоСобственников", "Изменить кол-во собственников", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);
	СоздатьКнопкуОперации("энргИзменениеСпособаДоставкиКвитанции", "Изменить способ доставки квитанции", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);
	СоздатьКнопкуОперации("энргРегистрацияВременногоОтсутствия", "Регистрация временного отсутствия", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);
	СоздатьКнопкуОперации("энргУстановитьЗначениеПлощади", "Изменить значение площади", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);
	СоздатьКнопкуОперации("энргУстановитьКоличествоКомнат", "Изменить кол-во комнат", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);	
	СоздатьКнопкуОперации("энргУстановитьВидБлагоустройстваАбонента", "Изменить вид благоустройства", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);
	СоздатьКнопкуОперации("энргУстановитьГруппуПотребителейАбонента", "Изменить тарифную категорию", Элементы.ДокументыАбонентовШапкаОперацииЛицевыеСчета);	    
	
	// Услуги
	СоздатьКнопкуОперации("энргОперацияСУслугами", "Подключение/ отключение/ ОРП/ ВРП услуг", Элементы.ДокументыАбонентовШапкаОперацииУслуги, Истина);
	СоздатьКнопкуОперации("энргУстановитьСхемуПодчиненностиТочекУчета", "Изменить схему подчиненности ТУ", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргУстановитьТехническийСтатусТочкиУчета", "Изменить тех. статус ТУ", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргУстановитьТехническуюВозможностьУстановкиПУ", "Изменить тех. возможность установки ПУ", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргУстановитьФормулуРасчетаТочекУчета", "Изменить формулу расчета ТУ", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргИзменитьПризнакРасчетаТолькоПоПоказаниям", "Изменить признак расчета только по показаниям", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргУстановитьДополнительнуюСоциальнуюНорму", "Изменить доп. соц. норму", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргРегистрацияВременногоОтключенияУслуги", "Регистрация временного отключения услуги", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргИзменитьПлательщикаУслуги", "Изменить плательщика услуги", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	СоздатьКнопкуОперации("энргСменаПоставщика", "Изменить поставщика услуг", Элементы.ДокументыАбонентовШапкаОперацииУслуги); 
	СоздатьКнопкуОперации("энргУстановитьЗначенияИзмерителей", "Установить значение измерителей", Элементы.ДокументыАбонентовШапкаОперацииУслуги);
	
	// Приборы
	СоздатьКнопкуОперации("энргОперацияСПриборомУчета", "Акт ввода/ вывода/ замены ПУ", Элементы.ДокументыАбонентовШапкаОперацииПУ, Истина);
	СоздатьКнопкуОперации("энргУстановитьВидДифференцированностиПриборУчета", "Изменить вид дифференцированности ПУ", Элементы.ДокументыАбонентовШапкаОперацииПУ);
	СоздатьКнопкуОперации("энргУстановитьДатуПоверкиПУ", "Изменить дату поверки ПУ", Элементы.ДокументыАбонентовШапкаОперацииПУ);	
		
	// Показания
	СоздатьКнопкуОперации("энргРегистрацияПоказанийАбонента", "Регистрация показаний", Элементы.ДокументыАбонентовШапкаОперацииПоказания, Истина);
	СоздатьКнопкуОперации("энргМассовыйВводПоказаний", "Массовый ввод показаний", Элементы.ДокументыАбонентовШапкаОперацииПоказания);
	СоздатьКнопкуОперации("энргЗагрузкаПоказанийИзВнешнихИсточников", "Загрузка показаний из внешних источников", Элементы.ДокументыАбонентовШапкаОперацииПоказания);
		
	// Оплата
	СоздатьКнопкуОперации("энргПриходныйКассовыйОрдер", "ПКО", Элементы.ДокументыАбонентовШапкаОперацииОплата, Истина);
	СоздатьКнопкуОперации("энргБанкротство", "Списание/ восстановление задолженности", Элементы.ДокументыАбонентовШапкаОперацииОплата);
	
	// Начисления
	СоздатьКнопкуОперации("энргПерерасчет", "Перерасчет", Элементы.ДокументыАбонентовШапкаОперацииНачисления);
	СоздатьКнопкуОперации("энргРучноеИзменениеПени", "Ручное изменение пени", Элементы.ДокументыАбонентовШапкаОперацииНачисления);
	СоздатьКнопкуОперации("энргРегистрацияРасчетаПениАбонента", "Исключение/возобновление абонентов для расчета пени", Элементы.ДокументыАбонентовШапкаОперацииНачисления);
		
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуОперации(ИмяОперации, Заголовок, Родитель, ЭтоВажное = Ложь) 
	
    Команда	= Команды.Добавить(ИмяОперации);
    Команда.Действие = "ВыполнитьОперацию";

    Кнопка = Элементы.Добавить(ИмяОперации, Тип("КнопкаФормы"), Родитель);
    Кнопка.Заголовок	= Заголовок;
    Кнопка.ИмяКоманды	= ИмяОперации;
	
	Если ЭтоВажное Тогда 
		Кнопка.ЦветФона = Новый Цвет(250,204,31);
		ЖирныйШрифт = Новый Шрифт(,,Истина);
		Кнопка.Шрифт = ЖирныйШрифт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	ОткрытьФормуНовогоДокумента(Команда.Имя, Неопределено);
КонецПроцедуры


#КонецОбласти

#Область РаботаСИсториейОплат

&НаКлиенте
Процедура ОбновитьИсториюОплатАбонента(Команда)
	ОбновитьТаблицуИсторииОплат();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуИсторииОплат()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргИсторияОплаты.Период КАК Период,
	|	энргИсторияОплаты.Регистратор КАК Регистратор,
	|	энргИсторияОплаты.Абонент КАК Абонент,
	|	энргИсторияОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА энргИсторияОплаты.СуммаПлатежа = 0
	|			ТОГДА энргИсторияОплаты.СуммаКРаспределению
	|		ИНАЧЕ энргИсторияОплаты.СуммаПлатежа
	|	КОНЕЦ КАК СуммаПлатежа,
	|	энргИсторияОплаты.ИсточникПоступления КАК ИсточникПоступления,
	|	"""" КАК Примечание,
	|	энргИсторияОплаты.СуммаАвизо КАК СуммаАвизо
	|ИЗ
	|	РегистрСведений.энргИсторияОплаты КАК энргИсторияОплаты
	|ГДЕ
	|	НЕ энргИсторияОплаты.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|	И энргИсторияОплаты.Организация = &Организация
	|	И энргИсторияОплаты.Район = &Район
	|	И энргИсторияОплаты.Абонент = &Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящие.Дата,
	|	энргПлатежноеПоручениеВходящие.Ссылка,
	|	энргПлатежноеПоручениеВходящиеОплата.Абонент,
	|	энргПлатежноеПоручениеВходящиеОплата.ДатаПлатежногоДокумента,
	|	энргПлатежноеПоручениеВходящиеОплата.СуммаОплаты,
	|	энргПлатежноеПоручениеВходящие.ИсточникПоступления,
	|	энргПлатежноеПоручениеВходящиеОплата.Примечание,
	|	энргПлатежноеПоручениеВходящиеОплата.Авизо
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.Оплата КАК энргПлатежноеПоручениеВходящиеОплата
	|		ПО энргПлатежноеПоручениеВходящие.Ссылка = энргПлатежноеПоручениеВходящиеОплата.Ссылка
	|			И (энргПлатежноеПоручениеВходящие.Проведен)
	|			И (энргПлатежноеПоручениеВходящиеОплата.Абонент = &Абонент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПлатежноеПоручениеВходящие.Дата,
	|	энргПлатежноеПоручениеВходящие.Ссылка,
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.СуммаПереноса,
	|	энргПлатежноеПоручениеВходящие.ИсточникПоступления,
	|	"""",
	|	NULL
	|ИЗ
	|	Документ.энргПлатежноеПоручениеВходящие КАК энргПлатежноеПоручениеВходящие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПлатежноеПоручениеВходящие.ПереносСуммыОплаты КАК энргПлатежноеПоручениеВходящиеПереносСуммыОплаты
	|		ПО энргПлатежноеПоручениеВходящие.Ссылка = энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.Ссылка
	|			И (энргПлатежноеПоручениеВходящиеПереносСуммыОплаты.АбонентПереноса = &Абонент)
	|			И (энргПлатежноеПоручениеВходящие.Проведен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргПерерасчет.Дата,
	|	энргПерерасчет.Ссылка,
	|	энргПерерасчет.Абонент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	NULL,
	|	энргПерерасчет.ИсточникПоступления,
	|	энргПерерасчет.Примечание,
	|	энргПерерасчетКорректировкаОплаты.СуммаВозврата
	|ИЗ
	|	Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргПерерасчет КАК энргПерерасчет
	|		ПО энргПерерасчетКорректировкаОплаты.Ссылка = энргПерерасчет.Ссылка
	|ГДЕ
	|	энргПерерасчет.Абонент = &Абонент
	|	И энргПерерасчет.ВидОперации = &ВидОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	
	Запрос.УстановитьПараметр("Организация"	, ТекОрганизация);
	Запрос.УстановитьПараметр("Район"		, текРайон);
	Запрос.УстановитьПараметр("Абонент"		, ТекАбонент);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 	
	Выборка 			= РезультатЗапроса.Выбрать();
	ТаблицаИсторияОплат.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НСтрока = ТаблицаИсторияОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
	КонецЦикла;	
КонецПроцедуры 

#КонецОбласти


#Область НОВЫЙ_РАБОЧИЙ_СТОЛ

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоТочек

&НаКлиенте
Процедура ДеревоТочекПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли; 	
	
	ТекТочкаУчета = ТекущиеДанные.ТочкаУчета;
	ТекПриборУчета = ТекущиеДанные.ПриборУчета;
	
	ОбновитьДеревоОтображенияПоУмолчанию(ТекущиеДанные, "ПриборУчета", "ДеревоОтображенияДанныхПоПУ", ДеревоОтображенияДанныхПоПУ, ДеревоДанныхПоПУ);
	ОбновитьДеревоОтображенияПоУмолчанию(ТекущиеДанные, "ТочкаУчета", "ДеревоОтображенияДанныхПоУслугам", ДеревоОтображенияДанныхПоУслугам, ДеревоДанныхПоУслугам);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоОтображенияПоУмолчанию(ТекущиеДанные, ИмяПоляПоиска, ИмяЭлементаДереваОтображения, ДеревоОтображения, ДеревоИсточник)
	
	КоллекцияСтрокВернегоУровня = ДеревоОтображения.ПолучитьЭлементы();
	КоллекцияСтрокВернегоУровня.Очистить();
	
	ЗначениеПоиска  = ТекущиеДанные[ИмяПоляПоиска];	
	СтрокиДерева 	= ДеревоИсточник.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если СтрокаДерева[ИмяПоляПоиска] = ЗначениеПоиска Тогда 			
			ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияСтрокВернегоУровня, СтрокаДерева.ПолучитьЭлементы());			
		КонецЕсли;
		
	КонецЦикла;
	
	ДеревоЭлемент = Элементы[ИмяЭлементаДереваОтображения];
	Для Каждого СтрокаДерева Из КоллекцияСтрокВернегоУровня Цикл		
		ДеревоЭлемент.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);		
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВыбораАбонентаНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Ссылка = ТекАбонент тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗадолженностиНа = ТекущаяДата();
	Организация         = Результат.Организация;
	ТекОрганизация		= Результат.Организация;
	ТекРайон 			= Результат.Район;
	Район               = Результат.Район;
	ТекКлючПомещения 	= Результат.КлючПомещения;
	ТекАбонент 			= Результат.Ссылка;
	ТекЛС				= Результат.ЛицевойСчет;	 
	
	ЗаполнитьОбщиеДанныеАбонента();	

КонецПроцедуры


#Область ВспомогательныеКлиентскиеМетоды

&НаКлиенте
Процедура УстановитьОтборыПоАбонентуСвязанныеВкладки()
	
	УстановитьОтборПоАбонентуВкладкуДокументыАбонента();
	УстановитьОтборПоАбонентуВкладкуЖильцыЛьготныхКатегорий();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхТочекУчета(Видимость)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаДанныеАбонента",
		"Видимость",
		Видимость);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СкрытьДанныеЛС",
		"Заголовок",
		?(НЕ Видимость, "Показать", "Скрыть") + " данные точек учета");	
	
	Если Видимость Тогда 
		ЗаполнитьДанныеПоТочкамУчета();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолюДереваТУ(ЕстьОРП)
// расширение	
КонецПроцедуры

&НаКлиенте
Функция ОсновныеПоляАбонента()
	
	Результат = Новый Структура;
	Результат.Вставить("ТекущаяДата"	, ТекущаяДата());
	Результат.Вставить("Организация"	, ТекОрганизация);
	Результат.Вставить("Район"			, текРайон);
	Результат.Вставить("Абонент"		, ТекАбонент);
	Результат.Вставить("КлючПомещения"	, ТекКлючПомещения);
	Результат.Вставить("Строение"		, "");

	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		ЭлементДерева = КоллекцияЭлементовДерева.Добавить();		
		ЗаполнитьЗначенияСвойств(ЭлементДерева, Строка);
		
		Если Строка.ПолучитьЭлементы().Количество() > 0 Тогда
			
			ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(ЭлементДерева.ПолучитьЭлементы(), Строка.ПолучитьЭлементы());
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#Область ЗаполнениеДанныхАбонента

&НаКлиенте
Процедура ЗаполнитьОбщиеДанныеАбонента()
	
	УстановитьОтборыПоАбонентуСвязанныеВкладки(); 	
	УстановитьВидимостьДанныхТочекУчета(Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОткрытьАбонента",
		"Заголовок",
		?(ЗначениеЗаполнено(ТекАбонент), Строка(ТекАбонент), "<Абонент не выбран>"));
	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЛицевойСчет",
		"Видимость",
		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"АдресОбъекта",
		"Видимость",
		Истина);	
		
	ПоляАбонента 			   = ОсновныеПоляАбонента();
	ДополнительныеПоляАбонента = НовыеДополнительныеПоляАбонента();
	ПоляПомещения 			   = НовыеПоляДанныхПомещения();
	
	ЗаполнитьОбщиеДанныеАбонентаНаСервере(ПоляАбонента, ДополнительныеПоляАбонента, ПоляПомещения);
	ЗаполнитьНаФормеПолученныеПоля(ДополнительныеПоляАбонента, ПоляПомещения);	
	УстановитьВидимостьСостоянияЛС();
	УстановитьВидимостьНаличияРассрочкиИСудебнойЗадолженности();
		
	ЗначенияПлощадей.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПоляПомещения.СписокПлощадей, ЗначенияПлощадей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ЗначенияПлощадей", 
		"Видимость", 
		ЗначенияПлощадей.Количество() > 0);		
		
	ЗаполнитьОбщиеДанныеАбонентаПереопределяемый(ПоляАбонента);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаФормеПолученныеПоля(ДополнительныеПоляАбонента, ПоляПомещения)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДополнительныеПоляАбонента);	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПоляПомещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбщиеДанныеАбонентаПереопределяемый(ПоляАбонента)
	// Расширение	
КонецПроцедуры

	
&НаСервереБезКонтекста
Процедура ЗаполнитьОбщиеДанныеАбонентаНаСервере(ПоляАбонента, ДополнительныеПоляАбонента, ПоляПомещения)
		
	ПолучитьДополнительныеПоляАбонента(ПоляАбонента, ДополнительныеПоляАбонента);
	ДополнитьДаннымиПомещения(ПоляАбонента, ПоляПомещения);
		
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ПолучитьДополнительныеПоляАбонента(ПоляАбонента, Результат)
	
	ПолучаемыеСвойства = "Контрагент,АдресОбъекта,АдресОбъектаБезУсловий,ВидОбъекта,МКД,Договор,Строение,Помещение";
	ПолученныеСвойства = Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(ПоляАбонента.Абонент, ПолучаемыеСвойства);
	ЗаполнитьЗначенияСвойств(Результат, ПолученныеСвойства);	
	ДополнитьДанныеКонтактнойИнформацией(Результат);
	ДополнитьСостояниеЛС(ПоляАбонента, Результат);
		
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПоляАбонента.ТекущаяДата, ПоляАбонента.Организация, ПоляАбонента.Район);
	ПоляАбонента.Вставить("МКД", ПолученныеСвойства.МКД);
	ПоляАбонента.Вставить("ПериодНачисления", ПериодНачисления);
	ПоляАбонента.Строение = ПолученныеСвойства.Строение;
	ДополнитьСуммуКОплате(ПоляАбонента, Результат);
	ДополнитьСуммуЗадолженностиНаДату(ПоляАбонента, Результат);
	ДополнитьПризнакСудебнойЗадолженности(ПоляАбонента, Результат); 
	ДополнитьПризнакРассрочкиЗадолженности(ПоляАбонента, Результат);
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ДополнитьДанныеКонтактнойИнформацией(Результат)
	
	МенеджерКИ = Справочники.ВидыКонтактнойИнформации;
	ТелефонАбонента = МенеджерКИ.ТелефонАбонента; 
	ТелефонСтационарныйАбонента = МенеджерКИ.ТелефонСтационарныйАбонента; 
	EmailАбонента = МенеджерКИ.EmailАбонента; 
	
	ОтборКИ = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(ТелефонАбонента);
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(ТелефонСтационарныйАбонента);
	ОтборКИ.ВидыКонтактнойИнформации.Добавить(EmailАбонента);
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(Результат.Контрагент, ОтборКИ);
	Для Каждого СтрокаНабора из КонтактнаяИнформация Цикл
		
		Если СтрокаНабора.Вид = ТелефонАбонента Тогда
			Результат.РабочийТелефон = СтрокаНабора.Представление;
		ИначеЕсли СтрокаНабора.Вид = ТелефонСтационарныйАбонента Тогда
			Результат.ДомашнийТелефон = СтрокаНабора.Представление;
		ИначеЕсли СтрокаНабора.Вид = EmailАбонента Тогда
			Результат.ЭлектроннаяПочта = СтрокаНабора.Представление;			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыеДополнительныеПоляАбонента()
	
	Результат = Новый Структура;
	Результат.Вставить("Помещение");
	Результат.Вставить("Контрагент");
	Результат.Вставить("АдресОбъекта");
	Результат.Вставить("АдресОбъектаБезУсловий");	
	Результат.Вставить("ВидОбъекта");
	Результат.Вставить("МКД");
	Результат.Вставить("РабочийТелефон");
	Результат.Вставить("ДомашнийТелефон");
	Результат.Вставить("ЭлектроннаяПочта");
	Результат.Вставить("СуммаКОплате", 0);
	Результат.Вставить("СуммаКОплатеПени", 0);
	Результат.Вставить("СуммаЗадолженностиНаДату", 0);	
	Результат.Вставить("СостояниеЛС", Ложь);
	Результат.Вставить("ДатаСостоянияЛС", Дата(1, 1, 1));
	Результат.Вставить("ДанныеЗадолженностиНа", Дата(1, 1, 1));
	Результат.Вставить("Договор");
	Результат.Вставить("ПризнакСудебнойЗадолженности", Ложь);
	Результат.Вставить("ПризнакРассрочкиЗадолженности", Ложь);
			
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#Область РаботаСудебнойЗадолженностьюИРассрочкой

&НаКлиенте
Процедура УстановитьВидимостьНаличияРассрочкиИСудебнойЗадолженности()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ПризнакСудебнойЗадолженностиЛожь" ,
		"Видимость" ,
		Не ЭтотОбъект.ПризнакСудебнойЗадолженности);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПризнакСудебнойЗадолженностиИстина" ,
		"Видимость" ,
		ЭтотОбъект.ПризнакСудебнойЗадолженности);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПризнакРассрочкиЗадолженностиЛожь" ,
		"Видимость" ,
		Не ЭтотОбъект.ПризнакРассрочкиЗадолженности);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПризнакРассрочкиЗадолженностиИстина" ,
		"Видимость" ,
		ЭтотОбъект.ПризнакРассрочкиЗадолженности);	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ДополнитьПризнакСудебнойЗадолженности(ПоляАбонента, Результат) 
	
	РезультатЗапроса = РегистрыСведений.энргПризнакСудебнойЗадолженностиАбонента.ПолучитьПризнакСудебнойЗадолженностиАбонента(
						ТекущаяДатаСеанса(),
						ПоляАбонента.Организация,
						ПоляАбонента.Район,
						ПоляАбонента.МКД,
						ПоляАбонента.Абонент); 
						
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	
	Выборка	= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат.ПризнакСудебнойЗадолженности	 = Выборка.ПризнакСудебнойЗадолженности;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьПризнакРассрочкиЗадолженности(ПоляАбонента, Результат) 
	
	РезультатЗапроса = РегистрыСведений.энргПризнакНаличияРассрочкиАбонента.ПолучитьПризнакНаличияРассрочкиАбонента(
						ТекущаяДатаСеанса(),
						ПоляАбонента.Организация,
						ПоляАбонента.Район,
						ПоляАбонента.МКД,
						ПоляАбонента.Абонент); 
						
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	
	Выборка	= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат.ПризнакРассрочкиЗадолженности	 = Выборка.ПризнакРассрочкиЗадолженности;	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССостояниемЛС

&НаКлиенте
Процедура УстановитьВидимостьСостоянияЛС()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СостояниеНеактивное" , "Видимость" , Не ЭтаФорма.СостояниеЛС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СостояниеАктивное" , "Видимость" , ЭтаФорма.СостояниеЛС);
		
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ДополнитьСостояниеЛС(ПоляАбонента, Результат)
	
	РезультатЗапроса = Обработки.энргАбонентыМенеджер.РезультатЗапросаСостоянияЛС(ПоляАбонента.ТекущаяДата, ПоляАбонента.Организация, ПоляАбонента.Район, ПоляАбонента.Абонент);
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка	= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат.СостояниеЛС	 = Выборка.Состояние;
	Результат.ДатаСостоянияЛС= Выборка.Период;
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСДаннымиПомещения

&НаСервереБезКонтекста
Процедура ДополнитьДаннымиПомещения(ПоляАбонента, Результат)
	
	ПакетРезультатов = энргРаботаСРабочимМестомОператора.РезультатЗапросаДанныеПомещения(ПоляАбонента.ТекущаяДата, ПоляАбонента.Организация, ПоляАбонента.Район, ПоляАбонента.КлючПомещения, ПоляАбонента.Абонент);
	ЧислоПакетов	 = ПакетРезультатов.Количество();
	
	РезультатЗапроса = ПакетРезультатов[ЧислоПакетов - 2];
	ОбработатьРезультатЗапросаКоличестваЧеловек(РезультатЗапроса, Результат);
	
	РезультатЗапроса = ПакетРезультатов[ЧислоПакетов - 1];
	ОбработатьРезультатЗапросаЗначенияПлощадей(РезультатЗапроса, Результат);
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбработатьРезультатЗапросаКоличестваЧеловек(РезультатЗапроса, Результат)
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка	= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьРезультатЗапросаЗначенияПлощадей(РезультатЗапроса, Результат)
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка	= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Новый Структура("ВидПлощади, Значение");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
		
		Результат.СписокПлощадей.Добавить(НоваяСтрока);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция НовыеПоляДанныхПомещения()
	
	Результат = Новый Структура; 	
	Результат.Вставить("КоличествоКомнат", 0);
	Результат.Вставить("КоличествоПрописанных", 0); 
	Результат.Вставить("КоличествоПроживающих", 0);
	Результат.Вставить("КоличествоСобственников", 0);
	Результат.Вставить("СписокПлощадей", Новый Массив); 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСДеньгами

&НаСервереБезКонтекста
Процедура ДополнитьСуммуКОплате(ПоляАбонента, Результат)
	
	Период = НачалоМесяца(ДобавитьМесяц(ПоляАбонента.ТекущаяДата, 1));
	Организация 		= ПоляАбонента.Организация; 
	ПериодНачисления 	= ПоляАбонента.ПериодНачисления; 
	Район 				= ПоляАбонента.Район; 
	МКД 				= ПоляАбонента.МКД; 
	Абонент 			= ПоляАбонента.Абонент; 
	
	ТЗЗадолженности	= энргРаботаСТочкамиУчетаСервер.ДанныеДляОплатыАбонента(Период, Организация, ПериодНачисления, Район, МКД, Абонент, Истина).Выгрузить();
	СуммаКОплате		= ТЗЗадолженности.Итог("Задолженность");
	СуммаКОплатеПени	= ТЗЗадолженности.Итог("ЗадолженностьПени");
	Если СуммаКОплате <= 0 Тогда		
		Аванс = энргРаботаСТочкамиУчетаСервер.ДанныеОбАвансеАбонента(Период, Организация, Район, Абонент);
		СуммаКОплате = ?(Аванс > 0, -Аванс, 0);
	КонецЕсли;	
	
	Результат.СуммаКОплате		= СуммаКОплате;
	Результат.СуммаКОплатеПени	= СуммаКОплатеПени;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьСуммуЗадолженностиНаДату(ПоляАбонента, Результат)
	ПериодНачисления 		= ПоляАбонента.ПериодНачисления;
	Организация 			= ПоляАбонента.Организация; 
	Район 					= ПоляАбонента.Район; 
	МКД 					= ПоляАбонента.МКД; 
	Абонент 				= ПоляАбонента.Абонент;
	
	ГраницыОтчетногоПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);	
	ДанныеЗадолженностиНа 	= ГраницыОтчетногоПериода.НачалоОП;	
	
	Схема = Неопределено;
	ПараметрыСхемы 	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", Новый Структура("Организация,Район,МКД,Абонент", "Организация","Район","МКД","Абонент")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	ПараметрыСхемы.Вставить("Период", Новый Структура("ИмяПараметра", "Период"));
	РегистрыНакопления.энргВзаиморасчеты.ДанныеОперативнойЗадолженности(Схема,ПараметрыСхемы,"");
	ПараметрыЗапроса = Новый Структура("Период,Организация,Район,МКД,Абонент", ДанныеЗадолженностиНа, Организация, Район, МКД, Абонент);
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат.СуммаЗадолженностиНаДату	= Выборка.Сумма;
	Результат.ДанныеЗадолженностиНа		= ДанныеЗадолженностиНа;

КонецПроцедуры

#КонецОбласти

#Область РаботаСВкладкойДокументыАбонента

&НаКлиенте
Процедура УстановитьОтборПоАбонентуВкладкуДокументыАбонента()
	
	ЗначениеЗаголовка = ?(ЗначениеЗаполнено(ТекАбонент), Строка(ТекАбонент), "<Абонент не выбран>");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОткрытьАбонента",
		"Заголовок",
		ЗначениеЗаголовка);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДокументыАбонента, "Абонент", ТекАбонент);
	Для каждого эл из ДокументыАбонента.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если эл.ПредставлениеПользовательскойНастройки = "ЗаполнениеАбонент" Тогда
			эл.ПравоеЗначение = ТекАбонент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСВкладкойЖильцыЛьготныхКатегорий

&НаКлиенте
Процедура УстановитьОтборПоАбонентуВкладкуЖильцыЛьготныхКатегорий()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ЖильцыЛьготныхКатегорий,
		"Абонент",
		ТекАбонент);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		ЖильцыЛьготныхКатегорий,
		"Период",
		ТекущаяДата());
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСТочкамиУчета

&НаКлиенте
Процедура ЗаполнитьДанныеПоТочкамУчета()
	
	Если НЕ ЗначениеЗаполнено(ТекАбонент) Тогда 
		Возврат;
	КонецЕсли;
	
	ОчиститьКоллекции();
	
	ПоляАбонента = ОсновныеПоляАбонента();
	ПоляАбонента.Вставить("КоличествоКомнат",		КоличествоКомнат);
	ПоляАбонента.Вставить("КоличествоПроживающих",	КоличествоПроживающих);
	ПоляАбонента.Вставить("КоличествоПрописанных",	КоличествоПрописанных);
	ПоляАбонента.Вставить("КоличествоСобственников",КоличествоСобственников);	
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = ЗапуститьФоновоеЗаданиеПолученияДанныхПоТочкамУчета(УникальныйИдентификатор, ПоляАбонента, ТочкиУчета, ШкалыПриборовУчета, ПоказанияПриборовУчета);;

	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет получение данных";
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииПоискаНастроек", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииПоискаНастроек(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		ПоказатьПредупреждение( ,Результат.КраткоеПредставлениеОшибки);
		
		Возврат;
	КонецЕсли;
	
	РезультатПреобразования = ОбновитьДеревьяДанныхТочекУчета(Результат, ДеревоТочек, ДеревоДанныхПоПУ, ДеревоДанныхПоУслугам);
	УстановитьВидимостьПолюДереваТУ(РезультатПреобразования.ЕстьОРП);
	
	СтрокаДерева = ДеревоТочек.ПолучитьЭлементы();
	ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, РезультатПреобразования.ДеревоТочек.ПолучитьЭлементы());
	
	СтрокаДерева = ДеревоДанныхПоПУ.ПолучитьЭлементы();
	ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, РезультатПреобразования.ДеревоДанныхПоПУ.ПолучитьЭлементы());
	
	СтрокаДерева = ДеревоДанныхПоУслугам.ПолучитьЭлементы();
	ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, РезультатПреобразования.ДеревоДанныхПоУслугам.ПолучитьЭлементы());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьДеревьяДанныхТочекУчета(Результат, Знач ДеревоТочек, Знач ДеревоДанныхПоПУ, Знач ДеревоДанныхПоУслугам)
	
	ДанныеВременногоХранилища = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	
	СтрокаДерева = ДеревоТочек.ПолучитьЭлементы();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеВременногоХранилища.ДеревоТочек);
	
	СтрокаДерева = ДеревоДанныхПоПУ.ПолучитьЭлементы();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеВременногоХранилища.ДеревоДанныхПоПУ);
	
	СтрокаДерева = ДеревоДанныхПоУслугам.ПолучитьЭлементы();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(СтрокаДерева, ДанныеВременногоХранилища.ДеревоДанныхПоУслугам); 	
	
	Возврат Новый Структура("ДеревоТочек, ДеревоДанныхПоПУ, ДеревоДанныхПоУслугам, ЕстьОРП", ДеревоТочек, ДеревоДанныхПоПУ, ДеревоДанныхПоУслугам, ДанныеВременногоХранилища.ЕстьОРП);
	
КонецФункции



&НаСервереБезКонтекста
Функция ЗапуститьФоновоеЗаданиеПолученияДанныхПоТочкамУчета(УникальныйИдентификатор, ПоляАбонента, Знач ТочкиУчетаОригинал, Знач ШкалыПриборовУчетаОригинал, Знач ПоказанияПриборовУчетаОригинал)	
		
	ТочкиУчета 				= ТочкиУчетаОригинал.Выгрузить();
	ШкалыПриборовУчета 		= ШкалыПриборовУчетаОригинал.Выгрузить();
	ПоказанияПриборовУчета 	= ПоказанияПриборовУчетаОригинал.Выгрузить();
	
	ДеревоТочек 			= НовоеДеревоТочекУчета();	
	ДеревоДанныхПоПУ 		= НовоеДеревоПриборовУчета();	
	ДеревоДанныхПоУслугам 	= НовоеДеревоДетализацииУслуг();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных точек учета рабочего стола'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"энргРаботаСРабочимМестомОператора.ЗаполнитьДанныеТочекУчета",
		ПоляАбонента, 
		ДеревоТочек, 
		ДеревоДанныхПоПУ, 
		ДеревоДанныхПоУслугам, 
		ТочкиУчета, 
		ШкалыПриборовУчета, 
		ПоказанияПриборовУчета);
	
	Возврат ДлительнаяОперация;
	
КонецФункции 

&НаСервереБезКонтекста
Функция НовоеДеревоТочекУчета()
	
	Результат = Новый ДеревоЗначений;	
	Результат.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));
	Результат.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
	Результат.Колонки.Добавить("ПриборУчета", Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	Результат.Колонки.Добавить("НаправлениеИспользованияТУ", Новый ОписаниеТипов("СправочникСсылка.энргНаправлениеИспользованияТочекУчета"));
	Результат.Колонки.Добавить("НетВозможностьУстановкиПУ", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("РасчетТолькоПоПоказаниям", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Техническая", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СтруктураСети", Новый ОписаниеТипов("СправочникСсылка.бестСтруктураСети"));
	Результат.Колонки.Добавить("Абонент", Новый ОписаниеТипов("СправочникСсылка.энргАбоненты"));
	Результат.Колонки.Добавить("СлужебноеПоле", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Результат.Колонки.Добавить("ПериодСостоянияТУ" , Новый ОписаниеТипов("Дата"));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовоеДеревоПриборовУчета()
	
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("Значение1", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Результат.Колонки.Добавить("Значение2", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Результат.Колонки.Добавить("Значение3", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Результат.Колонки.Добавить("ПриборУчета", Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовоеДеревоДетализацииУслуг()
	
	ОсновнаяКолонкаТипы = Новый Массив;
	ОсновнаяКолонкаТипы.Добавить("Строка");
    ОсновнаяКолонкаТипы.Добавить("СправочникСсылка.энргВидыУслуг");
	ОсновнаяКолонкаТипы.Добавить("СправочникСсылка.энргТарифныеЗоны");
	ОписаниеСоставногоТипа = Новый ОписаниеТипов(ОсновнаяКолонкаТипы);
	
	ЗначенияКолонкаТипы = Новый Массив;
	ЗначенияКолонкаТипы.Добавить("Строка");
    ЗначенияКолонкаТипы.Добавить("СправочникСсылка.энргГруппыПотребителей");
	ЗначенияКолонкаТипы.Добавить("СправочникСсылка.энргВидыБлагоустройств");
	ЗначенияКолонкаТипы.Добавить("СправочникСсылка.энргКонтрагенты");
	ОписаниеСоставногоТипаЗначения = Новый ОписаниеТипов(ЗначенияКолонкаТипы);
	
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("ТочкаУчета", Новый ОписаниеТипов("СправочникСсылка.энргТочкиУчета"));    	
	Результат.Колонки.Добавить("Услуга", ОписаниеСоставногоТипа);
	Результат.Колонки.Добавить("Значение1", ОписаниеСоставногоТипаЗначения);
	Результат.Колонки.Добавить("Значение2", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ОчиститьКоллекции()
	
	ДеревоТочек.ПолучитьЭлементы().Очистить();
	ДеревоДанныхПоПУ.ПолучитьЭлементы().Очистить();
	ДеревоОтображенияДанныхПоПУ.ПолучитьЭлементы().Очистить();
	ДеревоДанныхПоУслугам.ПолучитьЭлементы().Очистить();
	ДеревоОтображенияДанныхПоУслугам.ПолучитьЭлементы().Очистить(); 
	
	ТочкиУчета.Очистить();
	ШкалыПриборовУчета.Очистить();
	ПоказанияПриборовУчета.Очистить();
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецОбласти





