#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	МаксимальноВозможныеПоказания = 0;
	Если ЗначениеЗаполнено(ТипПрибораУчета) Тогда
		ЗаполнитьМаксимальноВозможныеПоказания();
	КонецЕсли; 
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьМаксимальноВозможныеПоказания()
	
	ВозвестиВСтепень = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипПрибораУчета, "РазрядностьДоЗапятой");
	МаксимальноВозможныеПоказания = pow(10, ВозвестиВСтепень);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли