#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
Функция ПолучитьДоступныеДокументыОплатыДляКорректировки(Период, Организация, Район, МКД, Абонент, ТекущийДокумент) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргИсторияОплаты.Регистратор КАК Регистратор,
	|	энргИсторияОплаты.Организация КАК Организация,
	|	энргИсторияОплаты.Район КАК Район,
	|	энргИсторияОплаты.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА энргИсторияОплаты.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА энргИсторияОплаты.СуммаКРаспределению
	|		ИНАЧЕ энргИсторияОплаты.СуммаПлатежа
	|	КОНЕЦ КАК СуммаПлатежа,
	|	энргИсторияОплаты.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ ДокументыОплатыАбонента
	|ИЗ
	|	РегистрСведений.энргИсторияОплаты КАК энргИсторияОплаты
	|ГДЕ
	|	энргИсторияОплаты.Период < &Период
	|	И энргИсторияОплаты.Организация = &Организация
	|	И энргИсторияОплаты.Район = &Район
	|	И энргИсторияОплаты.Абонент = &Абонент
	|	И ВЫБОР
	|			КОГДА энргИсторияОплаты.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|				ТОГДА энргИсторияОплаты.СуммаКРаспределению
	|			ИНАЧЕ энргИсторияОплаты.СуммаПлатежа
	|		КОНЕЦ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргПерерасчет.Ссылка,
	|	энргПерерасчет.Организация,
	|	энргПерерасчет.Район,
	|	энргВзаиморасчеты.Абонент,
	|	энргВзаиморасчеты.Сумма,
	|	0
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
	|		ПО энргПерерасчет.Ссылка = энргВзаиморасчеты.Регистратор
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|			И (энргВзаиморасчеты.Период < &Период)
	|			И (энргВзаиморасчеты.Организация = &Организация)
	|			И (энргВзаиморасчеты.Район = &Район)
	|			И (энргВзаиморасчеты.МКД = &МКД)
	|			И (энргВзаиморасчеты.Абонент = &Абонент)
	|			И (энргВзаиморасчеты.Сумма > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыОплатыАбонента.Регистратор КАК ДокументОплаты,
	|	ДокументыОплатыАбонента.Абонент КАК Абонент,
	|	ДокументыОплатыАбонента.СуммаПлатежа КАК Сумма,
	|	ДокументыОплатыАбонента.Разделитель КАК Разделитель
	|ИЗ
	|	ДокументыОплатыАбонента КАК ДокументыОплатыАбонента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ПО ДокументыОплатыАбонента.Регистратор = энргПерерасчетКорректировкаОплаты.ДокументОплаты
	|			И ДокументыОплатыАбонента.Разделитель = энргПерерасчетКорректировкаОплаты.Разделитель
	|			И (НЕ энргПерерасчетКорректировкаОплаты.Ссылка.ПометкаУдаления)
	|			И (НЕ энргПерерасчетКорректировкаОплаты.Ссылка = &ТекущийДокумент)
	|			И (энргПерерасчетКорректировкаОплаты.Ссылка.Абонент = &Абонент)
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.ДокументОплаты ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыОплатыАбонента.Регистратор.Дата,
	|	ДокументыОплатыАбонента.Разделитель";
	
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Район"			, Район);
	Запрос.УстановитьПараметр("МКД"				, МКД);
	Запрос.УстановитьПараметр("Абонент"			, Абонент);
	Запрос.УстановитьПараметр("ТекущийДокумент"	, ТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьРаспределениеДокументовОплаты(ТЗДокументыОплат, Абонент) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗДокументыОплат.ДокументОплаты КАК ДокументОплаты,
		|	ТЗДокументыОплат.Разделитель КАК Разделитель,
		|	&Абонент КАК Абонент
		|ПОМЕСТИТЬ ДокументыОплаты
		|ИЗ
		|	&ТЗДокументыОплат КАК ТЗДокументыОплат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
		|	ДокументыОплаты.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцам.Услуга КАК Услуга,
		|	энргВзаиморасчетыПоМесяцам.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцам.Поставщик КАК Поставщик,
		|	энргВзаиморасчетыПоМесяцам.Сумма КАК СуммаОплаты,
		|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг) КАК ВидЗадолженности
		|ИЗ
		|	ДокументыОплаты КАК ДокументыОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
		|		ПО ДокументыОплаты.ДокументОплаты = энргВзаиморасчетыПоМесяцам.Регистратор
		|			И ДокументыОплаты.Разделитель = энргВзаиморасчетыПоМесяцам.Разделитель
		|			И ДокументыОплаты.Абонент = энргВзаиморасчетыПоМесяцам.Абонент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОплаты";
	
	Запрос.УстановитьПараметр("ТЗДокументыОплат", ТЗДокументыОплат);
	Запрос.УстановитьПараметр("Абонент"			, Абонент);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#КонецЕсли