#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестСписаниеВосстановлениеЗадолженности(ЭтотОбъект);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ОпределитьПериодНачисления();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти 

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)	
	ОпределитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОперацииПриИзменении(Элемент)
	ЗаполнитьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ЗаполнитьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииПриИзменении(Элемент)
	ОпределитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ОпределитьПериодНачисления();
КонецПроцедуры

#КонецОбласти 

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ОпределитьПериодНачисления()
	Если ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Район) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТЧ()
	Объект.ДанныеЗадолженности.Очистить();
	
	Если Объект.ВидОперации = Перечисления.бестВидыОпераций.СписаниеВосстановлениеЗадолженности_ВосстановлениеЗадолженности Тогда
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьСписаннуюЗадолженность(Объект.Организация,Объект.Район,Объект.Договор,Объект.ДатаОперации);
		Выборка = Результат.выбрать();
		Пока Выборка.Следующий() Цикл 
			НовСтр = Объект.ДанныеЗадолженности.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;
	ИначеЕсли Объект.ВидОперации = Перечисления.бестВидыОпераций.СписаниеВосстановлениеЗадолженности_СписаниеЗадолженности Тогда
		
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьПоПериодам(Объект.Организация,Объект.Район,Объект.Договор,,,Объект.ДатаОперации);
		Выборка = Результат.выбрать();
		Пока Выборка.Следующий() Цикл 
			НовСтр = Объект.ДанныеЗадолженности.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			НовСтр.Сумма = Выборка.Задолженность;
		КонецЦикла;
		
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюПоПериодам(Объект.Организация,Объект.Район,Объект.Договор,,,Объект.ДатаОперации);
		Выборка = Результат.выбрать();
		Пока Выборка.Следующий() Цикл 
			НовСтр = Объект.ДанныеЗадолженности.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			НовСтр.Сумма = Выборка.Задолженность;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.СписаниеВосстановлениеЗадолженности_ВосстановлениеЗадолженности") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеЗадолженностиСумма", "ТолькоПросмотр", Ложь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти