
#Область События_Формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДинамическуюТЧ();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект, "ЗагруженныеДанные, ЗагруженныеДанные1, Показания, Показания1");
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьТЧ();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	бестРаботаСНезависимымСбытом.ДополнительныеПараметрыЗаписиДатыИзменения(ТекущийОбъект, ЭтотОбъект.Модифицированность, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область События_Шапки 

#КонецОбласти

#Область События_ТЧ_ЗагруженныеДанныеПочасовые 

&НаКлиенте
Процедура ЗагруженныеДанныеПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ЗагруженныеДанные.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТЗПредоставленныеОбъемы,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

#КонецОбласти

#Область События_ТЧ_НезагруженныеДанныеПочасовые 

//&НаКлиенте
//Процедура НезагруженныеДанныеПочасовыеПриАктивизацииСтроки(Элемент)
//	ТекДанные = Элементы.НезагруженныеДанныеПочасовые.ТекущиеДанные;
//	Если ТекДанные = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТЗПредоставленныеОбъемыНезагруженные,		Неопределено,		ТекДанные.IDСтроки);
//КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьДинамическуюТЧ()
	Для каждого стр из Объект.ПредоставленныеОбъемы Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("День", стр.День);
		ПараметрыОтбора.Вставить("IDСтроки", стр.IDСтроки);
		НайденныеСтроки = ТЗПредоставленныеОбъемы.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			ЗаполняемаяСтрока = ТЗПредоставленныеОбъемы.Добавить();
			ЗаполняемаяСтрока.День 				= стр.День;
			ЗаполняемаяСтрока.IDСтроки 			= стр.IDСтроки;
		Иначе
			ЗаполняемаяСтрока = НайденныеСтроки[0];
		КонецЕсли;
		ЗаполняемаяСтрока["Час" + стр.Час] 	= стр.Объем;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТЧ()
	Объект.ПредоставленныеОбъемы.Очистить();
	Для каждого стр Из ТЗПредоставленныеОбъемы Цикл
		ТекущийЧас = 0;
		Пока ТекущийЧас <= 23 Цикл
			НовСтр = Объект.ПредоставленныеОбъемы.Добавить();
			НовСтр.День 		= стр.День;
			НовСтр.Объем 		= стр["Час" + ТекущийЧас];
			НовСтр.Час 			= ТекущийЧас;
			НовСтр.IDСтроки 	= стр.IDСтроки;
			ТекущийЧас = ТекущийЧас + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьРегистрацииПоказанийНаСервере()
	Документы.бестЗагруженныеДанныеИзВнешнихИсточников.СоздатьРегистрацииПоказаний(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура СоздатьПочасовыеВедомостиНаСервере()
	ДокументыСозданы = Документы.бестЗагруженныеДанныеИзВнешнихИсточников.СоздатьПочасовыеВедомости(Объект.Ссылка);
	Если ДокументыСозданы Тогда
		ОбщегоНазначения.СообщитьПользователю("Документы созданы");
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Документы не созданы");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ЗаписатьТЧ();
	ДокОбъект = РеквизитФормыВЗначение("Объект");   
	ДокОбъект.ЗаместитьИнформацию();
    ЗначениеВРеквизитФормы(ДокОбъект, "Объект"); 
	ЗаполнитьДинамическуюТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеЗаписи(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		Записать();
		Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьПочасовыеВедомостиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРегистрацииПоказаний(Команда)
	СоздатьРегистрацииПоказанийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПочасовыеВедомости(Команда)
	Если Модифицированность Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Данные еще не записаны.
			|Выполнение действия ""%1"" возможно только после записи данных.
			|Данные будут записаны.'"),
			"Создание почасовых ведомостей");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеЗаписи", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	СоздатьПочасовыеВедомостиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
