
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	бестЛокализацияСервер.ПриСозданииНаСервере_бестЗаписиКнигПродажПокупок(ЭтотОбъект);
	
	НастроитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область СобытияШапки

&НаКлиенте
Процедура ПериодФормированияПриИзменении(Элемент)
	 Объект.ПериодФормирования = НачалоМесяца(Объект.ПериодФормирования);
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.ЗаписиКниги.Очистить();
	
	РезультатЗапроса = Документы.бестЗаписиКнигПродажПокупок.ПолучитьДанныеКниг(Объект.Организация, Объект.Район, Объект.ПериодФормирования, Объект.ВидОперации);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.ЗаписиКниги.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимость()
	Если Объект.ВидОперации = Перечисления.бестВидыОпераций.ЗаписиКнигПродажПокупок_КнигаПокупок Тогда
		Элементы.КнигаПродаж.Видимость = Ложь;
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестЗаписиКнигПродажПокупокКнигаПродаж.Видимость = Ложь;
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестЗаписиКнигПродажПокупокДопЛист.Видимость = Ложь;
	Иначе
		Элементы.КнигаПокупок.Видимость = Ложь;
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументбестЗаписиКнигПродажПокупокКнигаПокупок.Видимость = Ложь; 
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
