#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерефейса_Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса = Новый Структура;
	Схема = Неопределено;
	
	ДобавитьТекстЗапросаПризнакСудебнойЗадолженности(Схема, Регистры);
	ДобавитьТекстЗапросаАбонентыИДолжники(Схема, Регистры);
	
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПризнакСудебнойЗадолженности(Схема, Регистры)
	
	ИмяРегистра = "энргПризнакСудебнойЗадолженностиАбонента";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Дата КАК Период,
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Ссылка КАК Регистратор,
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Организация КАК Организация,
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Абонент КАК Абонент,
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.ПризнакСудебнойЗадолженности КАК ПризнакСудебнойЗадолженности
	|ИЗ
	|	Документ.энргУстановитьПризнакСудебнойЗадолженностиАбонента КАК энргУстановитьПризнакСудебнойЗадолженностиАбонента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО энргУстановитьПризнакСудебнойЗадолженностиАбонента.КлючПомещения = энргКлючиПомещений.Ссылка
	|ГДЕ
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Ссылка = &Документ";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры 

Процедура ДобавитьТекстЗапросаАбонентыИДолжники(Схема, Регистры)
	
	ИмяРегистра = "энргСобственникиИДолжники";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда                  		
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
    Текст  	= 
	"ВЫБРАТЬ
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Дата КАК Период,
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Ссылка КАК Регистратор,
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Абонент КАК Абонент,
	|	ЕСТЬNULL(энргУстановитьПризнакСудебнойЗадолженностиАбонентаСписокДолжников.Должник, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Должник
	|ИЗ
	|	Документ.энргУстановитьПризнакСудебнойЗадолженностиАбонента КАК энргУстановитьПризнакСудебнойЗадолженностиАбонента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргУстановитьПризнакСудебнойЗадолженностиАбонента.СписокДолжников КАК энргУстановитьПризнакСудебнойЗадолженностиАбонентаСписокДолжников
	|		ПО (энргУстановитьПризнакСудебнойЗадолженностиАбонентаСписокДолжников.Ссылка = энргУстановитьПризнакСудебнойЗадолженностиАбонента.Ссылка)
	|ГДЕ
	|	энргУстановитьПризнакСудебнойЗадолженностиАбонента.Ссылка = &Документ";		
	
	Пакет.УстановитьТекстЗапроса(Текст);	
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти

#КонецЕсли