#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает параметры измерителя.
//
// Параметры:
//  Период		-	Дата.
//  Измеритель	-	СправочникСсылка.энргПриборыУчетаАбонента.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ВернутьПараметрыИзмерителя(Период, Измеритель) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПараметрыИзмерителейСрезПоследних.ВидПараметра КАК ВидПараметра
		|ИЗ
		|	РегистрСведений.бестПараметрыИзмерителей.СрезПоследних(&Период, Измеритель = &Измеритель) КАК бестПараметрыИзмерителейСрезПоследних";
	
	Запрос.УстановитьПараметр("Измеритель"	, Измеритель);
	Запрос.УстановитьПараметр("Период"		, Период);
	
	Возврат Запрос.Выполнить(); 	

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает параметры измерителя абонента
//
// Параметры:
//  ПараметрыЗапроса	-	Структура.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ВернутьПараметрыИзмерителяАбонента(ПараметрыЗапроса) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПриборыУзловУчетаСрезПоследних.ПриборУчета КАК Измеритель
		|ПОМЕСТИТЬ ВТ_ПриборыУзловУчета
		|ИЗ
		|	РегистрСведений.энргПриборыУзловУчета.СрезПоследних(&Период, Организация = &Организация И Район = &Район И КлючПомещения = &КлючПомещения И ТочкаУчета = &ТочкаУчета И  УзелУчета = &Измеритель) КАК энргПриборыУзловУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргСостояниеПриборовУзловУчетаАбонентаСрезПоследних.ПриборУчета КАК ПриборУчета
		|ПОМЕСТИТЬ ВТ_СостоянияПУ
		|ИЗ
		|	РегистрСведений.энргСостояниеПриборовУзловУчетаАбонента.СрезПоследних(
		|			&Период,
		|			Организация = &Организация И Район = &Район И КлючПомещения = &КлючПомещения И ТочкаУчета = &ТочкаУчета И УзелУчета = &Измеритель
		|				И ПриборУчета В
		|					(ВЫБРАТЬ
		|						ВТ_ПриборыУзловУчета.Измеритель КАК Измеритель
		|					ИЗ
		|						ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета)) КАК энргСостояниеПриборовУзловУчетаАбонентаСрезПоследних
		|ГДЕ
		|	энргСостояниеПриборовУзловУчетаАбонентаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Измерители.Измеритель КАК Измеритель
		|ПОМЕСТИТЬ ВТ_Измерители
		|ИЗ
		|	ВТ_ПриборыУзловУчета КАК ВТ_Измерители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СостоянияПУ КАК ВТ_СостоянияПУ
		|		ПО ВТ_Измерители.Измеритель = ВТ_СостоянияПУ.ПриборУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестПараметрыИзмерителей.ВидПараметра КАК ВидПараметра,
		|	бестПараметрыИзмерителей.ТипТемпературы КАК ТипТемпературы
		|ИЗ
		|	ВТ_ПриборыУзловУчета КАК ВТ_Измерители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПараметрыИзмерителей КАК бестПараметрыИзмерителей
		|		ПО ВТ_Измерители.Измеритель = бестПараметрыИзмерителей.Измеритель
		|ГДЕ
		|	бестПараметрыИзмерителей.Измеритель В
		|			(ВЫБРАТЬ
		|				ВТ_Измерители.Измеритель КАК Измеритель
		|			ИЗ
		|				ВТ_Измерители КАК ВТ_Измерители)";
	
	Для Каждого ТекПараметр из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	Возврат Запрос.Выполнить(); 	

КонецФункции

#КонецОбласти

#КонецЕсли