#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить данные ведомости
//
// Параметры:
//  Организация				 - СправочникСсылка.Организации  
//  ПериодНачисления		 - Дата 
//  Район					 - СправочникСсылка.энргЗоныОтвественности
//  МКД						 - СправочникСсылка.энргСтроения
//  ИсключаяОтдельностоящие	 - Булево 
//  Период					 - Дата 
// 
// Возвращаемое значение:
//   ТаблицаЗначений 
//
Функция ПолучитьДанныеВедомости(Организация,ПериодНачисления,Район,МКД,ИсключаяОтдельностоящие, Период) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПриборУчета КАК УзелУчета,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВидПараметра КАК ВидПараметра,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Шкала КАК Шкала,
		|	бестПараметрыИзмерителейСрезПоследних.ТипТемпературы КАК ТипТемпературы,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ЗначениеПараметра КАК ЗначениеПараметра,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПериодНачисления КАК ПериодНачисления,
		|	бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВНР КАК ВНР
		|ПОМЕСТИТЬ ДанныеСуточнойВедомости
		|ИЗ
		|	РегистрСведений.бестИтоговыеЗначенияПараметровСуточнойВедомости.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД
		|				И (ПериодНачисления = &ПериодНачисления
		|					ИЛИ ПериодНачисления = &ПредПериодНачисления)) КАК бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПараметрыИзмерителей.СрезПоследних(&Период, ) КАК бестПараметрыИзмерителейСрезПоследних
		|		ПО бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.Шкала = бестПараметрыИзмерителейСрезПоследних.Шкала
		|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ПриборУчета = бестПараметрыИзмерителейСрезПоследних.Измеритель
		|			И бестИтоговыеЗначенияПараметровСуточнойВедомостиСрезПоследних.ВидПараметра = бестПараметрыИзмерителейСрезПоследних.ВидПараметра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСуточнойВедомости.ОбъектРасчета КАК ОбъектРасчета,
		|	ДанныеСуточнойВедомости.УзелУчета КАК УзелУчета,
		|	ДанныеСуточнойВедомости.ВидПараметра КАК ВидПараметра,
		|	ДанныеСуточнойВедомости.Шкала КАК Шкала,
		|	ДанныеСуточнойВедомости.ЗначениеПараметра КАК ЗначениеПараметра,
		|	ЕСТЬNULL(бестПлотностиВоды.Плотность, 0) КАК ПлотностьПодающейСетевойВоды,
		|	0 КАК ПлотностьОбратнойСетевойВоды,
		|	ДанныеСуточнойВедомости.ПериодНачисления КАК ПериодНачисления,
		|	ДанныеСуточнойВедомости.ВНР КАК ВНР
		|ИЗ
		|	ДанныеСуточнойВедомости КАК ДанныеСуточнойВедомости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
		|		ПО ((ВЫРАЗИТЬ(ДанныеСуточнойВедомости.ЗначениеПараметра КАК ЧИСЛО(10, 1))) = бестПлотностиВоды.Температура)
		|			И (ДанныеСуточнойВедомости.ТипТемпературы = ЗНАЧЕНИЕ(Перечисление.бестТипыТемператур.ТемператураПодачи))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСуточнойВедомости.ОбъектРасчета,
		|	ДанныеСуточнойВедомости.УзелУчета,
		|	ДанныеСуточнойВедомости.ВидПараметра,
		|	ДанныеСуточнойВедомости.Шкала,
		|	ДанныеСуточнойВедомости.ЗначениеПараметра,
		|	0,
		|	ЕСТЬNULL(бестПлотностиВоды.Плотность, 0),
		|	ДанныеСуточнойВедомости.ПериодНачисления,
		|	ДанныеСуточнойВедомости.ВНР
		|ИЗ
		|	ДанныеСуточнойВедомости КАК ДанныеСуточнойВедомости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
		|		ПО ((ВЫРАЗИТЬ(ДанныеСуточнойВедомости.ЗначениеПараметра КАК ЧИСЛО(10, 1))) = бестПлотностиВоды.Температура)
		|			И (ДанныеСуточнойВедомости.ТипТемпературы = ЗНАЧЕНИЕ(Перечисление.бестТипыТемператур.ТемператураОбратнойСетевойВоды))";
	
	Запрос.УстановитьПараметр("МКД", 					МКД);
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("Период", 				Период);
	Запрос.УстановитьПараметр("ПериодНачисления", 		ПериодНачисления);
	Запрос.УстановитьПараметр("ПредПериодНачисления", 	ДобавитьМесяц(ПериодНачисления, -1));
	Запрос.УстановитьПараметр("Район", 					Район);
	
	Если ИсключаяОтдельностоящие тогда		
		Запрос.Текст 		= СтрЗаменить(Запрос.Текст,"МКД = &МКД","МКД <> &МКД");
	Иначе
		Если МКД = Неопределено Тогда 
			Запрос.Текст 	= СтрЗаменить(Запрос.Текст,"МКД = &МКД","ИСТИНА");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

#КонецОбласти

#КонецЕсли