#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет актуальные данные срез последних.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция АктуальныеДанныеСрезПоследних(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаАктуальныеДанныеСрезПоследних());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	ОператорВыбора 				= Пакет.Операторы[0];	
	Источник 					= ОператорВыбора.Источники[0].Источник;
	Параметры 					= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод = Параметры[0];
		ПараметрПериод.Выражение = Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		ДоступныеПараметры = "Организация, Район, Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(
			Параметры[1],
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры);
			
		ДоступныеПараметры = "СпособРасчета";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(
			ОператорВыбора.Отбор, 
			"ТаблицаСрезПоследних", 
			ПараметрыОтбора.ПараметрыВТ,
			ДоступныеПараметры,, 
			Пакет.Операторы);	
				
	КонецЕсли;	 	
			
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса актуальные данные срез последних.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаАктуальныеДанныеСрезПоследних() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Организация КАК Организация,
	|	ТаблицаСрезПоследних.Район КАК Район,
	|	ТаблицаСрезПоследних.Услуга КАК Услуга,
	|	ТаблицаСрезПоследних.СпособРасчета КАК СпособРасчета
	|ИЗ
	|	РегистрСведений.энргТерриториальныеСпособыРасчета.СрезПоследних КАК ТаблицаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли