#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОтложенныеДвиженияДокументов(ОсновныеПараметры, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ РазрешеноВыполнятьОперацию(ОсновныеПараметры) Тогда 
		Возврат;
	КонецЕсли;
	
	ГраницыПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(
		ОсновныеПараметры.Организация, 
		ОсновныеПараметры.Район, 
		ОсновныеПараметры.ПериодНачисления, 
		Ложь);
	
	МВТ = Новый МенеджерВременныхТаблиц;	
	РезультатЗапроса = РезультатНачальныеОстаткиСтабильногоПериода(
		МВТ,
		ОсновныеПараметры,
		ГраницыПериода.НачалоОП);
		
		
	Выборка = РезультатЗапроса[0].Выбрать();	
	Если Выборка.Количество() = 0 тогда		
		
		ПересчитатьСреднийОбъемПотребления(ОсновныеПараметры);	
		ОчиститьДанныеПриПустомРезультатеЗапроса(ОсновныеПараметры, МВТ, ДополнительныеПараметры);
		Возврат;
		
	КонецЕсли;	
		
	МВТ.Закрыть(); 	
	
	Контекст = Новый Структура;
	ЗаполнитьКонтекст(Контекст, РезультатЗапроса);
	ОбработатьДанные(ОсновныеПараметры, Выборка, Контекст, ДополнительныеПараметры);		
	
	Если Контекст.Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Контекст.Ошибки, Символы.ПС);
	КонецЕсли;
	
	ПересчитатьСреднийОбъемПотребления(ОсновныеПараметры);	
	
КонецПроцедуры

Функция НовыеОсновныеПараметры() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПериодНачисления", Дата(1, 1, 1));
	Результат.Вставить("Организация", Справочники.Организации.НашаОрганизация);
	Результат.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());	
	Результат.Вставить("ЧастныйСектор", Неопределено);
	Результат.Вставить("Строение", Неопределено);
	Результат.Вставить("Помещение", Неопределено);	
	Результат.Вставить("Строения", Неопределено);
	Результат.Вставить("СбрасыватьСостояниеПоследовательности", Истина);
	
	Возврат Результат
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Валидация

Функция РазрешеноВыполнятьОперацию(ПроверяемыеПоля)
	
	Если НЕ ЗначениеЗаполнено(ПроверяемыеПоля.ПериодНачисления) ИЛИ НЕ ЗначениеЗаполнено(ПроверяемыеПоля.Район) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектПроверки = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ОбъектПроверки.Организация = ПроверяемыеПоля.Организация;
	ОбъектПроверки.Дата	= ПроверяемыеПоля.ПериодНачисления;
	ОбъектПроверки.Район = ПроверяемыеПоля.Район;
	
	Отказ = энргДатыЗапретаИзмененияПереопределяемый.ЗапрещеноИзменятьДанные(ОбъектПроверки);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Для пользователя " + Пользователи.ТекущийПользователь() + 
			" район " + ПроверяемыеПоля.Район + " период " + ПроверяемыеПоля.ПериодНачисления + 
			" закрыт для редактирования");
	КонецЕсли; 		
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанных

Функция РезультатНачальныеОстаткиСтабильногоПериода(МВТ, ОсновныеПараметры, ПериодРегистрации)
	
	Организация = ОсновныеПараметры.Организация;
	ПериодНачисления = ОсновныеПараметры.ПериодНачисления;
	Район = ОсновныеПараметры.Район;
	Строение = ОсновныеПараметры.Строение;
	Помещение = ОсновныеПараметры.Помещение;
	
	
	Разделить = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Текст 	=
	"ВЫБРАТЬ
	|	ОтложенныеДвиженияДокументов.Организация КАК Организация,
	|	ОтложенныеДвиженияДокументов.ПериодНачисления КАК ПериодНачисления,
	|	ОтложенныеДвиженияДокументов.Район КАК Район,
	|	ОтложенныеДвиженияДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	ОтложенныеДвиженияДокументов.Строение КАК Строение,
	|	ОтложенныеДвиженияДокументов.ДокРегистратор КАК ДокРегистратор,
	|	ОтложенныеДвиженияДокументов.ДатаРегистратора КАК ДатаРегистратора
	|ПОМЕСТИТЬ ДокументыДляПроведения
	|ИЗ
	|	РегистрСведений.энргОтложенныеДвиженияДокументов КАК ОтложенныеДвиженияДокументов
	|ГДЕ
	|	ОтложенныеДвиженияДокументов.Организация = &Организация
	|	И ОтложенныеДвиженияДокументов.ПериодНачисления = &Периодначисления
	|	И ОтложенныеДвиженияДокументов.Район = &Район
	|	И ОтложенныеДвиженияДокументов.РазделЗаписи = ЗНАЧЕНИЕ(Перечисление.энргРазделыЗаписи.СтабильныеПериоды)
	|	И ОтложенныеДвиженияДокументов.ЧастныйСектор = &ЧастныйСектор
	|	И ОтложенныеДвиженияДокументов.Строение В (&Строение)";
	
	Текст 	= Текст + Разделить;
	
	Текст 	= Текст + СтабильныеПериодыВводНачальныхОстатков();
	
	Текст 	= Текст + Разделить;	
	
	Текст 	= Текст + СтабильныеПериодыДокументыНачисления(ПериодНачисления);
	
	Если Строение = Неопределено И НЕ ОсновныеПараметры.Строения = Неопределено Тогда 
		//Текст						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.ЧастныйСектор = &ЧастныйСектор","");
		//Текст						= СтрЗаменить(Текст,"И СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор","");
		//Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)","");
		//Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор)","");
		//Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор)","");
		//
		//Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение В (&Строение))","");
		//Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Строение В (&Строение)","");
		//Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение В (&Строение)","");
		//Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение В (&Строение)","");
		//Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение В (&Строение))","");
		//Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Строение В (&Строение))","");
		//Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Строение В (&Строение))","");
		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Помещение = &Помещение)",""); 		
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
		Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Помещение = &Помещение)","");
	ИначеЕсли Строение = Неопределено тогда
		Текст						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.ЧастныйСектор = &ЧастныйСектор","");
		Текст						= СтрЗаменить(Текст,"И СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор)","");
		Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение В (&Строение))","");
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Строение В (&Строение)","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение В (&Строение)","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение В (&Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение В (&Строение))","");
		Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Строение В (&Строение))","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Строение В (&Строение))","");
		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Помещение = &Помещение)",""); 		
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
		Текст						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Помещение = &Помещение)","");
	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение В (&Строение))","");
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Строение В (&Строение)","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение В (&Строение)","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение В (&Строение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение В (&Строение))","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Строение В (&Строение))","");
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Строение В (&Строение))","");
		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Помещение = &Помещение)",""); 		
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Помещение = &Помещение)","");
	ИначеЕсли Помещение = Неопределено Тогда 				
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериоды.Помещение = &Помещение)",""); 		
		Текст 						= СтрЗаменить(Текст,"И СтабильныеПериоды.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Помещение = &Помещение","");
		Текст 						= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");		
		Текст						= СтрЗаменить(Текст,"И (СтабильныеПериодыШкалы.Помещение = &Помещение)","");
		Текст 						= СтрЗаменить(Текст,"И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)","");
	КонецЕсли;
	
	Запрос  						= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 	= МВТ;
	Запрос.УстановитьПараметр("ПериодРегистрации",		ПериодРегистрации);
	Запрос.УстановитьПараметр("ПредыдущийПериод",		НачалоМесяца(ПериодНачисления-1));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Периодначисления",		ПериодНачисления);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Период",					КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("МоментВремени",			ПериодНачисления);
	
	Если НЕ Строение = Неопределено Тогда
		Запрос.УстановитьПараметр("ЧастныйСектор",		НЕ ЗначениеЗаполнено(Строение));
		Если ЗначениеЗаполнено(Строение) Тогда
			Запрос.УстановитьПараметр("Строение",		Строение);
		КонецЕсли;
		Если Не Помещение = Неопределено Тогда
			Запрос.УстановитьПараметр("Помещение",		Помещение);
		КонецЕсли;
	КонецЕсли;
	
	Если Строение = Неопределено И НЕ ОсновныеПараметры.Строения = Неопределено Тогда
		Запрос.УстановитьПараметр("ЧастныйСектор", Ложь);
		Запрос.УстановитьПараметр("Строение", ОсновныеПараметры.Строения);
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("ТипНачисления",			Перечисления.энргТипыНачислений.ИндивидуальныеНачисления);
	Запрос.Выполнить();
	
	Текст 							=  
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыДокументыНачислений","НомерПозиции,СоставЖильцов",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	ЛОЖЬ КАК ЭтоВводНачальныхОстатков,
	|	НЕОПРЕДЕЛЕНО КАК КлючПомещения,
	|	НЕОПРЕДЕЛЕНО КАК ПомещениеРодитель
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериодыВводНачальныхОстатков","НомерПозиции,СоставЖильцов",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	ИСТИНА КАК ЭтоВводНачальныхОстатков,
	|	СтабильныеПериодыВводНачальныхОстатков.КлючПомещения КАК КлючПомещения,
	|	СтабильныеПериодыВводНачальныхОстатков.ПомещениеРодитель КАК ПомещениеРодитель
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|
	|УПОРЯДОЧИТЬ ПО	
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	ДокРегистратор,
	|	Абонент УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДокументыНачислений.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыДокументыНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР КОГДА СтабильныеПериодыДокументыНачислений.ЧастныйСектор ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ СтабильныеПериодыДокументыНачислений.Строение КОНЕЦ КАК Строение,
	|	ЛОЖЬ КАК ЭтоВводНачальныхОстатков
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|	СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор КАК ЧастныйСектор,
	|	ВЫБОР КОГДА СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ СтабильныеПериодыВводНачальныхОстатков.Строение КОНЕЦ КАК Строение,
	|	ИСТИНА КАК ЭтоВводНачальныхОстатков
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|
	|УПОРЯДОЧИТЬ ПО	
	|	ЧастныйСектор,
	|	Строение,
	|	ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДокументыНачислений.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыДокументыНачислений.Район КАК Район,
	|	СтабильныеПериодыДокументыНачислений.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериодыДокументыНачислений.Строение КАК Строение,
	|	СтабильныеПериодыДокументыНачислений.Помещение КАК Помещение,
	|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказанияСрез.Шкала КАК Шкала,
	|	энргМаксимальныеПоказанияСрез.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргМаксимальныеПоказанияСрез.Показания КАК Показания,
	|	энргМаксимальныеПоказанияСрез.ДокРегистратор КАК ДокРегистратор,
	|	энргМаксимальныеПоказанияСрез.ДатаРегистратора КАК ДатаРегистратора,
	|	ЛОЖЬ КАК ЭтоВводНачальныхОстатков
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
	|		ПО СтабильныеПериодыДокументыНачислений.Организация = энргМаксимальныеПоказанияСрез.Организация
	|			И (СтабильныеПериодыДокументыНачислений.ПериодНачисления = ДОБАВИТЬКДАТЕ(энргМаксимальныеПоказанияСрез.ПериодНачисления, МЕСЯЦ, 1))
	|			И СтабильныеПериодыДокументыНачислений.Район = энргМаксимальныеПоказанияСрез.Район
	|			И СтабильныеПериодыДокументыНачислений.ЧастныйСектор = энргМаксимальныеПоказанияСрез.ЧастныйСектор
	|			И СтабильныеПериодыДокументыНачислений.Строение = энргМаксимальныеПоказанияСрез.Строение
	|			И СтабильныеПериодыДокументыНачислений.Помещение = энргМаксимальныеПоказанияСрез.Помещение
	|			И СтабильныеПериодыДокументыНачислений.ПриборУчета = энргМаксимальныеПоказанияСрез.ПриборУчета
	|			И (СтабильныеПериодыДокументыНачислений.ПриборВведен)
	|			И (энргМаксимальныеПоказанияСрез.Организация = &Организация)
	|			И (энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПредыдущийПериод)
	|			И (энргМаксимальныеПоказанияСрез.Район = &Район)
	|			И (энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргМаксимальныеПоказанияСрез.Строение В (&Строение))
	|			И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.ЧастныйСектор,
	|	ВложенныйЗапрос.Строение,
	|	ВложенныйЗапрос.Помещение,
	|	ВложенныйЗапрос.ПриборУчета,
	|	ВложенныйЗапрос.Шкала,
	|	энргВводНачальныхОстатковПоказанияПриборовУчета.ТарифнаяЗона,
	|	энргВводНачальныхОстатковПоказанияПриборовУчета.ТекущиеПоказания,
	|	ВложенныйЗапрос.ДокРегистратор,
	|	ВложенныйЗапрос.ДатаРегистратора,
	|	ИСТИНА
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтабильныеПериодыВводНачальныхОстатков.Организация КАК Организация,
	|		СтабильныеПериодыВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|		СтабильныеПериодыВводНачальныхОстатков.Район КАК Район,
	|		СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор КАК ЧастныйСектор,
	|		СтабильныеПериодыВводНачальныхОстатков.Строение КАК Строение,
	|		СтабильныеПериодыВводНачальныхОстатков.Помещение КАК Помещение,
	|		СтабильныеПериодыВводНачальныхОстатков.ПриборУчета КАК ПриборУчета,
	|		энргВводНачальныхОстатковШкалыПриборовУчета.Шкала КАК Шкала,
	|		СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор КАК ДокРегистратор,
	|		СтабильныеПериодыВводНачальныхОстатков.ДатаРегистратора КАК ДатаРегистратора,
	|		энргВводНачальныхОстатковШкалыПриборовУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ШкалыПриборовУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
	|			ПО СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор = энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка
	|				И СтабильныеПериодыВводНачальныхОстатков.IDСтрокиТочкиУчета = энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета
	|				И (СтабильныеПериодыВводНачальныхОстатков.ПриборВведен)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоказанияПриборовУчета КАК энргВводНачальныхОстатковПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = энргВводНачальныхОстатковПоказанияПриборовУчета.IDСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыДокументыНачислений.Организация КАК Организация,
	|	СтабильныеПериодыДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериодыДокументыНачислений.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериодыДокументыНачислений.ДокРегистратор КАК ДокРегистратор,
	|	0 КАК НомерПозиции,
	|	ПараметрыШкалСтаблиногоПериода.Район КАК Район,
	|	ПараметрыШкалСтаблиногоПериода.ЧастныйСектор КАК ЧастныйСектор,
	|	ПараметрыШкалСтаблиногоПериода.Строение КАК Строение,
	|	ПараметрыШкалСтаблиногоПериода.Помещение КАК Помещение,
	|	ПараметрыШкалСтаблиногоПериода.ТочкаУчета КАК ТочкаУчета,
	|	ПараметрыШкалСтаблиногоПериода.Шкала КАК Шкала,
	|	ПараметрыШкалСтаблиногоПериода.ВидДифференцированности КАК ВидДифференцированности
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыШкалСтаблиногоПериода КАК ПараметрыШкалСтаблиногоПериода
	|		ПО СтабильныеПериодыДокументыНачислений.Организация = ПараметрыШкалСтаблиногоПериода.Организация
	|			И СтабильныеПериодыДокументыНачислений.ПериодНачисления = ПараметрыШкалСтаблиногоПериода.ПериодНачисления
	|			И СтабильныеПериодыДокументыНачислений.Район = ПараметрыШкалСтаблиногоПериода.Район
	|			И СтабильныеПериодыДокументыНачислений.ЧастныйСектор = ПараметрыШкалСтаблиногоПериода.ЧастныйСектор
	|			И СтабильныеПериодыДокументыНачислений.Строение = ПараметрыШкалСтаблиногоПериода.Строение
	|			И СтабильныеПериодыДокументыНачислений.Помещение = ПараметрыШкалСтаблиногоПериода.Помещение
	|			И СтабильныеПериодыДокументыНачислений.ТочкаУчета = ПараметрыШкалСтаблиногоПериода.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтабильныеПериодыВводНачальныхОстатков.Организация,
	|	СтабильныеПериодыВводНачальныхОстатков.ПериодНачисления,
	|	СтабильныеПериодыВводНачальныхОстатков.ДатаРегистратора,
	|	СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор,
	|	0,
	|	СтабильныеПериодыВводНачальныхОстатков.Район,
	|	СтабильныеПериодыВводНачальныхОстатков.ЧастныйСектор,
	|	СтабильныеПериодыВводНачальныхОстатков.Строение,
	|	СтабильныеПериодыВводНачальныхОстатков.Помещение,
	|	СтабильныеПериодыВводНачальныхОстатков.ТочкаУчета,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.Шкала,
	|	энргВводНачальныхОстатковШкалыПриборовУчета.ВидДифференцированности
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатков КАК СтабильныеПериодыВводНачальныхОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ШкалыПриборовУчета КАК энргВводНачальныхОстатковШкалыПриборовУчета
	|		ПО СтабильныеПериодыВводНачальныхОстатков.ДокРегистратор = энргВводНачальныхОстатковШкалыПриборовУчета.Ссылка
	|			И СтабильныеПериодыВводНачальныхОстатков.IDСтрокиТочкиУчета = энргВводНачальныхОстатковШкалыПриборовУчета.IDСтрокиТочкиУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыИзмерителиНаправлений","ПараметрыИзмерителиСтаблиногоПериода","НомерПозиции,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	СтабильныеПериодыДокументыНачислений.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериодыДокументыНачислений.ДокРегистратор КАК ДокРегистратор	
	|ИЗ
	|	СтабильныеПериодыДокументыНачислений КАК СтабильныеПериодыДокументыНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыИзмерителиСтаблиногоПериода КАК ПараметрыИзмерителиСтаблиногоПериода
	|		ПО СтабильныеПериодыДокументыНачислений.Организация = ПараметрыИзмерителиСтаблиногоПериода.Организация
	|			И СтабильныеПериодыДокументыНачислений.ПериодНачисления = ПараметрыИзмерителиСтаблиногоПериода.ПериодНачисления
	|			И СтабильныеПериодыДокументыНачислений.Район = ПараметрыИзмерителиСтаблиногоПериода.Район
	|			И СтабильныеПериодыДокументыНачислений.ЧастныйСектор = ПараметрыИзмерителиСтаблиногоПериода.ЧастныйСектор
	|			И СтабильныеПериодыДокументыНачислений.Строение = ПараметрыИзмерителиСтаблиногоПериода.Строение
	|			И СтабильныеПериодыДокументыНачислений.Помещение = ПараметрыИзмерителиСтаблиногоПериода.Помещение
	|			И СтабильныеПериодыДокументыНачислений.ТочкаУчета = ПараметрыИзмерителиСтаблиногоПериода.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыИзмерителиНаправлений","СтабильныеПериодыВводНачальныхОстатковСИзмерителями","НомерПозиции,ДатаРегистратора,ДокРегистратор",Истина,Ложь) + "
	|	0 КАК НомерПозиции,
	|	СтабильныеПериодыВводНачальныхОстатковСИзмерителями.ДатаРегистратора КАК ДатаРегистратора,
	|	СтабильныеПериодыВводНачальныхОстатковСИзмерителями.ДокРегистратор КАК ДокРегистратор
	|ИЗ
	|	СтабильныеПериодыВводНачальныхОстатковСИзмерителями КАК СтабильныеПериодыВводНачальныхОстатковСИзмерителями   
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение";  	                            	
	
	
	Если Строение = Неопределено И НЕ ОсновныеПараметры.Строения = Неопределено Тогда
		
		Текст				= СтрЗаменить(Текст, "И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
		
	ИначеЕсли Строение = Неопределено тогда		
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор)","");
		Текст				= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение В (&Строение))","");
		Текст 				= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.Строение В (&Строение)","");
		Текст 				= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение В (&Строение)","");
		Текст 				= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение В (&Строение)","");
		Текст 				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение В (&Строение))","");
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда 
		Текст				= СтрЗаменить(Текст,"И (СтабильныеПериоды.Строение В (&Строение))","");
		Текст 				= СтрЗаменить(Текст,"И энргНомераСтрокСтабильногоПериода.Строение В (&Строение)","");
		Текст 				= СтрЗаменить(Текст,"И МаксимальныеПоказанияСрезПоследних.Строение В (&Строение)","");
		Текст 				= СтрЗаменить(Текст,"И ОтложенныеДвиженияДокументов.Строение В (&Строение)","");
		Текст 				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Строение В (&Строение))","");
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
	ИначеЕсли Помещение = Неопределено Тогда
		Текст				= СтрЗаменить(Текст,"И (энргМаксимальныеПоказанияСрез.Помещение = &Помещение)","");
	КонецЕсли;
	 	
	Запрос.Текст 			= Текст;
		
	Возврат Запрос.ВыполнитьПакет(); 		
КонецФункции

Функция СтабильныеПериодыВводНачальныхОстатков()
	Текст 	=  
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|	ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|	ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|	ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|	ВложенныйЗапрос.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|	ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|	ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
	|	ВложенныйЗапрос.Плательщик КАК Плательщик,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|	ВложенныйЗапрос.Техническая КАК Техническая,
	|	ВложенныйЗапрос.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(энргВводНачальныхОстатковТочкиУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ЗависимаяТочкаУчета,
	|	ВложенныйЗапрос.КоэффициентФормула КАК КоэффициентФормула,
	|	ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|	0 КАК ФиксированныйОбъемПотребления,
	|	0 КАК ДоляПотребленияЧислитель,
	|	0 КАК ДоляПотребленияЗнаменатель,
	|	0 КАК КоэффициентРаспределенияОстатка,
	|	0 КАК ГодПостройки,
	|	0 КАК КоличествоЭтажей,
	|	"""" КАК СоставЖильцов,
	|	ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка) КАК Шкала,
	|	ЗНАЧЕНИЕ(Перечисление.энргТипыСхемТеплоснабжения.ПустаяСсылка) КАК ТипСхемы,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыТепловыхПунктов.ПустаяСсылка) КАК ВидТепловогоПункта,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособыРаспределенияОбъема.ПустаяСсылка) КАК СпособРаспределенияОбъемаПомещения,
	|	ЛОЖЬ КАК БлокировочныйАкт,
	|	ВложенныйЗапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|	ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|	0 КАК ПотериОбъем,
	|	0 КАК ПотериПроцент,
	|	0 КАК ДопСоциальнаяНормаПотребления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНачальногоНедопуска,
	|	0 КАК КоличествоНедопусков,
	|	ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	энргПомещения.Родитель КАК ПомещениеРодитель,
	|	ЛОЖЬ КАК УслугаОграничена,
	|	ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка) КАК ВладелецЗависимойТочкиУчета,
	|	ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ ВсеПараметрыРасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|		ВложенныйЗапрос.Строение КАК Строение,
	|		ВложенныйЗапрос.Помещение КАК Помещение,
	|		ВложенныйЗапрос.Абонент КАК Абонент,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|		ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|		ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|		ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|		ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|		ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|		ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|		ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|		ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|		ЕСТЬNULL(энргВводНачальныхОстатковЗначениеПлощадей.ЗначениеПлощади, 0) КАК ЗначениеПлощади,
	|		ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|		ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|		ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|		ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|		ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|		ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|		ВложенныйЗапрос.Поставщик КАК Поставщик,
	|		ВложенныйЗапрос.Плательщик КАК Плательщик,
	|		ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|		ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|		ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|		ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|		ВложенныйЗапрос.Техническая КАК Техническая,
	|		ВложенныйЗапрос.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.IDСтрокиТочкиУчета, НЕОПРЕДЕЛЕНО) КАК IDСтрокиЗависимаяТочкаУчета,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.Коэффициент, 0) КАК КоэффициентФормула,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле.Ссылка ЕСТЬ NULL
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК РасчетПоФормуле,
	|		ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|		ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|		ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|		ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|		ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|		ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.Район КАК Район,
	|			ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|			ВложенныйЗапрос.Строение КАК Строение,
	|			ВложенныйЗапрос.Помещение КАК Помещение,
	|			ВложенныйЗапрос.Абонент КАК Абонент,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|			ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|			ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|			ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|			ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|			ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|			ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|			ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|			ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|			ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|			ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|			ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|			ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|			ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|			ВложенныйЗапрос.ВидБлагоустройства КАК ВидБлагоустройства,
	|			ВложенныйЗапрос.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|			ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|			ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|			ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|			ВложенныйЗапрос.Поставщик КАК Поставщик,
	|			ВложенныйЗапрос.Плательщик КАК Плательщик,
	|			ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|			ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|			ЕСТЬNULL(энргСпособыРасчетаПоНаправлениям.ВидПлощади, ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПустаяСсылка)) КАК ВидПлощади,
	|			ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|			ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|			ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|			ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|			ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|			ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|			ВложенныйЗапрос.Техническая КАК Техническая,
	|			ВложенныйЗапрос.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|			ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|			ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|			ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|			ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|			ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|			ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|			ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВложенныйЗапрос.Организация КАК Организация,
	|				ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|				ВложенныйЗапрос.Район КАК Район,
	|				ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|				ВложенныйЗапрос.Строение КАК Строение,
	|				ВложенныйЗапрос.Помещение КАК Помещение,
	|				ВложенныйЗапрос.Абонент КАК Абонент,
	|				ВложенныйЗапрос.Услуга КАК Услуга,
	|				ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|				ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|				ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|				ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|				ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|				ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|				ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|				ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|				ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|				ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|				ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|				ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|				ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|				ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|				ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|				ЕСТЬNULL(энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройства, ЗНАЧЕНИЕ(Справочник.энргВидыБлагоустройств.ПустаяСсылка)) КАК ВидБлагоустройства,
	|				ЕСТЬNULL(энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория, ЗНАЧЕНИЕ(Справочник.энргГруппыПотребителей.ПустаяСсылка)) КАК ТарифнаяГруппа,
	|				ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|				ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|				ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|				ВложенныйЗапрос.Поставщик КАК Поставщик,
	|				ВложенныйЗапрос.Плательщик КАК Плательщик,
	|				ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|				ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|				ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|				ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|				ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|				ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|				ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|				ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|				ВложенныйЗапрос.Техническая КАК Техническая,
	|				ЕСТЬNULL(энргВводНачальныхОстатковТочкиУчета.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчетаРодитель,
	|				ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|				ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|				ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|				ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|				ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|				ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|				ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ВложенныйЗапрос.Организация КАК Организация,
	|					ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|					ВложенныйЗапрос.Район КАК Район,
	|					ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|					ВложенныйЗапрос.Строение КАК Строение,
	|					ВложенныйЗапрос.Помещение КАК Помещение,
	|					ВложенныйЗапрос.Абонент КАК Абонент,
	|					ВЫБОР
	|						КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Услуга
	|						ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги
	|					КОНЕЦ КАК Услуга,
	|					ВЫБОР
	|						КОГДА НЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Услуга
	|						ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	|					КОНЕЦ КАК СоставнаяУслуга,
	|					ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|					ВложенныйЗапрос.НомерПозиции КАК НомерПозиции,
	|					ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|					ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|					ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|					ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|					ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|					ВложенныйЗапрос.УслугаПодключена КАК УслугаПодключена,
	|					ВложенныйЗапрос.ПриборВведен КАК ПриборВведен,
	|					ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|					ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|					ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|					ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|					ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|					ВложенныйЗапрос.ДатаПоверки КАК ДатаПоверки,
	|					ВложенныйЗапрос.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|					ВложенныйЗапрос.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|					ВЫБОР
	|						КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Поставщик
	|						ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Поставщик
	|					КОНЕЦ КАК Поставщик,
	|					ВЫБОР
	|						КОГДА энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка ЕСТЬ NULL
	|							ТОГДА ВложенныйЗапрос.Плательщик
	|						ИНАЧЕ энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Плательщик
	|					КОНЕЦ КАК Плательщик,
	|					ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|					ВложенныйЗапрос.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|					ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|					ВложенныйЗапрос.КоэффициентПУ КАК КоэффициентПУ,
	|					ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|					ВложенныйЗапрос.IDСтрокиРодительТочкиУчета КАК IDСтрокиРодительТочкиУчета,
	|					ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|					ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|					ВложенныйЗапрос.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|					ВложенныйЗапрос.ДиаметрСечения КАК ДиаметрСечения,
	|					ВложенныйЗапрос.Техническая КАК Техническая,
	|					ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|					ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|					ВложенныйЗапрос.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|					ВложенныйЗапрос.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|					ВложенныйЗапрос.ПериодНачисленияВыводаПрибора КАК ПериодНачисленияВыводаПрибора,
	|					ВложенныйЗапрос.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|					ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ВложенныйЗапрос.Организация КАК Организация,
	|						ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|						ВложенныйЗапрос.Район КАК Район,
	|						энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
	|						энргКлючиПомещений.Строение КАК Строение,
	|						энргКлючиПомещений.Помещение КАК Помещение,
	|						ВложенныйЗапрос.Абонент КАК Абонент,
	|						энргВводНачальныхОстатковТочкиУчета.Услуга КАК Услуга,
	|						энргВводНачальныхОстатковТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|						0 КАК НомерПозиции,
	|						&ПериодРегистрации КАК ПериодРегистрации,
	|						ВложенныйЗапрос.Дата КАК ДатаРегистратора,
	|						ВложенныйЗапрос.Регистратор КАК ДокРегистратор,
	|						ВложенныйЗапрос.ЛСОткрыт КАК ЛСОткрыт,
	|						ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|						ИСТИНА КАК УслугаПодключена,
	|						НЕ энргВводНачальныхОстатковТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка) КАК ПриборВведен,
	|						энргВводНачальныхОстатковТочкиУчета.ПриборУчета КАК ПриборУчета,
	|						ВложенныйЗапрос.КоличествоПрописанных КАК КоличествоПрописанных,
	|						ВложенныйЗапрос.КоличествоСобственников КАК КоличествоСобственников,
	|						ВложенныйЗапрос.КоличествоПроживающих КАК КоличествоПроживающих,
	|						ВложенныйЗапрос.КоличествоКомнат КАК КоличествоКомнат,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаПоверки КАК ДатаПоверки,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаПоверки КАК ДатаРегистрацииПоверки,
	|						энргВводНачальныхОстатковТочкиУчета.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|						энргВводНачальныхОстатковТочкиУчета.Поставщик КАК Поставщик,
	|						энргВводНачальныхОстатковТочкиУчета.Плательщик КАК Плательщик,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаВводПрибораУчета КАК ДатаСостоянияПрибора,
	|						энргВводНачальныхОстатковТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|						энргВводНачальныхОстатковТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|						энргВводНачальныхОстатковТочкиУчета.IDСтрокиРодитель КАК IDСтрокиРодительТочкиУчета,
	|						энргВводНачальныхОстатковТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|						энргВводНачальныхОстатковТочкиУчета.ПрименятьФормулуВсегда КАК ПрименятьФормулуВсегда,
	|						ВложенныйЗапрос.IDСтрокиАбонента КАК IDСтрокиАбонента,
	|						ВЫБОР
	|							КОГДА энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ = 0
	|								ТОГДА 1
	|							ИНАЧЕ энргВводНачальныхОстатковТочкиУчета.КоэффициентПУ
	|						КОНЕЦ КАК КоэффициентПУ,
	|						ВложенныйЗапрос.ВидСобственности КАК ВидСобственности,
	|						энргВводНачальныхОстатковТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|						ЕСТЬNULL(энргДиаметрСеченияТочекУчетаСрезПоследних.Использовать, ЛОЖЬ) КАК ИспользоватьДиаметрСечения,
	|						ЕСТЬNULL(энргДиаметрСеченияТочекУчетаСрезПоследних.ДиаметрСечения, 0) КАК ДиаметрСечения,
	|						энргВводНачальныхОстатковТочкиУчета.Техническая КАК Техническая,
	|						ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|						ВложенныйЗапрос.КоличествоЖильцов КАК КоличествоЖильцов,
	|						энргВводНачальныхОстатковТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|						энргВводНачальныхОстатковТочкиУчета.ДатаВыводаПрибораУчета КАК ПериодНачисленияВыводаПрибора,
	|						ЛОЖЬ КАК СрокПоверкиИстек,
	|						ВложенныйЗапрос.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|					ИЗ
	|						(ВЫБРАТЬ
	|							энргВводНачальныхОстатков.Ссылка КАК Регистратор,
	|							энргВводНачальныхОстатков.Дата КАК Дата,
	|							энргВводНачальныхОстатков.Район КАК Район,
	|							энргВводНачальныхОстатковАбоненты.КлючПомещения КАК КлючПомещения,
	|							энргВводНачальныхОстатков.Организация КАК Организация,
	|							энргВводНачальныхОстатков.ПериодНачисления КАК ПериодНачисления,
	|							энргВводНачальныхОстатковАбоненты.Абонент КАК Абонент,
	|							ИСТИНА КАК ЛСОткрыт,
	|							энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС КАК ДатаСостоянияЛицевогоСчета,
	|							энргВводНачальныхОстатковАбоненты.IDСтроки КАК IDСтрокиАбонента,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПроживающих КАК КоличествоПроживающих,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПрописанных КАК КоличествоПрописанных,
	|							энргВводНачальныхОстатковАбоненты.КоличествоСобственников КАК КоличествоСобственников,
	|							энргВводНачальныхОстатковАбоненты.КоличествоКомнат КАК КоличествоКомнат,
	|							энргВводНачальныхОстатковАбоненты.ТипСобственностиЖилья КАК ВидСобственности,
	|							СУММА(ВЫБОР
	|									КОГДА НЕ энргВводНачальныхОстатковАбоненты1.КоличествоПроживающих ЕСТЬ NULL
	|											И энргВводНачальныхОстатковАбоненты1.КоличествоПроживающих <> 0
	|										ТОГДА энргВводНачальныхОстатковАбоненты1.КоличествоПроживающих
	|									КОГДА НЕ энргВводНачальныхОстатковАбоненты1.КоличествоПрописанных ЕСТЬ NULL
	|											И энргВводНачальныхОстатковАбоненты1.КоличествоПрописанных <> 0
	|										ТОГДА энргВводНачальныхОстатковАбоненты1.КоличествоПрописанных
	|									КОГДА НЕ энргВводНачальныхОстатковАбоненты1.КоличествоСобственников ЕСТЬ NULL
	|											И энргВводНачальныхОстатковАбоненты1.КоличествоСобственников <> 0
	|										ТОГДА энргВводНачальныхОстатковАбоненты1.КоличествоСобственников
	|									ИНАЧЕ 0
	|								КОНЕЦ) КАК КоличествоЖильцов,
	|							энргВводНачальныхОстатковАбоненты.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|						ИЗ
	|							ДокументыДляПроведения КАК ДокументыДляПроведения
	|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты
	|									ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.Абоненты КАК энргВводНачальныхОстатковАбоненты1
	|									ПО энргВводНачальныхОстатковАбоненты.Ссылка = энргВводНачальныхОстатковАбоненты1.Ссылка
	|										И энргВводНачальныхОстатковАбоненты.IDСтроки = энргВводНачальныхОстатковАбоненты1.IDСтрокиРодитель
	|								ПО ДокументыДляПроведения.ДокРегистратор = энргВводНачальныхОстатковАбоненты.Ссылка
	|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков КАК энргВводНачальныхОстатков
	|								ПО ДокументыДляПроведения.ДокРегистратор = энргВводНачальныхОстатков.Ссылка
	|						
	|						СГРУППИРОВАТЬ ПО
	|							энргВводНачальныхОстатков.Ссылка,
	|							энргВводНачальныхОстатков.Дата,
	|							энргВводНачальныхОстатков.Район,
	|							энргВводНачальныхОстатковАбоненты.КлючПомещения,
	|							энргВводНачальныхОстатков.Организация,
	|							энргВводНачальныхОстатков.ПериодНачисления,
	|							энргВводНачальныхОстатковАбоненты.Абонент,
	|							энргВводНачальныхОстатковАбоненты.ДатаОткрытияЛС,
	|							энргВводНачальныхОстатковАбоненты.IDСтроки,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПроживающих,
	|							энргВводНачальныхОстатковАбоненты.КоличествоПрописанных,
	|							энргВводНачальныхОстатковАбоненты.КоличествоСобственников,
	|							энргВводНачальныхОстатковАбоненты.КоличествоКомнат,
	|							энргВводНачальныхОстатковАбоненты.ТипСобственностиЖилья,
	|							энргВводНачальныхОстатковАбоненты.ДоговорЗаключенДоТП) КАК ВложенныйЗапрос
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	|							ПО ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковТочкиУчета.IDСтрокиАбонента
	|								И ВложенныйЗапрос.Регистратор = энргВводНачальныхОстатковТочкиУчета.Ссылка
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|							ПО ВложенныйЗапрос.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргДиаметрСеченияТочекУчета.СрезПоследних КАК энргДиаметрСеченияТочекУчетаСрезПоследних
	|							ПО ВложенныйЗапрос.Регистратор = энргДиаметрСеченияТочекУчетаСрезПоследних.Регистратор
	|								И ВложенныйЗапрос.Организация = энргДиаметрСеченияТочекУчетаСрезПоследних.Организация
	|								И ВложенныйЗапрос.Район = энргДиаметрСеченияТочекУчетаСрезПоследних.Район
	|								И ВложенныйЗапрос.КлючПомещения = энргДиаметрСеченияТочекУчетаСрезПоследних.КлючПомещения
	|								И (энргВводНачальныхОстатковТочкиУчета.ТочкаУчета = энргДиаметрСеченияТочекУчетаСрезПоследних.ТочкаУчета)) КАК ВложенныйЗапрос
	|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ПоставщикиСоставныхУслуг КАК энргВводНачальныхОстатковПоставщикиСоставныхУслуг
	|						ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковПоставщикиСоставныхУслуг.Ссылка
	|							И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргВводНачальныхОстатковПоставщикиСоставныхУслуг.IDСтроки
	|							И (ВложенныйЗапрос.ЭтоСоставнаяУслуга)) КАК ВложенныйЗапрос
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ВидыБлагоустройстваТарифныеКатегории КАК энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории
	|					ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.Ссылка
	|						И ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.IDСтрокиАбонента
	|						И ВложенныйЗапрос.Услуга = энргВводНачальныхОстатковВидыБлагоустройстваТарифныеКатегории.Услуга
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	|					ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковТочкиУчета.Ссылка
	|						И ВложенныйЗапрос.IDСтрокиРодительТочкиУчета = энргВводНачальныхОстатковТочкиУчета.IDСтроки) КАК ВложенныйЗапрос
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(&МоментВремени, ) КАК энргСпособыРасчетаПоНаправлениям
	|				ПО ВложенныйЗапрос.Организация = энргСпособыРасчетаПоНаправлениям.Организация
	|					И ВложенныйЗапрос.Район = энргСпособыРасчетаПоНаправлениям.Район
	|					И ВложенныйЗапрос.Услуга = энргСпособыРасчетаПоНаправлениям.Услуга
	|					И ВложенныйЗапрос.НаправлениеИспользованияТУ = энргСпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ЗначениеПлощадей КАК энргВводНачальныхОстатковЗначениеПлощадей
	|			ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковЗначениеПлощадей.Ссылка
	|				И ВложенныйЗапрос.ВидПлощади = энргВводНачальныхОстатковЗначениеПлощадей.ВидПлощади
	|				И ВложенныйЗапрос.IDСтрокиАбонента = энргВводНачальныхОстатковЗначениеПлощадей.IDСтрокиАбонента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ФормулыРасчета КАК энргВводНачальныхОстатковФормулыРасчета
	|			ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковФормулыРасчета.Ссылка
	|				И ВложенныйЗапрос.ТочкаУчета = энргВводНачальныхОстатковФормулыРасчета.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ФормулыРасчета КАК энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле
	|			ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргВводНачальныхОстатковФормулыРасчетаРасчетПоФормуле.IDСтрокиТочкиУчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.ПериодНачисления,
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.ЧастныйСектор,
	|		ВложенныйЗапрос.Строение,
	|		ВложенныйЗапрос.Помещение,
	|		ВложенныйЗапрос.Абонент,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.ТочкаУчета,
	|		ВложенныйЗапрос.НомерПозиции,
	|		ВложенныйЗапрос.ПериодРегистрации,
	|		ВложенныйЗапрос.ДатаРегистратора,
	|		ВложенныйЗапрос.ДокРегистратор,
	|		ВложенныйЗапрос.ЛСОткрыт,
	|		ВложенныйЗапрос.ДатаСостоянияЛицевогоСчета,
	|		ВложенныйЗапрос.УслугаПодключена,
	|		ВложенныйЗапрос.ПриборВведен,
	|		ВложенныйЗапрос.ПриборУчета,
	|		ВложенныйЗапрос.КоличествоПрописанных,
	|		ВложенныйЗапрос.КоличествоСобственников,
	|		ВложенныйЗапрос.ТарифнаяГруппа,
	|		ВложенныйЗапрос.ДатаПоверки,
	|		ВложенныйЗапрос.ДатаРегистрацииПоверки,
	|		ВложенныйЗапрос.Поставщик,
	|		ВложенныйЗапрос.Плательщик,
	|		ВложенныйЗапрос.ДатаСостоянияПрибора,
	|		ВложенныйЗапрос.НетВозможностьУстановкиПУ,
	|		ВложенныйЗапрос.ОтключатьВНеполивнойСезон,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.СоставнаяУслуга,
	|		ВложенныйЗапрос.ВидБлагоустройства,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|		ВложенныйЗапрос.Техническая,
	|		ВложенныйЗапрос.ВидСобственности,
	|		ВложенныйЗапрос.ИспользоватьДиаметрСечения,
	|		ВложенныйЗапрос.ТочкаУчетаРодитель,
	|		ВложенныйЗапрос.КлючПомещения,
	|		ВложенныйЗапрос.КоличествоПроживающих,
	|		ВложенныйЗапрос.КоличествоКомнат,
	|		ЕСТЬNULL(энргВводНачальныхОстатковЗначениеПлощадей.ЗначениеПлощади, 0),
	|		ВложенныйЗапрос.КоэффициентПУ,
	|		ВложенныйЗапрос.ДиаметрСечения,
	|		ВложенныйЗапрос.КоличествоЖильцов,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.Коэффициент, 0),
	|		ВложенныйЗапрос.РасчетТолькоПоПоказаниям,
	|		ВложенныйЗапрос.ПрименятьФормулуВсегда,
	|		ВложенныйЗапрос.ПериодНачисленияВыводаПрибора,
	|		ВложенныйЗапрос.СрокПоверкиИстек,
	|		ВложенныйЗапрос.ДоговорЗаключенДоТП,
	|		ЕСТЬNULL(энргВводНачальныхОстатковФормулыРасчета.IDСтрокиТочкиУчета, НЕОПРЕДЕЛЕНО)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ТочкиУчета КАК энргВводНачальныхОстатковТочкиУчета
	|		ПО ВложенныйЗапрос.ДокРегистратор = энргВводНачальныхОстатковТочкиУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиЗависимаяТочкаУчета = энргВводНачальныхОстатковТочкиУчета.IDСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	|		ПО ВложенныйЗапрос.Помещение = энргПомещения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПараметрыРасчета.Организация КАК Организация,
	|	ВсеПараметрыРасчета.ПериодНачисления КАК ПериодНачисления,
	|	ВсеПараметрыРасчета.Район КАК Район,
	|	ВсеПараметрыРасчета.ЧастныйСектор КАК ЧастныйСектор,
	|	ВсеПараметрыРасчета.Строение КАК Строение,
	|	ВсеПараметрыРасчета.Помещение КАК Помещение,
	|	ВсеПараметрыРасчета.Абонент КАК Абонент,
	|	ВсеПараметрыРасчета.Услуга КАК Услуга,
	|	ВсеПараметрыРасчета.ТочкаУчета КАК ТочкаУчета,
	|	ВсеПараметрыРасчета.НомерПозиции КАК НомерПозиции,
	|	ВсеПараметрыРасчета.ПериодРегистрации КАК ПериодРегистрации,
	|	ВсеПараметрыРасчета.ДатаРегистратора КАК ДатаРегистратора,
	|	ВсеПараметрыРасчета.ДокРегистратор КАК ДокРегистратор,
	|	ВсеПараметрыРасчета.ЛСОткрыт КАК ЛСОткрыт,
	|	ВсеПараметрыРасчета.ДатаСостоянияЛицевогоСчета КАК ДатаСостоянияЛицевогоСчета,
	|	ВсеПараметрыРасчета.УслугаПодключена КАК УслугаПодключена,
	|	ВсеПараметрыРасчета.ПриборВведен КАК ПриборВведен,
	|	ВсеПараметрыРасчета.ПриборУчета КАК ПриборУчета,
	|	ВсеПараметрыРасчета.КоличествоПрописанных КАК КоличествоПрописанных,
	|	ВсеПараметрыРасчета.КоличествоСобственников КАК КоличествоСобственников,
	|	ВсеПараметрыРасчета.КоличествоПроживающих КАК КоличествоПроживающих,
	|	ВсеПараметрыРасчета.КоличествоКомнат КАК КоличествоКомнат,
	|	ВсеПараметрыРасчета.ЗначениеПлощади КАК ЗначениеПлощади,
	|	ВсеПараметрыРасчета.КоэффициентПУ КАК КоэффициентПУ,
	|	ВсеПараметрыРасчета.ВидБлагоустройства КАК ВидБлагоустройства,
	|	ВсеПараметрыРасчета.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВсеПараметрыРасчета.ДатаПоверки КАК ДатаПоверки,
	|	ВсеПараметрыРасчета.ДатаРегистрацииПоверки КАК ДатаРегистрацииПоверки,
	|	ВсеПараметрыРасчета.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
	|	ВсеПараметрыРасчета.Поставщик КАК Поставщик,
	|	ВсеПараметрыРасчета.Плательщик КАК Плательщик,
	|	ВсеПараметрыРасчета.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВсеПараметрыРасчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ,
	|	ВсеПараметрыРасчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	ВсеПараметрыРасчета.ВидСобственности КАК ВидСобственности,
	|	ВсеПараметрыРасчета.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВсеПараметрыРасчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВсеПараметрыРасчета.ИспользоватьДиаметрСечения КАК ИспользоватьДиаметрСечения,
	|	ВсеПараметрыРасчета.ДиаметрСечения КАК ДиаметрСечения,
	|	ВсеПараметрыРасчета.Техническая КАК Техническая,
	|	ВсеПараметрыРасчета.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
	|	ВсеПараметрыРасчета.КлючПомещения КАК КлючПомещения,
	|	ВсеПараметрыРасчета.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ВсеПараметрыРасчета.КоэффициентФормула КАК КоэффициентФормула,
	|	ВсеПараметрыРасчета.КоличествоЖильцов КАК КоличествоЖильцов,
	|	ВсеПараметрыРасчета.ФиксированныйОбъемПотребления КАК ФиксированныйОбъемПотребления,
	|	ВсеПараметрыРасчета.ДоляПотребленияЧислитель КАК ДоляПотребленияЧислитель,
	|	ВсеПараметрыРасчета.ДоляПотребленияЗнаменатель КАК ДоляПотребленияЗнаменатель,
	|	ВсеПараметрыРасчета.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
	|	ВсеПараметрыРасчета.ГодПостройки КАК ГодПостройки,
	|	ВсеПараметрыРасчета.КоличествоЭтажей КАК КоличествоЭтажей,
	|	ВсеПараметрыРасчета.Шкала КАК Шкала,
	|	ВсеПараметрыРасчета.ТипСхемы КАК ТипСхемы,
	|	ВсеПараметрыРасчета.ВидТепловогоПункта КАК ВидТепловогоПункта,
	|	ВсеПараметрыРасчета.СпособРаспределенияОбъемаПомещения КАК СпособРаспределенияОбъемаПомещения,
	|	ВсеПараметрыРасчета.БлокировочныйАкт КАК БлокировочныйАкт,
	|	ВсеПараметрыРасчета.РасчетПоФормуле КАК РасчетПоФормуле,
	|	энргВводНачальныхОстатковЗначенияИзмерителей.НаправлениеИспользованияТУ КАК Измеритель,
	|	энргВводНачальныхОстатковЗначенияИзмерителей.Значение КАК Количество,
	|	ВсеПараметрыРасчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	0 КАК ПотериОбъем,
	|	0 КАК ПотериПроцент,
	|	ВсеПараметрыРасчета.ПериодНачальногоНедопуска КАК ПериодНачальногоНедопуска,
	|	ВсеПараметрыРасчета.КоличествоНедопусков КАК КоличествоНедопусков,
	|	ВсеПараметрыРасчета.СрокПоверкиИстек КАК СрокПоверкиИстек,
	|	ВсеПараметрыРасчета.УслугаОграничена КАК УслугаОграничена,
	|	ВсеПараметрыРасчета.ДоговорЗаключенДоТП КАК ДоговорЗаключенДоТП
	|ПОМЕСТИТЬ ВсеПараметрыРасчетаСИзмерителями
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргВводНачальныхОстатков.ЗначенияИзмерителей КАК энргВводНачальныхОстатковЗначенияИзмерителей
	|		ПО ВсеПараметрыРасчета.ДокРегистратор = энргВводНачальныхОстатковЗначенияИзмерителей.Ссылка
	|			И ВсеПараметрыРасчета.IDСтрокиТочкиУчета = энргВводНачальныхОстатковЗначенияИзмерителей.IDСтроки";
	
	Текст  = Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст = Текст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНорматива(Истина);
	
	Текст  = Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст  = Текст +
	"ВЫБРАТЬ
	|	ВсеПараметрыРасчета.*,
	|	КлючиНорматива.КлючНорматива КАК КлючНорматива,
	|	КлючиНорматива.КлючСоцНорматива КАК КлючСоцНорматива,
	|	ЛОЖЬ КАК ЯвляетсяПомещениемСРазделеннымиЛС
	|ПОМЕСТИТЬ СтабильныеПериодыВводНачальныхОстатков
	|ИЗ
	|	ВсеПараметрыРасчета КАК ВсеПараметрыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
	|		ПО (ВсеПараметрыРасчета.Строение = КлючиНорматива.Строение)
	|		И (ВсеПараметрыРасчета.Помещение = КлючиНорматива.Помещение)
	|		И (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
	|		И (ВсеПараметрыРасчета.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ)
	|		И (КлючиНорматива.Измеритель = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПараметрыРасчетаСИзмерителями.*,
	|	КлючиНорматива.КлючНорматива КАК КлючНорматива,
	|	КлючиНорматива.КлючСоцНорматива КАК КлючСоцНорматива,
	|	ЛОЖЬ КАК ЯвляетсяПомещениемСРазделеннымиЛС
	|ПОМЕСТИТЬ СтабильныеПериодыВводНачальныхОстатковСИзмерителями
	|ИЗ
	|	ВсеПараметрыРасчетаСИзмерителями КАК ВсеПараметрыРасчетаСИзмерителями
	|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНорматива КАК КлючиНорматива
	|		ПО ВсеПараметрыРасчетаСИзмерителями.Строение = КлючиНорматива.Строение
	|			И ВсеПараметрыРасчетаСИзмерителями.Помещение = КлючиНорматива.Помещение
	|			И ВсеПараметрыРасчетаСИзмерителями.Услуга = КлючиНорматива.Услуга
	|			И ВсеПараметрыРасчетаСИзмерителями.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ
	|			И ВсеПараметрыРасчетаСИзмерителями.Измеритель = КлючиНорматива.Измеритель";
		 		
	Возврат Текст;
	
КонецФункции 

Функция СтабильныеПериодыДокументыНачисления(ПериодНачисления)
	
	Текст 	=  
	"ВЫБРАТЬ
	|	СтабильныеПериоды.Организация КАК Организация,
	|	СтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	СтабильныеПериоды.Район КАК Район,
	|	СтабильныеПериоды.ЧастныйСектор КАК ЧастныйСектор,
	|	СтабильныеПериоды.Строение КАК Строение,
	|	СтабильныеПериоды.Помещение КАК Помещение,
	|	СтабильныеПериоды.Услуга КАК Услуга,
	|	СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|	МАКСИМУМ(СтабильныеПериоды.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ НомерСтрок
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|ГДЕ
	|	СтабильныеПериоды.Организация = &Организация
	|	И СтабильныеПериоды.ПериодНачисления = &ПредыдущийПериод
	|	И СтабильныеПериоды.Район = &Район
	|	И СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор
	|	И СтабильныеПериоды.Строение В (&Строение)
	|	И СтабильныеПериоды.Помещение = &Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	СтабильныеПериоды.Организация,
	|	СтабильныеПериоды.ПериодНачисления,
	|	СтабильныеПериоды.Район,
	|	СтабильныеПериоды.ЧастныйСектор,
	|	СтабильныеПериоды.Строение,
	|	СтабильныеПериоды.Помещение,
	|	СтабильныеПериоды.Услуга,
	|	СтабильныеПериоды.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	0 КАК НомерПозиции,
	|	ЛОЖЬ КАК БлокировочныйАкт,
	|	0 КАК ГодПостройки,
	| "+ энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","СтабильныеПериоды","Организация,ПериодНачисления,НомерПозиции,БлокировочныйАкт,СоставЖильцов") + "
	|ПОМЕСТИТЬ ПараметрыСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериоды КАК СтабильныеПериоды
	|		ПО НомерСтрок.Организация = СтабильныеПериоды.Организация
	|			И НомерСтрок.ПериодНачисления = СтабильныеПериоды.ПериодНачисления
	|			И НомерСтрок.Район = СтабильныеПериоды.Район
	|			И НомерСтрок.ЧастныйСектор = СтабильныеПериоды.ЧастныйСектор
	|			И НомерСтрок.Строение = СтабильныеПериоды.Строение
	|			И НомерСтрок.Помещение = СтабильныеПериоды.Помещение
	|			И НомерСтрок.Услуга = СтабильныеПериоды.Услуга
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериоды.ТочкаУчета
	|			И НомерСтрок.НомерПозиции = СтабильныеПериоды.НомерПозиции
	|			И (СтабильныеПериоды.Организация = &Организация)
	|			И (СтабильныеПериоды.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериоды.Район = &Район)
	|			И (СтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор)
	|			И (СтабильныеПериоды.Строение В (&Строение))
	|			И (СтабильныеПериоды.Помещение = &Помещение)
	|ГДЕ
	|	СтабильныеПериоды.УслугаПодключена";
	
	ИмяТаблицыПараметрыСтаблиногоПериода = "ПараметрыСтаблиногоПериода";
	Если ПериодНачисления = НачалоГода(ПериодНачисления) Тогда
		Текст 	= Текст + ОбщегоНазначения.РазделительПакетаЗапросов(); 
		
		Текст 	= Текст + Справочники.энргКлючиНормативов.ТекстОпределенияКлючейНорматива(Ложь, "ПараметрыСтаблиногоПериода");

		Текст 	= Текст + ОбщегоНазначения.РазделительПакетаЗапросов(); 	
		
		Текст  	= Текст +
		"ВЫБРАТЬ
		| "+ энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ВсеПараметрыРасчета","КлючНорматива,КлючСоцНорматива,СоставЖильцов",Истина,Ложь) + "
		|	КлючиНорматива.КлючНорматива КАК КлючНорматива,
		|	КлючиНорматива.КлючСоцНорматива КАК КлючСоцНорматива
		|ПОМЕСТИТЬ ВсеПараметрыРасчетаКлючНорматива
		|ИЗ
		|	ПараметрыСтаблиногоПериода КАК ВсеПараметрыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ КлючиНормативаПараметрыСтаблиногоПериода КАК КлючиНорматива
		|		ПО (ВсеПараметрыРасчета.Строение = КлючиНорматива.Строение)
		|		И (ВсеПараметрыРасчета.Помещение = КлючиНорматива.Помещение)
		|		И (ВсеПараметрыРасчета.Услуга = КлючиНорматива.Услуга)
		|		И (ВсеПараметрыРасчета.НаправлениеИспользованияТУ = КлючиНорматива.НаправлениеИспользованияТУ)
		|		И (КлючиНорматива.Измеритель = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))";
		
		ИмяТаблицыПараметрыСтаблиногоПериода = "ВсеПараметрыРасчетаКлючНорматива";		
	КонецЕсли;
	
	Текст 		= Текст + ОбщегоНазначения.РазделительПакетаЗапросов();	
	
	Текст 		= Текст + 
	"ВЫБРАТЬ
	| "+ энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериоды","ПараметрыСтаблиногоПериода","ПериодРегистрации,ДатаРегистратора,ДокРегистратор,СоставЖильцов",Истина,Ложь) + "
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ДокументыДляПроведения.ДатаРегистратора КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор	
	|ПОМЕСТИТЬ СтабильныеПериодыДокументыНачислений
	|ИЗ
	|	" + ИмяТаблицыПараметрыСтаблиногоПериода + " КАК ПараметрыСтаблиногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ПО ПараметрыСтаблиногоПериода.Организация = ДокументыДляПроведения.Организация
	|			И ПараметрыСтаблиногоПериода.ПериодНачисления = ДокументыДляПроведения.ПериодНачисления
	|			И ПараметрыСтаблиногоПериода.Район = ДокументыДляПроведения.Район
	|			И ПараметрыСтаблиногоПериода.ЧастныйСектор = ДокументыДляПроведения.ЧастныйСектор
	|			И НЕ ДокументыДляПроведения.ДокРегистратор Ссылка Документ.энргВводНачальныхОстатков
	|			И (ВЫБОР
	|					КОГДА ДокументыДляПроведения.ЧастныйСектор
	|						ТОГДА ИСТИНА 
	|					ИНАЧЕ ПараметрыСтаблиногоПериода.Строение = ДокументыДляПроведения.Строение
	|				КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыШкалы","СтабильныеПериодыШкалы","Организация,ПериодНачисления,НомерПозиции,ДатаРегистратора,ДокРегистратор") + "		
	|ПОМЕСТИТЬ ПараметрыШкалСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыШкалы КАК СтабильныеПериодыШкалы
	|		ПО НомерСтрок.Организация = СтабильныеПериодыШкалы.Организация
	|			И НомерСтрок.ПериодНачисления = СтабильныеПериодыШкалы.ПериодНачисления
	|			И НомерСтрок.Район = СтабильныеПериодыШкалы.Район
	|			И НомерСтрок.ЧастныйСектор = СтабильныеПериодыШкалы.ЧастныйСектор
	|			И НомерСтрок.Строение = СтабильныеПериодыШкалы.Строение
	|			И НомерСтрок.Помещение = СтабильныеПериодыШкалы.Помещение
	|			И НомерСтрок.ТочкаУчета = СтабильныеПериодыШкалы.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = СтабильныеПериодыШкалы.НомерПозиции
	|			И (СтабильныеПериодыШкалы.Организация = &Организация)
	|			И (СтабильныеПериодыШкалы.ПериодНачисления = &ПредыдущийПериод)
	|			И (СтабильныеПериодыШкалы.Район = &Район)
	|			И (СтабильныеПериодыШкалы.ЧастныйСектор = &ЧастныйСектор)
	|			И (СтабильныеПериодыШкалы.Строение В (&Строение))
	|			И (СтабильныеПериодыШкалы.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргСтабильныеПериодыИзмерителиНаправлений","энргСтабильныеПериодыИзмерителиНаправлений","Организация,ПериодНачисления,НомерПозиции,ДатаРегистратора,ДокРегистратор") + "		
	|ПОМЕСТИТЬ ПараметрыИзмерителиСтаблиногоПериода
	|ИЗ
	|	НомерСтрок КАК НомерСтрок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК энргСтабильныеПериодыИзмерителиНаправлений
	|		ПО НомерСтрок.Организация = энргСтабильныеПериодыИзмерителиНаправлений.Организация
	|			И НомерСтрок.ПериодНачисления = энргСтабильныеПериодыИзмерителиНаправлений.ПериодНачисления
	|			И НомерСтрок.Район = энргСтабильныеПериодыИзмерителиНаправлений.Район
	|			И НомерСтрок.ЧастныйСектор = энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор
	|			И НомерСтрок.Строение = энргСтабильныеПериодыИзмерителиНаправлений.Строение
	|			И НомерСтрок.Помещение = энргСтабильныеПериодыИзмерителиНаправлений.Помещение
	|			И НомерСтрок.ТочкаУчета = энргСтабильныеПериодыИзмерителиНаправлений.ТочкаУчета	
	|			И НомерСтрок.НомерПозиции = энргСтабильныеПериодыИзмерителиНаправлений.НомерПозиции
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Организация = &Организация)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.ПериодНачисления = &ПредыдущийПериод)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Район = &Район)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Строение В (&Строение))
	|			И (энргСтабильныеПериодыИзмерителиНаправлений.Помещение = &Помещение)";
	
	Возврат Текст;
	
КонецФункции  

#КонецОбласти

#Область ОбработкаПолученныхДанных

Процедура ОчиститьДанныеПриПустомРезультатеЗапроса(ОсновныеПараметры, МВТ, ДополнительныеПараметры)
	
	Ошибки = Новый Массив;
	ПериодНачисления = ОсновныеПараметры.ПериодНачисления;
	РезультатДокументыДляПроведения = МВТ.Таблицы["ДокументыДляПроведения"].ПолучитьДанные();	
	ИмяСобытияОшибки = НСтр("ru = 'Выполнение отложенных движений физ лица. Очистка данных пустой выборки'");
	
	Если НЕ РезультатДокументыДляПроведения.Пустой() Тогда
		
		ВыборкаДокументыДляПроведения = РезультатДокументыДляПроведения.Выбрать();
		
		Пока ВыборкаДокументыДляПроведения.Следующий() Цикл
			НаборСтабильныеПериоды = РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
			НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборСтабильныеПериоды.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
			НаборСтабильныеПериоды.Отбор.ПериодНачисления.Установить(ПериодНачисления);
			НаборСтабильныеПериоды.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
			НаборСтабильныеПериоды.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
			Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
				НаборСтабильныеПериоды.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
			КонецЕсли;
			НаборСтабильныеПериоды.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор);
			
			НаборСтабильныеПериодыШкалы	= РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
			НаборСтабильныеПериодыШкалы.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборСтабильныеПериодыШкалы.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
			НаборСтабильныеПериодыШкалы.Отбор.ПериодНачисления.Установить(ПериодНачисления);
			НаборСтабильныеПериодыШкалы.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
			НаборСтабильныеПериодыШкалы.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
			Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
				НаборСтабильныеПериодыШкалы.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
			КонецЕсли;
			НаборСтабильныеПериодыШкалы.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор);				 
			
			НаборСтабильныеПериодыИзмерителиНаправлений = РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
			НаборСтабильныеПериодыИзмерителиНаправлений.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
			НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.ПериодНачисления.Установить(ПериодНачисления);
			НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
			НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
			Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
				НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
			КонецЕсли;
			НаборСтабильныеПериодыИзмерителиНаправлений.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор);				 
			
			НаборНомерСтрокСтабПериода = РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
			НаборНомерСтрокСтабПериода.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборНомерСтрокСтабПериода.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
			НаборНомерСтрокСтабПериода.Отбор.ПериодНачисления.Установить(ПериодНачисления);
			НаборНомерСтрокСтабПериода.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
			НаборНомерСтрокСтабПериода.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
			Если Не ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
				НаборНомерСтрокСтабПериода.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
			КонецЕсли;
			НаборНомерСтрокСтабПериода.Отбор.ДокРегистратор.Установить(ВыборкаДокументыДляПроведения.ДокРегистратор); 			 
			
			НаборМаксимальныеПоказания = РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
			НаборМаксимальныеПоказания.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			НаборМаксимальныеПоказания.Отбор.Организация.Установить(ВыборкаДокументыДляПроведения.Организация);
			НаборМаксимальныеПоказания.Отбор.ПериодНачисления.Установить(ПериодНачисления);
			НаборМаксимальныеПоказания.Отбор.Район.Установить(ВыборкаДокументыДляПроведения.Район);
			НаборМаксимальныеПоказания.Отбор.ЧастныйСектор.Установить(ВыборкаДокументыДляПроведения.ЧастныйСектор);
			Если НЕ ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
				НаборМаксимальныеПоказания.Отбор.Строение.Установить(ВыборкаДокументыДляПроведения.Строение);
			КонецЕсли;
			
			НачатьТранзакцию();
			
			Попытка
				
				НаборСтабильныеПериоды.Записать();
				НаборСтабильныеПериодыШкалы.Записать();
				НаборСтабильныеПериодыИзмерителиНаправлений.Записать();
				НаборНомерСтрокСтабПериода.Записать(); 						
				НаборМаксимальныеПоказания.Записать();
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				Инфо = ИнформацияОбОшибке();
				ПредставлениеОшибки = ПодробноеПредставлениеОшибки(Инфо);
				
				Префикс = "Строение: ";
				Если НЕ ВыборкаДокументыДляПроведения.ЧастныйСектор Тогда
					Префикс = Префикс + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДокументыДляПроведения.Строение, "Наименование");
				Иначе 			
					Префикс = Префикс + "частный сектор";
				КонецЕсли;
				Ошибка = Префикс + ". Причина: " + ПредставлениеОшибки; 				
				Ошибки.Добавить(Ошибка);	
							
				ЗаписьЖурналаРегистрации(
					ИмяСобытияОшибки,
					УровеньЖурналаРегистрации.Ошибка,,,
					Ошибка);
				
			КонецПопытки;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Ошибки, Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработкаДанныхПриЗаполненномРезультатеЗапроса

Процедура ОбработатьДанные(ОсновныеПараметры, Выборка, Контекст, ДополнительныеПараметры)
	
	МенеджерСтабильныеПериоды = РегистрыСведений.энргСтабильныеПериоды;
	МенеджерСтабильныеПериодыШкалы = РегистрыСведений.энргСтабильныеПериодыШкалы;
	МенеджерСтабильныеПериодыИзмерителиНаправлений = РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений;
	МенеджерНомераСтрокСтабильногоПериода = РегистрыСведений.энргНомераСтрокСтабильногоПериода;
	МенеджерМаксимальныеПоказанияСрез = РегистрыСведений.энргМаксимальныеПоказанияСрез;
	
	СоставЖильцовРазделенныхЛС = Новый Соответствие;	
	Пока Выборка.Следующий() Цикл 		
		
		МКД	= ?(НЕ Выборка.ЧастныйСектор, Выборка.Строение, Контекст.ПустоеСтроение);
		
		Если НЕ Контекст.ТекМКД = МКД тогда  
			
			СоставЖильцовРазделенныхЛС = Новый Соответствие;
			
			Если НЕ Контекст.ТекМКД = Неопределено Тогда 
				
				ОперацииПриСменеМКД(ОсновныеПараметры, Контекст);			
							
			КонецЕсли;
						
			Контекст.НаборСтабильныеПериоды = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(МенеджерСтабильныеПериоды);
			//РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
			//Контекст.НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			Контекст.НаборСтабильныеПериодыШкалы = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(МенеджерСтабильныеПериодыШкалы);
			//РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
			//Контекст.НаборСтабильныеПериодыШкалы.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			Контекст.НаборСтабильныеПериодыИзмерителиНаправлений = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(МенеджерСтабильныеПериодыИзмерителиНаправлений);
			//РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
			//Контекст.НаборСтабильныеПериодыИзмерителиНаправлений.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			Контекст.НаборНомерСтрокСтабПериода = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(МенеджерНомераСтрокСтабильногоПериода);
			//РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
			//Контекст.НаборНомерСтрокСтабПериода.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
			Контекст.НаборМаксимальныеПоказания = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(МенеджерМаксимальныеПоказанияСрез);
			//РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
			//Контекст.НаборМаксимальныеПоказания.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			
		КонецЕсли;     		
			
		СтрокаСтабПериоды = Контекст.НаборСтабильныеПериоды.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСтабПериоды, Выборка);	
		Если Выборка.ЭтоВводНачальныхОстатков Тогда
			ЗаполнитьСоставЖильцов(СтрокаСтабПериоды, Выборка, СоставЖильцовРазделенныхЛС);
		КонецЕсли;		
		СтрокаСтабПериоды.ПериодНачисления = ОсновныеПараметры.ПериодНачисления;
		
		//СтрокаНомеровСтрок = Контекст.НаборНомерСтрокСтабПериода.Добавить();
		//ЗаполнитьЗначенияСвойств(СтрокаНомеровСтрок, Выборка);
		//СтрокаНомеровСтрок.ПериодНачисления = ОсновныеПараметры.ПериодНачисления;
		//СтрокаНомеровСтрок.Период  			= Выборка.ДатаРегистратора;
			
		Контекст.ТекМКД = ?(НЕ Выборка.ЧастныйСектор, Выборка.Строение, Контекст.ПустоеСтроение);
	КонецЦикла;  
	
	Если НЕ Контекст.ТекМКД = Неопределено Тогда 
		
		ОперацииПриСменеМКД(ОсновныеПараметры, Контекст);
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьКонтекст(Контекст, РезультатЗапроса)
	
	Контекст.Вставить("Ошибки", Новый Массив);
	Контекст.Вставить("ИмяСобытияОшибки", НСтр("ru = 'Выполнение отложенных движений физ лица. Заполнение данных'"));
	Контекст.Вставить("ПустоеСтроение", ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"));
	Контекст.Вставить("ТекМКД", Неопределено);
	Контекст.Вставить("РазделСтабильныеПериоды", ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.энргРазделыЗаписи.СтабильныеПериоды"));
	Контекст.Вставить("НаборСтабильныеПериоды", Неопределено);
	Контекст.Вставить("НаборНомерСтрокСтабПериода", Неопределено); 	
	
	Контекст.Вставить("ВыборкаДокументов",  РезультатЗапроса[1].Выбрать());
	Контекст.Вставить("ЕстьСледующийДокумент", Контекст.ВыборкаДокументов.Следующий());
	
	Контекст.Вставить("ВыборкаШкалы", РезультатЗапроса[3].Выбрать());
	Контекст.Вставить("НаборСтабильныеПериодыШкалы", Неопределено);
	Контекст.Вставить("ЕстьСледующийШкалы", Контекст.ВыборкаШкалы.Следующий());
	
	Контекст.Вставить("ВыборкаИзмерители", РезультатЗапроса[4].Выбрать());
	Контекст.Вставить("НаборСтабильныеПериодыИзмерителиНаправлений", Неопределено);
	Контекст.Вставить("ЕстьСледующийИзмерители", Контекст.ВыборкаИзмерители.Следующий());
	
	Контекст.Вставить("ВыборкаПоказания", РезультатЗапроса[2].Выбрать());
	Контекст.Вставить("НаборМаксимальныеПоказания", Неопределено);
	Контекст.Вставить("ЕстьСледующийПоказания", Контекст.ВыборкаПоказания.Следующий());
	
КонецПроцедуры

#Область ОперацииПриСменеМКД

Процедура ОперацииПриСменеМКД(ОсновныеПараметры, Контекст)
	
	ЗаполнитьПоказания(Контекст);	
	ЗаполнитьШкалы(Контекст);
	ЗаполнитьИзмерители(Контекст); 	
	
	Если ОсновныеПараметры.СбрасыватьСостояниеПоследовательности Тогда 
		ПодготовленныеПоследовательности = ПодготовитьДанныеПоследовательности(ОсновныеПараметры, Контекст);
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
	Попытка 
		
		ОчиститьТекущиеЗаписи(ОсновныеПараметры, Контекст); 		
		
		Если ОсновныеПараметры.СбрасыватьСостояниеПоследовательности Тогда 
			СброситьСостояниеПоследовательностей(ПодготовленныеПоследовательности, ОсновныеПараметры, Контекст);			
		КонецЕсли;
		
		НаборОтложенные = РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
		НаборОтложенные.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
		НаборОтложенные.Отбор.Организация.Установить(ОсновныеПараметры.Организация);
		НаборОтложенные.Отбор.ПериодНачисления.Установить(ОсновныеПараметры.ПериодНачисления);
		НаборОтложенные.Отбор.Район.Установить(ОсновныеПараметры.Район); 						
		НаборОтложенные.Отбор.РазделЗаписи.Установить(Контекст.РазделСтабильныеПериоды);
		НаборОтложенные.Отбор.ЧастныйСектор.Установить(НЕ ЗначениеЗаполнено(Контекст.ТекМКД));
		НаборОтложенные.Отбор.Строение.Установить(Контекст.ТекМКД);
		НаборОтложенные.Записать(); 
		
		Контекст.НаборСтабильныеПериоды.Записать(Ложь);
		Контекст.НаборСтабильныеПериодыШкалы.Записать(Ложь);
		Контекст.НаборСтабильныеПериодыИзмерителиНаправлений.Записать(Ложь);
		Контекст.НаборНомерСтрокСтабПериода.Записать(Ложь); 						
		Контекст.НаборМаксимальныеПоказания.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();		
		 
	Исключение
		
		ОтменитьТранзакцию(); 					
		
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Префикс = "Строение: ";
		Если ЗначениеЗаполнено(Контекст.ТекМКД) Тогда
			Префикс = Префикс + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст.ТекМКД, "Наименование");
		Иначе 			
			Префикс = Префикс + "частный сектор";
		КонецЕсли;
		Ошибка = Префикс + ". Причина: " + ПредставлениеОшибки;
		Контекст.Ошибки.Добавить(Ошибка);
		
		ЗаписьЖурналаРегистрации(
			Контекст.ИмяСобытияОшибки,
			УровеньЖурналаРегистрации.Ошибка,,,
			Ошибка);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьПоказания(Контекст)
	
	НаборМаксимальныеПоказания = Контекст.НаборМаксимальныеПоказания;
	ВыборкаПоказания = Контекст.ВыборкаПоказания;
	ЕстьСледующийПоказания = Контекст.ЕстьСледующийПоказания;
	
	Пока ЕстьСледующийПоказания И ?(НЕ ВыборкаПоказания.ЧастныйСектор, ВыборкаПоказания.Строение, Контекст.ПустоеСтроение) = Контекст.ТекМКД Цикл
		
		СтрокаНабораПоказаний = НаборМаксимальныеПоказания.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаПоказания);
		
		Если ВыборкаПоказания.ЭтоВводНачальныхОстатков Тогда
			СтрокаНабораПоказаний = НаборМаксимальныеПоказания.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаПоказания);
			СтрокаНабораПоказаний.ПериодНачисления = НачалоМесяца(ВыборкаПоказания.ПериодНачисления - 1);						
		КонецЕсли; 					
		
		ЕстьСледующийПоказания = ВыборкаПоказания.Следующий();
		Если НЕ ЕстьСледующийПоказания Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШкалы(Контекст)
	
	НаборСтабильныеПериодыШкалы = Контекст.НаборСтабильныеПериодыШкалы;
	ВыборкаШкалы = Контекст.ВыборкаШкалы;
	ЕстьСледующийШкалы = Контекст.ЕстьСледующийШкалы;
	
	Пока ЕстьСледующийШкалы И ?(НЕ ВыборкаШкалы.ЧастныйСектор, ВыборкаШкалы.Строение, Контекст.ПустоеСтроение) = Контекст.ТекМКД Цикл
		
		СтрокаНабораПоказаний = НаборСтабильныеПериодыШкалы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабораПоказаний, ВыборкаШкалы);
		
		ЕстьСледующийШкалы = ВыборкаШкалы.Следующий();
		Если НЕ ЕстьСледующийШкалы Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИзмерители(Контекст)
	
	НаборСтабильныеПериодыИзмерителиНаправлений = Контекст.НаборСтабильныеПериодыИзмерителиНаправлений;
	ВыборкаИзмерители = Контекст.ВыборкаИзмерители;
	ЕстьСледующийИзмерители = Контекст.ЕстьСледующийИзмерители;
	
	Пока ЕстьСледующийИзмерители И ?(НЕ ВыборкаИзмерители.ЧастныйСектор, ВыборкаИзмерители.Строение, Контекст.ПустоеСтроение) = Контекст.ТекМКД Цикл
		
		СтрокаНабораИзмерители = НаборСтабильныеПериодыИзмерителиНаправлений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабораИзмерители, ВыборкаИзмерители);
		
		ЕстьСледующийИзмерители = ВыборкаИзмерители.Следующий();
		Если НЕ ЕстьСледующийИзмерители Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьТекущиеЗаписи(ОсновныеПараметры, Контекст)
	
	ЕстьСледующийДокумент = Контекст.ЕстьСледующийДокумент;
	ВыборкаДокументов = Контекст.ВыборкаДокументов;
	
	// Очищаем набор записей и создаем приемники данных.
	Пока ЕстьСледующийДокумент И ?(НЕ ВыборкаДокументов.ЧастныйСектор, ВыборкаДокументов.Строение, Контекст.ПустоеСтроение) = Контекст.ТекМКД Цикл
		
		ОчиститьНаборыЗаписей(
			ОсновныеПараметры.Организация, 
			ОсновныеПараметры.ПериодНачисления, 
			ОсновныеПараметры.Район,
			ВыборкаДокументов.ЧастныйСектор, 
			ВыборкаДокументов.Строение, 
			ВыборкаДокументов.ДокРегистратор, 
			ВыборкаДокументов.ЭтоВводНачальныхОстатков);
		
		ЕстьСледующийДокумент = ВыборкаДокументов.Следующий();
		Если НЕ ЕстьСледующийДокумент Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьНаборыЗаписей(Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, ДокРегистратор, ВводНачальныхОстатков)
	
	НаборСтабильныеПериоды = РегистрыСведений.энргСтабильныеПериоды.СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборСтабильныеПериоды.Отбор.Организация.Установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.Установить(Район);
	НаборСтабильныеПериоды.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборСтабильныеПериоды.Отбор.Строение.Установить(Строение);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	
	НаборСтабильныеПериоды = РегистрыСведений.энргСтабильныеПериодыШкалы.СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборСтабильныеПериоды.Отбор.Организация.Установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.Установить(Район);
	НаборСтабильныеПериоды.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборСтабильныеПериоды.Отбор.Строение.Установить(Строение);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	  	
	НаборСтабильныеПериоды = РегистрыСведений.энргСтабильныеПериодыИзмерителиНаправлений.СоздатьНаборЗаписей();
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования",Истина);
	НаборСтабильныеПериоды.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборСтабильныеПериоды.Отбор.Организация.Установить(Организация);
	НаборСтабильныеПериоды.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборСтабильныеПериоды.Отбор.Район.Установить(Район);
	НаборСтабильныеПериоды.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборСтабильныеПериоды.Отбор.Строение.Установить(Строение);
	КонецЕсли;
	НаборСтабильныеПериоды.записать();
	
	НаборНомерСтрокСтабПериода = РегистрыСведений.энргНомераСтрокСтабильногоПериода.СоздатьНаборЗаписей();
	НаборНомерСтрокСтабПериода.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборНомерСтрокСтабПериода.Отбор.Организация.Установить(Организация);
	НаборНомерСтрокСтабПериода.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборНомерСтрокСтабПериода.Отбор.Район.Установить(Район);
	НаборНомерСтрокСтабПериода.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборНомерСтрокСтабПериода.Отбор.Строение.Установить(Строение);
	КонецЕсли;
	НаборНомерСтрокСтабПериода.Записать();
	
	НаборМаксимальныеПоказания = РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
	НаборМаксимальныеПоказания.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборМаксимальныеПоказания.Отбор.Организация.Установить(Организация);
	НаборМаксимальныеПоказания.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборМаксимальныеПоказания.Отбор.Район.Установить(Район);
	НаборМаксимальныеПоказания.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда 
		НаборМаксимальныеПоказания.Отбор.Строение.Установить(Строение);
	КонецЕсли;
	НаборМаксимальныеПоказания.Записать();
	
	Если ВводНачальныхОстатков тогда
		
		ПредыдущийПериод = НачалоМесяца(ПериодНачисления-1);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргМаксимальныеПоказанияСрез.ПриборУчета КАК ПриборУчета
		|ИЗ
		|	РегистрСведений.энргМаксимальныеПоказанияСрез КАК энргМаксимальныеПоказанияСрез
		|ГДЕ
		|	энргМаксимальныеПоказанияСрез.Организация = &Организация
		|	И энргМаксимальныеПоказанияСрез.ПериодНачисления = &ПериодНачисления
		|	И энргМаксимальныеПоказанияСрез.Район = &Район
		|	И энргМаксимальныеПоказанияСрез.ЧастныйСектор = &ЧастныйСектор
		|	И энргМаксимальныеПоказанияСрез.Строение = &Строение
		|	И энргМаксимальныеПоказанияСрез.ДокРегистратор = &ДокРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	энргМаксимальныеПоказанияСрез.ПриборУчета";
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ПериодНачисления",	ПредыдущийПериод);
		Запрос.УстановитьПараметр("Район",				Район);
		Запрос.УстановитьПараметр("ЧастныйСектор",		ЧастныйСектор);
		Запрос.УстановитьПараметр("ДокРегистратор",		ДокРегистратор);
		Если НЕ ЧастныйСектор Тогда 
			Запрос.УстановитьПараметр("Строение",		Строение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргМаксимальныеПоказанияСрез.Строение = &Строение", "");
		КонецЕсли;
		ВыборкаМаксПок = Запрос.Выполнить().Выбрать();
		Пока ВыборкаМаксПок.Следующий() Цикл 
			
			НаборМаксимальныеПоказания = РегистрыСведений.энргМаксимальныеПоказанияСрез.СоздатьНаборЗаписей();
			НаборМаксимальныеПоказания.Отбор.Организация.Установить(Организация);
			НаборМаксимальныеПоказания.Отбор.ПериодНачисления.Установить(ПредыдущийПериод);
			НаборМаксимальныеПоказания.Отбор.Район.Установить(Район);
			НаборМаксимальныеПоказания.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
			Если НЕ ЧастныйСектор Тогда 
				НаборМаксимальныеПоказания.Отбор.Строение.Установить(Строение);
			КонецЕсли;
			НаборМаксимальныеПоказания.Отбор.ПриборУчета.Установить(ВыборкаМаксПок.ПриборУчета);
			НаборМаксимальныеПоказания.Записать();
		КонецЦикла;
	КонецЕсли; 
	
	
	//// ИЗ-ЗА этого возникает конфликт блокировок
	//НаборОтложенныхДвижений = РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	//НаборОтложенныхДвижений.Отбор.ДокРегистратор.Установить(ДокРегистратор);
	//НаборОтложенныхДвижений.Записать();
	
КонецПроцедуры

#Область СбросПоследовательностей

Функция ПодготовитьДанныеПоследовательности(ОсновныеПараметры, Контекст)
	
	Результат = Новый Структура;
	
	РезультатЗапросаСтабильные = РезультатЗапросаСостояниеПоследовательностиСтабильные(
		ОсновныеПараметры,
		Контекст.ТекМКД);		
	
	РезультатЗапросаПоказания = РезультатЗапросаСостояниеПоследовательностиПоказания(
		ОсновныеПараметры,
		Контекст.ТекМКД);
	
	РезультатЗапросаВзаиморасчеты = РезультатЗапросаСостояниеПоследовательностиВзаиморасчеты(
		ОсновныеПараметры,
		Контекст.ТекМКД);
		
	Результат.Вставить("энргСтабильныеПериодыПоследовательность", РезультатЗапросаСтабильные);
	Результат.Вставить("энргПоказанияПУПоследовательность", РезультатЗапросаПоказания);
	Результат.Вставить("энргВзаиморасчетыПоследовательность", РезультатЗапросаВзаиморасчеты);
	
	Возврат Результат;
	
КонецФункции

Функция РезультатЗапросаСостояниеПоследовательностиСтабильные(ОсновныеПараметры, Строение, Помещение = Неопределено)
	
	ЧастныйСектор = НЕ ЗначениеЗаполнено(Строение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтабильныеПериодыПоследовательность.Организация КАК Организация,
		|	энргСтабильныеПериодыПоследовательность.ПериодНачисления КАК ПериодНачисления,
		|	энргСтабильныеПериодыПоследовательность.Район КАК Район,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности) КАК СостояниеПроведения,
		|	энргСтабильныеПериодыПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
		|	энргСтабильныеПериодыПоследовательность.Строение КАК Строение,
		|	энргСтабильныеПериодыПоследовательность.Помещение КАК Помещение,
		|	энргСтабильныеПериодыПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
		|	энргСтабильныеПериодыПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
		|	энргСтабильныеПериодыПоследовательность.ДокРегистратор КАК ДокРегистратор,
		|	энргСтабильныеПериодыПоследовательность.УдалитьАбонент КАК УдалитьАбонент
		|ИЗ
		|	РегистрСведений.энргСтабильныеПериодыПоследовательность КАК энргСтабильныеПериодыПоследовательность
		|ГДЕ
		|	энргСтабильныеПериодыПоследовательность.Организация = &Организация
		|	И энргСтабильныеПериодыПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргСтабильныеПериодыПоследовательность.Район = &Район
		|	И энргСтабильныеПериодыПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности)
		|	И энргСтабильныеПериодыПоследовательность.ЧастныйСектор = &ЧастныйСектор
		|	И энргСтабильныеПериодыПоследовательность.Строение = &Строение
		|	И энргСтабильныеПериодыПоследовательность.Помещение = &Помещение";   	
	                                      
	Запрос.УстановитьПараметр("Организация", ОсновныеПараметры.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", ОсновныеПараметры.ПериодНачисления);
	Запрос.УстановитьПараметр("Район", ОсновныеПараметры.Район);
	Запрос.УстановитьПараметр("ЧастныйСектор", ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда
		Запрос.УстановитьПараметр("Строение", Строение);
		Если Помещение = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргСтабильныеПериодыПоследовательность.Помещение = &Помещение", "");	
		Иначе 			
			Запрос.УстановитьПараметр("Помещение", Помещение);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргСтабильныеПериодыПоследовательность.Строение = &Строение", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргСтабильныеПериодыПоследовательность.Помещение = &Помещение", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция РезультатЗапросаСостояниеПоследовательностиПоказания(ОсновныеПараметры, Строение, Помещение = Неопределено)
	
	ЧастныйСектор = НЕ ЗначениеЗаполнено(Строение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПоказанияПУПоследовательность.Организация КАК Организация,
		|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
		|	энргПоказанияПУПоследовательность.Район КАК Район,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности) КАК СостояниеПроведения,
		|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
		|	энргПоказанияПУПоследовательность.Строение КАК Строение,
		|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
		|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
		|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
		|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель,
		|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
		|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
		|	энргПоказанияПУПоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	энргПоказанияПУПоследовательность.ИмяТабЧасти КАК ИмяТабЧасти
		|ИЗ
		|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
		|ГДЕ
		|	энргПоказанияПУПоследовательность.Организация = &Организация
		|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргПоказанияПУПоследовательность.Район = &Район
		|	И энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности)
		|	И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор
		|	И энргПоказанияПУПоследовательность.Строение = &Строение
		|	И энргПоказанияПУПоследовательность.Помещение = &Помещение";   	
	                                      
	Запрос.УстановитьПараметр("Организация", ОсновныеПараметры.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", ОсновныеПараметры.ПериодНачисления);
	Запрос.УстановитьПараметр("Район", ОсновныеПараметры.Район);
	Запрос.УстановитьПараметр("ЧастныйСектор", ЧастныйСектор);
	Если НЕ ЧастныйСектор Тогда
		Запрос.УстановитьПараметр("Строение", Строение);
		Если Помещение = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргПоказанияПУПоследовательность.Помещение = &Помещение", "");	
		Иначе 			
			Запрос.УстановитьПараметр("Помещение", Помещение);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргПоказанияПУПоследовательность.Строение = &Строение", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргПоказанияПУПоследовательность.Помещение = &Помещение", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция РезультатЗапросаСостояниеПоследовательностиВзаиморасчеты(ОсновныеПараметры, Строение, Помещение = Неопределено)
	
	ЧастныйСектор = НЕ ЗначениеЗаполнено(Строение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоследовательность.Организация КАК Организация,
		|	энргВзаиморасчетыПоследовательность.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоследовательность.Район КАК Район,
		|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности) КАК СостояниеПроведения,
		|	энргВзаиморасчетыПоследовательность.МКД КАК МКД,
		|	энргВзаиморасчетыПоследовательность.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
		|	энргВзаиморасчетыПоследовательность.ДокРегистратор КАК ДокРегистратор,
		|	энргВзаиморасчетыПоследовательность.Разделитель КАК Разделитель,
		|	энргВзаиморасчетыПоследовательность.ЭтоОплата КАК ЭтоОплата,
		|	энргВзаиморасчетыПоследовательность.Кассир КАК Кассир,
		|	энргВзаиморасчетыПоследовательность.ИсточникПоступления КАК ИсточникПоступления,
		|	энргВзаиморасчетыПоследовательность.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты
		|ИЗ
		|	РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
		|ГДЕ
		|	энргВзаиморасчетыПоследовательность.Организация = &Организация
		|	И энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргВзаиморасчетыПоследовательность.Район = &Район
		|	И энргВзаиморасчетыПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности)
		|	И энргВзаиморасчетыПоследовательность.МКД = &МКД
		|	И энргВзаиморасчетыПоследовательность.Абонент = &Абонент";   	
	                                      
	Запрос.УстановитьПараметр("Организация", ОсновныеПараметры.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления", ОсновныеПараметры.ПериодНачисления);
	Запрос.УстановитьПараметр("Район", ОсновныеПараметры.Район);
	Запрос.УстановитьПараметр("МКД", Строение);
	Если Помещение = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И энргВзаиморасчетыПоследовательность.Абонент = &Абонент", "");	
	Иначе 			
		Запрос.УстановитьПараметр("Абонент", Помещение);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура СброситьСостояниеПоследовательностей(ПодготовленныеПоследовательности, ОсновныеПараметры, Контекст)
	
	СброситьСостояниеПоследовательности(
		ПодготовленныеПоследовательности,
		"энргСтабильныеПериодыПоследовательность",
		ОсновныеПараметры,
		Контекст.ТекМКД);		
	
	СброситьСостояниеПоследовательности(
		ПодготовленныеПоследовательности,
		"энргПоказанияПУПоследовательность",
		ОсновныеПараметры,
		Контекст.ТекМКД);
	
	СброситьСостояниеПоследовательности(
		ПодготовленныеПоследовательности,
		"энргВзаиморасчетыПоследовательность",
		ОсновныеПараметры,
		Контекст.ТекМКД);
	
КонецПроцедуры

// Сбросывает состояние последовательности.
//
// Параметры:
//   ИмяПоследовательности	- Имя последовательности, по которой происходит сброс состояния.
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//   МКД					- МКД, по которому происходит восстановление последовательности.
//   Абонент				- Абонент, по которому происходит восстановление последовательности.
//
Процедура СброситьСостояниеПоследовательности(ПодготовленныеПоследовательности, ИмяПоследовательности, ОсновныеПараметры, Строение=Неопределено, Помещение=Неопределено)		

	ПроведенВПоследовательности = ПредопределенноеЗначение("Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности");
	
	Набор = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений[ИмяПоследовательности]);
	//Набор = РегистрыСведений[ИмяПоследовательности].СоздатьНаборЗаписей();
	//Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.Отбор.Организация.Установить(ОсновныеПараметры.Организация);
	Набор.Отбор.ПериодНачисления.Установить(ОсновныеПараметры.ПериодНачисления);
	Набор.Отбор.Район.Установить(ОсновныеПараметры.Район);
	Набор.Отбор.СостояниеПроведения.Установить(ПроведенВПоследовательности);
	
	Если ИмяПоследовательности = "энргВзаиморасчетыПоследовательность" Тогда
		
		Набор.Отбор.МКД.Установить(Строение);
		Если НЕ Помещение = Неопределено тогда
			Набор.Отбор.Абонент.Установить(Помещение);
		КонецЕсли;
		
	ИначеЕсли НЕ Строение = Неопределено Тогда
		
		ЧастныйСектор = НЕ ЗначениеЗаполнено(Строение); 
		Набор.Отбор.ЧастныйСектор.Установить(ЧастныйСектор);
		Если Не ЧастныйСектор Тогда
			Набор.Отбор.Строение.Установить(Строение); 
			Если НЕ Помещение = Неопределено тогда
				Набор.Отбор.Помещение.Установить(Помещение);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	 
	
	Набор.Записать();
	
	
	ТаблицаНабора = ПодготовленныеПоследовательности[ИмяПоследовательности];
	Если ТаблицаНабора.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	//Набор = РегистрыСведений[ИмяПоследовательности].СоздатьНаборЗаписей();
	//Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыСведений[ИмяПоследовательности]);
	Набор.Загрузить(ТаблицаНабора.Выгрузить());
	Набор.Записать(Ложь); 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаССоставомЖильцом

Процедура ЗаполнитьСоставЖильцов(СтрокаСтабПериоды, Выборка, СоставЖильцовРазделенныхЛС)
	Если НЕ ЗначениеЗаполнено(Выборка.Абонент) Тогда
		   СтрокаСтабПериоды.СоставЖильцов = СоставЖильцовРазделенныхЛС[Выборка.Помещение];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПомещениеРодитель) Тогда
		Если СоставЖильцовРазделенныхЛС[Выборка.ПомещениеРодитель] = Неопределено Тогда
			СоставЖильцовРазделенныхЛС.Вставить(Выборка.ПомещениеРодитель, ПолучитьСоставЖильцов(Выборка))
		Иначе
			СоставЖильцовРазделенныхЛС[Выборка.ПомещениеРодитель] = ПолучитьСоставЖильцов(Выборка, СоставЖильцовРазделенныхЛС[Выборка.ПомещениеРодитель]);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСоставЖильцов(Выборка, стрСоставЖильцов = "")
	
	яСоставЖильцов 						= Новый ФиксированнаяСтруктура("КоличествоПроживающих,КоличествоПрописанных,КоличествоСобственников", 0, 0, 0);
	
	IDКлючПомещения 					= "" + Выборка.КлючПомещения.УникальныйИдентификатор();
	СоставЖильцов  						= Новый Соответствие;
	Если НЕ ПустаяСтрока(стрСоставЖильцов) Тогда
		Чтение  						= Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(стрСоставЖильцов);
		СоставЖильцов 					= ПрочитатьJSON(Чтение,Истина);
	КонецЕсли;
	
	Если СоставЖильцов[IDКлючПомещения] = Неопределено Тогда
		Значение 						= Новый Структура(яСоставЖильцов);
		ЗаполнитьЗначенияСвойств(Значение,Выборка); 
		СоставЖильцов.Вставить(IDКлючПомещения, Значение);
	Иначе
		Значение 						= Новый Структура(яСоставЖильцов);
		ЗаполнитьЗначенияСвойств(Значение,Выборка);
		СоставЖильцов[IDКлючПомещения] 	= Значение;
	КонецЕсли; 	
	
	Запись 								= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();	
	ЗаписатьJSON(Запись,СоставЖильцов);
	
	Возврат Запись.Закрыть()
	
КонецФункции
	
#КонецОбласти

#Область РаботаССреднимОбъемомПотребления

// ПЕРЕНЕСТИ ОБЛАСТЬ В ДРУГОЙ МОДУЛЬ
////////////////////////////////////

Процедура ПересчитатьСреднийОбъемПотребления(ОсновныеПараметры)
	
	Организация = ОсновныеПараметры.Организация;
	ПериодНачисления = ОсновныеПараметры.ПериодНачисления;
	Район = ОсновныеПараметры.Район;
	Строение = ОсновныеПараметры.Строение;	
	
	ЧастныйСектор = Неопределено;
	Если Не Строение = Неопределено И ЗначениеЗаполнено(Строение) Тогда
		ЧастныйСектор = Ложь;
	ИначеЕсли Не Строение = Неопределено Тогда
		ЧастныйСектор = Истина;		
	КонецЕсли;	
	
	Если НЕ ЧастныйСектор = Неопределено И ЧастныйСектор И НЕ Строение = Неопределено И НЕ ЗначениеЗаполнено(Строение) Тогда
		ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления, Район, ЧастныйСектор);
	Иначе
		ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления, Район, ЧастныйСектор, Строение);
	КонецЕсли;
	
КонецПроцедуры

// Выполнение регламентных процедур
//
// Параметры:
//   ПериодНачисления 		- Период начисления, по которому происходит восстановление последовательности.
//   Район					- район, по которому происходит восстановление последовательности.
//   ОтборПоДому			- устанавливать отбор по дому.
//   МКД					- МКД, по которому происходит восстановление последовательности.
//   Абонент				- Абонент, по которому происходит восстановление последовательности.
//
Процедура ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления, Район, ЧастныйСектор=Неопределено, Строение=Неопределено, Помещение=Неопределено) Экспорт 
	
	РегистрыСведений.энргСреднийОбъемПотребленияАбонентов.АктуализироватьДанныеСреднегоОбъема(
		Организация, 
		ПериодНачисления,
		Район,
		ЧастныйСектор,
		Строение,
		Помещение);	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецОбласти