#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	ДанныеШапки = ДанныеШапки(); 
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргИзменениеЛьготыЖильцам_ЗагрузкаРеестраЕИРЦ Тогда
		ЗарегистрироватьСоответствиеКодаСоцЗащитыИЛьготника();
		
		Документы.энргИзменениеЛьготыЖильцам.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
		энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	Иначе
		энргРаботаСПараметрамиРасчетаАбонентаСервер.УстановитьЛьготнуюКатегорияЖильцам(ДанныеШапки, Жильцы, Движения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район);  
	ДанныеШапки.Вставить("Организация",				Организация);  
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	ДанныеШапки.Вставить("Абонент",					Абонент);
	ДанныеШапки.Вставить("Документ",				Ссылка);
	ДанныеШапки.Вставить("ВидОперации",				ВидОперации);
	
	Возврат ДанныеШапки;	
КонецФункции

Процедура ЗарегистрироватьСоответствиеКодаСоцЗащитыИЛьготника()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргИзменениеЛьготыЖильцамЗагруженныеДанные.Жилец КАК Жилец,
		|	энргИзменениеЛьготыЖильцамЗагруженныеДанные.КодСоциальнойЗащиты КАК КодСоциальнойЗащиты
		|ПОМЕСТИТЬ ТаблицаЛьготников
		|ИЗ
		|	Документ.энргИзменениеЛьготыЖильцам.ЗагруженныеДанные КАК энргИзменениеЛьготыЖильцамЗагруженныеДанные
		|ГДЕ
		|	энргИзменениеЛьготыЖильцамЗагруженныеДанные.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЛьготников.Жилец КАК Льготник,
		|	ТаблицаЛьготников.КодСоциальнойЗащиты КАК КодСоциальнойЗащиты
		|ИЗ
		|	ТаблицаЛьготников КАК ТаблицаЛьготников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргКодСоциальнойЗащитыЛьготника КАК энргКодСоциальнойЗащитыЛьготника
		|		ПО ТаблицаЛьготников.КодСоциальнойЗащиты = энргКодСоциальнойЗащитыЛьготника.КодСоциальнойЗащиты
		|ГДЕ
		|	ВЫБОР
		|			КОГДА энргКодСоциальнойЗащитыЛьготника.Льготник ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			КОГДА НЕ ТаблицаЛьготников.Жилец = энргКодСоциальнойЗащитыЛьготника.Льготник
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МодульэнргРаботаСЛьготникамиЕИРЦ = ОбщегоНазначения.ОбщийМодуль("энргРаботаСЛьготникамиЕИРЦ");
		
		МодульэнргРаботаСЛьготникамиЕИРЦ.ЗарегистрироватьСоответствиеКодаСоцЗащитыИЛьготника(Выборка.КодСоциальнойЗащиты,
			Выборка.Льготник);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли