#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры        

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьВидимость();
КонецПроцедуры

#КонецОбласти       

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимость()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОбъемыУК", 
		"Видимость", энргОбщегоНазначения.ЗначениеКонстанты("бестИспользоватьДанныеДляРасчетаТепловойЭнергииТеплоносителяИХВСЮЛ"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОбъемыУКЭЭ", 
		"Видимость", энргОбщегоНазначения.ЗначениеКонстанты("бестИспользоватьДанныеДляРасчетаЭлектроэнерииЮЛ"));
КонецПроцедуры

#КонецОбласти 