#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеДоговоров(Организация, Район, Период, Договор = Неопределено, ОбъектРасчета = Неопределено, ТочкаУчета = Неопределено, Услуга = Неопределено, МКД = Неопределено, ТолькоДоТП = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
		|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор,
		|	бестОбъектыРасчета.МКД КАК МКД
		|ИЗ
		|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета В (&ОбъектыРасчета)
		|				И ТочкаУчета = &ТочкаУчета
		|				И Услуга = &Услуга) КАК бестДоговорыТочекУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И ОбъектРасчета В (&ОбъектыРасчета)
		|					И ТочкаУчета = &ТочкаУчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
		|		ПО бестДоговорыТочекУчетаСрезПоследних.Организация = бестАктивностьТочекУчетаНПСрезПоследних.Организация
		|			И бестДоговорыТочекУчетаСрезПоследних.Район = бестАктивностьТочекУчетаНПСрезПоследних.Район
		|			И бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета
		|			И бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета = бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета
		|			И (НЕ бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП))
		|ГДЕ
		|	бестДоговорыТочекУчетаСрезПоследних.Договор В (&Договор)
		|	И бестОбъектыРасчета.МКД = &МКД";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Район) Тогда
		Запрос.УстановитьПараметр("Район", Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "Истина");
	КонецЕсли;

	Если ЗначениеЗаполнено(Договор) Тогда  
		Если ТипЗнч(Договор) <> Тип("Массив") Тогда
			мДоговор = Новый Массив;
			мДоговор.Добавить(Договор);
		Иначе
			мДоговор = Договор;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Договор", мДоговор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестДоговорыТочекУчетаСрезПоследних.Договор В (&Договор)", "Истина");
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.УстановитьПараметр("ОбъектыРасчета", ОбъектРасчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета В (&ОбъектыРасчета)", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТочкаУчета) Тогда
		Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТочкаУчета = &ТочкаУчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга", Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Услуга = &Услуга", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МКД) Тогда
		Запрос.УстановитьПараметр("МКД", МКД);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестОбъектыРасчета.МКД = &МКД", "Истина");
	КонецЕсли;
	
	Если ТолькоДоТП = Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
									"(НЕ бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП))", 
									"бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП)");
	ИначеЕсли ТолькоДоТП = Ложь Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
									"(НЕ бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.ДоТП))", 
									"Истина");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#КонецЕсли