#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет приборы узлов учета МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПриборыУзловУчетаМКД(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргПриборыТочекМКД.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочекМКД"); 
	Иначе		
		ЕстьПриборыДействующихТочек 		= Ложь;	
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ПриборыДействующихТочекМКД" Тогда
				ЕстьПриборыДействующихТочек = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьПриборыДействующихТочек Тогда
			РегистрыСведений.энргПриборыТочекМКД.ПриборыДействующихТочек(Схема,ПараметрыОтбора,"ПриборыДействующихТочекМКД");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 									= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПрибоыУзловУчетаМКД());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0];	
	Источник 								= ОператорВыбора.Источники[0].Источник;
	Параметры 								= Источник.Параметры;
	
	ПараметрПериод 							= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 			= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
			
	ВспомогательныеПоля 					= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПрибоыУзловУчетаМКД()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргПриборыУзловУчетаМКДСрезПоследних.Организация КАК Организация,
	|	энргПриборыУзловУчетаМКДСрезПоследних.Район КАК Район,
	|	энргПриборыУзловУчетаМКДСрезПоследних.МКД КАК МКД,
	|	энргПриборыУзловУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.УзелУчета КАК УзелУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.ТипИзмерителя КАК ТипИзмерителя,
	|	энргПриборыУзловУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыУзловУчета
	|ИЗ
	|	РегистрСведений.энргПриборыУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			(Организация, Район, МКД, ТочкаУчета, УзелУчета) В
	|					(ВЫБРАТЬ
	|					ПриборыДействующихТочекМКД.Организация,
	|					ПриборыДействующихТочекМКД.Район,
	|					ПриборыДействующихТочекМКД.МКД,
	|					ПриборыДействующихТочекМКД.ТочкаУчета,
	|					ПриборыДействующихТочекМКД.ПриборУчета
	|				ИЗ
	|					ПриборыДействующихТочекМКД КАК ПриборыДействующихТочекМКД)) КАК энргПриборыУзловУчетаМКДСрезПоследних
	|";

	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли