#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает исполнителя ОРП.
//
// Параметры:
//  Строение	-	СправочникСсылка.энргСтроения.
//  Исполнитель	-	СправочникСсылка.энргКонтрагенты.
//  Период		-	Дата.
//
Процедура УстановитьИсполнителяОРП(Строение, Исполнитель, Период) Экспорт

	ЗаписьРС = РегистрыСведений.энргИсполнителиОРП.СоздатьМенеджерЗаписи();
	
	ЗаписьРС.Строение 		 = Строение;
	ЗаписьРС.Период 		 = Период;
	ЗаписьРС.ИсполнительОРП  = Исполнитель;
	
	ЗаписьРС.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#КонецЕсли