#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийШапкиФормы

// Процедура - Начало выбора договора.
// Открытие формы выбора Договоров контрагента с отборами.
//
// Параметры:
//  Элемент					-	ПолеФормы.
//  Организация				-	СправочникСсылка.Организации.
//  Контрагент				-	СправочникСсылка.энргКонтрагенты.
//  СтандартнаяОбработка	-	Булево.
//  БлокЮридическихЛиц		-	Булево.
//
Процедура НачалоВыбораДоговора(Элемент, Организация, Контрагент = Неопределено, СтандартнаяОбработка, БлокЮридическихЛиц = Истина) Экспорт 
	СтандартнаяОбработка 	= ложь;	
	Отбор					= Новый Структура();
	ПараметрыВыбора  		= Новый Структура;
	Если ЗначениеЗаполнено(Организация) тогда
		Отбор.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент) тогда
		Отбор.Вставить("Контрагент",Контрагент);
	КонецЕсли;
	Отбор.Вставить("БлокЮридическихЛиц", БлокЮридическихЛиц);
	ПараметрыВыбора.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.энргДоговорыКонтрагентов.Форма.ФормаВыбора",ПараметрыВыбора,Элемент);
КонецПроцедуры

// Процедура - Начало выбора объекта.
// Открытие формы выбора Объектов расчета с отборами.
//
// Параметры:
//  Элемент					-	ПолеФормы.
//  Период					-	Дата.
//  Организация				-	СправочникСсылка.Организации.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  Договор					-	СправочникСсылка.энргДоговорыКонтрагентов.
//  СтандартнаяОбработка	-	Булево.
//  Включенные				-	Булево.
//
Процедура НачалоВыбораОбъекта(Элемент,Период,Организация,Район,Договор,СтандартнаяОбработка, Включенные) Экспорт  
	СтандартнаяОбработка 	= Ложь;
	ПараметрыВыбора  		= Новый Структура("Договор,Организация,Район,Период,Включенные",Договор, Организация, Район, Период, Включенные);
	ОткрытьФорму("Справочник.бестОбъектыРасчета.Форма.ФормаВыбора",ПараметрыВыбора,Элемент,,,,);	
КонецПроцедуры

// Процедура - При изменении договора контрагента.
// Заполнение свойств объекта реквизитами Договора.
//
// Параметры:
//  Объект				-	ДанныеФормыСтруктура.
//  ИсключаемыеСвойства	-	Строка.
//
Процедура ПриИзмененииДоговораКонтрагента(Объект, ИсключаемыеСвойства = "") Экспорт 
	
	ДанныеДоговора  		= энргРаботаСЛицевымСчетомКлиент.СтруктураЗначенийЗаполненияДоговора();
	ДанныеДоговора.Удалить("ДатаФактическогоСобытия");
	бестПользовательскийВводСервер.УстановитьЗависимыеРеквизитыДоговораКонтрагента(Объект.Договор,ДанныеДоговора);
	ЗаполнитьЗначенияСвойств(Объект,ДанныеДоговора);
		
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

// Функция отображает настраиваемый диалог выбора файлов или каталогов с заданными параметрами и возвращает
// путь к выбранному объекту либо пустую строку при отмене.
//
// Параметры:
//  Режим				-	РежимДиалогаВыбораФайла.
//  Заголовок			-	Строка					-	заголовок окна диалога.
//  Фильтр				-	Строка					-	фильтр файлов по расширениям.
//  МножественныйВыбор	-	Булево					-	разрешить выбор нескольких файлов.
//
// Возвращаемое значение:
//  Строка	-	выбранный путь.
//
Функция РаботаСДиалогомВыбора(Режим,Заголовок,Фильтр = Неопределено,МножественныйВыбор = Ложь) Экспорт 
	Диалог 						= Новый ДиалогВыбораФайла(Режим);
	Диалог.Заголовок 			= Заголовок;
	Диалог.МножественныйВыбор 	= МножественныйВыбор;
	
	Если не Фильтр = Неопределено Тогда
		Диалог.Фильтр = Фильтр;
	КонецЕсли;
	
	Если Диалог.Выбрать() Тогда
		Путь = ?(Режим = РежимДиалогаВыбораФайла.Открытие,Диалог.ПолноеИмяФайла,Диалог.Каталог);
	Иначе
		Предупреждение(НСтр("ru = 'Путь не выбран!'"));
		Путь = "";
	КонецЕсли;
	
	Возврат Путь;
КонецФункции

// Возвращает ключ заполнения информации объекта.
// 
// Возвращаемое значение:
//  Строка	-	ключ заполнение информации объекта.
//
Функция ПолучитьКлючЗаполненияИнформацииОбъекта() Экспорт
	 Возврат "НаименованиеОбъектаРасчета,НазначениеНП,КоличествоРабочихДней,КоличествоРабочихЧасовВДень,ПотреблениеВРабДни,ПотреблениеВРВыхДни,НаличиеГенерирующихУстановок,НагрузкаЭлектроприемника,РежимЭлСнабжения";
КонецФункции

#КонецОбласти

#КонецОбласти