#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойства данные оплаты.
// 
Процедура ДанныеОплаты() Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка", 			Ссылка);
	Запрос.Текст 	=
	
	"ВЫБРАТЬ
	|	энргРучноеИзменениеПени.Организация КАК Организация,
	|	энргРучноеИзменениеПени.ПериодНачисления КАК ПериодНачисления,
	|	энргРучноеИзменениеПени.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	энргРучноеИзменениеПени.Абонент КАК Абонент,
	|	энргРучноеИзменениеПени.Дата КАК Дата,
	|	энргРучноеИзменениеПени.Ссылка КАК ДокРегистратор,
	|	СУММА(энргРучноеИзменениеПениПени.Сумма) КАК СуммаОплаты,
	|	ЛОЖЬ КАК ЭтоОплата,
	|	ЛОЖЬ КАК ЭтоКорректировкаОплаты
	|ИЗ
	|	Документ.энргРучноеИзменениеПени.Пени КАК энргРучноеИзменениеПениПени
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргРучноеИзменениеПени.КлючПомещения = энргКлючиПомещений.Ссылка
	|		ПО энргРучноеИзменениеПениПени.Ссылка = энргРучноеИзменениеПени.Ссылка
	|ГДЕ
	|	энргРучноеИзменениеПениПени.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргРучноеИзменениеПени.Абонент,
	|	энргРучноеИзменениеПени.Организация,
	|	энргРучноеИзменениеПени.ПериодНачисления,
	|	энргРучноеИзменениеПени.Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	энргРучноеИзменениеПени.Дата,
	|	энргРучноеИзменениеПени.Ссылка";
	
	

	ДополнительныеСвойства.Вставить("ДанныеОплаты", Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	
	ДополнительныеСвойства.Вставить("Кассир",						Справочники.Пользователи.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ГруппаАбонентов", 				Истина);
	ДополнительныеСвойства.Вставить("ИсточникПоступления", 			Справочники.энргИсточникиПоступления.ПустаяСсылка());
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.энргРучноеИзменениеПени.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	//энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	  	
	
	// Удалить кусок. Исправить ручной перерасчет пени----
	//ДополнительныеСвойстваП	= ЭтотОбъект.ДополнительныеСвойства;
	//Движения 				= ЭтотОбъект.Движения;
	ТаблицыДвижений 		= ДополнительныеСвойства.ТаблицыДвижений;
	КлючиТаблицДвижений 	= ДополнительныеСвойства.КлючиТаблицДвижений;
	Для Каждого КлючЗначение Из КлючиТаблицДвижений Цикл
		Если Движения.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
			ОбъектДвижений = Движения[КлючЗначение.Ключ];
			
			Если КлючЗначение.Ключ = "энргНачислениеПени" Тогда 
				ОбъектДвижений.ДополнительныеСвойства.Вставить("ЭтоРучнойПерерасчетПени", Истина);
			КонецЕсли;
			ОбъектДвижений.Загрузить(ТаблицыДвижений[КлючЗначение.Значение].Выгрузить());
		КонецЕсли; 
		
	КонецЦикла;
	//-------
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция УслугиПоПериодам(ПериодНачисления, Услуги, ТЧПени) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргВидыУслуг.Ссылка КАК Услуга
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	Справочник.энргВидыУслуг КАК энргВидыУслуг
	|ГДЕ
	|	энргВидыУслуг.Ссылка В(&Услуги)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыНачисления.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	&ПериодыНачисления КАК ПериодыНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргРучноеИзменениеПениПени.Услуга КАК Услуга,
	|	энргРучноеИзменениеПениПени.Поставщик КАК Поставщик,
	|	энргРучноеИзменениеПениПени.ПериодРасчета КАК ПериодРасчета,
	|	энргРучноеИзменениеПениПени.ПериодНачисления КАК ПериодНачисления,
	|	энргРучноеИзменениеПениПени.Сумма КАК Сумма,
	|	энргРучноеИзменениеПениПени.IDСтроки КАК IDСтроки,
	|	энргРучноеИзменениеПениПени.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	энргРучноеИзменениеПениПени.СуммаРанееНачисленнойПени КАК СуммаРанееНачисленнойПени
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧПени КАК энргРучноеИзменениеПениПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.Услуга КАК Услуга,
	|	ВТ_Периоды.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ВТ_УслугиПериоды
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Периоды КАК ВТ_Периоды
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(энргНачислениеПени.Сумма) КАК Сумма,
	|	энргНачислениеПени.Услуга КАК Услуга,
	|	энргНачислениеПени.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ вт_Начисление
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК энргНачислениеПени
	|ГДЕ
	|	энргНачислениеПени.Абонент = &Абонент
	|	И энргНачислениеПени.Организация = &Организация
	|	И энргНачислениеПени.Район = &Район
	|	И энргНачислениеПени.МКД = &МКД
	|	И энргНачислениеПени.Период < &Период
	|	И (энргНачислениеПени.Услуга, энргНачислениеПени.ПериодНачисления) В
	|			(ВЫБРАТЬ
	|				вт.Услуга,
	|				вт.ПериодНачисления
	|			ИЗ
	|				вт_УслугиПериоды КАК вт)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Услуга,
	|	энргНачислениеПени.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ТЧ.Услуга, ВТ_УслугиПериоды.Услуга) КАК Услуга,
	|	ВТ_ТЧ.Поставщик КАК Поставщик,
	|	ВТ_ТЧ.ПериодРасчета КАК ПериодРасчета,
	|	ЕСТЬNULL(ВТ_ТЧ.ПериодНачисления, ВТ_УслугиПериоды.ПериодНачисления) КАК ПериодНачисления,
	|	ВТ_ТЧ.Сумма КАК Сумма,
	|	ВТ_ТЧ.IDСтроки КАК IDСтроки,
	|	ВТ_ТЧ.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	ЕСТЬNULL(вт_Начисление.Сумма, ВТ_ТЧ.СуммаРанееНачисленнойПени) КАК СуммаРанееНачисленнойПени
	|ИЗ
	|	ВТ_УслугиПериоды КАК ВТ_УслугиПериоды
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТЧ КАК ВТ_ТЧ
	|		ПО ВТ_УслугиПериоды.Услуга = ВТ_ТЧ.Услуга
	|			И ВТ_УслугиПериоды.ПериодНачисления = ВТ_ТЧ.ПериодНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Начисление КАК вт_Начисление
	|		ПО ВТ_УслугиПериоды.Услуга = вт_Начисление.Услуга
	|			И ВТ_УслугиПериоды.ПериодНачисления = вт_Начисление.ПериодНачисления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга,
	|	ПериодНачисления";
	
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ПериодНачисления", Новый ОписаниеТипов("Дата"));
	ТекПериод = ПериодНачисления.ДатаНачала;
	Пока ТекПериод < ПериодНачисления.ДатаОкончания Цикл
		НовСтрока	= ТЗ.Добавить();
		НовСтрока.ПериодНачисления = НачалоМесяца(ТекПериод);
		ТекПериод = ДобавитьМесяц(ТекПериод, 1);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЧПени", 			ТЧПени);
	Запрос.УстановитьПараметр("Услуги",				Услуги);
	Запрос.УстановитьПараметр("ПериодыНачисления",	ТЗ);
	Запрос.УстановитьПараметр("Абонент",			Абонент);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("МКД",				МКД);
	Запрос.УстановитьПараметр("Период",				Дата);

	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли