#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаОкончания = ТекущаяДатаСеанса();
	Если Параметры.Свойство("РеквизитыФормы") Тогда
	
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.РеквизитыФормы);
	КонецЕсли;
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла(".tmp");
	ВременныйКаталог = СтрЗаменить(ВременныйКаталог, ".tmp", ""); 
	
	ПолучитьФайлыНаСервере();
	
	СобытияЗадачи.Параметры.УстановитьЗначениеПараметра("Ссылка",  Задача);
	СобытияЗадачи.Параметры.УстановитьЗначениеПараметра("IDЭтапа", IDЭтапа);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьФайлыНаКлиенте();
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	
	Диалог.Показать(Новый ОписаниеОповещения("ДобавитьВыбранныйФайл", ЭтотОбъект, Новый Структура("Диалог", Диалог)));	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекЭлем = Элементы.ПрикрепитьФайлы.ТекущиеДанные;
	Если ТекЭлем <> Неопределено И ЗначениеЗаполнено(ТекЭлем.АдресФайла)  Тогда
		ЗапуститьПриложение(СокрЛП(ТекЭлем.АдресФайла)); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКоманд
&НаКлиенте
Процедура ЗавершитьШаг(Команда)
	УстановитьСтатус("Выполнен");
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВПланШаг(Команда)
	УстановитьСтатус();
КонецПроцедуры

&НаКлиенте
Процедура ВзятьВРаботуШаг(Команда)
	УстановитьСтатус("Текущий");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьШаг(Команда)
	УстановитьСтатус("Отменен");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСобытие(Команда)
	ОписОпов = Новый ОписаниеОповещения("ОбновитьСобытия", ЭтотОбъект);
	
	РекЗадачи = Новый Структура("Организация, Район, Договор, Ссылка, Абонент, Этап");
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Задача", Задача, РекЗадачи);
	бестРаботаСЗадачамиПИРКлиент.СоздатьСобытеДляЭтапа(РекЗадачи, IDЭтапа, Неопределено, ЭтаФорма, ОписОпов);
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	АдресаФайлов  = Новый СписокЗначений;
	СписокФайловШага = Новый СписокЗначений;
	
	Для каждого ТекСтрокаТЧ Из ПрикрепитьФайлы Цикл
		Если Не ТекСтрокаТЧ.ПрикрепленКДелу И ЗначениеЗаполнено(ТекСтрокаТЧ.АдресФайла) Тогда
			Попытка
				Двоичное = Новый ДвоичныеДанные(ТекСтрокаТЧ.АдресФайла);
				Адрес	 = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор);
				АдресаФайлов.Добавить(Адрес, ТекСтрокаТЧ.ИмяФайла);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗаписатьВнешниеФайлы(АдресаФайлов);
	
	Попытка
		УдалитьФайлы(ВременныйКаталог); 
	Исключение
	КонецПопытки;
	
	Для каждого ТекСтрокаТЧ Из ПрикрепитьФайлы Цикл
		Если ЗначениеЗаполнено(ТекСтрокаТЧ.Ссылка) Тогда
			СписокФайловШага.Добавить(ТекСтрокаТЧ.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ПарамШага = Новый Структура("IDЭтапа, Результат, ДатаНачала, ДатаОкончания, Выполнен, Текущий, Результат, Отменен");
	ЗаполнитьЗначенияСвойств(ПарамШага, ЭтаФорма);
	ПарамШага.Вставить("СписокФайловШага", СписокФайловШага);
	
	Закрыть(ПарамШага);
КонецПроцедуры
#КонецОбласти

#Область ДополнительныеМетоды

&НаСервере
Процедура ПолучитьФайлыНаСервере()
	
	Перем Выборка, Запрос, РезультатЗапроса, СтрокаТЗ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗадачаПИДПрисоединенныеФайлы.Наименование КАК Наименование,
		|	энргЗадачаПИДПрисоединенныеФайлы.Расширение КАК Расширение,
		|	энргЗадачаПИДПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.энргЗадачаПИД.ФайлыПодэтапов КАК энргЗадачаПИДФайлыПодэтапов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЗадачаПИДПрисоединенныеФайлы КАК энргЗадачаПИДПрисоединенныеФайлы
		|		ПО энргЗадачаПИДФайлыПодэтапов.Файл = энргЗадачаПИДПрисоединенныеФайлы.Ссылка
		|ГДЕ
		|	энргЗадачаПИДФайлыПодэтапов.Ссылка = &Ссылка
		|	И энргЗадачаПИДФайлыПодэтапов.IDЭтапа = &IDЭтапа
		|	И НЕ энргЗадачаПИДПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка",  Задача);
	Запрос.УстановитьПараметр("IDЭтапа", IDЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПрикрепитьФайлы.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЗ = ПрикрепитьФайлы.Добавить();
		СтрокаТЗ.ПрикрепленКДелу	  = Истина;
		СтрокаТЗ.ИмяФайла			  = Выборка.Наименование + "." + Выборка.Расширение;
		СтрокаТЗ.Ссылка				  = Выборка.Ссылка;
		СтрокаТЗ.Расширение			  = Выборка.Расширение;
		СтрокаТЗ.АдресВременногоФайла = ПоместитьВоВременноеХранилище(РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Ссылка));
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФайлыНаКлиенте()
	Перем ДвоичФайл, ИмяФайла, СтрокаТЗ;
	
	Для каждого СтрокаТЗ Из ПрикрепитьФайлы Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.АдресВременногоФайла) И ПустаяСтрока(СтрокаТЗ.АдресФайла) Тогда
			ИмяФайла  = ВременныйКаталог + "\" + Строка(Новый УникальныйИдентификатор) + "." + СтрокаТЗ.Расширение;
			
			ДвоичФайл = ПолучитьИзВременногоХранилища(СтрокаТЗ.АдресВременногоФайла);
			Попытка
				ДвоичФайл.Записать(ИмяФайла); 
				СтрокаТЗ.АдресФайла = ИмяФайла;
				СтрокаТЗ.АдресВременногоФайла = "";
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ЗаписатьВнешниеФайлы(МассивФайлов)
	Если ЗначениеЗаполнено(МассивФайлов) Тогда
		Для каждого ТекФайл Из МассивФайлов Цикл
			РасширениеФайла  = Справочники.энргКомментарииКСудебномуДелу.ПолучитьРасширениеФайла(ТекФайл.Представление);
			ИмяБезРасширения = СтрЗаменить(ТекФайл.Представление, "." + РасширениеФайла, "");
			
			ДатаМодификацииФайла		= ТекущаяДатаСеанса();
			ПараметрыДобавляемогоФайла	= Новый Структура;
			ПараметрыДобавляемогоФайла.Вставить("ВладелецФайлов",	 			СтартоваяЗадача);
			ПараметрыДобавляемогоФайла.Вставить("Автор",						Строка(ПараметрыСеанса.ТекущийПользователь));
			ПараметрыДобавляемогоФайла.Вставить("ИмяБезРасширения",				ИмяБезРасширения);
			ПараметрыДобавляемогоФайла.Вставить("РасширениеБезТочки",			РасширениеФайла);
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзменения",				МестноеВремя(ДатаМодификацииФайла, ЧасовойПоясСеанса()));
			ПараметрыДобавляемогоФайла.Вставить("ВремяИзмененияУниверсальное",	ДатаМодификацииФайла);
			НовФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавляемогоФайла, 	ТекФайл.Значение);
			
			Если ЗначениеЗаполнено(НовФайл) Тогда
				//СтрокаТЧ = Файлы.Добавить();
				//СтрокаТЧ.Файл = НовФайл;              
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыПередУдалением(Элемент, Отказ)
	ТекСтрокаТЗ = Элементы.ПрикрепитьФайлы.ТекущиеДанные;
	Если ТекСтрокаТЗ <> Неопределено И ТекСтрокаТЗ.ПрикрепленКДелу Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя удалять и изменять файлы, прикреплённые к этапу.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранныйФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		Модифицированность = Истина;
		Для каждого ПутьКФайлу Из ВыбранныеФайлы Цикл
			СтрокаТЗ = ПрикрепитьФайлы.Добавить();
			СтрокаТЗ.АдресФайла = ПутьКФайлу;
			СтрокаТЗ.ИмяФайла	= СтрЗаменить(Диалог.ПолноеИмяФайла, Диалог.Каталог, "");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьСтатус(ИмяСтатуса = "")

	Статусы = Новый Структура("Текущий, Отменен, Выполнен", Ложь, Ложь, Ложь);
	Если Не ПустаяСтрока(ИмяСтатуса) Тогда 
		Статусы.Вставить(ИмяСтатуса, Истина);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Статусы);
	
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Неактивен = Выполнен Или Отменен;
	
	Элементы.ФормаЗавершитьШаг.Видимость 	= Текущий;
	Элементы.ФормаВзятьВРаботуШаг.Видимость = Не Текущий;
	Элементы.ФормаВернутьВПланШаг.Видимость = Неактивен;
	Элементы.ФормаОтменитьШаг.Видимость 	= Текущий Или Не (Выполнен Или Отменен);
	
	Элементы.ДатаНачала.ТолькоПросмотр				  = Неактивен;
	Элементы.ДатаОкончания.ТолькоПросмотр			  = Неактивен;
	Элементы.Результат.ТолькоПросмотр				  = Неактивен;
	Элементы.СобытияЗадачиДобавитьСобытие.Доступность = Не Неактивен;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСобытия(Результат, ДополнительныеПараметры) Экспорт
	Элементы.СобытияЗадачи.Обновить();
КонецПроцедуры


#КонецОбласти
