#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сколько осталось создать документов регистратора.
//
// Параметры:
//  ДокументОснование	-	ОпределяемыйТип.энргДокументОснованиеЗагрузкиОплат.
// 
// Возвращаемое значение:
//   Число.
//
Функция КоличествоОсталосьСоздатьДокументовРегистратора(ДокументОснование) Экспорт 
	
	Результат = 0;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргЗагрузкаОплат.ИдентификаторСтроки) КАК КоличествоОсталось
		|ИЗ
		|	РегистрСведений.энргЗагрузкаОплат КАК энргЗагрузкаОплат
		|ГДЕ
		|	энргЗагрузкаОплат.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.КоличествоОсталось;
	
	Возврат Результат;
	
КонецФункции 

// Получает сумма оплат по документу основанию.
//
// Параметры:
//  ДокументОснование	-	ОпределяемыйТип.энргДокументОснованиеЗагрузкиОплат.
// 
// Возвращаемое значение:
//   Число.
//
Функция СуммаОплатПоДокументуОснованию(ДокументОснование) Экспорт 
	
	Результат = 0;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(энргЗагрузкаОплат.СуммаОплаты) КАК СуммаОплаты
		|ИЗ
		|	РегистрСведений.энргЗагрузкаОплат КАК энргЗагрузкаОплат
		|ГДЕ
		|	энргЗагрузкаОплат.ДокументОснование = &ДокументОснование
		|
		|ИМЕЮЩИЕ
		|	СУММА(энргЗагрузкаОплат.СуммаОплаты) > 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.СуммаОплаты;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли


