#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПосчитатьКоличествоЧасовВПериоде(Объект.Организация, Объект.ПериодНачисления);
	КонецЕсли;
	
	КонецПериодаНачисления = КонецДня(ГраницыОтчетногоПериода(Объект.Организация, Объект.ПериодНачисления).ЗавершениеОП);
	// Настройка доступности в зависимости от прав
	СписокЭлементов = Новый Структура("ОбъектРасчета, ТочкаУчета");
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, СписокЭлементов, Метаданные.Документы.бестРегистрацияОбъемовПотребленияПриборовУчета);
	бестЛокализацияСервер.ПриСозданииНаСервере_бестРегистрацияОбъемовПотребленияПриборовУчета(ЭтотОбъект, Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер(); 		
	КонецЕсли;
	
	КонецПериодаНачисления = КонецДня(ГраницыОтчетногоПериода(Объект.Организация, Объект.ПериодНачисления).ЗавершениеОП);
	
	ПосчитатьКоличествоЧасовВПериоде(Объект.Организация, Объект.ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	
	СписокУслуг = бестПользовательскийВводСервер.ПолучитьСписокУслугДляВыбора(?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия),КонецДня(Объект.ДатаФактическогоСобытия),Объект.Дата), Объект.Организация, Объект.Район, ОбъектРасчета, ТочкаУчета);
	ОткрытьФорму("Справочник.энргВидыУслуг.ФормаВыбора", Новый Структура("СписокУслуг", СписокУслуг), Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ЗаполнитьПериодНачисленияСервер(); 		
	КонецЕсли;
	
	ПосчитатьКоличествоЧасовВПериоде(Объект.Организация, Объект.ПериодНачисления);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииСервер();
	ОрганизацияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВыборУслугиИТочкиУчета(Новый Структура, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаОбъемПриИзменении(Элемент)
	ПосчитатьОбъемПоСтроке();
	
	ТекДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаОбъемОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЕстьПоказания = Ложь;
		ТекДанные.Объем = 0;
		
		ПосчитатьОбъемПоСтроке();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаОбъемДосчитанныйПриИзменении(Элемент)
	ПосчитатьОбъемПоСтроке()
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаКоличествоЧасовШтатнойРаботыПУПриИзменении(Элемент)
	ТекСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	ТекСтрока.КоличествоЧасовШТИзмененоПользователем = Истина;
	Если ТекСтрока.КоличествоЧасовШтатнойРаботыПУ < 0 Тогда
		ТекСтрока.КоличествоЧасовШтатнойРаботыПУ = 0;
	КонецЕсли;
	
	Если ТекСтрока.КоличествоЧасовШтатнойРаботыПУ > ТекСтрока.КоличествоЧасовРаботыТУ Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='""Количество часов штатной работы ПУ"" не может быть больше ""Количество часов работы ТУ"".'"));
		ТекСтрока.КоличествоЧасовШтатнойРаботыПУ = ТекСтрока.КоличествоЧасовРаботыТУ;
	
	КонецЕсли;
	РассчитатьОбъемПоПрибору(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры             

&НаКлиенте
Процедура ТочкиУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбъемПоПрибору(Элемент)
	ТекСтрока 						= Элементы.ТочкиУчета.ТекущиеДанные;
	пКоличествоЧасовШтатнойРаботыПУ = ОпределитьМинимальноеКолвоЧасов(ТекСтрока.КоличествоЧасовШтатнойРаботыПУ, ТекСтрока.ОбъектРасчета, ТекСтрока.Услуга).Колво;
	СтруктураВозврат 		   		= РассчитатьОбъемПоПриборуСервер(ТекСтрока.Температура, ТекСтрока.ТемператураОбратнойСетевойВоды, ТекСтрока.ОбъемМГВ, ТекСтрока.ОбъемОбратнойСетевойВоды, ТекСтрока.Услуга, ТекСтрока.ОбъектРасчета,ТекСтрока.ТочкаУчета, пКоличествоЧасовШтатнойРаботыПУ, ТекСтрока.КоличествоЧасовРаботыТУ, ТекСтрока.ДоговорнойОбъем, ТекСтрока.ТарифнаяЗона, ТекСтрока.ПриборУчета, ТекСтрока.Шкала, ТекСтрока.Договор);
	РассчитанныйОбъем		   		= СтруктураВозврат.РассчитанныйОбъем;
	ТекСтрока.СпособНачисления 		= СтруктураВозврат.СпособНачисления;
	Если ТекСтрока.КоличествоЧасовРаботыТУ = пКоличествоЧасовШтатнойРаботыПУ Тогда
		ТекСтрока.Объем = РассчитанныйОбъем;
		ТекСтрока.ОбъемДосчитанный = 0;
	Иначе
		ТекСтрока.ОбъемДосчитанный = РассчитанныйОбъем;
		ТекСтрока.Объем = 0;
	КонецЕсли;
	НайтиСвязанныеСтроки(ТекСтрока.Услуга, ТекСтрока.ТочкаУчета, ТекСтрока.Температура, ТекСтрока.ТемператураОбратнойСетевойВоды, ТекСтрока.ОбъемМГВ, ТекСтрока.ОбъемОбратнойСетевойВоды);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда)
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать организацию!");
		Отказ = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Район) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать район!");
		Отказ = Истина;
	КонецЕсли;
	Если Не Отказ Тогда
		ТекИдентификатор 	= "";
		Дубль				= Неопределено;
		ЗаполнитьДанныеДоговораСервер(ТекИдентификатор,Дубль);
		Если не Дубль = Неопределено Тогда
			ДопПараметры	= Новый Структура;
			ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
			ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
			ДопПараметры.Вставить("ТекСтрока", 		ТекИдентификатор);
			ПоказанияУжеВведеныВопрос(ДопПараметры);
		Иначе
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;		
		Если НЕ ТекИдентификатор = "" Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.ТочкиУчета;
			Элементы.ТочкиУчета.ТекущаяСтрока = ТекИдентификатор;
			Элементы.ТочкиУчета.ТекущийЭлемент = Элементы.ТочкиУчетаОбъем; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
	ЭтаФорма.Модифицированность = Истина;	
КонецПроцедуры             

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ПроверкаОчисткиТЧ(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЧасыШтатнойРаботы(Команда)
	Для каждого стр из Объект.ТочкиУчета Цикл
		Если Не стр.КоличествоЧасовШТИзмененоПользователем Тогда
			стр.КоличествоЧасовШтатнойРаботыПУ = стр.КоличествоЧасовРаботыТУ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТЧ(Команда)
	ОбновитьТЧНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьОбъемПоСтроке()
	ТекДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	
	ДанныеПоУслуге = ПолучитьДанныеПоУслуге(ТекДанные.Услуга);
	
	КоличествоЧасовНештатнойРаботыПУ = ТекДанные.КоличествоЧасовРаботыТУ - ТекДанные.КоличествоЧасовШтатнойРаботыПУ;
	
	Если ДанныеПоУслуге.СодержитПотери Тогда
		ТекДанные.ОбъемИтоговый			= ТекДанные.ОбъемДосчитанный;
	Иначе
		Если ДанныеПоУслуге.СпособДосчётаРесурса = ПредопределенноеЗначение("Перечисление.бестСпособыДосчётаРесурса.ПоСреднесуточномуКоличествуТепловойЭнергии") Тогда
			Если КоличествоЧасовНештатнойРаботыПУ <= 360 Тогда
				ТекДанные.ОбъемИтоговый			= ТекДанные.ОбъемДосчитанный + ТекДанные.Объем;
			Иначе 
				ТекДанные.ОбъемИтоговый			= ТекДанные.ОбъемДосчитанный;
			КонецЕсли;	
		ИначеЕсли  ДанныеПоУслуге.СпособДосчётаРесурса = ПредопределенноеЗначение("Перечисление.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод") Тогда 
			ТекДанные.ОбъемИтоговый			= ТекДанные.ОбъемДосчитанный; 
		Иначе   ТекДанные.ОбъемИтоговый			= 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияУжеВведеныВопрос(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросПереходаКСтроке",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Объёмы уже введены. Перейти к строке?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПереходаКСтроке(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ПерейтиКСтроке(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСтроке(ДополнительныеПараметры)
	Элементы[ДополнительныеПараметры.ТЧ].ТекущаяСтрока = ДополнительныеПараметры.ТекСтрока;
	Элементы[ДополнительныеПараметры.ТЧ].ТекущийЭлемент = Элементы[ДополнительныеПараметры.ТЧ + "Объем"];	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер(ТекИдентификатор,Дубль)
	
	Результат 								= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоДоговоруДляУзлов(КонецДня(Объект.Дата),Объект.Организация,Объект.Район, Объект.ПериодНачисления, Договор, ОбъектРасчета, ТочкаУчета); 
	Выборка  								= Результат.выбрать();
	
	ТЧТочки = Объект.ТочкиУчета;
	
	Пока Выборка.следующий() цикл
		Отказ = Ложь;
		Отбор = Новый Структура("ТочкаУчета, Услуга, ПриборУчета", Выборка.ТочкаУчета, Выборка.Услуга, Выборка.ПриборУчета);
		ИщемСтроку = ТЧТочки.НайтиСтроки(Отбор);
		Если ИщемСтроку.Количество() > 0 Тогда
			Для мммм = 0 по ИщемСтроку.Количество()-1 Цикл
				Дубль = Истина;
				Если ТекИдентификатор = "" Тогда
					ТекИдентификатор = ИщемСтроку[мммм].ПолучитьИдентификатор();
				КонецЕсли;
				Отказ = Истина;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		//Если Дубль = Неопределено Тогда
		  Если НЕ Отказ Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.Услуга) Тогда
				Если Выборка.Услуга					= ЭтаФорма.Услуга Тогда 
					СтрокаТочкиУчета  					= ТЧТочки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
					СтрокаТочкиУчета.ТипПрибораУчета	= Выборка.ПриборУчета.ТипПрибораУчета;
				КонецЕсли;
			Иначе 
				СтрокаТочкиУчета  					= ТЧТочки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
				СтрокаТочкиУчета.ТипПрибораУчета	= Выборка.ПриборУчета.ТипПрибораУчета;			
			КонецЕсли;
			Если Не СтрокаТочкиУчета = Неопределено И ТекИдентификатор = "" Тогда
				ТекИдентификатор = СтрокаТочкиУчета.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПосчитатьКоличествоЧасовВПериоде(ТекОрганизация, ПериодНачисления)
	
	Если ТекОрганизация <> Справочники.Организации.ПустаяСсылка() Тогда	
		ГраницыПериода  								= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(ТекОрганизация,Объект.Район,ПериодНачисления,Ложь);
		Объект.КоличествоЧасовВОтчетномПериоде = (ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП) / 3600;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ГраницыОтчетногоПериода(Организация, ПериодНачисления)
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.Текст ="ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, энргДеньЗавершенияРасчетногоПериода.Значение)) КАК НачалоОП,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ПериодНачисления, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, энргДеньЗавершенияРасчетногоПериода.Значение)), СЕКУНДА, -1) КАК ЗавершениеОП
	|ИЗ
	|	(ВЫБРАТЬ
	|		NULL КАК ЗавершениеПредыдущего,
	|		энргДатыОтчетногоПериоды.Завершение КАК ЗавершениеТекущего
	|	ИЗ
	|		РегистрСведений.энргДатыОтчетногоПериоды КАК энргДатыОтчетногоПериоды
	|	ГДЕ
	|		энргДатыОтчетногоПериоды.ПериодНачисления = &ПериодНачисления
	|		И энргДатыОтчетногоПериоды.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргДатыОтчетногоПериоды.Завершение,
	|		NULL
	|	ИЗ
	|		РегистрСведений.энргДатыОтчетногоПериоды КАК энргДатыОтчетногоПериоды
	|	ГДЕ
	|		энргДатыОтчетногоПериоды.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|		И энргДатыОтчетногоПериоды.Организация = &Организация) КАК ВложенныйЗапрос
	|		ПОЛНОЕ СОЕДИНЕНИЕ Константа.энргДеньЗавершенияРасчетногоПериода КАК энргДеньЗавершенияРасчетногоПериода
	|		ПО (ИСТИНА)";
	результат = Запрос.Выполнить();
	Выборка  = результат.Выбрать();
	Выборка.Следующий();
	Структура = Новый Структура("ПериодНачисления,НачалоОП,ЗавершениеОП", Выборка.ПериодНачисления,Выборка.НачалоОП,Выборка.ЗавершениеОП);
	
	Возврат Структура;
КонецФункции

&НаСервере
Процедура РайонПриИзмененииСервер()
	Объект.Организация = Объект.Район.Организация;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные, Элемент)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,Договор,ОбъектРасчета, ПростыеУслуги",КонецДня(Объект.ДатаФактическогоСобытия));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекДанные);
	СтруктураОтбора.Период = ?(ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия), КонецДня(Объект.ДатаФактическогоСобытия), КонецДня(Объект.Дата));
	
	Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
		СтруктураОтбора.ОбъектРасчета = ОбъектРасчета;
	Иначе
		СтруктураОтбора.ОбъектРасчета = ТекДанные.ОбъектРасчета;
	КонецЕсли;
	
	СтруктураОтбора.ПростыеУслуги = Истина;	
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТипВладельца", СтруктураОтбора, "НП");
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		
		Если ТипЗнч(ТекДанные) = Тип("Структура") Тогда
			ТочкаУчета				= РезультатЗакрытия.ТочкаУчета;
			Услуга					= РезультатЗакрытия.Услуга;
		Иначе
			ТекДанные.ТочкаУчета	= РезультатЗакрытия.ТочкаУчета;
			ТекДанные.Услуга		= РезультатЗакрытия.Услуга;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаСервере
Функция РассчитатьОбъемПоПриборуСервер(Температура, ТемператураОбратнойСетевойВоды, ОбъемМГВ, ОбъемОбратнойСетевойВоды, Услуга, ОбъектРасчета, ТочкаУчета, КоличествоЧасовШтатнойРаботыПУ, КоличествоЧасовРаботыТУ, ДоговорнойОбъем, ТарифнаяЗона, ПриборУчета, Шкала, Договор)
	СтруктураВозврата = Новый Структура;
	Если Услуга.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод Тогда
			СтруктураТекСтрока = Новый Структура;
			СтруктураТекСтрока.Вставить("ОбъектРасчета",ОбъектРасчета);
			СтруктураТекСтрока.Вставить("ТочкаУчета",ТочкаУчета);
			СтруктураТекСтрока.Вставить("Договор",Договор);
			Температуры 				= Получить_t_под__t_хв(СтруктураТекСтрока);
		Если ЗначениеЗаполнено(Температура) Тогда
			пТемпература = Температура;
		Иначе
			пТемпература = Температуры.t_под;
		КонецЕсли;
		пТемператураОбратнойСетевойВоды = ТемператураОбратнойСетевойВоды;
		пОбъемМГВ = ОбъемМГВ;
		пОбъемОбратнойСетевойВоды = ОбъемОбратнойСетевойВоды;
		Если КоличествоЧасовРаботыТУ - КоличествоЧасовШтатнойРаботыПУ > 720 Тогда
			СтруктураВозврата.Вставить("РассчитанныйОбъем", ДоговорнойОбъем);
			СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.СреднееПоНормативу);
			Возврат СтруктураВозврата;
		ИначеЕсли КоличествоЧасовРаботыТУ <> КоличествоЧасовШтатнойРаботыПУ Тогда
			СтруктураТекСтрока = Новый Структура;
			СтруктураТекСтрока.Вставить("ОбъектРасчета",ОбъектРасчета);
			СтруктураТекСтрока.Вставить("ТочкаУчета",ТочкаУчета);
			СтруктураТекСтрока.Вставить("ТарифнаяЗона",ТарифнаяЗона);
			СтруктураТекСтрока.Вставить("ПриборУчета",ПриборУчета);
			СтруктураТекСтрока.Вставить("Шкала",Шкала);
			СтруктураТекСтрока.Вставить("Услуга",Услуга);
			СтруктураТекСтрока.Вставить("Договор",Договор);
			
			ДанныеЗаПредПериод = ПолучитьОбъемыПредыдущегоМесяца(СтруктураТекСтрока);
			Если ДанныеЗаПредПериод = Неопределено или ДанныеЗаПредПериод.Q_гв_пп <> ДанныеЗаПредПериод.КоличествоЧасовРаботыТУ Тогда
				СтруктураВозврата.Вставить("РассчитанныйОбъем", ДоговорнойОбъем);
				СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.СреднееПоНормативу);
				Возврат СтруктураВозврата;
			Иначе
				пОбъемМГВ = ДанныеЗаПредПериод.ОбъемМГВ / ДанныеЗаПредПериод.Q_гв_пп * КоличествоЧасовРаботыТУ; 
			КонецЕсли;
		КонецЕсли;
		
		Если  ЗначениеЗаполнено(Услуга.ЗависитОтУслуги) Тогда
			Если ЗначениеЗаполнено(Температура) Тогда
				СтруктураВозврата.Вставить("РассчитанныйОбъем", (пОбъемМГВ - пОбъемОбратнойСетевойВоды) * (пТемператураОбратнойСетевойВоды - Температуры.t_хв ) / 1000);
				Если пОбъемМГВ = ОбъемМГВ Тогда
					СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.ПоПриборам);
				Иначе
					СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.НачислениеПоСреднему);
				КонецЕсли;
				Возврат СтруктураВозврата;
			Иначе
				
				ЗначениеНорматива = ПолучитьЗначениеНорматива(ОбъектРасчета, ТочкаУчета, Услуга);
				СтруктураВозврата.Вставить("РассчитанныйОбъем", РассчитатьОбъемОтПлотности(пТемпература, пОбъемМГВ, пТемператураОбратнойСетевойВоды, пОбъемОбратнойСетевойВоды) * ЗначениеНорматива);
				Если пОбъемМГВ = ОбъемМГВ Тогда
					СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.ПоПриборам);
				Иначе
					СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.НачислениеПоСреднему);
				КонецЕсли;
				Возврат СтруктураВозврата;
				
				
			КонецЕсли;
			
		Иначе
			//Если пТемпература <> Температуры.t_под и ОпределитьСезонность(Объект.ПериодНачисления,КонецДня(Объект.Дата),Объект.Организация,Объект.Район, Услуга.Сезонность) Тогда
			//	пТемпература = Температуры.t_под;
			//КонецЕсли;
			СтруктураВозврата.Вставить("РассчитанныйОбъем", РассчитатьОбъемОтПлотности(пТемпература, пОбъемМГВ, пТемператураОбратнойСетевойВоды, пОбъемОбратнойСетевойВоды));
			Если пОбъемМГВ = ОбъемМГВ Тогда
				СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.ПоПриборам);
			Иначе
				СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.НачислениеПоСреднему);
			КонецЕсли;
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	СтруктураВозврата.Вставить("РассчитанныйОбъем", 0);
	СтруктураВозврата.Вставить("СпособНачисления", Перечисления.энргСпособНачислений.ПустаяСсылка());
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере
Функция РассчитатьОбъемОтПлотности(пТемпература, пОбъемМГВ, пТемператураОбратнойСетевойВоды, пОбъемОбратнойСетевойВоды)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлотностиВоды.Плотность КАК Плотность,
	|	0 КАК ПлотностьОбратнойСетевойВоды
	|ПОМЕСТИТЬ ПлотностиВоды
	|ИЗ
	|	РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
	|ГДЕ
	|	бестПлотностиВоды.Температура = &Температура
	|	И бестПлотностиВоды.Плотность <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	бестПлотностиВоды.Плотность
	|ИЗ
	|	РегистрСведений.бестПлотностиВоды КАК бестПлотностиВоды
	|ГДЕ
	|	бестПлотностиВоды.Температура = &ТемператураОбратнойСетевойВоды
	|	И бестПлотностиВоды.Плотность <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПлотностиВоды.Плотность) КАК Плотность,
	|	СУММА(ПлотностиВоды.ПлотностьОбратнойСетевойВоды) КАК ПлотностьОбратнойСетевойВоды
	|ИЗ
	|	ПлотностиВоды КАК ПлотностиВоды";
	
	Запрос.УстановитьПараметр("Температура", Окр(пТемпература, 1, 1));
	Запрос.УстановитьПараметр("ТемператураОбратнойСетевойВоды", Окр(пТемператураОбратнойСетевойВоды, 1, 1));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат пОбъемМГВ * 1000 / ВыборкаДетальныеЗаписи.Плотность - пОбъемОбратнойСетевойВоды * 1000 / ВыборкаДетальныеЗаписи.ПлотностьОбратнойСетевойВоды;
	КонецЦикла;
КонецФункции

&НаСервере
Процедура НайтиСвязанныеСтроки(Услуга,ТочкаУчета, Температура, ТемператураОбратнойСетевойВоды, ОбъемМГВ, ОбъемОбратнойСетевойВоды) 
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТочкаУчета", ТочкаУчета);
	мСтрок = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	Для каждого стр из мСтрок Цикл
		Если (ЗначениеЗаполнено(Услуга.ЗависитОтУслуги) и стр.Услуга = Услуга.ЗависитОтУслуги или НЕ ЗначениеЗаполнено(Услуга.ЗависитОтУслуги) и стр.Услуга.ЗависитОтУслуги = Услуга) Тогда
			стр.Температура = Температура;
			стр.ОбъемМГВ = ОбъемМГВ;
			стр.ТемператураОбратнойСетевойВоды = ТемператураОбратнойСетевойВоды;
			стр.ОбъемОбратнойСетевойВоды = ОбъемОбратнойСетевойВоды;
			пКоличествоЧасовШтатнойРаботыПУ = ОпределитьМинимальноеКолвоЧасов(стр.КоличествоЧасовШтатнойРаботыПУ, стр.ОбъектРасчета, стр.Услуга).Колво;
			СтруктураВозврат 				= РассчитатьОбъемПоПриборуСервер(Температура, ТемператураОбратнойСетевойВоды, ОбъемМГВ, ОбъемОбратнойСетевойВоды, стр.Услуга,стр.ОбъектРасчета, стр.ТочкаУчета, пКоличествоЧасовШтатнойРаботыПУ, стр.КоличествоЧасовРаботыТУ, стр.ДоговорнойОбъем, стр.ТарифнаяЗона, стр.ПриборУчета, стр.Шкала, стр.Договор);  
			РассчитанныйОбъем		   		= СтруктураВозврат.РассчитанныйОбъем;
			стр.СпособНачисления 			= СтруктураВозврат.СпособНачисления;
			Если стр.КоличествоЧасовРаботыТУ = пКоличествоЧасовШтатнойРаботыПУ Тогда
				стр.Объем = РассчитанныйОбъем;
				стр.ОбъемДосчитанный = 0;
			Иначе
				стр.ОбъемДосчитанный = РассчитанныйОбъем;
				стр.Объем = 0;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОчисткиТЧ(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросОчисткиТЧ",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Очистить табличную часть?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчисткиТЧ(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ВыполнениеОчисткиТЧ(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВыполнениеОчисткиТЧ(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Очистить();	
КонецПроцедуры

&НаСервере
Функция ОпределитьМинимальноеКолвоЧасов(КоличествоЧасовШтатнойРаботыПУ, ОбъектРасчета, Услуга)
	СтруктураВозврат = Новый Структура;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектРасчета", ОбъектРасчета);
	Если Услуга.СодержитПотери и ЗначениеЗаполнено(Услуга.бестЗависитОтУслугиПоПотерям) Тогда
		ПараметрыОтбора.Вставить("Услуга", Услуга.бестЗависитОтУслугиПоПотерям);
	Иначе
		ПараметрыОтбора.Вставить("Услуга", Услуга);
	КонецЕсли;
	мСтрок = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
	пМин = КоличествоЧасовШтатнойРаботыПУ;
	Откуда = "КоличествоЧасовШтатнойРаботыПУ";
	Для каждого стр из мСтрок Цикл
		Если пМин > стр.КоличествоЧасовШтатнойРаботыПУ Тогда
			пМин = стр.КоличествоЧасовШтатнойРаботыПУ;
			Откуда = "КоличествоЧасовШтатнойРаботыПУ";
		КонецЕсли;
		Если пМин > стр.КоличествоЧасовРаботыВКоммерческомУчете Тогда
			пМин = стр.КоличествоЧасовРаботыВКоммерческомУчете;
			Откуда = "КоличествоЧасовРаботыВКоммерческомУчете";
		КонецЕсли;
	КонецЦикла;
	СтруктураВозврат.Вставить("Колво",пМин);
	СтруктураВозврат.Вставить("Откуда",Откуда);
	Возврат СтруктураВозврат;
КонецФункции

&НаСервере
Процедура ОбновитьТЧНаСервере()
	Для каждого стр из Объект.ТочкиУчета Цикл
		Результат 								= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоДоговоруДляУзлов(КонецДня(Объект.Дата),Объект.Организация,Объект.Район, Объект.ПериодНачисления,стр.Договор, стр.ОбъектРасчета, стр.ТочкаУчета); 
		Выборка  								= Результат.выбрать();
		
		ТЧТочки = Объект.ТочкиУчета;
		
		Если Выборка.следующий() Тогда
			ЗаполнитьЗначенияСвойств(стр, Выборка);
			стр.ТипПрибораУчета	= Выборка.ПриборУчета.ТипПрибораУчета;
		КонецЕсли;;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеНорматива(ОбъектРасчета, ТочкаУчета, Услуга)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(бестСтабильныеПериодыНП.КлючНорматива) КАК КлючНорматива,
	|	бестСтабильныеПериодыНП.Район КАК Район,
	|	бестСтабильныеПериодыНП.Организация КАК Организация,
	|	бестСтабильныеПериодыНП.Услуга КАК Услуга
	|ПОМЕСТИТЬ Стабильные
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|ГДЕ
	|	бестСтабильныеПериодыНП.ОбъектРасчета = &ОбъектРасчета
	|	И бестСтабильныеПериодыНП.Услуга = &Услуга
	|	И бестСтабильныеПериодыНП.ТочкаУчета = &ТочкаУчета
	|	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСтабильныеПериодыНП.Район,
	|	бестСтабильныеПериодыНП.Организация,
	|	бестСтабильныеПериодыНП.Услуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(бестСтабильныеПериодыНП.КлючНорматива),
	|	бестСтабильныеПериодыНП.Район,
	|	бестСтабильныеПериодыНП.Организация,
	|	бестСтабильныеПериодыНП.Услуга
	|ИЗ
	|	РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСтабильныеПериодыНП КАК бестСтабильныеПериодыНП1
	|		ПО бестСтабильныеПериодыНП.Организация = бестСтабильныеПериодыНП1.Организация
	|			И бестСтабильныеПериодыНП.Район = бестСтабильныеПериодыНП1.Район
	|			И бестСтабильныеПериодыНП.МКД = бестСтабильныеПериодыНП1.МКД
	|			И бестСтабильныеПериодыНП.ОбъектРасчета = бестСтабильныеПериодыНП1.ОбъектРасчета
	|			И бестСтабильныеПериодыНП.Услуга = бестСтабильныеПериодыНП1.Услуга
	|			И бестСтабильныеПериодыНП.ТочкаУчета = бестСтабильныеПериодыНП1.ТочкаУчета
	|			И (бестСтабильныеПериодыНП1.ПериодНачисления = &ПериодНачисления)
	|ГДЕ
	|	бестСтабильныеПериодыНП.ОбъектРасчета = &ОбъектРасчета
	|	И бестСтабильныеПериодыНП.Услуга = &Услуга
	|	И бестСтабильныеПериодыНП.ТочкаУчета = &ТочкаУчета
	|	И бестСтабильныеПериодыНП.ПериодНачисления = &ПериодНачисленияПред
	|	И бестСтабильныеПериодыНП1.ОбъектРасчета ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	бестСтабильныеПериодыНП.Район,
	|	бестСтабильныеПериодыНП.Организация,
	|	бестСтабильныеПериодыНП.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияНормативовПотребленияСрезПоследних.ЗначениеНорматива КАК ЗначениеНорматива
	|ИЗ
	|	Стабильные КАК Стабильные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияНормативовПотребления.СрезПоследних(
	|				&ПериодНачисления,
	|				ТипНачисления = &ТипНачисления
	|					И НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК энргЗначенияНормативовПотребленияСрезПоследних
	|		ПО Стабильные.КлючНорматива = энргЗначенияНормативовПотребленияСрезПоследних.КлючНорматива
	|			И Стабильные.Район = энргЗначенияНормативовПотребленияСрезПоследних.Район
	|			И Стабильные.Организация = энргЗначенияНормативовПотребленияСрезПоследних.Организация
	|			И Стабильные.Услуга = энргЗначенияНормативовПотребленияСрезПоследних.Услуга";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("ПериодНачисления", Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("ПериодНачисленияПред", ДобавитьМесяц(Объект.ПериодНачисления, -1));
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	Если ЗначениеЗаполнено(ОбъектРасчета.МКД) Тогда
		Запрос.УстановитьПараметр("ТипНачисления", Перечисления.энргТипыНачислений.ОтдельностояющиеОбъекты);
	Иначе
		Запрос.УстановитьПараметр("ТипНачисления", Перечисления.энргТипыНачислений.ИндивидуальныеНачисления);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЗначениеНорматива;
	КонецЦикла;
	Возврат 0;
КонецФункции

#Область РАССЧИТАТЬ_ДОСЧИТАННЫЙ_ОБЪЕМ

&НаСервере
Процедура РассчитатьНаСервере()
	РезультатЗапроса 		= ЗаполнитьЗначенияТемператур();
	ТекСтрока				= РезультатЗапроса[11].выбрать();
	ЗависимыеУслугиВыборка	= РезультатЗапроса[12].выбрать();
	
	НачисленияПоТочкам 								= Новый Соответствие;
	НачисленияПоУслуге 								= Новый Соответствие;
	ТЗРаспределятьНагрузку 							= Новый ТаблицаЗначений;
	ТЗРаспределятьНагрузку.Колонки.Добавить("ОбъектРасчета");
	ТЗРаспределятьНагрузку.Колонки.Добавить("Услуга");
	
	Пока ТекСтрока.Следующий() Цикл
		СпособНачисления			= Перечисления.энргСпособНачислений.ПустаяСсылка();
 		ТекНомерСтроки				= ТекСтрока.НомерСтроки;
		ОбъемДосчитанный        	= 0;
		ОбъемИтоговый        		= 0;
		ТемпВоздухаВнутриПомещения	= ТекСтрока.ТемператураКатегорииОбъекта;
		ФактСредМесТемпНаружВоздуха	= ТекСтрока.СреднемесячнаяТемпература;
		ПроектТемпНаружВоздуха		= ТекСтрока.ПроектнаяТемпература;	
		
		СтруктураМин = ОпределитьМинимальноеКолвоЧасов(ТекСтрока.КоличествоЧасовШтатнойРаботыПУ, ТекСтрока.ОбъектРасчета, ТекСтрока.Услуга);
		пКоличествоЧасовШтатнойРаботыПУ = СтруктураМин.Колво;
		Откуда 							= СтруктураМин.Откуда;

		
		
		КолвоНештатнойРаботыЧас 	= ТекСтрока.КоличествоЧасовРаботыТУ - пКоличествоЧасовШтатнойРаботыПУ;
		Если ТекСтрока.СодержитПотери  Тогда
			
			Если КолвоНештатнойРаботыЧас <= 360 Тогда
				ОбъемДосчитанный        = 0;
				ОбъемИтоговый			= 0;
				СпособНачисления		= Перечисления.энргСпособНачислений.ПоПриборам;
			Иначе 
				Если ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда
					ОбъемДосчитанный        = ТекСтрока.ДоговорнойОбъем;
					СпособНачисления		= Перечисления.энргСпособНачислений.СреднееПоНормативу;
				ИначеЕсли ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке Тогда
					Отбор = Новый Структура();
					Отбор.Вставить("ОбъектРасчета",ТекСтрока.ОбъектРасчета);
					Отбор.Вставить("Услуга",ТекСтрока.Услуга);
					мСтроки = ТЗРаспределятьНагрузку.НайтиСтроки(Отбор);
					Если мСтроки.Количество() = 0 Тогда
						Коэффициент				= (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) / (ТемпВоздухаВнутриПомещения - ПроектТемпНаружВоздуха);
						ОбъемДосчитанный        = ТекСтрока.ЗначениеНагрузки * ТекСтрока.КоличествоЧасовРаботыТУ * ?(ТекСтрока.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху, Коэффициент, 1);
						НовСтр = ТЗРаспределятьНагрузку.Добавить();
						НовСтр.ОбъектРасчета = ТекСтрока.ОбъектРасчета;
						НовСтр.Услуга 		 = ТекСтрока.Услуга;
					Иначе
						ОбъемДосчитанный        = 0;						
					КонецЕсли;
					СпособНачисления		= Перечисления.энргСпособНачислений.СреднееПоНормативу;
				Иначе
					ОбъемДосчитанный        = 0;
					СпособНачисления		= Перечисления.энргСпособНачислений.ПоПриборам;
				КонецЕсли;
				
				ОбъемИтоговый = ОбъемДосчитанный;
			КонецЕсли;
		ИначеЕсли КолвоНештатнойРаботыЧас = 0 Тогда
			Если ТекСтрока.Услуга.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод 
				И ЗначениеЗаполнено(ТекСтрока.Услуга.ЗависитОтУслуги) 
				И НЕ ТекСтрока.ЕстьПоказания Тогда
				Температуры 				= Получить_t_под__t_хв(ТекСтрока);
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ТочкаУчета", ТекСтрока.ТочкаУчета);
				ПараметрыОтбора.Вставить("Услуга", ТекСтрока.Услуга.ЗависитОтУслуги);
				мСтрок = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
				Если мСтрок.Количество() > 0 Тогда
					ОбъемЗависимой = мСтрок[0].Объем;
					Если ЗначениеЗаполнено(ТекСтрока.ОбъектРасчета.МКД) Тогда
						ОбъемДосчитанный = ОбъемЗависимой * ПолучитьЗначениеНорматива(ТекСтрока.ОбъектРасчета, ТекСтрока.ТочкаУчета, ТекСтрока.Услуга);
					Иначе
						ОбъемДосчитанный 	= ОбъемЗависимой * ( ?(ЗначениеЗаполнено(ТекСтрока.Температура),ТекСтрока.Температура, Температуры.t_под) - Температуры.t_хв ) / 1000;
					КонецЕсли;
					ОбъемИтоговый		= ОбъемДосчитанный;
				Иначе
					ОбъемДосчитанный			= 0;
					ОбъемИтоговый				= ТекСтрока.Объем;
				КонецЕсли;
			Иначе
				ОбъемДосчитанный			= 0;
				ОбъемИтоговый				= ТекСтрока.Объем;
			КонецЕсли;
			
			СпособНачисления			= Перечисления.энргСпособНачислений.ПоПриборам;
			
		ИначеЕсли ТекСтрока.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоСреднесуточномуКоличествуТепловойЭнергии Тогда
			
			КолвоТепловойЭнергии 	= 0;
			
			Если КолвоНештатнойРаботыЧас > 360 Тогда
				
				Отбор = Новый Структура();
				Отбор.Вставить("ОбъектРасчета",ТекСтрока.ОбъектРасчета);
				Отбор.Вставить("Услуга",ТекСтрока.Услуга);
				мСтроки = ТЗРаспределятьНагрузку.НайтиСтроки(Отбор);
				Если мСтроки.Количество() = 0 Тогда
					ТемпературныйКоэффициент = (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) / (ТемпВоздухаВнутриПомещения - ПроектТемпНаружВоздуха);
					КолвоТепловойЭнергии	 = ТекСтрока.ЗначениеНагрузки;				
					ОбъемДосчитанный         = КолвоТепловойЭнергии * ТекСтрока.КоличествоЧасовРаботыТУ * ?(ТекСтрока.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициент, 1);
					
					НовСтр = ТЗРаспределятьНагрузку.Добавить();
					НовСтр.ОбъектРасчета = ТекСтрока.ОбъектРасчета;
					НовСтр.Услуга 		 = ТекСтрока.Услуга;
				Иначе
					ОбъемДосчитанный        = 0;
				КонецЕсли;
				ОбъемИтоговый			 = ОбъемДосчитанный;
				СпособНачисления		= Перечисления.энргСпособНачислений.СреднееПоНормативу;
				
			ИначеЕсли ТекСтрока.ЕстьПоказания Тогда
				
				ТемпературныйКоэффициент	 = (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) / (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха);
				КолвоТепловойЭнергии		 = ТекСтрока.Объем;	
				Если Откуда = "КоличествоЧасовШтатнойРаботыПУ" Тогда
					Если ТекСтрока.КоличествоЧасовШтатнойРаботыПУ = пКоличествоЧасовШтатнойРаботыПУ Тогда
						ОбъемДосчитанный       	 	 = КолвоТепловойЭнергии / пКоличествоЧасовШтатнойРаботыПУ * КолвоНештатнойРаботыЧас * ?(ТекСтрока.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициент, 1);
					ИначеЕсли ТекСтрока.КоличествоЧасовШтатнойРаботыПУ < ТекСтрока.КоличествоЧасовРаботыТУ Тогда
						ОбъемДосчитанный       	 	 = КолвоТепловойЭнергии / ТекСтрока.КоличествоЧасовШтатнойРаботыПУ * КолвоНештатнойРаботыЧас * ?(ТекСтрока.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициент, 1);
					Иначе
						ОбъемДосчитанный = 0;
					КонецЕсли;
				Иначе
					ОбъемДосчитанный       	 	 = ?(пКоличествоЧасовШтатнойРаботыПУ = 0, 0, КолвоТепловойЭнергии / пКоличествоЧасовШтатнойРаботыПУ * КолвоНештатнойРаботыЧас * ?(ТекСтрока.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициент, 1));
				КонецЕсли;
				ОбъемИтоговый				 = ОбъемДосчитанный + ТекСтрока.Объем;
				СпособНачисления		= Перечисления.энргСпособНачислений.ПоПриборам;
			Иначе
				Если ТекСтрока.ОбъемУслугиПредПУ = ТекСтрока.ОбъемУслугиПред  Тогда
					ТемпературныйКоэффициент = (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) /	(ТемпВоздухаВнутриПомещения - ТекСтрока.СреднемесячнаяТемператураПред);
					ОбъемДосчитанный         = ТекСтрока.ОбъемУслугиПредПУ / ТекСтрока.КоличествоЧасовШтРаботыПред * ТекСтрока.КоличествоЧасовРаботыТУ * ?(ТекСтрока.Услуга.бестИспользоватьТемпературныйКоэффициентПоВоздуху, ТемпературныйКоэффициент, 1);
				КонецЕсли;
				ОбъемИтоговый			= ОбъемДосчитанный;
				СпособНачисления		= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
			КонецЕсли;	
			
		ИначеЕсли ТекСтрока.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод Тогда
			
			КолвоТепловойЭнергии 			= 0;
			Коэффициент						= 1;
			
			Если (КолвоНештатнойРаботыЧас <= 720 Или Не ТекСтрока.ЕстьПоказания) И ТекСтрока.ОбъемУслугиПредПУ = ТекСтрока.ОбъемУслугиПред Тогда
				ОбъемДосчитанный        	= ТекСтрока.ОбъемУслугиПредПУ;	
				ОбъемИтоговый				= ОбъемДосчитанный;
				СпособНачисления			= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
			Иначе	
				
				Отбор = Новый Структура();
				Отбор.Вставить("ОбъектРасчета",ТекСтрока.ОбъектРасчета);
				Отбор.Вставить("Услуга",ТекСтрока.Услуга);
				мСтроки = ТЗРаспределятьНагрузку.НайтиСтроки(Отбор);
				Если мСтроки.Количество() = 0 Тогда
					НовСтр = ТЗРаспределятьНагрузку.Добавить();
					НовСтр.ОбъектРасчета = ТекСтрока.ОбъектРасчета;
					НовСтр.Услуга 		 = ТекСтрока.Услуга;
					
					Если ЗначениеЗаполнено(ТекСтрока.ЗависитОтУслуги) И ТекСтрока.Приоритет = 0 Тогда
						Если ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда
							ОбъемДосчитанный        = ТекСтрока.ДоговорнойОбъем;
						ИначеЕсли ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке Тогда
							ОбъемДосчитанный        = ТекСтрока.ЗначениеНагрузки * ТекСтрока.КоличествоЧасовРаботыТУ;
						Иначе
							ОбъемДосчитанный        = 0;
						КонецЕсли;
					Иначе
						
						Если НЕ НачисленияПоТочкам[ТекСтрока.ТочкаУчета] = Неопределено Тогда
							Если НЕ НачисленияПоТочкам[ТекСтрока.ТочкаУчета][ТекСтрока.ЗависитОтУслуги] = Неопределено Тогда
								
								ОбъемУслугиОсновной 						= НачисленияПоТочкам[ТекСтрока.ТочкаУчета][ТекСтрока.ЗависитОтУслуги];
								
								Если ТекСтрока.Услуга.ЗависитОтУслуги = ТекСтрока.ЗависитОтУслуги Тогда
									ОбъемДосчитанный = ОбъемУслугиОсновной * (ТекСтрока.ТемпПодачиИсточника - ТекСтрока.ТемпХВИсточника) / 1000;
								Иначе
									ОбъемДосчитанный = ОбъемУслугиОсновной / (ТекСтрока.ТемпПодачиИсточника - ТекСтрока.ТемпХВИсточника) * 1000;
								КонецЕсли;					
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;	
				Иначе
					ОбъемДосчитанный        = 0;
				КонецЕсли;
				
				ОбъемИтоговый					= ОбъемДосчитанный;
				СпособНачисления				= Перечисления.энргСпособНачислений.СреднееПоНормативу;
			КонецЕсли;
			
		Иначе 
			ОбъемДосчитанный					= 0;
			ОбъемИтоговый						= ТекСтрока.Объем;
			СпособНачисления					= Перечисления.энргСпособНачислений.ПоПриборам;
		КонецЕсли;	
		
		НачисленияПоУслуге.Вставить(ТекСтрока.Услуга, ОбъемДосчитанный);

		
		НачисленияПоТочкам.Вставить(ТекСтрока.ТочкаУчета, НачисленияПоУслуге);

		
		СтрокаПоНомеру					= Объект.ТочкиУчета[ТекНомерСтроки-1];
		
		Если ЗначениеЗаполнено(ТекСтрока.ОбъемМГВ) Тогда
			Если СпособНачисления = Перечисления.энргСпособНачислений.СреднееПоНормативу Тогда 
				СтрокаПоНомеру.ОбъемДосчитанный = ОбъемДосчитанный;
				СтрокаПоНомеру.ОбъемИтоговый 	= СтрокаПоНомеру.ОбъемДосчитанный + СтрокаПоНомеру.Объем;
			Иначе
				СтрокаПоНомеру.ОбъемИтоговый 	= СтрокаПоНомеру.ОбъемДосчитанный + СтрокаПоНомеру.Объем;
			КонецЕсли;
		Иначе
			СтрокаПоНомеру.ОбъемДосчитанный = ОбъемДосчитанный;
			СтрокаПоНомеру.ОбъемИтоговый 	= ОбъемИтоговый;
			СтрокаПоНомеру.СпособНачисления = СпособНачисления;
		КонецЕсли;
		
		
	КонецЦикла;  	
	
	Пока ЗависимыеУслугиВыборка.Следующий() Цикл
		СтрокаПоНомеру					= Объект.ТочкиУчета[ЗависимыеУслугиВыборка.НомерСтроки-1];
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Услуга", ЗависимыеУслугиВыборка.Услуга);
		ПараметрыОтбора.Вставить("ТочкаУчета", СтрокаПоНомеру.ТочкаУчета);
		НайденныеСтроки = Объект.ТочкиУчета.НайтиСтроки(ПараметрыОтбора);
		Для каждого стр из НайденныеСтроки Цикл
			стр.ОбъемДосчитанный 	= СтрокаПоНомеру.ОбъемДосчитанный;
			стр.ОбъемИтоговый 		= СтрокаПоНомеру.ОбъемИтоговый;
			стр.СпособНачисления 	= СтрокаПоНомеру.СпособНачисления;
			стр.Объем 				= СтрокаПоНомеру.Объем;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗначенияТемператур()
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Дата", 				Объект.Дата);
	Запрос.УстановитьПараметр("ДатаНачПредМесяц",	НачалоМесяца((ДобавитьМесяц(Объект.Дата,-1))));
	Запрос.УстановитьПараметр("ДатаКонПредМесяц",	КонецМесяца((ДобавитьМесяц(Объект.Дата,-1))));
	Запрос.УстановитьПараметр("Ссылка", 			Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	Запрос.УстановитьПараметр("Район", 				Объект.Район);
	//Запрос.УстановитьПараметр("Договор", 			Объект.Договор);
	Запрос.УстановитьПараметр("ПериодНачисления", 	Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("РасчетныйМесяцПред", ДобавитьМесяц(Объект.ПериодНачисления, -1));
	Запрос.УстановитьПараметр("Таблица", 			Объект.ТочкиУчета.Выгрузить());
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.ОбъектРасчета КАК ОбъектРасчета,
	               |	Таблица.Услуга КАК Услуга,
	               |	&Организация КАК Организация,
	               |	&Район КАК Район,
	               |	Таблица.Договор КАК Договор,
	               |	&ПериодНачисления КАК ПериодНачисления,
	               |	Таблица.НомерСтроки КАК НомерСтроки,
	               |	Таблица.ТочкаУчета КАК ТочкаУчета,
	               |	Таблица.Объем КАК Объем,
	               |	Таблица.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	Таблица.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	               |	Таблица.ОбъемДосчитанный КАК ОбъемДосчитанный,
	               |	Таблица.ЗначениеНагрузки КАК ЗначениеНагрузки,
	               |	Таблица.ДоговорнойОбъем КАК ДоговорнойОбъем,
	               |	Таблица.ПриборУчета КАК ПриборУчета,
	               |	Таблица.ОбъемМГВ КАК ОбъемМГВ,
	               |	Таблица.ЕстьПоказания КАК ЕстьПоказания,
	               |	Таблица.КоличествоЧасовРаботыВКоммерческомУчете КАК КоличествоЧасовРаботыВКоммерческомУчете,
	               |	Таблица.Температура КАК Температура,
	               |	Таблица.СоставнаяУслуга КАК СоставнаяУслуга
	               |ПОМЕСТИТЬ ВрТ0
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	энргВидыУслугЗависимыеУслуги.Услуга КАК Услуга,
	               |	ВрТ0.НомерСтроки КАК НомерСтроки,
	               |	ВрТ0.ТочкаУчета КАК ТочкаУчета,
	               |	энргВидыУслугЗависимыеУслуги.УслугаЗависитОт КАК УслугаЗависитОт
	               |ПОМЕСТИТЬ ЗависимыеУслугиТЧ
	               |ИЗ
	               |	ВрТ0 КАК ВрТ0
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.ЗависимыеУслуги КАК энргВидыУслугЗависимыеУслуги
	               |		ПО ВрТ0.СоставнаяУслуга = энргВидыУслугЗависимыеУслуги.Ссылка
	               |			И ВрТ0.Услуга = энргВидыУслугЗависимыеУслуги.УслугаЗависитОт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВрТ0.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ0.Услуга КАК Услуга,
	               |	ВрТ0.Организация КАК Организация,
	               |	ВрТ0.Район КАК Район,
	               |	ВрТ0.Договор КАК Договор,
	               |	ВрТ0.ПериодНачисления КАК ПериодНачисления,
	               |	ЕСТЬNULL(бестОбъектыРасчета.КатегорияПомещения, ЗНАЧЕНИЕ(Справочник.энргКатегорииПомещений.ПустаяСсылка)) КАК КатегорияПомещения,
	               |	ЕСТЬNULL(энргВидыУслуг.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)) КАК ВидСезонностУслуги,
	               |	ВрТ0.НомерСтроки КАК НомерСтроки,
	               |	ВрТ0.ТочкаУчета КАК ТочкаУчета,
	               |	ВрТ0.Объем КАК Объем,
	               |	ВрТ0.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	ВрТ0.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	               |	ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК ЗависитОтУслуги,
	               |	ЕСТЬNULL(энргВидыУслуг.СпособДосчётаРесурса, ЗНАЧЕНИЕ(перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)) КАК СпособДосчета,
	               |	ВрТ0.ОбъемДосчитанный КАК ОбъемДосчитанный,
	               |	ВрТ0.ЗначениеНагрузки КАК ЗначениеНагрузки,
	               |	ВрТ0.ПриборУчета КАК ПриборУчета,
	               |	ЕСТЬNULL(бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети, ЗНАЧЕНИЕ(Справочник.бестСтруктураСети.ПустаяСсылка)) КАК Источник,
	               |	ВрТ0.ДоговорнойОбъем КАК ДоговорнойОбъем,
	               |	энргВидыУслуг.СодержитПотери КАК СодержитПотери,
	               |	ВрТ0.ЕстьПоказания КАК ЕстьПоказания,
	               |	ВрТ0.ОбъемМГВ КАК ОбъемМГВ,
	               |	ВрТ0.Температура КАК Температура
	               |ПОМЕСТИТЬ ВрТ1
	               |ИЗ
	               |	ВрТ0 КАК ВрТ0
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	               |		ПО ВрТ0.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	               |		ПО ВрТ0.Услуга = энргВидыУслуг.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	               |		ПО ВрТ0.Организация = бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация
	               |			И ВрТ0.Район = бестСтруктураСетиТочекУчетаНПСрезПоследних.Район
	               |			И ВрТ0.ОбъектРасчета = бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета
	               |			И ВрТ0.ТочкаУчета = бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета
	               |ГДЕ
	               |	НЕ ВрТ0.Услуга В
	               |				(ВЫБРАТЬ
	               |					ЗависимыеУслугиТЧ.Услуга КАК Услуга
	               |				ИЗ
	               |					ЗависимыеУслугиТЧ КАК ЗависимыеУслугиТЧ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.Организация КАК Организация,
	               |	ВрТ1.Район КАК Район,
	               |	ВрТ1.Договор КАК Договор,
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.ТочкаУчета КАК ТочкаУчета,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемПоПриборуОборот, 0)) КАК ОбъемПоПрибору,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот, 0)) КАК ОбъемУслуги,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиПотребленныйОборот, 0)) КАК ОбъемУслугиПотребленный,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.КоличествоЧасовШтатнойРаботыПУОборот, 0)) КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемДосчитанныйОборот, 0)) КАК ОбъемДосчитанный,
	               |	ВрТ1.Услуга КАК Услуга,
	               |	ВрТ1.ЗависитОтУслуги КАК ЗависитОтУслуги
	               |ПОМЕСТИТЬ ОбъемыЗаПредМесяц
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	               |				&ДатаНачПредМесяц,
	               |				&ДатаКонПредМесяц,
	               |				Месяц,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)
	               |					И НЕ Распределение) КАК бестОбъемНачисленийНПОбороты
	               |		ПО ВрТ1.Организация = бестОбъемНачисленийНПОбороты.Организация
	               |			И ВрТ1.Район = бестОбъемНачисленийНПОбороты.Район
	               |			И ВрТ1.Договор = бестОбъемНачисленийНПОбороты.Договор
	               |			И ВрТ1.ТочкаУчета = бестОбъемНачисленийНПОбороты.ТочкаУчета
	               |			И ВрТ1.ОбъектРасчета = бестОбъемНачисленийНПОбороты.ОбъектРасчета
	               |			И ВрТ1.ПриборУчета = бестОбъемНачисленийНПОбороты.ПриборУчета
	               |			И ВрТ1.Услуга = бестОбъемНачисленийНПОбороты.Услуга
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТ1.Организация,
	               |	ВрТ1.Район,
	               |	ВрТ1.Договор,
	               |	ВрТ1.ОбъектРасчета,
	               |	ВрТ1.ТочкаУчета,
	               |	ВрТ1.Услуга,
	               |	ВрТ1.ЗависитОтУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестСпособНачисленияНормативаНПСрезПоследних.Услуга КАК Услуга,
	               |	бестСпособНачисленияНормативаНПСрезПоследних.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	бестСпособНачисленияНормативаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ СпособыРасчетаНорматива
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСпособНачисленияНормативаНП.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестСпособНачисленияНормативаНПСрезПоследних
	               |		ПО ВрТ1.ОбъектРасчета = бестСпособНачисленияНормативаНПСрезПоследних.ОбъектРасчета
	               |			И ВрТ1.Услуга = бестСпособНачисленияНормативаНПСрезПоследних.Услуга
	               |			И ВрТ1.ТочкаУчета = бестСпособНачисленияНормативаНПСрезПоследних.ТочкаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СпособыРасчетаНорматива.Услуга КАК Услуга,
	               |	СпособыРасчетаНорматива.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	СпособыРасчетаНорматива.ОбъектРасчета КАК ОбъектРасчета,
	               |	СпособыРасчетаНорматива.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	ВЫБОР
	               |		КОГДА СпособыРасчетаНорматива.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ТемпературныйКоэффициент)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПриоритетСпособаРасчета,
	               |	СпособыРасчетаНорматива.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ПриоритетСпособаРасчетаНорматива
	               |ИЗ
	               |	СпособыРасчетаНорматива КАК СпособыРасчетаНорматива
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.Договор КАК Договор,
	               |	ВрТ1.Услуга КАК Услуга,
	               |	ВрТ1.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	ВрТ1.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ Услуги
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Услуги.ОбъектРасчета КАК ОбъектРасчета,
	               |	Услуги.Договор КАК Договор,
	               |	Услуги.Услуга КАК Услуга,
	               |	Услуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	Услуги.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ЗависимыеУслуги
	               |ИЗ
	               |	Услуги КАК Услуги
	               |ГДЕ
	               |	Услуги.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗависимыеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	               |	ЗависимыеУслуги.Договор КАК Договор,
	               |	ЗависимыеУслуги.Услуга КАК Услуга,
	               |	ЗависимыеУслуги.ЗависитОтУслуги КАК ЗависимаяУслуга,
	               |	ЗависимыеУслуги.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ВзаимозависимыеУслуги
	               |ИЗ
	               |	ЗависимыеУслуги КАК ЗависимыеУслуги
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗависимыеУслуги.ОбъектРасчета,
	               |	ЗависимыеУслуги.Договор,
	               |	ЗависимыеУслуги.ЗависитОтУслуги,
	               |	ЗависимыеУслуги.Услуга,
	               |	ЗависимыеУслуги.ТочкаУчета
	               |ИЗ
	               |	ЗависимыеУслуги КАК ЗависимыеУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаимозависимыеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВзаимозависимыеУслуги.Договор КАК Договор,
	               |	ВзаимозависимыеУслуги.Услуга КАК Услуга,
	               |	ВзаимозависимыеУслуги.ЗависимаяУслуга КАК ЗависимаяУслуга,
	               |	ПриоритетСпособаРасчетаНорматива.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	ПриоритетСпособаРасчетаНорматива.ПриоритетСпособаРасчета КАК ПриоритетСпособаРасчета,
	               |	ВзаимозависимыеУслуги.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ПриоритетРасчетаЗависимыхУслуг
	               |ИЗ
	               |	ВзаимозависимыеУслуги КАК ВзаимозависимыеУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетСпособаРасчетаНорматива КАК ПриоритетСпособаРасчетаНорматива
	               |		ПО ВзаимозависимыеУслуги.ОбъектРасчета = ПриоритетСпособаРасчетаНорматива.ОбъектРасчета
	               |			И ВзаимозависимыеУслуги.Услуга = ПриоритетСпособаРасчетаНорматива.Услуга
	               |			И ВзаимозависимыеУслуги.ТочкаУчета = ПриоритетСпособаРасчетаНорматива.ТочкаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.Организация КАК Организация,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.Район КАК Район,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.РасчетныйМесяц КАК РасчетныйМесяц,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.ВидПериода КАК ВидПериода,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература
	               |ПОМЕСТИТЬ СреднемесячнаяТемпПредМесяц
	               |ИЗ
	               |	РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха КАК бестСреднемесячнаяТемператураНаружногоВоздуха
	               |ГДЕ
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.Организация = &Организация
	               |	И бестСреднемесячнаяТемператураНаружногоВоздуха.Район = &Район
	               |	И бестСреднемесячнаяТемператураНаружногоВоздуха.РасчетныйМесяц = &РасчетныйМесяцПред
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.Услуга КАК Услуга,
	               |	ВрТ1.Организация КАК Организация,
	               |	ВрТ1.Район КАК Район,
	               |	ВрТ1.Договор КАК Договор,
	               |	ВрТ1.ПериодНачисления КАК ПериодНачисления,
	               |	ВрТ1.КатегорияПомещения КАК КатегорияПомещения,
	               |	ВрТ1.ВидСезонностУслуги КАК ВидСезонностУслуги,
	               |	ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, 0) КАК ТемператураКатегорииОбъекта,
	               |	ЕСТЬNULL(бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	               |	ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, 0) КАК ПроектнаяТемпература,
	               |	ВрТ1.ТочкаУчета КАК ТочкаУчета,
	               |	ВрТ1.Объем КАК Объем,
	               |	ВрТ1.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	ВрТ1.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	               |	ВрТ1.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ЗависимаяУслуга, ВрТ1.ЗависитОтУслуги) КАК ЗависитОтУслуги,
	               |	ВрТ1.СпособДосчета КАК СпособДосчётаРесурса,
	               |	ВрТ1.ОбъемДосчитанный КАК ОбъемДосчитанный,
	               |	ЕСТЬNULL(ВрТ1.ЗначениеНагрузки, 0) КАК ЗначениеНагрузки,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяц.КоличествоЧасовШтатнойРаботыПУ, 0) КАК КоличествоЧасовШтРаботыПред,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяц.ОбъемПоПрибору, 0) КАК ОбъемУслугиПредПУ,
	               |	ЕСТЬNULL(бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника, 0) КАК ТемпПодачиИсточника,
	               |	ЕСТЬNULL(бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника, 0) КАК ТемпХВИсточника,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяцЗависимойУслуги.ОбъемПоПрибору, 0) КАК ОбъемЗависимойУслугиПред,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяцЗависимойУслуги.КоличествоЧасовШтатнойРаботыПУ, 0) КАК КоличествоЧасовШтРаботыПредЗависимойУслуги,
	               |	ЕСТЬNULL(ВрТ1ЗависимойУслуги.ЗначениеНагрузки, 0) КАК ЗначениеНагрузкиЗависимойУслуги,
	               |	ЕСТЬNULL(ВрТ1ЗависимойУслуги.ДоговорнойОбъем, 0) КАК ДоговорнойОбъемЗависимойУслуги,
	               |	ЕСТЬNULL(ВрТ1.ДоговорнойОбъем, 0) КАК ДоговорнойОбъем,
	               |	СпособыРасчетаНорматива.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	ПриоритетРасчетаЗависимыхУслуг.СпособРасчетаНорматива КАК СпособРасчетаНормативаЗависимойУслуги,
	               |	ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ПриоритетСпособаРасчета, 0) КАК Приоритет,
	               |	ВрТ1.СодержитПотери КАК СодержитПотери,
	               |	СреднемесячнаяТемпПредМесяц.СреднемесячнаяТемпература КАК СреднемесячнаяТемператураПред,
	               |	ВрТ1.ЕстьПоказания КАК ЕстьПоказания,
	               |	ОбъемыЗаПредМесяц.ОбъемУслуги КАК ОбъемУслугиПред,
	               |	ВрТ1.ОбъемМГВ КАК ОбъемМГВ,
	               |	ВрТ1.Температура КАК Температура
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	               |		ПО ВрТ1.КатегорияПомещения = бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения
	               |			И ВрТ1.Организация = бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация
	               |			И ВрТ1.Район = бестТемпературыВКатегорияхОбъектовСрезПоследних.Район
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	               |		ПО ВрТ1.ПериодНачисления = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.РасчетныйМесяц
	               |			И ВрТ1.ВидСезонностУслуги = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.ВидПериода
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыЗаПредМесяц КАК ОбъемыЗаПредМесяц
	               |		ПО ВрТ1.ОбъектРасчета = ОбъемыЗаПредМесяц.ОбъектРасчета
	               |			И ВрТ1.ТочкаУчета = ОбъемыЗаПредМесяц.ТочкаУчета
	               |			И ВрТ1.Услуга = ОбъемыЗаПредМесяц.Услуга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемператураИсточника.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестТемператураИсточникаСрезПоследних
	               |		ПО ВрТ1.Организация = бестТемператураИсточникаСрезПоследних.Организация
	               |			И ВрТ1.Район = бестТемператураИсточникаСрезПоследних.Район
	               |			И ВрТ1.Источник = бестТемператураИсточникаСрезПоследних.Источник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыЗаПредМесяц КАК ОбъемыЗаПредМесяцЗависимойУслуги
	               |		ПО ВрТ1.ОбъектРасчета = ОбъемыЗаПредМесяцЗависимойУслуги.ОбъектРасчета
	               |			И ВрТ1.ТочкаУчета = ОбъемыЗаПредМесяцЗависимойУслуги.ТочкаУчета
	               |			И ВрТ1.Услуга = ОбъемыЗаПредМесяцЗависимойУслуги.ЗависитОтУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВрТ1 КАК ВрТ1ЗависимойУслуги
	               |		ПО ВрТ1.ОбъектРасчета = ВрТ1ЗависимойУслуги.ОбъектРасчета
	               |			И ВрТ1.ТочкаУчета = ВрТ1ЗависимойУслуги.ТочкаУчета
	               |			И ВрТ1.Услуга = ВрТ1ЗависимойУслуги.ЗависитОтУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СпособыРасчетаНорматива КАК СпособыРасчетаНорматива
	               |		ПО ВрТ1.ОбъектРасчета = СпособыРасчетаНорматива.ОбъектРасчета
	               |			И ВрТ1.Услуга = СпособыРасчетаНорматива.Услуга
	               |			И ВрТ1.ТочкаУчета = СпособыРасчетаНорматива.ТочкаУчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетРасчетаЗависимыхУслуг КАК ПриоритетРасчетаЗависимыхУслуг
	               |		ПО ВрТ1.ОбъектРасчета = ПриоритетРасчетаЗависимыхУслуг.ОбъектРасчета
	               |			И ВрТ1.Услуга = ПриоритетРасчетаЗависимыхУслуг.Услуга
	               |			И ВрТ1.ТочкаУчета = ПриоритетРасчетаЗависимыхУслуг.ТочкаУчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СреднемесячнаяТемпПредМесяц КАК СреднемесячнаяТемпПредМесяц
	               |		ПО ВрТ1.ВидСезонностУслуги = СреднемесячнаяТемпПредМесяц.ВидПериода
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	               |		ПО ВрТ1.Организация = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Организация
	               |			И ВрТ1.Район = бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.Район
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет,
	               |	НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗависимыеУслугиТЧ.Услуга КАК Услуга,
	               |	ЗависимыеУслугиТЧ.НомерСтроки КАК НомерСтроки,
	               |	ЗависимыеУслугиТЧ.УслугаЗависитОт КАК УслугаЗависитОт
	               |ИЗ
	               |	ЗависимыеУслугиТЧ КАК ЗависимыеУслугиТЧ";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;	
КонецФункции

&НаСервере
Функция ПолучитьОбъемыПредыдущегоМесяца(ТекСтрока)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестОбъемНачисленийНП.ОбъемПоПрибору КАК ОбъемПоПрибору,
		|	бестОбъемНачисленийНП.КоличествоЧасовШтатнойРаботыПУ КАК Q_гв_пп,
		|	бестОбъемНачисленийНП.ОбъемМГВ КАК ОбъемМГВ,
		|	бестОбъемНачисленийНП.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ
		|ИЗ
		|	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
		|ГДЕ
		|	бестОбъемНачисленийНП.Организация = &Организация
		|	И бестОбъемНачисленийНП.Район = &Район
		|	И бестОбъемНачисленийНП.Договор = &Договор
		|	И бестОбъемНачисленийНП.ОбъектРасчета = &ОбъектРасчета
		|	И бестОбъемНачисленийНП.Услуга = &Услуга
		|	И бестОбъемНачисленийНП.ТочкаУчета = &ТочкаУчета
		|	И бестОбъемНачисленийНП.ВидНачисления = &ВидНачисления
		|	И бестОбъемНачисленийНП.СпособНачисления = &СпособНачисления
		|	И бестОбъемНачисленийНП.ПриборУчета = &ПриборУчета
		|	И бестОбъемНачисленийНП.ТарифнаяЗона = &ТарифнаяЗона
		|	И бестОбъемНачисленийНП.ПериодНачисления = &ПериодНачисления";
	
	Запрос.УстановитьПараметр("ВидНачисления"		, Перечисления.энргВидыНачислений.Начисление);
	Запрос.УстановитьПараметр("Договор"				, ТекСтрока.Договор);
	Запрос.УстановитьПараметр("ОбъектРасчета"		, ТекСтрока.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация"			, Объект.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления"	, ДобавитьМесяц(Объект.ПериодНачисления,-1));
	Запрос.УстановитьПараметр("ПриборУчета"			, ТекСтрока.ПриборУчета);
	Запрос.УстановитьПараметр("Район"				, Объект.Район);
	Запрос.УстановитьПараметр("СпособНачисления"	, Перечисления.энргСпособНачислений.ПоПриборам);
	Запрос.УстановитьПараметр("ТарифнаяЗона"		, ТекСтрока.ТарифнаяЗона);
	Запрос.УстановитьПараметр("ТочкаУчета"			, ТекСтрока.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга"				, ТекСтрока.Услуга);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	СтруктураОтвета = новый Структура("ОбъемПоПрибору,Q_гв_пп,ОбъемМГВ,КоличествоЧасовРаботыТУ",0,0,0,0);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета,Выборка);		
	КонецЕсли;     	
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеПоУслуге(Услуга)
	 Возврат Новый Структура("СпособДосчётаРесурса, СодержитПотери", Услуга.СпособДосчётаРесурса, Услуга.СодержитПотери);
КонецФункции

&НаСервере
Функция Получить_t_под__t_хв(ТекСтрока)
	
	Температуры = новый Структура("t_под,t_хв",0,0);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети
		|ПОМЕСТИТЬ ВТ_Источник
		|ИЗ
		|	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника КАК t_под,
		|	бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника КАК t_хв
		|ИЗ
		|	РегистрСведений.бестТемператураИсточника.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Источник В
		|					(ВЫБРАТЬ
		|						ВТ_Источник.СтруктураСети КАК СтруктураСети
		|					ИЗ
		|						ВТ_Источник КАК ВТ_Источник)) КАК бестТемператураИсточникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"				, Объект.Дата); 	
	Запрос.УстановитьПараметр("Организация"			, Объект.Организация);
	Запрос.УстановитьПараметр("Район"				, Объект.Район);
	Запрос.УстановитьПараметр("Договор"				, ТекСтрока.Договор);
	Запрос.УстановитьПараметр("ОбъектРасчета"		, ТекСтрока.ОбъектРасчета);
	Запрос.УстановитьПараметр("ТочкаУчета"			, ТекСтрока.ТочкаУчета);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Температуры,Выборка);
	КонецЦикла;
	
	Возврат Температуры;
	
КонецФункции

#КонецОбласти

#КонецОбласти
