
#Область СобытияЭлементовШапки

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.МКД) тогда
		энргПользовательскийВводКлиент.ПриИзмененииМКД(Объект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Схема 							= Новый СхемаЗапроса;
	ОтборКлючейПомещений 		= Новый Массив;
	//ОтборКлючейПомещений.Добавить(Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей","","ТипПараметраРавно",Новый Структура("Строение","Строение")));
	ОтборКлючейПомещений.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Строение", 	"Строение"), 	Неопределено));
	
	ПараметрыКлючПомещений 		= Новый Структура("ПараметрыВТ", ОтборКлючейПомещений);
	РегистрыСведений.энргКлючиПомещений.ДанныеПомещения(Схема, ПараметрыКлючПомещений, "КлючиПомещений");
	
	
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ИмяПараметра,ТаблицаИсточник,ТипПараметра,СоотвествиеПолей", "КлючиПомещений", "КлючиПомещений", "ТипПараметраВременнаяТаблица",	Новый Структура("КлючПомещения","КлючПомещения")));
	
	пПараметры 						= Новый Структура;
	
	пПараметры.Вставить("Период", Новый Структура("ИмяПараметра","Период"));
	
	ПараметрыОтбор  				= Новый Массив;
	
	пПараметры.Вставить("ПараметрыВТ", 	ПараметрыВТ);
	пПараметры.Вставить("Отбор", 		ПараметрыОтбор);
	
	РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,пПараметры);
	
	ПараметрыЗапроса 					= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			Объект.Дата);
	ПараметрыЗапроса.Вставить("Район",			Объект.Район);
	ПараметрыЗапроса.Вставить("Организация",	Объект.Организация);  
	ПараметрыЗапроса.Вставить("Строение",		Объект.МКД);	
	
	РезультатЗапроса 					= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.ТочкиПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
