#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если НЕ Объект.КоэффициентОпределенияТарифа = 0 ИЛИ Объект. ИзменитьКоэффициентТарифа Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияТарифа", "Доступность", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияТарифа", "Доступность", Ложь);
	КонецЕсли;
	
	Если НЕ Объект.КоэффициентОпределенияОбъема = 0 ИЛИ Объект.ИзменитьКоэффициентОбъема Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияОбъема", "Доступность", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияОбъема", "Доступность", Ложь);	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзменитьКоэффициентОбъемаПриИзменении(Элемент)
	
	Объект.КоэффициентОпределенияОбъема = 0;
	
	Если Объект.ИзменитьКоэффициентОбъема Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияОбъема", "Доступность", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияОбъема", "Доступность", Ложь);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоэффициентТарифаПриИзменении(Элемент)
	
	Объект.КоэффициентОпределенияТарифа = 0;
	
	Если Объект. ИзменитьКоэффициентТарифа Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияТарифа", "Доступность", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоэффициентОпределенияТарифа", "Доступность", Ложь);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти