#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НаборЗаписейОбъемаНачисленийПениЗаПериод(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНаборЗаписейЗаПериод());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, Услуга, Абонент, Регистратор";		
		
		ИмяТаблицы					= "ОбъемНачислений";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ИмяТаблицы,Параметры.ПараметрыВТ,ДоступныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьЗаписиПоПомещениюДоЗаписи(НаборОбъемНачислений) Экспорт
	
	Запрос  = Новый Запрос(ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи());
	Запрос.УстановитьПараметр("Регистратор", 	НаборОбъемНачислений.ДополнительныеСвойства["ДокРегистратор"]);
	Запрос.УстановитьПараметр("Организация", 	НаборОбъемНачислений.ДополнительныеСвойства["Организация"]);
	Запрос.УстановитьПараметр("Район", 			НаборОбъемНачислений.ДополнительныеСвойства["Район"]);
	Запрос.УстановитьПараметр("Строение", 		НаборОбъемНачислений.ДополнительныеСвойства["Строение"]);
	Запрос.УстановитьПараметр("Помещение", 		НаборОбъемНачислений.ДополнительныеСвойства["Помещение"]);
	НаборОбъемНачислений.ДополнительныеСвойства.Вставить("ДанныеНабораДоЗаписи", Запрос.Выполнить().Выгрузить());
КонецПроцедуры 

Функция СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор) Экспорт
	
	Набор  = СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Регистратор);
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуНаборомЗаписей(Схема,Параметры,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуНаборомЗаписей());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	
	Если Параметры.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Регистратор, Период, КлючПомещения";		
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ОбъемНачислений",Параметры.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьНаборЗаписейПоРегистратору(Регистратор) Экспорт
	
	Набор = СоздатьНаборЗаписейСОтборомПоРегистратору(Регистратор);
	Набор.Записать();
	
КонецПроцедуры

Процедура ИсторияПени(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаИсторияПени());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
		
	ДоступныеПараметры 					= "Период, Регистратор, Организация, Район, МКД, Абонент, Услуга, Поставщик, ПериодРасчета, ПериодНачисления";
	Если ПараметрыОтбора.Свойство("Отбор") Тогда
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "энргНачислениеПени", ПараметрыОтбора.Отбор, ДоступныеПараметры);		
	КонецЕсли;
		
КонецПроцедуры

Процедура РассчитатьСуммы(СтрокНабора, ДопЧисло = 1)  Экспорт
	
	ПовыщающийКоэффициент 							= Макс(1,СтрокНабора.ПовыщающийКоэффициент);	
	СтрокНабора.Сумма 								= Окр(СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа,2)  * ДопЧисло * ПовыщающийКоэффициент + Окр(СтрокНабора.ОбъемУслугиПотери * СтрокНабора.ЗначениеТарифа,2);
	Если ПовыщающийКоэффициент > 1 Тогда
		СтрокНабора.СуммаПоПовышенномуКоэффициенту 	= Окр(СтрокНабора.ОбъемУслуги * СтрокНабора.ЗначениеТарифа,2) * (ПовыщающийКоэффициент - 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммуПоПотребленномуОбъему(СтрокНабора, ДопЧисло = 1)  Экспорт
	
	ПовыщающийКоэффициент 							= Макс(1,СтрокНабора.ПовыщающийКоэффициент);	
	СтрокНабора.Сумма 								= Окр(СтрокНабора.ОбъемУслугиПотребленный * СтрокНабора.ЗначениеТарифа,2) * ДопЧисло * ПовыщающийКоэффициент + + Окр(СтрокНабора.ОбъемУслугиПотребленныйПотери * СтрокНабора.ЗначениеТарифа,2);
	Если ПовыщающийКоэффициент > 1 Тогда
		СтрокНабора.СуммаПоПовышенномуКоэффициенту 	= Окр(СтрокНабора.ОбъемУслугиПотребленный * СтрокНабора.ЗначениеТарифа,2) * (ПовыщающийКоэффициент - 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНеЗначащиеЗаписи(Набор) Экспорт
	
	СтрокиУдалить  = Новый Массив;
	Для Сч = 0 По Набор.Количество() -1 Цикл
		
		Если Набор[Сч].Сумма = 0 Тогда
			СтрокиУдалить.Добавить(Набор[Сч]);
		КонецЕсли;		
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		Набор.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;	
	
 КонецПроцедуры

#Область ПередачаДанныхВБухгалетерию

Процедура НаборЗаписейДляПередачиДанныхПоФактическойСезонности(Схема,Параметры) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе	
		Пакет  = Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОбъемыДляПередачиДанныхВБухгалтериюПоФактическомуОбъему());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНаборЗаписейЗаПериод()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК ОбъемНачислений
	|		";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьСхемуНаборомЗаписей()
	
	Текст =
	"ВЫБРАТЬ
	|	ОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК ОбъемНачислений";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНаборЗаписейПоПомещениюДоЗаписи()
	
	Текст  =
	"ВЫБРАТЬ 
	|	Набор.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК Набор
	|ГДЕ
	|	Набор.Регистратор = &Регистратор
	|	И Набор.Организация = &Организация
	|	И Набор.Район = &Район
	|	И НЕ Набор.Распределение
	|	И Набор.Строение = &Строение
	|	И Набор.Помещение в (&Помещение)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОбъемыДляПередачиДанныхВБухгалтериюПоФактическомуОбъему()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргОбъемНачислений.Период КАК Период,
	|	энргОбъемНачислений.Организация КАК Организация,
	|	энргОбъемНачислений.Район КАК Район,
	|	энргОбъемНачислений.Абонент КАК Абонент,
	|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачислений.Услуга КАК Услуга,
	|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
	|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ВЫБОР
	|		КОГДА НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|			ТОГДА энргОбъемНачислений.ОбъемУслуги
	|		ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|	КОНЕЦ КАК ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА НЕ энргОбъемНачислений.БылУстановленныйПриборВЭтомГоду
	|			ТОГДА энргОбъемНачислений.ОбъемУслуги
	|		ИНАЧЕ энргОбъемНачислений.ОбъемУслугиПотребленный
	|	КОНЕЦ * энргОбъемНачислений.ЗначениеТарифа КАК Сумма
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	НЕ энргОбъемНачислений.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.КорректировкаСезонныхУслуг)";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаИсторияПени()
	
	Текст  =
	"ВЫБРАТЬ
	|	энргНачислениеПени.Период КАК Период,
	|	энргНачислениеПени.Регистратор КАК Регистратор,
	|	энргНачислениеПени.Абонент КАК Абонент,
	|	энргНачислениеПени.ПериодРасчета КАК ПериодРасчета,
	|	СУММА(энргНачислениеПени.Сумма) КАК Сумма
	|ИЗ
	|	РегистрНакопления.энргНачислениеПени КАК энргНачислениеПени
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Абонент,
	|	энргНачислениеПени.Регистратор,
	|	энргНачислениеПени.Период,
	|	энргНачислениеПени.ПериодРасчета";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли