#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РегламентноеЗадание

// Только для загрузки из регламентного задания
//	- не использует транзакцию и попытку, они уже определены в вызывающей процедуре 
Процедура ЗагрузитьПоказанияИзРегламентногоЗадания(ДокументОснование, АдресВХ) Экспорт	
	ТаблицаДанных 			= ДесериализоватьФайл(АдресВХ);
	СвязанныеДокументы 		= НайтиСвязанныеДокументы(ДокументОснование);
	ДокументыПроведения 	= Новый Соответствие;
	РезультатПакет 			= ДействующиеТочкиИИхПриборы(ДокументОснование.Дата, ДокументОснование.Организация, ТаблицаДанных); 
	
	КоличествоПакетов 		= РезультатПакет.Количество();
	ЗафиксироватьНеНайденныеДанные(ДокументОснование, РезультатПакет[КоличествоПакетов - 2]);
	ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатПакет[КоличествоПакетов - 1], СвязанныеДокументы, ДокументыПроведения);	
	ПровестиМодифицированныеДокументы(ДокументыПроведения);
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиЗагрузки

Функция ЗагрузитьПоказания(ДокументОснование, АдресВХ) Экспорт
	ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказания.Очистить();
	ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.Очистить();
	
	ТаблицаДанных = ДесериализоватьФайл(АдресВХ);
	ОбработатьТаблицуВнешнихДанных(ДокументОснование, ТаблицаДанных);
КонецФункции
	
#КонецОбласти   

#Область ОбработкаДанных

Процедура ОбработатьТаблицуВнешнихДанных(ДокументОснование, ТаблицаДанных) Экспорт	
	СвязанныеДокументы 		= НайтиСвязанныеДокументы(ДокументОснование);
	ДокументыПроведения 	= Новый Соответствие;
	
	РезультатПакет 			= ДействующиеТочкиИИхПриборы(ДокументОснование.Дата, ДокументОснование.Организация, ТаблицаДанных);	
	КоличествоПакетов 		= РезультатПакет.Количество();
	
	МожноПереименоватьФайл 	= Ложь;
	НачатьТранзакцию();		
	Попытка
		ОчиститьТабличныеЧастиСвязанныхДокументов(СвязанныеДокументы);
		
		ЗафиксироватьНеНайденныеДанные(ДокументОснование, РезультатПакет[КоличествоПакетов - 2]);
		ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатПакет[КоличествоПакетов - 1], СвязанныеДокументы, ДокументыПроведения);
		
		ПровестиМодифицированныеДокументы(ДокументыПроведения);
		ЗафиксироватьТранзакцию();
		
		МожноПереименоватьФайл = Истина;
	Исключение
		ОтменитьТранзакцию(); 	
		
		ИнфаОбОшибке 									= ИнформацияОбОшибке();
		ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
		ПараметрыЖурнала.ТекстПользователю 				= "Не удалось провести документы по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка показаний Пирамида", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала); 
	КонецПопытки;
	
	
	Если МожноПереименоватьФайл Тогда 
		Попытка
			ОписаниеФайла = Новый Структура("ПолноеИмя", ДокументОснование.ФайлДляЧтения);
			НовоеИмяФайла = энргИнтеграцияСПирамидой.УстановитьПрефиксЗагруженногоФайла(ОписаниеФайла);			
			ДокументОснование.ФайлДляЧтения = НовоеИмяФайла;		
		Исключение 			
			ИнфаОбОшибке 		= ИнформацияОбОшибке();
			ПараметрыЖурнала 	= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
			ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
			ПараметрыЖурнала.ТекстПользователю 				= "Не удалось переименовать загруженый файл по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
			энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка показаний Пирамида", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала);			
			
			ДокументОснование.Примечание = ДокументОснование.Примечание + " Не удалось переименовать загруженый файл";
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьТабличныеЧастиСвязанныхДокументов(СвязанныеДокументы)
	Для Каждого ТекКлючЗначение Из СвязанныеДокументы Цикл
		ДокументОбъект = ТекКлючЗначение.Значение; 		
		ДокументОбъект.ТочкиУчета.Очистить();
		ДокументОбъект.ШкалыПриборовУчета.Очистить();
		ДокументОбъект.ПоказанияПриборовУчета.Очистить();
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЦикла;					
КонецПроцедуры

Процедура ЗафиксироватьНеНайденныеДанные(ДокументОснование, Результат) Экспорт 
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли; 	
	
	ТекЗаводскойНомер	= Неопределено;
	ТаблицаПриборов 	= ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказания;
	ТаблицаТарифнойЗоны = ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона;	
	
	ТаблицаПриборов.Очистить();
	ТаблицаТарифнойЗоны.Очистить();
	
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		ИдентификаторСтроки = Новый УникальныйИдентификатор(Выборка.IDСтроки);
				
		Если НЕ ТекЗаводскойНомер = Выборка.НомерПрибораУчетаБыло Тогда		
			НСтрокаПрибора = ТаблицаПриборов.Добавить();
			ЗаполнитьЗначенияСвойств(НСтрокаПрибора, Выборка);
			НСтрокаПрибора.IDСтроки = ИдентификаторСтроки;
		КонецЕсли;
		
		НСтрокаТарифнойЗоны = ТаблицаТарифнойЗоны.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрокаТарифнойЗоны, Выборка);
		НСтрокаТарифнойЗоны.IDСтроки = ИдентификаторСтроки;
		
		ТекЗаводскойНомер = Выборка.НомерПрибораУчетаБыло;
	КонецЦикла; 	
КонецПроцедуры

Процедура ЗафиксироватьНайденныеДанные(ДокументОснование, Результат, СвязанныеДокументы, ДокументыПроведения, ОчищатьТЧЛиста = Истина) Экспорт 
	ВидОперации				= Перечисления.энргВидыОпераций.энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников;
	ЕстьНеЗагруженныеДанные	= ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказания.Количество() > 0;
	ОбходнойЛистОбъект		= Неопределено;
	ТекРайон 				= Неопределено;
	ТекТочкаУчета 			= Неопределено;
	ТекШкала 				= Неопределено;
	IDСтрокиТочки 			= Неопределено;
	IDСтрокиШкалы 			= Неопределено;	
	
	Выборка 	= Результат.выбрать();
	Примечание 	= ИмяСобытияЗагрузки();
	Пока Выборка.Следующий() Цикл 		
		
		Если НЕ ТекРайон = Выборка.Район Тогда
			ОбходнойЛистОбъект = СвязанныеДокументы[Выборка.Район];
			Если ОбходнойЛистОбъект = Неопределено Тогда 
				ОбходнойЛистОбъект = Документы.энргОбходнойЛист.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ОбходнойЛистОбъект, Выборка);
				ОбходнойЛистОбъект.Дата 				= ДокументОснование.Дата;
				ОбходнойЛистОбъект.ВидОперации 			= ВидОперации;
				ОбходнойЛистОбъект.ИсточникПоказаний 	= ДокументОснование.ИсточникПоказаний;
				ОбходнойЛистОбъект.ДокументОснование 	= ДокументОснование.Ссылка;
				ОбходнойЛистОбъект.Примечание 			= Примечание;
			Иначе
				Если ОчищатьТЧЛиста Тогда 
					ОбходнойЛистОбъект.ТочкиУчета.Очистить();
					ОбходнойЛистОбъект.ШкалыПриборовУчета.Очистить();
					ОбходнойЛистОбъект.ПоказанияПриборовУчета.Очистить();
				КонецЕсли;
			КонецЕсли;
			
			ТаблицаТочекУчета		= ОбходнойЛистОбъект.ТочкиУчета;
			ТаблицаШкалы       		= ОбходнойЛистОбъект.ШкалыПриборовУчета;
			ТаблицаПоказания		= ОбходнойЛистОбъект.ПоказанияПриборовУчета;
			ДокументыПроведения.Вставить(Выборка.Район, ОбходнойЛистОбъект);
		КонецЕсли; 			
		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			энргОбщегоНазначения.ОчиститьДанныеПоказанийПоТочкеУчета(Выборка.IDСтроки, ТаблицаТочекУчета, ТаблицаШкалы, ТаблицаПоказания);
			
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= ТаблицаТочекУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор(Выборка.IDСтроки);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.КлючПомещения 		= Выборка.КлючПомещения;
			СтрокаТочкиУчета.Абонент 			= Выборка.Абонент;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= ТаблицаШкалы.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;
		
		СтрокаПоказаний 						= ТаблицаПоказания.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		СтрокаПоказаний.ТекущиеПоказания 		= Выборка.ТекущиеПоказанияФайла;
		СтрокаПоказаний.ПоказанияПредоставлены	= Истина;
		
		ТекРайон 								= Выборка.Район;
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
	КонецЦикла; 
	
КонецПроцедуры


Процедура ПровестиМодифицированныеДокументы(ДокументыПроведения) Экспорт
	МенеджерПериода = Обработки.энргГраницыПериодаНачисленияМенеджер;
	Для Каждого ТекКлючЗначение Из ДокументыПроведения Цикл
		ДокументОбъект = ТекКлючЗначение.Значение;
		ДокументОбъект.ПериодНачисления = МенеджерПериода.ОпределитьПериодНачисления(ДокументОбъект.Дата, ДокументОбъект.Организация, ДокументОбъект.Район);
		ПрочитатьПредыдущиеПоказания(ДокументОбъект);		
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЦикла;	
КонецПроцедуры

Процедура ПрочитатьПредыдущиеПоказания(ДокументОбъект)
	ТаблицаПоказанийДляЗаполнения 		= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(ДокументОбъект.Организация, ДокументОбъект.ТочкиУчета, ДокументОбъект.ШкалыПриборовУчета, ДокументОбъект.ПоказанияПриборовУчета, ДокументОбъект.Район);
	РезультатДанныеЗаполненияПоказаний 	= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(ДокументОбъект.Организация, ДокументОбъект.Район, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний, ТаблицаПоказанийДляЗаполнения, ДокументОбъект.ПоказанияПриборовУчета);			
КонецПроцедуры
	
#КонецОбласти 

#Область ИсправлениеЗагруженныхДанных

Процедура ОбработатьИсправленныеДанные(ДокументОснование, РезультатЗапроса, Успешно, ДополнительныеПараметры = Неопределено) Экспорт
	СвязанныеДокументы 		= НайтиСвязанныеДокументы(ДокументОснование);
	ДокументыПроведения 	= Новый Соответствие;
	//РезультатПакет 			= ДействующиеТочкиИИхПриборы(ДокументОснование.Дата, ДокументОснование.Организация, ТаблицаДанных); 
	
	//КоличествоПакетов 		= РезультатПакет.Количество();	
	//ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатПакет[КоличествоПакетов - 1], СвязанныеДокументы, ДокументыПроведения, Ложь);	
	
	НачатьТранзакцию();		
	Попытка
		ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, Ложь);
		ПровестиМодифицированныеДокументы(ДокументыПроведения);
		ЗафиксироватьТранзакцию();		
		Успешно = Истина;
	Исключение
		ОтменитьТранзакцию(); 	
		
		ИнфаОбОшибке 									= ИнформацияОбОшибке();
		ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
		ПараметрыЖурнала.ТекстПользователю 				= "Не удалось провести документы по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка показаний Пирамида", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала); 
	КонецПопытки;
КонецПроцедуры 

#КонецОбласти

#Область РаботаСБазой

Функция ДействующиеТочкиИИхПриборы(Период, Организация, ТаблицаДанных) Экспорт 	
	Схема			= Новый СхемаЗапроса;
	Параметры 		= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", "Организация")	, Неопределено));	
	
	Параметры.Вставить("Период"		, Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);	
	Параметры.Вставить("ВключаяОРП"	, Истина);
	
	ДобавитьТекстЗапросаТаблицаВнешнихДанных(Схема);
	энргСостояниеТочекУчета.ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры);
	ДобавитьТекстЗапросаКоличествоСтрокПоПриборуИзВнешнихДанных(Схема);
	ДобавитьТекстЗапросаКоличествоСтрокПоПриборуИзВнутреннихДанных(Схема);
	ДобавитьТекстЗапросаНеНайденныеПриборы(Схема);
	ДобавитьТекстЗапросаНесовпадениеТарифныхЗон(Схема);
	ДобавитьТекстЗапросаПриборУчетаНаНесколькихПомещениях(Схема);
	ДобавитьТекстЗапросаОбъединенияНенайденныхДанных(Схема);	
	ДобавитьТекстЗапросаПриборыИзВнешнихДанныхДляСвязи(Схема);	
	
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеПоПриборам.Район КАК Район,
	|	ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
	|	НеНайденныеДанныеИзВнешнихДанных.IDСтроки КАК IDСтроки,
	|	МАКСИМУМ(АбонентыПомещений.Абонент) КАК Абонент
	|ПОМЕСТИТЬ АбонентПрибораУчетаНЕНайденныхДанных
	|ИЗ
	|	ДанныеПоПриборам КАК ДанныеПоПриборам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НеНайденныеДанныеИзВнешнихДанных КАК НеНайденныеДанныеИзВнешнихДанных
	|		ПО ДанныеПоПриборам.ЗаводскойНомер = НеНайденныеДанныеИзВнешнихДанных.НомерПрибораУчетаБыло
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АбонентыПомещений КАК АбонентыПомещений
	|		ПО ДанныеПоПриборам.Организация = АбонентыПомещений.Организация
	|			И ДанныеПоПриборам.Район = АбонентыПомещений.Район
	|			И ДанныеПоПриборам.КлючПомещения = АбонентыПомещений.КлючПомещения
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоПриборам.Район,
	|	ДанныеПоПриборам.КлючПомещения,
	|	НеНайденныеДанныеИзВнешнихДанных.IDСтроки");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	НеНайденныеДанныеИзВнешнихДанных.IDСтроки КАК IDСтроки,
	|	АбонентПрибораУчетаНЕНайденныхДанных.Район КАК Район,
	|	АбонентПрибораУчетаНЕНайденныхДанных.КлючПомещения КАК КлючПомещения,
	|	АбонентПрибораУчетаНЕНайденныхДанных.Абонент КАК Абонент,
	|	НеНайденныеДанныеИзВнешнихДанных.НомерПрибораУчетаБыло КАК НомерПрибораУчетаБыло,
	|	НеНайденныеДанныеИзВнешнихДанных.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НеНайденныеДанныеИзВнешнихДанных.ТекущиеПоказания КАК ТекущиеПоказания,
	|	НеНайденныеДанныеИзВнешнихДанных.ОписаниеОшибки КАК ОписаниеОшибки,
	|	энргАбоненты.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	НеНайденныеДанныеИзВнешнихДанных КАК НеНайденныеДанныеИзВнешнихДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ АбонентПрибораУчетаНЕНайденныхДанных КАК АбонентПрибораУчетаНЕНайденныхДанных
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ПО АбонентПрибораУчетаНЕНайденныхДанных.Абонент = энргАбоненты.Ссылка
	|		ПО НеНайденныеДанныеИзВнешнихДанных.IDСтроки = АбонентПрибораУчетаНЕНайденныхДанных.IDСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПрибораУчетаБыло");
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеПоПриборамИтог.Организация КАК Организация,
	|	ДанныеПоПриборамИтог.Район КАК Район,
	|	ДанныеПоПриборамИтог.КлючПомещения КАК КлючПомещения,
	|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
	|	ДанныеПоПриборамИтог.РодительТочкиУчета КАК РодительТочкиУчета,
	|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
	|	ДанныеПоПриборамИтог.Услуга КАК Услуга,
	|	ДанныеПоПриборамИтог.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ДанныеПоПриборамИтог.ВидДифференцированности КАК ВидДифференцированности,
	|	ДанныеПоПриборамИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ДанныеПоПриборамИтог.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеПоПриборамИтог.Поставщик КАК Поставщик,
	|	ДанныеПоПриборамИтог.НомерПломбы КАК НомерПломбы,
	|	ДанныеПоПриборамИтог.ДатаПоверки КАК ДатаПоверки,
	|	ДанныеПоПриборамИтог.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВнешниеПриборыДляСвязи.IDСтроки КАК IDСтроки,
	|	ВнешниеПриборыДляСвязи.ПриборУчета КАК НомерПрибораУчетаБыло,
	|	ВнешниеПриборыДляСвязи.ТарифнаяЗона КАК ТарифнаяЗонаФайла,
	|	ВнешниеПриборыДляСвязи.Показания КАК ТекущиеПоказанияФайла,
	|	АбонентыПомещений.Абонент КАК Абонент
	|ИЗ
	|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешниеПриборыДляСвязи КАК ВнешниеПриборыДляСвязи
	|		ПО ДанныеПоПриборамИтог.ЗаводскойНомер = ВнешниеПриборыДляСвязи.ПриборУчета
	|			И ДанныеПоПриборамИтог.ТарифнаяЗона = ВнешниеПриборыДляСвязи.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ АбонентыПомещений КАК АбонентыПомещений
	|		ПО ДанныеПоПриборамИтог.Организация = АбонентыПомещений.Организация
	|			И ДанныеПоПриборамИтог.Район = АбонентыПомещений.Район
	|			И ДанныеПоПриборамИтог.КлючПомещения = АбонентыПомещений.КлючПомещения
	|			И ДанныеПоПриборамИтог.Услуга = АбонентыПомещений.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	КлючПомещения,
	|	ТочкаУчета,
	|	ПриборУчета,
	|	Шкала");	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"			, Период);
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("ТаблицаДанных"	, ТаблицаДанных);
	
	//МВТ = Новый МенеджерВременныхТаблиц;
	Возврат энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса);			
КонецФункции

Процедура ДобавитьТекстЗапросаТаблицаВнешнихДанных(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ТаблицаДанных.IDСтроки КАК IDСтроки,
		|	ТаблицаДанных.ПриборУчета КАК ПриборУчета,
		|	ТаблицаДанных.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаДанных.Показания КАК Показания
		|ПОМЕСТИТЬ ТаблицаДанныхФайла
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных");
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоСтрокПоПриборуИзВнешнихДанных(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ТаблицаДанныхФайла.ПриборУчета КАК НомерПрибораУчетаБыло,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаДанныхФайла.ТарифнаяЗона) КАК КоличествоСтрок
		|ПОМЕСТИТЬ КоличествоСтрокПоПриборуИзВнешнихДанных
		|ИЗ
		|	ТаблицаДанныхФайла КАК ТаблицаДанныхФайла
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДанныхФайла.ПриборУчета");
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоличествоСтрокПоПриборуИзВнутреннихДанных(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ДанныеПоПриборамИтог.ЗаводскойНомер КАК ЗаводскойНомер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПоПриборамИтог.ТарифнаяЗона) КАК КоличествоСтрок
		|ПОМЕСТИТЬ КоличествоСтрокПоПриборуИзВнутреннихДанных
		|ИЗ
		|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоПриборамИтог.ЗаводскойНомер");
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНеНайденныеПриборы(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ТаблицаДанныхФайла.IDСтроки КАК IDСтроки,
		|	ТаблицаДанныхФайла.ПриборУчета КАК НомерПрибораУчетаБыло,
		|	ТаблицаДанныхФайла.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаДанныхФайла.Показания КАК ТекущиеПоказания,
		|	""Не найден прибор учета"" КАК ОписаниеОшибки
		|ПОМЕСТИТЬ НеНайденныеПриборы
		|ИЗ
		|	ТаблицаДанныхФайла КАК ТаблицаДанныхФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоСтрокПоПриборуИзВнутреннихДанных КАК КоличествоСтрокПоПриборуИзВнутреннихДанных
		|		ПО ТаблицаДанныхФайла.ПриборУчета = КоличествоСтрокПоПриборуИзВнутреннихДанных.ЗаводскойНомер
		|ГДЕ
		|	КоличествоСтрокПоПриборуИзВнутреннихДанных.ЗаводскойНомер ЕСТЬ NULL");
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНесовпадениеТарифныхЗон(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДанныхФайла.IDСтроки КАК IDСтроки,
		|	ТаблицаДанныхФайла.ПриборУчета КАК НомерПрибораУчетаБыло,
		|	ТаблицаДанныхФайла.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаДанныхФайла.Показания КАК ТекущиеПоказания,
		|	""Не найдена тарифная зона"" КАК ОписаниеОшибки
		|ПОМЕСТИТЬ НеНайденныеТарифныеЗоны
		|ИЗ
		|	ТаблицаДанныхФайла КАК ТаблицаДанныхФайла
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоСтрокПоПриборуИзВнешнихДанных КАК КоличествоСтрокПоПриборуИзВнешнихДанных
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоСтрокПоПриборуИзВнутреннихДанных КАК КоличествоСтрокПоПриборуИзВнутреннихДанных
		|			ПО КоличествоСтрокПоПриборуИзВнешнихДанных.НомерПрибораУчетаБыло = КоличествоСтрокПоПриборуИзВнутреннихДанных.ЗаводскойНомер
		|				И НЕ КоличествоСтрокПоПриборуИзВнешнихДанных.КоличествоСтрок = КоличествоСтрокПоПриборуИзВнутреннихДанных.КоличествоСтрок
		|		ПО ТаблицаДанныхФайла.ПриборУчета = КоличествоСтрокПоПриборуИзВнешнихДанных.НомерПрибораУчетаБыло");
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборУчетаНаНесколькихПомещениях(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДанныеПоПриборамИтог.ЗаводскойНомер КАК ЗаводскойНомер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПоПриборамИтог.КлючПомещения) КАК КоличествоПомещений
	|ПОМЕСТИТЬ КоличествоПомещенийПоЗаводскомуНомеру
	|ИЗ
	|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
	|ГДЕ
	|	НЕ ДанныеПоПриборамИтог.ЗаводскойНомер В
	|				(ВЫБРАТЬ
	|					НеНайденныеПриборы.НомерПрибораУчетаБыло КАК НомерПрибораУчетаБыло
	|				ИЗ
	|					НеНайденныеПриборы КАК НеНайденныеПриборы)
	|	И НЕ ДанныеПоПриборамИтог.ЗаводскойНомер В
	|				(ВЫБРАТЬ
	|					НеНайденныеТарифныеЗоны.НомерПрибораУчетаБыло КАК НомерПрибораУчетаБыло
	|				ИЗ
	|					НеНайденныеТарифныеЗоны КАК НеНайденныеТарифныеЗоны)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоПриборамИтог.ЗаводскойНомер
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПоПриборамИтог.КлючПомещения) > 1");

	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДанныхФайла.IDСтроки КАК IDСтроки,
	|	ТаблицаДанныхФайла.ПриборУчета КАК НомерПрибораУчетаБыло,
	|	ТаблицаДанныхФайла.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаДанныхФайла.Показания КАК ТекущиеПоказания,
	|	""Не найдена тарифная зона"" КАК ОписаниеОшибки
	|ПОМЕСТИТЬ ПриборыУчетаНаНесколькихПомещениях
	|ИЗ
	|	КоличествоПомещенийПоЗаводскомуНомеру КАК КоличествоПомещенийПоЗаводскомуНомеру
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхФайла КАК ТаблицаДанныхФайла
	|		ПО КоличествоПомещенийПоЗаводскомуНомеру.ЗаводскойНомер = ТаблицаДанныхФайла.ПриборУчета");
КонецПроцедуры

Процедура ДобавитьТекстЗапросаОбъединенияНенайденныхДанных(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.IDСтроки КАК IDСтроки,
		|	ВложенныйЗапрос.НомерПрибораУчетаБыло КАК НомерПрибораУчетаБыло,
		|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ВложенныйЗапрос.ТекущиеПоказания КАК ТекущиеПоказания,
		|	ВложенныйЗапрос.ОписаниеОшибки КАК ОписаниеОшибки
		|ПОМЕСТИТЬ НеНайденныеДанныеИзВнешнихДанных
		|ИЗ
		|	(ВЫБРАТЬ
		|		НеНайденныеПриборы.IDСтроки КАК IDСтроки,
		|		НеНайденныеПриборы.НомерПрибораУчетаБыло КАК НомерПрибораУчетаБыло,
		|		НеНайденныеПриборы.ТарифнаяЗона КАК ТарифнаяЗона,
		|		НеНайденныеПриборы.ТекущиеПоказания КАК ТекущиеПоказания,
		|		НеНайденныеПриборы.ОписаниеОшибки КАК ОписаниеОшибки
		|	ИЗ
		|		НеНайденныеПриборы КАК НеНайденныеПриборы
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НеНайденныеТарифныеЗоны.IDСтроки,
		|		НеНайденныеТарифныеЗоны.НомерПрибораУчетаБыло,
		|		НеНайденныеТарифныеЗоны.ТарифнаяЗона,
		|		НеНайденныеТарифныеЗоны.ТекущиеПоказания,
		|		НеНайденныеТарифныеЗоны.ОписаниеОшибки
		|	ИЗ
		|		НеНайденныеТарифныеЗоны КАК НеНайденныеТарифныеЗоны
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПриборыУчетаНаНесколькихПомещениях.IDСтроки,
		|		ПриборыУчетаНаНесколькихПомещениях.НомерПрибораУчетаБыло,
		|		ПриборыУчетаНаНесколькихПомещениях.ТарифнаяЗона,
		|		ПриборыУчетаНаНесколькихПомещениях.ТекущиеПоказания,
		|		ПриборыУчетаНаНесколькихПомещениях.ОписаниеОшибки
		|	ИЗ
		|		ПриборыУчетаНаНесколькихПомещениях КАК ПриборыУчетаНаНесколькихПомещениях) КАК ВложенныйЗапрос"); 	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборыИзВнешнихДанныхДляСвязи(Схема)
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	ТаблицаДанныхФайла.IDСтроки КАК IDСтроки,
		|	ТаблицаДанныхФайла.ПриборУчета КАК ПриборУчета,
		|	ТаблицаДанныхФайла.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ТаблицаДанныхФайла.Показания КАК Показания
		|ПОМЕСТИТЬ ВнешниеПриборыДляСвязи
		|ИЗ
		|	ТаблицаДанныхФайла КАК ТаблицаДанныхФайла
		|ГДЕ
		|	НЕ ТаблицаДанныхФайла.ПриборУчета В
		|				(ВЫБРАТЬ
		|					НеНайденныеДанныеИзВнешнихДанных.НомерПрибораУчетаБыло КАК НомерПрибораУчетаБыло
		|				ИЗ
		|					НеНайденныеДанныеИзВнешнихДанных КАК НеНайденныеДанныеИзВнешнихДанных)");
КонецПроцедуры


Функция НайтиСвязанныеДокументы(ДокументОснование) Экспорт
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргОбходнойЛист.Ссылка КАК Ссылка,
		|	энргОбходнойЛист.Район КАК Район
		|ИЗ
		|	Документ.энргОбходнойЛист КАК энргОбходнойЛист
		|ГДЕ
		|	энргОбходнойЛист.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование.Ссылка);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Район, Выборка.Ссылка.ПолучитьОбъект());
	КонецЦикла;
	
	Возврат Результат;		
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДесериализацияДанных

Функция ДесериализоватьФайл(АдресВХ) Экспорт 
	ДвоичныеДанные 	= ПолучитьИзВременногоХранилища(АдресВХ); 	
	тПуть 			= ПолучитьИмяВременногоФайла("xml"); 
	ДвоичныеДанные.Записать(тПуть);
	
	Парсер = Новый ЧтениеXML;
	Парсер.ОткрытьФайл(тПуть);
	
	Построитель 	= Новый ПостроительDOM; 
	Документик 		= Построитель.Прочитать(Парсер); 	
	ТаблицаДанных 	= НоваяТаблицаДесериализированныхДанных();
	
	Сутки 	= Справочники.энргТарифныеЗоны.БезРазбивки;
	День 	= Справочники.энргТарифныеЗоны.День;
	Ночь 	= Справочники.энргТарифныеЗоны.Ночь;
	
	ИндексСтроки = -1;
	
	СписокЗаводскихНомеров = Документик.ПервыйДочерний.ПервыйДочерний.ДочерниеУзлы;
	Для Каждого ЭлементСекции из СписокЗаводскихНомеров Цикл
		Если ЭлементСекции.ИмяУзла = "element" и ЭлементСекции.Атрибуты.ПолучитьИменованныйЭлемент("measuringtype").Значение = "0" Тогда
			
			СекцияЗаводскойНомерПУ 	= ЭлементСекции.Атрибуты.ПолучитьИменованныйЭлемент("serial");
			
			ЗаводскойНомер			= СекцияЗаводскойНомерПУ.Значение;
			ИдентификаторСтроки		= "" + Новый УникальныйИдентификатор;
			СписокТарифныхЗон 		= СекцияЗаводскойНомерПУ.ЭлементВладелец.ДочерниеУзлы;
			
			КоличествоЗон = 0;
			Для Каждого ЭлементСекцииТарифныхЗон из СписокТарифныхЗон Цикл
				ВспомогательныеПараметры = Новый Структура("IDСтроки, ПриборУчета, ТарифнаяЗона", ИдентификаторСтроки, ЗаводскойНомер);
				АтрибутCode = ЭлементСекцииТарифныхЗон.Атрибуты.ПолучитьИменованныйЭлемент("code");
				
				Если АтрибутCode.Значение = "2021" Тогда
					// День/Сутки
					
					СписокПоказаний = АтрибутCode.ЭлементВладелец.ДочерниеУзлы;
					ВспомогательныеПараметры.ТарифнаяЗона = Сутки;
					ДобавитьСтрокуВТаблицуДанных(СписокПоказаний, ТаблицаДанных, ИндексСтроки, КоличествоЗон, ВспомогательныеПараметры);					
				ИначеЕсли  АтрибутCode.Значение = "2022" Тогда
					// Ночь					
					
					СписокПоказаний = АтрибутCode.ЭлементВладелец.ДочерниеУзлы;
					ВспомогательныеПараметры.ТарифнаяЗона = Ночь;
					ДобавитьСтрокуВТаблицуДанных(СписокПоказаний, ТаблицаДанных, ИндексСтроки, КоличествоЗон, ВспомогательныеПараметры);					
					
				Иначе
					Продолжить;					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если КоличествоЗон = 2 Тогда				
				
				// Если есть ночь, то прибор двухтарфиный и в первой строке надо заменить тарифную зону с суток на день				
				СтрокаСуток = ТаблицаДанных[ИндексСтроки - 1];
				Если СтрокаСуток.ТарифнаяЗона = Ночь Тогда 					 
					СтрокаСуток = ТаблицаДанных[ИндексСтроки];					
				КонецЕсли;
				СтрокаСуток.ТарифнаяЗона = День;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Парсер.Закрыть();
	
	Возврат ТаблицаДанных;	 	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуДанных(СписокПоказаний, ТаблицаДанных, ИндексСтроки, КоличествоЗон, ВспомогательныеПараметры)
	
	КоличествоСтрок = СписокПоказаний.Количество();
	Если КоличествоСтрок = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПоследняяСтрокаПоказаний = СписокПоказаний[КоличествоСтрок - 1];
		
	НСтрока = ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НСтрока, ВспомогательныеПараметры);	
	НСтрока.Показания = ПоследняяСтрокаПоказаний.ТекстовоеСодержимое;	
	
	ИндексСтроки 	= ИндексСтроки + 1;
	КоличествоЗон 	= КоличествоЗон + 1;
	
КонецПроцедуры

#КонецОбласти

Функция НоваяТаблицаДесериализированныхДанных() Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("IDСтроки"			, ОбщегоНазначения.ОписаниеТипаСтрока(36));
	Таблица.Колонки.Добавить("ТарифнаяЗона"		, Новый ОписаниеТипов("СправочникСсылка.энргТарифныеЗоны"));
	Таблица.Колонки.Добавить("ПриборУчета"		, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("Показания"		, ОбщегоНазначения.ОписаниеТипаЧисло(15, 6));	
	Таблица.Колонки.Добавить("СтрокаЗаписана"	, Новый ОписаниеТипов("Булево"));	
	
	Возврат Таблица;
КонецФункции

Функция ФильтрФайлов() Экспорт
	Возврат "xml|*.xml";
КонецФункции

Функция ИмяСобытияЗагрузки() Экспорт 
	Возврат энргИнтеграцияСПирамидой.ИмяСобытияЗагрузки();
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли