#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДанныеФормы(Параметры);
	Если Параметры.Свойство("ТекПриборУчетаОбъем") Тогда
		Если Параметры.ТекПриборУчетаОбъем Тогда
			Элементы.Показания.Заголовок = "Объем";	
		Иначе
			Элементы.Показания.Заголовок = "Показания";
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ДанныеВозврата = Новый Структура("Дата, ИсточникПоказаний, Показание", ДатаВводаПоказаний, ИсточникПоказаний, Показание); 
	Закрыть(ДанныеВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(Параметры)
	ДатаВводаПоказаний 	= ?(Параметры.Свойство("ДатаВводаПоказаний"), Параметры.ДатаВводаПоказаний	, ТекущаяДата());
	ИсточникПоказаний 	= ?(Параметры.Свойство("ИсточникПоказаний")	, Параметры.ИсточникПоказаний	, Справочники.энргИсточникиПоказаний.Касса);
КонецПроцедуры  

#КонецОбласти