#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойсва массив приборов.
//
Процедура МассивПриборов() Экспорт 
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ВыводПрибораУчета",	?(ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС,Истина,ложь));
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
	|				И Шапка.ДатаФактическогоСобытия <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
	|	КОНЕЦ КАК СостояниеПроведения
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|		ПО ТаблицаТочкиУчета.Ссылка = Шапка.Ссылка
	|			И (НЕ ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|ГДЕ
	|	ТаблицаТочкиУчета.Ссылка = &Ссылка" ;
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецПроцедуры

// Получает абонентов плательщиков.
// 
// Возвращаемое значение:
//   Массив из Структура.
//
Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ДатаФактическогоСобытия) Тогда
		Возврат МассивПлательщиков;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",		Ссылка);
	Запрос.УстановитьПараметр("ДатаФакта",	ДатаФактическогоСобытия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетом.Ссылка КАК Ссылка,
	|	энргОперацияСЛицевымСчетом.ВидОперации КАК ВидОперации,
	|	энргОперацияСЛицевымСчетом.Абонент КАК Абонент
	|ПОМЕСТИТЬ ШапкаДокумента
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
	|ГДЕ
	|	энргОперацияСЛицевымСчетом.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПриборов.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТУ
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаПриборов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	|		ПО ТаблицаПриборов.Ссылка = ШапкаДокумента.Ссылка
	|			И (ТаблицаПриборов.Ссылка = &Ссылка)
	|			И (ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтабильныеПериоды.Плательщик КАК Плательщик,
	|	энргАбоненты.КлючПомещения КАК КлючПомещения
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТУ КАК ВТ_ТУ
	|		ПО энргСтабильныеПериоды.ТочкаУчета = ВТ_ТУ.ТочкаУчета
	|			И (энргСтабильныеПериоды.Плательщик <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка))
	|			И (энргСтабильныеПериоды.ПериодНачисления >= &ДатаФакта)
	|			И (энргСтабильныеПериоды.Абонент <> энргСтабильныеПериоды.Плательщик)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргСтабильныеПериоды.Плательщик = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСтабильныеПериоды.Плательщик,
	|	энргАбоненты.КлючПомещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик,
	|	энргАбоненты.КлючПомещения
	|ИЗ
	|	Документ.энргОперацияСЛицевымСчетом.ПоставщикиСоставныхУслуг КАК энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	|		ПО энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка = ШапкаДокумента.Ссылка
	|			И (энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Ссылка = &Ссылка)
	|			И (ШапкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|			И (энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик <> ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка))
	|			И энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик <> ШапкаДокумента.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|		ПО энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргОперацияСЛицевымСчетомПоставщикиСоставныхУслуг.Плательщик,
	|	энргАбоненты.КлючПомещения";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		МассивПлательщиков.Добавить(Новый Структура("Абонент,КлючПомещения", Результат.Плательщик, Результат.КлючПомещения));
	КонецЦикла;
	
	Возврат МассивПлательщиков;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);
	Если ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС тогда
		УдалитьФизЛицо 			= Справочники.ФизическиеЛица.ПустаяСсылка();
		Абонент 				= Справочники.энргАбоненты.ПустаяСсылка();
		ЛицевойСчет 			= "";
		Жильцы.Очистить();
		Для Каждого стр из ТочкиУчета цикл
			стр.ТочкаУчета	 	= Справочники.энргТочкиУчета.ПустаяСсылка();
			стр.ПриборУчета 	= Справочники.энргПриборыУчетаАбонента.ПустаяСсылка();		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТочкиУчета.ТочкаУчета");
		
		ПроверяемыеРеквизиты.добавить("ФизЛицо");
		ПроверяемыеРеквизиты.добавить("АдресОбъекта");
		ПроверяемыеРеквизиты.добавить("ЗначениеПлощадей");
		ПроверяемыеРеквизиты.добавить("ГруппаАбонента");
		ПроверяемыеРеквизиты.добавить("Контроллер");
		ПроверяемыеРеквизиты.добавить("МаршрутКонтроллера");
		ПроверяемыеРеквизиты.добавить("ПоставщикиСоставныхУслуг.Поставщик"); 
		ПроверяемыеРеквизиты.добавить("ТочкиУчета.НаправлениеИспользованияТУ");
		ПроверяемыеРеквизиты.добавить("ТочкиУчета.СтруктураСети");
		
		ИндексыСтрок 	= СтрокиПустойПоставщик();
		Отказ 			= ИндексыСтрок.Количество() > 0;
		Для Сч = 0 По ИндексыСтрок.ВГраница() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена колонка ""Поставщик"" в строке " +ИндексыСтрок[Сч] +" списка ""Услуги""",,"ТочкиУчета["+ ИндексыСтрок[Сч]+"].Поставщик",ЭтотОбъект);
		КонецЦикла;	
		
		ПроверкаЗаполненияСНТ(Отказ);
	КонецЕсли;
	
	Если ДолеваяСобственность И (ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС Или
		ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника) Тогда
		Для Сч = 0 По Жильцы.Количество()-1 Цикл
			ТекСтрока = Жильцы[Сч];
			
			Если Не ТекСтрока.Собственник Тогда 
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ДоляСобственностиЧислитель) Тогда
				Отказ = Истина;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена колонка ""Числитель"" в строке " +(Сч+1) +" списка ""Жильцы""",,"Жильцы["+ Сч +"].ДоляСобственностиЧислитель",ЭтотОбъект);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ДоляСобственностиЗнаменатель) Тогда
				Отказ = Истина;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена колонка ""Знаменатель"" в строке " +(Сч+1) +" списка ""Жильцы""",,"Жильцы["+ Сч +"].ДоляСобственностиЗнаменатель",ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС тогда
		
		ПроверяемыеРеквизиты.добавить("Абонент");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	энргОперацияСЛицевымСчетом.Дата КАК Дата
		|ИЗ
		|	Документ.энргОперацияСЛицевымСчетом КАК энргОперацияСЛицевымСчетом
		|ГДЕ
		|	энргОперацияСЛицевымСчетом.Проведен
		|	И энргОперацияСЛицевымСчетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС)
		|	И энргОперацияСЛицевымСчетом.Абонент = &Абонент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Абонент",ЭтотОбъект.Абонент);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ДатаФактическогоСобытия) Тогда
			ДатаЗакрытияЛС = Мин(ЭтотОбъект.Дата,ЭтотОбъект.ДатаФактическогоСобытия);
		Иначе	
			ДатаЗакрытияЛС = ЭтотОбъект.Дата;
		КонецЕсли;
		
		Если Результат.Следующий() Тогда
			
			Если ДатаЗакрытияЛС < Результат.Дата Тогда
				
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия не может быть меньше даты открытия лицевого счета.");
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника Тогда
		СообщениеПользователю = "Документ 'Смена собственника' не может быть проведён без точки учета!"; 
		
		Если ТочкиУчета.Количество() = 0 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
		Иначе
			Для Сч = 0 По ТочкиУчета.Количество()-1 Цикл
				ТекСтрока = ТочкиУчета[Сч];
				
				Если Не ЗначениеЗаполнено(ТекСтрока.ТочкаУчета) Тогда
					Отказ = Истина;	
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		ПроверкаЗаполненияСНТ(Отказ);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ПроверятьНезаполненныеПоказания = ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника И энргРаботаСКонстантами.ЗначениеКонстантыЗапретитьПроведениеДокументовБезПоказаний();
	
	Если ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС Или ПроверятьНезаполненныеПоказания Тогда			
		Если ТекущиеПоказанияНеЗаполнены() Тогда
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС И Не ДополнительныеСвойства.Свойство("НеПроверятьТочкиСОРП") Тогда
		
		Если Документы.энргОперацияСЛицевымСчетом.ЕстьТочкиСОРП(Дата, Организация, Район, КлючПомещения) Тогда
			Отказ = Истина;
			Комментарий = НСтр("ru = 'У Абонента введено ОРП, проведение данного документа невозможно. Создайте документ ВРП'");
			ОбщегоНазначения.СообщитьПользователю(Комментарий);
			ВызватьИсключение Комментарий;
		КонецЕсли;
		
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаСервер.УстановитьНаправлениеИспользованияТочекУчетаПоУмолчанию(ТочкиУчета);
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
	Если НЕ ДополнительныеСвойства.Свойство("НеЗаполнятьДанныеПоПотерям") тогда
		энргРаботаСТочкамиУчетаСервер.ОчиститьДанныеПоПотерям(Потери);
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеПоПотерям(Потери);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	
	Документы.энргОперацияСЛицевымСчетом.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);	
	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	Документы.энргОперацияСЛицевымСчетом.ИнициализироватьТаблицыДляКонтроля(Ссылка, ДополнительныеСвойства);
	энргПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокиПустойПоставщик()
	
	Текст  = 
	"ВЫБРАТЬ
	|	энргВидыУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргВидыУслуг КАК энргВидыУслуг
	|ГДЕ
	|	энргВидыУслуг.Ссылка В(&Услуги)
	|	И НЕ энргВидыУслуг.СоставнаяУслуга";
	
	Запрос  		= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Услуги", ТочкиУчета.ВыгрузитьКолонку("Услуга"));
	
	Результат  		= Запрос.Выполнить();
	Выборка  		= Результат.Выбрать();
	ИндексыСтрок 	= Новый Массив;
	Пока Выборка.Следующий() Цикл
		Строки 		= ТочкиУчета.НайтиСтроки(Новый Структура("Услуга,Поставщик", Выборка.Ссылка, Справочники.энргКонтрагенты.ПустаяСсылка()));
		Для Каждого СтрокаУслуги Из Строки Цикл
			ИндексыСтрок.Добавить(СтрокаУслуги.НомерСтроки);
		КонецЦикла;		
	КонецЦикла;
	
	Возврат ИндексыСтрок;
КонецФункции

Функция ТекущиеПоказанияНеЗаполнены()
	
	ПоказанияНеЗаполнены 					= Ложь;	
	ИндексСтрокиТочкиУчета 					= 1;
	
	мПриборыУчета 							= ТочкиУчета.ВыгрузитьКолонку("ПриборУчета");
	ЗначенияРеквизитовПриборовУчета			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета,"РегистрируетОбъем");
	
	Для Каждого СтрокаТочки Из ТочкиУчета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначенияРеквизитовПриборовУчета[СтрокаТочки.ПриборУчета] = Неопределено И ЗначенияРеквизитовПриборовУчета[СтрокаТочки.ПриборУчета].РегистрируетОбъем Тогда
			Продолжить;
		КонецЕсли;
		СтрокиШкал 							= ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", СтрокаТочки.IDСтроки));
		Для ИндексШкалы = 0 По СтрокиШкал.ВГраница() Цикл
			СтрокиПоказаний 				= ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокиШкал[ИндексШкалы].IDСтроки));
			Для ИндексПоказаний = 0 По СтрокиПоказаний.ВГраница() Цикл				
				Если НЕ СтрокиПоказаний[ИндексПоказаний].ПоказанияПредоставлены Тогда
					ПоказанияНеЗаполнены	= Истина;				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не предоставлены показания для прибора учета в строке " +(ИндексСтрокиТочкиУчета));						
				ИначеЕсли СтрокиПоказаний[ИндексПоказаний].СостояниеПоказаний = Перечисления.энргСостояниеПоказаний.Отклонены Тогда
					ПоказанияНеЗаполнены	= Истина;		
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отклонены показания для прибора учета в строке " +(ИндексСтрокиТочкиУчета));						
				КонецЕсли;					
			КонецЦикла;				
		КонецЦикла;
		ИндексСтрокиТочкиУчета 				= ИндексСтрокиТочкиУчета + 1;
	КонецЦикла;				
	
	Возврат ПоказанияНеЗаполнены;
КонецФункции

Процедура ПроверкаЗаполненияСНТ(Отказ)
	Если ЗначениеЗаполнено(СНТДНТПотребление) 
		И Не ЗначениеЗаполнено(ТочкаПоставкиЮЛПотребление) Тогда 
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Параметр ""Точка поставки ЮЛ (потребление)"" не заполнен. 
		|Если объемы Абонента не должны вычитаться из объемов ЮЛ, то параметр ""СНТ/ДНТ (потребление)"" не должен быть заполнен.");
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли