#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Задает расширенные настройки отчетов конфигурации.
//
// Параметры:
//	 Настройки - ТаблицаЗначений - коллекция предопределенных вариантов отчетов
//	 НастройкиОтчета - Структура
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДокументыНачисленийЮЛ");
	НастройкиВарианта.Описание = НСтр("ru = 'Документы начислений ЮЛ'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДокументыНачисленийЮЛДетальный");
	НастройкиВарианта.Описание = НСтр("ru = 'Документы начислений ЮЛ (детальный)'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДляРабочегоСтолаЮЛ");
	НастройкиВарианта.Описание = НСтр("ru = 'Для рабочего стола ЮЛ'");
	НастройкиВарианта.Включен = Ложь;
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтчетПоПДДляРабочегоСтола(ПоляДоговора) Экспорт
	СхемаКД = Отчеты.бестАнализПлатежныхДокументовЭЭ.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроекДанныхОтчета = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекДанныхОтчета.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));
	КомпоновщикНастроекДанныхОтчета.ЗагрузитьНастройки(СхемаКД.ВариантыНастроек.Найти("ДляРабочегоСтолаЮЛ").Настройки);
	ПараметрПериодаНачисления = Новый ПараметрКомпоновкиДанных("ПериодНачисления");
	ПараметрОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	ПараметрРайон = Новый ПараметрКомпоновкиДанных("Район");
	ПолеДоговор = Новый ПолеКомпоновкиДанных("Договор");
	ПолеТипПД = Новый ПолеКомпоновкиДанных("ПлатежныйДокументТипЗадолженности");
	ТипПД = Неопределено;
	ИспользоватьОтборПоТипуПД = ПоляДоговора.Свойство("ТипПД", ТипПД);
	Для каждого ОтборКД Из КомпоновщикНастроекДанныхОтчета.Настройки.Отбор.Элементы Цикл
		Если ОтборКД.ЛевоеЗначение = ПолеДоговор Тогда
			ОтборКД.ПравоеЗначение = ПоляДоговора.Договор;
			ОтборКД.Использование = Истина;
		КонецЕсли;
		Если ОтборКД.ЛевоеЗначение = ПолеТипПД И ИспользоватьОтборПоТипуПД Тогда
			ОтборКД.ПравоеЗначение = ТипПД;
			ОтборКД.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ПараметрНастроекКД Из КомпоновщикНастроекДанныхОтчета.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ПараметрНастроекКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			Если ПараметрНастроекКД.Параметр = ПараметрПериодаНачисления Тогда
				ПараметрНастроекКД.Значение.ДатаНачала = ПоляДоговора.ДатаНачала;
				ПараметрНастроекКД.Значение.ДатаОкончания = ПоляДоговора.ДатаОкончания;
			КонецЕсли;
			Если ПараметрНастроекКД.Параметр = ПараметрОрганизация Тогда
				ПараметрНастроекКД.Значение = ПоляДоговора.Организация;
				ПараметрНастроекКД.Использование = Истина;
			КонецЕсли;
			Если ПараметрНастроекКД.Параметр = ПараметрРайон Тогда
				ПараметрНастроекКД.Значение = ПоляДоговора.Район;
				ПараметрНастроекКД.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКД, КомпоновщикНастроекДанныхОтчета.ПолучитьНастройки(), ДанныеРасшифровкиКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровкиКомпоновки);
	
	ТабДок = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Новый Структура("ТабДок, ДанныеРасшифровкиКомпоновки, НастройкиКД", 
								ТабДок, ДанныеРасшифровкиКомпоновки, КомпоновщикНастроекДанныхОтчета.ПолучитьНастройки());
	
КонецФункции

#КонецОбласти

#КонецЕсли