#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет данные среза.
//
// Параметры:
//  Схема					-	СхемаЗапроса.
//  ПараметрыОтбора			-	Структура.
//  ТаблицаДляПомещения		-	Строка.
//
Процедура ПроцентВетхостиСтроения(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "")  Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПроцентаВетхостиСтроения());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ЧастныйСектор, Строение";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет процент ветхости строения коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПроцентВетхостиСтроенияКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "")  Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПроцентВетхостиСтроенияКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ЧастныйСектор, Строение";
		ИмяТаблицы 					= "ПроцентВетхостиСтроения";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ТекстыЗапросов

// Получает текст запроса процента ветхости строения.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаПроцентаВетхостиСтроения() Экспорт 
	
	Текст  =
	"ВЫБРАТЬ
	|	энргПроцентВетхостиСтроенияСрезПоследних.Организация КАК Организация,
	|	энргПроцентВетхостиСтроенияСрезПоследних.Район КАК Район,
	|	энргПроцентВетхостиСтроенияСрезПоследних.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПроцентВетхостиСтроенияСрезПоследних.Строение КАК Строение,
	|	энргПроцентВетхостиСтроенияСрезПоследних.Процент КАК Процент
	|ИЗ
	|	РегистрСведений.энргПроцентВетхостиСтроения.СрезПоследних КАК энргПроцентВетхостиСтроенияСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса процент ветхости строения коллекция периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаПроцентВетхостиСтроенияКоллекцияПериодов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ПроцентВетхостиСтроения.Процент КАК Процент
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ПроцентВетхостиСтроения.Организация КАК Организация,
	|		ПроцентВетхостиСтроения.Район КАК Район,
	|		ПроцентВетхостиСтроения.ЧастныйСектор КАК ЧастныйСектор,
	|		ПроцентВетхостиСтроения.Строение КАК Строение,
	|		МАКСИМУМ(ПроцентВетхостиСтроения.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргПроцентВетхостиСтроения КАК ПроцентВетхостиСтроения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ПроцентВетхостиСтроения.Организация = ТаблицаПериодов.Организация
	|				И ПроцентВетхостиСтроения.Район = ТаблицаПериодов.Район
	|				И ПроцентВетхостиСтроения.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ПроцентВетхостиСтроения.Организация,
	|		ПроцентВетхостиСтроения.Район,
	|		ПроцентВетхостиСтроения.ЧастныйСектор,
	|		ПроцентВетхостиСтроения.Строение) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПроцентВетхостиСтроения КАК ПроцентВетхостиСтроения
	|		ПО ВложенныйЗапрос.Организация = ПроцентВетхостиСтроения.Организация
	|			И ВложенныйЗапрос.Район = ПроцентВетхостиСтроения.Район
	|			И ВложенныйЗапрос.ЧастныйСектор = ПроцентВетхостиСтроения.ЧастныйСектор
	|			И ВложенныйЗапрос.Строение = ПроцентВетхостиСтроения.Строение
	|			И ВложенныйЗапрос.Период = ПроцентВетхостиСтроения.Период"; 
	
	Возврат Текст;
	
 
	
	Возврат Текст;

	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли