#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	ЭтоСрокПогашенияЗадолженности = Объект.Ссылка = ПредопределенноеЗначение("ПланВидовХарактеристик.бестПараметрыТиповСобытий.СрокПогашенияЗадолженности");
	ЭтоПланируемаяДатаВведенияОРП = Объект.Ссылка = ПредопределенноеЗначение("ПланВидовХарактеристик.бестПараметрыТиповСобытий.ПланируемаяДатаВведенияОРП");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокДляОтправкиЗаказнойПочтой"	, "Видимость", ЭтоСрокПогашенияЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокДляВрученияПодРоспись"		, "Видимость", ЭтоСрокПогашенияЗадолженности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокОтКрайнейДатыПогашенияДолга", "Видимость", ЭтоПланируемаяДатаВведенияОРП);
КонецПроцедуры


