#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуДатыПоступленияОплатАбонента(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДатаПоследнейПоступившейОплаты());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения; 
	ОтборСхемы 					= Пакет.Операторы[0].Отбор;
	Если ПараметрыСхемы.Свойство("Период") Тогда
		ПараметрСхемы 			= ПараметрыСхемы["Период"];
		ОтборСхемы.Добавить(СтрШаблон("ОплатаУслуг.Период <= %1", ПараметрСхемы.ИмяПараметра));
	КонецЕсли;
	
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПоляОтбора 	= "Организация,Район,МКД,Абонент,Период";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОтборСхемы, "ОплатаУслуг", ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;
					
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДатаПоследнейПоступившейОплаты()
	
	Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатаУслуг.Период КАК Период,
	|	ОплатаУслуг.Абонент КАК Абонент
	|ИЗ
	|	РегистрНакопления.энргОплатаУслуг КАК ОплатаУслуг";
		
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли