#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор 			= Новый Структура("ЛьготнаяКатегория", ПараметрКоманды);	
	ПараметрыФормы 	= Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.энргЗначенияЛьготныхКатегорий.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти