
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Набор = РегистрыСведений.энргНастройкиЗагрузкиОплаты.СоздатьНаборЗаписей();
	Набор.отбор.Источник.установить(Объект.Ссылка);
	Набор.прочитать();	
	Если Набор.количество() > 0 тогда
		ОбработкаЗагрузки = Набор[0].ОбработкаЗагрузки;
	КонецЕсли;		 	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Набор 				= РегистрыСведений.энргНастройкиЗагрузкиОплаты.СоздатьНаборЗаписей();
	Набор.отбор.Источник.установить(Объект.Ссылка);
	
	Если Не ЗначениеЗаполнено(ОбработкаЗагрузки) тогда
		Набор.Записать();
		Возврат;
	КонецЕсли;   	
	
	Набор.прочитать();	
	Если Набор.количество() > 0 тогда
		СтрокаНабора 				= Набор[0];
	иначе
		СтрокаНабора  				= Набор.Добавить();
		СтрокаНабора.Источник 		= Объект.Ссылка;
	КонецЕсли;	
	СтрокаНабора.ОбработкаЗагрузки 	= ОбработкаЗагрузки; 	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти