#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Для каждого стр из ПриборыЗависимыеОтУзлаУчета Цикл
		    Движение = Движения.бестЗависимостьУзловИПриборовУчета.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Ссылка);
			ЗаполнитьЗначенияСвойств(Движение, стр);
			Движение.Период 				= Дата;
			Движение.ОбъектРасчетаГоловной 	= ОбъектРасчета;
			Движение.ТочкаУчетаГоловная 	= ТочкаУчета;
			Движение.ПриборУчетаГоловной 	= ПриборУчета;
			Движение.МКД					= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(стр.ОбъектРасчета, "МКД");
		КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли