#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПараметрыОперации.ПериодНачисления = ПериодНачисления;
	ДокументОбъект.ПараметрыОперации.Организация = Организация;
	ДокументОбъект.ПараметрыОперации.Район = Район;
	Если Строения.Количество() > 0 Тогда
		ДокументОбъект.ПараметрыОперации.Строения = Строения;
	КонецЕсли;
	ДокументОбъект.ПараметрыОперации.Абонент = Абонент;
	//ДокументОбъект.ПараметрыОперации.Диапазон = Диапазон;	
	
	ДокументОбъект.ВыполнитьОперацию();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

#КонецОбласти