
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВзысканиеГПРезультат = ПолучитьИзВременногоХранилища(Параметры.ВзысканиеГП);
	ВзысканиеГП.Загрузить(ВзысканиеГПРезультат);
КонецПроцедуры

#Конецобласти 

#Область КомандыФормы

&НаКлиенте
Процедура Завершить(Команда)
	Закрыть(ПолучитьРезультат());
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат()
	Возврат Новый Структура("ВзысканиеГП",ПоместитьВоВременноеХранилище(ВзысканиеГП.Выгрузить(), ЭтаФорма.УникальныйИдентификатор));
КонецФункции

#Конецобласти 
