#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета 				= КоллекцияПечатныхФорм[0].ИмяМакета;
	СинонимМакета 			= КоллекцияПечатныхФорм[0].СинонимМакета;
	
	Если ИмяМакета = "ПФ_MXL_СчетФактураНаРеализацию" Тогда
		ТабличныйДокумент 		= СформироватьСчетФактураНаРеализацию(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_АктПриемаПередачи" Тогда
		ТабличныйДокумент 		= СформироватьАктПриемаПередачи(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_АктПриемаПередачиПоЭЭ" Тогда
		ТабличныйДокумент 		= СформироватьАктПриемаПередачиПоЭЭ(ИмяМакета, ПараметрыПечати);	
	ИначеЕсли ИмяМакета = "ПФ_MXL_СоглашениеНаКорректировку" Тогда
		ТабличныйДокумент 		= СформироватьСоглашениеНаКорректировку(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_ПерерасчетЭлектроэнергии" Тогда
		ТабличныйДокумент 		= СформироватьАктПерерасчета(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_СчетНаОстаток" Тогда
		ТабличныйДокумент 		= СформироватьСчетНаОстаток(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_СчетНаОплатуПост" Тогда
		ТабличныйДокумент 		= СформироватьСчетНаОплатуПост(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_СчетНаОплатуПред" Тогда
		ТабличныйДокумент 		= СформироватьСчетНаОплатуПред(ИмяМакета, ПараметрыПечати);	
	ИначеЕсли ИмяМакета = "ПФ_MXL_КорректировочнаяСчетФактура" Тогда
		ТабличныйДокумент 		= СформироватьКорректировочнуюСФ(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_ИсправительнаяСчетФактура" Тогда
		ТабличныйДокумент 		= СформироватьИсправительнуюСФ(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_АктСверки" Тогда
		ТабличныйДокумент 		= СформироватьАктСверки(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_СчетНаОплатуЗаПросрочкуПлатежа" Тогда
		ТабличныйДокумент 		= СформироватьСчетНаОплатуЗаПросрочкуПлатежа(ИмяМакета, ПараметрыПечати);
	ИначеЕсли ИмяМакета = "ПФ_MXL_СчетНаПредварительнуюОплатуЭЭ" Тогда
		ТабличныйДокумент 		= СформироватьСчетНаПредварительнуюОплатуЭЭ(ИмяМакета, ПараметрыПечати);
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета, СинонимМакета,
		ТабличныйДокумент, ,
		"Документ.бестПлатежныйДокумент." + ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры

Функция ВернутьКартинкуОбъекта(ОбъектСКартинкой, РеквизитОбъекта) Экспорт
	ДвоичныеДанныеФайла 			      = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСКартинкой, РеквизитОбъекта).Получить();
	Если ЗначениеЗаполнено(ДвоичныеДанныеФайла) И ТипЗнч(ДвоичныеДанныеФайла) = Тип("ДвоичныеДанные") Тогда
		Картинка                          = Новый Картинка(ДвоичныеДанныеФайла, Истина);
	Иначе
		Картинка                          = Новый Картинка();
	КонецЕсли;
	Возврат Картинка;
КонецФункции

 // Заполняет табличную часть ОсновнаяРеализация документа при корректировке
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект.бестПлатежныйДокумент, ДанныеФормыСтруктура - Документ бестПлатежныйДокумент
//
Процедура ЗаполнитьДанныеКорректировки(ДокументОбъект) Экспорт
	
	ДокументОбъект.ОсновнаяРеализация.Очистить();
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) Тогда
		Документы.бестПерерасчетЭЭ.ЗаполнитьДанныеКорректировки(ДокументОбъект.Договор,
			ДокументОбъект.ДокументОснование,
			ДокументОбъект.ОсновнаяРеализация,
			ДокументОбъект.ДокументИсточник);
			
	ИначеЕсли Не ДокументОбъект.ДокументИсточник.Пустая() Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
		               |	бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета КАК ТочкаУчета,
		               |	бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Услуга,
		               |	бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги КАК ОбъемУслуги,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная КАК СуммаСредневзвешенная,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку КАК СуммаЗаСбытовуюНадбавку,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи КАК СуммаЗаУслугиПоПередачи,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги КАК СуммаЗаИныеУслуги,
		               |	бестПлатежныйДокументОсновнаяРеализация.Сумма КАК Сумма,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешеннаяНДС КАК СуммаСредневзвешеннаяНДС,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавкуНДС КАК СуммаЗаСбытовуюНадбавкуНДС,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачиНДС КАК СуммаЗаУслугиПоПередачиНДС,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслугиНДС КАК СуммаЗаИныеУслугиНДС,
		               |	бестПлатежныйДокументОсновнаяРеализация.СуммаНДС КАК СуммаНДС,
		               |	бестПлатежныйДокументОсновнаяРеализация.ТарифНаИныеУслуги КАК ТарифНаИныеУслуги,
		               |	бестПлатежныйДокументОсновнаяРеализация.ТарифЗаСбытовуюНадбавку КАК ТарифЗаСбытовуюНадбавку,
		               |	бестПлатежныйДокументОсновнаяРеализация.ТарифЗаУслугиПоПередачи КАК ТарифЗаУслугиПоПередачи,
		               |	бестПлатежныйДокументОсновнаяРеализация.ТарифНаСредневзвешанную КАК ТарифНаСредневзвешанную,
		               |	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК Тариф,
		               |	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
		               |	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления КАК СпособНачисления,
		               |	бестПлатежныйДокументОсновнаяРеализация.НДСВнутри КАК НДСВнутри
		               |ИЗ
		               |	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
		               |ГДЕ
		               |	бестПлатежныйДокументОсновнаяРеализация.Ссылка = &Ссылка
		               |	И НЕ бестПлатежныйДокументОсновнаяРеализация.ИсходныеДанные";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.ДокументИсточник);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаРеализации = ДокументОбъект.ОсновнаяРеализация.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРеализации, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.свойство("Основание") Тогда
		СтандартнаяОбработка 	= Ложь;
		ВыбраннаяФорма = "ФормаДокументаРасчетный";
		Возврат;
	КонецЕсли;
	
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗаполнения тогда
		ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;	
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПлатежныйДокумент",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПлатежныйДокумент",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестПлатежныйДокумент",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		Иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестПлатежныйДокумент");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СчетФактураНаРеализацию

Функция ПолучитьЗапросСчетФактураНаРеализацию() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета КАК ТочкаУчета,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		КОНЕЦ) КАК СуммаСНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Услуга,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) КАК ОбъемУслуги,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный КАК Ответственный,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления КАК СпособНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК ЗначениеТарифа
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета,
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления,
	|	бестПлатежныйДокумент.Ответственный,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф
	|
	|ИМЕЮЩИЕ
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.Дата КАК ДатаПД,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.Тариф КАК Тариф,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ОбъемУслуги КАК ОбъемУслуги,
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргЕдиницыИзмерения.Ссылка КАК ЕдИзм,
	|	энргЕдиницыИзмерения.КодПоОКЕИ КАК КодОКЕИ,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	ДанныеДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеДокумента.СпособНачисления КАК СпособНачисления,
	|	ДанныеДокумента.ЗначениеТарифа КАК ЗначениеТарифа,
	|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеДокумента.Район = энргЗоныОтвественности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЕдиницыИзмерения КАК энргЕдиницыИзмерения
	|		ПО ДанныеДокумента.Услуга.ЕдиницаИзмерения = энргЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				(Организация, Район, ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						ДанныеДокумента.Организация,
	|						ДанныеДокумента.Район,
	|						ДанныеДокумента.ОбъектРасчета,
	|						ДанныеДокумента.ТочкаУчета
	|					ИЗ
	|						ДанныеДокумента КАК ДанныеДокумента)) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ДанныеДокумента.Организация = бестЦеновыеКатегорииТочекУчетаСрезПоследних.Организация
	|			И ДанныеДокумента.Район = бестЦеновыеКатегорииТочекУчетаСрезПоследних.Район
	|			И ДанныеДокумента.ОбъектРасчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ДанныеДокумента.ТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерПД КАК НомерПД,
	|	Итог.ДатаПД КАК ДатаПД,
	|	Итог.ИННОрг КАК ИННОрг,
	|	Итог.КППОрг КАК КППОрг,
	|	Итог.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	|	Итог.ФактическийАдресОрг КАК ФактическийАдресОрг,
	|	Итог.ЮридическийАдресОрг КАК ЮридическийАдресОрг,
	|	Итог.ФактическийАдресКонтрагента КАК ФактическийАдресКонтрагента,
	|	Итог.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.КодРайона КАК КодРайона,
	|	Итог.ИННКон КАК ИННКон,
	|	Итог.КППКон КАК КППКон,
	|	Итог.ОтветственныйТелефон КАК ОтветственныйТелефон,
	|	Итог.ОтветственныйПочта КАК ОтветственныйПочта,
	|	Итог.Ответственный КАК Ответственный,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	Итог.ЗначениеТарифа КАК ЗначениеТарифа
	|ИЗ
	|	Итог КАК Итог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	Итог.Тариф КАК Тариф,
	|	Итог.СтавкаНДС КАК СтавкаНДС,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ОбъемУслуги КАК ОбъемУслуги,
	|	Итог.ЕдИзм КАК ЕдИзм,
	|	Итог.КодОКЕИ КАК КодОКЕИ,
	|	Итог.СуммаБезНДС КАК СуммаБезНДС,
	|	Итог.ПериодНачисления КАК ГодМесяц,
	|	Итог.СпособНачисления КАК СпособНачисления,
	|	энргВидыУслуг.ИспользоватьРасчетРеактивнойЭнергии КАК ИспользоватьРасчетРеактивнойЭнергии,
	|	энргВидыУслуг.Наименование КАК Наименование,
	|	Итог.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ПРЕДСТАВЛЕНИЕ(Итог.Услуга) КАК УслугаПредставление,
	|	Итог.ЦеноваяКатегория КАК ЦеноваяКатегория
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Итог.Услуга = энргВидыУслуг.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование УБЫВ
	|ИТОГИ
	|	СУММА(СуммаСНДС),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Итог.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(Итог.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Итог.ОбъемУслуги) КАК ОбъемУслуги,
	|	Итог.ЕдИзм КАК ЕдИзм,
	|	Итог.КодОКЕИ КАК КодОКЕИ,
	|	СУММА(Итог.СуммаБезНДС) КАК СуммаБезНДС
	|ИЗ
	|	Итог КАК Итог
	|
	|СГРУППИРОВАТЬ ПО
	|	Итог.ЕдИзм,
	|	Итог.КодОКЕИ";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьСчетФактуруНаРеализацию(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка 			= РезультатЗапроса[2].Выбрать();
	ВыборкаОбъектРасчета 	= РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогПоЕдИзм 		= РезультатЗапроса[4].Выбрать();
	ЭлектронноеВзаимодействие = Неопределено;
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ТабДок.Вывести(ОбластьШапка);
		ЭлектронноеВзаимодействие = ВыборкаШапка.ЭлектронноеВзаимодействие;
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
	КонецЕсли;	
	
	Пока ВыборкаОбъектРасчета.Следующий() Цикл
		ОбластьОбъектРасчета = Макет.ПолучитьОбласть("ОбъектРасчета");
		ОбластьОбъектРасчета.Параметры.ОбъектРасчета = ВыборкаОбъектРасчета.ОбъектРасчета;
		ТабДок.Вывести(ОбластьОбъектРасчета);
		НомерСтроки = 1;
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектРасчета.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
			ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры,ВыборкаДетальныеЗаписи);
			
			//Если ВыборкаДетальныеЗаписи.ИспользоватьРасчетРеактивнойЭнергии Тогда
			//	ОбластьДанныеЗадолженности.Параметры.ТекстНаименованиеТовара = "Надбавка за потребление Реактивной энергии"
			//	//+ ПолучитьСклоненияСтроки(Строка(ВыборкаДетальныеЗаписи.Услуга),, "Творительный");
			//Иначе
			//	ОбластьДанныеЗадолженности.Параметры.ТекстНаименованиеТовара = "Потребленная" + Строка(ВыборкаДетальныеЗаписи.Услуга) + " по нерегулируемым ценам по приборам учета";
			//КонецЕсли;
			
			
			Если ВыборкаДетальныеЗаписи.ИспользоватьРасчетРеактивнойЭнергии Тогда	
				ОбластьДанныеЗадолженности.Параметры.ТекстНаименованиеТовара = "Надбавка за потребление Реактивной энергии"
			Иначе
				Если ВыборкаДетальныеЗаписи.УслугаПредставление = "Электроэнергия" И ВыборкаДетальныеЗаписи.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.Население Тогда
					ОбластьДанныеЗадолженности.Параметры.ТекстНаименованиеТовара = "Электроэнергия, отпущенная населению по приборам учета";	
				Иначе
					ОбластьДанныеЗадолженности.Параметры.ТекстНаименованиеТовара = "Потребленная " + ВыборкаДетальныеЗаписи.УслугаПредставление + " по нерегулируемым ценам по приборам учета";				
				КонецЕсли;
			КонецЕсли;
			
			ОбластьДанныеЗадолженности.Параметры.ГодМесяц = Формат(ВыборкаДетальныеЗаписи.ГодМесяц, "ДФ=yyyy.MM");
			ОбластьДанныеЗадолженности.Параметры.Номер = НомерСтроки;
			
			ТабДок.Вывести(ОбластьДанныеЗадолженности);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		ОбластьИтогПоОбъектуРасчета = Макет.ПолучитьОбласть("ИтогПоОбъектуРасчета");
		ЗаполнитьЗначенияСвойств(ОбластьИтогПоОбъектуРасчета.Параметры,ВыборкаОбъектРасчета);
		ТабДок.Вывести(ОбластьИтогПоОбъектуРасчета);
		
	КонецЦикла;
	
	СуммаБезНДС = 0;
	СуммаНДС 	= 0;
	СуммаСНДС 	= 0;
	
	Пока ВыборкаИтогПоЕдИзм.Следующий() Цикл
		ОбластьИтогиПоЕдИзм = Макет.ПолучитьОбласть("ИтогиПоЕдИзм");
		ЗаполнитьЗначенияСвойств(ОбластьИтогиПоЕдИзм.Параметры,ВыборкаИтогПоЕдИзм);
		ТабДок.Вывести(ОбластьИтогиПоЕдИзм);
		
		СуммаБезНДС = СуммаБезНДС + ВыборкаИтогПоЕдИзм.СуммаБезНДС;
		СуммаНДС 	= СуммаНДС + ВыборкаИтогПоЕдИзм.СуммаНДС;
		СуммаСНДС 	= СуммаСНДС + ВыборкаИтогПоЕдИзм.СуммаСНДС;
	КонецЦикла;
	
	ОбластьОбщиеИтоги = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьОбщиеИтоги.Параметры.СуммаБезНДС = СуммаБезНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаНДС = СуммаНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаСНДС = СуммаСНДС;
	ТабДок.Вывести(ОбластьОбщиеИтоги);	
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры     

#КонецОбласти

#Область ИсправительнаяСчетФактура

Функция ПолучитьЗапросИсправительнаяСчетФактура() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		КОНЕЦ) КАК СуммаСНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.Тариф) КАК Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Услуга,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) КАК ОбъемУслуги,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|			ТОГДА ""Потребленная электроэнергия по нерегулируемым ценам""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория В (ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК), ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
	|			ТОГДА ""Мощность оплачиваемая на розничном рынке""
	|		ИНАЧЕ ""Мощность оплачиваемая в части услуг по передаче""
	|	КОНЕЦ КАК УслугаТекст,
	|	бестПлатежныйДокумент1.НомерПД КАК НомерПДИсточник,
	|	бестПлатежныйДокумент1.Дата КАК ДатаИсточник
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент1
	|			ПО бестПлатежныйДокумент.ДокументИсточник = бестПлатежныйДокумент1.Ссылка
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный,
	|	ВЫБОР
	|		КОГДА НЕ энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|			ТОГДА ""Потребленная электроэнергия по нерегулируемым ценам""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория В (ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК), ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
	|			ТОГДА ""Мощность оплачиваемая на розничном рынке""
	|		ИНАЧЕ ""Мощность оплачиваемая в части услуг по передаче""
	|	КОНЕЦ,
	|	бестПлатежныйДокумент1.НомерПД,
	|	бестПлатежныйДокумент1.Дата,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.Дата КАК ДатаПД,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.Тариф КАК Тариф,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ОбъемУслуги КАК ОбъемУслуги,
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргЕдиницыИзмерения.Ссылка КАК ЕдИзм,
	|	энргЕдиницыИзмерения.КодПоОКЕИ КАК КодОКЕИ,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	ДанныеДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеДокумента.УслугаТекст КАК УслугаТекст,
	|	ДанныеДокумента.НомерПДИсточник КАК НомерПДИсточник,
	|	ДанныеДокумента.ДатаИсточник КАК ДатаИсточник
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеДокумента.Район = энргЗоныОтвественности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЕдиницыИзмерения КАК энргЕдиницыИзмерения
	|		ПО ДанныеДокумента.Услуга.ЕдиницаИзмерения = энргЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерПД КАК НомерПД,
	|	Итог.ДатаПД КАК ДатаПД,
	|	Итог.ИННОрг КАК ИННОрг,
	|	Итог.КППОрг КАК КППОрг,
	|	Итог.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	|	Итог.ФактическийАдресОрг КАК ФактическийАдресОрг,
	|	Итог.ЮридическийАдресОрг КАК ЮридическийАдресОрг,
	|	Итог.ФактическийАдресКонтрагента КАК ФактическийАдресКонтрагента,
	|	Итог.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.КодРайона КАК КодРайона,
	|	Итог.ИННКон КАК ИННКон,
	|	Итог.КППКон КАК КППКон,
	|	Итог.ОтветственныйТелефон КАК ОтветственныйТелефон,
	|	Итог.ОтветственныйПочта КАК ОтветственныйПочта,
	|	Итог.Ответственный КАК Ответственный,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	Итог.НомерПДИсточник КАК НомерПДИсточник,
	|	Итог.ДатаИсточник КАК ДатаПДИсточник
	|ИЗ
	|	Итог КАК Итог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ОбъектРасчета КАК ОбъектРасчета,
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	Итог.Тариф КАК Тариф,
	|	Итог.СтавкаНДС КАК СтавкаНДС,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ОбъемУслуги КАК ОбъемУслуги,
	|	Итог.ЕдИзм КАК ЕдИзм,
	|	Итог.КодОКЕИ КАК КодОКЕИ,
	|	Итог.СуммаБезНДС КАК СуммаБезНДС,
	|	Итог.ПериодНачисления КАК ГодМесяц,
	|	Итог.УслугаТекст КАК УслугаТекст
	|ИЗ
	|	Итог КАК Итог
	|ИТОГИ
	|	СУММА(СуммаСНДС),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ЕдИзм КАК ЕдИзм,
	|	Итог.КодОКЕИ КАК КодОКЕИ,
	|	СУММА(Итог.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(Итог.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Итог.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(Итог.ОбъемУслуги) КАК ОбъемУслуги
	|ИЗ
	|	Итог КАК Итог
	|
	|СГРУППИРОВАТЬ ПО
	|	Итог.ЕдИзм,
	|	Итог.КодОКЕИ";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьИсправительнуюСчетФактуру(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка 			= РезультатЗапроса[2].Выбрать();
	ВыборкаОбъектРасчета 	= РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогПоЕдИзм 		= РезультатЗапроса[4].Выбрать();
	ЭлектронноеВзаимодействие = Неопределено;
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаПДИсточник 	= Формат(ВыборкаШапка.ДатаПДИсточник, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ТабДок.Вывести(ОбластьШапка);
		ЭлектронноеВзаимодействие = ВыборкаШапка.ЭлектронноеВзаимодействие;
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
	КонецЕсли;
	
	
	Пока ВыборкаОбъектРасчета.Следующий() Цикл
		ОбластьОбъектРасчета = Макет.ПолучитьОбласть("ОбъектРасчета");
		ОбластьОбъектРасчета.Параметры.ОбъектРасчета = ВыборкаОбъектРасчета.ОбъектРасчета;
		ТабДок.Вывести(ОбластьОбъектРасчета);
		НомерСтроки = 1;
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектРасчета.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
			ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры,ВыборкаДетальныеЗаписи);
			ОбластьДанныеЗадолженности.Параметры.ГодМесяц 						= Формат(ВыборкаДетальныеЗаписи.ГодМесяц, "ДФ=yyyy.MM");
						
			ТабДок.Вывести(ОбластьДанныеЗадолженности);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		ОбластьИтогПоОбъектуРасчета = Макет.ПолучитьОбласть("ИтогПоОбъектуРасчета");
		ЗаполнитьЗначенияСвойств(ОбластьИтогПоОбъектуРасчета.Параметры,ВыборкаОбъектРасчета);
		ТабДок.Вывести(ОбластьИтогПоОбъектуРасчета);
		
	КонецЦикла;
	
	СуммаБезНДС = 0;
	СуммаНДС 	= 0;
	СуммаСНДС 	= 0;
	
	Пока ВыборкаИтогПоЕдИзм.Следующий() Цикл
		ОбластьИтогиПоЕдИзм = Макет.ПолучитьОбласть("ИтогиПоЕдИзм");
		ЗаполнитьЗначенияСвойств(ОбластьИтогиПоЕдИзм.Параметры,ВыборкаИтогПоЕдИзм);
		ТабДок.Вывести(ОбластьИтогиПоЕдИзм);
		
		СуммаБезНДС = СуммаБезНДС + ВыборкаИтогПоЕдИзм.СуммаБезНДС;
		СуммаНДС 	= СуммаНДС + ВыборкаИтогПоЕдИзм.СуммаНДС;
		СуммаСНДС 	= СуммаСНДС + ВыборкаИтогПоЕдИзм.СуммаСНДС;
	КонецЦикла;
	
	ОбластьОбщиеИтоги = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьОбщиеИтоги.Параметры.СуммаБезНДС = СуммаБезНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаНДС = СуммаНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаСНДС = СуммаСНДС;
	ТабДок.Вывести(ОбластьОбщиеИтоги);	
	
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры     
	
#КонецОбласти

#Область КорректировочнаяСчетФактура

Функция ПолучитьЗапросКорректировочнаяСчетФактура() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный КАК Ответственный,
	|	бестПлатежныйДокумент1.НомерПД КАК НомерПДИсточник,
	|	бестПлатежныйДокумент1.Дата КАК ДатаИсточник,
	|	бестПлатежныйДокумент.ДокументИсточник КАК ДокументИсточник,
	|	бестПлатежныйДокумент.Ссылка КАК ПД
	|ПОМЕСТИТЬ ДанныеШапки
	|ИЗ
	|	Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент1
	|		ПО бестПлатежныйДокумент.ДокументИсточник = бестПлатежныйДокумент1.Ссылка,
	|	Справочник.энргВидыУслуг КАК энргВидыУслуг
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный,
	|	бестПлатежныйДокумент1.НомерПД,
	|	бестПлатежныйДокумент1.Дата,
	|	бестПлатежныйДокумент.ДокументИсточник,
	|	бестПлатежныйДокумент.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеШапки.Организация КАК Организация,
	|	ДанныеШапки.НомерПД КАК НомерПД,
	|	ДанныеШапки.Дата КАК ДатаПД,
	|	ДанныеШапки.Район КАК Район,
	|	ДанныеШапки.Договор КАК Договор,
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	ДанныеШапки.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	ДанныеШапки.Ответственный КАК Ответственный,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеШапки.НомерПДИсточник КАК НомерПДИсточник,
	|	ДанныеШапки.ДатаИсточник КАК ДатаИсточник
	|ПОМЕСТИТЬ ИтогШапка
	|ИЗ
	|	ДанныеШапки КАК ДанныеШапки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеШапки.Район = энргЗоныОтвественности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеШапки.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеШапки.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеШапки.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеШапки.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеШапки.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеШапки.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|	КОНЕЦ КАК СуммаСНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.СуммаНДС КАК СуммаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Услуга,
	|	ДанныеШапки.ПериодНачисления КАК ГодМесяц,
	|	0 КАК СуммаСНДСИсх,
	|	0 КАК СуммаНДСИсх,
	|	0 КАК ТарифИсх,
	|	0 КАК СуммаБезНДСИсх,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги КАК ОбъемУслуги,
	|	0 КАК ОбъемУслугиИсх,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Справочник.энргВидыУслуг).бестИспользоватьРасчетПоМощности
	|			ТОГДА ""Потребленная электроэнергия по нерегулируемым ценам""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория В (ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК), ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
	|			ТОГДА ""Мощность оплачиваемая на розничном рынке""
	|		ИНАЧЕ ""Мощность оплачиваемая в части услуг по передаче""
	|	КОНЕЦ КАК УслугаТекст
	|ПОМЕСТИТЬ ДанныеТЧ
	|ИЗ
	|	ДанныеШапки КАК ДанныеШапки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|					&Период,
	|					Организация = &Организация
	|						И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|			ПО бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|				И бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|		ПО ДанныеШапки.ПД = бестПлатежныйДокументОсновнаяРеализация.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета,
	|	0,
	|	0,
	|	0,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	0,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга,
	|	ДанныеШапки.ПериодНачисления,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|	КОНЕЦ,
	|	бестПлатежныйДокументОсновнаяРеализация.СуммаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|	КОНЕЦ,
	|	0,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Справочник.энргВидыУслуг).бестИспользоватьРасчетПоМощности
	|			ТОГДА ""Потребленная электроэнергия по нерегулируемым ценам""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория В (ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК), ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК))
	|			ТОГДА ""Мощность оплачиваемая на розничном рынке""
	|		ИНАЧЕ ""Мощность оплачиваемая в части услуг по передаче""
	|	КОНЕЦ
	|ИЗ
	|	ДанныеШапки КАК ДанныеШапки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|					&Период,
	|					Организация = &Организация
	|						И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|			ПО бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|				И бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|		ПО ДанныеШапки.ДокументИсточник = бестПлатежныйДокументОсновнаяРеализация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТЧ.ОбъектРасчета КАК ОбъектРасчета,
	|	СУММА(ДанныеТЧ.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ДанныеТЧ.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(ДанныеТЧ.Тариф) КАК Тариф,
	|	МАКСИМУМ(ДанныеТЧ.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(ДанныеТЧ.СуммаБезНДС) КАК СуммаБезНДС,
	|	ДанныеТЧ.Услуга КАК Услуга,
	|	ДанныеТЧ.ГодМесяц КАК ГодМесяц,
	|	СУММА(ДанныеТЧ.СуммаСНДСИсх) КАК СуммаСНДСИсх,
	|	СУММА(ДанныеТЧ.СуммаНДСИсх) КАК СуммаНДСИсх,
	|	МАКСИМУМ(ДанныеТЧ.ТарифИсх) КАК ТарифИсх,
	|	СУММА(ДанныеТЧ.СуммаБезНДСИсх) КАК СуммаБезНДСИсх,
	|	энргЕдиницыИзмерения.Представление КАК ЕдИзм,
	|	энргЕдиницыИзмерения.КодПоОКЕИ КАК КодОКЕИ,
	|	СУММА(ДанныеТЧ.ОбъемУслуги) КАК ОбъемУслуги,
	|	СУММА(ДанныеТЧ.ОбъемУслугиИсх) КАК ОбъемУслугиИсх,
	|	ДанныеТЧ.УслугаТекст КАК УслугаТекст
	|ПОМЕСТИТЬ ДанныеПоТЧГруппировка
	|ИЗ
	|	ДанныеТЧ КАК ДанныеТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЕдиницыИзмерения КАК энргЕдиницыИзмерения
	|			ПО энргВидыУслуг.ЕдиницаИзмерения = энргЕдиницыИзмерения.Ссылка
	|		ПО ДанныеТЧ.Услуга = энргВидыУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеТЧ.ОбъектРасчета,
	|	ДанныеТЧ.Услуга,
	|	ДанныеТЧ.ГодМесяц,
	|	энргЕдиницыИзмерения.Представление,
	|	энргЕдиницыИзмерения.КодПоОКЕИ,
	|	ДанныеТЧ.УслугаТекст
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоТЧГруппировка.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеПоТЧГруппировка.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеПоТЧГруппировка.СуммаНДС КАК СуммаНДС,
	|	ДанныеПоТЧГруппировка.Тариф КАК Тариф,
	|	ДанныеПоТЧГруппировка.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеПоТЧГруппировка.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеПоТЧГруппировка.Услуга КАК Услуга,
	|	ДанныеПоТЧГруппировка.ГодМесяц КАК ГодМесяц,
	|	ДанныеПоТЧГруппировка.СуммаСНДСИсх КАК СуммаСНДСИсх,
	|	ДанныеПоТЧГруппировка.СуммаНДСИсх КАК СуммаНДСИсх,
	|	ДанныеПоТЧГруппировка.ТарифИсх КАК ТарифИсх,
	|	ДанныеПоТЧГруппировка.СуммаБезНДСИсх КАК СуммаБезНДСИсх,
	|	ДанныеПоТЧГруппировка.ЕдИзм КАК ЕдИзм,
	|	ДанныеПоТЧГруппировка.КодОКЕИ КАК КодОКЕИ,
	|	ДанныеПоТЧГруппировка.СуммаСНДС - ДанныеПоТЧГруппировка.СуммаСНДСИсх КАК СуммаСНДСРазница,
	|	ДанныеПоТЧГруппировка.СуммаНДС - ДанныеПоТЧГруппировка.СуммаНДСИсх КАК СуммаНДСРазница,
	|	ДанныеПоТЧГруппировка.СуммаБезНДС - ДанныеПоТЧГруппировка.СуммаБезНДСИсх КАК СуммаБезНДСРазница,
	|	ДанныеПоТЧГруппировка.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеПоТЧГруппировка.ОбъемУслугиИсх КАК ОбъемУслугиИсх,
	|	ДанныеПоТЧГруппировка.УслугаТекст КАК УслугаТекст
	|ПОМЕСТИТЬ ИтогоПоТЧ
	|ИЗ
	|	ДанныеПоТЧГруппировка КАК ДанныеПоТЧГруппировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог2.НомерПД КАК НомерПД,
	|	Итог2.ДатаПД КАК ДатаПД,
	|	Итог2.ИННОрг КАК ИННОрг,
	|	Итог2.КППОрг КАК КППОрг,
	|	Итог2.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	|	Итог2.ФактическийАдресОрг КАК ФактическийАдресОрг,
	|	Итог2.ЮридическийАдресОрг КАК ЮридическийАдресОрг,
	|	Итог2.ФактическийАдресКонтрагента КАК ФактическийАдресКонтрагента,
	|	Итог2.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	Итог2.Контрагент КАК Контрагент,
	|	Итог2.НомерДоговора КАК НомерДоговора,
	|	Итог2.ДатаДоговора КАК ДатаДоговора,
	|	Итог2.КодРайона КАК КодРайона,
	|	Итог2.ИННКон КАК ИННКон,
	|	Итог2.КППКон КАК КППКон,
	|	Итог2.ОтветственныйТелефон КАК ОтветственныйТелефон,
	|	Итог2.ОтветственныйПочта КАК ОтветственныйПочта,
	|	Итог2.Ответственный КАК Ответственный,
	|	Итог2.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	Итог2.НомерПДИсточник КАК НомерПДИсточник,
	|	Итог2.ДатаИсточник КАК ДатаПДИсточник
	|ИЗ
	|	ИтогШапка КАК Итог2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогоПоТЧ.ОбъектРасчета КАК ОбъектРасчета,
	|	ИтогоПоТЧ.СуммаСНДС КАК СуммаСНДСБ,
	|	ИтогоПоТЧ.СуммаНДС КАК СуммаНДСБ,
	|	ИтогоПоТЧ.Тариф КАК ТарифА,
	|	ИтогоПоТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ИтогоПоТЧ.Услуга КАК Услуга,
	|	ИтогоПоТЧ.ОбъемУслуги КАК ОбъемУслугиБ,
	|	ИтогоПоТЧ.ЕдИзм КАК ЕдИзм,
	|	ИтогоПоТЧ.КодОКЕИ КАК КодОКЕИ,
	|	ИтогоПоТЧ.СуммаБезНДС КАК СуммаБезНДСБ,
	|	ИтогоПоТЧ.ГодМесяц КАК ГодМесяц,
	|	ИтогоПоТЧ.СуммаБезНДСИсх КАК СуммаБезНДСА,
	|	ВЫБОР
	|		КОГДА ИтогоПоТЧ.СуммаСНДСРазница > 0
	|			ТОГДА ИтогоПоТЧ.СуммаСНДСРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСНДСВ,
	|	ВЫБОР
	|		КОГДА ИтогоПоТЧ.СуммаНДСРазница > 0
	|			ТОГДА ИтогоПоТЧ.СуммаНДСРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДСВ,
	|	ВЫБОР
	|		КОГДА ИтогоПоТЧ.СуммаБезНДСРазница > 0
	|			ТОГДА ИтогоПоТЧ.СуммаБезНДСРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБезНДСВ,
	|	ИтогоПоТЧ.СуммаСНДСИсх КАК СуммаСНДСА,
	|	ИтогоПоТЧ.СуммаНДСИсх КАК СуммаНДСА,
	|	ИтогоПоТЧ.ТарифИсх КАК ТарифБ,
	|	ИтогоПоТЧ.УслугаТекст КАК УслугаТекст,
	|	ВЫБОР
	|		КОГДА ИтогоПоТЧ.СуммаСНДСРазница < 0
	|			ТОГДА -ИтогоПоТЧ.СуммаСНДСРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСНДСГ,
	|	ВЫБОР
	|		КОГДА ИтогоПоТЧ.СуммаНДСРазница < 0
	|			ТОГДА -ИтогоПоТЧ.СуммаНДСРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДСГ,
	|	ВЫБОР
	|		КОГДА ИтогоПоТЧ.СуммаБезНДСРазница < 0
	|			ТОГДА -ИтогоПоТЧ.СуммаБезНДСРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБезНДСГ,
	|	ИтогоПоТЧ.ОбъемУслугиИсх КАК ОбъемУслугиА
	|ИЗ
	|	ИтогоПоТЧ КАК ИтогоПоТЧ
	|ИТОГИ
	|	СУММА(СуммаСНДСБ),
	|	СУММА(СуммаНДСБ),
	|	СУММА(СуммаБезНДСБ),
	|	СУММА(СуммаБезНДСА),
	|	СУММА(СуммаСНДСВ),
	|	СУММА(СуммаНДСВ),
	|	СУММА(СуммаБезНДСВ),
	|	СУММА(СуммаСНДСА),
	|	СУММА(СуммаНДСА),
	|	СУММА(СуммаСНДСГ),
	|	СУММА(СуммаНДСГ),
	|	СУММА(СуммаБезНДСГ)
	|ПО
	|	ОБЩИЕ,
	|	ОбъектРасчета";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьКорректировочнуюСчетФактуру(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	КоличествоПакетов		= РезультатЗапроса.Количество();

	ВыборкаШапка 			= РезультатЗапроса[КоличествоПакетов - 2].Выбрать();
	ВыборкаОбщийИтог 		= РезультатЗапроса[КоличествоПакетов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭлектронноеВзаимодействие = Неопределено;
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД 			= Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаПДИсточник 	= Формат(ВыборкаШапка.ДатаПДИсточник, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора 	= Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ТабДок.Вывести(ОбластьШапка);
		ЭлектронноеВзаимодействие = ВыборкаШапка.ЭлектронноеВзаимодействие;
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
	КонецЕсли;
	
	ВыборкаОбщийИтог.Следующий();

	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаОбщийИтог);
	
	ВыборкаОбъектРасчета = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектРасчета.Следующий() Цикл
		ОбластьОбъектРасчета = Макет.ПолучитьОбласть("ОбъектРасчета");
		ОбластьОбъектРасчета.Параметры.ОбъектРасчета = ВыборкаОбъектРасчета.ОбъектРасчета;
		ТабДок.Вывести(ОбластьОбъектРасчета);
		НомерСтроки = 1;
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектРасчета.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДанные = Макет.ПолучитьОбласть("Данные");
			ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры,ВыборкаДетальныеЗаписи);
			ОбластьДанные.Параметры.ГодМесяц = Формат(ВыборкаДетальныеЗаписи.ГодМесяц, "ДФ=yyyy.MM");
			ОбластьДанные.Параметры.Номер = НомерСтроки;
			
			ТабДок.Вывести(ОбластьДанные);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры     

#КонецОбласти

#Область СоглашениеНаКорректировку

Функция ПолучитьЗапросСоглашениеНаКорректировку() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги) КАК СуммаСНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешеннаяНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавкуНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачиНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслугиНДС) КАК СуммаНДС,
	|	бестПлатежныйДокумент1.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент1
	|			ПО бестПлатежныйДокумент.ДокументИсточник = бестПлатежныйДокумент1.Ссылка
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|			И (НЕ бестПлатежныйДокументОсновнаяРеализация.ИсходныеДанные)
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета,
	|	бестПлатежныйДокумент1.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.Дата КАК ДатаПД,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	СУММА(ДанныеДокумента.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ДанныеДокумента.СуммаНДС) КАК СуммаНДС,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	СУММА(ДанныеДокумента.СуммаСНДС - ДанныеДокумента.СуммаНДС) КАК СуммаБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.НомерПД,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Район,
	|	ДанныеДокумента.Договор,
	|	энргДоговорыКонтрагентов.Номер,
	|	энргДоговорыКонтрагентов.Дата,
	|	ДанныеДокумента.ПериодНачисления,
	|	энргДоговорыКонтрагентов.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерПД КАК НомерПД,
	|	Итог.ДатаПД КАК ДатаПД,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.Организация КАК Организация,
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	Итог.СуммаБезНДС КАК СуммаБезНДС,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагентыДоверенности.Номер КАК НомерДоверенностиКонтактногоЛица,
	|	энргКонтрагентыДоверенности.Дата КАК ДатаДоверенностиКонтактногоЛица,
	|	СклоненияПредставленийОбъектов.РодительныйПадеж КАК КонтактноеЛицоРП,
	|	Итог.Договор КАК Договор
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестКонтактныеЛицаКонтрагентов КАК бестКонтактныеЛицаКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СклоненияПредставленийОбъектов КАК СклоненияПредставленийОбъектов
	|			ПО бестКонтактныеЛицаКонтрагентов.КонтактноеЛицо = СклоненияПредставленийОбъектов.Объект
	|		ПО Итог.Контрагент = бестКонтактныеЛицаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.Доверенности КАК энргКонтрагентыДоверенности
	|		ПО Итог.Контрагент = энргКонтрагентыДоверенности.Ссылка";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьСоглашениеНаКорректировку(ТабДок, Выборка, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьСоглашение = Макет.ПолучитьОбласть("Соглашение"); 	
	
	ЗаполнитьЗначенияСвойств(ОбластьСоглашение.Параметры, Выборка);
	ОбластьСоглашение.Параметры.ПериодНачисления 	= Формат(Выборка.ПериодНачисления, "ДЛФ=D");
	ОбластьСоглашение.Параметры.ДатаДоговора 		= Формат(Выборка.ДатаДоговора, "ДЛФ=D");
	ОбластьСоглашение.Параметры.ДатаПД 				= Формат(Выборка.ДатаПД, "ДЛФ=D");
	
	Если ЗначениеЗаполнено(Выборка.НомерДоверенностиКонтактногоЛица) И ЗначениеЗаполнено(Выборка.ДатаДоверенностиКонтактногоЛица) Тогда
		ОбластьСоглашение.Параметры.ДоверенностьКонтактногоЛица = ", действующего на основании доверенности №" + Выборка.НомерДоверенностиКонтактногоЛица + " от " + Формат(Выборка.ДатаДоверенностиКонтактногоЛица, "ДЛФ=D") + ",";
	Иначе
		ОбластьСоглашение.Параметры.ДоверенностьКонтактногоЛица = "";
	КонецЕсли;
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГарантирующийПоставщик Тогда
			РезультатСклонения = энргОбщегоНазначения.ПолучитьСклоненияОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Сотрудник, "ФизическоеЛицо"));
			ВыборкаСклонения = РезультатСклонения.Выбрать();
			Если ВыборкаСклонения.Следующий() Тогда
				ОбластьСоглашение.Параметры.ГарантирующийПоставщикФИОРП = ВыборкаСклонения.РодительныйПадеж;
			КонецЕсли;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьСоглашение.Параметры.ГарантирующийПоставщикДоверенность = " на основании доверенности дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьСоглашение.Параметры.ГарантирующийПоставщикДоверенность = "";	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьСоглашение); 	
	
КонецПроцедуры     

#КонецОбласти

#Область АктПерерасчета

Функция ПолучитьЗапросАктПерерасчета() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги) КАК СуммаСНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешеннаяНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавкуНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачиНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслугиНДС) КАК СуммаНДС,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) КАК ОбъемУслуги,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.ИсходныеДанные
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаСНДСОснования,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.ИсходныеДанные
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешеннаяНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавкуНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачиНДС + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслугиНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДСОснования,
	|	бестПлатежныйДокумент.ДокументИсточник.ПериодНачисления КАК ПериодНачисленияОснования
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.ДокументИсточник.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.Дата КАК ДатаПД,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	СУММА(ДанныеДокумента.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ДанныеДокумента.СуммаНДС) КАК СуммаНДС,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисленияКорректировки,
	|	энргКонтрагенты.НаименованиеПолное КАК КонтрагентПолноеНаименование,
	|	ДанныеДокумента.ПериодНачисленияОснования КАК ПериодНачисленияОснования,
	|	ДанныеДокумента.СуммаСНДС - ДанныеДокумента.СуммаСНДСОснования КАК РазницаСумма,
	|	ДанныеДокумента.СуммаНДС - ДанныеДокумента.СуммаНДСОснования КАК РазницаСуммаНДС,
	|	ДанныеДокумента.ОбъемУслуги КАК ОбъемКорректировки,
	|	энргКонтрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.НомерПД,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Район,
	|	ДанныеДокумента.Договор,
	|	энргДоговорыКонтрагентов.Номер,
	|	энргДоговорыКонтрагентов.Дата,
	|	ДанныеДокумента.ПериодНачисления,
	|	энргКонтрагенты.НаименованиеПолное,
	|	ДанныеДокумента.ПериодНачисленияОснования,
	|	ДанныеДокумента.ОбъемУслуги,
	|	энргКонтрагенты.Ссылка,
	|	ДанныеДокумента.СуммаНДС - ДанныеДокумента.СуммаНДСОснования,
	|	ДанныеДокумента.СуммаСНДС - ДанныеДокумента.СуммаСНДСОснования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерПД КАК НомерПД,
	|	Итог.ДатаПД КАК ДатаПД,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.Организация КАК Организация,
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	энргКонтрагентыДоверенности.Номер КАК НомерДоверенностиКонтактногоЛица,
	|	энргКонтрагентыДоверенности.Дата КАК ДатаДоверенностиКонтактногоЛица,
	|	СклоненияПредставленийОбъектов.РодительныйПадеж КАК КонтактноеЛицоРП,
	|	Итог.ПериодНачисленияКорректировки КАК ПериодНачисленияКорректировки,
	|	Итог.ПериодНачисленияОснования КАК ПериодНачисленияОснования,
	|	Итог.КонтрагентПолноеНаименование КАК КонтрагентПолноеНаименование,
	|	Итог.РазницаСумма КАК РазницаСумма,
	|	Итог.РазницаСуммаНДС КАК РазницаСуммаНДС,
	|	Итог.ОбъемКорректировки КАК ОбъемКорректировки,
	|	бестКонтактныеЛицаКонтрагентов.Наименование КАК КонтактноеЛицо,
	|	Итог.Договор КАК Договор
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестКонтактныеЛицаКонтрагентов КАК бестКонтактныеЛицаКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СклоненияПредставленийОбъектов КАК СклоненияПредставленийОбъектов
	|			ПО бестКонтактныеЛицаКонтрагентов.КонтактноеЛицо = СклоненияПредставленийОбъектов.Объект
	|		ПО Итог.Контрагент = бестКонтактныеЛицаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.Доверенности КАК энргКонтрагентыДоверенности
	|		ПО Итог.Контрагент = энргКонтрагентыДоверенности.Ссылка";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьАктПерерасчета(ТабДок, Выборка, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьАктПерерасчета = Макет.ПолучитьОбласть("АктПерерасчета");
	
	ЗаполнитьЗначенияСвойств(ОбластьАктПерерасчета.Параметры, Выборка);
	ОбластьАктПерерасчета.Параметры.ПериодНачисленияОснования 		= Формат(Выборка.ПериодНачисленияОснования, "ДФ='MMMM yyyy ''г.'''");
	ОбластьАктПерерасчета.Параметры.ПериодНачисленияКорректировки 	= СклонениеПредставленийОбъектов.ПросклонятьПредставление(Формат(Выборка.ПериодНачисленияКорректировки, "ДФ='MMMM'"),6) + " " + Формат(Выборка.ПериодНачисленияКорректировки, "ДФ='yyyy ''г.'''");
	ОбластьАктПерерасчета.Параметры.ДатаДоговора 					= Формат(Выборка.ДатаДоговора, "ДЛФ=D");
	ОбластьАктПерерасчета.Параметры.ДатаПД 							= Формат(Выборка.ДатаПД, "ДЛФ=D");
	ОбластьАктПерерасчета.Параметры.УвеличенияУменьшения            = ?(Выборка.РазницаСумма > 0, "увеличения", "уменьшения");
	ОбластьАктПерерасчета.Параметры.РазницаСумма            		= ?(Выборка.РазницаСумма > 0, Выборка.РазницаСумма, -Выборка.РазницаСумма);
	ОбластьАктПерерасчета.Параметры.РазницаСуммаНДС            		= ?(Выборка.РазницаСуммаНДС > 0, Выборка.РазницаСуммаНДС, -Выборка.РазницаСуммаНДС);
	
	Если ЗначениеЗаполнено(Выборка.НомерДоверенностиКонтактногоЛица) И ЗначениеЗаполнено(Выборка.ДатаДоверенностиКонтактногоЛица) Тогда
		ОбластьАктПерерасчета.Параметры.ДоверенностьКонтактногоЛица = ", действующего на основании доверенности №" + Выборка.НомерДоверенностиКонтактногоЛица + " от " + Формат(Выборка.ДатаДоверенностиКонтактногоЛица, "ДЛФ=D") + ",";
	Иначе
		ОбластьАктПерерасчета.Параметры.ДоверенностьКонтактногоЛица = "";
	КонецЕсли;
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГарантирующийПоставщик Тогда
			
			ОбластьАктПерерасчета.Параметры.ГарантирующийПоставщикФИО 		= эл.Сотрудник;
			ОбластьАктПерерасчета.Параметры.ГарантирующийПоставщикДолжность = эл.Должность;
			РезультатСклонения = энргОбщегоНазначения.ПолучитьСклоненияОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Сотрудник, "ФизическоеЛицо"));
			ВыборкаСклонения = РезультатСклонения.Выбрать();
			Если ВыборкаСклонения.Следующий() Тогда
				ОбластьАктПерерасчета.Параметры.ГарантирующийПоставщикФИОРП = ВыборкаСклонения.РодительныйПадеж;
			КонецЕсли;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьАктПерерасчета.Параметры.ГарантирующийПоставщикДоверенность = " на основании доверенности дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьАктПерерасчета.Параметры.ГарантирующийПоставщикДоверенность = "";	
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьАктПерерасчета); 	
	
КонецПроцедуры     

#КонецОбласти

#Область АктПриемаПередачи

Функция ПолучитьЗапросАктПриемаПередачи() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		КОНЕЦ) КАК СуммаСНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Услуга,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) КАК ОбъемУслуги,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|			И (бестПлатежныйДокумент.Ссылка = &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерВРазрезеВидаЗадолженности,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф
	|
	|ИМЕЮЩИЕ
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	ДанныеДокумента.Дата КАК ДатаПД,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.Тариф КАК Тариф,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ОбъемУслуги КАК ОбъемУслуги,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ДанныеДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеДокумента.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	Итог.ДатаПД КАК ДатаПД,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.Организация КАК Организация,
	|	СУММА(Итог.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(Итог.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Итог.СуммаБезНДС) КАК СуммаБезНДС,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагентыДоверенности.Номер КАК НомерДоверенностиКонтактногоЛица,
	|	энргКонтрагентыДоверенности.Дата КАК ДатаДоверенностиКонтактногоЛица,
	|	ВЫРАЗИТЬ(СклоненияПредставленийОбъектов.РодительныйПадеж КАК СТРОКА(500)) КАК КонтактноеЛицоРП,
	|	СУММА(ВЫБОР
	|			КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				ТОГДА 0
	|			ИНАЧЕ Итог.ОбъемУслуги
	|		КОНЕЦ) КАК ОбъемЭЭ,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Итог.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестКонтактныеЛицаКонтрагентов КАК бестКонтактныеЛицаКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СклоненияПредставленийОбъектов КАК СклоненияПредставленийОбъектов
	|			ПО бестКонтактныеЛицаКонтрагентов.КонтактноеЛицо = СклоненияПредставленийОбъектов.Объект
	|		ПО Итог.Контрагент = бестКонтактныеЛицаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.Доверенности КАК энргКонтрагентыДоверенности
	|		ПО Итог.Контрагент = энргКонтрагентыДоверенности.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Итог.НомерВРазрезеВидаЗадолженности,
	|	Итог.ДатаПД,
	|	Итог.НомерДоговора,
	|	Итог.ДатаДоговора,
	|	Итог.Организация,
	|	Итог.Контрагент,
	|	энргКонтрагентыДоверенности.Номер,
	|	энргКонтрагентыДоверенности.Дата,
	|	ВЫРАЗИТЬ(СклоненияПредставленийОбъектов.РодительныйПадеж КАК СТРОКА(500)),
	|	Итог.ПериодНачисления,
	|	Итог.ЭлектронноеВзаимодействие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	Итог.Тариф КАК Тариф,
	|	Итог.СтавкаНДС КАК СтавкаНДС,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ОбъемУслуги КАК ОбъемУслуги,
	|	Итог.СуммаБезНДС КАК СуммаБезНДС,
	|	Итог.ПериодНачисления КАК ГодМесяц,
	|	Итог.СпособНачисления КАК СпособНачисления
	|ИЗ
	|	Итог КАК Итог";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьАктПриемаПередачи(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка 		= РезультатЗапроса[2].Выбрать();
	ВыборкаИтогУслуга 	= РезультатЗапроса[3].Выбрать();
	Картинка = Новый Картинка();
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГарантирующийПоставщик Тогда
			ОбластьПодвал.Параметры.ГарантирующийПоставщикФИО = эл.Сотрудник;
			Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
			РезультатСклонения = энргОбщегоНазначения.ПолучитьСклоненияОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Сотрудник, "ФизическоеЛицо"));
			Выборка = РезультатСклонения.Выбрать();
			Если Выборка.Следующий() Тогда
				ОбластьШапка.Параметры.ГарантирующийПоставщикФИОРП = Выборка.РодительныйПадеж;
			КонецЕсли;
			ОбластьШапка.Параметры.ГарантирующийПоставщикДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьШапка.Параметры.ГарантирующийПоставщикДоверенность = " на основании доверенности дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + "от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьШапка.Параметры.ГарантирующийПоставщикДоверенность = "";	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  	
	
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.МесяцПрописьюГод = Формат(ВыборкаШапка.ПериодНачисления, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		
		Если ЗначениеЗаполнено(ВыборкаШапка.НомерДоверенностиКонтактногоЛица) И ЗначениеЗаполнено(ВыборкаШапка.ДатаДоверенностиКонтактногоЛица) Тогда
			ОбластьШапка.Параметры.ДоверенностьКонтактногоЛица = ", действующего на основании доверенности №" + ВыборкаШапка.НомерДоверенностиКонтактногоЛица + " от " + Формат(ВыборкаШапка.ДатаДоверенностиКонтактногоЛица, "ДЛФ=D") + ",";
		Иначе
			ОбластьШапка.Параметры.ДоверенностьКонтактногоЛица = "";
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьШапка);
		
		ЗаполнитьЗначенияСвойств(ОбластьИтого.Параметры,ВыборкаШапка);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
		ОбластьПодвал.Параметры.МесяцПрописьюГод = Формат(ВыборкаШапка.ПериодНачисления, "ДФ='MMMM yyyy ''г.'''");
		ОбластьПодвал.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		Если ВыборкаШапка.ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда
			ОбластьПодвал.Рисунки.ОбразецПодписиГарантирующегоПоставщика.Картинка = Картинка;
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = 1;
	Пока ВыборкаИтогУслуга.Следующий() Цикл
		ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
		ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры,ВыборкаИтогУслуга);
		ОбластьДанныеЗадолженности.Параметры.Номер = НомерСтроки;
		
		ТабДок.Вывести(ОбластьДанныеЗадолженности);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьИтого);
	
	ТабДок.Вывести(ОбластьПодвал); 	
	
КонецПроцедуры     

#КонецОбласти

#Область АктПриемаПередачиПоЭЭ

Функция ПолучитьЗапросАктПриемаПередачиПоЭЭ() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		КОНЕЦ) КАК СуммаСНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Услуга,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) КАК ОбъемУслуги,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления КАК СпособНачисления,
	|	энргЕдиницыИзмерения.КодПоОКЕИ КАК КодПоОКЕИ,
	|	энргЕдиницыИзмерения.Наименование КАК НаименованиеЕИ,
	|	ВЫРАЗИТЬ(бестПлатежныйДокумент.Договор КАК Справочник.энргДоговорыКонтрагентов).Контрагент КАК ДоговорКонтрагент,
	|	бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|			И (бестПлатежныйДокумент.Ссылка = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЕдиницыИзмерения КАК энргЕдиницыИзмерения
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Услуга.ЕдиницаИзмерения = энргЕдиницыИзмерения.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерВРазрезеВидаЗадолженности,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф,
	|	энргЕдиницыИзмерения.КодПоОКЕИ,
	|	энргЕдиницыИзмерения.Наименование,
	|	бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета
	|
	|ИМЕЮЩИЕ
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеДокумента.Тариф КАК Тариф,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокумента.СпособНачисления КАК СпособНачисления,
	|	ДанныеДокумента.КодПоОКЕИ КАК КодПоОКЕИ,
	|	ДанныеДокумента.НаименованиеЕИ КАК НаименованиеЕИ,
	|	ДанныеДокумента.ДоговорКонтрагент КАК ДоговорКонтрагент,
	|	ДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
	|	ВЫБОР
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПерваяЦК)
	|			ТОГДА ""1 ценовой категории""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ВтораяЦК)
	|			ТОГДА ""2 ценовой категории""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
	|			ТОГДА ""3 ценовой категории""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК)
	|			ТОГДА ""4 ценовой категории""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ПятаяЦК)
	|			ТОГДА ""5 ценовой категории""
	|		КОГДА бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ШестаяЦК)
	|			ТОГДА ""6 ценовой категории""
	|	КОНЕЦ КАК ЦеноваяКатегория
	|ПОМЕСТИТЬ ТочкиПоставкиОР
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТочкиПоставкиОбъектовРасчета.СрезПоследних(&Период, ) КАК бестТочкиПоставкиОбъектовРасчетаСрезПоследних
	|		ПО ДанныеДокумента.Организация = бестТочкиПоставкиОбъектовРасчетаСрезПоследних.Организация
	|			И ДанныеДокумента.Район = бестТочкиПоставкиОбъектовРасчетаСрезПоследних.Район
	|			И ДанныеДокумента.ОбъектРасчета = бестТочкиПоставкиОбъектовРасчетаСрезПоследних.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(&Период, ) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО ДанныеДокумента.Организация = бестЦеновыеКатегорииТочекУчетаСрезПоследних.Организация
	|			И ДанныеДокумента.Район = бестЦеновыеКатегорииТочекУчетаСрезПоследних.Район
	|			И ДанныеДокумента.ОбъектРасчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И ДанныеДокумента.ТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиПоставкиОР.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	ТочкиПоставкиОР.Организация КАК Организация,
	|	ТочкиПоставкиОР.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	ТочкиПоставкиОР.Дата КАК Дата,
	|	ТочкиПоставкиОР.Район КАК Район,
	|	ТочкиПоставкиОР.Договор КАК Договор,
	|	ТочкиПоставкиОР.ОбъектРасчета КАК ОбъектРасчета,
	|	ТочкиПоставкиОР.СуммаСНДС КАК СуммаСНДС,
	|	ТочкиПоставкиОР.СуммаНДС КАК СуммаНДС,
	|	ТочкиПоставкиОР.СуммаБезНДС КАК СуммаБезНДС,
	|	ТочкиПоставкиОР.Тариф КАК Тариф,
	|	ТочкиПоставкиОР.СтавкаНДС КАК СтавкаНДС,
	|	ТочкиПоставкиОР.Услуга КАК Услуга,
	|	ТочкиПоставкиОР.ОбъемУслуги КАК ОбъемУслуги,
	|	ТочкиПоставкиОР.ПериодНачисления КАК ПериодНачисления,
	|	ТочкиПоставкиОР.СпособНачисления КАК СпособНачисления,
	|	ТочкиПоставкиОР.КодПоОКЕИ КАК КодПоОКЕИ,
	|	ТочкиПоставкиОР.НаименованиеЕИ КАК НаименованиеЕИ,
	|	ТочкиПоставкиОР.ДоговорКонтрагент КАК ДоговорКонтрагент,
	|	ТочкиПоставкиОР.ТочкаУчета КАК ТочкаУчета,
	|	ТочкиПоставкиОР.ТочкаПоставки КАК ТочкаПоставки,
	|	ТочкиПоставкиОР.ЦеноваяКатегория КАК ЦК,
	|	энргПараметрыТочекПоставкиСрезПоследних.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргПараметрыТочекПоставкиСрезПоследних.УровеньНапряжения КАК УровеньНапряжения
	|ПОМЕСТИТЬ ДанныеПоУслуге
	|ИЗ
	|	ТочкиПоставкиОР КАК ТочкиПоставкиОР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПараметрыТочекПоставки.СрезПоследних(&Период, ) КАК энргПараметрыТочекПоставкиСрезПоследних
	|		ПО ТочкиПоставкиОР.ТочкаПоставки = энргПараметрыТочекПоставкиСрезПоследних.ТочкаПоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоУслуге.Организация КАК Организация,
	|	ДанныеПоУслуге.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	ДанныеПоУслуге.Дата КАК ДатаПД,
	|	ДанныеПоУслуге.Район КАК Район,
	|	ДанныеПоУслуге.Договор КАК Договор,
	|	ДанныеПоУслуге.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеПоУслуге.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеПоУслуге.СуммаНДС КАК СуммаНДС,
	|	ДанныеПоУслуге.Тариф КАК Тариф,
	|	ДанныеПоУслуге.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеПоУслуге.Услуга КАК Услуга,
	|	ДанныеПоУслуге.ОбъемУслуги КАК ОбъемУслуги,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ДанныеПоУслуге.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеПоУслуге.ПериодНачисления КАК ПериодНачисления,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеПоУслуге.СпособНачисления КАК СпособНачисления,
	|	ДанныеПоУслуге.КодПоОКЕИ КАК КодПоОКЕИ,
	|	ДанныеПоУслуге.НаименованиеЕИ КАК НаименованиеЕИ,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК АдресПродавца,
	|	ВЫРАЗИТЬ(энргДоговорыКонтрагентов.Контрагент КАК Справочник.энргКонтрагенты).ИНН КАК КонтрагентИНН,
	|	ВЫРАЗИТЬ(энргДоговорыКонтрагентов.Контрагент КАК Справочник.энргКонтрагенты).КПП КАК КонтрагентКПП,
	|	ВложенныйЗапрос.АдресКонтрагента КАК АдресКонтрагента,
	|	ДанныеПоУслуге.ЦК КАК ЦК,
	|	ДанныеПоУслуге.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	ДанныеПоУслуге.УровеньНапряжения КАК УровеньНапряжения,
	|	бестДиапазоныМощности.Наименование КАК ДиапазонМощности
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеПоУслуге КАК ДанныеПоУслуге
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО ДанныеПоУслуге.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДанныеПоУслуге.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеПоУслуге.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			энргКонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|			энргКонтрагентыКонтактнаяИнформация.Представление КАК АдресКонтрагента
	|		ИЗ
	|			Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ГДЕ
	|			энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)) КАК ВложенныйЗапрос
	|		ПО ДанныеПоУслуге.ДоговорКонтрагент = ВложенныйЗапрос.Ссылка,
	|	Справочник.бестДиапазоныМощности КАК бестДиапазоныМощности
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации)
	|	И бестДиапазоныМощности.От <= ДанныеПоУслуге.МаксимальнаяМощность
	|	И ДанныеПоУслуге.МаксимальнаяМощность <= бестДиапазоныМощности.До
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.НомерВРазрезеВидаЗадолженности КАК НомерВРазрезеВидаЗадолженности,
	|	Итог.ДатаПД КАК ДатаПД,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.Организация КАК Организация,
	|	СУММА(Итог.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(Итог.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Итог.СуммаБезНДС) КАК СуммаБезНДС,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагентыДоверенности.Номер КАК НомерДоверенностиКонтактногоЛица,
	|	энргКонтрагентыДоверенности.Дата КАК ДатаДоверенностиКонтактногоЛица,
	|	ВЫРАЗИТЬ(СклоненияПредставленийОбъектов.РодительныйПадеж КАК СТРОКА(500)) КАК КонтактноеЛицоРП,
	|	СУММА(ВЫБОР
	|			КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				ТОГДА 0
	|			ИНАЧЕ Итог.ОбъемУслуги
	|		КОНЕЦ) КАК ОбъемЭЭ,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	Итог.КодПоОКЕИ КАК КодПоОКЕИ,
	|	Итог.НаименованиеЕИ КАК НаименованиеЕИ,
	|	Итог.ИНН КАК ИНН,
	|	Итог.КПП КАК КПП,
	|	Итог.АдресПродавца КАК АдресПродавца,
	|	Итог.КонтрагентИНН КАК КонтрагентИНН,
	|	Итог.КонтрагентКПП КАК КонтрагентКПП,
	|	Итог.АдресКонтрагента КАК АдресКонтрагента,
	|	Итог.ЦК КАК ЦК,
	|	Итог.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	Итог.ДиапазонМощности КАК ДиапазонМощности
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО Итог.Услуга = энргВидыУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестКонтактныеЛицаКонтрагентов КАК бестКонтактныеЛицаКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СклоненияПредставленийОбъектов КАК СклоненияПредставленийОбъектов
	|			ПО бестКонтактныеЛицаКонтрагентов.КонтактноеЛицо = СклоненияПредставленийОбъектов.Объект
	|		ПО Итог.Контрагент = бестКонтактныеЛицаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.Доверенности КАК энргКонтрагентыДоверенности
	|		ПО Итог.Контрагент = энргКонтрагентыДоверенности.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Итог.НомерВРазрезеВидаЗадолженности,
	|	Итог.ДатаПД,
	|	Итог.НомерДоговора,
	|	Итог.ДатаДоговора,
	|	Итог.Организация,
	|	Итог.Контрагент,
	|	энргКонтрагентыДоверенности.Номер,
	|	энргКонтрагентыДоверенности.Дата,
	|	ВЫРАЗИТЬ(СклоненияПредставленийОбъектов.РодительныйПадеж КАК СТРОКА(500)),
	|	Итог.ПериодНачисления,
	|	Итог.ЭлектронноеВзаимодействие,
	|	Итог.КодПоОКЕИ,
	|	Итог.НаименованиеЕИ,
	|	Итог.ИНН,
	|	Итог.КПП,
	|	Итог.АдресПродавца,
	|	Итог.КонтрагентИНН,
	|	Итог.КонтрагентКПП,
	|	Итог.АдресКонтрагента,
	|	Итог.ЦК,
	|	Итог.МаксимальнаяМощность,
	|	Итог.УровеньНапряжения,
	|	Итог.ДиапазонМощности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.СуммаСНДС КАК СуммаСНДС,
	|	Итог.СуммаНДС КАК СуммаНДС,
	|	Итог.Тариф КАК Тариф,
	|	Итог.СтавкаНДС КАК СтавкаНДС,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ОбъемУслуги КАК ОбъемУслуги,
	|	Итог.СуммаБезНДС КАК СуммаБезНДС,
	|	Итог.ПериодНачисления КАК ГодМесяц,
	|	Итог.СпособНачисления КАК СпособНачисления,
	|	Итог.КодПоОКЕИ КАК КодПоОКЕИ,
	|	Итог.НаименованиеЕИ КАК НаименованиеЕИ,
	|	Итог.КонтрагентИНН КАК КонтрагентИНН,
	|	Итог.КонтрагентКПП КАК КонтрагентКПП,
	|	Итог.ЦК КАК ЦК,
	|	Итог.УровеньНапряжения КАК УровеньНапряжения,
	|	Итог.ДиапазонМощности КАК ДиапазонМощности
	|ИЗ
	|	Итог КАК Итог";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьАктПриемаПередачиПоЭЭ(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка 		= РезультатЗапроса[4].Выбрать();
	ВыборкаИтогУслуга 	= РезультатЗапроса[5].Выбрать();
	//Картинка = Новый Картинка();
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГарантирующийПоставщик Тогда
			ОбластьПодвал.Параметры.ГарантирующийПоставщикФИО = эл.Сотрудник;
			//Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
			РезультатСклонения = энргОбщегоНазначения.ПолучитьСклоненияОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Сотрудник, "ФизическоеЛицо"));
			Выборка = РезультатСклонения.Выбрать();
			//Если Выборка.Следующий() Тогда
			//	ОбластьШапка.Параметры.ГарантирующийПоставщикФИОРП = Выборка.РодительныйПадеж;
			//КонецЕсли;
			//ОбластьШапка.Параметры.ГарантирующийПоставщикДолжность = эл.Должность;
			//Если ЗначениеЗаполнено(эл.Доверенность) Тогда
			//	ОбластьШапка.Параметры.ГарантирующийПоставщикДоверенность = " на основании доверенности дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + "от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			//Иначе
			//	ОбластьШапка.Параметры.ГарантирующийПоставщикДоверенность = "";	
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;  	
	
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.МесяцПрописьюГод = Формат(ВыборкаШапка.ПериодНачисления, "ДФ='MMMM yyyy'");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		
		//Если ЗначениеЗаполнено(ВыборкаШапка.НомерДоверенностиКонтактногоЛица) И ЗначениеЗаполнено(ВыборкаШапка.ДатаДоверенностиКонтактногоЛица) Тогда
		//	ОбластьШапка.Параметры.ДоверенностьКонтактногоЛица = ", действующего на основании доверенности №" + ВыборкаШапка.НомерДоверенностиКонтактногоЛица + " от " + Формат(ВыборкаШапка.ДатаДоверенностиКонтактногоЛица, "ДЛФ=D") + ",";
		//Иначе
		//	ОбластьШапка.Параметры.ДоверенностьКонтактногоЛица = "";
		//КонецЕсли;
		
		ТабДок.Вывести(ОбластьШапка);
		
		ЗаполнитьЗначенияСвойств(ОбластьИтого.Параметры,ВыборкаШапка);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
		//ОбластьПодвал.Параметры.МесяцПрописьюГод = Формат(ВыборкаШапка.ПериодНачисления, "ДФ='MMMM yyyy ''г.'''");
		//ОбластьПодвал.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		//Если ВыборкаШапка.ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда
		//	ОбластьПодвал.Рисунки.ОбразецПодписиГарантирующегоПоставщика.Картинка = Картинка;
		//КонецЕсли;
	КонецЕсли;
	
	//а = 1;
	Пока ВыборкаИтогУслуга.Следующий() Цикл
		ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
		ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры,ВыборкаИтогУслуга);
		//ОбластьДанныеЗадолженности.Параметры.Номер = а;
		
		ТабДок.Вывести(ОбластьДанныеЗадолженности);
		//а = а + 1;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьИтого);
	ТабДок.Вывести(ОбластьПодвал); 	
	
КонецПроцедуры     

#КонецОбласти

#Область СчетНаПредварительнуюОплатуЭЭ

Функция ПолучитьЗапросСчетНаПредварительнуюОплатуЭЭ() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Номер КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК ДатаПД,
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокумент.Договор.Контрагент КАК Контрагент,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Процент КАК ПроцентОплаты,
	|	бестПлатежныйДокумент.Договор.Номер КАК НомерДоговора,
	|	бестПлатежныйДокумент.Ссылка КАК Ссылка,
	|	энргЕдиницыИзмерения.КодПоОКЕИ КАК КодПоОКЕИ,
	|	энргЕдиницыИзмерения.Наименование КАК НаименованиеЕИ,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги КАК ОбъемУслуги,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК Тариф,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|	КОНЕЦ КАК СуммаСНДС
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЕдиницыИзмерения КАК энргЕдиницыИзмерения
	|			ПО бестПлатежныйДокументОсновнаяРеализация.Услуга.ЕдиницаИзмерения = энргЕдиницыИзмерения.Ссылка
	|		ПО бестПлатежныйДокумент.Ссылка = бестПлатежныйДокументОсновнаяРеализация.Ссылка
	|			И (бестПлатежныйДокумент.Ссылка = &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Номер,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.Договор.Контрагент,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Процент,
	|	бестПлатежныйДокумент.Договор.Номер,
	|	бестПлатежныйДокумент.Ссылка,
	|	энргЕдиницыИзмерения.КодПоОКЕИ,
	|	энргЕдиницыИзмерения.Наименование,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.СуммаНДС,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|			ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	Организации.Представление КАК Продавец,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	МАКСИМУМ(ЕСТЬNULL(ОрганизацииКонтактнаяИнформация.Представление, """")) КАК АдресПродавца,
	|	БанковскиеСчета.Банк.Представление КАК Банк,
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк.КоррСчет КАК КорСчет,
	|	БанковскиеСчета.НомерСчета КАК Счет
	|ПОМЕСТИТЬ ДанныеОрганизации
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|			ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|				И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Организация,
	|	Организации.КПП,
	|	Организации.ИНН,
	|	Организации.Представление,
	|	БанковскиеСчета.Банк.Представление,
	|	БанковскиеСчета.Банк.Код,
	|	БанковскиеСчета.Банк.КоррСчет,
	|	БанковскиеСчета.НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	энргКонтрагенты.ИНН КАК ПокупательИНН,
	|	энргКонтрагенты.КПП КАК ПокупательКПП,
	|	энргКонтрагенты.НаименованиеПолное КАК Покупатель,
	|	МАКСИМУМ(ЕСТЬNULL(энргКонтрагентыКонтактнаяИнформация.Представление, """")) КАК АдресПокупателя
	|ПОМЕСТИТЬ ДанныеКонтрагента
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|			ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация.Ссылка
	|				И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ПО ДанныеДокумента.Контрагент = энргКонтрагенты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКонтрагенты.КПП,
	|	энргКонтрагенты.ИНН,
	|	ДанныеДокумента.Контрагент,
	|	энргКонтрагенты.НаименованиеПолное
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОрганизации.Банк КАК Банк,
	|	ДанныеОрганизации.БИК КАК БИК,
	|	ДанныеОрганизации.КорСчет КАК КорСчет,
	|	ДанныеОрганизации.ИНН КАК ИНН,
	|	ДанныеОрганизации.КПП КАК КПП,
	|	ДанныеОрганизации.Счет КАК Счет,
	|	ДанныеОрганизации.Продавец КАК Продавец,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.ДатаПД КАК ДатаПД,
	|	ДанныеОрганизации.АдресПродавца КАК АдресПродавца,
	|	ДанныеКонтрагента.Покупатель КАК Покупатель,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеКонтрагента.АдресПокупателя КАК АдресПокупателя,
	|	ДанныеКонтрагента.ПокупательИНН КАК ПокупательИНН,
	|	ДанныеКонтрагента.ПокупательКПП КАК ПокупательКПП,
	|	СУММА(ДанныеДокумента.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ДанныеДокумента.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ДанныеДокумента.СуммаСНДС) КАК СуммаСНДС
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОрганизации КАК ДанныеОрганизации
	|		ПО ДанныеДокумента.Организация = ДанныеОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагента КАК ДанныеКонтрагента
	|		ПО ДанныеДокумента.Контрагент = ДанныеКонтрагента.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеКонтрагента.ПокупательКПП,
	|	ДанныеКонтрагента.ПокупательИНН,
	|	ДанныеДокумента.ДатаПД,
	|	ДанныеДокумента.ПериодНачисления,
	|	ДанныеДокумента.НомерПД,
	|	ДанныеКонтрагента.АдресПокупателя,
	|	ДанныеКонтрагента.Покупатель,
	|	ДанныеОрганизации.АдресПродавца,
	|	ДанныеОрганизации.Продавец,
	|	ДанныеОрганизации.КорСчет,
	|	ДанныеОрганизации.БИК,
	|	ДанныеОрганизации.ИНН,
	|	ДанныеОрганизации.КПП,
	|	ДанныеОрганизации.Банк,
	|	ДанныеОрганизации.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ПроцентОплаты КАК ПроцентОплаты,
	|	ДанныеДокумента.НомерДоговора КАК НомерДоговора,
	|	ДанныеДокумента.КодПоОКЕИ КАК КодПоОКЕИ,
	|	ДанныеДокумента.НаименованиеЕИ КАК НаименованиеЕИ,
	|	СУММА(ДанныеДокумента.ОбъемУслуги) КАК ОбъемУслуги,
	|	ДанныеДокумента.Тариф КАК Тариф,
	|	СУММА(ДанныеДокумента.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ДанныеДокумента.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ДанныеДокумента.СуммаНДС) КАК СуммаСНДС
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Тариф,
	|	ДанныеДокумента.КодПоОКЕИ,
	|	ДанныеДокумента.НаименованиеЕИ,
	|	ДанныеДокумента.НомерДоговора,
	|	ДанныеДокумента.ПроцентОплаты";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьСчетНаПредварительнуюОплатуЭЭ(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка 		= РезультатЗапроса[3].Выбрать();
	ВыборкаИтогУслуга 	= РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаШапка);
		ОбластьШапка.Параметры.ПериодНачисления = Формат(ВыборкаШапка.ПериодНачисления, "ДФ='MMMM yyyy'");
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ЗаполнитьЗначенияСвойств(ОбластьИтого.Параметры, ВыборкаШапка);
	КонецЕсли;
		
	ТабДок.Вывести(ОбластьШапка);
	
	СуммаБезНДС = 0;
	СуммаНДС = 0;
	СуммаСНДС = 0;
	Пока ВыборкаИтогУслуга.Следующий() Цикл
		ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
		ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры, ВыборкаИтогУслуга);
		ТабДок.Вывести(ОбластьДанныеЗадолженности);
	КонецЦикла;
	
	
	ТабДок.Вывести(ОбластьИтого);
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.ГенеральныйДиректор = эл.Сотрудник;
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтер = эл.Сотрудник;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.МасштабПечати = 73;
	ТабДок.Вывести(ОбластьПодвал); 	
	
КонецПроцедуры     

#КонецОбласти

#Область СчетНаОстаток

Функция ПолучитьЗапросСчетНаОстаток() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.Дата КАК ДатаПД,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	БанковскиеСчета.Банк КАК БанкОрг,
	|	БанковскиеСчета.НомерСчета КАК РасчетныйСчетОрг,
	|	КлассификаторБанков.Код КАК БИКОрг,
	|	КлассификаторБанков.КоррСчет КАК КорСчетОрг,
	|	БанковскиеСчета1.Банк КАК БанкКон,
	|	БанковскиеСчета1.НомерСчета КАК РасчетныйСчетКон,
	|	КлассификаторБанков1.Код КАК БИККон,
	|	КлассификаторБанков1.КоррСчет КАК КорСчетКон
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|				ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
	|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета1
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков1
	|					ПО БанковскиеСчета1.Банк = КлассификаторБанков1.Ссылка
	|				ПО энргКонтрагенты.Ссылка = БанковскиеСчета1.Владелец
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПлатежныйДокументНеоплаченныеСчета.Сумма КАК Сумма,
	|	бестПлатежныйДокументНеоплаченныеСчета.СуммаНДС КАК СуммаНДС,
	|	бестПлатежныйДокументНеоплаченныеСчета.Сумма - бестПлатежныйДокументНеоплаченныеСчета.СуммаНДС КАК СуммаБезНДС,
	|	бестПлатежныйДокумент1.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент1.Дата КАК Дата,
	|	бестПлатежныйДокумент1.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.бестПлатежныйДокумент.НеоплаченныеСчета КАК бестПлатежныйДокументНеоплаченныеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументНеоплаченныеСчета.Ссылка = бестПлатежныйДокумент.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент1
	|		ПО бестПлатежныйДокументНеоплаченныеСчета.ПлатежныйДокумент = бестПлатежныйДокумент1.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокументНеоплаченныеСчета.Сумма,
	|	бестПлатежныйДокументНеоплаченныеСчета.СуммаНДС,
	|	бестПлатежныйДокумент1.НомерПД,
	|	бестПлатежныйДокумент1.Дата,
	|	бестПлатежныйДокумент1.ПериодНачисления";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьСчетНаОстаток(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");	
	
	ВыборкаШапка = РезультатЗапроса[1].Выбрать();
	ВыборкаДанные = РезультатЗапроса[2].Выбрать(); 	
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ТабДок.Вывести(ОбластьШапка);
		
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
	КонецЕсли;
	
	СуммаБезНДС = 0;
	СуммаНДС 	= 0;
	Сумма 	= 0;
	
	Пока ВыборкаДанные.Следующий() Цикл
		ОбластьДанные = Макет.ПолучитьОбласть("Данные");
		ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры,ВыборкаДанные);
		ОбластьДанные.Параметры.ПД = "№ " + ВыборкаДанные.НомерПД + " от " + Формат(ВыборкаДанные.Дата, "ДЛФ=D") + " за " + Формат(ВыборкаДанные.ПериодНачисления, "ДФ='MMMM yyyy ''г.'''");
		ТабДок.Вывести(ОбластьДанные);
		
		СуммаБезНДС = СуммаБезНДС + ВыборкаДанные.СуммаБезНДС;
		СуммаНДС 	= СуммаНДС + ВыборкаДанные.СуммаНДС;
		Сумма 		= Сумма + ВыборкаДанные.Сумма;
	КонецЦикла;
	
	ОбластьПодвал.Параметры.СуммаБезНДС = СуммаБезНДС;
	ОбластьПодвал.Параметры.СуммаНДС 	= СуммаНДС;
	ОбластьПодвал.Параметры.Сумма 		= Сумма;	
	
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;	
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал); 	
	
КонецПроцедуры     

#КонецОбласти

#Область СчетНаОплатуПост

Функция ПолучитьЗапросСчетНаОплатуПост() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга КАК Услуга,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) КАК ОбъемУслуги,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный КАК Ответственный,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная + бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешеннаяНДС
	|		КОНЕЦ) КАК СуммаСредневзвешенная,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавкуНДС
	|		КОНЕЦ) КАК СуммаЗаСбытовуюНадбавку,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачиНДС
	|		КОНЕЦ) КАК СуммаЗаУслугиПоПередачи,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги + бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслугиНДС
	|		КОНЕЦ) КАК СуммаЗаИныеУслуги,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешеннаяНДС) КАК СуммаСредневзвешеннаяНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавкуНДС) КАК СуммаЗаСбытовуюНадбавкуНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачиНДС) КАК СуммаЗаУслугиПоПередачиНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслугиНДС) КАК СуммаЗаИныеУслугиНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифНаСредневзвешанную КАК ТарифНаСредневзвешанную,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифЗаСбытовуюНадбавку КАК ТарифЗаСбытовуюНадбавку,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифЗаУслугиПоПередачи КАК ТарифЗаУслугиПоПередачи,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифНаИныеУслуги КАК ТарифНаИныеУслуги,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная - бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешеннаяНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаСредневзвешенная
	|		КОНЕЦ) КАК СуммаСредневзвешеннаяБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку - бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавкуНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаЗаСбытовуюНадбавку
	|		КОНЕЦ) КАК СуммаЗаСбытовуюНадбавкуБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи - бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачиНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаЗаУслугиПоПередачи
	|		КОНЕЦ) КАК СуммаЗаУслугиПоПередачиБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги - бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслугиНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.СуммаЗаИныеУслуги
	|		КОНЕЦ) КАК СуммаЗаИныеУслугиБезНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления КАК СпособНачисления,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		КОНЕЦ) КАК СуммаСНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф КАК ТарифОбщий,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма - бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И (бестПлатежныйДокументОсновнаяРеализация.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
	|					ИЛИ бестПлатежныйДокументОсновнаяРеализация.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка))
	|			ТОГДА ""Мощность, оплачиваемая на розничном рынке в т.ч.""
	|		КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И бестПлатежныйДокументОсновнаяРеализация.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
	|			ТОГДА ""Мощность, оплачиваемая в части услуг по передаче в т.ч.""
	|		КОГДА НЕ энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население)
	|			ТОГДА ""Электроэнергия, отпущенная населению по приборам учета""
	|		КОГДА энргВидыУслуг.ИспользоватьРасчетРеактивнойЭнергии
	|			ТОГДА ""Потребленная реактивная энергия по нерегулируемым ценам в т.ч. по приборам учета""
	|		ИНАЧЕ ""Потребленная электроэнергия по нерегулируемым ценам в т.ч. по приборам учета""
	|	КОНЕЦ КАК УслугаТекст,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И (бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
	|					ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК))
	|			ТОГДА """"
	|		ИНАЧЕ ""по приборам учета""
	|	КОНЕЦ КАК ПоПУ,
	|	энргЕдиницыИзмерения.Ссылка КАК ЕдИзм,
	|	энргЕдиницыИзмерения.КодПоОКЕИ КАК КодОКЕИ
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних
	|		ПО бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ОбъектРасчета
	|			И бестПлатежныйДокументОсновнаяРеализация.ТочкаУчета = бестЦеновыеКатегорииТочекУчетаСрезПоследних.ТочкаУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЕдиницыИзмерения КАК энргЕдиницыИзмерения
	|			ПО энргВидыУслуг.ЕдиницаИзмерения = энргЕдиницыИзмерения.Ссылка
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.ОбъектРасчета,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.Услуга,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифЗаСбытовуюНадбавку,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифЗаУслугиПоПередачи,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифНаСредневзвешанную,
	|	бестПлатежныйДокументОсновнаяРеализация.СпособНачисления,
	|	бестПлатежныйДокументОсновнаяРеализация.Тариф,
	|	бестПлатежныйДокументОсновнаяРеализация.ТарифНаИныеУслуги,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И (бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ТретьяЦК)
	|					ИЛИ бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.ЧетвертаяЦК))
	|			ТОГДА """"
	|		ИНАЧЕ ""по приборам учета""
	|	КОНЕЦ,
	|	энргЕдиницыИзмерения.Ссылка,
	|	энргЕдиницыИзмерения.КодПоОКЕИ,
	|	ВЫБОР
	|		КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И (бестПлатежныйДокументОсновнаяРеализация.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаРозничномРынке)
	|					ИЛИ бестПлатежныйДокументОсновнаяРеализация.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПустаяСсылка))
	|			ТОГДА ""Мощность, оплачиваемая на розничном рынке в т.ч.""
	|		КОГДА энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И бестПлатежныйДокументОсновнаяРеализация.СпособНачисления = ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.МощностьНаПередачу)
	|			ТОГДА ""Мощность, оплачиваемая в части услуг по передаче в т.ч.""
	|		КОГДА НЕ энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория = ЗНАЧЕНИЕ(Перечисление.бестЦеновыеКатегории.Население)
	|			ТОГДА ""Электроэнергия, отпущенная населению по приборам учета""
	|		КОГДА энргВидыУслуг.ИспользоватьРасчетРеактивнойЭнергии
	|			ТОГДА ""Потребленная реактивная энергия по нерегулируемым ценам в т.ч. по приборам учета""
	|		ИНАЧЕ ""Потребленная электроэнергия по нерегулируемым ценам в т.ч. по приборам учета""
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.ОбъемУслуги) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.Дата КАК ДатаПД,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ОбъемУслуги КАК ОбъемУслуги,
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ДанныеДокумента.ЕдИзм КАК ЕдИзм,
	|	ДанныеДокумента.КодОКЕИ КАК КодОКЕИ,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	ДанныеДокумента.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	БанковскиеСчета.Банк КАК БанкОрг,
	|	БанковскиеСчета.НомерСчета КАК РасчетныйСчетОрг,
	|	КлассификаторБанков.Код КАК БИКОрг,
	|	КлассификаторБанков.КоррСчет КАК КорСчетОрг,
	|	ДанныеДокумента.ТарифОбщий КАК ТарифОбщий,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеДокумента.СпособНачисления КАК СпособНачисления
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеДокумента.Район = энргЗоныОтвественности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|				ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
	|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.НомерПД КАК НомерПД,
	|	Итог.ДатаПД КАК ДатаПД,
	|	Итог.ИННОрг КАК ИННОрг,
	|	Итог.КППОрг КАК КППОрг,
	|	Итог.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	|	Итог.ФактическийАдресОрг КАК ФактическийАдресОрг,
	|	Итог.ЮридическийАдресОрг КАК ЮридическийАдресОрг,
	|	Итог.ФактическийАдресКонтрагента КАК ФактическийАдресКонтрагента,
	|	Итог.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК ДатаДоговора,
	|	Итог.КодРайона КАК КодРайона,
	|	Итог.ИННКон КАК ИННКон,
	|	Итог.КППКон КАК КППКон,
	|	Итог.ОтветственныйТелефон КАК ОтветственныйТелефон,
	|	Итог.ОтветственныйПочта КАК ОтветственныйПочта,
	|	Итог.Ответственный КАК Ответственный,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие
	|ИЗ
	|	Итог КАК Итог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДокумента.СуммаСНДС КАК СуммаОбщая,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДСОбщая,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ОбъемУслуги КАК ОбъемУслуги,
	|	ДанныеДокумента.ЕдИзм КАК ЕдИзм,
	|	ДанныеДокумента.КодОКЕИ КАК КодОКЕИ,
	|	ДанныеДокумента.СуммаБезНДС КАК СуммаОбщаяБезНДС,
	|	ДанныеДокумента.ПериодНачисления КАК ГодМесяц,
	|	ДанныеДокумента.СуммаСредневзвешенная КАК СуммаСредневзвешенная,
	|	ДанныеДокумента.СуммаЗаСбытовуюНадбавку КАК СуммаЗаСбытовуюНадбавку,
	|	ДанныеДокумента.СуммаЗаУслугиПоПередачи КАК СуммаЗаУслугиПоПередачи,
	|	ДанныеДокумента.СуммаЗаИныеУслуги КАК СуммаЗаИныеУслуги,
	|	ДанныеДокумента.СуммаСредневзвешеннаяНДС КАК СуммаСредневзвешеннаяНДС,
	|	ДанныеДокумента.СуммаЗаСбытовуюНадбавкуНДС КАК СуммаЗаСбытовуюНадбавкуНДС,
	|	ДанныеДокумента.СуммаЗаУслугиПоПередачиНДС КАК СуммаЗаУслугиПоПередачиНДС,
	|	ДанныеДокумента.СуммаЗаИныеУслугиНДС КАК СуммаЗаИныеУслугиНДС,
	|	ДанныеДокумента.ТарифНаИныеУслуги КАК ТарифНаИныеУслуги,
	|	ДанныеДокумента.ТарифЗаСбытовуюНадбавку КАК ТарифЗаСбытовуюНадбавку,
	|	ДанныеДокумента.ТарифЗаУслугиПоПередачи КАК ТарифЗаУслугиПоПередачи,
	|	ДанныеДокумента.ТарифНаСредневзвешанную КАК ТарифНаСредневзвешанную,
	|	ДанныеДокумента.СуммаСредневзвешеннаяБезНДС КАК СуммаСредневзвешеннаяБезНДС,
	|	ДанныеДокумента.СуммаЗаСбытовуюНадбавкуБезНДС КАК СуммаЗаСбытовуюНадбавкуБезНДС,
	|	ДанныеДокумента.СуммаЗаУслугиПоПередачиБезНДС КАК СуммаЗаУслугиПоПередачиБезНДС,
	|	ДанныеДокумента.СуммаЗаИныеУслугиБезНДС КАК СуммаЗаИныеУслугиБезНДС,
	|	ДанныеДокумента.СпособНачисления КАК СпособНачисления,
	|	ДанныеДокумента.ТарифОбщий КАК ТарифОбщий,
	|	ДанныеДокумента.УслугаТекст КАК УслугаТекст,
	|	ДанныеДокумента.ПоПУ КАК ПоПУ
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ИТОГИ
	|	СУММА(СуммаОбщая),
	|	СУММА(СуммаНДСОбщая),
	|	СУММА(СуммаОбщаяБезНДС)
	|ПО
	|	ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ДанныеДокумента.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ДанныеДокумента.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ДанныеДокумента.ОбъемУслуги) КАК ОбъемУслуги,
	|	ДанныеДокумента.ЕдИзм КАК ЕдИзм,
	|	ДанныеДокумента.КодОКЕИ КАК КодОКЕИ,
	|	СУММА(ДанныеДокумента.СуммаБезНДС) КАК СуммаБезНДС
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.ЕдИзм,
	|	ДанныеДокумента.КодОКЕИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(бестАвансыЭЭОстатки.СуммаОстаток) КАК СуммаОбщая,
	|	СУММА(бестАвансыЭЭОстатки.СуммаНДСОстаток) КАК СуммаНДСОбщая,
	|	СУММА(бестАвансыЭЭОстатки.СуммаОстаток - бестАвансыЭЭОстатки.СуммаНДСОстаток) КАК СуммаОбщаяБезНДС
	|ИЗ
	|	РегистрНакопления.бестАвансыЭЭ.Остатки(
	|			&Период,
	|			(Договор, Организация, Район) В
	|				(ВЫБРАТЬ
	|					ДанныеДокумента.Договор КАК Договор,
	|					ДанныеДокумента.Организация КАК Организация,
	|					ДанныеДокумента.Район КАК Район
	|				ИЗ
	|					ДанныеДокумента КАК ДанныеДокумента)) КАК бестАвансыЭЭОстатки";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьСчетНаОплатуПост(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
	
	ВыборкаШапка 			= РезультатЗапроса[2].Выбрать();
	ВыборкаОбъектРасчета 	= РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогПоЕдИзм 		= РезультатЗапроса[4].Выбрать();
	ВыборкаАванс 			= РезультатЗапроса[5].Выбрать();
	ЭлектронноеВзаимодействие = Неопределено;
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ЭлектронноеВзаимодействие = ВыборкаШапка.ЭлектронноеВзаимодействие;
		ТабДок.Вывести(ОбластьШапка);
		
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаШапка);
	КонецЕсли;
	
	Пока ВыборкаОбъектРасчета.Следующий() Цикл
		ОбластьОбъектРасчета = Макет.ПолучитьОбласть("ОбъектРасчета");
		ОбластьОбъектРасчета.Параметры.ОбъектРасчета = ВыборкаОбъектРасчета.ОбъектРасчета;
		ТабДок.Вывести(ОбластьОбъектРасчета);
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектРасчета.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ГодМесяц = Формат(ВыборкаДетальныеЗаписи.ГодМесяц, "ДФ=yyyy.MM");
			
			ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
			ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры, ВыборкаДетальныеЗаписи);
			ОбластьДанныеЗадолженности.Параметры.ГодМесяц = ГодМесяц;
			ТабДок.Вывести(ОбластьДанныеЗадолженности);
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТарифНаСредневзвешанную) Тогда
				ОбластьДанныеСредневзвешеннойЗадолженности = Макет.ПолучитьОбласть("ДанныеСредневзвешеннойЗадолженности");
				ЗаполнитьЗначенияСвойств(ОбластьДанныеСредневзвешеннойЗадолженности.Параметры, ВыборкаДетальныеЗаписи);
				ОбластьДанныеСредневзвешеннойЗадолженности.Параметры.ГодМесяц = ГодМесяц;
				ТабДок.Вывести(ОбластьДанныеСредневзвешеннойЗадолженности);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТарифНаИныеУслуги) Тогда
				ОбластьДанныеЗадолженностиЗаИныеУслуги = Макет.ПолучитьОбласть("ДанныеЗадолженностиЗаИныеУслуги");
				ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженностиЗаИныеУслуги.Параметры, ВыборкаДетальныеЗаписи);
				ОбластьДанныеЗадолженностиЗаИныеУслуги.Параметры.ГодМесяц = ГодМесяц;
				ТабДок.Вывести(ОбластьДанныеЗадолженностиЗаИныеУслуги);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТарифЗаУслугиПоПередачи) Тогда
				ОбластьДанныеЗадолженностиЗаУслугиПоПередаче = Макет.ПолучитьОбласть("ДанныеЗадолженностиЗаУслугиПоПередаче");
				ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженностиЗаУслугиПоПередаче.Параметры, ВыборкаДетальныеЗаписи);
				ОбластьДанныеЗадолженностиЗаУслугиПоПередаче.Параметры.ГодМесяц = ГодМесяц;
				ТабДок.Вывести(ОбластьДанныеЗадолженностиЗаУслугиПоПередаче);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТарифЗаСбытовуюНадбавку) Тогда
				ОбластьДанныеЗадолженностиЗаСбытовуюНадбавку = Макет.ПолучитьОбласть("ДанныеЗадолженностиЗаСбытовуюНадбавку");
				ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженностиЗаСбытовуюНадбавку.Параметры, ВыборкаДетальныеЗаписи);
				ОбластьДанныеЗадолженностиЗаСбытовуюНадбавку.Параметры.ГодМесяц = ГодМесяц;
				ТабДок.Вывести(ОбластьДанныеЗадолженностиЗаСбытовуюНадбавку);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИтогПоОбъектуРасчета = Макет.ПолучитьОбласть("ИтогПоОбъектуРасчета");
		ЗаполнитьЗначенияСвойств(ОбластьИтогПоОбъектуРасчета.Параметры, ВыборкаОбъектРасчета);
		ТабДок.Вывести(ОбластьИтогПоОбъектуРасчета);
		
	КонецЦикла;
	
	СуммаБезНДС = 0;
	СуммаНДС 	= 0;
	СуммаСНДС 	= 0;
	
	Пока ВыборкаИтогПоЕдИзм.Следующий() Цикл
		ОбластьИтогиПоЕдИзм = Макет.ПолучитьОбласть("ИтогиПоЕдИзм");
		ЗаполнитьЗначенияСвойств(ОбластьИтогиПоЕдИзм.Параметры, ВыборкаИтогПоЕдИзм);
		ОбластьИтогиПоЕдИзм.Параметры.СуммаНДСОбщая = ВыборкаИтогПоЕдИзм.СуммаНДС;
		ОбластьИтогиПоЕдИзм.Параметры.СуммаОбщаяБезНДС = ВыборкаИтогПоЕдИзм.СуммаБезНДС;
		ОбластьИтогиПоЕдИзм.Параметры.СуммаОбщая = ВыборкаИтогПоЕдИзм.СуммаСНДС;
		ТабДок.Вывести(ОбластьИтогиПоЕдИзм);
		
		СуммаБезНДС = СуммаБезНДС + ВыборкаИтогПоЕдИзм.СуммаБезНДС;
		СуммаНДС 	= СуммаНДС + ВыборкаИтогПоЕдИзм.СуммаНДС;
		СуммаСНДС 	= СуммаСНДС + ВыборкаИтогПоЕдИзм.СуммаСНДС;
	КонецЦикла;
	
	ОбластьОбщиеИтоги = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьОбщиеИтоги.Параметры.СуммаОбщаяБезНДС 	= СуммаБезНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаНДСОбщая 		= СуммаНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаОбщая 			= СуммаСНДС;
	ТабДок.Вывести(ОбластьОбщиеИтоги);
	
	Если ВыборкаАванс.Следующий() Тогда
		ОбластьАванс = Макет.ПолучитьОбласть("Аванс");
		ЗаполнитьЗначенияСвойств(ОбластьАванс.Параметры,ВыборкаАванс);
		ТабДок.Вывести(ОбластьАванс);
		
		СуммаБезНДС = СуммаБезНДС - ВыборкаАванс.СуммаОбщаяБезНДС;
		СуммаНДС 	= СуммаНДС - ВыборкаАванс.СуммаНДСОбщая;
		СуммаСНДС 	= СуммаСНДС - ВыборкаАванс.СуммаОбщая;
	КонецЕсли;
	
	ОбластьОбщиеИтогиСУчетомАванса 								= Макет.ПолучитьОбласть("ОбщиеИтогиСУчетомАванса");
	ОбластьОбщиеИтогиСУчетомАванса.Параметры.СуммаОбщаяБезНДС 	= ?(СуммаБезНДС < 0,0,СуммаБезНДС);
	ОбластьОбщиеИтогиСУчетомАванса.Параметры.СуммаНДСОбщая 		= ?(СуммаНДС < 0,0,СуммаНДС);
	ОбластьОбщиеИтогиСУчетомАванса.Параметры.СуммаОбщая 		= ?(СуммаСНДС < 0,0,СуммаСНДС);
	ТабДок.Вывести(ОбластьОбщиеИтогиСУчетомАванса);
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;	
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры     

#КонецОбласти

#Область СчетНаОплатуПред

Функция ПолучитьЗапросСчетНаОплатуПред() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	СУММА(ВЫБОР
	|			КОГДА бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.Сумма
	|			ИНАЧЕ бестПлатежныйДокументОсновнаяРеализация.Сумма + бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|		КОНЕЦ) КАК СуммаСНДС,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС КАК СтавкаНДС,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный КАК Ответственный,
	|	бестПлатежныйДокумент.Процент КАК Процент,
	|	энргДоговорыКонтрагентов.Филиал КАК АбонентскийОтдел,
	|	энргДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора
	|ПОМЕСТИТЬ ДанныеДокументаИтог
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ПО бестПлатежныйДокумент.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.НомерПД,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокументОсновнаяРеализация.СтавкаНДС,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный,
	|	бестПлатежныйДокумент.Процент,
	|	энргДоговорыКонтрагентов.Филиал,
	|	энргДоговорыКонтрагентов.Контрагент,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие,
	|	энргДоговорыКонтрагентов.Номер,
	|	энргДоговорыКонтрагентов.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(бестАвансыЭЭОстатки.СуммаОстаток) КАК СуммаОбщая,
	|	СУММА(бестАвансыЭЭОстатки.СуммаНДСОстаток) КАК СуммаНДСОбщая,
	|	СУММА(бестАвансыЭЭОстатки.СуммаОстаток - бестАвансыЭЭОстатки.СуммаНДСОстаток) КАК СуммаОбщаяБезНДС,
	|	бестАвансыЭЭОстатки.Договор КАК Договор
	|ПОМЕСТИТЬ Авансы
	|ИЗ
	|	РегистрНакопления.бестАвансыЭЭ.Остатки(
	|			&Период,
	|			(Организация, Район, Договор) В
	|				(ВЫБРАТЬ
	|					ДанныеДокументаИтог.Организация КАК Организация,
	|					ДанныеДокументаИтог.Район КАК Район,
	|					ДанныеДокументаИтог.Договор КАК Договор
	|				ИЗ
	|					ДанныеДокументаИтог КАК ДанныеДокументаИтог)) КАК бестАвансыЭЭОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	бестАвансыЭЭОстатки.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъектыРасчета.МКД КАК МКД,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ МКДвДоговоре
	|ИЗ
	|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|			&Период,
	|			(Организация, Район) В
	|				(ВЫБРАТЬ
	|					ДанныеДокументаИтог.Организация КАК Организация,
	|					ДанныеДокументаИтог.Район КАК Район
	|				ИЗ
	|					ДанныеДокументаИтог КАК ДанныеДокументаИтог)) КАК бестДоговорыТочекУчетаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ПО бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	|ГДЕ
	|	бестДоговорыТочекУчетаСрезПоследних.Договор В
	|			(ВЫБРАТЬ
	|				ДанныеДокументаИтог.Договор КАК Договор
	|			ИЗ
	|				ДанныеДокументаИтог КАК ДанныеДокументаИтог)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестОбъектыРасчета.МКД,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументаИтог.Организация КАК Организация,
	|	ДанныеДокументаИтог.НомерПД КАК НомерПД,
	|	ДанныеДокументаИтог.Дата КАК ДатаПД,
	|	ДанныеДокументаИтог.Район КАК Район,
	|	ДанныеДокументаИтог.Договор КАК Договор,
	|	ДанныеДокументаИтог.СуммаСНДС КАК СуммаСНДС,
	|	ДанныеДокументаИтог.СуммаНДС КАК СуммаНДС,
	|	ДанныеДокументаИтог.СтавкаНДС КАК СтавкаНДС,
	|	Организации.ИНН КАК ИННОрг,
	|	энргЗоныОтвественности.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	МАКСИМУМ(ОрганизацииКонтактнаяИнформация.Представление) КАК ЮридическийАдресОрг,
	|	МАКСИМУМ(энргФилиалыКонтактнаяИнформация.Представление) КАК ТелефонОгранизации,
	|	МАКСИМУМ(энргКонтрагентыКонтактнаяИнформация.Представление) КАК ФактическийАдресКонтрагента,
	|	МАКСИМУМ(энргКонтрагентыКонтактнаяИнформацияТелефон.Представление) КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	ДанныеДокументаИтог.НомерДоговора КАК НомерДоговора,
	|	ДанныеДокументаИтог.ДатаДоговора КАК ДатаДоговора,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	ДанныеДокументаИтог.ПериодНачисления КАК ПериодНачисления,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	МАКСИМУМ(ПользователиКонтактнаяИнформация.Представление) КАК ОтветственныйТелефон,
	|	МАКСИМУМ(ПользователиКонтактнаяИнформация1.Представление) КАК ОтветственныйПочта,
	|	ДанныеДокументаИтог.Ответственный КАК Ответственный,
	|	БанковскиеСчета.Банк КАК БанкОрг,
	|	БанковскиеСчета.НомерСчета КАК РасчетныйСчетОрг,
	|	КлассификаторБанков.Код КАК БИКОрг,
	|	КлассификаторБанков.КоррСчет КАК КорСчетОрг,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.УчитыватьПереплату, ЛОЖЬ)
	|			ТОГДА ДанныеДокументаИтог.СуммаСНДС - ЕСТЬNULL(Авансы.СуммаОбщая, 0)
	|		ИНАЧЕ ДанныеДокументаИтог.СуммаСНДС
	|	КОНЕЦ КАК СуммаСНДССАвансом,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.УчитыватьПереплату, ЛОЖЬ)
	|			ТОГДА ДанныеДокументаИтог.СуммаНДС - ЕСТЬNULL(Авансы.СуммаНДСОбщая, 0)
	|		ИНАЧЕ ДанныеДокументаИтог.СуммаНДС
	|	КОНЕЦ КАК СуммаНДССАвансом,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.УчитыватьПереплату, ЛОЖЬ)
	|			ТОГДА ДанныеДокументаИтог.СуммаСНДС - ДанныеДокументаИтог.СуммаНДС - ЕСТЬNULL(Авансы.СуммаОбщаяБезНДС, 0)
	|		ИНАЧЕ ДанныеДокументаИтог.СуммаСНДС - ДанныеДокументаИтог.СуммаНДС
	|	КОНЕЦ КАК СуммаБезНДССАвансом,
	|	ДанныеДокументаИтог.СуммаСНДС - ДанныеДокументаИтог.СуммаНДС КАК СуммаБезНДС,
	|	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты КАК СрокОплаты,
	|	ДанныеДокументаИтог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеДокументаИтог.Процент КАК Процент,
	|	ВЫБОР
	|		КОГДА МКДвДоговоре.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ТОГДА ""Н""
	|		ИНАЧЕ ""Г""
	|	КОНЕЦ КАК ГИС
	|ИЗ
	|	ДанныеДокументаИтог КАК ДанныеДокументаИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеДокументаИтог.Район = энргЗоныОтвественности.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|				ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
	|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|			ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|				И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ПО ДанныеДокументаИтог.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргФилиалы.КонтактнаяИнформация КАК энргФилиалыКонтактнаяИнформация
	|		ПО ДанныеДокументаИтог.АбонентскийОтдел = энргФилиалыКонтактнаяИнформация.Ссылка
	|			И (энргФилиалыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонЦентраОбслуживания))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|			ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|				И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформацияТелефон
	|			ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформацияТелефон.Ссылка
	|				И (энргКонтрагентыКонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|		ПО ДанныеДокументаИтог.Контрагент = энргКонтрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокументаИтог.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокументаИтог.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Авансы КАК Авансы
	|		ПО ДанныеДокументаИтог.Договор = Авансы.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам.СрезПоследних(
	|				&Период,
	|				(Организация, Район, Договор) В
	|						(ВЫБРАТЬ
	|							ДанныеДокументаИтог.Организация КАК Организация,
	|							ДанныеДокументаИтог.Район КАК Район,
	|							ДанныеДокументаИтог.Договор КАК Договор
	|						ИЗ
	|							ДанныеДокументаИтог КАК ДанныеДокументаИтог)
	|					И ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Авансовый)
	|					И ДеньФормирования = ДЕНЬ(&Период)) КАК бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних
	|		ПО ДанныеДокументаИтог.Организация = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация
	|			И ДанныеДокументаИтог.Район = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район
	|			И ДанныеДокументаИтог.Договор = бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестВыставлениеПереплатыВАвансовыхСчетах.СрезПоследних(
	|				&Период,
	|				(Организация, Район, Договор) В
	|					(ВЫБРАТЬ
	|						ДанныеДокументаИтог.Организация КАК Организация,
	|						ДанныеДокументаИтог.Район КАК Район,
	|						ДанныеДокументаИтог.Договор КАК Договор
	|					ИЗ
	|						ДанныеДокументаИтог КАК ДанныеДокументаИтог)) КАК бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних
	|		ПО ДанныеДокументаИтог.Организация = бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.Организация
	|			И ДанныеДокументаИтог.Район = бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.Район
	|			И ДанныеДокументаИтог.Договор = бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргФилиалы КАК энргФилиалы
	|		ПО ДанныеДокументаИтог.АбонентскийОтдел = энргФилиалы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ МКДвДоговоре КАК МКДвДоговоре
	|		ПО ДанныеДокументаИтог.Договор = МКДвДоговоре.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокументаИтог.Организация,
	|	ДанныеДокументаИтог.НомерПД,
	|	ДанныеДокументаИтог.Дата,
	|	ДанныеДокументаИтог.Район,
	|	ДанныеДокументаИтог.Договор,
	|	ДанныеДокументаИтог.СуммаСНДС,
	|	ДанныеДокументаИтог.СуммаНДС,
	|	ДанныеДокументаИтог.СтавкаНДС,
	|	Организации.ИНН,
	|	энргЗоныОтвественности.КПП,
	|	Организации.НаименованиеПолное,
	|	энргКонтрагенты.Ссылка,
	|	ДанныеДокументаИтог.НомерДоговора,
	|	ДанныеДокументаИтог.ДатаДоговора,
	|	энргЗоныОтвественности.КодРайона,
	|	ДанныеДокументаИтог.ПериодНачисления,
	|	энргКонтрагенты.ИНН,
	|	энргКонтрагенты.КПП,
	|	ДанныеДокументаИтог.Ответственный,
	|	БанковскиеСчета.Банк,
	|	БанковскиеСчета.НомерСчета,
	|	КлассификаторБанков.Код,
	|	КлассификаторБанков.КоррСчет,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.УчитыватьПереплату, ЛОЖЬ)
	|			ТОГДА ДанныеДокументаИтог.СуммаСНДС - ЕСТЬNULL(Авансы.СуммаОбщая, 0)
	|		ИНАЧЕ ДанныеДокументаИтог.СуммаСНДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.УчитыватьПереплату, ЛОЖЬ)
	|			ТОГДА ДанныеДокументаИтог.СуммаНДС - ЕСТЬNULL(Авансы.СуммаНДСОбщая, 0)
	|		ИНАЧЕ ДанныеДокументаИтог.СуммаНДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(бестВыставлениеПереплатыВАвансовыхСчетахСрезПоследних.УчитыватьПереплату, ЛОЖЬ)
	|			ТОГДА ДанныеДокументаИтог.СуммаСНДС - ДанныеДокументаИтог.СуммаНДС - ЕСТЬNULL(Авансы.СуммаОбщаяБезНДС, 0)
	|		ИНАЧЕ ДанныеДокументаИтог.СуммаСНДС - ДанныеДокументаИтог.СуммаНДС
	|	КОНЕЦ,
	|	ДанныеДокументаИтог.СуммаСНДС - ДанныеДокументаИтог.СуммаНДС,
	|	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты,
	|	ДанныеДокументаИтог.ЭлектронноеВзаимодействие,
	|	ДанныеДокументаИтог.Процент,
	|	ВЫБОР
	|		КОГДА МКДвДоговоре.МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|			ТОГДА ""Н""
	|		ИНАЧЕ ""Г""
	|	КОНЕЦ";
	
	Возврат Запрос;
		
КонецФункции

Процедура ЗаполнитьСчетНаОплатуПред(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
			
		ОбластьСчетНаОплатуПред  = Макет.ПолучитьОбласть("СчетНаОплатуПред");
		
		ЭлектронноеВзаимодействие = Неопределено;	
		
		ЗаполнитьЗначенияСвойств(ОбластьСчетНаОплатуПред.Параметры,Выборка);
		ОбластьСчетНаОплатуПред.Параметры.ДатаПД 						= Формат(Выборка.ДатаПД, "ДЛФ=D");
		ОбластьСчетНаОплатуПред.Параметры.ДатаДоговора 					= Формат(Выборка.ДатаДоговора, "ДЛФ=D");
		ОбластьСчетНаОплатуПред.Параметры.ГодМесяц 						= Формат(Выборка.ПериодНачисления, "ДФ=yyyy.MM");
		ОбластьСчетНаОплатуПред.Параметры.СуммаБезНДССАвансом        	= ?(Выборка.СуммаБезНДССАвансом > 0, Выборка.СуммаБезНДССАвансом,0);
		ОбластьСчетНаОплатуПред.Параметры.СуммаНДССАвансом        		= ?(Выборка.СуммаНДССАвансом > 0, Выборка.СуммаНДССАвансом,0);
		ОбластьСчетНаОплатуПред.Параметры.СуммаСНДССАвансом        		= ?(Выборка.СуммаСНДССАвансом > 0, Выборка.СуммаСНДССАвансом,0);
		ОбластьСчетНаОплатуПред.Параметры.МесяцГодПериодаРасчета 		= СклонениеПредставленийОбъектов.ПросклонятьПредставление(Формат(Выборка.ПериодНачисления, "ДФ='MMMM'"),2) + " " + Формат(Выборка.ПериодНачисления, "ДФ='yyyy ''г.'''");
		ЭлектронноеВзаимодействие = Выборка.ЭлектронноеВзаимодействие;
		
		
		Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
			Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
				ОбластьСчетНаОплатуПред.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
				ОбластьСчетНаОплатуПред.Параметры.РуководительОрганизацииДолжность = эл.Должность;
				Если ЗначениеЗаполнено(эл.Доверенность) Тогда
					ОбластьСчетНаОплатуПред.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
				Иначе
					ОбластьСчетНаОплатуПред.Параметры.РуководительОрганизацииДоверенность = "";
				КонецЕсли;
				Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
					Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
					ОбластьСчетНаОплатуПред.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
				КонецЕсли;	
			ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
				ОбластьСчетНаОплатуПред.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
				ОбластьСчетНаОплатуПред.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
				Если ЗначениеЗаполнено(эл.Доверенность) Тогда
					ОбластьСчетНаОплатуПред.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
				Иначе
					ОбластьСчетНаОплатуПред.Параметры.ГлавныйБухгалтерДоверенность = "";
				КонецЕсли;
				Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
					Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
					ОбластьСчетНаОплатуПред.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьСчетНаОплатуПред);
		
	КонецЕсли;
	
КонецПроцедуры     

#КонецОбласти

#Область СчетНаОплатуЗаПросрочкуПлатежа

Функция ПолучитьЗапросСчетНаОплатуЗаПросрочкуПлатежа() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.НомерПД КАК НомерПД,
	|	бестПлатежныйДокумент.Дата КАК Дата,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ответственный КАК Ответственный,
	|	бестПлатежныйДокументПеня.ДнейПросрочки КАК ДнейПросрочки,
	|	бестПлатежныйДокументПеня.СуммаПени КАК СуммаПени,
	|	бестПлатежныйДокументПеня.КоэффициентЧислитель КАК КоэффициентЧислитель,
	|	бестПлатежныйДокументПеня.КоэффициентЗнаменатель КАК КоэффициентЗнаменатель,
	|	бестПлатежныйДокументПеня.ПроцентПени КАК ПроцентПени,
	|	бестПлатежныйДокументПеня.ПлатежныйДокумент.Номер КАК ПлатежныйДокументНомер,
	|	бестПлатежныйДокументПеня.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	бестПлатежныйДокументПеня.ИзначальнаяДатаНачисленияПени КАК ИзначальнаяДатаНачисленияПени,
	|	бестПлатежныйДокументПеня.СуммаЗадолженности КАК СуммаЗадолженности,
	|	бестПлатежныйДокументПеня.СтавкаРефинансирования КАК СтавкаРефинансирования,
	|	бестПлатежныйДокументПеня.ПлатежныйДокумент.Дата КАК ПлатежныйДокументДата,
	|	бестПлатежныйДокументПеня.ПлатежныйДокумент.НомерПД КАК ПлатежныйДокументНомерПД
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.бестПлатежныйДокумент.Пеня КАК бестПлатежныйДокументПеня
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументПеня.Ссылка = бестПлатежныйДокумент.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.ИНН КАК ИННОрг,
	|	Организации.КПП КАК КППОрг,
	|	Организации.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ФактическийАдресОрг,
	|	ОрганизацииКонтактнаяИнформация1.Представление КАК ЮридическийАдресОрг,
	|	энргКонтрагентыКонтактнаяИнформация.Представление КАК ФактическийАдресКонтрагента,
	|	энргКонтрагентыКонтактнаяИнформация1.Представление КАК ТелефонКонтрагента,
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	энргДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	энргЗоныОтвественности.КодРайона КАК КодРайона,
	|	энргКонтрагенты.ИНН КАК ИННКон,
	|	энргКонтрагенты.КПП КАК КППКон,
	|	ПользователиКонтактнаяИнформация.Представление КАК ОтветственныйТелефон,
	|	ПользователиКонтактнаяИнформация1.Представление КАК ОтветственныйПочта,
	|	энргДоговорыКонтрагентов.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.НомерПД КАК НомерПД,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	ДанныеДокумента.ДнейПросрочки КАК ДнейПросрочки,
	|	ДанныеДокумента.СуммаПени КАК СуммаПени,
	|	ДанныеДокумента.КоэффициентЧислитель КАК КоэффициентЧислитель,
	|	ДанныеДокумента.КоэффициентЗнаменатель КАК КоэффициентЗнаменатель,
	|	ДанныеДокумента.ПроцентПени КАК ПроцентПени,
	|	ДанныеДокумента.ПлатежныйДокументНомер КАК ПлатежныйДокументНомер,
	|	ДанныеДокумента.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	ДанныеДокумента.ИзначальнаяДатаНачисленияПени КАК ИзначальнаяДатаНачисленияПени,
	|	ДанныеДокумента.СуммаЗадолженности КАК СуммаЗадолженности,
	|	ДанныеДокумента.СтавкаРефинансирования КАК СтавкаРефинансирования,
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	КлассификаторБанков.КоррСчет КАК КоррСчет,
	|	КлассификаторБанков.Код КАК Код,
	|	ДанныеДокумента.ПлатежныйДокументДата КАК ПлатежныйДокументДата,
	|	ДанныеДокумента.ПлатежныйДокументНомерПД КАК ПлатежныйДокументНомерПД
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
	|		ПО ДанныеДокумента.Район = энргЗоныОтвественности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|				ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
	|			ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
	|		ПО ДанныеДокумента.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Организация = ОрганизацииКонтактнаяИнформация1.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|				ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|					И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация1
	|				ПО энргКонтрагенты.Ссылка = энргКонтрагентыКонтактнаяИнформация1.Ссылка
	|					И (энргКонтрагентыКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|			ПО энргДоговорыКонтрагентов.Контрагент = энргКонтрагенты.Ссылка
	|		ПО ДанныеДокумента.Договор = энргДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация1
	|		ПО ДанныеДокумента.Ответственный = ПользователиКонтактнаяИнформация1.Ссылка
	|			И (ПользователиКонтактнаяИнформация1.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ИННОрг КАК ИННОрг,
	|	Итог.КППОрг КАК КППОрг,
	|	Итог.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	|	Итог.ФактическийАдресОрг КАК ФактическийАдресОрг,
	|	Итог.ЮридическийАдресОрг КАК ЮридическийАдресОрг,
	|	Итог.ФактическийАдресКонтрагента КАК ФактическийАдресКонтрагента,
	|	Итог.ТелефонКонтрагента КАК ТелефонКонтрагента,
	|	Итог.Контрагент КАК Контрагент,
	|	Итог.НомерДоговора КАК НомерДоговора,
	|	Итог.ДатаДоговора КАК Дата,
	|	Итог.КодРайона КАК КодРайона,
	|	Итог.ИННКон КАК ИННКон,
	|	Итог.КППКон КАК КППКон,
	|	Итог.ОтветственныйТелефон КАК НомерТелефона,
	|	Итог.ОтветственныйПочта КАК ЭлектроннаяПочта,
	|	Итог.ЭлектронноеВзаимодействие КАК ЭлектронноеВзаимодействие,
	|	Итог.Ответственный КАК ОтветственныйЗаДокумент,
	|	Итог.НомерПД КАК НомерПД,
	|	Итог.Дата КАК ДатаДоговора,
	|	Итог.Банк КАК Банк,
	|	Итог.НомерСчета КАК НомерСчета,
	|	Итог.КоррСчет КАК КоррСчет,
	|	Итог.Код КАК Код
	|ИЗ
	|	Итог КАК Итог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	Итог.ИзначальнаяДатаНачисленияПени КАК ДатаНачалаРасчетаПени,
	|	Итог.ДнейПросрочки КАК КоличествоДнейРасчетаПени,
	|	Итог.СуммаЗадолженности КАК СуммаЗадолженности,
	|	Итог.СуммаПени КАК СуммаПени,
	|	Итог.ПроцентПени КАК ДоговорнаяСтавка,
	|	Итог.КоэффициентЧислитель КАК Числитель,
	|	Итог.КоэффициентЗнаменатель КАК Знаменатель,
	|	Итог.СтавкаРефинансирования КАК СтавкаРефинансирования,
	|	Итог.ПлатежныйДокументДата КАК ПериодНачисления,
	|	Итог.ПлатежныйДокументНомерПД КАК ПлатежныйДокументНомер,
	|	Итог.Дата КАК Дата
	|ИЗ
	|	Итог КАК Итог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Итог.СуммаПени) КАК Итого
	|ИЗ
	|	Итог КАК Итог";
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаполнитьСчетНаОплатуЗаПросрочкуПлатежа(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати) Экспорт 
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаШапка 			= РезультатЗапроса[2].Выбрать();
	ВыборкаОбъектРасчета 	= РезультатЗапроса[3].Выбрать();
	ВыборкаИтог 			= РезультатЗапроса[4].Выбрать();
	ЭлектронноеВзаимодействие = Неопределено;
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ТабДок.Вывести(ОбластьШапка);
		ЭлектронноеВзаимодействие = ВыборкаШапка.ЭлектронноеВзаимодействие;
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
	КонецЕсли;
	
	
	Пока ВыборкаОбъектРасчета.Следующий() Цикл
		ОбластьОбъектРасчета = Макет.ПолучитьОбласть("ОбластьРасчета");
		ЗаполнитьЗначенияСвойств(ОбластьОбъектРасчета.Параметры,ВыборкаОбъектРасчета);
		ОбластьОбъектРасчета.Параметры.ДатаНачалаРасчетаПени = Формат (ВыборкаОбъектРасчета.ДатаНачалаРасчетаПени, "ДФ=dd.MM.yyyy"); 
		ОбластьОбъектРасчета.Параметры.ДатаОкончанияРасчетаПени = Формат(КонецМесяца(ВыборкаОбъектРасчета.ДатаНачалаНачисленияПени), "ДФ=dd.MM.yyyy");
		ОбластьОбъектРасчета.Параметры.ПериодНачисления = Формат(ВыборкаОбъектРасчета.ПериодНачисления, "ДФ=dd.MM.yyyy");
		Если не ЗначениеЗаполнено(ВыборкаОбъектРасчета.ДоговорнаяСтавка) Тогда
			Ставка = ВыборкаОбъектРасчета.Числитель /ВыборкаОбъектРасчета.Знаменатель * ВыборкаОбъектРасчета.СтавкаРефинансирования;
			ОбластьОбъектРасчета.Параметры.ДоговорнаяСтавка = Формат(Ставка,"ЧЦ=5; ЧДЦ=2");
		КонецЕсли;
		ТабДок.Вывести(ОбластьОбъектРасчета);
		
	КонецЦикла;
	Пока ВыборкаИтог.Следующий() Цикл
		ОбластьИтогПоОбъектуРасчета = Макет.ПолучитьОбласть("ОбщиеИтоги");
		ЗаполнитьЗначенияСвойств(ОбластьИтогПоОбъектуРасчета.Параметры, ВыборкаИтог);
		ТабДок.Вывести(ОбластьИтогПоОбъектуРасчета);
	КонецЦикла;	
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал); 	
	
КонецПроцедуры     

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСчетФактураНаРеализацию(ИмяМакета, ПараметрыПечати)
	
	Макет 									= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." +ИмяМакета);
	
	ТабДок 									= Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы				= ОриентацияСтраницы.Ландшафт;
	ТабДок.МасштабПечати					= 55;
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 	
	
	Запрос = ПолучитьЗапросСчетФактураНаРеализацию();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.ОбъектПечати, "Дата");
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗаполнитьСчетФактуруНаРеализацию(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
	ВыборкаШапка 			= РезультатЗапроса[2].Выбрать();
	ВыборкаОбъектРасчета 	= РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогПоЕдИзм 		= РезультатЗапроса[4].Выбрать();
	ЭлектронноеВзаимодействие = Неопределено;
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ВыборкаШапка);
		ОбластьШапка.Параметры.ДатаПД = Формат(ВыборкаШапка.ДатаПД, "ДЛФ=D");
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ВыборкаШапка.ДатаДоговора, "ДЛФ=D");
		ТабДок.Вывести(ОбластьШапка);
		ЭлектронноеВзаимодействие = ВыборкаШапка.ЭлектронноеВзаимодействие;
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ВыборкаШапка);
	КонецЕсли;
	
	
	Пока ВыборкаОбъектРасчета.Следующий() Цикл
		ОбластьОбъектРасчета = Макет.ПолучитьОбласть("ОбъектРасчета");
		ОбластьОбъектРасчета.Параметры.ОбъектРасчета = ВыборкаОбъектРасчета.ОбъектРасчета;
		ТабДок.Вывести(ОбластьОбъектРасчета);
		НомерСтроки = 1;
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектРасчета.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДанныеЗадолженности = Макет.ПолучитьОбласть("ДанныеЗадолженности");
			ЗаполнитьЗначенияСвойств(ОбластьДанныеЗадолженности.Параметры,ВыборкаДетальныеЗаписи);
			ОбластьДанныеЗадолженности.Параметры.ГодМесяц = Формат(ВыборкаДетальныеЗаписи.ГодМесяц, "ДФ=yyyy.MM");
						
			ОбластьДанныеЗадолженности.Параметры.Номер = НомерСтроки;
			
			ТабДок.Вывести(ОбластьДанныеЗадолженности);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		ОбластьИтогПоОбъектуРасчета = Макет.ПолучитьОбласть("ИтогПоОбъектуРасчета");
		ЗаполнитьЗначенияСвойств(ОбластьИтогПоОбъектуРасчета.Параметры,ВыборкаОбъектРасчета);
		ТабДок.Вывести(ОбластьИтогПоОбъектуРасчета);
		
	КонецЦикла;
	
	СуммаБезНДС = 0;
	СуммаНДС 	= 0;
	СуммаСНДС 	= 0;
	
	Пока ВыборкаИтогПоЕдИзм.Следующий() Цикл
		ОбластьИтогиПоЕдИзм = Макет.ПолучитьОбласть("ИтогиПоЕдИзм");
		ЗаполнитьЗначенияСвойств(ОбластьИтогиПоЕдИзм.Параметры,ВыборкаИтогПоЕдИзм);
		ТабДок.Вывести(ОбластьИтогиПоЕдИзм);
		
		СуммаБезНДС = СуммаБезНДС + ВыборкаИтогПоЕдИзм.СуммаБезНДС;
		СуммаНДС 	= СуммаНДС + ВыборкаИтогПоЕдИзм.СуммаНДС;
		СуммаСНДС 	= СуммаСНДС + ВыборкаИтогПоЕдИзм.СуммаСНДС;
	КонецЦикла;
	
	ОбластьОбщиеИтоги = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьОбщиеИтоги.Параметры.СуммаБезНДС = СуммаБезНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаНДС = СуммаНДС;
	ОбластьОбщиеИтоги.Параметры.СуммаСНДС = СуммаСНДС;
	ТабДок.Вывести(ОбластьОбщиеИтоги); 	
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиРуководителяОрганизации.Картинка         = Картинка;
			КонецЕсли;
		ИначеЕсли эл.ВидПодписанта = Перечисления.энргВидыПодписантов.ГлавныйБухгалтер Тогда
			ОбластьПодвал.Параметры.ГлавныйБухгалтерФИО = эл.Сотрудник;
			ОбластьПодвал.Параметры.ГлавныйБухгалтерДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал.Параметры.ГлавныйБухгалтерДоверенность = "";
			КонецЕсли;
			Если ЭлектронноеВзаимодействие = Перечисления.бестВидыЭлектронногоВзаимодействия.ЭлектроннаяПочта Тогда 
				Картинка 			             = ВернутьКартинкуОбъекта(эл.Сотрудник, "ОбразецПодписи");
				ОбластьПодвал.Рисунки.ОбразецПодписиГлавногоБухгалтера.Картинка         = Картинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТабДок.Вывести(ОбластьПодвал);
	
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьИсправительнуюСФ(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок 	= Новый ТабличныйДокумент; 
	
	КорСФ 		= ПараметрыПечати.ОбъектПечати;
	Период 		= КорСФ.Дата;
	Организация = КорСФ.Организация;
	Район 		= КорСФ.Район;
	
	Запрос = ПолучитьЗапросИсправительнаяСчетФактура();	
	Запрос.УстановитьПараметр("Ссылка", 		КорСФ);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район); 	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗаполнитьИсправительнуюСчетФактуру(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);	
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьКорректировочнуюСФ(ИмяМакета, ПараметрыПечати)
	
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета); 	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.МасштабПечати = 50;
	
	КорСФ 		= ПараметрыПечати.ОбъектПечати;
	Период 		= КорСФ.Дата;
	Организация = КорСФ.Организация;
	Район 		= КорСФ.Район;
	
	Запрос = ПолучитьЗапросКорректировочнаяСчетФактура();
	Запрос.УстановитьПараметр("Ссылка", 		КорСФ);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗаполнитьКорректировочнуюСчетФактуру(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьОбъемЭЭ(Организация, Район, НачалоПериода, КонецПериода, Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестОбъемНачисленийЭлектроэнергииОбороты.ОбъемУслугиОборот КАК ОбъемУслугиОборот
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийЭлектроэнергии.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Договор = &Договор) КАК бестОбъемНачисленийЭлектроэнергииОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестОбъемНачисленийЭлектроэнергииОбороты.Услуга = энргВидыУслуг.Ссылка
	|			И (энргВидыУслуг.бестИспользоватьРасчетЭлектроэнергии
	|				И НЕ энргВидыУслуг.бестИспользоватьРасчетПоМощности
	|				И НЕ энргВидыУслуг.ИспользоватьРасчетРеактивнойЭнергии)";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ОбъемУслугиОборот;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция СформироватьСоглашениеНаКорректировку(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета); 	
	ТабДок  = Новый ТабличныйДокумент;
	
	Запрос = ПолучитьЗапросСоглашениеНаКорректировку();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();	
	Если Выборка.Следующий() Тогда
		ЗаполнитьСоглашениеНаКорректировку(ТабДок, Выборка, Макет, ПараметрыПечати);
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьАктПерерасчета(ИмяМакета, ПараметрыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок = Новый ТабличныйДокумент;	
	
	КорректировочныйПД 	= ПараметрыПечати.ОбъектПечати;
	//ДокументИсточник 	= КорректировочныйПД.ДокументИсточник; 	
	
	Запрос = ПолучитьЗапросАктПерерасчета();
	Запрос.УстановитьПараметр("Ссылка", 			КорректировочныйПД);
	//Запрос.УстановитьПараметр("ДокументИсточник", 	ДокументИсточник);
	
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьАктПерерасчета(ТабДок, Выборка, Макет, ПараметрыПечати);
		
	КонецЕсли;	
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьАктПриемаПередачи(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок 	= Новый ТабличныйДокумент;
	
	Запрос = ПолучитьЗапросАктПриемаПередачи();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ЗаполнитьАктПриемаПередачи(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьАктПриемаПередачиПоЭЭ(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок 	= Новый ТабличныйДокумент;
	
	Запрос = ПолучитьЗапросАктПриемаПередачиПоЭЭ();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	Запрос.УстановитьПараметр("Период", ПараметрыПечати.НачалоПериода);
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ЗаполнитьАктПриемаПередачиПоЭЭ(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьСчетНаПредварительнуюОплатуЭЭ(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок 	= Новый ТабличныйДокумент;
	
	Запрос = ПолучитьЗапросСчетНаПредварительнуюОплатуЭЭ();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ЗаполнитьСчетНаПредварительнуюОплатуЭЭ(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьСчетНаОстаток(ИмяМакета, ПараметрыПечати)
	
	Макет  = УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок = Новый ТабличныйДокумент; 	
	
	Запрос = ПолучитьЗапросСчетНаОстаток();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати); 	
	РезультатЗапроса = Запрос.ВыполнитьПакет(); 	
	ЗаполнитьСчетНаОстаток(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьСчетНаОплатуПост(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета); 	
	ТабДок 	= Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.МасштабПечати = 55;
	
	Запрос = ПолучитьЗапросСчетНаОплатуПост();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	Запрос.УстановитьПараметр("Организация", ПараметрыПечати.Организация);
	Запрос.УстановитьПараметр("Район", ПараметрыПечати.Район);
	Запрос.УстановитьПараметр("Период", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.ОбъектПечати, "Дата"));	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗаполнитьСчетНаОплатуПост(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции

#Область АктСверки

Функция СформироватьСчетНаОплатуПред(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок 	= Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.МасштабПечати = 55;
	
	Запрос = ПолучитьЗапросСчетНаОплатуПред();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);
	Запрос.УстановитьПараметр("Период", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.ОбъектПечати,"Дата")); 
	Запрос.УстановитьПараметр("Договор", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.ОбъектПечати,"Договор"));
	
	РезультатЗапроса = Запрос.Выполнить();	
	ЗаполнитьСчетНаОплатуПред(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);	
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьАктСверки(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Отчет.бестАктСверки." + ИмяМакета);
	ТабДок 	= Новый ТабличныйДокумент;
	
	ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыПечати.Договор, "Контрагент,Номер");
	ПолноеНаименованиеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.Организация, "НаименованиеПолное");
	ДополнительныеПараметры = Новый Структура("ДанныеКонтрагента, ПолноеНаименованиеОрганизации", ДанныеКонтрагента, ПолноеНаименованиеОрганизации);	
	ЗаполнитьАктСверки(Макет, ТабДок, ПараметрыПечати, ДополнительныеПараметры);
	
	Возврат ТабДок;
	
	//Организация 	= ПараметрыПечати.Организация;
	//Район 			= ПараметрыПечати.Район;
	//Договор 		= ПараметрыПечати.Договор;
	//НачалоПериода 	= ПараметрыПечати.НачалоПериода;
	//КонецПериода 	= ПараметрыПечати.КонецПериода;
	//
	//
	//
	////////////////////
	//ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	//
	//ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации 	= Организация.НаименованиеПолное;
	//ОбластьШапка.Параметры.Контрагент 						= Договор.Контрагент;
	//ОбластьШапка.Параметры.НомерДоговора 					= Договор.Номер;
	//
	//ТабДок.Вывести(ОбластьШапка);
	////////////////////
	//
	//Если ПараметрыПечати.ФормироватьЗаПериод Тогда
	//	
	//	ОбластьШапкаЗаПериод  = Макет.ПолучитьОбласть("ШапкаЗаПериод");
	//	
	//	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Организация, Район, НачалоПериода, Договор);
	//	
	//	Выборка = Результат.Выбрать();
	//	
	//	ФЗадолженностьНаНачало = 0;
	//	Если Выборка.Следующий() Тогда
	//		ФЗадолженностьНаНачало 	= Выборка.Сумма;
	//	КонецЕсли;
	//	
	//	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьАвансовуюЗадолженностьНаДату(Организация, Район, НачалоПериода, Договор);
	//	
	//	Выборка = Результат.Выбрать();
	//	
	//	АЗадолженностьНаНачало = 0;
	//	Если Выборка.Следующий() Тогда
	//		АЗадолженностьНаНачало 	= Выборка.Сумма;
	//	КонецЕсли;
	//	
	//	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПереплатуНаДату(Организация, Район, НачалоПериода, Договор);
	//	
	//	Выборка = Результат.Выбрать();
	//	
	//	ПереплатаНаНачало = 0;
	//	Если Выборка.Следующий() Тогда
	//		ПереплатаНаНачало 	= Выборка.Сумма;
	//	КонецЕсли;
	//			
	//	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Организация, Район, НачалоПериода, Договор);
	//	
	//	Выборка = Результат.Выбрать();
	//	
	//	ПеняНаНачало = 0;
	//	Если Выборка.Следующий() Тогда
	//		ПеняНаНачало 	= Выборка.Сумма;
	//	КонецЕсли;
	//	
	//	ОбластьШапкаЗаПериод.Параметры.ПолноеНаименованиеОрганизации 	= Организация.НаименованиеПолное;
	//	ОбластьШапкаЗаПериод.Параметры.Контрагент 						= Договор.Контрагент;
	//	ОбластьШапкаЗаПериод.Параметры.НачалоПериода 					= Формат(НачалоПериода, "ДЛФ=D");
	//	ОбластьШапкаЗаПериод.Параметры.ФактДолгНаНачало 				= ФЗадолженностьНаНачало;
	//	ОбластьШапкаЗаПериод.Параметры.АвансДолгНаНачало 				= АЗадолженностьНаНачало;
	//	ОбластьШапкаЗаПериод.Параметры.ФактПереплатаНаНачало 			= ПереплатаНаНачало;
	//	ОбластьШапкаЗаПериод.Параметры.ПеняДолгНаНачало                 = ПеняНаНачало;
	//	ОбластьШапкаЗаПериод.Параметры.СальдоНаНачало 					= ФЗадолженностьНаНачало + ПеняНаНачало - ПереплатаНаНачало;
	//	
	//	
	//	ТабДок.Вывести(ОбластьШапкаЗаПериод);
	//	
	//КонецЕсли;
	//
	////////////////////
	//ОбластьШапкаТЧ  = Макет.ПолучитьОбласть("ШапкаТЧ");
	//
	//ТабДок.Вывести(ОбластьШапкаТЧ);
	////////////////////
	//
	//Результат = бестВзаиморасчетыЮрЛицаСервер.ОплатыСФЗаПериод(Организация, Район, НачалоПериода, КонецПериода, Договор);;
	//
	//ВыборкаПлатежныйДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//СуммаДолг 	= 0;
	//СуммаОплата = 0;
	//
	//Пока ВыборкаПлатежныйДокумент.Следующий() Цикл
	//	СтрокаДатыОплат 	= "";
	//	СтрокаНомераОплат 	= "";
	//	СтрокаСуммаОплат 	= "";
	//	
	//	ОбластьСФОплаты  		= Макет.ПолучитьОбласть("СФОплаты");
	//	ОбластьИтогПоДокументу  = Макет.ПолучитьОбласть("ИтогПоДокументу");
	//	ОбластьИтогПоДокументу.Параметры.НачисленоСумма = ВыборкаПлатежныйДокумент.СуммаДолг;
	//	ОбластьИтогПоДокументу.Параметры.СуммаОплат 	= ВыборкаПлатежныйДокумент.СуммаОплаты;
	//	ОбластьИтогПоДокументу.Параметры.Сальдо 		= ВыборкаПлатежныйДокумент.СуммаДолг - ВыборкаПлатежныйДокумент.СуммаОплаты;
	//	ОбластьИтогПоДокументу.Параметры.ОснРеалПени	= ?(ЗначениеЗаполнено(ВыборкаПлатежныйДокумент.ПлатежныйДокумент) И ВыборкаПлатежныйДокумент.ПлатежныйДокумент.ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Пеня, "Пени", "Осн. реал.");
	//	
	//	СуммаДолг 	= СуммаДолг + ВыборкаПлатежныйДокумент.СуммаДолг;
	//	СуммаОплата = СуммаОплата + ВыборкаПлатежныйДокумент.СуммаОплаты;
	//	
	//	ВыборкаДетальныеЗаписи = ВыборкаПлатежныйДокумент.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаОплаты) Тогда
	//			СтрокаДатыОплат 	= СтрокаДатыОплат + Символы.ПС + Формат(ВыборкаДетальныеЗаписи.ДатаОплаты, "ДЛФ=D");
	//			СтрокаНомераОплат 	= СтрокаНомераОплат + Символы.ПС + ВыборкаДетальныеЗаписи.НомерОплаты;
	//			СтрокаСуммаОплат 	= СтрокаСуммаОплат + Символы.ПС + ВыборкаДетальныеЗаписи.СуммаОплаты;
	//		КонецЕсли;
	//	КонецЦикла;
	//	ОбластьСФОплаты.Параметры.ДатаСФ 				= Формат(ВыборкаПлатежныйДокумент.ДатаСФ, "ДЛФ=D");
	//	ОбластьСФОплаты.Параметры.НомерСФ 				= ВыборкаПлатежныйДокумент.НомерСФ;
	//	ОбластьСФОплаты.Параметры.ПериодНачисления 		= Формат(ВыборкаПлатежныйДокумент.ПериодНачисления, "ДЛФ=D");
	//	ОбластьСФОплаты.Параметры.НачисленоСумма 		= ВыборкаПлатежныйДокумент.СуммаДолг;
	//	ОбластьСФОплаты.Параметры.ДатыОплат 			= СтрокаДатыОплат;
	//	ОбластьСФОплаты.Параметры.НомераОплат 			= СтрокаНомераОплат;
	//	ОбластьСФОплаты.Параметры.СуммаОплат 			= СтрокаСуммаОплат;
	//	ОбластьСФОплаты.Параметры.Сальдо 				= ВыборкаПлатежныйДокумент.СуммаДолг - ВыборкаПлатежныйДокумент.СуммаОплаты;
	//	Если ЗначениеЗаполнено(ВыборкаПлатежныйДокумент.ДокументИсточник) Тогда
	//		ДокументИсточник = ВыборкаПлатежныйДокумент.ДокументИсточник;
	//		ОбластьСФОплаты.Параметры.НомерСФДатаСФИсточника = ДокументИсточник.НомерПД + " " + Формат(ДокументИсточник.Дата, "ДЛФ=D");
	//	КонецЕсли;
	//	ТабДок.Вывести(ОбластьСФОплаты);
	//	ТабДок.Вывести(ОбластьИтогПоДокументу);
	//КонецЦикла;
	//
	//
	////////////////////
	//ОбластьВсего  = Макет.ПолучитьОбласть("Всего");
	//ОбластьВсего.Параметры.СуммаОплат 		= СуммаОплата;
	//ОбластьВсего.Параметры.НачисленоСумма 	= СуммаДолг;
	//ОбластьВсего.Параметры.Сальдо 			= СуммаДолг - СуммаОплата;
	//ТабДок.Вывести(ОбластьВсего);
	////////////////////
	//
	//
	////////////////////
	//ОбластьАвансНаНачало  = Макет.ПолучитьОбласть("АвансНаНачало");
	//ОбластьАвансНаНачало.Параметры.ФактПереплатаНаНачало = ПереплатаНаНачало;
	//ТабДок.Вывести(ОбластьАвансНаНачало);
	////////////////////
	//
	//
	////////////////////
	//СуммаОплат = 0;
	//ОбластьАвансНаКонец   = Макет.ПолучитьОбласть("АвансНаКонец");
	//ОбластьИтогПоАвансам  = Макет.ПолучитьОбласть("ИтогПоАвансам");
	//
	//Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьРасшифровкуАвансовЗаПериод(Организация, Район, НачалоПериода, КонецПериода, Договор);
	//
	//ВыборкаДетальныеЗаписи = Результат.Выбрать();
	//
	//СтрокаДатыОплат 	= "";
	//СтрокаНомераОплат 	= "";
	//СтрокаСуммаОплат 	= "";
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	СтрокаДатыОплат 	= СтрокаДатыОплат + Символы.ПС + Формат(ВыборкаДетальныеЗаписи.ДатаОплаты, "ДЛФ=D");
	//	СтрокаНомераОплат 	= СтрокаНомераОплат + Символы.ПС + ВыборкаДетальныеЗаписи.НомерОплаты;
	//	СтрокаСуммаОплат 	= СтрокаСуммаОплат + Символы.ПС + ВыборкаДетальныеЗаписи.СуммаОплаты;
	//	СуммаОплат 			= СуммаОплат + ВыборкаДетальныеЗаписи.СуммаОплаты; 
	//КонецЦикла;
	//ОбластьАвансНаКонец.Параметры.ДатыОплат 			= СтрокаДатыОплат;
	//ОбластьАвансНаКонец.Параметры.НомераОплат 			= СтрокаНомераОплат;
	//ОбластьАвансНаКонец.Параметры.СуммаОплат 			= СтрокаСуммаОплат;
	//ТабДок.Вывести(ОбластьАвансНаКонец);
	//ОбластьИтогПоАвансам.Параметры.СуммаОплат 			= СуммаОплат;
	//ТабДок.Вывести(ОбластьИтогПоАвансам);
	////////////////////
	//
	//ОбластьОбъемЭЭ   					= Макет.ПолучитьОбласть("ОбъемЭЭ");
	//ОбластьОбъемЭЭ.Параметры.Объем 		= ПолучитьОбъемЭЭ(Организация, Район, НачалоПериода, КонецПериода, Договор);
	//ТабДок.Вывести(ОбластьОбъемЭЭ);
	//
	////////////////////
	//ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал");
	//
	//Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьНаДату(Организация, Район, КонецПериода, Договор);
	//
	//Выборка = Результат.Выбрать();
	//
	//ФЗадолженностьНаКонец = 0;
	//Если Выборка.Следующий() Тогда
	//	ФЗадолженностьНаКонец 	= Выборка.Сумма;
	//КонецЕсли;
	//
	//Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьАвансовуюЗадолженностьНаДату(Организация, Район, КонецПериода, Договор);
	//
	//Выборка = Результат.Выбрать();
	//
	//АЗадолженностьНаКонец = 0;
	//Если Выборка.Следующий() Тогда
	//	АЗадолженностьНаКонец 	= Выборка.Сумма;
	//КонецЕсли;
	//
	//Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПереплатуНаДату(Организация, Район, КонецПериода, Договор);
	//
	//Выборка = Результат.Выбрать();
	//
	//ПереплатаНаКонец = 0;
	//Если Выборка.Следующий() Тогда
	//	ПереплатаНаКонец 	= Выборка.Сумма;
	//КонецЕсли;
	//	
	//Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Организация, Район, КонецПериода, Договор);
	//
	//Выборка = Результат.Выбрать();
	//
	//ПеняНаКонец = 0;
	//Если Выборка.Следующий() Тогда
	//	ПеняНаКонец 	= Выборка.Сумма;
	//КонецЕсли;
	//
	//ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации 	= Организация.НаименованиеПолное;
	//ОбластьПодвал.Параметры.Контрагент 						= Договор.Контрагент;
	//ОбластьПодвал.Параметры.КонецПериода 					= Формат(КонецПериода, "ДЛФ=D");
	//ОбластьПодвал.Параметры.ФактДолгНаКонец 				= ФЗадолженностьНаКонец;
	//ОбластьПодвал.Параметры.АвансДолгНаКонец 				= АЗадолженностьНаКонец;
	//ОбластьПодвал.Параметры.ФактПереплатаНаКонец 			= ПереплатаНаКонец;
	//ОбластьПодвал.Параметры.ПеняДолгНаКонец 				= ПеняНаКонец;
	//ОбластьПодвал.Параметры.СальдоНаКонец 					= ФЗадолженностьНаКонец + ПеняНаКонец - ПереплатаНаКонец;
	//
	//
	//Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
	//	Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
	//		ОбластьПодвал.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
	//		ОбластьПодвал.Параметры.РуководительОрганизацииДолжность = эл.Должность;
	//		Если ЗначениеЗаполнено(эл.Доверенность) Тогда
	//			ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
	//		Иначе
	//			ОбластьПодвал.Параметры.РуководительОрганизацииДоверенность = "";
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ТабДок.Вывести(ОбластьПодвал);
	//Возврат ТабДок;
КонецФункции

Процедура ЗаполнитьАктСверки(Макет, ТабДок, ПараметрыПечати, ДополнительныеПараметры)	
	
	Организация 	= ПараметрыПечати.Организация;
	Район 			= ПараметрыПечати.Район;
	Договор 		= ПараметрыПечати.Договор;
	НачалоПериода	= Дата(1, 1, 1);
	Если ПараметрыПечати.ФормироватьЗаПериод Тогда
		НачалоПериода 	= ПараметрыПечати.НачалоПериода;
	КонецЕсли;
	КонецПериода 	= ПараметрыПечати.КонецПериода;
	Контрагент 		= ДополнительныеПараметры.ДанныеКонтрагента.Контрагент;
	Номер 			= ДополнительныеПараметры.ДанныеКонтрагента.Номер;	
	ПолноеНаименованиеОрганизации = ДополнительныеПараметры.ПолноеНаименованиеОрганизации;
	
	//////////////////
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации 	= ПолноеНаименованиеОрганизации;
	ОбластьШапка.Параметры.Контрагент 						= Контрагент;
	ОбластьШапка.Параметры.НомерДоговора 					= Номер;
	
	ТабДок.Вывести(ОбластьШапка);
	//////////////////
	
	Постфикс = "";
	
	Если ПараметрыПечати.ФормироватьЗаПериод Тогда
		
		ОбластьШапкаЗаПериод  = Макет.ПолучитьОбласть("ШапкаЗаПериод");
		
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьПоПериодам(Организация, Район, Договор,,, НачалоПериода, Истина);
		
		Выборка = Результат.Выбрать();
		
		ФЗадолженностьНаНачало = 0;
		Если Выборка.Следующий() Тогда
			ФЗадолженностьНаНачало 	= Выборка.Сумма;
		КонецЕсли;
		
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьАвансовуюЗадолженностьНаДату(Организация, Район, НачалоПериода, Договор);
		
		Выборка = Результат.Выбрать();
		
		АЗадолженностьНаНачало = 0;
		Если Выборка.Следующий() Тогда
			АЗадолженностьНаНачало 	= Выборка.Сумма;
		КонецЕсли;
		
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПереплатуНаДату(Организация, Район, НачалоПериода, Договор);
		
		Выборка = Результат.Выбрать();
		
		ПереплатаНаНачало = 0;
		Если Выборка.Следующий() Тогда
			ПереплатаНаНачало 	= Выборка.Сумма;
		КонецЕсли;
				
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Организация, Район, НачалоПериода, Договор);
		
		Выборка = Результат.Выбрать();
		
		ПеняНаНачало = 0;
		Если Выборка.Следующий() Тогда
			ПеняНаНачало 	= Выборка.Сумма;
		КонецЕсли;
		
		ОбластьШапкаЗаПериод.Параметры.ПолноеНаименованиеОрганизации 	= ПолноеНаименованиеОрганизации;
		ОбластьШапкаЗаПериод.Параметры.Контрагент 						= Контрагент;
		ОбластьШапкаЗаПериод.Параметры.НачалоПериода 					= Формат(НачалоПериода, "ДЛФ=D");
		ОбластьШапкаЗаПериод.Параметры.ФактДолгНаНачало 				= ФЗадолженностьНаНачало;
		ОбластьШапкаЗаПериод.Параметры.АвансДолгНаНачало 				= АЗадолженностьНаНачало;
		ОбластьШапкаЗаПериод.Параметры.ФактПереплатаНаНачало 			= ПереплатаНаНачало;
		ОбластьШапкаЗаПериод.Параметры.ПеняДолгНаНачало                 = ПеняНаНачало;
		ОбластьШапкаЗаПериод.Параметры.СальдоНаНачало 					= ФЗадолженностьНаНачало + ПеняНаНачало - ПереплатаНаНачало;
		
		
		ТабДок.Вывести(ОбластьШапкаЗаПериод);
	Иначе
		
		ОбластьШапкаНаДату  = Макет.ПолучитьОбласть("ШапкаНаДату");
		ОбластьШапкаНаДату.Параметры.ДатаФормирования					= Формат(КонецПериода, "ДЛФ=D");
		ТабДок.Вывести(ОбластьШапкаНаДату);
		Постфикс = "НаДату";
		
	КонецЕсли;
	
	//////////////////
	ИмяШапкаТЧ = СтрШаблон("ШапкаТЧ%1", Постфикс);
	ОбластьШапкаТЧ  = Макет.ПолучитьОбласть(ИмяШапкаТЧ);
	
	ТабДок.Вывести(ОбластьШапкаТЧ);
	//////////////////
	
	Результат = бестВзаиморасчетыЮрЛицаСервер.ОплатыСФЗаПериод(Организация, Район, НачалоПериода, КонецПериода, Договор);
	
	ВыборкаПлатежныйДокумент = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СуммаДолг 	= 0;
	СуммаОплата = 0;
	
	СтрокаДатыОплатПр 	= "";
	СтрокаНомераОплатПр = "";
	СтрокаСуммаОплатПр 	= "";
	СуммаОплатПоДокументуВнеПериода = 0;
	
	Пока ВыборкаПлатежныйДокумент.Следующий() Цикл
		СтрокаДатыОплат 	= "";
		СтрокаНомераОплат 	= "";
		СтрокаСуммаОплат 	= "";
		
		СуммаОплатПоДокументуВПериоде = 0;
		
		ВыборкаДетальныеЗаписи = ВыборкаПлатежныйДокумент.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаОплаты) Тогда
				Продолжить;
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.ПериодНачисления >= НачалоПериода Тогда
				СтрокаДатыОплат 	= СтрокаДатыОплат + Символы.ПС + Формат(ВыборкаДетальныеЗаписи.ДатаОплаты, "ДЛФ=D");
				СтрокаНомераОплат 	= СтрокаНомераОплат + Символы.ПС + ВыборкаДетальныеЗаписи.НомерОплаты;
				СтрокаСуммаОплат 	= СтрокаСуммаОплат + Символы.ПС + ВыборкаДетальныеЗаписи.СуммаОплаты;
				
				СуммаОплатПоДокументуВПериоде = СуммаОплатПоДокументуВПериоде + ВыборкаДетальныеЗаписи.СуммаОплаты;
			Иначе
				СтрокаДатыОплатПр 	= СтрокаДатыОплатПр + Символы.ПС + Формат(ВыборкаДетальныеЗаписи.ДатаОплаты, "ДЛФ=D");
				СтрокаНомераОплатПр	= СтрокаНомераОплатПр + Символы.ПС + ВыборкаДетальныеЗаписи.НомерОплаты;
				СтрокаСуммаОплатПр 	= СтрокаСуммаОплатПр + Символы.ПС + ВыборкаДетальныеЗаписи.СуммаОплаты;
				
				СуммаОплатПоДокументуВнеПериода = СуммаОплатПоДокументуВнеПериода + ВыборкаДетальныеЗаписи.СуммаОплаты;
			КонецЕсли;
		КонецЦикла;
		
		//Если ВыборкаПлатежныйДокумент.СуммаДолг = 0 И СуммаОплатПоДокументуВПериоде = 0 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ИмяСФОплаты 			= СтрШаблон("СФОплаты%1", Постфикс);
		
		ОбластьСФОплаты  		= Макет.ПолучитьОбласть(ИмяСФОплаты);
		ОбластьСФОплаты.Параметры.ДатаСФ 				= Формат(ВыборкаПлатежныйДокумент.ДатаСФ, "ДЛФ=D");
		ОбластьСФОплаты.Параметры.НомерСФ 				= ВыборкаПлатежныйДокумент.НомерСФ;
		ОбластьСФОплаты.Параметры.ПериодНачисления 		= Формат(ВыборкаПлатежныйДокумент.ПериодНачисления, "ДФ='гггг, ММ'");
		ОбластьСФОплаты.Параметры.НачисленоСумма 		= ВыборкаПлатежныйДокумент.СуммаДолг;
		ОбластьСФОплаты.Параметры.ДатыОплат 			= СтрокаДатыОплат;
		ОбластьСФОплаты.Параметры.НомераОплат 			= СтрокаНомераОплат;
		ОбластьСФОплаты.Параметры.СуммаОплат 			= СтрокаСуммаОплат;
		ОбластьСФОплаты.Параметры.Сальдо 				= Формат(ВыборкаПлатежныйДокумент.СуммаДолг - ВыборкаПлатежныйДокумент.СуммаОплаты, "ЧН=0");
		Если ЗначениеЗаполнено(ВыборкаПлатежныйДокумент.ДокументИсточник) Тогда
			ДокументИсточник = ВыборкаПлатежныйДокумент.ДокументИсточник;
			ОбластьСФОплаты.Параметры.НомерСФДатаСФИсточника = ДокументИсточник.НомерПД + " " + Формат(ДокументИсточник.Дата, "ДЛФ=D");
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСФОплаты);
		
		ИмяИтогПоДокументу 		= СтрШаблон("ИтогПоДокументу%1", Постфикс);
		
		ОбластьИтогПоДокументу  = Макет.ПолучитьОбласть(ИмяИтогПоДокументу);
		ОбластьИтогПоДокументу.Параметры.НачисленоСумма = ВыборкаПлатежныйДокумент.СуммаДолг;
		ОбластьИтогПоДокументу.Параметры.СуммаОплат 	= СуммаОплатПоДокументуВПериоде;
		ОбластьИтогПоДокументу.Параметры.Сальдо 		= Формат(ВыборкаПлатежныйДокумент.СуммаДолг - СуммаОплатПоДокументуВПериоде, "ЧН=0");
		ОбластьИтогПоДокументу.Параметры.ОснРеалПени	= ?(ЗначениеЗаполнено(ВыборкаПлатежныйДокумент.ПлатежныйДокумент) И ВыборкаПлатежныйДокумент.ПлатежныйДокумент.ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Пеня, "Пени", "Осн. реал.");
		
		ТабДок.Вывести(ОбластьИтогПоДокументу);
		
		СуммаДолг 	= СуммаДолг + ВыборкаПлатежныйДокумент.СуммаДолг;
		СуммаОплата = СуммаОплата + СуммаОплатПоДокументуВПериоде;
		
	КонецЦикла;
	                             
	
	//////////////////
	ИмяВсего = СтрШаблон("Всего%1", Постфикс);	
	ОбластьВсего  = Макет.ПолучитьОбласть(ИмяВсего);
	ОбластьВсего.Параметры.СуммаОплат 		= СуммаОплата;
	ОбластьВсего.Параметры.НачисленоСумма 	= СуммаДолг;
	ОбластьВсего.Параметры.Сальдо 			= Формат(СуммаДолг - СуммаОплата, "ЧН=0");
	ТабДок.Вывести(ОбластьВсего);
	//////////////////
	
	Если ЗначениеЗаполнено(СтрокаСуммаОплатПр) Тогда
		
		//////////////////
		ИмяОплатаПрПер = СтрШаблон("ОплатаПрПер%1", Постфикс);
		ОбластьОплатаПрПер = Макет.ПолучитьОбласть(ИмяОплатаПрПер);
		ОбластьОплатаПрПер.Параметры.ДатыОплат 		= СтрокаДатыОплатПр;
		ОбластьОплатаПрПер.Параметры.НомераОплат 	= СтрокаНомераОплатПр;
		ОбластьОплатаПрПер.Параметры.СуммаОплат 	= СтрокаСуммаОплатПр;
		ТабДок.Вывести(ОбластьОплатаПрПер);
		//////////////////
		
		//////////////////
		ИмяИтого = СтрШаблон("Итог%1", Постфикс);
		ОбластьИтого = Макет.ПолучитьОбласть(ИмяИтого);
		ОбластьИтого.Параметры.СуммаОплат = СуммаОплатПоДокументуВнеПериода;
		ТабДок.Вывести(ОбластьИтого);
		//////////////////
		
	КонецЕсли;
	
	РезультатСтруктура = бестВзаиморасчетыЮрЛицаСервер.ПолучитьРасшифровкуАвансовЗаПериод(Организация, Район, НачалоПериода, КонецПериода, Договор);
	РезультатПереплаты = РезультатСтруктура.Переплаты;
	РезультатАвансы = РезультатСтруктура.Авансы;
	
	Если Не РезультатПереплаты.Пустой() Тогда
		
		//////////////////
		СуммаОплат = 0;
		ИмяПереплата = СтрШаблон("Переплаты%1", Постфикс);
		ОбластьПереплата   = Макет.ПолучитьОбласть(ИмяПереплата);
		
		ВыборкаДетальныеЗаписи = РезультатПереплаты.Выбрать();
		
		СтрокаДатыОплат 	= "";
		СтрокаНомераОплат 	= "";
		СтрокаСуммаОплат 	= "";
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаДатыОплат 	= СтрокаДатыОплат + Символы.ПС + Формат(ВыборкаДетальныеЗаписи.ДатаОплаты, "ДЛФ=D");
			СтрокаНомераОплат 	= СтрокаНомераОплат + Символы.ПС + ВыборкаДетальныеЗаписи.НомерОплаты;
			СтрокаСуммаОплат 	= СтрокаСуммаОплат + Символы.ПС + ВыборкаДетальныеЗаписи.СуммаОплаты;
			СуммаОплат 			= СуммаОплат + ВыборкаДетальныеЗаписи.СуммаОплаты; 
		КонецЦикла;
		ОбластьПереплата.Параметры.ДатыОплат 			= СтрокаДатыОплат;
		ОбластьПереплата.Параметры.НомераОплат 			= СтрокаНомераОплат;
		ОбластьПереплата.Параметры.СуммаОплат 			= СтрокаСуммаОплат;
		ТабДок.Вывести(ОбластьПереплата);
		
		ИмяИтогПоПереплате = СтрШаблон("Итог%1", Постфикс);
		ОбластьИтогПоПереплате  = Макет.ПолучитьОбласть(ИмяИтогПоПереплате);
		ОбластьИтогПоПереплате.Параметры.СуммаОплат 	= СуммаОплат;
		ТабДок.Вывести(ОбластьИтогПоПереплате);
		//////////////////
		
	КонецЕсли;
	
	Если Не РезультатАвансы.Пустой() Тогда
		
		//////////////////
		СуммаОплат = 0;
		ИмяАвансы = СтрШаблон("Авансы%1", Постфикс);
		ОбластьАвансы = Макет.ПолучитьОбласть(ИмяАвансы);
		
		ВыборкаДетальныеЗаписи = РезультатАвансы.Выбрать();
		
		СтрокаДатыОплат 	= "";
		СтрокаНомераОплат 	= "";
		СтрокаСуммаОплат 	= "";
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаДатыОплат 	= СтрокаДатыОплат + Символы.ПС + Формат(ВыборкаДетальныеЗаписи.ДатаОплаты, "ДЛФ=D");
			СтрокаНомераОплат 	= СтрокаНомераОплат + Символы.ПС + ВыборкаДетальныеЗаписи.НомерОплаты;
			СтрокаСуммаОплат 	= СтрокаСуммаОплат + Символы.ПС + ВыборкаДетальныеЗаписи.Сумма;
			СуммаОплат 			= СуммаОплат + ВыборкаДетальныеЗаписи.Сумма; 
		КонецЦикла;
		ОбластьАвансы.Параметры.ДатыОплат 				= СтрокаДатыОплат;
		ОбластьАвансы.Параметры.НомераОплат 			= СтрокаНомераОплат;
		ОбластьАвансы.Параметры.СуммаОплат 				= СтрокаСуммаОплат;
		ТабДок.Вывести(ОбластьАвансы);
		
		ИмяИтогПоПереплате = СтрШаблон("Итог%1", Постфикс);
		ОбластьИтогПоПереплате  = Макет.ПолучитьОбласть(ИмяИтогПоПереплате);
		ОбластьИтогПоПереплате.Параметры.СуммаОплат 	= СуммаОплат;
		ТабДок.Вывести(ОбластьИтогПоПереплате);
		//////////////////
		
	КонецЕсли;
	
	//////////////////
	Если Постфикс = "" Тогда
		ОбластьОбъемЭЭ   					= Макет.ПолучитьОбласть("ОбъемЭЭ");
		ОбластьОбъемЭЭ.Параметры.Объем 		= ПолучитьОбъемЭЭ(Организация, Район, НачалоПериода, КонецПериода, Договор);
		ТабДок.Вывести(ОбластьОбъемЭЭ);
	КонецЕсли;	
	//////////////////
	
	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьПоПериодам(Организация, Район, Договор,,, КонецПериода, Истина);
	
	Выборка = Результат.Выбрать();
	
	ФЗадолженностьНаКонец = 0;
	Если Выборка.Следующий() Тогда
		ФЗадолженностьНаКонец 	= Выборка.Сумма;
	КонецЕсли;
	
	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьАвансовуюЗадолженностьНаДату(Организация, Район, КонецПериода, Договор);
	
	Выборка = Результат.Выбрать();
	
	АЗадолженностьНаКонец = 0;
	Если Выборка.Следующий() Тогда
		АЗадолженностьНаКонец 	= Выборка.Сумма;
	КонецЕсли;
	
	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПереплатуНаДату(Организация, Район, КонецПериода, Договор);
	
	Выборка = Результат.Выбрать();
	
	ПереплатаНаКонец = 0;
	Если Выборка.Следующий() Тогда
		ПереплатаНаКонец 	= Выборка.Сумма;
	КонецЕсли;
		
	Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьПенюНаДату(Организация, Район, КонецПериода, Договор);
	
	Выборка = Результат.Выбрать();
	
	ПеняНаКонец = 0;
	Если Выборка.Следующий() Тогда
		ПеняНаКонец 	= Выборка.Сумма;
	КонецЕсли;
	
	ОбластьПодвал1  = Макет.ПолучитьОбласть("Подвал1");
	ОбластьПодвал1.Параметры.Контрагент 					= Контрагент;
	ОбластьПодвал1.Параметры.КонецПериода 					= Формат(КонецПериода, "ДЛФ=D");
	ОбластьПодвал1.Параметры.ФактДолгНаКонец 				= ФЗадолженностьНаКонец;
	ТабДок.Вывести(ОбластьПодвал1);
	
	Если Постфикс = "" Тогда
		ОбластьПоСчетамЗаТекущееПотребление = Макет.ПолучитьОбласть("ПоСчетамЗаТекущееПотребление");
		ОбластьПоСчетамЗаТекущееПотребление.Параметры.АвансДолгНаКонец = АЗадолженностьНаКонец;
		ТабДок.Вывести(ОбластьПоСчетамЗаТекущееПотребление);
	КонецЕсли;
	
	ОбластьПодвал2 = Макет.ПолучитьОбласть("Подвал2");
	ОбластьПодвал2.Параметры.ФактПереплатаНаКонец 			= ПереплатаНаКонец;
	ОбластьПодвал2.Параметры.ПеняДолгНаКонец 				= ПеняНаКонец;
	ТабДок.Вывести(ОбластьПодвал2);
	
	Если Постфикс = "" Тогда
		ОбластьСальдоНаКонец = Макет.ПолучитьОбласть("СальдоНаКонец");
		ОбластьСальдоНаКонец.Параметры.СальдоНаКонец 			= ФЗадолженностьНаКонец + ПеняНаКонец - ПереплатаНаКонец;
		ОбластьСальдоНаКонец.Параметры.КонецПериода 			= Формат(КонецПериода, "ДЛФ=D");
		ТабДок.Вывести(ОбластьСальдоНаКонец);
	КонецЕсли;	
	
	ОбластьПодвал3 = Макет.ПолучитьОбласть("Подвал3");
	ОбластьПодвал3.Параметры.ПолноеНаименованиеОрганизации 	= ПолноеНаименованиеОрганизации; 
	ОбластьПодвал3.Параметры.Контрагент 					= Контрагент;
	
	Для каждого эл из ПараметрыПечати.ДанныеПодписантов Цикл
		Если эл.ВидПодписанта = Перечисления.энргВидыПодписантов.РуководительОрганизации Тогда
			ОбластьПодвал3.Параметры.РуководительОрганизацииФИО = эл.Сотрудник;
			ОбластьПодвал3.Параметры.РуководительОрганизацииДолжность = эл.Должность;
			Если ЗначениеЗаполнено(эл.Доверенность) Тогда
				ОбластьПодвал3.Параметры.РуководительОрганизацииДоверенность = "дов. №" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Номер") + " от " + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(эл.Доверенность, "Дата"), "ДЛФ=D");
			Иначе
				ОбластьПодвал3.Параметры.РуководительОрганизацииДоверенность = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал3);
		
КонецПроцедуры

#КонецОбласти

Функция СформироватьСчетНаОплатуЗаПросрочкуПлатежа(ИмяМакета, ПараметрыПечати)
	
	Макет 	= УправлениеПечатью.МакетПечатнойФормы("Документ.бестПлатежныйДокумент." + ИмяМакета);	
	ТабДок  = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.МасштабПечати = 85;
	
	Запрос = ПолучитьЗапросСчетНаОплатуЗаПросрочкуПлатежа();
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПечати.ОбъектПечати);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗаполнитьСчетНаОплатуЗаПросрочкуПлатежа(ТабДок, РезультатЗапроса, Макет, ПараметрыПечати);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#КонецЕсли