#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ЗаполнитьИтоговыеСуммы();

	Если Не ЗначениеЗаполнено(НомерПД) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(бестПлатежныйДокумент.НомерВРазрезеВидаЗадолженности) КАК НомерВРазрезеВидаЗадолженности
		|ИЗ
		|	Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		НомерВРазрезеВидаЗадолженности = 1;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НомерВРазрезеВидаЗадолженности = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НомерВРазрезеВидаЗадолженности), Число(ВыборкаДетальныеЗаписи.НомерВРазрезеВидаЗадолженности) + 1, 1);
		КонецЦикла;
		
		Если ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_СчетНаОстаток Тогда
			НомерПД = "ОС" + НомерВРазрезеВидаЗадолженности + "/" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Район,"КодРайона");
		Иначе
			НомерПД = Строка(НомерВРазрезеВидаЗадолженности) + "/" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Район,"КодРайона");
		КонецЕсли;	
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.бестВводНачальныхОстатковЮридическихЛиц") 
		ИЛИ ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_СчетНаОстаток 
		ИЛИ ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Пеня
		ИЛИ ТипЗадолженности = Перечисления.бестВидыРасчета.Авансовый Тогда
		ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты",			Истина);
	Иначе
		Если ЗначениеЗаполнено(ДокументИсточник) Тогда
			ЭтоОплата = ИтоговаяСумма < ДокументИсточник.ИтоговаяСумма;
		Иначе
			ЭтоОплата = Ложь;
		КонецЕсли;
		ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.ПустаяСсылка());
		ДополнительныеСвойства.Вставить("ЭтоОплата",			ЭтоОплата);
		ДополнительныеСвойства.Вставить("Договор",				Договор);
	КонецЕсли;
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("Ссылка") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Ссылка,Номер,Дата");
			Для каждого стр из ДанныеЗаполнения.ОсновнаяРеализация Цикл
				НовСтр = ОсновнаяРеализация.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, стр);
			КонецЦикла;
			ВидОперации		  = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Расчетный;
			
		Иначе		
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			Если Не ЗначениеЗаполнено(ПериодНачисления) И Не Организация.Пустая() Тогда
				ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Дата, Организация, Район);
			КонецЕсли;
			
			Если ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Корректировка
				Или ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Исправление Тогда
					Документы.бестПлатежныйДокумент.ЗаполнитьДанныеКорректировки(ЭтотОбъект);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.бестВводНачальныхОстатковЮридическихЛиц") Тогда
		 Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Корректировка И НЕ СоглашениеПодписано Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ не проведен: Соглашение не подписано!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если ВидОперации = Перечисления.бестВидыОпераций.ПлатежныйДокумент_Пеня Тогда
		ДанныеПени 				= ПолучитьДанныеПени();
		ВыборкаЗадолженность	= ДанныеПени.выбрать();
		
		Пока ВыборкаЗадолженность.Следующий() Цикл
			Запись 						= Движения.бестВзаиморасчетыПоПениЭЭ.ДобавитьПриход();	
			ЗаполнитьЗначенияСвойств(Запись,ВыборкаЗадолженность);		
		КонецЦикла;
	Иначе
		ДанныеЗадолженности 	= ПолучитьДанныеЗадолженности();
		ВыборкаЗадолженность	= ДанныеЗадолженности.выбрать();
		
		Пока ВыборкаЗадолженность.Следующий() Цикл
			Если ТипЗадолженности = Перечисления.бестВидыРасчета.Фактический Тогда
				Запись 						= Движения.бестВзаиморасчетыЭЭ.ДобавитьПриход();
			ИначеЕсли ТипЗадолженности = Перечисления.бестВидыРасчета.Авансовый Тогда
				Запись 						= Движения.бестВзаиморасчетыПоАвансовымСчетам.ДобавитьПриход();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Запись,ВыборкаЗадолженность);		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеЗадолженности()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Дата КАК Период,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.Сумма + ВЫБОР
	|			КОГДА НЕ бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(бестПлатежныйДокументОсновнаяРеализация.СуммаНДС) КАК СуммаНДС,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка КАК ПлатежныйДокумент,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодРасчета
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|	И НЕ бестПлатежныйДокументОсновнаяРеализация.ИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка,
	|	бестПлатежныйДокумент.ПериодНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Договор,
	|	СУММА(-бестПлатежныйДокументОсновнаяРеализация.Сумма - ВЫБОР
	|			КОГДА НЕ бестПлатежныйДокументОсновнаяРеализация.НДСВнутри
	|				ТОГДА бестПлатежныйДокументОсновнаяРеализация.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(-бестПлатежныйДокументОсновнаяРеализация.СуммаНДС),
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка,
	|	бестПлатежныйДокумент.ПериодНачисления
	|ИЗ
	|	Документ.бестПлатежныйДокумент.ОсновнаяРеализация КАК бестПлатежныйДокументОсновнаяРеализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументОсновнаяРеализация.Ссылка = бестПлатежныйДокумент.ДокументИсточник
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|	И НЕ бестПлатежныйДокументОсновнаяРеализация.ИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.Ссылка,
	|	бестПлатежныйДокумент.ПериодНачисления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ЗаполнитьИтоговыеСуммы()
	ИтоговаяСумма 		= 0;
	ИтоговаяСуммаНДС 	= 0;
	Для каждого Строка из ОсновнаяРеализация Цикл
		Если Не Строка.ИсходныеДанные Тогда
			ИтоговаяСумма = ИтоговаяСумма + Строка.Сумма
				+ ?(Строка.НДСВнутри, 0, Строка.СуммаНДС);
				
			ИтоговаяСуммаНДС = ИтоговаяСуммаНДС + Строка.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеПени()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестПлатежныйДокумент.Организация КАК Организация,
	|	бестПлатежныйДокумент.Район КАК Район,
	|	бестПлатежныйДокумент.Дата КАК Период,
	|	бестПлатежныйДокумент.Договор КАК Договор,
	|	СУММА(бестПлатежныйДокументПеня.СуммаПени) КАК Сумма,
	|	СУММА(бестПлатежныйДокументПеня.СуммаПениНДС) КАК СуммаНДС,
	|	бестПлатежныйДокументПеня.Ссылка КАК ПлатежныйДокумент,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодНачисления,
	|	бестПлатежныйДокумент.ПериодНачисления КАК ПериодРасчета
	|ИЗ
	|	Документ.бестПлатежныйДокумент.Пеня КАК бестПлатежныйДокументПеня
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	|		ПО бестПлатежныйДокументПеня.Ссылка = бестПлатежныйДокумент.Ссылка
	|ГДЕ
	|	бестПлатежныйДокумент.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежныйДокумент.Организация,
	|	бестПлатежныйДокумент.Район,
	|	бестПлатежныйДокумент.Дата,
	|	бестПлатежныйДокумент.Договор,
	|	бестПлатежныйДокументПеня.Ссылка,
	|	бестПлатежныйДокумент.ПериодНачисления,
	|	бестПлатежныйДокумент.ПериодНачисления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли