#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ЗаписьПлан 					= Движения.бестПланПогашенияРеструктуризированнойЗадолженности.Добавить();
	ЗаписьПлан.Период 			= Дата;
	ЗаписьПлан.Организация 		= Организация;
	ЗаписьПлан.Район 			= Район;
	ЗаписьПлан.Договор 			= Договор;
	Если ВидОперации = Перечисления.бестВидыОпераций.РеструктуризацияЗадолженности_РегистрацияРеструктуризации Тогда
		ЗаписьПлан.ПланПогашения 	= Новый ХранилищеЗначения(ПланПогашенияЗадолженности.Выгрузить());
		ЗаписьПлан.Состояние 			= Истина;
	КонецЕсли;
	
	
	РезультатРеструктуризированнаяЗадолженность = ПолучитьРеструктуризированнуюЗадолженность();
	бестРаботаСПараметрамиРасчетаКонтрагентовСервер.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатРеструктуризированнаяЗадолженность,					Движения.бестРеструктуризированнаяЗадолженность);
	бестРаботаСПараметрамиРасчетаКонтрагентовСервер.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатРеструктуризированнаяЗадолженность,					Движения.бестПрекращениеНачислениеПениПоРеструктуризации);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРеструктуризированнуюЗадолженность()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестРеструктуризацияЗадолженности.Организация КАК Организация,
	|	бестРеструктуризацияЗадолженности.Район КАК Район,
	|	бестРеструктуризацияЗадолженности.Договор КАК Договор,
	|	бестРеструктуризацияЗадолженности.ДатаОперации КАК Период,
	|	бестРеструктуризацияЗадолженностиДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	бестРеструктуризацияЗадолженностиДанныеЗадолженности.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ВЫБОР
	|		КОГДА бестРеструктуризацияЗадолженности.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.РеструктуризацияЗадолженности_РегистрацияРеструктуризации)
	|			ТОГДА бестРеструктуризацияЗадолженностиДанныеЗадолженности.Сумма
	|		ИНАЧЕ -бестРеструктуризацияЗадолженностиДанныеЗадолженности.Сумма
	|	КОНЕЦ КАК Сумма,
	|	бестРеструктуризацияЗадолженности.НеНачислятьПени КАК НеНачислятьПени
	|ИЗ
	|	Документ.бестРеструктуризацияЗадолженности.ДанныеЗадолженности КАК бестРеструктуризацияЗадолженностиДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРеструктуризацияЗадолженности КАК бестРеструктуризацияЗадолженности
	|		ПО бестРеструктуризацияЗадолженностиДанныеЗадолженности.Ссылка = бестРеструктуризацияЗадолженности.Ссылка
	|ГДЕ
	|	бестРеструктуризацияЗадолженности.Ссылка = &Ссылка
	|	И бестРеструктуризацияЗадолженностиДанныеЗадолженности.ВключитьВПлан";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.энргЗадачаПИД") Тогда
		Договор 	= ДанныеЗаполнения.Договор;
		Организация = ДанныеЗаполнения.Организация;
		Район 		= ДанныеЗаполнения.Район;
		ВидОперации = Перечисления.бестВидыОпераций.РеструктуризацияЗадолженности_РегистрацияРеструктуризации;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли