#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	

	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
 	ПериодРегистрации =	?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата);
	
	ДополнительныеСвойства.ПараметрыПроведения.Вставить("ПериодРегистрации",				ПериодРегистрации);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);	
	
	РезультатЗапроса 	= ПолучитьТаблицуВременногоОтсутствия();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НачалоМесяца(Выборка.НачалоПериода) = НачалоМесяца(Выборка.КонецПериода) Тогда
			НоваяСтрока = Движения.энргКоличествоДнейИспользованияУслугиПриОтключении.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Иначе
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("В строке №" + Выборка.НомерСтроки + " период поля ""Конец периода"" отличается от периода поля ""Начало периода"""));
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьТаблицуВременногоОтсутствия() Экспорт
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРегистрацияВременногоОграниченияУслуги.Район КАК Район,
		|	энргРегистрацияВременногоОграниченияУслуги.Абонент КАК Абонент,
		|	энргРегистрацияВременногоОграниченияУслуги.КлючПомещения КАК КлючПомещения,
		|	энргРегистрацияВременногоОграниченияУслуги.Организация КАК Организация,
		|	энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения.ПериодНачисления КАК ПериодНачисления,
		|	энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения.Услуга КАК Услуга,
		|	энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения.КоличествоДнейРаботы КАК Количество,
		|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор,
		|	энргКлючиПомещений.Помещение КАК Помещение,
		|	энргКлючиПомещений.Строение КАК Строение,
		|	ВЫБОР
		|		КОГДА НЕ энргРегистрацияВременногоОграниченияУслуги.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА КОНЕЦПЕРИОДА(энргРегистрацияВременногоОграниченияУслуги.ДатаФактическогоСобытия, ДЕНЬ)
		|		ИНАЧЕ энргРегистрацияВременногоОграниченияУслуги.Дата
		|	КОНЕЦ КАК Период,
		|	энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения.НачалоПериода КАК НачалоПериода,
		|	энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения.КонецПериода КАК КонецПериода,
		|	энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.энргРегистрацияВременногоОтключенияУслуги.УслугиДляОграничения КАК энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияВременногоОтключенияУслуги КАК энргРегистрацияВременногоОграниченияУслуги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|			ПО энргРегистрацияВременногоОграниченияУслуги.КлючПомещения = энргКлючиПомещений.КлючПомещения
		|		ПО энргРегистрацияВременногоОграниченияУслугиУслугиДляОграничения.Ссылка = энргРегистрацияВременногоОграниченияУслуги.Ссылка
		|ГДЕ
		|	энргРегистрацияВременногоОграниченияУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
 	Возврат РезультатЗапроса;
	
КонецФункции 

Функция ПолучитьАбонентовПлательщиков() Экспорт
	
	МассивПлательщиков = Новый Массив;
		
	Возврат МассивПлательщиков;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли