#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список поручений с отбором по договору.
//
// Параметры:
//	Договор - Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата
//
// Возвращаемое значение:
//	Массив
Функция ПолучитьСписокПорученийСОтборомПоДоговору(Договор) Экспорт
	мПоручений = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
	|ГДЕ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мПоручений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат мПоручений;
КонецФункции

// Процедура - Инициализировать данные документа
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка.бестПлатежноеПоручениеВходящееЭЭЮрЛица 
//  ДополнительныеСвойства	 - Структура 
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт 
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	Параметры	= Новый Структура;
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", "Организация"), Неопределено));
		
	Параметры.Вставить("Период"		, Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	
	РегистрыСведений.бестСтавкиНДС.СтавкаНДСОрганизации(Схема, Параметры);
	
	ИнициализироватьИсходныеДанныеДокумента(Схема);
		
	ДобавитьТекстЗапросабестВзаиморасчетыЭЭ(Схема, "бестВзаиморасчетыЭЭ");  
	ДобавитьТекстЗапросабестСуммыОплатЭЭ(Схема, "бестСуммыОплатЭЭ"); 
	
	ДобавитьТекстЗапросаПереопределяемая(Схема);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ПараметрыПроведения.Организация);
	Запрос.УстановитьПараметр("мДокументы", ДокументСсылка);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры = Неопределено) Экспорт
			
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

КонецФункции

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема) 
	ПолучитьШапкуДокумента(Схема);
	ПолучитьТаблицуОплаты(Схема); 
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Организация,
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Район КАК Район,
	|	Шапка.ИсточникПоступления КАК ИсточникПоступления,
	|	Шапка.Ссылка КАК Ссылка,
	|	СтавкаНДСОрганизации.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ РеквизитыДокумента
	|ИЗ
	|	Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкаНДСОрганизации КАК СтавкаНДСОрганизации
	|		ПО Шапка.Организация = СтавкаНДСОрганизации.Организация
	|ГДЕ
	|	Шапка.Ссылка В(&мДокументы)");	
КонецПроцедуры  

Процедура ПолучитьТаблицуОплаты(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	РеквизитыДокумента.Дата КАК Дата,
	|	РеквизитыДокумента.Организация КАК Организация,
	|	РеквизитыДокумента.ПериодНачисления КАК ПериодНачисления,
	|	РеквизитыДокумента.Район КАК Район,
	|	РеквизитыДокумента.ИсточникПоступления КАК ИсточникПоступления,
	|	ТаблицаОплаты.Ссылка КАК Ссылка,
	|	ТаблицаОплаты.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОплаты.Контрагент КАК Контрагент,
	|	ТаблицаОплаты.Договор КАК Договор,
	|	ТаблицаОплаты.СуммаОплаты КАК СуммаОплаты,
	|	ТаблицаОплаты.СуммаОплаты * РеквизитыДокумента.СтавкаНДС / (100 + РеквизитыДокумента.СтавкаНДС) КАК СуммаОплатыНДС,
	|	ТаблицаОплаты.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ТаблицаОплаты.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	ТаблицаОплаты.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
	|	ТаблицаОплаты.IDСтроки КАК IDСтроки
	|ПОМЕСТИТЬ ТаблицаОплаты
	|ИЗ
	|	Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК ТаблицаОплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыДокумента КАК РеквизитыДокумента
	|		ПО ТаблицаОплаты.Ссылка = РеквизитыДокумента.Ссылка");	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

Процедура ДобавитьТекстЗапросабестВзаиморасчетыЭЭ(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаОплаты.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаОплаты.Организация КАК Организация,
	|	ТаблицаОплаты.Район КАК Район,
	|	ТаблицаОплаты.Договор КАК Договор,
	|	СУММА(ТаблицаОплаты.СуммаОплаты) КАК Сумма,
	|	СУММА(ТаблицаОплаты.СуммаОплатыНДС) КАК СуммаНДС
	|ИЗ
	|	ТаблицаОплаты КАК ТаблицаОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОплаты.Организация,
	|	ТаблицаОплаты.Договор,
	|	ТаблицаОплаты.Дата,
	|	ТаблицаОплаты.Район";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросабестСуммыОплатЭЭ(Схема, ИмяРегистра)
		
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ТаблицаОплаты.Дата КАК Период,
	|	ТаблицаОплаты.Организация КАК Организация,
	|	ТаблицаОплаты.Район КАК Район,
	|	ТаблицаОплаты.Договор КАК Договор,
	|	ТаблицаОплаты.ИсточникПоступления КАК ИсточникПоступления,
	|	СУММА(ТаблицаОплаты.СуммаОплаты) КАК Сумма,
	|	СУММА(ТаблицаОплаты.СуммаОплатыНДС) КАК СуммаНДС
	|ИЗ
	|	ТаблицаОплаты КАК ТаблицаОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОплаты.Организация,
	|	ТаблицаОплаты.Договор,
	|	ТаблицаОплаты.Дата,
	|	ТаблицаОплаты.Район,
	|	ТаблицаОплаты.ИсточникПоступления";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПереопределяемая(Схема)
	// Процедура для добавления новых движений в расширениях проектов	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли