#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  		= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;
		
	ДополнительныеСвойства.Вставить("НачалоПериодаРасчета",	 НачалоПериодаРасчета);
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	 Справочники.энргИсточникиПоступления.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("МассивОбъектовРасчета", Истина);
	ДополнительныеСвойства.Вставить("ДанныеОплаты",			 ДанныеОплаты(НачалоПериодаРасчета));
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДополнительныеСвойства.Вставить("НеРегестрироватьВзаиморасчеты", Истина);
	КонецЕсли;
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.бестВводНачальныхОстатковЮридическихЛиц")
		И ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	 
	ПроверитьСуммы(Отказ);
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Документы.бестПлатежноеПоручениеВходящееЭЭЮрЛица.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	бестПроведениеСерверНП.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеОплаты(НачалоПериодаРасчета) Экспорт
				
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",	НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Договор КАК Договор,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Организация КАК Организация,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Район КАК Район,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.СуммаОплаты) КАК Сумма,
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ КАК Период,
	|	ИСТИНА КАК ЭтоОплата
	|ИЗ
	|	Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица КАК бестПлатежноеПоручениеВходящееЭЭЮрЛица
	|		ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = бестПлатежноеПоручениеВходящееЭЭЮрЛица.Ссылка
	|ГДЕ
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Договор,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Организация,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.Район,
	|	бестПлатежноеПоручениеВходящееЭЭЮрЛица.ПериодНачисления,
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента < &НачалоПериодаРасчета
	|			ТОГДА &НачалоПериодаРасчета
	|		ИНАЧЕ бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента
	|	КОНЕЦ";
	

	Результат  		= Запрос.Выполнить();
	Возврат Результат;	 
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСуммы(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.СуммаОплаты КАК СуммаОплаты,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки КАК IDСтроки,
		|	СУММА(бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.СуммаОплаты) КАК СуммаОплатыНазначения
		|ПОМЕСТИТЬ СуммыОплат
		|ИЗ
		|	Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.ДокументыНачисления КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления
		|		ПО бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.Ссылка
		|			И бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки = бестПлатежноеПоручениеВходящееЭЭЮрЛицаДокументыНачисления.IDСтроки
		|ГДЕ
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.СуммаОплаты,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СуммыОплат.СуммаОплаты КАК СуммаОплаты,
		|	СуммыОплат.IDСтроки КАК IDСтроки,
		|	СуммыОплат.СуммаОплатыНазначения КАК СуммаОплатыНазначения
		|ИЗ
		|	СуммыОплат КАК СуммыОплат
		|ГДЕ
		|	СуммыОплат.СуммаОплатыНазначения > СуммыОплат.СуммаОплаты";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Распределенная сумма больше суммы оплаты.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли