#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ценовую категорию.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  МКД				-	СправочникСсылка.энргСтроения.
//  ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   ПеречисленияСсылка.бестЦеновыеКатегории.
//
Функция ПолучитьЦеновуюКатегорию(Период, Организация, Район, МКД, ОбъектРасчета, ТочкаУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория
		|ИЗ
		|	РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("МКД", МКД);
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЦеноваяКатегория;
	КонецЦикла;
	
	Возврат Перечисления.бестЦеновыеКатегории.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли