#Область ОписаниеПеременных

Перем ПериодНачисления Экспорт; // Период начисления услуги 
Перем Организация Экспорт; // Организация предоставляющая услуги
Перем Район Экспорт; // Район, в котором оказывается услуга
Перем ЧастныйСектор Экспорт; // Булево - Является ли строение частным сектором
Перем Строение Экспорт; // Адрес, по которому оказавается услуга
Перем Помещение Экспорт; // Помещение, в котором оказывается услуга
Перем Строения Экспорт; // Строения для изменения структуры запроса
Перем МенеджерыРегистров; 
Перем СписокСвойствСтрокиТЗ; 
Перем СтатическийКонтекст;
Перем ДанныеМаксимальногоПотребления;
Перем ОбщееОписаниеДокумента;
Перем ЗапросПоказанийПодчиненногоРегистра;
Перем ЗапросПоследовательности;
Перем Ошибки;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВосстановитьПоследовательность() Экспорт 
		
	Если НЕ РазрешеноВыполнятьОперацию() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатИнициализации = ИнициализироватьДанныеВосстановления();		
	
	Выборка = РезультатИнициализации.ВыборкаПоказания;
	Если Выборка.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	ИнициализироватьОбщиеПеременные(РезультатИнициализации);
	ОбработатьДанные(Ошибки, РезультатИнициализации);
	
	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Ошибки, Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьМенеджерыРегистров()

	Результат = Новый Структура;
	Результат.Вставить("энргПоказанияПУПоследовательность", РегистрыСведений.энргПоказанияПУПоследовательность);
	Результат.Вставить("энргПредоставленныеПоказания", РегистрыСведений.энргПредоставленныеПоказания);
	Результат.Вставить("энргРасчетСреднегоОбъема", РегистрыСведений.энргРасчетСреднегоОбъема);
	Результат.Вставить("энргМаксимальныеПоказания", РегистрыСведений.энргМаксимальныеПоказания);
	Результат.Вставить("энргМаксимальныеПоказанияСрез", РегистрыСведений.энргМаксимальныеПоказанияСрез);
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьОбщиеПеременные(РезультатИнициализации)

	Ошибки = Новый Массив;
	МенеджерыРегистров = ИнициализироватьМенеджерыРегистров();
	ИнициализироватьЗапросПоказанийПодчиненногоРегистра();
	ИнициализироватьЗапросПоследовательности();
	СтатическийКонтекст = СтатичныеДополнительныеПараметрыПоказаний(РезультатИнициализации.ПериодыПриемаПоказаний);
	ДанныеМаксимальногоПотребления = РезультатИнициализации.ДанныеМаксимальногоПотребления;
	ОбщееОписаниеДокумента = ОбщееОписаниеСостоянияДокумента();	
	
	СписокСвойствСтрокиТЗ = "КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,НедопускПрибора
	|,СостояниеПоказаний,ПричинаОтклонения,Переворот,НомерСтрокиТЧ,Разделитель
	|,МаксимальноВозможныеПоказания,КоэффициентПУ,ИмяТабЧасти,КС";
	
КонецПроцедуры

#Область Валидация

Функция РазрешеноВыполнятьОперацию()
	
	Если НЕ ЗначениеЗаполнено(ПериодНачисления) ИЛИ НЕ ЗначениеЗаполнено(Район) тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектПроверки = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ОбъектПроверки.Организация	= Организация;
	ОбъектПроверки.Дата			= ПериодНачисления;
	ОбъектПроверки.Район		= Район;
	
	Отказ = энргДатыЗапретаИзмененияПереопределяемый.ЗапрещеноИзменятьДанные(ОбъектПроверки);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Для пользователя " + Пользователи.ТекущийПользователь() + 
			" район " + Район + " период " + ПериодНачисления + 
			" закрыт для редактирования");
	КонецЕсли;
		
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанных

Функция ИнициализироватьДанныеВосстановления()
		
	ГраницыПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления); 	
	
	Отбор = Новый Структура;
	Отбор.Вставить("НачалоПериодаРасчета"	, ГраницыПериода.НачалоОП);
	Отбор.Вставить("КонецПериодаРасчета"	, ГраницыПериода.ЗавершениеОП);
	Отбор.Вставить("ПриборУчета"			, Неопределено);
	Отбор.Вставить("КолвоНедопусковПодряд"	, энргРаботаСКонстантами.ЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний());	
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	РезультатПоказания = РезультатЗапросаПоказанияПУ(МВТ, Отбор);
	ВыборкаПоказания = РезультатПоказания.Выбрать();
	
	ДанныеМаксимальногоПотребления = ДанныеМаксимальногоПотребления(Отбор.НачалоПериодаРасчета);
	
	РезультатСреднийОбъем	= РезультатСреднийОбъемПотребления(МВТ, Отбор);
	ВыборкаСреднийОбъем 	= РезультатСреднийОбъем.Выбрать();
	
	//МВТ.Закрыть();
	
	ПериодыПриемаПоказаний 	= РегистрыСведений.энргПериодыПриемаПоказаний.ПолучитьПоследнее(ПериодНачисления, Новый Структура("Организация", Организация));
	
	Результат = Новый Структура;
	Результат.Вставить("НачалоПериодаРасчета", Отбор.НачалоПериодаРасчета);
	Результат.Вставить("ВыборкаПоказания", ВыборкаПоказания);
	Результат.Вставить("ДанныеМаксимальногоПотребления", ДанныеМаксимальногоПотребления);
	Результат.Вставить("ВыборкаСреднийОбъем", ВыборкаСреднийОбъем);
	Результат.Вставить("ПериодыПриемаПоказаний", ПериодыПриемаПоказаний);
	
	Возврат Результат;
	
КонецФункции

Функция РезультатЗапросаПоказанияПУ(МВТ, Отбор) 
	
	Запрос  = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Текст =
	"ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МинимальныйПериод
	|ИЗ
	|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|ГДЕ
	|	энргПоказанияПУПоследовательность.Организация = &Организация
	|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
	|	И энргПоказанияПУПоследовательность.Район = &Район
	|	И энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности))
	|	И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор
	|	И энргПоказанияПУПоследовательность.Строение = &Строение
	|	И энргПоказанияПУПоследовательность.Помещение = &Помещение
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПУПоследовательность.Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение,
	|	энргПоказанияПУПоследовательность.Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныйПериод.Организация КАК Организация,
	|	МинимальныйПериод.ПериодНачисления КАК ПериодНачисления,
	|	МинимальныйПериод.Район КАК Район,
	|	МинимальныйПериод.ЧастныйСектор КАК ЧастныйСектор,
	|	МинимальныйПериод.Строение КАК Строение,
	|	МинимальныйПериод.Помещение КАК Помещение,
	|	МинимальныйПериод.ПриборУчета КАК ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации КАК ПериодРегистрации,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МинимальнаяДатаРегистратора
	|ИЗ
	|	МинимальныйПериод КАК МинимальныйПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО МинимальныйПериод.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальныйПериод.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальныйПериод.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальныйПериод.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И МинимальныйПериод.Строение = энргПоказанияПУПоследовательность.Строение
	|			И МинимальныйПериод.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И МинимальныйПериод.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальныйПериод.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныйПериод.Организация,
	|	МинимальныйПериод.ПериодНачисления,
	|	МинимальныйПериод.Район,
	|	МинимальныйПериод.ЧастныйСектор,
	|	МинимальныйПериод.Строение,
	|	МинимальныйПериод.Помещение,
	|	МинимальныйПериод.ПриборУчета,
	|	МинимальныйПериод.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальнаяДатаРегистратора.Организация КАК Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления КАК ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район КАК Район,
	|	МинимальнаяДатаРегистратора.ЧастныйСектор КАК ЧастныйСектор,
	|	МинимальнаяДатаРегистратора.Строение КАК Строение,
	|	МинимальнаяДатаРегистратора.Помещение КАК Помещение,
	|	МинимальнаяДатаРегистратора.ПриборУчета КАК ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации КАК ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора КАК ДатаРегистратора,
	|	МИНИМУМ(энргПоказанияПУПоследовательность.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МинимальныйРегистратор
	|ИЗ
	|	МинимальнаяДатаРегистратора КАК МинимальнаяДатаРегистратора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО МинимальнаяДатаРегистратора.Организация = энргПоказанияПУПоследовательность.Организация
	|			И МинимальнаяДатаРегистратора.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И МинимальнаяДатаРегистратора.Район = энргПоказанияПУПоследовательность.Район
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|			И МинимальнаяДатаРегистратора.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И МинимальнаяДатаРегистратора.Строение = энргПоказанияПУПоследовательность.Строение
	|			И МинимальнаяДатаРегистратора.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И МинимальнаяДатаРегистратора.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И МинимальнаяДатаРегистратора.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальнаяДатаРегистратора.Организация,
	|	МинимальнаяДатаРегистратора.ПериодНачисления,
	|	МинимальнаяДатаРегистратора.Район,
	|	МинимальнаяДатаРегистратора.ЧастныйСектор,
	|	МинимальнаяДатаРегистратора.Строение,
	|	МинимальнаяДатаРегистратора.Помещение,
	|	МинимальнаяДатаРегистратора.ПриборУчета,
	|	МинимальнаяДатаРегистратора.ПериодРегистрации,
	|	МинимальнаяДатаРегистратора.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ЧастныйСектор КАК ЧастныйСектор,
	|	ВложенныйЗапрос.Строение КАК Строение,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ДатаРегистратора КАК ДатаРегистратора,
	|	ВложенныйЗапрос.ДокРегистратор КАК ДокРегистратор,
	|	ВложенныйЗапрос.Разделитель КАК Разделитель,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрацииПоказаний,
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения
	|ПОМЕСТИТЬ Граница
	|ИЗ
	|	(ВЫБРАТЬ
	|		МинимальныйРегистратор.Организация КАК Организация,
	|		МинимальныйРегистратор.ПериодНачисления КАК ПериодНачисления,
	|		МинимальныйРегистратор.Район КАК Район,
	|		МинимальныйРегистратор.ЧастныйСектор КАК ЧастныйСектор,
	|		МинимальныйРегистратор.Строение КАК Строение,
	|		МинимальныйРегистратор.Помещение КАК Помещение,
	|		МинимальныйРегистратор.ПриборУчета КАК ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации КАК ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора КАК ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор КАК ДокРегистратор,
	|		МИНИМУМ(энргПоказанияПУПоследовательность.Разделитель) КАК Разделитель
	|	ИЗ
	|		МинимальныйРегистратор КАК МинимальныйРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|			ПО МинимальныйРегистратор.Организация = энргПоказанияПУПоследовательность.Организация
	|				И МинимальныйРегистратор.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|				И МинимальныйРегистратор.Район = энргПоказанияПУПоследовательность.Район
	|				И МинимальныйРегистратор.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|				И МинимальныйРегистратор.Строение = энргПоказанияПУПоследовательность.Строение
	|				И МинимальныйРегистратор.Помещение = энргПоказанияПУПоследовательность.Помещение
	|				И МинимальныйРегистратор.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|				И МинимальныйРегистратор.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|				И МинимальныйРегистратор.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|				И (энргПоказанияПУПоследовательность.СостояниеПроведения В (ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности), ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности)))
	|				И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|				И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|				И (энргПоказанияПУПоследовательность.Район = &Район)
	|				И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|				И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|				И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимальныйРегистратор.Организация,
	|		МинимальныйРегистратор.ПериодНачисления,
	|		МинимальныйРегистратор.Район,
	|		МинимальныйРегистратор.ЧастныйСектор,
	|		МинимальныйРегистратор.Строение,
	|		МинимальныйРегистратор.Помещение,
	|		МинимальныйРегистратор.ПриборУчета,
	|		МинимальныйРегистратор.ПериодРегистрации,
	|		МинимальныйРегистратор.ДатаРегистратора,
	|		МинимальныйРегистратор.ДокРегистратор) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО ВложенныйЗапрос.Строение = энргКлючиПомещений.Строение
	|			И ВложенныйЗапрос.Помещение = энргКлючиПомещений.Помещение
	|			И (энргКлючиПомещений.Строение = &Строение)
	|			И (энргКлючиПомещений.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ НаборПроведенныхВПоследовательности
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И Граница.Строение = энргПоказанияПУПоследовательность.Строение
	|			И Граница.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель > энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор > энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора > энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации > энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности))
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборПроведенныхВПоследовательности.Организация КАК Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления КАК ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район КАК Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.ЧастныйСектор КАК ЧастныйСектор,
	|	НаборПроведенныхВПоследовательности.Строение КАК Строение,
	|	НаборПроведенныхВПоследовательности.Помещение КАК Помещение,
	|	НаборПроведенныхВПоследовательности.ПриборУчета КАК ПриборУчета,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ПериодРегистрации) КАК ПериодРегистрации
	|ПОМЕСТИТЬ МаксимальныйПериодРегистрацииПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборПроведенныхВПоследовательности.Организация,
	|	НаборПроведенныхВПоследовательности.ПериодНачисления,
	|	НаборПроведенныхВПоследовательности.Район,
	|	НаборПроведенныхВПоследовательности.СостояниеПроведения,
	|	НаборПроведенныхВПоследовательности.ЧастныйСектор,
	|	НаборПроведенныхВПоследовательности.Строение,
	|	НаборПроведенныхВПоследовательности.Помещение,
	|	НаборПроведенныхВПоследовательности.ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйПериодРегистрацииПроведенных.Организация КАК Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район КАК Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйПериодРегистрацииПроведенных.Строение КАК Строение,
	|	МаксимальныйПериодРегистрацииПроведенных.Помещение КАК Помещение,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДатаРегистратора) КАК ДатаРегистратора
	|ПОМЕСТИТЬ МаксимальнаяДатаПроведенных
	|ИЗ
	|	НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериодРегистрацииПроведенных КАК МаксимальныйПериодРегистрацииПроведенных
	|		ПО НаборПроведенныхВПоследовательности.Организация = МаксимальныйПериодРегистрацииПроведенных.Организация
	|			И НаборПроведенныхВПоследовательности.ПериодНачисления = МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления
	|			И НаборПроведенныхВПоследовательности.Район = МаксимальныйПериодРегистрацииПроведенных.Район
	|			И НаборПроведенныхВПоследовательности.СостояниеПроведения = МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения
	|			И НаборПроведенныхВПоследовательности.ЧастныйСектор = МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор
	|			И НаборПроведенныхВПоследовательности.Строение = МаксимальныйПериодРегистрацииПроведенных.Строение
	|			И НаборПроведенныхВПоследовательности.Помещение = МаксимальныйПериодРегистрацииПроведенных.Помещение
	|			И НаборПроведенныхВПоследовательности.ПриборУчета = МаксимальныйПериодРегистрацииПроведенных.ПриборУчета
	|			И НаборПроведенныхВПоследовательности.ПериодРегистрации = МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйПериодРегистрацииПроведенных.Организация,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодНачисления,
	|	МаксимальныйПериодРегистрацииПроведенных.Район,
	|	МаксимальныйПериодРегистрацииПроведенных.СостояниеПроведения,
	|	МаксимальныйПериодРегистрацииПроведенных.ЧастныйСектор,
	|	МаксимальныйПериодРегистрацииПроведенных.Строение,
	|	МаксимальныйПериодРегистрацииПроведенных.Помещение,
	|	МаксимальныйПериодРегистрацииПроведенных.ПриборУчета,
	|	МаксимальныйПериодРегистрацииПроведенных.ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаПроведенных.Организация КАК Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район КАК Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальнаяДатаПроведенных.Строение КАК Строение,
	|	МаксимальнаяДатаПроведенных.Помещение КАК Помещение,
	|	МаксимальнаяДатаПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.ДокРегистратор) КАК ДокРегистратор
	|ПОМЕСТИТЬ МаксимальныйРегистраторПроведенных
	|ИЗ
	|	МаксимальнаяДатаПроведенных КАК МаксимальнаяДатаПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальнаяДатаПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальнаяДатаПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальнаяДатаПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальнаяДатаПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальнаяДатаПроведенных.ЧастныйСектор = НаборПроведенныхВПоследовательности.ЧастныйСектор
	|			И МаксимальнаяДатаПроведенных.Строение = НаборПроведенныхВПоследовательности.Строение
	|			И МаксимальнаяДатаПроведенных.Помещение = НаборПроведенныхВПоследовательности.Помещение
	|			И МаксимальнаяДатаПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальнаяДатаПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальнаяДатаПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаПроведенных.Организация,
	|	МаксимальнаяДатаПроведенных.ПериодНачисления,
	|	МаксимальнаяДатаПроведенных.Район,
	|	МаксимальнаяДатаПроведенных.СостояниеПроведения,
	|	МаксимальнаяДатаПроведенных.ЧастныйСектор,
	|	МаксимальнаяДатаПроведенных.Строение,
	|	МаксимальнаяДатаПроведенных.Помещение,
	|	МаксимальнаяДатаПроведенных.ПриборУчета,
	|	МаксимальнаяДатаПроведенных.ПериодРегистрации,
	|	МаксимальнаяДатаПроведенных.ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРегистраторПроведенных.Организация КАК Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район КАК Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения КАК СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйРегистраторПроведенных.Строение КАК Строение,
	|	МаксимальныйРегистраторПроведенных.Помещение КАК Помещение,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета КАК ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации КАК ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора КАК ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор КАК ДокРегистратор,
	|	МАКСИМУМ(НаборПроведенныхВПоследовательности.Разделитель) КАК Разделитель
	|ПОМЕСТИТЬ МаксимальныйРазделительПроведенных
	|ИЗ
	|	МаксимальныйРегистраторПроведенных КАК МаксимальныйРегистраторПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборПроведенныхВПоследовательности КАК НаборПроведенныхВПоследовательности
	|		ПО МаксимальныйРегистраторПроведенных.Организация = НаборПроведенныхВПоследовательности.Организация
	|			И МаксимальныйРегистраторПроведенных.ПериодНачисления = НаборПроведенныхВПоследовательности.ПериодНачисления
	|			И МаксимальныйРегистраторПроведенных.Район = НаборПроведенныхВПоследовательности.Район
	|			И МаксимальныйРегистраторПроведенных.СостояниеПроведения = НаборПроведенныхВПоследовательности.СостояниеПроведения
	|			И МаксимальныйРегистраторПроведенных.ЧастныйСектор = НаборПроведенныхВПоследовательности.ЧастныйСектор
	|			И МаксимальныйРегистраторПроведенных.Строение = НаборПроведенныхВПоследовательности.Строение
	|			И МаксимальныйРегистраторПроведенных.Помещение = НаборПроведенныхВПоследовательности.Помещение
	|			И МаксимальныйРегистраторПроведенных.ПриборУчета = НаборПроведенныхВПоследовательности.ПриборУчета
	|			И МаксимальныйРегистраторПроведенных.ПериодРегистрации = НаборПроведенныхВПоследовательности.ПериодРегистрации
	|			И МаксимальныйРегистраторПроведенных.ДатаРегистратора = НаборПроведенныхВПоследовательности.ДатаРегистратора
	|			И МаксимальныйРегистраторПроведенных.ДокРегистратор = НаборПроведенныхВПоследовательности.ДокРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныйРегистраторПроведенных.Организация,
	|	МаксимальныйРегистраторПроведенных.ПериодНачисления,
	|	МаксимальныйРегистраторПроведенных.Район,
	|	МаксимальныйРегистраторПроведенных.СостояниеПроведения,
	|	МаксимальныйРегистраторПроведенных.ЧастныйСектор,
	|	МаксимальныйРегистраторПроведенных.Строение,
	|	МаксимальныйРегистраторПроведенных.Помещение,
	|	МаксимальныйРегистраторПроведенных.ПриборУчета,
	|	МаксимальныйРегистраторПроведенных.ПериодРегистрации,
	|	МаксимальныйРегистраторПроведенных.ДатаРегистратора,
	|	МаксимальныйРегистраторПроведенных.ДокРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйРазделительПроведенных.Организация КАК Организация,
	|	МаксимальныйРазделительПроведенных.ПериодНачисления КАК ПериодНачисления,
	|	МаксимальныйРазделительПроведенных.Район КАК Район,
	|	МаксимальныйРазделительПроведенных.ЧастныйСектор КАК ЧастныйСектор,
	|	МаксимальныйРазделительПроведенных.Строение КАК Строение,
	|	МаксимальныйРазделительПроведенных.Помещение КАК Помещение,
	|	МаксимальныйРазделительПроведенных.ПриборУчета КАК ПриборУчета,
	|	энргПредоставленныеПоказания.Шкала КАК Шкала,
	|	энргПредоставленныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксимальныйРазделительПроведенных.Разделитель КАК Разделитель,
	|	энргПредоставленныеПоказания.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ПоследниеНомераПозиции
	|ИЗ
	|	МаксимальныйРазделительПроведенных КАК МаксимальныйРазделительПроведенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПредоставленныеПоказания КАК энргПредоставленныеПоказания
	|		ПО МаксимальныйРазделительПроведенных.Организация = энргПредоставленныеПоказания.Организация
	|			И МаксимальныйРазделительПроведенных.ПериодНачисления = энргПредоставленныеПоказания.ПериодНачисления
	|			И МаксимальныйРазделительПроведенных.Район = энргПредоставленныеПоказания.Район
	|			И МаксимальныйРазделительПроведенных.ЧастныйСектор = энргПредоставленныеПоказания.ЧастныйСектор
	|			И МаксимальныйРазделительПроведенных.Строение = энргПредоставленныеПоказания.Строение
	|			И МаксимальныйРазделительПроведенных.Помещение = энргПредоставленныеПоказания.Помещение
	|			И МаксимальныйРазделительПроведенных.ПриборУчета = энргПредоставленныеПоказания.ПриборУчета
	|			И МаксимальныйРазделительПроведенных.ПериодРегистрации = энргПредоставленныеПоказания.ДатаРегистратора
	|			И МаксимальныйРазделительПроведенных.ДокРегистратор = энргПредоставленныеПоказания.ДокРегистратор
	|			И МаксимальныйРазделительПроведенных.Разделитель = энргПредоставленныеПоказания.Разделитель
	|			И (энргПредоставленныеПоказания.Организация = &Организация)
	|			И (энргПредоставленныеПоказания.ПериодНачисления = &ПериодНачисления)
	|			И (энргПредоставленныеПоказания.Район = &Район)
	|			И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПредоставленныеПоказания.Строение = &Строение)
	|			И (энргПредоставленныеПоказания.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор КАК ДокРегистратор,
	|	Граница.Разделитель КАК Разделитель,
	|	МАКСИМУМ(энргМаксимальныеПоказания.Период) КАК ПериодМаксПоказаний
	|ПОМЕСТИТЬ МаксПерПоказаний
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО Граница.Организация = энргМаксимальныеПоказания.Организация
	|			И Граница.Район = энргМаксимальныеПоказания.Район
	|			И Граница.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И Граница.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор = энргМаксимальныеПоказания.ДокРегистратор
	|						И Граница.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И Граница.ДокРегистратор > энргМаксимальныеПоказания.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	Граница.ПериодРегистрацииПоказаний,
	|	Граница.ДокРегистратор,
	|	Граница.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний КАК ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор КАК ДокРегистратор,
	|	МаксПерПоказаний.Разделитель КАК Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	МАКСИМУМ(энргМаксимальныеПоказания.ДокРегистратор) КАК РегистраторМаксПоказаний
	|ПОМЕСТИТЬ РегМакПок
	|ИЗ
	|	МаксПерПоказаний КАК МаксПерПоказаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО МаксПерПоказаний.Организация = энргМаксимальныеПоказания.Организация
	|			И МаксПерПоказаний.Район = энргМаксимальныеПоказания.Район
	|			И МаксПерПоказаний.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И МаксПерПоказаний.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И МаксПерПоказаний.Шкала = энргМаксимальныеПоказания.Шкала
	|			И МаксПерПоказаний.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И МаксПерПоказаний.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И (ВЫБОР
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор = энргМаксимальныеПоказания.ДокРегистратор
	|						И МаксПерПоказаний.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА МаксПерПоказаний.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И МаксПерПоказаний.ДокРегистратор > энргМаксимальныеПоказания.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ МаксПерПоказаний.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	МаксПерПоказаний.ПериодРегистрацииПоказаний,
	|	МаксПерПоказаний.ДокРегистратор,
	|	МаксПерПоказаний.Разделитель,
	|	МаксПерПоказаний.ПериодМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Организация КАК Организация,
	|	энргМаксимальныеПоказания.Район КАК Район,
	|	энргМаксимальныеПоказания.КлючПомещения КАК КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета КАК ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала КАК Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	МАКСИМУМ(ЕСТЬNULL(энргМаксимальныеПоказания.Разделитель, 0)) КАК РазделительМаксПоказаний
	|ПОМЕСТИТЬ РазделительМакПок
	|ИЗ
	|	РегМакПок КАК РегМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО РегМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РегМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РегМакПок.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И РегМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РегМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РегМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РегМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РегМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.ДокРегистратор
	|			И (ВЫБОР
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор = энргМаксимальныеПоказания.ДокРегистратор
	|						И РегМакПок.Разделитель > энргМаксимальныеПоказания.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА РегМакПок.ПериодРегистрацииПоказаний = энргМаксимальныеПоказания.Период
	|						И РегМакПок.ДокРегистратор > энргМаксимальныеПоказания.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ РегМакПок.ПериодРегистрацииПоказаний > энргМаксимальныеПоказания.Период
	|			КОНЕЦ)
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргМаксимальныеПоказания.Организация,
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.КлючПомещения,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Шкала,
	|	энргМаксимальныеПоказания.ТарифнаяЗона,
	|	РегМакПок.ПериодМаксПоказаний,
	|	РегМакПок.РегистраторМаксПоказаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазделительМакПок.Организация КАК Организация,
	|	РазделительМакПок.Район КАК Район,
	|	РазделительМакПок.КлючПомещения КАК КлючПомещения,
	|	РазделительМакПок.ПриборУчета КАК ПриборУчета,
	|	РазделительМакПок.Шкала КАК Шкала,
	|	РазделительМакПок.ТарифнаяЗона КАК ТарифнаяЗона,
	|	РазделительМакПок.ПериодМаксПоказаний КАК ПериодМаксПоказаний,
	|	РазделительМакПок.РегистраторМаксПоказаний КАК РегистраторМаксПоказаний,
	|	энргМаксимальныеПоказания.ДатаРегистратора КАК ДатаРегистратораМаксимальных,
	|	энргМаксимальныеПоказания.Показание КАК МаксПоказания
	|ПОМЕСТИТЬ ДанныеМаксПоказаний
	|ИЗ
	|	РазделительМакПок КАК РазделительМакПок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|		ПО РазделительМакПок.Организация = энргМаксимальныеПоказания.Организация
	|			И РазделительМакПок.Район = энргМаксимальныеПоказания.Район
	|			И РазделительМакПок.КлючПомещения = энргМаксимальныеПоказания.КлючПомещения
	|			И РазделительМакПок.ПриборУчета = энргМаксимальныеПоказания.ПриборУчета
	|			И РазделительМакПок.Шкала = энргМаксимальныеПоказания.Шкала
	|			И РазделительМакПок.ТарифнаяЗона = энргМаксимальныеПоказания.ТарифнаяЗона
	|			И РазделительМакПок.ПериодМаксПоказаний = энргМаксимальныеПоказания.Период
	|			И РазделительМакПок.РегистраторМаксПоказаний = энргМаксимальныеПоказания.ДокРегистратор
	|			И РазделительМакПок.РазделительМаксПоказаний = энргМаксимальныеПоказания.Разделитель
	|			И (энргМаксимальныеПоказания.Организация = &Организация)
	|			И (энргМаксимальныеПоказания.Район = &Район)
	|			И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПУПоследовательность.Организация КАК Организация,
	|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПУПоследовательность.Район КАК Район,
	|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
	|	энргПоказанияПУПоследовательность.Строение КАК Строение,
	|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
	|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения КАК СостояниеПроведения,
	|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
	|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
	|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель,
	|	энргПоказанияПУПоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	энргПоказанияПУПоследовательность.ИмяТабЧасти КАК ИмяТабЧасти,
	|	Граница.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПУПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности) КАК ИсключенИзПоследовательности
	|ПОМЕСТИТЬ НаборДокументов
	|ИЗ
	|	Граница КАК Граница
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
	|		ПО Граница.Организация = энргПоказанияПУПоследовательность.Организация
	|			И Граница.ПериодНачисления = энргПоказанияПУПоследовательность.ПериодНачисления
	|			И Граница.Район = энргПоказанияПУПоследовательность.Район
	|			И Граница.ЧастныйСектор = энргПоказанияПУПоследовательность.ЧастныйСектор
	|			И Граница.Строение = энргПоказанияПУПоследовательность.Строение
	|			И Граница.Помещение = энргПоказанияПУПоследовательность.Помещение
	|			И Граница.ПриборУчета = энргПоказанияПУПоследовательность.ПриборУчета
	|			И (ВЫБОР
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор = энргПоказанияПУПоследовательность.ДокРегистратор
	|						И Граница.Разделитель <= энргПоказанияПУПоследовательность.Разделитель
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора = энргПоказанияПУПоследовательность.ДатаРегистратора
	|						И Граница.ДокРегистратор < энргПоказанияПУПоследовательность.ДокРегистратор
	|					ТОГДА ИСТИНА
	|				КОГДА Граница.ПериодРегистрации = энргПоказанияПУПоследовательность.ПериодРегистрации
	|						И Граница.ДатаРегистратора < энргПоказанияПУПоследовательность.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ Граница.ПериодРегистрации < энргПоказанияПУПоследовательность.ПериодРегистрации
	|			КОНЕЦ)
	|			И (энргПоказанияПУПоследовательность.Организация = &Организация)
	|			И (энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления)
	|			И (энргПоказанияПУПоследовательность.Район = &Район)
	|			И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)
	|			И (энргПоказанияПУПоследовательность.Строение = &Строение)
	|			И (энргПоказанияПУПоследовательность.Помещение = &Помещение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.Организация КАК Организация,
	|	энргПоказанияПриборовУчета.Район КАК Район,
	|	энргПоказанияПриборовУчета.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА энргПоказанияПриборовУчета.Переворот
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БылПереворот
	|ПОМЕСТИТЬ ДанныеПоПереворотам
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.Район = энргПоказанияПриборовУчета.Район
	|			И НаборДокументов.КлючПомещения = энргПоказанияПриборовУчета.КлючПомещения
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И (энргПоказанияПриборовУчета.Период МЕЖДУ НаборДокументов.ДатаРегистратора И НаборДокументов.ПериодРегистрации)
	|			И (энргПоказанияПриборовУчета.СостояниеПоказаний = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты))
	|			И НаборДокументов.ДокРегистратор <> энргПоказанияПриборовУчета.Регистратор
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПоказанияПриборовУчета.Организация,
	|	энргПоказанияПриборовУчета.Район,
	|	энргПоказанияПриборовУчета.КлючПомещения,
	|	энргПоказанияПриборовУчета.ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборДокументов.Организация КАК Организация,
	|	НаборДокументов.ПериодНачисления КАК ПериодНачисления,
	|	НаборДокументов.Район КАК Район,
	|	НаборДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	НаборДокументов.Строение КАК Строение,
	|	НаборДокументов.Помещение КАК Помещение,
	|	НаборДокументов.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор КАК ДокРегистратор,
	|	НаборДокументов.Разделитель КАК Разделитель,
	|	НаборДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	энргПоказанияПриборовУчета.Показание КАК Показание,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	энргПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|	энргПоказанияПриборовУчета.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	энргПоказанияПриборовУчета.КС КАК КС,
	|	энргПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	НаборДокументов.КлючПомещения КАК КлючПомещения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргОперацияСЛицевымСчетом)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргОперацияСЛицевымСчетом).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргОперацияСУслугами)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргОперацияСУслугами).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргОперацияСПриборомУчета)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргОперацияСПриборомУчета).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргАктированиеНедопускаДопускаВПомещение)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргАктированиеНедопускаДопускаВПомещение).ВидОперации
	|		КОГДА ТИПЗНАЧЕНИЯ(НаборДокументов.ДокРегистратор) = ТИП(Документ.энргПерерасчет)
	|			ТОГДА ВЫРАЗИТЬ(НаборДокументов.ДокРегистратор КАК Документ.энргПерерасчет).ВидОперации
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.ПустаяСсылка)
	|	КОНЕЦ КАК ВидОперации,
	|	энргПоказанияПриборовУчета.ПериодНачисления КАК ПериодНачисленияКорректировки
	|ПОМЕСТИТЬ ДанныеДокументов
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|		ПО НаборДокументов.ПериодРегистрации = энргПоказанияПриборовУчета.Период
	|			И НаборДокументов.ДокРегистратор = энргПоказанияПриборовУчета.Регистратор
	|			И НаборДокументов.Организация = энргПоказанияПриборовУчета.Организация
	|			И НаборДокументов.КлючПомещения = энргПоказанияПриборовУчета.КлючПомещения
	|			И НаборДокументов.ПриборУчета = энргПоказанияПриборовУчета.ПриборУчета
	|			И НаборДокументов.Разделитель = энргПоказанияПриборовУчета.Разделитель
	|			И (НаборДокументов.ИсключенИзПоследовательности = ЛОЖЬ)
	|			И (энргПоказанияПриборовУчета.Организация = &Организация)
	|			И (энргПоказанияПриборовУчета.Район = &Район)
	|			И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборДокументов.Организация,
	|	НаборДокументов.ПериодНачисления,
	|	НаборДокументов.Район,
	|	НаборДокументов.ЧастныйСектор,
	|	НаборДокументов.Строение,
	|	НаборДокументов.Помещение,
	|	НаборДокументов.ПриборУчета,
	|	ДанныеМаксПоказаний.Шкала,
	|	ДанныеМаксПоказаний.ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор,
	|	НаборДокументов.Разделитель,
	|	НаборДокументов.ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены),
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	НаборДокументов.КлючПомещения,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.ПустаяСсылка),
	|	НаборДокументов.ПериодНачисления
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО НаборДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И НаборДокументов.Район = ДанныеМаксПоказаний.Район
	|			И НаборДокументов.КлючПомещения = ДанныеМаксПоказаний.КлючПомещения
	|			И НаборДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И (НаборДокументов.ИсключенИзПоследовательности)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборДокументов.Организация,
	|	НаборДокументов.ПериодНачисления,
	|	НаборДокументов.Район,
	|	НаборДокументов.ЧастныйСектор,
	|	НаборДокументов.Строение,
	|	НаборДокументов.Помещение,
	|	НаборДокументов.ПриборУчета,
	|	ДанныеМаксПоказаний.Шкала,
	|	ДанныеМаксПоказаний.ТарифнаяЗона,
	|	НаборДокументов.СостояниеПроведения,
	|	НаборДокументов.ПериодРегистрации,
	|	НаборДокументов.ДатаРегистратора,
	|	НаборДокументов.ДокРегистратор,
	|	НаборДокументов.Разделитель,
	|	НаборДокументов.ВыводПрибораУчета,
	|	НаборДокументов.ИмяТабЧасти,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Отклонены),
	|	ЗНАЧЕНИЕ(Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка),
	|	ЛОЖЬ,
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка),
	|	НаборДокументов.КлючПомещения,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.ПустаяСсылка),
	|	НаборДокументов.ПериодНачисления
	|ИЗ
	|	НаборДокументов КАК НаборДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО НаборДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И НаборДокументов.Район = ДанныеМаксПоказаний.Район
	|			И НаборДокументов.КлючПомещения = ДанныеМаксПоказаний.КлючПомещения
	|			И НаборДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И (НаборДокументов.ИсключенИзПоследовательности)
	|ГДЕ
	|	ДанныеМаксПоказаний.Организация ЕСТЬ NULL
	|	И НаборДокументов.ИсключенИзПоследовательности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКоэффциентыПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргКоэффциентыПриборовУчетаСрезПоследних.Коэффициент КАК коэффициент
	|ПОМЕСТИТЬ КоэффициентыПриборов
	|ИЗ
	|	РегистрСведений.энргКоэффциентыПриборовУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И (Организация, Район, КлючПомещения, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ДанныеДокументов.Организация КАК Организация,
	|						ДанныеДокументов.Район КАК Район,
	|						ДанныеДокументов.КлючПомещения КАК КлючПомещения,
	|						ДанныеДокументов.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ДанныеДокументов КАК ДанныеДокументов)) КАК энргКоэффциентыПриборовУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокументов.Район КАК Район,
	|	ДанныеДокументов.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДокументов.Строение КАК Строение,
	|	ДанныеДокументов.Помещение КАК Помещение,
	|	ДанныеДокументов.ПриборУчета КАК ПриборУчета,
	|	ДанныеДокументов.Шкала КАК Шкала,
	|	ДанныеДокументов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДокументов.СостояниеПроведения КАК СостояниеПроведения,
	|	ДанныеДокументов.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокументов.ДатаРегистратора КАК ДатаРегистратора,
	|	ДанныеДокументов.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеДокументов.Разделитель КАК Разделитель,
	|	ДанныеДокументов.ВыводПрибораУчета КАК ВыводПрибораУчета,
	|	ДанныеДокументов.ИмяТабЧасти КАК ИмяТабЧасти,
	|	ДанныеДокументов.Показание КАК Показание,
	|	ДанныеДокументов.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ДанныеДокументов.ПричинаОтклонения КАК ПричинаОтклонения,
	|	ДанныеДокументов.Переворот КАК Переворот,
	|	ДанныеДокументов.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ДанныеДокументов.КС КАК КС,
	|	ДанныеДокументов.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.МаксимальноВозможныеПоказания, 0) КАК МаксимальноВозможныеПоказания,
	|	ЕСТЬNULL(КоэффициентыПриборов.коэффициент, 1) КАК коэффициентПУ,
	|	ЕСТЬNULL(ПоследниеНомераПозиции.НомерПозиции, -1) КАК НомерПозици,
	|	ЕСТЬNULL(ДанныеПоПереворотам.БылПереворот, 0) КАК БылПереворот,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ПериодМаксПоказаний, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.МаксПоказания, -1) КАК МаксПоказания,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.РегистраторМаксПоказаний, ЗНАЧЕНИЕ(Документ.энргРегистрацияПоказанийАбонента.ПустаяСсылка)) КАК РегистраторМаксПоказаний,
	|	ЕСТЬNULL(ДанныеМаксПоказаний.ДатаРегистратораМаксимальных, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратораМаксимальных,
	|	ДанныеДокументов.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(энргПриборыУчетаАбонента.РегистрируетОбъем, ЛОЖЬ) КАК РегистрируетОбъем,
	|	ЛОЖЬ КАК НедопускПрибора,
	|	ДанныеДокументов.ВидОперации КАК ВидОперации,
	|	ДанныеДокументов.ПериодНачисленияКорректировки КАК ПериодНачисленияКорректировки
	|ИЗ
	|	ДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ДанныеДокументов.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыПриборов КАК КоэффициентыПриборов
	|		ПО ДанныеДокументов.КлючПомещения = КоэффициентыПриборов.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = КоэффициентыПриборов.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеНомераПозиции КАК ПоследниеНомераПозиции
	|		ПО ДанныеДокументов.Организация = ПоследниеНомераПозиции.Организация
	|			И ДанныеДокументов.ПериодНачисления = ПоследниеНомераПозиции.ПериодНачисления
	|			И ДанныеДокументов.Район = ПоследниеНомераПозиции.Район
	|			И ДанныеДокументов.ЧастныйСектор = ПоследниеНомераПозиции.ЧастныйСектор
	|			И ДанныеДокументов.Строение = ПоследниеНомераПозиции.Строение
	|			И ДанныеДокументов.Помещение = ПоследниеНомераПозиции.Помещение
	|			И ДанныеДокументов.ПриборУчета = ПоследниеНомераПозиции.ПриборУчета
	|			И ДанныеДокументов.Шкала = ПоследниеНомераПозиции.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ПоследниеНомераПозиции.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоПереворотам КАК ДанныеПоПереворотам
	|		ПО ДанныеДокументов.Организация = ДанныеПоПереворотам.Организация
	|			И ДанныеДокументов.Район = ДанныеПоПереворотам.Район
	|			И ДанныеДокументов.КлючПомещения = ДанныеПоПереворотам.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = ДанныеПоПереворотам.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеПоПереворотам.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеПоПереворотам.ТарифнаяЗона
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеМаксПоказаний КАК ДанныеМаксПоказаний
	|		ПО ДанныеДокументов.Организация = ДанныеМаксПоказаний.Организация
	|			И ДанныеДокументов.Район = ДанныеМаксПоказаний.Район
	|			И ДанныеДокументов.КлючПомещения = ДанныеМаксПоказаний.КлючПомещения
	|			И ДанныеДокументов.ПриборУчета = ДанныеМаксПоказаний.ПриборУчета
	|			И ДанныеДокументов.Шкала = ДанныеМаксПоказаний.Шкала
	|			И ДанныеДокументов.ТарифнаяЗона = ДанныеМаксПоказаний.ТарифнаяЗона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	Помещение,
	|	ПриборУчета,
	|	ПериодРегистрации,
	|	ДатаРегистратора,
	|	ДокРегистратор,
	|	Шкала,
	|	ТарифнаяЗона,
	|	Разделитель";
	
	Если НЕ Строения = Неопределено Тогда
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
		Текст 			= СтрЗаменить(Текст,".Строение = &Строение", ".Строение В(&Строения)");
		
	ИначеЕсли ЧастныйСектор = Неопределено Тогда
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.ЧастныйСектор = &ЧастныйСектор)","");
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Строение) Тогда
		
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Строение = &Строение","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Строение = &Строение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Строение = &Строение)","");
		
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
		
	ИначеЕсли Не ЗначениеЗаполнено(Помещение) И Не ЧастныйСектор Тогда
		Текст 			= СтрЗаменить(Текст,"И КлючПомещения = &КлючПомещения","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение",""); 
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И энргПоказанияПриборовУчета.Помещение = &Помещение","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПУПоследовательность.Помещение = &Помещение)","");
		Текст			= СтрЗаменить(Текст,"И энргПоказанияПУПоследовательность.Помещение = &Помещение","");		
		Текст 			= СтрЗаменить(Текст,"И (энргПредоставленныеПоказания.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргКлючиПомещений.Помещение = &Помещение)","");
		Текст 			= СтрЗаменить(Текст,"И (энргМаксимальныеПоказания.КлючПомещения = &КлючПомещения)","");
		Текст 			= СтрЗаменить(Текст,"И (энргПоказанияПриборовУчета.КлючПомещения = &КлючПомещения)","");
	КонецЕсли;
		
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Период",						Отбор.КонецПериодаРасчета); 	
	Запрос.УстановитьПараметр("ПериодНачисления",			ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Район",						Район); 	
	Запрос.УстановитьПараметр("ЧастныйСектор",				ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение",					Строение);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",		Отбор.НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("НачалоПериодаРасчета",		Отбор.НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КолвоНедопусковПодряд",		Отбор.КолвоНедопусковПодряд); 	
	
	Если НЕ Строения = Неопределено Тогда 
		Запрос.УстановитьПараметр("Строения", Строения);
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Помещение) Или ЗначениеЗаполнено(Строение) И ЧастныйСектор Тогда
		СтруктураКлючПомещения = РегистрыСведений.энргКлючиПомещений.ПолучитьДанныеПомещенияСОтбором(Строение, Помещение);
		
		Запрос.УстановитьПараметр("КлючПомещения",			СтруктураКлючПомещения.КлючПомещения);
		Запрос.УстановитьПараметр("Помещение",				Помещение);
		
		Если Не Отбор.ПриборУчета  = Неопределено Тогда
			Запрос.УстановитьПараметр("ПриборУчета",		Отбор.ПриборУчета);
		КонецЕсли; 	
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДанныеМаксимальногоПотребления(НачалоПериодаРасчета)
	
	Результат = Новый Соответствие;
	
	Схема = Неопределено;
	СоотвествиеПолей = Новый Структура("Организация", "Организация");
	ПараметрыЗапроса = Новый Структура("Организация", Организация); 
	ПараметрыЗапроса.Вставить("Период", КонецМесяца(НачалоПериодаРасчета) + 1);
		
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	ПараметрПериод = энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период");
	
	ПараметрыСхемы = Новый Структура(
		"ПараметрыВТ, Период", 
		ПараметрыВТ, ПараметрПериод);
	
	РегистрыСведений.энргМаксимальныеПоказателиПотребления.МаксимальныеПоказателиПотребления(Схема, ПараметрыСхемы);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДобавления = Новый Структура("ПовышающийКоэффициент,МаксимальноеПотребления", Выборка.ПовышающийКоэффициент, Выборка.МаксимальноеПотребления);
		Результат.Вставить(Выборка.Услуга, СтрокаДобавления);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСоСреднимОбъемомАбонентов

Функция РезультатСреднийОбъемПотребления(МВТ, Отбор)
	
	Текст 	=
	"ВЫБРАТЬ
	|	энргСреднийОбъемПотребленияАбонентов.Организация КАК Организация,
	|	энргСреднийОбъемПотребленияАбонентов.ПериодНачисления КАК ПериодНачисления,
	|	энргСреднийОбъемПотребленияАбонентов.Район КАК Район,
	|	энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСреднийОбъемПотребленияАбонентов.Строение КАК Строение,
	|	энргСреднийОбъемПотребленияАбонентов.Помещение КАК Помещение,
	|	энргСреднийОбъемПотребленияАбонентов.ТочкаУчета КАК ТочкаУчета,
	|	энргСреднийОбъемПотребленияАбонентов.Шкала КАК Шкала,
	|	энргСреднийОбъемПотребленияАбонентов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСреднийОбъемПотребленияАбонентов.Объем КАК Объем
	|ПОМЕСТИТЬ СреднийОбъем
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияАбонентов КАК энргСреднийОбъемПотребленияАбонентов
	|ГДЕ
	|	энргСреднийОбъемПотребленияАбонентов.Организация = &Организация
	|	И энргСреднийОбъемПотребленияАбонентов.ПериодНачисления = &ПериодНачисления
	|	И энргСреднийОбъемПотребленияАбонентов.Район = &Район
	|	И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор
	|	И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение
	|	И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Граница.Организация КАК Организация,
	|	Граница.ПериодНачисления КАК ПериодНачисления,
	|	Граница.Район КАК Район,
	|	Граница.ЧастныйСектор КАК ЧастныйСектор,
	|	Граница.Строение КАК Строение,
	|	Граница.Помещение КАК Помещение,
	|	ЕСТЬNULL(СреднийОбъем.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.ПустаяСсылка)) КАК ТочкаУчета,
	|	ЕСТЬNULL(СреднийОбъем.Шкала, ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.ПустаяСсылка)) КАК Шкала,
	|	ЕСТЬNULL(СреднийОбъем.ТарифнаяЗона, ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.ПустаяСсылка)) КАК ТарифнаяЗона,
	|	ЕСТЬNULL(СреднийОбъем.Объем, 0) КАК СреднееПотребление
	|ИЗ
	|	Граница КАК Граница
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднийОбъем КАК СреднийОбъем
	|		ПО Граница.Организация = СреднийОбъем.Организация
	|			И Граница.ПериодНачисления = СреднийОбъем.ПериодНачисления
	|			И Граница.Район = СреднийОбъем.Район
	|			И Граница.ЧастныйСектор = СреднийОбъем.ЧастныйСектор
	|			И Граница.Строение = СреднийОбъем.Строение
	|			И Граница.Помещение = СреднийОбъем.Помещение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	ЧастныйСектор,
	|	Строение,
	|	Помещение,
	|	Шкала,
	|	ТарифнаяЗона"; 
	
	Если НЕ Строения = Неопределено Тогда
		
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
		
		Текст 						= СтрЗаменить(Текст,".Строение = &Строение", ".Строение В(&Строения)");
		
	ИначеЕсли ЧастныйСектор  = Неопределено Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.ЧастныйСектор = &ЧастныйСектор","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	ИначеЕсли Не ЗначениеЗаполнено(Строение) Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Строение = &Строение","");
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	ИначеЕсли Не ЗначениеЗаполнено(Помещение) И Не ЧастныйСектор Тогда
		Текст 						= СтрЗаменить(Текст,"И энргСреднийОбъемПотребленияАбонентов.Помещение = &Помещение","");
	КонецЕсли;
	
	Запрос = Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Организация"		, Организация);	
	Запрос.УстановитьПараметр("Район"			, Район);  	
	Запрос.УстановитьПараметр("ЧастныйСектор"	, ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение"		, Строение);
	
	Если НЕ Строения = Неопределено Тогда 
		Запрос.УстановитьПараметр("Строения", Строения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Помещение) Или ЗначениеЗаполнено(Строение) И ЧастныйСектор Тогда
		Запрос.УстановитьПараметр("Помещение", Помещение);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Возврат РезультатЗапроса
	
КонецФункции

Функция ДанныеСреднегоОбъемаАбонента(ВыборкаСреднийОбъем, Выборка) 
	
	ТекТочкаУчета					= Неопределено;
	ТекШкала 						= Неопределено;
	СоотвествиеТочек 				= Новый Соответствие;
	СоответствиеЗоны 				= Неопределено;
	СоотвествиеШкал 				= Неопределено;
	Пока ВыборкаСреднийОбъем.ЧастныйСектор  = Выборка.ЧастныйСектор и ВыборкаСреднийОбъем.Строение = Выборка.Строение и ВыборкаСреднийОбъем.Помещение = Выборка.Помещение цикл		
		Если ЗначениеЗаполнено(ВыборкаСреднийОбъем.Шкала) и ЗначениеЗаполнено(ВыборкаСреднийОбъем.ТарифнаяЗона) Тогда
			Если ТекШкала <> ВыборкаСреднийОбъем.Шкала Тогда
				Если ТекШкала <> Неопределено тогда
					СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли;
			
			Если ТекТочкаУчета <> ВыборкаСреднийОбъем.ТочкаУчета тогда
				Если ТекТочкаУчета <> Неопределено тогда
					СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
				КонецЕсли;
				СоотвествиеШкал		= Новый Соответствие;
				СоответствиеЗоны	= Новый Соответствие;
			КонецЕсли; 	
			
			СоответствиеЗоны.Вставить(ВыборкаСреднийОбъем.ТарифнаяЗона, ВыборкаСреднийОбъем.СреднееПотребление);
		КонецЕсли;
	
		Если не ВыборкаСреднийОбъем.Следующий() тогда
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	 	
	Если ТекШкала <> Неопределено тогда
		СоотвествиеШкал.Вставить(ТекШкала,СоответствиеЗоны);
	КонецЕсли;		
		
	Если ТекТочкаУчета <> Неопределено тогда
		СоотвествиеТочек.Вставить(ТекТочкаУчета,СоотвествиеШкал);
	КонецЕсли;	  
	
	Возврат СоотвествиеТочек;
	
КонецФункции
	
#КонецОбласти

#Область ПроцессВосстановления

Процедура ОбработатьДанные(Ошибки, РезультатИнициализации)
	
	Выборка = РезультатИнициализации.ВыборкаПоказания;
	ВыборкаСреднийОбъем = РезультатИнициализации.ВыборкаСреднийОбъем;
	
	ДанныеНаГраницуИМоментДокумента = Новый Соответствие;	 	
	
	СоответствиеШкал = Новый Соответствие;
	СоответствиеТЗ = Новый Соответствие;
	
	КонтекстПриСменеКлюча = НовыйКонтекстПриСменеКлюча();
	КонтекстПриСменеКлюча.ДанныеНаГраницуИМоментДокумента = ДанныеНаГраницуИМоментДокумента;	
	
	ПеременныеПриСменеКлюча = НовыеПеременныеПриСменеКлюча();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ПеременныеПриСменеКлюча.ТекПрибор = Выборка.ПриборУчета ИЛИ НЕ ПеременныеПриСменеКлюча.ТекДокумент = Выборка.ДокРегистратор Тогда
					
			Если НЕ ПеременныеПриСменеКлюча.ТекПрибор = Неопределено И НЕ ПеременныеПриСменеКлюча.ТекДокумент = Неопределено Тогда 
				ОперацииПриСменеКлюча(ПеременныеПриСменеКлюча, КонтекстПриСменеКлюча, Ложь);			
			КонецЕсли;			
			
			Если НЕ ПеременныеПриСменеКлюча.ТекПрибор = Выборка.ПриборУчета Тогда  				
				
				Если КонтекстПриСменеКлюча.УспешноОбработан Тогда
					
					Если КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные.Количество() > 0 Тогда
						
						НачатьТранзакцию();
						Попытка						
							ЗаписатьНаборыПоследовательности(КонтекстПриСменеКлюча);						
							ЗафиксироватьТранзакцию();
						Исключение
							
							ОтменитьТранзакцию();
							
							Инфо = ИнформацияОбОшибке(); 		
							Комментарий = "Установка состояния последовательности. Прибор:" + ПеременныеПриСменеКлюча.ТекПрибор +
							" причина: " + Символы.ПС + 
							ПодробноеПредставлениеОшибки(Инфо);
							
							Ошибки.Добавить(Комментарий);
							
						КонецПопытки;
						
					КонецЕсли;									
					
				КонецЕсли; 				
				
				КонтекстПриСменеКлюча.УспешноОбработан = Истина;
				КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные.Очистить();
				СоответствиеШкал.Очистить();
				СоответствиеТЗ.Очистить();
				ДанныеНаГраницуИМоментДокумента.Очистить();
				ДанныеНаГраницуИМоментДокумента.Вставить(Выборка.ПриборУчета, СоответствиеШкал); 				
				
				Если НЕ ПеременныеПриСменеКлюча.ТекПомещение = Выборка.Помещение Тогда
					ДанныеСреднегоОбъема = ДанныеСреднегоОбъемаАбонента(ВыборкаСреднийОбъем, Выборка);
				КонецЕсли;
				
			КонецЕсли;
			
			ОбновитьКонтекстПриСменеКлюча(КонтекстПриСменеКлюча, Выборка);
			
		КонецЕсли;
		
		Если (НЕ КонтекстПриСменеКлюча.ДокОбъектПолучен = Неопределено И НЕ КонтекстПриСменеКлюча.ДокОбъектПолучен)
			ИЛИ НЕ КонтекстПриСменеКлюча.УспешноОбработан Тогда
			
			ОбновитьЗначенияПеременныхКлюча(ПеременныеПриСменеКлюча, Выборка);		
			Продолжить;
			
		КонецЕсли;  		
		
		ЗаполнитьДанныеНаГраницуИМоментДокумента(ДанныеНаГраницуИМоментДокумента, Выборка, СоответствиеТЗ);		
		
		Если Выборка.СостояниеПроведения = СтатическийКонтекст.Исключен тогда 
			
			КлючПрибора = ДанныеНаГраницуИМоментДокумента[Выборка.ПриборУчета];
			ПодготовитьРегистрыИсключенногоИзПоследовательности(КонтекстПриСменеКлюча, Выборка, КлючПрибора);
			
			ОбновитьЗначенияПеременныхКлюча(ПеременныеПриСменеКлюча, Выборка);			
			Продолжить;
			
		КонецЕсли;
		
		//Если НЕ СтатическийКонтекст.ПричиныОтклоненияИсключая.Найти(Выборка.ПричинаОтклонения) = Неопределено Тогда
		//	
		//	ОбновитьЗначенияПеременныхКлюча(ПеременныеПриСменеКлюча, Выборка);
		//	Продолжить;
		//	
		//КонецЕсли;
		
		ДанныеПрибораПоДокументу = ДанныеНаГраницуИМоментДокумента[Выборка.ПриборУчета][Выборка.Шкала][Выборка.ТарифнаяЗона];
		
		СостояниеПоказаний  = Выборка.СостояниеПоказаний;
		ПричинаОтклонения	= Выборка.ПричинаОтклонения;
		Переворот  			= Выборка.Переворот;
		
		ОбновлятьДанные 		= Истина;
		ЭтоОткрытие 			= Ложь;
		ЭтоДокументнСДатойФакта	= Ложь;
		ЭтоИзменениеПоказаний	= Ложь;
		
		Текущие = Выборка.Показание;
		
		ЭтоМаксимальные = Ложь;			
		Если Выборка.РегистрируетОбъем Тогда
			ЭтоМаксимальные = СостояниеПоказаний = СтатическийКонтекст.ПоказанияПриняты;
		Иначе
			ЭтоМаксимальные = (ДанныеПрибораПоДокументу.ПредыдущиеМакс <= Текущие или Переворот);
		КонецЕсли;
		
		// Обновляем показания в документа.
		ТипДокумента = ТипЗнч(Выборка.ДокРегистратор);
		Если Выборка.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС") Тогда 
			ОбновлятьДанные = Ложь;
			ЭтоОткрытие 	= Истина;
			ЭтоМаксимальные = Истина;
			Если НачалоДня(Выборка.ДатаРегистратора) = НачалоДня(Выборка.ПериодРегистрации) Тогда
				ЭтоДокументнСДатойФакта	= Истина;
			КонецЕсли;
			
		ИначеЕсли Выборка.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги") Тогда 
			ОбновлятьДанные = Ложь;
			ЭтоМаксимальные = Истина;
			ЭтоОткрытие 	= Истина;
			Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
				ЭтоДокументнСДатойФакта	= Истина;
			КонецЕсли;
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.энргПерерасчет") Тогда
			ОбновлятьДанные 		= Ложь;
			ЭтоМаксимальные 		= Истина;
			ЭтоИзменениеПоказаний	= Истина;
		ИначеЕсли Выборка.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ") Тогда 
			ОбновлятьДанные = Ложь;
			ЭтоМаксимальные = Истина;
			ЭтоОткрытие 	= Истина;
			Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
				ЭтоДокументнСДатойФакта	= Истина;
			КонецЕсли;
		ИначеЕсли Выборка.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ") Тогда 
			
			ТабЧасть  		= Выборка.ДокРегистратор["ТочкиУчета"];
			СтрокиПрибора	= ТабЧасть.НайтиСтроки(Новый Структура("ПриборУчета", Выборка.ПриборУчета));
			Если НЕ СтрокиПрибора.Количество() = 0 Тогда
				ОбновлятьДанные = Ложь;
				ЭтоМаксимальные = Истина;
				ЭтоОткрытие 	= Истина;
				Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
					ЭтоДокументнСДатойФакта	= Истина;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Выборка.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение") Тогда 
			
			ОбновлятьДанные = Ложь;
			ЭтоМаксимальные = Истина;
			ЭтоОткрытие 	= Истина;
			Если НачалоДня(Выборка.ДатаРегистратора) <> НачалоДня(Выборка.ПериодРегистрации) Тогда
				ЭтоДокументнСДатойФакта	= Истина;
			КонецЕсли;			
			
		КонецЕсли;   			
		
		
		Если Выборка.РегистрируетОбъем Тогда
			ОбновлятьДанные = Ложь;
		КонецЕсли;
		
		ЭтоНовыйВидДифф = Ложь;
		Если ОбновлятьДанные Тогда 
			
			Если КонтекстПриСменеКлюча.ДокОбъектПолучен = Неопределено ИЛИ НЕ КонтекстПриСменеКлюча.ДокОбъектПолучен Тогда 
				Попытка
					
					КонтекстПриСменеКлюча.ДокОбъект = Выборка.ДокРегистратор.ПолучитьОбъект();	
					КонтекстПриСменеКлюча.ДокОбъектПолучен = Истина; 
					
				Исключение
					КонтекстПриСменеКлюча.ДокОбъектПолучен = Ложь;
				КонецПопытки;
			КонецЕсли;
			Если НЕ КонтекстПриСменеКлюча.ДокОбъектПолучен Тогда
				
				ОбновитьЗначенияПеременныхКлюча(ПеременныеПриСменеКлюча, Выборка);		
				Продолжить;
				
			КонецЕсли;
			
			
			ПараметрыОперации = СтатическийКонтекст.ПараметрыОперации;
			ЗаполнитьЗначенияСвойств(ПараметрыОперации, Выборка, СписокСвойствСтрокиТЗ);		
			
			ПараметрыОперации.ДокОбъект 						= КонтекстПриСменеКлюча.ДокОбъект;
			ПараметрыОперации.ПредыдущиеМакс 					= ДанныеПрибораПоДокументу.ПредыдущиеМакс;
			ПараметрыОперации.ПериодПредыдущихМаксПок 			= ДанныеПрибораПоДокументу.ПериодПредыдущихМаксПок;
			ПараметрыОперации.ДанныеМаксимальногоПотребления 	= ДанныеМаксимальногоПотребления;
			ПараметрыОперации.ДанныеСреднегоОбъема 				= ДанныеСреднегоОбъема;
			ПараметрыОперации.ЭтоНовыйВидДифф 					= ЭтоНовыйВидДифф;
			ПараметрыОперации.ТипДокумента 						= ТипДокумента;			
			
			ОбновитьДанныеВДокументе(ПериодНачисления, Выборка.ДокРегистратор, ПараметрыОперации, КонтекстПриСменеКлюча);
			
			СостояниеПоказаний 	= ПараметрыОперации.СостояниеПоказаний;
			Переворот 			= ПараметрыОперации.Переворот;
			ЭтоНовыйВидДифф		= ПараметрыОперации.ЭтоНовыйВидДифф;
			
		КонецЕсли;
		
		///////////
		ВСрок = Истина;
		
		Если ЭтоДокументнСДатойФакта Тогда 
			// показания от документов с датой факта всегда не в срок 
			ВСрок = Ложь;
		КонецЕсли;
		
		Если НЕ ЭтоОткрытие Или ЭтоДокументнСДатойФакта Тогда 
			// Проверять "ВСрок" только документы регистрации показаний 
			ВСрок = Выборка.ПериодРегистрации >= РезультатИнициализации.НачалоПериодаРасчета и День(Выборка.ПериодРегистрации) >= СтатическийКонтекст.ПоказанияС и День(Выборка.ПериодРегистрации) <= СтатическийКонтекст.ПоказанияПО И НЕ Выборка.НедопускПрибора;
		КонецЕсли;			
		
		Если ЭтоИзменениеПоказаний Тогда 
			ВСрок = Ложь;
		КонецЕсли;
		
		ЭтоВвод = НЕ ОбновлятьДанные ИЛИ ЭтоНовыйВидДифф;
		ДанныеПрибораПоДокументу.ЭтоВвод = ЭтоВвод;
		Если СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены Тогда 
			КонтекстПриСменеКлюча.ЕстьОтклонениеЗоны = Истина;
		КонецЕсли;
		
		Если СтатическийКонтекст.РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу и ВСрок и СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены Тогда
			ОбновитьЗначенияПеременныхКлюча(ПеременныеПриСменеКлюча, Выборка);
			Продолжить;
		КонецЕсли;
		
		Если СтатическийКонтекст.НачПокНеЯвляютсяКонечнымиПриУстПрибора И ЭтоОткрытие и ВСрок Тогда 
			// Показания ввода прибора учета не должны учитываться как конечные при непредоставлении показаний
			ВСрок = Ложь;
		КонецЕсли;
		
		
		Если Выборка.ДатаРегистратора < Выборка.ПериодРегистрации тогда
			// Может быть либо у потерянной квитанции или у контрольного съема который НЕ с 23-26.
			Если Выборка.БылПереворот = 1 тогда
				ЭтоМаксимальные = Ложь;			 
			КонецЕсли; 			 
		КонецЕсли;
		
		Если НЕ СостояниеПоказаний = СтатическийКонтекст.ПоказанияПриняты Тогда 
			ЭтоМаксимальные = Ложь;
		КонецЕсли;
		
		//ЭтоВвод = НЕ ОбновлятьДанные ИЛИ ЭтоНовыйВидДифф;
		
		Если СостояниеПоказаний = СтатическийКонтекст.ПоказанияПриняты И НЕ ЭтоОткрытие И НЕ ЭтоНовыйВидДифф Тогда
			
			Если НЕ СтатическийКонтекст.НаборРасчетСреднего = Неопределено Тогда 
				
				СтрокаНабор = СтатическийКонтекст.НаборРасчетСреднего.Добавить();
				СтрокаНабор.ПериодНачисления = СтатическийКонтекст.НаборРасчетСреднего.Отбор.ПериодНачисления.Значение;
				СтрокаНабор.Организация 	 = Организация;
				СтрокаНабор.Район			 = Район;
				ЗаполнитьЗначенияСвойств(СтрокаНабор, Выборка, "Строение,Помещение,ЧастныйСектор,Шкала,ТарифнаяЗона,ТочкаУчета,ДокРегистратор,Разделитель");
				//ЗаполнитьЗначенияСвойств(СтрокаНабор, Выборка, "ТочкаУчета,ДокРегистратор,Разделитель");
				Если Выборка.РегистрируетОбъем Тогда
					СтрокаНабор.ОбъемУслуги = Текущие;
				Иначе	
					СтрокаНабор.ОбъемУслуги = Текущие - ДанныеПрибораПоДокументу.ПредыдущиеМакс;
				КонецЕсли;
				
				Если НЕ ЭтоВвод Тогда 
					ИндексСтроки = СтатическийКонтекст.НаборРасчетСреднего.Индекс(СтрокаНабор);
					СтатическийКонтекст.СтрокиСменыПоказанийНаборРасчетСреднего.Добавить(ИндексСтроки);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоИзменениеПоказаний Тогда
			ПоказанияТекущегоПериода = Ложь;
		Иначе 
			ПоказанияТекущегоПериода = Выборка.ПериодРегистрации >= РезультатИнициализации.НачалоПериодаРасчета;
		КонецЕсли;
		
		Если ЭтоМаксимальные Тогда 
			
			//ДанныеПрибораПоДокументу.ЭтоВвод 							= НЕ ОбновлятьДанные ИЛИ ЭтоНовыйВидДифф;
			ДанныеПрибораПоДокументу.ПериодПредыдущихМаксПокМомент 		= Выборка.ПериодРегистрации;
			ДанныеПрибораПоДокументу.ПредыдущиеМаксМомент 				= Текущие;				
			ДанныеПрибораПоДокументу.РегистраторМаксимальныхМомент 		= Выборка.ДокРегистратор;
			ДанныеПрибораПоДокументу.ДатаРегистратораМаксимальныхМомент = Выборка.ДатаРегистратора; 			
			
			НаборМаксПоказаний = СтатическийКонтекст.НаборМаксимальныеПоказания;
			СтрокаМаксимальных = НаборМаксПоказаний.Добавить();				
			ЗаполнитьЗначенияСвойств(СтрокаМаксимальных, Выборка, "КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,ДокРегистратор,Разделитель,Показание,ДатаРегистратора");
			//ЗаполнитьЗначенияСвойств(СтрокаМаксимальных, Выборка, "ДокРегистратор,Разделитель,Показание,ДатаРегистратора");
			СтрокаМаксимальных.Период 		= Выборка.ПериодРегистрации;
			СтрокаМаксимальных.Организация 	= Организация;
			СтрокаМаксимальных.Район 		= Район;
			
			Если НЕ ЭтоВвод Тогда 
				ИндексСтроки = СтатическийКонтекст.НаборМаксимальныеПоказания.Индекс(СтрокаМаксимальных);
				СтатическийКонтекст.СтрокиСменыПоказанийНаборМаксимальныеПоказания.Добавить(ИндексСтроки);
			КонецЕсли;
			
		КонецЕсли; 			 			
		
		Если СостояниеПоказаний = СтатическийКонтекст.ПоказанияПриняты ИЛИ ВСрок Тогда
			
			ЭтоПерерасчет = ТипЗнч(Выборка.ДокРегистратор) = Тип("ДокументСсылка.энргПерерасчет");
			
			НаборПредоставленных = СтатическийКонтекст.НаборПредоставленных;
			СтрокаНабор = НаборПредоставленных.Добавить();
			СтрокаНабор.Организация 	 	= Организация;
			СтрокаНабор.ПериодНачисления 	= ПериодНачисления;
			СтрокаНабор.Район				= Район;
			СтрокаНабор.ПериодНачисленияКорректировки = Выборка.ПериодНачисленияКорректировки;			
			ЗаполнитьЗначенияСвойств(СтрокаНабор, Выборка, "Строение,Помещение,ЧастныйСектор,ПриборУчета,Шкала,ТарифнаяЗона,ДокРегистратор,Разделитель");
			//ЗаполнитьЗначенияСвойств(СтрокаНабор, Выборка, "ДокРегистратор,Разделитель");
			СтрокаНабор.НомерПозиции  			= ?(ЭтоПерерасчет, -1, ДанныеПрибораПоДокументу.НомерПозицииМомент);
			СтрокаНабор.ДатаРегистратора  		= Выборка.ПериодРегистрации;
			СтрокаНабор.ВСрок  					= ВСрок;
			СтрокаНабор.ПоказанияТекущегоПериода= ПоказанияТекущегоПериода;
			Если Выборка.РегистрируетОбъем Тогда
				СтрокаНабор.Показания  = ?(СостояниеПоказаний = СтатическийКонтекст.ПоказанияПриняты, Текущие, 0);
			Иначе
				СтрокаНабор.Показания  = ?(ДанныеПрибораПоДокументу.ПредыдущиеМаксМомент < 0, 0, ДанныеПрибораПоДокументу.ПредыдущиеМаксМомент);
			КонецЕсли;				
			
			Если ЭтоПерерасчет = Ложь Тогда 
				ДанныеПрибораПоДокументу.НомерПозицииМомент = ДанныеПрибораПоДокументу.НомерПозицииМомент + 1;
			КонецЕсли; 				
			
			Если НЕ ЭтоВвод Тогда
				ИндексСтроки = СтатическийКонтекст.НаборПредоставленных.Индекс(СтрокаНабор);
				СтатическийКонтекст.СтрокиСменыПоказанийНаборПредоставленных.Добавить(ИндексСтроки);
			КонецЕсли;
			
		КонецЕсли;
		
		ОбновитьЗначенияПеременныхКлюча(ПеременныеПриСменеКлюча, Выборка);		
		
	КонецЦикла;
	
	Если НЕ ПеременныеПриСменеКлюча.ТекПрибор = Неопределено Тогда 
		ОперацииПриСменеКлюча(ПеременныеПриСменеКлюча, КонтекстПриСменеКлюча, Истина);
	КонецЕсли;  	
		
КонецПроцедуры

#Область ПеременныеСменыКлюча

Процедура ОбновитьКонтекстПриСменеКлюча(КонтекстПриСменеКлюча, Выборка)
	
	Если НЕ КонтекстПриСменеКлюча.УспешноОбработан Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстПриСменеКлюча.ДокументИсключен = Ложь;
	КонтекстПриСменеКлюча.ЕстьОтклонениеЗоны = Ложь;
	КонтекстПриСменеКлюча.ИтогПроверкиОбновленияДокумента.ОбновлятьДокумент = Ложь;
	КонтекстПриСменеКлюча.ИтогПроверкиОбновленияДокумента.ДанныеПодчиненногоРегистра.Очистить();
	КонтекстПриСменеКлюча.ИтогПроверкиОбновленияДокумента.ВсеСтрокиПоказанийДокумента.Очистить();
	КонтекстПриСменеКлюча.ИтогПроверкиОбновленияДокумента.ВсеОтборыПоказанийДокумента.Очистить();	
	
	//КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные.Очистить();
	КонтекстПриСменеКлюча.НаборыИсключенныхДокументов.Очистить();
	КонтекстПриСменеКлюча.НаборыСвязанныхРегистров.Очистить();
	
	СтатическийКонтекст.НаборПредоставленных = Неопределено;
	СтатическийКонтекст.НаборРасчетСреднего = Неопределено;
	СтатическийКонтекст.НаборМаксимальныеПоказания = Неопределено;
	СтатическийКонтекст.НаборМаксимальныеПоказанияСрез = Неопределено;
	
	СтатическийКонтекст.СтрокиСменыПоказанийНаборПредоставленных.Очистить();
	СтатическийКонтекст.СтрокиСменыПоказанийНаборРасчетСреднего.Очистить();
	СтатическийКонтекст.СтрокиСменыПоказанийНаборМаксимальныеПоказания.Очистить();
	//СтатическийКонтекст.СтрокиСменыПоказанийНаборМаксимальныеПоказанияСрез.Очистить();
	
	ДополнитьНаборЗаписейВСоответствиеПредоставленныеПоказания(МенеджерыРегистров.энргПредоставленныеПоказания, Выборка);
	ДополнитьНаборЗаписейВСоответствиеРасчетСреднегоОбъема(МенеджерыРегистров.энргРасчетСреднегоОбъема, Выборка);
	ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказания(МенеджерыРегистров.энргМаксимальныеПоказания, Выборка);
	ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказанияСрез(МенеджерыРегистров.энргМаксимальныеПоказанияСрез, Выборка);
	
	КонтекстПриСменеКлюча.ДокОбъектПолучен = Неопределено;
	
	//Попытка
	//	
	//	КонтекстПриСменеКлюча.ДокОбъект = Выборка.ДокРегистратор.ПолучитьОбъект();	
	//	КонтекстПриСменеКлюча.ДокОбъектПолучен = Истина; 
	//	
	//Исключение
	//	КонтекстПриСменеКлюча.ДокОбъектПолучен = Ложь;
	//КонецПопытки;
	
КонецПроцедуры

Функция НовыйКонтекстПриСменеКлюча()
	
	ИтогПроверкиОбновленияДокумента = НовыйИтогПроверкиОбновленияДокумента();
	
	Результат = Новый Структура;
	Результат.Вставить("УспешноОбработан", Истина);
	Результат.Вставить("ДокОбъект", Неопределено);
	Результат.Вставить("ДокОбъектПолучен", Ложь);
	Результат.Вставить("ДокументИсключен", Ложь);	
	Результат.Вставить("ЕстьОтклонениеЗоны", Ложь);	
	Результат.Вставить("НаборыПоказанияПУПоследовательностьИсключенные", Новый Соответствие);
	Результат.Вставить("НаборыИсключенныхДокументов", Новый Соответствие);
	Результат.Вставить("ИтогПроверкиОбновленияДокумента", ИтогПроверкиОбновленияДокумента);
	Результат.Вставить("НаборыСвязанныхРегистров", Новый Соответствие);
	Результат.Вставить("ДанныеНаГраницуИМоментДокумента", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйИтогПроверкиОбновленияДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("ОбновлятьДокумент", Ложь);
	Результат.Вставить("ДанныеПодчиненногоРегистра", Новый Массив);
	Результат.Вставить("ВсеСтрокиПоказанийДокумента", Новый Массив);
	Результат.Вставить("ВсеОтборыПоказанийДокумента", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция НовыеПеременныеПриСменеКлюча()
	
	Результат = Новый Структура;
	Результат.Вставить("ТекЧастныйСектор", Неопределено);
	Результат.Вставить("ТекСтроение", Неопределено);
	Результат.Вставить("ТекПомещение", Неопределено);
	Результат.Вставить("ТекПрибор", Неопределено);
	Результат.Вставить("ТекДокумент", Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьЗначенияПеременныхКлюча(ПеременныеПриСменеКлюча, Выборка)
	
	ПеременныеПриСменеКлюча.ТекЧастныйСектор	= Выборка.ЧастныйСектор;
	ПеременныеПриСменеКлюча.ТекСтроение 		= Выборка.Строение;
	ПеременныеПриСменеКлюча.ТекПомещение 		= Выборка.Помещение;
	ПеременныеПриСменеКлюча.ТекДокумент 		= Выборка.ДокРегистратор;
	ПеременныеПриСменеКлюча.ТекПрибор 			= Выборка.ПриборУчета;
		
КонецПроцедуры

#КонецОбласти

#Область ПриСменеКлючаИтогов

Процедура ОперацииПриСменеКлюча(ПеременныеПриСменеКлюча, КонтекстПриСменеКлюча, ЗаписыватьПоследовательность)
	
	Если НЕ КонтекстПриСменеКлюча.УспешноОбработан Тогда 
		Возврат;
	КонецЕсли; 	
	
	НаборПоказаний = Неопределено;
	Если НЕ КонтекстПриСменеКлюча.ДокументИсключен Тогда 
		ПодготовитьДанныеКЗаписи(ПеременныеПриСменеКлюча, КонтекстПриСменеКлюча, НаборПоказаний);
	КонецЕсли; 
	
	НачатьТранзакцию();
	Попытка
		
		Если КонтекстПриСменеКлюча.ДокументИсключен Тогда 
			ОчиститьИсключенныеДокументы(КонтекстПриСменеКлюча.НаборыИсключенныхДокументов);
		Иначе 
			
			Если КонтекстПриСменеКлюча.ИтогПроверкиОбновленияДокумента.ОбновлятьДокумент Тогда
				
				КонтекстПриСменеКлюча.ДокОбъект.Записать();
				Если НЕ НаборПоказаний = Неопределено Тогда
					НаборПоказаний.Записать();
				КонецЕсли;
				
			КонецЕсли;		
			
			ЗаписатьСвязанныеРегистры();
			
			//Если ЗаписыватьПоследовательность И КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные.Количество() > 0 Тогда 
			//	ЗаписатьНаборыПоследовательности(КонтекстПриСменеКлюча);
			//КонецЕсли;
			
		КонецЕсли;
		
		Если ЗаписыватьПоследовательность И КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные.Количество() > 0 Тогда 
			ЗаписатьНаборыПоследовательности(КонтекстПриСменеКлюча);
		КонецЕсли;
				
		ЗафиксироватьТранзакцию();
		
		КонтекстПриСменеКлюча.УспешноОбработан = Истина;
	Исключение
		
		ОтменитьТранзакцию();
		
		КонтекстПриСменеКлюча.УспешноОбработан = Ложь;		
		Инфо = ИнформацияОбОшибке();
		Комментарий = "Запись регистров. Документ:" + ПеременныеПриСменеКлюча.ТекДокумент + 
		" Прибор: " + ПеременныеПриСменеКлюча.ТекПрибор + 
		" причина: " + Символы.ПС + 
		ПодробноеПредставлениеОшибки(Инфо);
		
		Ошибки.Добавить(Комментарий);
		
	КонецПопытки;
	               	
КонецПроцедуры

Процедура ОчиститьИсключенныеДокументы(НаборыИсключенныхДокументов)
	
	Для Каждого КлючЗначение из НаборыИсключенныхДокументов Цикл
		
		КлючЗначение.Значение.Записать();	
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ПодготовитьДанныеКЗаписи(ПеременныеПриСменеКлюча, КонтекстПриСменеКлюча, НаборПоказаний)
	
	ЗапомнитьУспешныйСтатусПроведенияВПоследовательности(КонтекстПриСменеКлюча, ПеременныеПриСменеКлюча);
	ИтогПроверкиОбновленияДокумента = КонтекстПриСменеКлюча.ИтогПроверкиОбновленияДокумента;
	ЕстьОтклонениеЗоны = КонтекстПриСменеКлюча.ЕстьОтклонениеЗоны;                                        
	
	Если НЕ ЕстьОтклонениеЗоны Тогда
		
		Если ИтогПроверкиОбновленияДокумента.ОбновлятьДокумент Тогда
			
			ДанныеПодчиненногоРегистра = ИтогПроверкиОбновленияДокумента.ДанныеПодчиненногоРегистра;
			Если ДанныеПодчиненногоРегистра.Количество() > 0 Тогда
				ОбновитьДанныеПодчиненногоРегистра(ПеременныеПриСменеКлюча, ДанныеПодчиненногоРегистра, НаборПоказаний, ЕстьОтклонениеЗоны);
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеНаГраницуДокумента = КонтекстПриСменеКлюча.ДанныеНаГраницуИМоментДокумента[ПеременныеПриСменеКлюча.ТекПрибор];
		Для Каждого КлючЗначениеШкалы из ДанныеНаГраницуДокумента Цикл 
			Для Каждого КлючЗначениеТарифнойЗоны из КлючЗначениеШкалы.Значение Цикл 
				
				НоваяСтрока = СтатическийКонтекст.НаборМаксимальныеПоказанияСрез.Добавить();
				НоваяСтрока.Организация = Организация;
				НоваяСтрока.ПериодНачисления = ПериодНачисления;
				НоваяСтрока.Район = Район;
				НоваяСтрока.ЧастныйСектор = ПеременныеПриСменеКлюча.ТекЧастныйСектор;
				НоваяСтрока.Строение = ПеременныеПриСменеКлюча.ТекСтроение;
				НоваяСтрока.Помещение = ПеременныеПриСменеКлюча.ТекПомещение;
				НоваяСтрока.ПриборУчета = ПеременныеПриСменеКлюча.ТекПрибор;			
				НоваяСтрока.Шкала = КлючЗначениеШкалы.Ключ;
				НоваяСтрока.ТарифнаяЗона = КлючЗначениеТарифнойЗоны.Ключ;
				НоваяСтрока.Показания = КлючЗначениеТарифнойЗоны.Значение.ПредыдущиеМаксМомент;
				НоваяСтрока.ДокРегистратор = КлючЗначениеТарифнойЗоны.Значение.РегистраторМаксимальныхМомент;
				НоваяСтрока.ДатаРегистратора = КлючЗначениеТарифнойЗоны.Значение.ДатаРегистратораМаксимальныхМомент;
				
				ОбновитьСтрокуДанныхНаГраницуИМоментДокумента(КлючЗначениеТарифнойЗоны.Значение, Истина);
				
			КонецЦикла;		
		КонецЦикла;
		
		Возврат;
				
	КонецЕсли;
	
	ЕстьВвод = Ложь;
	ДанныеНаГраницуДокумента = КонтекстПриСменеКлюча.ДанныеНаГраницуИМоментДокумента[ПеременныеПриСменеКлюча.ТекПрибор];
	Для Каждого КлючЗначениеШкалы из ДанныеНаГраницуДокумента Цикл 
		Для Каждого КлючЗначениеТарифнойЗоны из КлючЗначениеШкалы.Значение Цикл 
			
			НоваяСтрока = СтатическийКонтекст.НаборМаксимальныеПоказанияСрез.Добавить();
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.ПериодНачисления = ПериодНачисления;
			НоваяСтрока.Район = Район;
			НоваяСтрока.ЧастныйСектор = ПеременныеПриСменеКлюча.ТекЧастныйСектор;
			НоваяСтрока.Строение = ПеременныеПриСменеКлюча.ТекСтроение;
			НоваяСтрока.Помещение = ПеременныеПриСменеКлюча.ТекПомещение;
			НоваяСтрока.ПриборУчета = ПеременныеПриСменеКлюча.ТекПрибор;			
			НоваяСтрока.Шкала = КлючЗначениеШкалы.Ключ;
			НоваяСтрока.ТарифнаяЗона = КлючЗначениеТарифнойЗоны.Ключ;
			
			Если НЕ КлючЗначениеТарифнойЗоны.Значение.ЭтоВвод Тогда
				
				
				НоваяСтрока.Показания = КлючЗначениеТарифнойЗоны.Значение.ПредыдущиеМакс;
				НоваяСтрока.ДокРегистратор = КлючЗначениеТарифнойЗоны.Значение.РегистраторМаксимальных;
				НоваяСтрока.ДатаРегистратора = КлючЗначениеТарифнойЗоны.Значение.ДатаРегистратораМаксимальных;
				
				ОбновитьСтрокуДанныхНаГраницуИМоментДокумента(КлючЗначениеТарифнойЗоны.Значение, Ложь);
				Продолжить;
			КонецЕсли;			
			
			НоваяСтрока.Показания = КлючЗначениеТарифнойЗоны.Значение.ПредыдущиеМаксМомент;
			НоваяСтрока.ДокРегистратор = КлючЗначениеТарифнойЗоны.Значение.РегистраторМаксимальныхМомент;
			НоваяСтрока.ДатаРегистратора = КлючЗначениеТарифнойЗоны.Значение.ДатаРегистратораМаксимальныхМомент;
			
			ОбновитьСтрокуДанныхНаГраницуИМоментДокумента(КлючЗначениеТарифнойЗоны.Значение, Истина);
			ЕстьВвод = Истина;
			
		КонецЦикла;		
	КонецЦикла;
	
	
	ОбновлятьДокумент = Ложь;		
	Для Каждого СтрокаПоказаний Из ИтогПроверкиОбновленияДокумента.ВсеСтрокиПоказанийДокумента Цикл
		
		Если СтрокаПоказаний.СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоказаний.СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены;
		СтрокаПоказаний.ПричинаОтклонения = СтатическийКонтекст.ОшибкаДругойЗоны;
		ОбновлятьДокумент = Истина;
		
	КонецЦикла;
	
	Если НЕ ИтогПроверкиОбновленияДокумента.ОбновлятьДокумент И ОбновлятьДокумент Тогда
		
		КонтекстПриСменеКлюча.ДокОбъект.ОбменДанными.Загрузка = Истина;
		КонтекстПриСменеКлюча.ДокОбъект.ДополнительныеСвойства.Вставить("ВосстановлениеПоследовательности", Истина);			
		КонтекстПриСменеКлюча.ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		КонтекстПриСменеКлюча.ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);	
		ИтогПроверкиОбновленияДокумента.ОбновлятьДокумент = Истина;			
		
	КонецЕсли;
	
	Если ИтогПроверкиОбновленияДокумента.ОбновлятьДокумент Тогда 
		
		ВсеОтборыПоказанийДокумента = ИтогПроверкиОбновленияДокумента.ВсеОтборыПоказанийДокумента;
		Если ВсеОтборыПоказанийДокумента.Количество() > 0 Тогда
			ОбновитьДанныеПодчиненногоРегистра(ПеременныеПриСменеКлюча, ВсеОтборыПоказанийДокумента, НаборПоказаний, ЕстьОтклонениеЗоны);
		КонецЕсли;			
		
	КонецЕсли;
	
	Если НЕ ЕстьВвод Тогда 	
		
		// Не подчиненные
		СтатическийКонтекст.НаборПредоставленных.Очистить();
		СтатическийКонтекст.НаборМаксимальныеПоказания.Очистить();		
		Если НЕ СтатическийКонтекст.НаборРасчетСреднего = Неопределено Тогда 
			СтатическийКонтекст.НаборРасчетСреднего.Очистить();
		КонецЕсли;
		// СтатическийКонтекст.НаборМаксимальныеПоказанияСрез = Неопределено; //надо всегда перезаписывать срез
		
		Возврат;
		
	КонецЕсли;
	
	ОчиститьСтрокиСменыПоказаний(СтатическийКонтекст.НаборПредоставленных, СтатическийКонтекст.СтрокиСменыПоказанийНаборПредоставленных);
	ОчиститьСтрокиСменыПоказаний(СтатическийКонтекст.НаборМаксимальныеПоказания, СтатическийКонтекст.СтрокиСменыПоказанийНаборМаксимальныеПоказания);
	ОчиститьСтрокиСменыПоказаний(СтатическийКонтекст.НаборРасчетСреднего, СтатическийКонтекст.СтрокиСменыПоказанийНаборРасчетСреднего);
	
КонецПроцедуры

Процедура ОчиститьСтрокиСменыПоказаний(НаборЗаписей, СтрокиСменыПоказаний)
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокиСменыПоказаний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиСменыПоказаний.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	Для Каждого СтрокаСменыПоказаний Из СтрокиСменыПоказаний Цикл
		
		НаборЗаписей.Удалить(СтрокаСменыПоказаний.Значение);	
		
	КонецЦикла; 	
	
КонецПроцедуры

Процедура ОбновитьДанныеПодчиненногоРегистра(ПеременныеПриСменеКлюча, ДанныеПодчиненногоРегистра, НаборПоказаний, ЕстьОтклонениеЗоны)
	
	ПриборУчета = ПеременныеПриСменеКлюча.ТекПрибор;
	ДокРегистратор = ПеременныеПриСменеКлюча.ТекДокумент;
	
	НаборПоказаний = СоздатьНаборЗаписей(РегистрыСведений.энргПоказанияПриборовУчета);
	НаборПоказаний.Отбор.Регистратор.Установить(ДокРегистратор);
	ТаблицаПоказаний = ПрочитатьНаборПоказанийПриборов(ДокРегистратор);
	
	Для Каждого СтрокаНаборПодчиненного из ДанныеПодчиненногоРегистра Цикл 
		СтрокиПоказаний = ТаблицаПоказаний.НайтиСтроки(СтрокаНаборПодчиненного.ОтборСтрок); 
		Если СтрокиПоказаний.Количество() = 0 тогда 	
			// Движений по данному пу нету.	
			//Если СтрокаПоказаний.ТекущиеПоказания > 0 тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПриборУчета);
			//КонецЕсли;				
		иначеЕсли СтрокиПоказаний.Количество() > 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не восстановлена последовательность в документе " + ДокРегистратор + " по прибору " + ПриборУчета);
		иначе
			
			ДанныеСтроки = СтрокаНаборПодчиненного.ДанныеЗаписи;
			
			СтрокаПоказаний  						= СтрокиПоказаний[0];
			СтрокаПоказаний.Показание 				= ДанныеСтроки.ТекущиеПоказания;
			СтрокаПоказаний.Переворот 				= ДанныеСтроки.Переворот;
			СтрокаПоказаний.СостояниеПоказаний 		= ДанныеСтроки.СостояниеПоказаний;
			СтрокаПоказаний.ПричинаОтклонения 		= ДанныеСтроки.ПричинаОтклонения;
			
			Если ЕстьОтклонениеЗоны И НЕ СтрокаПоказаний.СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены Тогда 
				СтрокаПоказаний.СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены;
				СтрокаПоказаний.ПричинаОтклонения = СтатическийКонтекст.ОшибкаДругойЗоны;
			КонецЕсли; 			
			
		КонецЕсли;			
		
	КонецЦикла;
	
	НаборПоказаний.Загрузить(ТаблицаПоказаний); 
	
КонецПроцедуры

Процедура ИнициализироватьЗапросПоказанийПодчиненногоРегистра()
	
	ЗапросПоказанийПодчиненногоРегистра = Новый Запрос;
	ЗапросПоказанийПодчиненногоРегистра.Текст = 
	"ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.Период КАК Период,
	|	энргПоказанияПриборовУчета.Регистратор КАК Регистратор,
	|	энргПоказанияПриборовУчета.НомерСтроки КАК НомерСтроки,
	|	ИСТИНА КАК Активность,
	|	энргПоказанияПриборовУчета.Организация КАК Организация,
	|	энргПоказанияПриборовУчета.Район КАК Район,
	|	энргПоказанияПриборовУчета.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргПоказанияПриборовУчета.Разделитель КАК Разделитель,
	|	энргПоказанияПриборовУчета.УдалитьАбонент КАК УдалитьАбонент,
	|	энргПоказанияПриборовУчета.Показание КАК Показание,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	энргПоказанияПриборовУчета.КС КАК КС,
	|	энргПоказанияПриборовУчета.ИсточникПоказаний КАК ИсточникПоказаний,
	|	энргПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	энргПоказанияПриборовУчета.Переворот КАК Переворот,
	|	энргПоказанияПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПриборовУчета.ПериодРегистрации КАК ПериодРегистрации,
	|	энргПоказанияПриборовУчета.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	энргПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|ГДЕ
	|	энргПоказанияПриборовУчета.Регистратор = &Регистратор";
	
КонецПроцедуры

Функция ПрочитатьНаборПоказанийПриборов(ДокРегистратор)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	энргПоказанияПриборовУчета.Период КАК Период,
	//	|	энргПоказанияПриборовУчета.Регистратор КАК Регистратор,
	//	|	энргПоказанияПриборовУчета.НомерСтроки КАК НомерСтроки,
	//	|	ИСТИНА КАК Активность,
	//	|	энргПоказанияПриборовУчета.Организация КАК Организация,
	//	|	энргПоказанияПриборовУчета.Район КАК Район,
	//	|	энргПоказанияПриборовУчета.КлючПомещения КАК КлючПомещения,
	//	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчета,
	//	|	энргПоказанияПриборовУчета.Шкала КАК Шкала,
	//	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	//	|	энргПоказанияПриборовУчета.Разделитель КАК Разделитель,
	//	|	энргПоказанияПриборовУчета.УдалитьАбонент КАК УдалитьАбонент,
	//	|	энргПоказанияПриборовУчета.Показание КАК Показание,
	//	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	//	|	энргПоказанияПриборовУчета.КС КАК КС,
	//	|	энргПоказанияПриборовУчета.ИсточникПоказаний КАК ИсточникПоказаний,
	//	|	энргПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	//	|	энргПоказанияПриборовУчета.Переворот КАК Переворот,
	//	|	энргПоказанияПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	//	|	энргПоказанияПриборовУчета.ПериодРегистрации КАК ПериодРегистрации,
	//	|	энргПоказанияПриборовУчета.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	//	|	энргПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета
	//	|ИЗ
	//	|	РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	//	|ГДЕ
	//	|	энргПоказанияПриборовУчета.Регистратор = &Регистратор";
	
	ЗапросПоказанийПодчиненногоРегистра.УстановитьПараметр("Регистратор", ДокРегистратор);
	РезультатЗапроса = ЗапросПоказанийПодчиненногоРегистра.Выполнить();
	Результат = РезультатЗапроса.Выгрузить();
	Возврат Результат;
	
КонецФункции 

Процедура ЗаписатьСвязанныеРегистры()
	
	СтатическийКонтекст.НаборПредоставленных.Записать();
	СтатическийКонтекст.НаборМаксимальныеПоказания.Записать();
	
	Если НЕ СтатическийКонтекст.НаборМаксимальныеПоказанияСрез = Неопределено Тогда 
		СтатическийКонтекст.НаборМаксимальныеПоказанияСрез.Записать();
	КонецЕсли;
	
	Если НЕ СтатическийКонтекст.НаборРасчетСреднего = Неопределено Тогда
		СтатическийКонтекст.НаборРасчетСреднего.Записать();
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДанныхНаГраницуДокумента

Процедура ЗаполнитьДанныеНаГраницуИМоментДокумента(ДанныеНаГраницуИМоментДокумента, Выборка, СоответствиеТЗ)
	
	КлючПрибора = ДанныеНаГраницуИМоментДокумента[Выборка.ПриборУчета];		
	
	ЕстьШкалаПрибора = НЕ КлючПрибора[Выборка.Шкала] = Неопределено;
	Если НЕ ЕстьШкалаПрибора Тогда
		
		СтрокаГраницы = ЗаполнитьДанныеТарифнойЗоныНаГраницуИМоментДокумента(Выборка);	
		СоответствиеТЗ.Вставить(Выборка.ТарифнаяЗона, СтрокаГраницы);	
		КлючПрибора.Вставить(Выборка.Шкала, СоответствиеТЗ); 			
		
	КонецЕсли;
	
	КлючПриборШкала = КлючПрибора[Выборка.Шкала]; 	
	ЕстьТарифнаяЗонаПрибора = НЕ КлючПриборШкала[Выборка.ТарифнаяЗона] = Неопределено;
	
	Если НЕ ЕстьТарифнаяЗонаПрибора Тогда
		
		СтрокаГраницы = ЗаполнитьДанныеТарифнойЗоныНаГраницуИМоментДокумента(Выборка);
		КлючПриборШкала.Вставить(Выборка.ТарифнаяЗона, СтрокаГраницы); 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьДанныеТарифнойЗоныНаГраницуИМоментДокумента(Выборка)
	
	Результат = Новый Структура(ОбщееОписаниеДокумента);
	Результат.НомерПозиции = Выборка.НомерПозици + 1;
	Результат.ПредыдущиеМакс = Выборка.МаксПоказания;
	Результат.ПериодПредыдущихМаксПок = Выборка.ПериодМаксПоказаний;
	Результат.РегистраторМаксимальных = Выборка.РегистраторМаксПоказаний;
	Результат.ДатаРегистратораМаксимальных = Выборка.ДатаРегистратораМаксимальных;
	
	Результат.НомерПозицииМомент = Результат.НомерПозиции;
	Результат.ПредыдущиеМаксМомент = Результат.ПредыдущиеМакс;
	Результат.ПериодПредыдущихМаксПокМомент = Результат.ПериодПредыдущихМаксПок;
	Результат.РегистраторМаксимальныхМомент = Результат.РегистраторМаксимальных;
	Результат.ДатаРегистратораМаксимальныхМомент = Результат.ДатаРегистратораМаксимальных;
	
	Результат.ЭтоВвод = Ложь;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьСтрокуДанныхНаГраницуИМоментДокумента(СтрокаДанных, Обновить)
	
	Если Обновить Тогда
		
		СтрокаДанных.НомерПозиции = СтрокаДанных.НомерПозицииМомент;
		СтрокаДанных.ПредыдущиеМакс = СтрокаДанных.ПредыдущиеМаксМомент;
		СтрокаДанных.ПериодПредыдущихМаксПок = СтрокаДанных.ПериодПредыдущихМаксПокМомент;
		СтрокаДанных.РегистраторМаксимальных = СтрокаДанных.РегистраторМаксимальныхМомент;
		СтрокаДанных.ДатаРегистратораМаксимальных = СтрокаДанных.ДатаРегистратораМаксимальныхМомент;
		
	Иначе 
		
		СтрокаДанных.НомерПозицииМомент = СтрокаДанных.НомерПозиции;
		СтрокаДанных.ПредыдущиеМаксМомент = СтрокаДанных.ПредыдущиеМакс;
		СтрокаДанных.ПериодПредыдущихМаксПокМомент = СтрокаДанных.ПериодПредыдущихМаксПок;
		СтрокаДанных.РегистраторМаксимальныхМомент = СтрокаДанных.РегистраторМаксимальных;
		СтрокаДанных.ДатаРегистратораМаксимальныхМомент = СтрокаДанных.ДатаРегистратораМаксимальных;
		
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция ОбщееОписаниеСостоянияДокумента()
	
	ОписаниеДанныхНаГраницуДокумента = "НомерПозиции,ПредыдущиеМакс,ПериодПредыдущихМаксПок,РегистраторМаксимальных,ДатаРегистратораМаксимальных";
	ОписаниеДанныхНаМоментДокумента = "НомерПозицииМомент,ПредыдущиеМаксМомент,ПериодПредыдущихМаксПокМомент,РегистраторМаксимальныхМомент,ДатаРегистратораМаксимальныхМомент,ЭтоВвод";
	ОписанияДанныхДокумента = Новый Массив;
	ОписанияДанныхДокумента.Добавить(ОписаниеДанныхНаГраницуДокумента);
	ОписанияДанныхДокумента.Добавить(ОписаниеДанныхНаМоментДокумента);
	Результат = СтрСоединить(ОписанияДанныхДокумента, ",");
	
	Возврат Результат;
	
КонецФункции

Функция НовыеПараметрыОперации()
	
	Результат = Новый Структура(
		"ДокОбъект,КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,ПредыдущиеМакс,
		|ПериодПредыдущихМаксПок,СостояниеПоказаний,ПричинаОтклонения,ДанныеМаксимальногоПотребления,
		|Переворот,НомерСтрокиТЧ,Разделитель,ДанныеСреднегоОбъема,МаксимальноВозможныеПоказания,
		|КоэффициентПУ,ИмяТабЧасти,КС,НедопускПрибора,ЭтоНовыйВидДифф,ТипДокумента");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбновлениеДанныхВДокументе

Процедура ОбновитьДанныеВДокументе(ПериодНачисления, ДокРегистратор, ПараметрыОперации, КонтекстПриСменеКлюча)
	
	ИтогПроверкиОбновленияДокумента	= КонтекстПриСменеКлюча.ИтогПроверкиОбновленияДокумента;
	ПоказанияПриняты 				= СтатическийКонтекст.ПоказанияПриняты;
	ЭтоОперацияСПрибором			= ПараметрыОперации.ТипДокумента = Тип("ДокументСсылка.энргОперацияСПриборомУчета");
	ЭтоСменаВидаДиффер				= ПараметрыОперации.ТипДокумента = Тип("ДокументСсылка.энргУстановитьВидДифференцированностиПриборУчета");
	ДокОбъект  						= ПараметрыОперации.ДокОбъект;
	ДокОбъект.ДополнительныеСвойства.вставить("ВосстановлениеПоследовательности", Истина);
	
	Если ЗначениеЗаполнено(ПараметрыОперации.ИмяТабЧасти) тогда
		ИмяТЧ = ПараметрыОперации.ИмяТабЧасти;
	иначе
		ИмяТЧ = ИмяТабличнойЧастиПоказаний(ДокРегистратор);
	КонецЕсли;
	
	тчТочкиУчета 	= ДокОбъект["ТочкиУчета"];
	тчШкалыПриборов = ДокОбъект["ШкалыПриборовУчета"];
	тчПоказания 	= ДокОбъект["ПоказанияПриборовУчета"];
	
	Если ПараметрыОперации.НомерСтрокиТЧ > 0 тогда
		
		СтрокаПоказаний	= тчПоказания[ПараметрыОперации.НомерСтрокиТЧ-1];
		СтрокиШкал = тчШкалыПриборов.НайтиСтроки(Новый Структура("IDСтроки", СтрокаПоказаний.IDСтроки));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;		
		
		СтрокаШкалы 	= СтрокиШкал[0];
		СтрокиТочки		= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", 		СтрокаШкалы.IDСтрокиТочкиУчета));
		ЭтоНовыйВидДифф	= Истина;
		
		Если ЭтоОперацияСПрибором и СтрокиТочки.Количество() = 0 Тогда
			СтрокиТочки	= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиВывод", СтрокаШкалы.IDСтрокиТочкиУчета));
		КонецЕсли; 
		Если ЭтоСменаВидаДиффер и СтрокиТочки.Количество() = 0 Тогда
			СтрокиТочки	= тчТочкиУчета.НайтиСтроки(Новый Структура("IDСтрокиВывод", СтрокаШкалы.IDСтрокиТочкиУчета));
			ЭтоНовыйВидДифф	= Ложь;
		КонецЕсли;
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
		КонецЕсли;
		Если ЭтоСменаВидаДиффер И ЭтоНовыйВидДифф Тогда
			// Тарифная зона по новому виду дифференцированности. По строкам нового вида диф не должны обновляться строки
			ПараметрыОперации.ЭтоНовыйВидДифф = Истина;
			Возврат;
		КонецЕсли;
		
		СтрокаТочки = СтрокиТочки[0];
		
	иначе		
		
		СтрокиТочки	= тчТочкиУчета.найтиСтроки(Новый Структура("ПриборУчета",ПараметрыОперации.ПриборУчета));
		Если СтрокиТочки.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;		
		СтрокаТочки  = СтрокиТочки[0];
		
		СтрокиШкал = тчШкалыПриборов.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета, Шкала",СтрокаТочки.IDСтроки, ПараметрыОперации.Шкала));
		Если СтрокиШкал.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета "   +  ПараметрыОперации.ПриборУчета + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаШкалы = СтрокиШкал[0];
		СтрокиПоказаний = тчПоказания.НайтиСтроки(Новый Структура("IDСтроки, ТарифнаяЗона", СтрокаШкалы.IDСтроки, ПараметрыОперации.ТарифнаяЗона));
		Если СтрокиПоказаний.Количество() <> 1 тогда
			// Исключительная ситуация когда в документе у одного прибора учета показания указаны более одного раза.
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе " + ДокРегистратор + " для шкалы - " + ПараметрыОперации.Шкала + " прибора учета " +  ПараметрыОперации.ПриборУчета + " и тарифной зоны " +  ПараметрыОперации.ТарифнаяЗона  + " найдено более одной строки");
		КонецЕсли;
		
		СтрокаПоказаний = СтрокиПоказаний[0];
		
	КонецЕсли;  
	
	ДанныеСреднегоОбъема = ПараметрыОперации.ДанныеСреднегоОбъема; 	
	
	Если СтрокаТочки = Неопределено тогда
		СреднийОбъема = 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета] = Неопределено тогда
		СреднийОбъема = 0;
	ИначеЕсли  ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала] = Неопределено тогда
		СреднийОбъема = 0;
	ИначеЕсли ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона] = Неопределено тогда
		СреднийОбъема = 0;
	иначе
		СреднийОбъема = ДанныеСреднегоОбъема[СтрокаТочки.ТочкаУчета][ПараметрыОперации.Шкала][ПараметрыОперации.ТарифнаяЗона];
	КонецЕсли;
	
	ДанныеМаксимальногоПотребления = ПараметрыОперации.ДанныеМаксимальногоПотребления;
	Если ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга] = Неопределено тогда
		МаксимальноВозможныйОбъемПотребления = 1000;
	иначе 
		СтрокаСоотвествия = ДанныеМаксимальногоПотребления[СтрокаТочки.Услуга];
		МаксимальноВозможныйОбъемПотребления = СтрокаСоотвествия.ПовышающийКоэффициент * СтрокаСоотвествия.МаксимальноеПотребления;	
	КонецЕсли;
	
	ДанныеСтроки = энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ДанныеСтрокиПоказаний();
	ЗаполнитьЗначенияСвойств(
		ДанныеСтроки,
		СтрокаПоказаний,
		"ТекущиеПоказания,Разница,ПереворотИзмененПользователем,СтатусИзмененПользователем,Сумма,ЗначениеТарифа");
	ЗаполнитьЗначенияСвойств(
		ДанныеСтроки,
		ПараметрыОперации,
		"СостояниеПоказаний,ПричинаОтклонения,МаксимальноВозможныеПоказания,КоэффициентПУ,Переворот");	
		
	ДанныеСтроки.ПредыдущиеПоказания 					= ПараметрыОперации.ПредыдущиеМакс;
	ДанныеСтроки.ДатаПоследнихПоказаний 				= НачалоДня(ПараметрыОперации.ПериодПредыдущихМаксПок);
	ДанныеСтроки.СреднийОбъемПотребления 				= СреднийОбъема;
	ДанныеСтроки.МаксимальноВозможныйОбъемПотребления	= МаксимальноВозможныйОбъемПотребления;
	КонтрольныйСъем 									= ПараметрыОперации.КС;
	ДопПараменты	= Новый Структура("ПриборУчета", СтрокаТочки.ПриборУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиентСервер.ПересчитатьСтрокуПриборовУчета(ДанныеСтроки, ПериодНачисления,КонтрольныйСъем,ДопПараменты);
	
	Если ПараметрыОперации.НедопускПрибора Тогда
		ДанныеСтроки.СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены;
	КонецЕсли;
	
	Если КонтекстПриСменеКлюча.ЕстьОтклонениеЗоны И ДанныеСтроки.СостояниеПоказаний = СтатическийКонтекст.ПоказанияПриняты Тогда 
		ДанныеСтроки.СостояниеПоказаний = СтатическийКонтекст.ПоказанияОтклонены;
		ДанныеСтроки.ПричинаОтклонения = СтатическийКонтекст.ОшибкаДругойЗоны;
	КонецЕсли;		
	
	ИтогПроверкиОбновленияДокумента.ВсеСтрокиПоказанийДокумента.Добавить(СтрокаПоказаний);
	НоваяСтрокаОбновленияРегистра = Новый Структура;
		ОтборСтрокПоказаний = Новый Структура(
		"КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,Разделитель",
		ПараметрыОперации.КлючПомещения, 
		ПараметрыОперации.ПриборУчета,
		ПараметрыОперации.Шкала,
		ПараметрыОперации.ТарифнаяЗона,
		ПараметрыОперации.Разделитель);
	
	НоваяСтрокаОбновленияРегистра.Вставить("ОтборСтрок", ОтборСтрокПоказаний);
	НоваяСтрокаОбновленияРегистра.Вставить("ДанныеЗаписи", ДанныеСтроки);
	ИтогПроверкиОбновленияДокумента.ВсеОтборыПоказанийДокумента.Добавить(НоваяСтрокаОбновленияРегистра);
	
	Если ДанныеСтрокиИзменены(ДанныеСтроки, СтрокаПоказаний) тогда
		// Если что то изменилось в документе.
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, ДанныеСтроки);				
		ДокОбъект.ДополнительныеСвойства.Вставить("ВосстановлениеПоследовательности",Истина);
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);	
		
		ИтогПроверкиОбновленияДокумента.ОбновлятьДокумент = Истина;
		
	КонецЕсли;
	
	Если ДанныеСтроки.СостояниеПоказаний <> ПараметрыОперации.СостояниеПоказаний или ДанныеСтроки.Переворот <> ПараметрыОперации.Переворот тогда
		
		НоваяСтрокаОбновленияРегистра = Новый Структура;
		ОтборСтрокПоказаний = Новый Структура(
			"КлючПомещения,ПриборУчета,Шкала,ТарифнаяЗона,Разделитель",
			ПараметрыОперации.КлючПомещения, 
			ПараметрыОперации.ПриборУчета, 
			ПараметрыОперации.Шкала,
			ПараметрыОперации.ТарифнаяЗона,
			ПараметрыОперации.Разделитель);
			
		НоваяСтрокаОбновленияРегистра.Вставить("ОтборСтрок", ОтборСтрокПоказаний);
		НоваяСтрокаОбновленияРегистра.Вставить("ДанныеЗаписи", ДанныеСтроки);
		ИтогПроверкиОбновленияДокумента.ДанныеПодчиненногоРегистра.Добавить(НоваяСтрокаОбновленияРегистра);
		
		ПараметрыОперации.СостояниеПоказаний = ДанныеСтроки.СостояниеПоказаний;
		ПараметрыОперации.Переворот = ДанныеСтроки.Переворот;
				
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеСтрокиИзменены(Источник,Приемник)	
	
	для Каждого КлючЗначение из Источник цикл
		Если Источник[КлючЗначение.ключ] <> Приемник[КлючЗначение.ключ] тогда
			Возврат Истина;
			Прервать;				
		КонецЕсли;  		
	КонецЦикла; 	
	Возврат Ложь;
	
КонецФункции

Функция ИмяТабличнойЧастиПоказаний(Регистратор)
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргКвитанция") тогда
		Возврат "ПриборыУчета";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОбходнойЛист")	тогда
		Возврат "ПриборыУчета";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСЛицевымСчетом")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС тогда
			Возврат "ТочкиУчетаЗакрытие";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли  ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчета")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ тогда
			Возврат "ПоказанияПУВВод";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ тогда
			Возврат "ПоказанияПУЗамена";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ тогда
			Возврат "ПоказанияПУВывод";	
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСУслугами")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги тогда
			Возврат "ТочкиУчета";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие")	тогда	
		Возврат "Показания";
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента")	тогда	
		Возврат "ПриборыУчета";			
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера")	тогда	
		Возврат "ПриборыУчета";		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера")	тогда	
		Возврат "ПриборыУчета";		
	иначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргРегистрацияПоказанийМКД") тогда
		Возврат "ПриборыУчета";
	ИначеЕсли  ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСПриборомУчетаМКД")	тогда
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ тогда
			Возврат "ПоказанияПУВВод";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ тогда
			Возврат "ПоказанияПУЗамена";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ тогда
			Возврат "ПоказанияПУВывод";	
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");	
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОперацияСУслугамиМКД")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги тогда
			Возврат "ТочкиУчетаВывод";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОткрытиеМКД")	тогда	
		Если Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие тогда
			Возврат "ТочкиУчета";
		ИначеЕсли Регистратор.ВидОперации  = Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие тогда
			Возврат "ТочкиУчетаВывод";
		иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
		КонецЕсли; 
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргОбходнойЛистМКД")	тогда
		Возврат "ПриборыУчета";

	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вид операции");
	КонецЕсли; 	
КонецФункции

#КонецОбласти

#Область СменаСтатусаПроведенияВПоследовательности

Процедура ЗапомнитьУспешныйСтатусПроведенияВПоследовательности(КонтекстПриСменеКлюча, ПеременныеПриСменеКлюча)
	
	Если НЕ КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные[ПеременныеПриСменеКлюча.ТекДокумент] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерэнргПоказанияПУПоследовательность = МенеджерыРегистров.энргПоказанияПУПоследовательность;
	
	ЗапросПоследовательности.УстановитьПараметр("Организация", Организация);
	ЗапросПоследовательности.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	ЗапросПоследовательности.УстановитьПараметр("Район", Район);
	ЗапросПоследовательности.УстановитьПараметр("СостояниеПроведения", СтатическийКонтекст.ПроведенСНарушением);
	ЗапросПоследовательности.УстановитьПараметр("ЧастныйСектор", ПеременныеПриСменеКлюча.ТекЧастныйСектор);
	ЗапросПоследовательности.УстановитьПараметр("Строение", ПеременныеПриСменеКлюча.ТекСтроение);
	ЗапросПоследовательности.УстановитьПараметр("Помещение", ПеременныеПриСменеКлюча.ТекПомещение);
	ЗапросПоследовательности.УстановитьПараметр("ПриборУчета", ПеременныеПриСменеКлюча.ТекПрибор);
	ЗапросПоследовательности.УстановитьПараметр("ДокРегистратор", ПеременныеПриСменеКлюча.ТекДокумент);
	ЗапросПоследовательности.УстановитьПараметр("ПроведенВПоследовательности", СтатическийКонтекст.ПроведенВПоследовательности); 	
	РезультатЗапроса = ЗапросПоследовательности.Выполнить();
	ТаблицаНабора = РезультатЗапроса.Выгрузить();
	
	Если ТаблицаНабора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборыЗаписей = Новый Массив;//Необходимо сохранять последовательность записи
	
	НаборПоследовательности = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);
	НаборПоследовательности.Отбор.ДокРегистратор.Установить(ПеременныеПриСменеКлюча.ТекДокумент);
	НаборПоследовательности.Отбор.Организация.Установить(Организация);
	НаборПоследовательности.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборПоследовательности.Отбор.Район.Установить(Район);
	НаборПоследовательности.Отбор.СостояниеПроведения.Установить(СтатическийКонтекст.ПроведенСНарушением);
	НаборПоследовательности.Отбор.ЧастныйСектор.Установить(ПеременныеПриСменеКлюча.ТекЧастныйСектор);
	НаборПоследовательности.Отбор.Строение.Установить(ПеременныеПриСменеКлюча.ТекСтроение);
	НаборПоследовательности.Отбор.Помещение.Установить(ПеременныеПриСменеКлюча.ТекПомещение);
	НаборПоследовательности.Отбор.ПриборУчета.Установить(ПеременныеПриСменеКлюча.ТекПрибор);	
	НаборыЗаписей.Добавить(НаборПоследовательности);	
	
	НаборПоследовательности = СоздатьНаборЗаписей(МенеджерэнргПоказанияПУПоследовательность);
	НаборПоследовательности.ДополнительныеСвойства.Вставить("ЗамещатьЗаписи", Ложь);
	НаборПоследовательности.Загрузить(ТаблицаНабора);
	НаборыЗаписей.Добавить(НаборПоследовательности);
	
	КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные.Вставить(ПеременныеПриСменеКлюча.ТекДокумент, НаборыЗаписей);
	
КонецПроцедуры

Процедура ЗаписатьНаборыПоследовательности(КонтекстПриСменеКлюча)
	
	Для Каждого СтрокаКлючЗначение Из КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные Цикл 
		
		Для Каждого НабораЗаписей Из СтрокаКлючЗначение.Значение Цикл
			Замещать = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НабораЗаписей.ДополнительныеСвойства, "ЗамещатьЗаписи", Истина);
			НабораЗаписей.Записать(Замещать);
		КонецЦикла;
		
	КонецЦикла; 	
		
КонецПроцедуры

Процедура ИнициализироватьЗапросПоследовательности()
	
	ЗапросПоследовательности = Новый Запрос;
	ЗапросПоследовательности.Текст = 
		"ВЫБРАТЬ
		|	энргПоказанияПУПоследовательность.Организация КАК Организация,
		|	энргПоказанияПУПоследовательность.ПериодНачисления КАК ПериодНачисления,
		|	энргПоказанияПУПоследовательность.Район КАК Район,
		|	&ПроведенВПоследовательности КАК СостояниеПроведения,
		|	энргПоказанияПУПоследовательность.ЧастныйСектор КАК ЧастныйСектор,
		|	энргПоказанияПУПоследовательность.Строение КАК Строение,
		|	энргПоказанияПУПоследовательность.Помещение КАК Помещение,
		|	энргПоказанияПУПоследовательность.ПриборУчета КАК ПриборУчета,
		|	энргПоказанияПУПоследовательность.ПериодРегистрации КАК ПериодРегистрации,
		|	энргПоказанияПУПоследовательность.Разделитель КАК Разделитель,
		|	энргПоказанияПУПоследовательность.ДатаРегистратора КАК ДатаРегистратора,
		|	энргПоказанияПУПоследовательность.ДокРегистратор КАК ДокРегистратор,
		|	энргПоказанияПУПоследовательность.УдалитьАбонент КАК УдалитьАбонент,
		|	энргПоказанияПУПоследовательность.ВыводПрибораУчета КАК ВыводПрибораУчета,
		|	энргПоказанияПУПоследовательность.ИмяТабЧасти КАК ИмяТабЧасти
		|ИЗ
		|	РегистрСведений.энргПоказанияПУПоследовательность КАК энргПоказанияПУПоследовательность
		|ГДЕ
		|	энргПоказанияПУПоследовательность.Организация = &Организация
		|	И энргПоказанияПУПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргПоказанияПУПоследовательность.Район = &Район
		|	И энргПоказанияПУПоследовательность.СостояниеПроведения = &СостояниеПроведения
		|	И энргПоказанияПУПоследовательность.ЧастныйСектор = &ЧастныйСектор
		|	И энргПоказанияПУПоследовательность.Строение = &Строение
		|	И энргПоказанияПУПоследовательность.Помещение = &Помещение
		|	И энргПоказанияПУПоследовательность.ПриборУчета = &ПриборУчета
		|	И энргПоказанияПУПоследовательность.ДокРегистратор = &ДокРегистратор";
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСИсключеннымВПоследовательности

Процедура ПодготовитьРегистрыИсключенногоИзПоследовательности(КонтекстПриСменеКлюча, Выборка, ДанныеНаГраницуДокумента) 
	
	КонтекстПриСменеКлюча.ДокументИсключен = Истина;
	ИсключенныеДокументы = КонтекстПриСменеКлюча.НаборыИсключенныхДокументов;
	
	// Очищаем данные.
	Если КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные[Выборка.ДокРегистратор] = Неопределено Тогда 
		НаборПоследовательности = СоздатьНаборЗаписей(МенеджерыРегистров.энргПоказанияПУПоследовательность);
		НаборПоследовательности.Отбор.ДокРегистратор.Установить(Выборка.ДокРегистратор);
		НаборПоследовательности.Отбор.Организация.Установить(Организация);
		НаборПоследовательности.Отбор.ПериодНачисления.Установить(ПериодНачисления);
		НаборПоследовательности.Отбор.Район.Установить(Район);
		НаборПоследовательности.Отбор.СостояниеПроведения.Установить(Выборка.СостояниеПроведения);
		НаборПоследовательности.Отбор.ЧастныйСектор.Установить(Выборка.ЧастныйСектор);
		НаборПоследовательности.Отбор.Строение.Установить(Выборка.Строение);
		НаборПоследовательности.Отбор.Помещение.Установить(Выборка.Помещение);
		НаборПоследовательности.Отбор.ПриборУчета.Установить(Выборка.ПриборУчета);
		//НаборПоследовательности.Отбор.ПериодРегистрации.Установить(Выборка.ПериодРегистрации);
		//НаборПоследовательности.Отбор.ДатаРегистратора.Установить(Выборка.ДатаРегистратора);
		НовыйНабор = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НаборПоследовательности);
		КонтекстПриСменеКлюча.НаборыПоказанияПУПоследовательностьИсключенные.Вставить(Выборка.ДокРегистратор, НовыйНабор);
	КонецЕсли;
	
	Если ИсключенныеДокументы[МенеджерыРегистров.энргМаксимальныеПоказания] = Неопределено Тогда
		НаборМаксПоказаний = СоздатьНаборЗаписей(МенеджерыРегистров.энргМаксимальныеПоказания);
		НаборМаксПоказаний.Отбор.Период.Установить(Выборка.ПериодРегистрации);
		НаборМаксПоказаний.Отбор.ДокРегистратор.Установить(Выборка.ДокРегистратор);
		НаборМаксПоказаний.Отбор.Организация.Установить(Организация);
		НаборМаксПоказаний.Отбор.Район.Установить(Район);
		НаборМаксПоказаний.Отбор.КлючПомещения.Установить(Выборка.КлючПомещения);
		НаборМаксПоказаний.Отбор.ПриборУчета.Установить(Выборка.ПриборУчета);
		ИсключенныеДокументы.Вставить(МенеджерыРегистров.энргМаксимальныеПоказания, НаборМаксПоказаний);
	КонецЕсли;
	
	Если ИсключенныеДокументы[МенеджерыРегистров.энргПредоставленныеПоказания] = Неопределено Тогда
		НаборПредоставленных = СоздатьНаборЗаписей(МенеджерыРегистров.энргПредоставленныеПоказания);
		НаборПредоставленных.Отбор.ДокРегистратор.Установить(Выборка.ДокРегистратор);
		НаборПредоставленных.Отбор.Организация.Установить(Организация);
		НаборПредоставленных.Отбор.ПериодНачисления.Установить(ПериодНачисления);
		НаборПредоставленных.Отбор.Район.Установить(Район);
		НаборПредоставленных.Отбор.ЧастныйСектор.Установить(Выборка.ЧастныйСектор);
		НаборПредоставленных.Отбор.Строение.Установить(Выборка.Строение);
		НаборПредоставленных.Отбор.Помещение.Установить(Выборка.Помещение);
		НаборПредоставленных.Отбор.ПриборУчета.Установить(Выборка.ПриборУчета);
		ИсключенныеДокументы.Вставить(МенеджерыРегистров.энргПредоставленныеПоказания, НаборПредоставленных);
	КонецЕсли;
	
	НаборМаксПоказанийСрез = ИсключенныеДокументы[МенеджерыРегистров.энргМаксимальныеПоказанияСрез];
	Если НаборМаксПоказанийСрез = Неопределено Тогда
		
		НаборМаксПоказанийСрез = СоздатьНаборЗаписей(МенеджерыРегистров.энргМаксимальныеПоказанияСрез);
		НаборМаксПоказанийСрез.Отбор.Организация.Установить(Организация);
		НаборМаксПоказанийСрез.Отбор.ПериодНачисления.Установить(ПериодНачисления);
		НаборМаксПоказанийСрез.Отбор.Район.Установить(Район);
		НаборМаксПоказанийСрез.Отбор.ЧастныйСектор.Установить(Выборка.ЧастныйСектор);
		НаборМаксПоказанийСрез.Отбор.Строение.Установить(Выборка.Строение);
		НаборМаксПоказанийСрез.Отбор.Помещение.Установить(Выборка.Помещение);
		НаборМаксПоказанийСрез.Отбор.ПриборУчета.Установить(Выборка.ПриборУчета);
		ИсключенныеДокументы.Вставить(МенеджерыРегистров.энргМаксимальныеПоказанияСрез, НаборМаксПоказанийСрез);
		
		//КлючПоказанийСреза = ИсключенныеДокументы[МенеджерыРегистров.энргМаксимальныеПоказанияСрез];
		
	КонецЕсли;
	
	НаборМаксПоказанийСрез.Очистить(); // При тарфиных зонах обновляем записи, чтобы корректно записать при смене документа
	//НаборМаксПоказанийСрез = КлючПоказанийСреза;
	Для Каждого КлючЗначениеШкалы из ДанныеНаГраницуДокумента Цикл 
		Для Каждого КлючЗначениеТарифнойЗоны из КлючЗначениеШкалы.Значение Цикл 
			НоваяСтрока = НаборМаксПоказанийСрез.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "ЧастныйСектор,Строение,Помещение,ПриборУчета");
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.ПериодНачисления = ПериодНачисления;
			НоваяСтрока.Район = Район;
			НоваяСтрока.Шкала = КлючЗначениеШкалы.Ключ;
			НоваяСтрока.ТарифнаяЗона = КлючЗначениеТарифнойЗоны.Ключ;
			НоваяСтрока.Показания = КлючЗначениеТарифнойЗоны.Значение.ПредыдущиеМакс;
			НоваяСтрока.ДокРегистратор = КлючЗначениеТарифнойЗоны.Значение.РегистраторМаксимальных;
			НоваяСтрока.ДатаРегистратора = КлючЗначениеТарифнойЗоны.Значение.ДатаРегистратораМаксимальных;		
		КонецЦикла;		
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСНаборамиЗаписей

Процедура ДополнитьНаборЗаписейВСоответствиеПредоставленныеПоказания(МенеджерРегистра, Выборка)
	
	Если СтатическийКонтекст.НаборПредоставленных = Неопределено Тогда
		СтатическийКонтекст.НаборПредоставленных = СоздатьНаборЗаписейПредоставленныеПоказания(МенеджерРегистра, Выборка);
	КонецЕсли
	
КонецПроцедуры

Процедура ДополнитьНаборЗаписейВСоответствиеРасчетСреднегоОбъема(МенеджерРегистра, Выборка)
	
	Если Выборка.ВидОперации = СтатическийКонтекст.АктЗамены И Выборка.ВыводПрибораУчета = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если СтатическийКонтекст.НаборРасчетСреднего = Неопределено Тогда
		СтатическийКонтекст.НаборРасчетСреднего = СоздатьНаборЗаписейРасчетСреднегоОбъема(МенеджерРегистра, Выборка);
	КонецЕсли
	
КонецПроцедуры

Процедура ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказания(МенеджерРегистра, Выборка)

	Если СтатическийКонтекст.НаборМаксимальныеПоказания = Неопределено Тогда
		СтатическийКонтекст.НаборМаксимальныеПоказания = СоздатьНаборЗаписейМаксимальныеПоказания(МенеджерРегистра, Выборка);
	КонецЕсли
	
КонецПроцедуры

Процедура ДополнитьНаборЗаписейВСоответствиеМаксимальныеПоказанияСрез(МенеджерРегистра, Выборка)
	
	Если СтатическийКонтекст.НаборМаксимальныеПоказанияСрез = Неопределено Тогда
		СтатическийКонтекст.НаборМаксимальныеПоказанияСрез = СоздатьНаборЗаписейМаксимальныеПоказанияСрез(МенеджерРегистра, Выборка);
	КонецЕсли
	
КонецПроцедуры

Функция СоздатьНаборЗаписейПредоставленныеПоказания(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
	Набор.Отбор.Строение.установить(Выборка.Строение);
	Набор.Отбор.Помещение.установить(Выборка.Помещение);
	Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
	
	Возврат Набор;
	
КонецФункции

Функция СоздатьНаборЗаписейРасчетСреднегоОбъема(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
	Набор.Отбор.Строение.установить(Выборка.Строение);
	Набор.Отбор.Помещение.установить(Выборка.Помещение);
	Набор.Отбор.ТочкаУчета.установить(Выборка.ТочкаУчета);
	//Набор.Отбор.Шкала.установить(Выборка.Шкала);
	//Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
	Если Выборка.ПериодРегистрации <> Выборка.ДатаРегистратора Тогда
		Набор.Отбор.ПериодНачисления.установить(энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Выборка.ПериодРегистрации, Выборка.Организация, Выборка.Район));
	Иначе
		Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	КонецЕсли;
	
	Возврат Набор;
	
КонецФункции

Функция СоздатьНаборЗаписейМаксимальныеПоказания(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.Период.установить(Выборка.ПериодРегистрации);
	Набор.Отбор.ДокРегистратор.установить(Выборка.ДокРегистратор);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.КлючПомещения.установить(Выборка.КлючПомещения);
	Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
	//Набор.Отбор.Шкала.установить(Выборка.Шкала);
	//Набор.Отбор.ТарифнаяЗона.установить(Выборка.ТарифнаяЗона);
	
	Возврат Набор;
	
КонецФункции

Функция СоздатьНаборЗаписейМаксимальныеПоказанияСрез(МенеджерРегистра, Выборка)
	
	Набор = СоздатьНаборЗаписей(МенеджерРегистра);
	Набор.ДополнительныеСвойства.Вставить("НеПроверятьДатуЗапретаРедактирования", Истина);
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Набор.Отбор.ЧастныйСектор.установить(Выборка.ЧастныйСектор);
	Набор.Отбор.Строение.установить(Выборка.Строение);
	Набор.Отбор.Помещение.установить(Выборка.Помещение);
	Набор.Отбор.ПриборУчета.установить(Выборка.ПриборУчета);
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция СтатичныеДополнительныеПараметрыПоказаний(ПериодыПриемаПоказаний)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Исключен", Перечисления.энргСостояниеДокументаВПоследовательности.ИсключенИзПоследовательности);
	Результат.Вставить("ПроведенСНарушением", Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности);
	Результат.Вставить("ПроведенВПоследовательности", Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности);
	
	Результат.Вставить("ПоказанияОтклонены", Перечисления.энргСостояниеПоказаний.Отклонены);
	Результат.Вставить("ПоказанияПриняты", Перечисления.энргСостояниеПоказаний.Приняты);
	Результат.Вставить("ПустоеСостояниеПоказаний", Перечисления.энргСостояниеПоказаний.ПустаяСсылка());
	Результат.Вставить("ОшибкаДругойЗоны", ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОшибкаДругойЗоны"));	
	
	Результат.Вставить("НаборПредоставленных", Неопределено);
	Результат.Вставить("НаборРасчетСреднего", Неопределено);
	Результат.Вставить("НаборМаксимальныеПоказания", Неопределено);
	Результат.Вставить("НаборМаксимальныеПоказанияСрез", Неопределено);
	
	Результат.Вставить("СтрокиСменыПоказанийНаборПредоставленных", Новый СписокЗначений);
	Результат.Вставить("СтрокиСменыПоказанийНаборРасчетСреднего", Новый СписокЗначений);
	Результат.Вставить("СтрокиСменыПоказанийНаборМаксимальныеПоказания", Новый СписокЗначений);
	//Результат.Вставить("СтрокиСменыПоказанийНаборМаксимальныеПоказанияСрез", Новый СписокЗначений);
	
	
	Результат.Вставить("НачПокНеЯвляютсяКонечнымиПриУстПрибора", энргРаботаСКонстантами.ЗначениеКонстантыНачальныеПоказанияПУНеРавныКонечнымВПериодеВведенияВЭксплуатациюПУ());
	Результат.Вставить("РасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу", энргРаботаСКонстантами.ЗначениеКонстантыРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу());
	
	Результат.Вставить("ПоказанияС"	, ?(не ЗначениеЗаполнено(ПериодыПриемаПоказаний.ДатаС),	1, ПериодыПриемаПоказаний.ДатаС));
	Результат.Вставить("ПоказанияПО", ?(не ЗначениеЗаполнено(ПериодыПриемаПоказаний.ДатаПо), 31, ПериодыПриемаПоказаний.ДатаПо));	
	
	Результат.Вставить("ПараметрыОперации",	НовыеПараметрыОперации());
	Результат.Вставить("ПричиныОтклоненияИсключая", энргРаботаСПоказаниямиПриборовУчетаСервер.ПричиныОтклоненияИсключая());
	
	Результат.Вставить("АктЗамены", Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ);
	Возврат Результат;
	
КонецФункции

Функция СоздатьНаборЗаписей(МенеджерРегистраСведений)
	
	НаборЗаписей = МенеджерРегистраСведений.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	
	Возврат НаборЗаписей;
	
КонецФункции

#КонецОбласти

#КонецОбласти