#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерфейса_ПолучениеДанных

Процедура ЗаполнитьСхемуОстаткиНаМоментВремени(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОстаткиНаМоментВремени());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("Период") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["Период"].ИмяПараметра));
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ОтборПакета 		= Операторы[0].Отбор;
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,ДокументОплаты,Разделитель";
		ПараметрИсточника 	= ПараметрыИсточника[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуОборотыЗаПериод(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОборотыЗаПериод());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("НачалоПериода") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыСхемы["НачалоПериода"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыСхемы.Свойство("КонецПериода") Тогда
		ПараметрПериод 				= ПараметрыИсточника[1];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыСхемы["КонецПериода"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ОтборПакета 		= Пакет.Операторы[0].Отбор;
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,ДокументОплаты,Разделитель";
		ПараметрИсточника 	= ПараметрыИсточника[3];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросовПолученияДанных

Функция ТекстЗапросаОстаткиНаМоментВремени()
	
	Текст = 
	"ВЫБРАТЬ
	|	энргАвансыОстатки.Организация КАК Организация,
	|	энргАвансыОстатки.Район КАК Район,
	|	энргАвансыОстатки.МКД КАК МКД,
	|	энргАвансыОстатки.Абонент КАК Абонент,
	|	энргАвансыОстатки.ДокументОплаты КАК ДокументОплаты,
	|	энргАвансыОстатки.Разделитель КАК Разделитель,
	|	энргАвансыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА энргАвансыОстатки.ДокументОплаты ССЫЛКА Документ.энргПриходныйКассовыйОрдер
	|			ТОГДА ИСТИНА
	|		КОГДА энргАвансыОстатки.ДокументОплаты ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА ИСТИНА
	|		КОГДА энргАвансыОстатки.ДокументОплаты ССЫЛКА Документ.энргПерерасчет
	|				И ВЫРАЗИТЬ(энргАвансыОстатки.ДокументОплаты КАК Документ.энргПерерасчет).ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЖивыеДеньги
	|ПОМЕСТИТЬ АвансыОстатки
	|ИЗ
	|	РегистрНакопления.энргАвансы.Остатки КАК энргАвансыОстатки";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОборотыЗаПериод()
	Текст = 
	"ВЫБРАТЬ
	|	энргАвансыОбороты.Период КАК Период,
	|	энргАвансыОбороты.Регистратор КАК Регистратор,
	|	энргАвансыОбороты.Организация КАК Организация,
	|	энргАвансыОбороты.Район КАК Район,
	|	энргАвансыОбороты.МКД КАК МКД,
	|	энргАвансыОбороты.Абонент КАК Абонент,
	|	энргАвансыОбороты.ДокументОплаты КАК ДокументОплаты,
	|	энргАвансыОбороты.Разделитель КАК Разделитель,
	|	энргАвансыОбороты.СуммаОборот КАК СуммаОборот,
	|	ВЫБОР
	|		КОГДА энргАвансыОбороты.ДокументОплаты ССЫЛКА Документ.энргПриходныйКассовыйОрдер
	|			ТОГДА ИСТИНА
	|		КОГДА энргАвансыОбороты.ДокументОплаты ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА ИСТИНА
	|		КОГДА энргАвансыОбороты.ДокументОплаты ССЫЛКА Документ.энргПерерасчет
	|				И ВЫРАЗИТЬ(энргАвансыОбороты.ДокументОплаты КАК Документ.энргПерерасчет).ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты), ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЖивыеДеньги
	|ПОМЕСТИТЬ АвансыОбороты
	|ИЗ
	|	РегистрНакопления.энргАвансы.Обороты(, , Регистратор, ) КАК энргАвансыОбороты";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли