#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
		
	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;	
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестКорректировкаЗадолженности",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестКорректировкаЗадолженности",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестКорректировкаЗадолженности",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестКорректировкаЗадолженности");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить строки оплаты
//
// Параметры:
//  ВыбранныйДокумент	 - 	ДокументСсылка.бестПлатежноеПоручениеВходящееЭЭЮрЛица, ДокументСсылка.бестКорректировкаЗадолженности 
//  Договор				 - 	СправочникСсылка.энргДоговорыКонтрагентов 
//  ТЧ					 - 	ДанныеФормыКоллекция 
//
Процедура ЗаполнитьСтрокиОплаты(ВыбранныйДокумент, Договор, ТЧ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестКорректировкаЗадолженностиВозвратОплаты.ДокументОплаты КАК ДокументОплаты,
		|	бестКорректировкаЗадолженностиВозвратОплаты.СуммаОплаты - бестКорректировкаЗадолженностиВозвратОплаты.СуммаВозврата - ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0) КАК СуммаОплаты,
		|	бестКорректировкаЗадолженностиВозвратОплаты.IDСтроки КАК IDСтроки
		|ИЗ
		|	Документ.бестКорректировкаЗадолженности.ВозвратОплаты КАК бестКорректировкаЗадолженностиВозвратОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бестКорректировкаЗадолженностиПереносОплаты.IDСтроки КАК IDСтроки,
		|			СУММА(бестКорректировкаЗадолженностиПереносОплаты.Сумма) КАК Сумма
		|		ИЗ
		|			Документ.бестКорректировкаЗадолженности.ПереносОплаты КАК бестКорректировкаЗадолженностиПереносОплаты
		|		ГДЕ
		|			бестКорректировкаЗадолженностиПереносОплаты.Ссылка = &Ссылка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бестКорректировкаЗадолженностиПереносОплаты.IDСтроки) КАК ВложенныйЗапрос
		|		ПО бестКорректировкаЗадолженностиВозвратОплаты.IDСтроки = ВложенныйЗапрос.IDСтроки
		|ГДЕ
		|	бестКорректировкаЗадолженностиВозвратОплаты.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.СуммаОплаты,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки
		|ИЗ
		|	Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
		|ГДЕ
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка = &Ссылка
		|	И бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Ссылка",  ВыбранныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

КонецФункции

#КонецОбласти

#КонецЕсли