// Эту переменную необходимо вставить в модуль
&НаКлиенте
Перем ДанныеДляПоискаВДеревьях;

&НаКлиенте
Перем МодифицировалиТУ;

&НаКлиенте 
Перем МодифицировалиТЧ;

#Область ПредопределенныеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргВводНачальныхОстатков(ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
		
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,,,,"ДеревоТочекУчета");
	// энргРаботаСПоставщиками }

	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Свойство("Абонент") Тогда
		Элементы.Абоненты.ТекущаяСтрока = Объект.Абоненты.НайтиСтроки(Новый Структура("Абонент", Параметры.Абонент))[0].НомерСтроки - 1;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета); 			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Абоненты");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ФормулыРасчета");
	 
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервере(ЭтотОбъект, "Абоненты");	
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);	
	
	ПрочитатьДанныеУслугМКД(ТекущийОбъект.Организация, ТекущийОбъект.Район, ТекущийОбъект.МКД);
	
	ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");
	ЗаполнитьДеревоНаОснованииОбъектаНаСервере("Абоненты", АбонентыДерево, ПустойКлючСтроки.ПривестиЗначение());
	
	ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");
	ЗаполнитьДеревоНаОснованииОбъектаНаСервере("ТочкиУчета", ДеревоПоискаТочекУчета, ПустойКлючСтроки.ПривестиЗначение());
	
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("ЗначениеПлощадей",			ДеревоПоискаЗначениеПлощадей);
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("Взаиморасчеты",			ДеревоПоискаВзаиморасчеты);
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("ВидыБлагоустройстваТарифныеКатегории",	ДеревоПоискаВидыБлагоустройства);
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("Жильцы",					ДеревоПоискаЛьготники);
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("ШкалыПриборовУчета",		ДеревоПоискаШкалыПриборовУчета, "IDСтрокиТочкиУчета");
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("ПоказанияПриборовУчета",	ДеревоПоискаПоказанияПриборовУчета, "IDСтроки");
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("ЗначенияИзмерителей",		ДеревоПоискаЗначенияИзмерителей, "IDСтроки");
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("Измерители",				ДеревоПоискаИзмерители, "IDСтрокиТочкиУчета");
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("НомераПломб",				ДеревоПоискаНомераПломб, "IDСтрокиИзмерителя");
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("ФормулыРасчета",			ДеревоПоискаФормулыРасчета, "IDСтрокиТочкиУчета");
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("ПоставщикиСоставныхУслуг",	ДеревоПоискаПоставщикиСоставныхУслуг, "IDСтроки");
	ЗаполнитьДеревоПоискаНаОснованииОбъекта("РасчетСреднегоОбъема",		ДеревоПоискаРасчетСреднегоОбъема, "IDСтроки");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСтроения(НЕ ЗначениеЗаполнено(Объект.МКД));
	Если ТипЗнч(ДанныеДляПоискаВДеревьях) <> Тип("Структура") Тогда
		ИндексироватьДерево();
	КонецЕсли;
	МодифицировалиТУ = Ложь;
	МодифицировалиТЧ = Новый Структура;
	МодифицировалиТЧ.Вставить("Абоненты",					Ложь);
	МодифицировалиТЧ.Вставить("Взаиморасчеты",				Ложь);
	МодифицировалиТЧ.Вставить("ТочкиУчета",					Ложь);
	МодифицировалиТЧ.Вставить("ЗначениеПлощадей",			Ложь);
	МодифицировалиТЧ.Вставить("ВидыБлагоустройства",		Ложь);
	МодифицировалиТЧ.Вставить("Жильцы",						Ложь);
	МодифицировалиТЧ.Вставить("ШкалыПриборовУчета",			Ложь);
	МодифицировалиТЧ.Вставить("ПоказанияПриборовУчета",		Ложь);
	МодифицировалиТЧ.Вставить("ЗначенияИзмерителей",		Ложь);
	МодифицировалиТЧ.Вставить("ФормулыРасчета",				Ложь);
	МодифицировалиТЧ.Вставить("ПоставщикиСоставныхУслуг",	Ложь);
	МодифицировалиТЧ.Вставить("РасчетСреднегоОбъема",		Ложь);
	МодифицировалиТЧ.Вставить("Измерители",					Ложь);
	МодифицировалиТЧ.Вставить("НомераПломб",				Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//	Объект.ТочкиУчета.Очистить();
	Если МодифицировалиТЧ.Абоненты Тогда
		Объект.Абоненты.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("Абоненты", АбонентыДерево.ПолучитьЭлементы(), Неопределено);
	КонецЕсли;
	
	Если МодифицировалиТЧ.ЗначениеПлощадей Тогда
		Объект.ЗначениеПлощадей.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ЗначениеПлощадей", ДеревоПоискаЗначениеПлощадей.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.Взаиморасчеты Тогда
		Объект.Взаиморасчеты.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("Взаиморасчеты", ДеревоПоискаВзаиморасчеты.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.ВидыБлагоустройства Тогда
		Объект.ВидыБлагоустройстваТарифныеКатегории.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ВидыБлагоустройстваТарифныеКатегории", ДеревоПоискаВидыБлагоустройства.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.Жильцы Тогда
		Объект.Жильцы.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("Жильцы", ДеревоПоискаЛьготники.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.ШкалыПриборовУчета Тогда
		Объект.ШкалыПриборовУчета.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ШкалыПриборовУчета", ДеревоПоискаШкалыПриборовУчета.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.ПоказанияПриборовУчета Тогда
		Объект.ПоказанияПриборовУчета.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ПоказанияПриборовУчета", ДеревоПоискаПоказанияПриборовУчета.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.ЗначенияИзмерителей Тогда
		Объект.ЗначенияИзмерителей.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ЗначенияИзмерителей", ДеревоПоискаЗначенияИзмерителей.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.Измерители Тогда
		Объект.Измерители.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("Измерители", ДеревоПоискаИзмерители.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.НомераПломб Тогда
		Объект.НомераПломб.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("НомераПломб", ДеревоПоискаНомераПломб.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.ФормулыРасчета Тогда
		Объект.ФормулыРасчета.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ФормулыРасчета", ДеревоПоискаФормулыРасчета.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.ПоставщикиСоставныхУслуг Тогда
		Объект.ПоставщикиСоставныхУслуг.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ПоставщикиСоставныхУслуг", ДеревоПоискаПоставщикиСоставныхУслуг.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТЧ.РасчетСреднегоОбъема Тогда
		Объект.РасчетСреднегоОбъема.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("РасчетСреднегоОбъема", ДеревоПоискаРасчетСреднегоОбъема.ПолучитьЭлементы(), Неопределено, Истина);
	КонецЕсли;
	
	Если МодифицировалиТУ Тогда		
		// удаляем старые строки
		ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");
		отб = Новый Структура("IDСтрокиАбонента,IDСтрокиРодитель", ТекIDАбонента, ПустойКлючСтроки.ПривестиЗначение());
		ВершиныДляУдаления = НайтиСтрокиДерева("ДеревоПоискаТочекУчета", отб);
		
		Если ЗначениеЗаполнено(ВершиныДляУдаления) Тогда
			ВсеВершины = ДеревоПоискаТочекУчета.ПолучитьЭлементы();
			Для Каждого ТекВершина Из ВершиныДляУдаления Цикл
				Если ВсеВершины.Индекс(ТекВершина) <> -1 Тогда
					ВсеВершины.Удалить(ВсеВершины.Индекс(ТекВершина));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// добавляем новые строки
		ДобавитьСтрокиВДеревоПоискаТочекУчета(ДеревоТочекУчета, ДеревоПоискаТочекУчета);
		
		мИмёнПолей = Новый Массив;
		мИмёнПолей.Добавить("IDСтрокиАбонента");
		мИмёнПолей.Добавить("IDСтрокиРодитель");
		соотИ = Новый Соответствие;
		ИндексироватьВетку("ДеревоПоискаТочекУчета",	мИмёнПолей,	соотИ); // основная рабочая
		
		МодифицировалиТУ = Ложь;
	КонецЕсли;
	
	Если МодифицировалиТЧ.ТочкиУчета Тогда
		Объект.ТочкиУчета.Очистить();
		ЗаполнитьОбъектНаОснованииДерева("ТочкиУчета", ДеревоПоискаТочекУчета.ПолучитьЭлементы(), Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	энргПользовательскийВводСервер.ЗаписатьПараметрыАбонента(Объект.Абоненты, ТекущийОбъект);	
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект);
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 		
		// создаем абонента
		НовыеАбоненты 						= Новый Массив;
		//МаршрутыДляЗаписи					= Новый Соответствие;
		Для Каждого СтрокаАбонента Из ТекущийОбъект.Абоненты Цикл
			Если Не ЗначениеЗаполнено(СтрокаАбонента.Абонент) И ТекущийОбъект.Абоненты.НайтиСтроки(Новый Структура("IDСтрокиРодитель", СтрокаАбонента.IDСтроки)).Количество() = 0 Тогда
				Индекс  					= СтрокаАбонента.НомерСтроки;
				СтрокаАбонента.Абонент 		= Справочники.энргАбоненты.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеАбоненты.Добавить(Индекс);
			КонецЕсли;
			// заполнить Маршрут
			//Если ЗначениеЗаполнено(СтрокаАбонента.МаршрутКонтролера) Тогда
			//	МаршрутСсылка = СтрокаАбонента.МаршрутКонтролера;
			//	Если МаршрутСсылка.КлючПомещений.Найти(СтрокаАбонента.КлючПомещения, "КлючПомещения") = Неопределено Тогда
			//		
			//		МаршрутОбъект = МаршрутыДляЗаписи.Получить(МаршрутСсылка);
			//		Если МаршрутОбъект = Неопределено Тогда
			//			МаршрутОбъект	= МаршрутСсылка.ПолучитьОбъект();
			//		КонецЕсли;
			//		
			//		СтрокаМаршрута	= МаршрутОбъект.КлючПомещений.Добавить();
			//		СтрокаМаршрута.КлючПомещения	= СтрокаАбонента.КлючПомещения;
			//		МаршрутыДляЗаписи.Вставить(МаршрутСсылка, МаршрутОбъект);
			//	КонецЕсли;
			//	
			//КонецЕсли;
		КонецЦикла;					
		
		//Для Каждого ТекМаршрут Из МаршрутыДляЗаписи Цикл
		//	ТекМаршрут.Значение.Записать();
		//КонецЦикла;
	//	энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
		
		НовыеТочкиУчета						= Новый Массив;
		НовыеПриборыУчета 					= Новый Массив;
		
		Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
			Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
				СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки); 
				ТекущийОбъект.ДополнительныеСвойства.ИзмененныеТУ.Добавить(СтрокаТочкиУчета.ТочкаУчета);
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
				СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
				НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеАбоненты", 		НовыеАбоненты);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// создаем абонента
		энргРаботаСЛицевымСчетомСервер.ПроверитьИСоздатьАбонентаИзКоллекции(ТекущийОбъект,"Абоненты",отказ);
		энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
		энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Абоненты");
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервере(ЭтотОбъект, "Абоненты");	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета"); 	
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	ЗаполнитьСвойстваТочекУчета(ТекущийОбъект);
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииСервер()

КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	
	УстановитьВидимостьСтроения(НЕ ЗначениеЗаполнено(Объект.МКД));
	
	ПустоеПомещение 							= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
	ПустойКлючПомещения 						= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	Для Каждого СтрокаАбонента Из Объект.Абоненты Цикл
		Если ЗначениеЗаполнено(Объект.МКД) Тогда
			Если НЕ СтрокаАбонента.Строение  = Объект.МКД Тогда
				СтрокаАбонента.Строение  		= Объект.МКД;
				СтрокаАбонента.Помещение 		= ПустоеПомещение;
				СтрокаАбонента.КлючПомещения 	= ПустойКлючПомещения; 
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;
	
	ПрочитатьДанныеУслугМКД(Объект.Организация, Объект.Район, Объект.МКД);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_Абоненты

&НаКлиенте
Процедура АбонентыСтроениеПриИзменении(Элемент)
	
	ТекущиеДанные 				= Элементы.Абоненты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Строение 					= ТекущиеДанные.Строение;
	Помещение 					= ТекущиеДанные.Помещение;
	ДанныеСтроения				= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(Строение,Помещение);
	ТекущиеДанные.КлючПомещения	= ДанныеСтроения.КлючПомещения;
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПомещениеПриИзменении(Элемент)
	ТекущиеДанные 				= Элементы.Абоненты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Строение 					= ТекущиеДанные.Строение;
	Помещение 					= ТекущиеДанные.Помещение;
	ДанныеСтроения				= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(Строение, Помещение);
	ТекущиеДанные.КлючПомещения	= ДанныеСтроения.КлючПомещения;
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные  				= Элементы.Абоненты.ТекущиеДанные;
		ТекущиеДанные.IDСтроки 		= Новый УникальныйИдентификатор;
		
		Если ЗначениеЗаполнено(Объект.МКД) Тогда
			 ТекущиеДанные.Строение = Объект.МКД;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПередУдалением(Элемент, Отказ)
	МодифицировалиТЧ.Абоненты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные  = Элементы.Абоненты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТекIDАбонента = ТекущиеДанные.IDСтроки Тогда
		Возврат;
	КонецЕсли;		
	
	Если ТипЗнч(ДанныеДляПоискаВДеревьях) <> Тип("Структура") Тогда
		ИндексироватьДерево();
		МодифицировалиТУ = Ложь;
		МодифицировалиТЧ = Новый Структура;
		МодифицировалиТЧ.Вставить("Абоненты", Ложь);
		МодифицировалиТЧ.Вставить("Взаиморасчеты", Ложь);
		МодифицировалиТЧ.Вставить("ТочкиУчета", Ложь);
		МодифицировалиТЧ.Вставить("ЗначениеПлощадей", Ложь);
		МодифицировалиТЧ.Вставить("ВидыБлагоустройства", Ложь);
		МодифицировалиТЧ.Вставить("Жильцы", Ложь);
		МодифицировалиТЧ.Вставить("ШкалыПриборовУчета", Ложь);
		МодифицировалиТЧ.Вставить("ЗначенияИзмерителей", Ложь);
		МодифицировалиТЧ.Вставить("Измерители", Ложь);
		МодифицировалиТЧ.Вставить("НомераПломб", Ложь);
		МодифицировалиТЧ.Вставить("ФормулыРасчета", Ложь);
		МодифицировалиТЧ.Вставить("ПоставщикиСоставныхУслуг", Ложь);
		МодифицировалиТЧ.Вставить("РасчетСреднегоОбъема", Ложь);
	КонецЕсли;
	
	Если МодифицировалиТУ Тогда		
		// удаляем старые строки
		ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");
		отб = Новый Структура("IDСтрокиАбонента,IDСтрокиРодитель", ТекIDАбонента, ПустойКлючСтроки.ПривестиЗначение());
		ВершиныДляУдаления = НайтиСтрокиДерева("ДеревоПоискаТочекУчета", отб);
		
		Если ЗначениеЗаполнено(ВершиныДляУдаления) Тогда
			ВсеВершины = ДеревоПоискаТочекУчета.ПолучитьЭлементы();
			Для Каждого ТекВершина Из ВершиныДляУдаления Цикл
				Если ВсеВершины.Индекс(ТекВершина) <> -1 Тогда
					ВсеВершины.Удалить(ВсеВершины.Индекс(ТекВершина));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// добавляем новые строки
		ДобавитьСтрокиВДеревоПоискаТочекУчета(ДеревоТочекУчета, ДеревоПоискаТочекУчета);
		
		мИмёнПолей = Новый Массив;
		мИмёнПолей.Добавить("IDСтрокиАбонента");
		мИмёнПолей.Добавить("IDСтрокиРодитель");
		соотИ = Новый Соответствие;
		ИндексироватьВетку("ДеревоПоискаТочекУчета",	мИмёнПолей,	соотИ); // основная рабочая
		
		МодифицировалиТУ = Ложь;
	КонецЕсли;
	
	ТекIDАбонента = ТекущиеДанные.IDСтроки;
	
	
		
	ДеревоТочекУчета.ПолучитьЭлементы().Очистить();
	ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");
	ЗаполнитьДеревоУслугНаОснованииТочекУчетаНаКлиенте(Объект, ДеревоТочекУчета, ПустойКлючСтроки.ПривестиЗначение(), ТекущиеДанные.IDСтроки);
	
	ТЗЗначенияПлощадей.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаЗначениеПлощадей", ТЗЗначенияПлощадей, ТекущиеДанные.IDСтроки);
	
	ТЗВзаиморасчеты.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаВзаиморасчеты", ТЗВзаиморасчеты, ТекущиеДанные.IDСтроки);
	
	ТЗВидыБлагоустройства.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаВидыБлагоустройства", ТЗВидыБлагоустройства, ТекущиеДанные.IDСтроки);
	
	ТЗЛьготники.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаЛьготники", ТЗЛьготники, ТекущиеДанные.IDСтроки);
	
	
КонецПроцедуры

&НаКлиенте
Процедура АбонентыПриИзменении(Элемент)
	Модифицированность = Истина;
	МодифицировалиТЧ.Абоненты = Истина;
	ТекДанные = Элементы.Абоненты.ТекущиеДанные;
	ТекДанные.СтрокаИзменена = Истина;
	Если Не ЗначениеЗаполнено(ТекДанные.IDСтроки) Тогда
		ТекДанные.IDСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.МКД) Тогда
		Если НЕ ТекДанные.Строение  = Объект.МКД Тогда
			ТекДанные.Строение  		= Объект.МКД;
			ТекДанные.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
			ТекДанные.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка"); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_Взаиморасчеты

&НаКлиенте
Процедура ВзаиморасчетыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	МодифицировалиТЧ.Взаиморасчеты = Истина;
	Если НоваяСтрока Тогда
		ТекущиеДанные  					= Элементы.ТЗВзаиморасчеты.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиАбонента 	= Элементы.Абоненты.ТекущиеДанные.IDСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзаиморасчетыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы.ТЗВзаиморасчеты.ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаВзаиморасчеты, "ДеревоПоискаВзаиморасчеты", ТекущиеДанные);	
	Иначе
		
		ТекущиеДанные	= Элементы.ТЗВзаиморасчеты.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаВзаиморасчеты, "ДеревоПоискаВзаиморасчеты", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаВзаиморасчеты, "ДеревоПоискаВзаиморасчеты", ТекущиеДанные);	
		
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЗВзаиморасчетыПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы.ТЗВзаиморасчеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаВзаиморасчеты, "ДеревоПоискаВзаиморасчеты", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.Взаиморасчеты = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаНаправлениеИспользованияТУПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета; 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ОбновитьНаправленияИспользованияТУ(ТекущиеДанные.IDСтроки,ТекущиеДанные.НаправлениеИспользованияТУ);
	
	
	Для Каждого ТекСтрока Из ТЗЗначенияИзмерителей Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаЗначенияИзмерителей, "ДеревоПоискаЗначенияИзмерителей", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	МассивИзмерителей 	= ПолучитьНаправленияИспользованияТУ(ТекущиеДанные.НаправлениеИспользованияТУ);
	
	ТЗЗначенияИзмерителей.Очистить();
	Для Каждого ТекИзмеритель Из МассивИзмерителей Цикл 		
		СтрокаИзмерителя 			= ТЗЗначенияИзмерителей.Добавить();
		СтрокаИзмерителя.IDСтроки	= ТекущиеДанные.IDСтроки;
		СтрокаИзмерителя.НаправлениеИспользованияТУ = ТекИзмеритель;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаЗначенияИзмерителей, "ДеревоПоискаЗначенияИзмерителей", СтрокаИзмерителя,"IDСтроки");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНаправлениеИспользованияТУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуВыбораНаправленийИзмерителейТУ(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ТЗШкалыПриборовУчета.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаШкалыПриборовУчета", ТЗШкалыПриборовУчета, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");	
	
	ТЗПоказанияПриборовУчета.Очистить();
	ТЗРасчетСреднегоОбъема.Очистить();
	Если ТЗШкалыПриборовУчета.Количество() > 0 Тогда
		Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущаяСтрока = ТЗШкалыПриборовУчета[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	ТЗИзмерители.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаИзмерители", ТЗИзмерители, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");
	
	ТЗЗначенияИзмерителей.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаЗначенияИзмерителей", ТЗЗначенияИзмерителей, ТекущиеДанные.IDСтроки, "IDСтроки");
	
	ТЗФормулыРасчета.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаФормулыРасчета", ТЗФормулыРасчета, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");
	
	ТЗПоставщикиСоставныхУслуг.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаПоставщикиСоставныхУслуг", ТЗПоставщикиСоставныхУслуг, ТекущиеДанные.IDСтроки, "IDСтроки");	

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	ЗаполнитьНаименование(ТекущиеДанные);  	
		
	Для Каждого ТекСтрока Из ТЗПоставщикиСоставныхУслуг Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	ТЗПоставщикиСоставныхУслуг.Очистить();
	
	ОписаниеУслуги 	= энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	ПоставщикПоУмолчанию	= ЭтаФорма.ПараметрыПоставщиков.ПоставщикПоУмолчанию;
	Если ОписаниеУслуги.ЭтоСоставнаяУслуга тогда
		ТекущиеДанные.ЭтоСоставнаяУслуга = Истина;
		Если ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) тогда
			ТекущиеДанные.IDСтроки 					= Новый УникальныйИдентификатор;
		КонецЕсли;
		
		для Каждого Строка из ОписаниеУслуги.Услуги цикл
			СтрокаТЧ  						= ТЗПоставщикиСоставныхУслуг.Добавить();
			СтрокаТЧ.IDСтроки 				= ТекущиеДанные.IDСтроки;
			СтрокаТЧ.ЧастьСоставнойУслуги 	= Строка;
			СтрокаТЧ.Поставщик 				= ПоставщикПоУмолчанию;
			ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", СтрокаТЧ, "IDСтроки");
		КонецЦикла;
	иначе
		ТекущиеДанные.Поставщик 			= ПоставщикПоУмолчанию; 
	КонецЕсли;
	
	
	ТекущиеДанныеАбоненты 					= Элементы.Абоненты.ТекущиеДанные;
	
	////Если ЗначениеЗаполнено(АдресВременногоХранилищаУслугиМКД) Тогда
	////	ДанныеУслуг 							= ПолучитьИзВременногоХранилища(АдресВременногоХранилищаУслугиМКД);
	////	Если энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Услуга,"СоставнаяУслуга")  Тогда 
	////		Для Каждого ТекУслугаИзСоставной Из ТекущиеДанные.Услуга.СоставляющиеУслуг Цикл
	////			СтруктураПоиск 							= Новый Структура("IDСтрокиАбонента,Услуга", ТекущиеДанныеАбоненты.IDСтроки, ТекУслугаИзСоставной.Услуга);
	////			Строки 									= Объект.ВидыБлагоустройстваТарифныеКатегории.НайтиСтроки(СтруктураПоиск);
	////			Если Строки.Количество() = 0 Тогда
	////				НоваяСтрока				  			= Объект.ВидыБлагоустройстваТарифныеКатегории.Добавить();
	////				НоваяСтрока.Услуга 					= ТекУслугаИзСоставной.Услуга;
	////				НоваяСтрока.IDСтрокиАбонента		= ТекущиеДанныеАбоненты.IDСтроки;
	////				Если НЕ ДанныеУслуг[ТекУслугаИзСоставной.Услуга] = Неопределено Тогда
	////					ДанныеУслуги 					= ДанныеУслуг[ТекУслугаИзСоставной.Услуга];
	////					НоваяСтрока.ВидБлагоустройства 	= ДанныеУслуги.ВидБлагоустройства;
	////					НоваяСтрока.ТарифнаяКатегория 	= ДанныеУслуги.ТарифнаяКатегория;
	////				КонецЕсли;		
	////			КонецЕсли;	
	////		КонецЦикла;
	////	Иначе
	////		
	////		СтруктураПоиск 							= Новый Структура("IDСтрокиАбонента,Услуга", ТекущиеДанныеАбоненты.IDСтроки, ТекущиеДанные.Услуга);
	////		Строки 									= Объект.ВидыБлагоустройстваТарифныеКатегории.НайтиСтроки(СтруктураПоиск);
	////		Если Строки.Количество() = 0 Тогда
	////			НоваяСтрока				  			= Объект.ВидыБлагоустройстваТарифныеКатегории.Добавить();
	////			НоваяСтрока.Услуга 					= ТекущиеДанные.Услуга;
	////			НоваяСтрока.IDСтрокиАбонента		= ТекущиеДанныеАбоненты.IDСтроки;
	////			Если НЕ ДанныеУслуг[ТекущиеДанные.Услуга] = Неопределено Тогда
	////				ДанныеУслуги 					= ДанныеУслуг[ТекущиеДанные.Услуга];
	////				НоваяСтрока.ВидБлагоустройства 	= ДанныеУслуги.ВидБлагоустройства;
	////				НоваяСтрока.ТарифнаяКатегория 	= ДанныеУслуги.ТарифнаяКатегория;
	////			КонецЕсли;		
	////		КонецЕсли;
	////	КонецЕсли;
	////КонецЕсли;
	
	//Модифицированность = Истина;
	//ЗаполнитьОбъектНаОснованииДерева("ТочкиУчета", ДеревоТочекУчета.ПолучитьЭлементы(), Неопределено);
	//ТочкиУчетаПриИзмененииСервер(ТекущиеДанныеАбоненты.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
		// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	МодифицировалиТЧ.ТочкиУчета = Истина;
	
	//энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ЗначенияИзмерителей, ТекущиеДанные);
	//энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.ФормулыРасчета, ТекущиеДанные, "IDСтрокиТочкиУчета");
	
	Для Каждого ТекСтрока Из ТЗШкалыПриборовУчета Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	ТЗРасчетСреднегоОбъема.Очистить();
	ТЗПоказанияПриборовУчета.Очистить();
	ТЗНомераПломб.Очистить();
	
	Для Каждого ТекСтрока Из ТЗЗначенияИзмерителей Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаЗначенияИзмерителей, "ДеревоПоискаЗначенияИзмерителей", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ТЗИзмерители Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаИзмерители, "ДеревоПоискаИзмерители", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;

	Для Каждого ТекСтрока Из ТЗФормулыРасчета Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаФормулыРасчета, "ДеревоПоискаФормулыРасчета", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ТЗПоставщикиСоставныхУслуг Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками { 
	ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	//ТекущиеДанные 							= Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	МодифицировалиТЧ.ПоставщикиСоставныхУслуг = Истина;
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
//	ТекущиеДанные 							= Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"));
	МодифицировалиТЧ.ПоставщикиСоставныхУслуг = Истина;
	// энргРаботаСПоставщиками } 
КонецПроцедуры  

&НаКлиенте
Процедура ТочкиУчетаПоставщикПриИзменении(Элемент)
	МодифицировалиТЧ.ПоставщикиСоставныхУслуг = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидКанальностиПриИзменении(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	
	Для Каждого ТекСтрока Из ТЗШкалыПриборовУчета Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	ТЗШкалыПриборовУчета.Очистить();
	для Каждого Шкала из СоставКанальности цикл		
		СтрокаШкалы 						= ТЗШкалыПриборовУчета.Добавить();
		СтрокаШкалы["IDСтрокиТочкиУчета"]	= ТекущиеДанные.IDСтроки;
		СтрокаШкалы.Шкала		 			= Шкала;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", СтрокаШкалы, "IDСтрокиТочкиУчета");
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаРасположениеПриИзменении(Элемент)
	ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;	
	ЗаполнитьНаименование(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	МодифицировалиТЧ.ТочкиУчета = Истина;
	МодифицировалиТУ = Истина;
	ТекДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	//Если ЗначениеЗаполнено(ТекДанные.ТочкаУчета) Тогда
		ТекДанные.СтрокаИзменена = Истина;	
	//КонецЕсли;
КонецПроцедуры

#Область СобытияТабличнойЧастиШкалыПриборовУчета

&НаКлиенте
Процедура ШкалыПриборовУчетаПриАктивизацииСтроки(Элемент)
	
 	ТекущиеДанные  									= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТЗПоказанияПриборовУчета.Очистить();
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 						= Новый УникальныйИдентификатор;
	КонецЕсли;
			
	ТЗПоказанияПриборовУчета.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаПоказанияПриборовУчета", ТЗПоказанияПриборовУчета, ТекущиеДанные.IDСтроки, "IDСтроки");
	
	ТЗРасчетСреднегоОбъема.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаРасчетСреднегоОбъема", ТЗРасчетСреднегоОбъема, ТекущиеДанные.IDСтроки, "IDСтроки");

КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриИзменении(Элемент)
	МодифицировалиТЧ.ШкалыПриборовУчета = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаВидДифференцированностиПриИзменении(Элемент)
		
	ИмяТаблицыТочек 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	СоставДиффиренцированности 									= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	
	Для Каждого ТекСтрока Из ТЗПоказанияПриборовУчета Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	ТЗПоказанияПриборовУчета.Очистить();
	для Каждого ТарифнаяЗона Из СоставДиффиренцированности цикл		
		СтрокаТарифнаяЗона 				= ТЗПоказанияПриборовУчета.Добавить();
		СтрокаТарифнаяЗона["IDСтроки"]	= ТекущиеДанные.IDСтроки;
		СтрокаТарифнаяЗона.ТарифнаяЗона	= ТарифнаяЗона;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", СтрокаТарифнаяЗона, "IDСтроки");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекущиеДанные, "IDСтрокиТочкиУчета");
	Иначе
		
		ТекущиеДанные	= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекущиеДанные.IDСтрокиТочкиУчета, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекущиеДанные, "IDСтрокиТочкиУчета");	
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_Показания

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриИзменении(Элемент)
	МодифицировалиТЧ.ПоказанияПриборовУчета = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы["ПоказанияПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", ТекущиеДанные, "IDСтроки");
	Иначе
		
		ТекущиеДанные	= Элементы["ПоказанияПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", ТекущиеДанные.IDСтроки, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", ТекущиеДанные, "IDСтроки");	
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ШкалыПриборовУчета

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные  						= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиТочкиУчета	= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные.IDСтроки;
	КонецЕсли;
	МодифицировалиТЧ.ШкалыПриборовУчета = Истина;
КонецПроцедуры
	
&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные	= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;		
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекущиеДанные, "IDСтрокиТочкиУчета");	
	Иначе
		
		ТекущиеДанные 							= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекущиеДанные.IDСтрокиТочкиУчета, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекущиеДанные, "IDСтрокиТочкиУчета");	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)

	ТекущиеДанные 							= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТЗРасчетСреднегоОбъема.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаРасчетСреднегоОбъема", ТЗРасчетСреднегоОбъема, ТекущиеДанные.IDСтроки, "IDСтроки");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияТЧ_ТочкиУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныВидДифференцированностиПриИзменении(Элемент)
	//ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	//ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	//ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	//// энргРаботаСВидомДифференцированности {
	//энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекущиеДанные.IDСтрокиШкалы,энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности,ТекущиеДанные.услуга),"ПоказанияПриборовУчета",Неопределено); 
	//// энргРаботаСВидомДифференцированности }
	//
	//
	//ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	//ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	//ВидКанальности 							= ТекущиеДанные.ВидКанальности;
	//СоставКанальности 						= энргРаботаСТочкамиУчетаСервер.СоставКанальности(ВидКанальности);
	//
	//Для Каждого ТекСтрока Из ТЗШкалыПриборовУчета Цикл
	//	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	//КонецЦикла;
	//
	//ТЗШкалыПриборовУчета.Очистить();
	//для Каждого Шкала из СоставКанальности цикл		
	//	СтрокаШкалы 						= ТЗШкалыПриборовУчета.Добавить();
	//	СтрокаШкалы["IDСтрокиТочкиУчета"]	= ТекущиеДанные.IDСтроки;
	//	СтрокаШкалы.Шкала		 			= Шкала;
	//	ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", СтрокаШкалы, "IDСтрокиТочкиУчета");
	//КонецЦикла;
	
	
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	ВидДифференцированности 				= ТекущиеДанные.ВидДифференцированности;
	СоставДифференцированности 				= энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	
	// изменяем шкалу
	Для Каждого ТекСтрока Из ТЗШкалыПриборовУчета Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТекСтрока.IDСтрокиТочкиУчета, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	ТЗШкалыПриборовУчета.Очистить();
	
	СтрокаШкалы 						= ТЗШкалыПриборовУчета.Добавить();
	СтрокаШкалы.IDСтроки 				= Новый УникальныйИдентификатор;
	СтрокаШкалы["IDСтрокиТочкиУчета"]	= ТекущиеДанные.IDСтроки;
	СтрокаШкалы.Шкала		 			= ПредопределенноеЗначение("Справочник.энргШкалыПриборовУчета.Основная");
	СтрокаШкалы.ВидДифференцированности = ВидДифференцированности;
	ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", СтрокаШкалы, "IDСтрокиТочкиУчета");
	
	// изменяем показания
	Для Каждого ТекСтрока Из ТЗПоказанияПриборовУчета Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	Если не ЗначениеЗаполнено(ТЗШкалыПриборовУчета[0].IDСтроки) Тогда
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТЗШкалыПриборовУчета[0].IDСтроки, ТЗШкалыПриборовУчета[0].ИдентификаторСтроки);
		
		ТЗШкалыПриборовУчета[0].IDСтроки = Новый УникальныйИдентификатор;
		МодифицировалиТЧ.ШкалыПриборовУчета = Истина;	
		
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", ТЗШкалыПриборовУчета[0], "IDСтроки");	
	КонецЕсли;
	
	ТЗПоказанияПриборовУчета.Очистить();
	для Каждого ТарифнаяЗона из СоставДифференцированности цикл		
		СтрокаПоказаний							= ТЗПоказанияПриборовУчета.Добавить();
		
		СтрокаПоказаний["IDСтроки"]				= ТЗШкалыПриборовУчета[0].IDСтроки;
		СтрокаПоказаний["IDСтрокиТочкиУчета"]	= ТекущиеДанные.IDСтроки;

		СтрокаПоказаний.ТарифнаяЗона		 	= ТарифнаяЗона;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", СтрокаПоказаний, "IDСтроки");
	КонецЦикла;
	
	МодифицировалиТЧ.ШкалыПриборовУчета = Истина;
	МодифицировалиТЧ.ПоказанияПриборовУчета = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
		
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	//УстановитьОтборСтрокПоТУ(ТекущиеДанные.IDСтроки, Элементы.СтраницыТУЕстьШкалыНетТарифныхЗон.ТекущаяСтраница.Имя); 
	
	ТЗШкалыПриборовУчета.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаШкалыПриборовУчета", ТЗШкалыПриборовУчета, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");
	
	ТЗПоказанияПриборовУчета.Очистить();
	Если ТЗШкалыПриборовУчета.Количество() > 0 Тогда
		ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаПоказанияПриборовУчета", ТЗПоказанияПриборовУчета, ТЗШкалыПриборовУчета[0].IDСтроки, "IDСтроки");
	
		//Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущаяСтрока = ТЗШкалыПриборовУчета[0].ПолучитьИдентификатор();
		//////Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ИзменитьСтроку();
		////ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаРасчетСреднегоОбъема", ТЗРасчетСреднегоОбъема, ТЗШкалыПриборовУчета[0].IDСтроки, "IDСтроки");
		////Если ТЗРасчетСреднегоОбъема.Количество() > 0 Тогда
		////	Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].ТекущаяСтрока = ТЗРасчетСреднегоОбъема[0].ПолучитьИдентификатор();
		////	Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].Обновить();
		////КонецЕсли;
	КонецЕсли;
	
	ТЗЗначенияИзмерителей.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаЗначенияИзмерителей", ТЗЗначенияИзмерителей, ТекущиеДанные.IDСтроки, "IDСтроки");
	
	ТЗИзмерители.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаИзмерители", ТЗИзмерители, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");
	
	ТЗНомераПломб.Очистить();
	Если ТЗИзмерители.Количество() > 0 Тогда
		ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаНомераПломб", ТЗНомераПломб, ТЗИзмерители[0].IDСтроки, "IDСтрокиИзмерителя");
	КонецЕсли;
	
	ТЗФормулыРасчета.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаФормулыРасчета", ТЗФормулыРасчета, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");
	
	ТЗПоставщикиСоставныхУслуг.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаПоставщикиСоставныхУслуг", ТЗПоставщикиСоставныхУслуг, ТекущиеДанные.IDСтроки, "IDСтроки");	

КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ТочкиУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	//ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	//ТаблицаФормыШкалы	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	//УстановитьОтборСтрокПоТУ(ТекущиеДанные.IDСтроки, Элементы.СтраницыТУЕстьШкалыНетТарифныхЗон.ТекущаяСтраница.Имя); 
	
	ТЗШкалыПриборовУчета.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаШкалыПриборовУчета", ТЗШкалыПриборовУчета, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");
	
	ТЗРасчетСреднегоОбъема.Очистить();
	Если ТЗШкалыПриборовУчета.Количество() > 0 Тогда
		Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ТекущаяСтрока = ТЗШкалыПриборовУчета[0].ПолучитьИдентификатор();
		//////Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета].ИзменитьСтроку();
		////ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаРасчетСреднегоОбъема", ТЗРасчетСреднегоОбъема, ТЗШкалыПриборовУчета[0].IDСтроки, "IDСтроки");
		////Если ТЗРасчетСреднегоОбъема.Количество() > 0 Тогда
		////	Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].ТекущаяСтрока = ТЗРасчетСреднегоОбъема[0].ПолучитьИдентификатор();
		////	Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].Обновить();
		////КонецЕсли;
	КонецЕсли;
	
	ТЗЗначенияИзмерителей.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаЗначенияИзмерителей", ТЗЗначенияИзмерителей, ТекущиеДанные.IDСтроки, "IDСтроки");
	
	ТЗФормулыРасчета.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаФормулыРасчета", ТЗФормулыРасчета, ТекущиеДанные.IDСтроки, "IDСтрокиТочкиУчета");
	
	ТЗПоставщикиСоставныхУслуг.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаПоставщикиСоставныхУслуг", ТЗПоставщикиСоставныхУслуг, ТекущиеДанные.IDСтроки, "IDСтроки");	

КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ТочкиУчетаНетШкалНетТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыНаправленийИзмеренийТУ  	= "ЗначенияИзмерителей" + ПрефиксТочекУчета;
	ТаблицыНаправленийИзмеренийТУ  		= Элементы[ИмяТаблицыНаправленийИзмеренийТУ];
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПриАктивацииСтроки(ТаблицыНаправленийИзмеренийТУ,"IDСтроки",ТекущиеДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонНаправлениеИспользованияТУПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета; 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаправленияИспользованияТУ(ТекущиеДанные.IDСтроки,ТекущиеДанные.НаправлениеИспользованияТУ);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонНаправлениеИспользованияТУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуВыбораНаправленийИзмерителейТУ(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ЗначенияПлощадей

&НаКлиенте
Процедура ЗначениеПлощадейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные  					= Элементы.ЗначенияПлощадей.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиАбонента	= Элементы.Абоненты.ТекущиеДанные.IDСтроки;
	КонецЕсли;
	МодифицировалиТЧ.ЗначениеПлощадей = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПлощадейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы.ЗначенияПлощадей.ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаЗначениеПлощадей, "ДеревоПоискаЗначениеПлощадей", ТекущиеДанные);	
	Иначе
		
		ТекущиеДанные	= Элементы.ЗначенияПлощадей.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаЗначениеПлощадей, "ДеревоПоискаЗначениеПлощадей", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаЗначениеПлощадей, "ДеревоПоискаЗначениеПлощадей", ТекущиеДанные);	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПлощадейПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы.ЗначенияПлощадей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаЗначениеПлощадей, "ДеревоПоискаЗначениеПлощадей", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.ЗначениеПлощадей = Истина;

КонецПроцедуры

	
#КонецОбласти

#Область СобытияТЧ_Жильцы

&НаКлиенте
Процедура ЖильцыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные  					= Элементы.ТЗЛьготники.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиАбонента 	= Элементы.Абоненты.ТекущиеДанные.IDСтроки;
	КонецЕсли;
	МодифицировалиТЧ.Жильцы = Истина;
КонецПроцедуры
	
&НаКлиенте
Процедура ЖильцыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные	= Элементы.ТЗЛьготники.ТекущиеДанные;		
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаЛьготники, "ДеревоПоискаЛьготники", ТекущиеДанные);	
	Иначе
		
		ТекущиеДанные 							= Элементы.ТЗЛьготники.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаЛьготники, "ДеревоПоискаЛьготники", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаЛьготники, "ДеревоПоискаЛьготники", ТекущиеДанные);	
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЗЛьготникиПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы.ТЗЛьготники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаЛьготники, "ДеревоПоискаЛьготники", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.Жильцы = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_ВидыБлагоустройстваТарифныеКатегории

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные  					= Элементы.ТЗВидыБлагоустройства.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиАбонента	= Элементы.Абоненты.ТекущиеДанные.IDСтроки;
	КонецЕсли;
	МодифицировалиТЧ.ВидыБлагоустройства = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидыБлагоустройстваТарифныеКатегорииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы.ТЗВидыБлагоустройства.ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаВидыБлагоустройства, "ДеревоПоискаВидыБлагоустройства", ТекущиеДанные);
	Иначе
		
		ТекущиеДанные	= Элементы.ТЗВидыБлагоустройства.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаВидыБлагоустройства, "ДеревоПоискаВидыБлагоустройства", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаВидыБлагоустройства, "ДеревоПоискаВидыБлагоустройства", ТекущиеДанные);	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЗВидыБлагоустройстваПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы.ТЗВидыБлагоустройства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаВидыБлагоустройства, "ДеревоПоискаВидыБлагоустройства", ТекущиеДанные.IDСтрокиАбонента, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.ВидыБлагоустройства = Истина;
КонецПроцедуры

#КонецОбласти 

#Область СобытияТЧ_ФормулыРасчета

&НаКлиенте
Процедура ФормулыРасчетаСтроениеПриИзменении(Элемент)
	ТекущиеДанные 				= Элементы["ФормулыРасчета" + ПрефиксТочекУчета].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Строение) Тогда
		ДанныеСтроения				= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(ТекущиеДанные.Строение,ТекущиеДанные.Помещение);
		ТекущиеДанные.КлючПомещения	= ДанныеСтроения.КлючПомещения;
	Иначе
		ТекущиеДанные.Помещение 	= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		ТекущиеДанные.КлючПомещения = ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ТекущиеДанные.ТочкаУчета 	= ПредопределенноеЗначение("Справочник.энргТочкиУчета.ПустаяСсылка");
		ТекущиеДанные.Услуга		= ПредопределенноеЗначение("Справочник.энргВидыУслуг.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаПомещениеПриИзменении(Элемент)
	ТекущиеДанные 					= Элементы["ФормулыРасчета" + ПрефиксТочекУчета].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Помещение) Тогда
		ДанныеСтроения				= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(ТекущиеДанные.Строение,ТекущиеДанные.Помещение);
		ТекущиеДанные.КлючПомещения	= ДанныеСтроения.КлючПомещения;
	Иначе
		ТекущиеДанные.КлючПомещения = ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		таблицаТочкиУчета 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
		ТекущиеДанные  								= Элементы["ФормулыРасчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.IDСтрокиТочкиУчета			= таблицаТочкиУчета.ТекущиеДанные.IDСтроки;
		//ТекущиеДанные.IDСтроки 						= Новый УникальныйИдентификатор;
	КонецЕсли;
	МодифицировалиТЧ.ФормулыРасчета = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы["ФормулыРасчета" + ПрефиксТочекУчета].ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаФормулыРасчета, "ДеревоПоискаФормулыРасчета", ТекущиеДанные, "IDСтрокиТочкиУчета");
	Иначе
		
		ТекущиеДанные	= Элементы["ФормулыРасчета" + ПрефиксТочекУчета].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаФормулыРасчета, "ДеревоПоискаФормулыРасчета", ТекущиеДанные.IDСтрокиТочкиУчета, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаФормулыРасчета, "ДеревоПоискаФормулыРасчета", ТекущиеДанные, "IDСтрокиТочкиУчета");	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФормулыРасчетаПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы["ФормулыРасчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаФормулыРасчета, "ДеревоПоискаФормулыРасчета", ТекущиеДанные.IDСтрокиТочкиУчета, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.ФормулыРасчета = Истина;

КонецПроцедуры

#КонецОбласти

#Область СобюытияТЧ_ПоставщикиСоставныхУслуг

&НаКлиенте
Процедура ПоставщикиСоставныхУслугЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиСоставныхУслугЕстьШкалыНетТарифныхЗонПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	МодифицировалиТЧ.ПоставщикиСоставныхУслуг = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиСоставныхУслугЕстьШкалыНетТарифныхЗонПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы["ПоставщикиСоставныхУслуг" + ПрефиксТочекУчета].ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", ТекущиеДанные, "IDСтроки");
	Иначе
		
		ТекущиеДанные	= Элементы["ПоставщикиСоставныхУслуг" + ПрефиксТочекУчета].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", ТекущиеДанные.IDСтроки, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", ТекущиеДанные, "IDСтроки");	
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧ_РасчетСреднегоОбъема

&НаКлиенте
Процедура РасчетСреднегоОбъемаЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаРасчетСреднегоОбъема, "ДеревоПоискаРасчетСреднегоОбъема", ТекущиеДанные.IDСтроки, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.РасчетСреднегоОбъема = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоОбъемаЕстьШкалыНетТарифныхЗонПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТаблицаТочкиУчета 		= Элементы["ШкалыПриборовУчета" + ПрефиксТочекУчета];
	Если НоваяСтрока И ТаблицаТочкиУчета.ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные  			= Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].ТекущиеДанные;
		ТекущиеДанные.IDСтроки	= ТаблицаТочкиУчета.ТекущиеДанные.IDСтроки;
	КонецЕсли;
	МодифицировалиТЧ.РасчетСреднегоОбъема = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоОбъемаЕстьШкалыНетТарифныхЗонПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаРасчетСреднегоОбъема, "ДеревоПоискаРасчетСреднегоОбъема", ТекущиеДанные, "IDСтроки");
	Иначе
		
		ТекущиеДанные	= Элементы["РасчетСреднегоОбъема" + ПрефиксТочекУчета].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаРасчетСреднегоОбъема, "ДеревоПоискаРасчетСреднегоОбъема", ТекущиеДанные.IDСтроки, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаРасчетСреднегоОбъема, "ДеревоПоискаРасчетСреднегоОбъема", ТекущиеДанные, "IDСтроки");	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьСтроения(ЧастныйСектор)
	
	Элементы.АбонентыСтроение.Видимость = ЧастныйСектор;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораНаправленийИзмерителейТУ(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура("Отбор", Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.энргНаправлениеИспользованияТочекУчета.ПустаяСсылка")));
	ОткрытьФорму("Справочник.энргНаправлениеИспользованияТочекУчета.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаправленияИспользованияТУ(IDСтроки,РодительскийЭлемент)
	
	Справочники.энргНаправлениеИспользованияТочекУчета.ОбновитьТЧЗначенияИзмерителей(Объект.ЗначенияИзмерителей,IDСтроки,РодительскийЭлемент,Истина);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаправленияИспользованияТУ(РодительскийЭлемент)
	
	РезультатЗапроса = Справочники.энргНаправлениеИспользованияТочекУчета.ВернутьПодчиненныеЭлементы(РодительскийЭлемент);
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НаправлениеИспользованияТУ");

КонецФункции

&НаКлиенте
Процедура ЗаполнитьНаименование(ТекДанные)
	Если ТекДанные.Головная Тогда 
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга + "_Головная";
	Иначе
		ТекДанные.НаименованиеТочки = "" + ТекДанные.Расположение + "_" + ТекДанные.Услуга;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеУслугМКД(Организация, Район, МКД)
	
	АдресВременногоХранилищаУслугиМКД  	= ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор); 	
	УслугиМКД 							= энргРаботаСТочкамиУчетаСервер.УслугиМКД(Организация, Район, МКД);	
	ПоместитьВоВременноеХранилище(УслугиМКД, АдресВременногоХранилищаУслугиМКД);
	
КонецПроцедуры

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков", IDСтроки = Неопределено, СоотвествиеУслуг = Неопределено) Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
	УстановитьПоставщиковВТЗ(IDСтроки, СоотвествиеУслуг);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоставщиковВТЗ(IDСтроки, СоотвествиеУслуг)   
	Для Каждого ТекСтрока Из ТЗПоставщикиСоставныхУслуг Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", ТекСтрока.IDСтроки, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	ТЗПоставщикиСоставныхУслуг.Очистить();
	
	Для Каждого КлючЗначение Из СоотвествиеУслуг Цикл
		СтрокаТЗ						= ТЗПоставщикиСоставныхУслуг.Добавить();
		СтрокаТЗ.IDСтроки				= IDСтроки;
		СтрокаТЗ.ЧастьСоставнойУслуги	= КлючЗначение.Ключ;
		СтрокаТЗ.Поставщик				= КлючЗначение.Значение["Поставщик"];
		СтрокаТЗ.Плательщик 			= КлючЗначение.Значение["Плательщик"];		
		
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаПоставщикиСоставныхУслуг, "ДеревоПоискаПоставщикиСоставныхУслуг", СтрокаТЗ, "IDСтроки");
	КонецЦикла;
КонецПроцедуры

// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы,"ДеревоТочекУчета");
КонецПроцедуры
// энргРаботаСПоставщиками }

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект)
	
	Сч 														= 0;
	ИзмененныеТУ = Новый Массив;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ДанныеПрибораУчета.Вставить("ДополнительныеСвойства",	Новый Структура("НеОтправлятьВГИСЖКХ", Истина));
		
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);		
		
		Если СтрокаТочки.СтрокаИзменена И ЗначениеЗаполнено(СтрокаТочки.ТочкаУчета) Тогда
			ИзмененныеТУ.Добавить(СтрокаТочки.ТочкаУчета);
		КонецЕсли; 
		Сч 													= Сч + 1;		
	КонецЦикла;
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзмененныеТУ", 		ИзмененныеТУ);
КонецПроцедуры


&НаСервере
Функция ПолучаемыеСвойстваПриборовУчета() 
	ПолучаемыеСвойстваПриборовУчета = "
	|Код,ТипПрибораУчета,ВидКанальности,ТипУзлаУчета,РегистрируетОбъем,
	|КодАСКУЭ,СобственникАСКУЭ,СобственникСИ";	
	Возврат ПолучаемыеСвойстваПриборовУчета;
КонецФункции

&НаСервере
Функция ПолучаемыеСвойстваТочекУчета() 
	ПолучаемыеСвойстваТочекУчета 	= "
	|Наименование,Расположение";	
	Возврат ПолучаемыеСвойстваТочекУчета;
КонецФункции

&НаСервере
Процедура ЗаполнитьСвойстваТочекУчета(Знач ТекущийОбъект)
	
	ПолучаемыеСвойстваТочекУчета 	= ПолучаемыеСвойстваТочекУчета();
	мТочкиУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ТочкаУчета"));	
	СвойстваТочекУчета 				= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектов(мТочкиУчета, ПолучаемыеСвойстваТочекУчета);
	ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Объект.ТочкиУчета, СвойстваТочекУчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамТочекУчета(Коллекция, СвойстваТочекУчета)
	
	СоотвествиеРеквизитовСвойств 								= СоотвествиеРеквизитовСвойствамТочкиУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ТочкаУчета) Тогда
			СвойстваТочкиУчета 									= СвойстваТочекУчета[СтрокаКоллекции.ТочкаУчета];		
		Иначе
			СвойстваТочкиУчета 									= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеТочки);
		КонецЕсли; 
		
		Если СвойстваТочкиУчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СвойстваТочкиУчета.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваТочкиУчета[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры


&НаСервере
Функция СоотвествиеРеквизитовСвойствамТочкиУчета()
	Возврат Новый Структура("НаименованиеТочки,Расположение","Наименование","Расположение");
КонецФункции

&НаСервере
Функция СоотвествиеРеквизитовСвойствамПрибораУчета()
	Возврат Новый Структура("ЗаводскойНомер, ТипПрибораУчета, ВидКанальности, РегистрируетОбъем", "Код", "ТипПрибораУчета", "ВидКанальности", "РегистрируетОбъем");
КонецФункции

#КонецОбласти

#Область РаботаСДеревьями

#Область ЗаполнениеТЧИзДанныхФормы

&НаКлиенте
Процедура ЗаполнитьОбъектНаОснованииДерева(НазваниеТЧ, Строки, Родитель, ТолькоПервыйУровень = Ложь)
	
	Для Каждого Строка Из Строки Цикл 		
		СтрокаТочки  						= Объект[НазваниеТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочки, Строка);
		Если Не Родитель = Неопределено Тогда
			СтрокаТочки.IDСтрокиРодитель	= Родитель;
		КонецЕсли;
		Если Не ТолькоПервыйУровень Тогда
			ЗаполнитьОбъектНаОснованииДерева(НазваниеТЧ, Строка.ПолучитьЭлементы(), Строка.IDСтроки, ТолькоПервыйУровень);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАбонентовНаОснованииДереваАбонентов(Строки, Родитель)
	
	Для Каждого Строка Из Строки Цикл 		
		СтрокаТочки  						= Объект.Абоненты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочки, Строка);
		Если Не Родитель = Неопределено Тогда
			СтрокаТочки.IDСтрокиРодитель	= Родитель;			
		КонецЕсли;
		ЗаполнитьАбонентовНаОснованииДереваАбонентов(Строка.ПолучитьЭлементы(), Строка.IDСтроки);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДеревьев
&НаСервере
Процедура ЗаполнитьДеревоНаОснованииОбъектаНаСервере(НазваниеТЧ, СтрокаРодитель, Родитель)
	//пАбоненты = РеквизитФормыВЗначение("Объект").Абоненты;
	пАбоненты = Объект[НазваниеТЧ].Выгрузить();
	пАбоненты.Индексы.Добавить("IDСтрокиРодитель");
	ЗаполнитьДеревоНаОснованииОбъектаРекурсивно(пАбоненты, СтрокаРодитель, Родитель)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНаОснованииОбъектаРекурсивно(ТекущийОбъект, СтрокаРодитель, Родитель)
	//пАбоненты = РеквизитФормыВЗначение("Объект").Абоненты;
	Вершины 			= ТекущийОбъект.НайтиСтроки(Новый Структура("IDСтрокиРодитель", Родитель));
	//Вершины 			= ТекущийОбъект.Абоненты.НайтиСтроки(Новый Структура("IDСтрокиРодитель", Родитель));
	Строки  			= СтрокаРодитель.ПолучитьЭлементы();
	
	Для Сч = 0 По Вершины.ВГраница() Цикл
		Если ЗначениеЗаполнено(Вершины[Сч].IDСтроки) Тогда
			СтрокаДерева  	= Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Вершины[Сч]);
			ЗаполнитьДеревоНаОснованииОбъектаРекурсивно(ТекущийОбъект, СтрокаДерева, Вершины[Сч].IDСтроки);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&Наклиенте
Процедура ЗаполнитьДеревоУслугНаОснованииТочекУчетаНаКлиенте(ТекущийОбъект, СтрокаРодитель, Родитель, IDСтрокиАбонента)
	
	отб = Новый Структура("IDСтрокиАбонента,IDСтрокиРодитель", IDСтрокиАбонента, Родитель);
	Вершины = НайтиСтрокиДерева("ДеревоПоискаТочекУчета", отб);
	
	Строки	= СтрокаРодитель.ПолучитьЭлементы();
	
	Если Вершины <> Неопределено Тогда
		Для Сч = 0 По Вершины.ВГраница() Цикл
			Если ЗначениеЗаполнено(Вершины[Сч].IDСтроки) Тогда
				СтрокаДерева  	= Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, Вершины[Сч]);
				ЗаполнитьДеревоУслугНаОснованииТочекУчетаНаКлиенте(ТекущийОбъект, СтрокаДерева, Вершины[Сч].IDСтроки, IDСтрокиАбонента);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&Наклиенте
Процедура ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте(НазваниеДерева, Строки, IDСтроки, НазваниеIDСтроки = "IDСтрокиАбонента")
	
	отб = Новый Структура(НазваниеIDСтроки, IDСтроки);
	Вершины = НайтиСтрокиДерева(НазваниеДерева, отб);
		
	Если Вершины <> Неопределено Тогда
		Для Сч = 0 По Вершины.ВГраница() Цикл
			Если ЗначениеЗаполнено(Вершины[Сч][НазваниеIDСтроки]) Тогда
				СтрокаТЗ  	= Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, Вершины[Сч]);
				СтрокаТЗ.ИдентификаторСтроки = Вершины[Сч].ПолучитьИдентификатор();	// для удаления 
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПоискаНаОснованииОбъекта(НазваниеТЧ, СтрокаРодитель, НазваниеIDСтроки = "IDСтрокиАбонента")
	ТЗТекущийОбъект = Объект[НазваниеТЧ].Выгрузить();
	
	Строки	= СтрокаРодитель.ПолучитьЭлементы();
	
	Для Каждого ТекСтрока Из ТЗТекущийОбъект Цикл
		Если ЗначениеЗаполнено(ТекСтрока[НазваниеIDСтроки]) Тогда
			СтрокаДерева  	= Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуВДеревеПоиска(ДеревоПоиска, НазваниеДереваПоиска, IDСтроки, ИдентификаторСтроки)
	// Надо удалить в ДеревеПоиска
	ВеткаДляУдаления = ДеревоПоиска.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ВеткаДляУдаления <> Неопределено Тогда 
		ДеревоПоиска.ПолучитьЭлементы().Удалить(ВеткаДляУдаления);
	КонецЕсли;
	
	// Надо удалить в Структуре поиска
	соотДанных	= ДанныеДляПоискаВДеревьях[НазваниеДереваПоиска];
	рИмеющееся	= соотДанных.Получить(IDСтроки);
	Если рИмеющееся <> Неопределено Тогда 
		Для сч = 0 по рИмеющееся.ВГраница() Цикл
			Если рИмеющееся[сч].ПолучитьИдентификатор() = ИдентификаторСтроки Тогда
				рИмеющееся.Удалить(сч);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ДанныеДляПоискаВДеревьях.Вставить(НазваниеДереваПоиска,соотДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДеревоПоиска(ДеревоПоиска, НазваниеДереваПоиска, ТекущиеДанные, НазваниеIDСтроки = "IDСтрокиАбонента")
	
	НовВетка = ДеревоПоиска.ПолучитьЭлементы().Добавить();
	ЗаполнитьЗначенияСвойств(НовВетка, ТекущиеДанные);
	ТекущиеДанные.ИдентификаторСтроки = НовВетка.ПолучитьИдентификатор();
	
	// добавляем текущую ветку к имеющимся
	рКлючПолей	= НовВетка[НазваниеIDСтроки];
	соотДанных	= ДанныеДляПоискаВДеревьях[НазваниеДереваПоиска];
	рИмеющееся	= соотДанных.Получить(рКлючПолей);
	Если рИмеющееся = Неопределено Тогда 
		рИмеющееся	= Новый Массив; 
	КонецЕсли;
	
	рИмеющееся.Добавить(НовВетка);
	соотДанных.Вставить(рКлючПолей,рИмеющееся);
	ДанныеДляПоискаВДеревьях.Вставить(НазваниеДереваПоиска,соотДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокиВДеревоПоискаТочекУчета(ТекущийОбъект, СтрокаРодитель)
	
	ВершиныДляДобавления = ТекущийОбъект.ПолучитьЭлементы();
	Строки = СтрокаРодитель.ПолучитьЭлементы();
	Для Каждого ТекВершина Из ВершиныДляДобавления Цикл
		Если ЗначениеЗаполнено(ТекВершина.IDСтроки) Тогда
			СтрокаДерева  	= Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, ТекВершина);
			ДобавитьСтрокиВДеревоПоискаТочекУчета(ТекВершина, СтрокаДерева);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПоискВДанныхФормыДерево

// Вспомогательная рекурсивная, вызывается из ИндексироватьДерево
&НаКлиенте
Процедура ИндексироватьВетку(рВетка,мИмёнПолей,соотДанных)
	Если ТипЗнч(ДанныеДляПоискаВДеревьях)<>Тип("Структура") Тогда
		ДанныеДляПоискаВДеревьях=Новый Структура;
	КонецЕсли;
	//
	Если ТипЗнч(рВетка)=Тип("Строка") Тогда
		// по имени коллекции получаем её саму
		рИмяКоллекции=рВетка;
		рВетка=ЭтаФорма[рВетка];
	Иначе
		рИмяКоллекции="";
	КонецЕсли;
	//
	Если ПустаяСтрока(рИмяКоллекции) и мИмёнПолей.Количество()>1 Тогда 
		// инициализируем хранение порядка полей в ключе
		соотПолей=Новый Соответствие;
		Для й=0 По мИмёнПолей.Количество()-1 Цикл
			соотПолей.Вставить(мИмёнПолей[й],й);
		КонецЦикла;
		соотДанных.Вставить("ПоляИндексаПоиска",соотПолей);
	КонецЕсли;
	//
	Для каждого рПодветка Из рВетка.ПолучитьЭлементы() Цикл
		//ОбработкаПрерыванияПользователя();
		Если мИмёнПолей.Количество()=1 Тогда // используем простой ключ
			рКлючПолей=рПодветка[мИмёнПолей.Получить(0)];
		Иначе // создаём составной ключ
			рКлючПолей=""; разд="";
			Для каждого рИмяПоля Из мИмёнПолей Цикл
				знчПоля=рПодветка[рИмяПоля];
				// рКлючПолей=рКлючПолей+разд+СериализаторXDTO.XMLСтрока(знчПоля); разд="#";
				рКлючПолей=рКлючПолей+разд+знчПоля; разд="#";
			КонецЦикла;
		КонецЕсли;
		// добавляем текущую ветку к имеющимся
		рИмеющееся=соотДанных.Получить(рКлючПолей);
		Если рИмеющееся=Неопределено Тогда 
			рИмеющееся=Новый Массив 
		КонецЕсли;
		
		рИмеющееся.Добавить(рПодветка);
		соотДанных.Вставить(рКлючПолей,рИмеющееся);
		// идём глубже		
		ИндексироватьВетку(рПодветка,мИмёнПолей,соотДанных);
	КонецЦикла;
	//
	// помещаем в общее хранение
	Если не ПустаяСтрока(рИмяКоллекции) Тогда
		ДанныеДляПоискаВДеревьях.Вставить(рИмяКоллекции,соотДанных);
	КонецЕсли;
КонецПроцедуры

// Пример вызова индексации (надо вызывать при добавлении новых веток)
&НаКлиенте
Процедура ИндексироватьДерево()
	
	мИмёнПолей = Новый Массив;
	мИмёнПолей.Добавить("IDСтрокиАбонента");
	мИмёнПолей.Добавить("IDСтрокиРодитель");
	
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаТочекУчета",			мИмёнПолей,	соотИ); // основная рабочая
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтрокиАбонента");
	
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаЗначениеПлощадей",		мИмёнПолей,	соотИ);
	
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаВзаиморасчеты",			мИмёнПолей,	соотИ);
	
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаВидыБлагоустройства",	мИмёнПолей,	соотИ);
	
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаЛьготники",				мИмёнПолей,	соотИ);
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтрокиТочкиУчета");
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаШкалыПриборовУчета",	мИмёнПолей,	соотИ);
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтроки");
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаПоказанияПриборовУчета",	мИмёнПолей,	соотИ);
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтроки");
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаЗначенияИзмерителей",	мИмёнПолей,	соотИ);
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтрокиТочкиУчета");
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаИзмерители",			мИмёнПолей,	соотИ);
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтрокиИзмерителя");
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаНомераПломб",			мИмёнПолей,	соотИ);
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтрокиТочкиУчета");
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаФормулыРасчета",	мИмёнПолей,	соотИ);
	
	мИмёнПолей	= Новый Массив;
	мИмёнПолей.Добавить("IDСтроки");
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаПоставщикиСоставныхУслуг",	мИмёнПолей,	соотИ);
	
	соотИ = Новый Соответствие;
	ИндексироватьВетку("ДеревоПоискаРасчетСреднегоОбъема",	мИмёнПолей,	соотИ);
КонецПроцедуры

&НаКлиенте
Функция ПостроитьКлючПолей(рСтруктура, соотПолей)
	Если рСтруктура.Количество()=1 Тогда
		Для каждого киз Из рСтруктура Цикл 
			рКлючПолей = киз.Значение 
		КонецЦикла;
	Иначе
		// получаем правильный порядок значений полей в индексе		
		спПолей = Новый СписокЗначений;
		Для каждого киз Из рСтруктура Цикл
			//спПолей.Добавить(соотПолей.Получить(киз.Ключ),СериализаторXDTO.XMLСтрока(киз.Значение));
			спПолей.Добавить(соотПолей.Получить(киз.Ключ),киз.Значение);
		КонецЦикла;  
		спПолей.СортироватьПоЗначению();
		рКлючПолей=""; разд="";
		Для каждого знч Из спПолей Цикл
			рКлючПолей = рКлючПолей + разд + знч.Представление;
			разд="#";
		КонецЦикла;
	КонецЕсли;
	Возврат рКлючПолей;
КонецФункции

&НаКлиенте
Функция НайтиСтрокиДерева(рИмяКоллекции,отб)
	рПустышка = Новый Массив;
	Если ТипЗнч(ДанныеДляПоискаВДеревьях)<>Тип("Структура") Тогда
		Возврат рПустышка 
	КонецЕсли;
	
	соотДанных = Неопределено;
	Если не ДанныеДляПоискаВДеревьях.Свойство(рИмяКоллекции,соотДанных) Тогда
		Возврат рПустышка 
	КонецЕсли;
	
	Если ТипЗнч(соотДанных)<>Тип("Соответствие") Тогда 
		Возврат рПустышка 
	КонецЕсли;
	
	// строим ключ согласно порядку индексации
	Если отб.Количество()>1 Тогда
		соотПолей = соотДанных.Получить("ПоляИндексаПоиска");
		Если ТипЗнч(соотПолей)<>Тип("Соответствие") Тогда 
			Возврат рПустышка 
		КонецЕсли;
	Иначе
		соотПолей = Неопределено;
	КонецЕсли;
	
	рКлючПолей = ПостроитьКлючПолей(отб,соотПолей);
	Если ПустаяСтрока(рКлючПолей) Тогда 
		Возврат рПустышка 
	КонецЕсли;
	
	// собственно ищем
	Возврат соотДанных.Получить(рКлючПолей);
КонецФункции

#КонецОбласти



#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьУслугу(Команда)
	ТаблицаФормы 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	НоваяСтрока  				= ДеревоТочекУчета.ПолучитьЭлементы().Добавить();
	НоваяСтрока.IDСтрокиАбонента	= Элементы.Абоненты.ТекущиеДанные.IDСтроки;
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненнуюУслугу(Команда)
	Отказ 						= Истина;
	ТаблицаФормы 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета];
	Родитель  					= ДеревоТочекУчета.НайтиПоИдентификатору(ТаблицаФормы.ТекущаяСтрока);
	НоваяСтрока  					= Родитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.IDСтрокиРодитель	= ТаблицаФормы.ТекущиеДанные.IDСтроки;
	НоваяСтрока.IDСтрокиАбонента	= ТаблицаФормы.ТекущиеДанные.IDСтрокиАбонента;
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАбонента(Команда)
	Если МодифицировалиТУ Тогда		
		// удаляем старые строки
		ПустойКлючСтроки  = Новый ОписаниеТипов("УникальныйИдентификатор");
		отб = Новый Структура("IDСтрокиАбонента,IDСтрокиРодитель", ТекIDАбонента, ПустойКлючСтроки.ПривестиЗначение());
		ВершиныДляУдаления = НайтиСтрокиДерева("ДеревоПоискаТочекУчета", отб);
		
		Если ЗначениеЗаполнено(ВершиныДляУдаления) Тогда
			ВсеВершины = ДеревоПоискаТочекУчета.ПолучитьЭлементы();
			Для Каждого ТекВершина Из ВершиныДляУдаления Цикл
				Если ВсеВершины.Индекс(ТекВершина) <> -1 Тогда
					ВсеВершины.Удалить(ВсеВершины.Индекс(ТекВершина));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// добавляем новые строки
		ДобавитьСтрокиВДеревоПоискаТочекУчета(ДеревоТочекУчета, ДеревоПоискаТочекУчета);
		
		мИмёнПолей = Новый Массив;
		мИмёнПолей.Добавить("IDСтрокиАбонента");
		мИмёнПолей.Добавить("IDСтрокиРодитель");
		соотИ = Новый Соответствие;
		ИндексироватьВетку("ДеревоПоискаТочекУчета",	мИмёнПолей,	соотИ); // основная рабочая
		
		МодифицировалиТУ = Ложь;
	КонецЕсли;
	
	ТаблицаФормы 				= Элементы["Абоненты"];
	НоваяСтрока  				= АбонентыДерево.ПолучитьЭлементы().Добавить();
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();
	
	ТекIDАбонента = НоваяСтрока.IDСтроки;
			
	ДеревоТочекУчета.ПолучитьЭлементы().Очистить();
	
	ТЗЗначенияПлощадей.Очистить();
	
	ТЗВзаиморасчеты.Очистить();
	
	ТЗВидыБлагоустройства.Очистить();
	
	ТЗЛьготники.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомнату(Команда)
	Отказ 						= Истина;
	ТаблицаФормы 				= Элементы["Абоненты"];
	Родитель  					= АбонентыДерево.НайтиПоИдентификатору(ТаблицаФормы.ТекущаяСтрока);
	НоваяСтрока  					= Родитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.IDСтрокиРодитель	= ТаблицаФормы.ТекущиеДанные.IDСтроки;
	НоваяСтрока.Строение			= ТаблицаФормы.ТекущиеДанные.Строение;
	НоваяСтрока.ДатаОткрытияЛС		= ТаблицаФормы.ТекущиеДанные.ДатаОткрытияЛС;
	НоваяСтрока.МаршрутКонтролера	= ТаблицаФормы.ТекущиеДанные.МаршрутКонтролера;
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();
	ТЗИзмерители.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияИзмерителейЕстьШкалыНетТарифныхЗонПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияИзмерителейЕстьШкалыНетТарифныхЗонПриИзменении(Элемент)
	МодифицировалиТЧ.ЗначенияИзмерителей = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияИзмерителейЕстьШкалыНетТарифныхЗонПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы["ЗначенияИзмерителей" + ПрефиксТочекУчета].ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаЗначенияИзмерителей, "ДеревоПоискаЗначенияИзмерителей", ТекущиеДанные, "IDСтроки");
	Иначе
		
		ТекущиеДанные	= Элементы["ЗначенияИзмерителей" + ПрефиксТочекУчета].ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаЗначенияИзмерителей, "ДеревоПоискаЗначенияИзмерителей", ТекущиеДанные.IDСтроки, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаЗначенияИзмерителей, "ДеревоПоискаЗначенияИзмерителей", ТекущиеДанные, "IDСтроки");	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЗИзмерителиПриИзменении(Элемент)
	МодифицировалиТЧ.Измерители = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЗНомераПломбПриИзменении(Элемент)
	МодифицировалиТЧ.НомераПломб = Истина;
	
	ТекущиеДанные 							= Элементы["ТЗНомераПломб"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтрокиИзмерителя) Тогда
		ТекущиеДанные.IDСтрокиИзмерителя 				= Элементы.ТЗИзмерители.ТекущиеДанные.IDСтроки;
		ТекущиеДанные.IDСтрокиТочкиУчета 				= Элементы.ТочкиУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные.IDСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЗИзмерителиПриАктивизацииСтроки(Элемент)
			
	ТекущиеДанные 							= Элементы["ТЗИзмерители"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.IDСтрокиТочкиУчета) Тогда
		ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
		ТекущиеДанныеТУ 						= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
		ТекущиеДанные.IDСтрокиТочкиУчета 		= ТекущиеДанныеТУ.IDСтроки;
	КонецЕсли;
	
	
	
	ТЗНомераПломб.Очистить();
	ЗаполнитьТЗНаОснованииДереваПоискаНаКлиенте("ДеревоПоискаНомераПломб", ТЗНомераПломб, ТекущиеДанные.IDСтроки, "IDСтрокиИзмерителя");
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗИзмерителиПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы["ТЗИзмерители"].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТЗНомераПломб Цикл
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаНомераПломб, "ДеревоПоискаНомераПломб", ТекСтрока.IDСтрокиИзмерителя, ТекСтрока.ИдентификаторСтроки);
	КонецЦикла;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаИзмерители, "ДеревоПоискаИзмерители", ТекущиеДанные.IDСтроки, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.Измерители = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТочкуУчета(Команда)
	ТаблицаФормы 				= Элементы["ТочкиУчетаНетШкалЕстьТарифныеЗоны"];
	НоваяСтрока  				= ДеревоТочекУчета.ПолучитьЭлементы().Добавить();
	НоваяСтрока.IDСтрокиАбонента	= ТекIDАбонента;
	ТаблицаФормы.ТекущаяСтрока 	= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();
	
	МодифицировалиТУ = Истина;
	
	ТЗШкалыПриборовУчета.Очистить();
	СтрокаШкалы 						= ТЗШкалыПриборовУчета.Добавить();
	СтрокаШкалы.IDСтроки 				= Новый УникальныйИдентификатор;
	СтрокаШкалы["IDСтрокиТочкиУчета"]	= НоваяСтрока.IDСтроки;
	СтрокаШкалы.Шкала		 			= ПредопределенноеЗначение("Справочник.энргВидыКанальности.Одноканальный");
	ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаШкалыПриборовУчета, "ДеревоПоискаШкалыПриборовУчета", СтрокаШкалы, "IDСтрокиТочкиУчета");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненнуюТУ(Команда)
	ТаблицаФормы 					= Элементы["ТочкиУчетаНетШкалЕстьТарифныеЗоны"];
	Родитель  						= ДеревоТочекУчета.НайтиПоИдентификатору(ТаблицаФормы.ТекущаяСтрока);
	НоваяСтрока  					= Родитель.ПолучитьЭлементы().Добавить();
	НоваяСтрока.IDСтрокиАбонента	= ТекIDАбонента;
	НоваяСтрока.IDСтрокиРодитель	= ТаблицаФормы.ТекущиеДанные.IDСтроки;
	ТаблицаФормы.ТекущаяСтрока 		= НоваяСтрока.ПолучитьИдентификатор();
	ТаблицаФормы.ИзменитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ТекущиеДанные 							= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуВДеревеПоиска(ДеревоПоискаПоказанияПриборовУчета, "ДеревоПоискаПоказанияПриборовУчета", ТекущиеДанные.IDСтроки, ТекущиеДанные.ИдентификаторСтроки);
	МодифицировалиТЧ.ПоказанияПриборовУчета = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЗИзмерителиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	МодифицировалиТЧ.Измерители = Истина;
	Если НоваяСтрока Тогда
		ТекущиеДанные  						= Элементы.ТЗИзмерители.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиТочкиУчета 	= Элементы.ТочкиУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные.IDСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЗИзмерителиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы.ТЗИзмерители.ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаИзмерители, "ДеревоПоискаИзмерители", ТекущиеДанные, "IDСтрокиТочкиУчета");	
	Иначе
		
		ТекущиеДанные	= Элементы.ТЗИзмерители.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаИзмерители, "ДеревоПоискаИзмерители", ТекущиеДанные.IDСтрокиТочкиУчета, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаИзмерители, "ДеревоПоискаИзмерители", ТекущиеДанные, "IDСтрокиТочкиУчета");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗНомераПломбПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	МодифицировалиТЧ.НомераПломб = Истина;
	Если НоваяСтрока Тогда
		ТекущиеДанные  						= Элементы.ТЗНомераПломб.ТекущиеДанные;
		ТекущиеДанные.IDСтрокиТочкиУчета 	= Элементы.ТочкиУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные.IDСтроки;
		ТекущиеДанные.IDСтрокиИзмерителя 	= Элементы.ТЗИзмерители.ТекущиеДанные.IDСтроки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЗНомераПломбПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		ТекущиеДанные  					= Элементы.ТЗНомераПломб.ТекущиеДанные;
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаНомераПломб, "ДеревоПоискаНомераПломб", ТекущиеДанные, "IDСтрокиИзмерителя");	
	Иначе
		
		ТекущиеДанные	= Элементы.ТЗНомераПломб.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		УдалитьСтрокуВДеревеПоиска(ДеревоПоискаНомераПломб, "ДеревоПоискаНомераПломб", ТекущиеДанные.IDСтрокиИзмерителя, ТекущиеДанные.ИдентификаторСтроки);
		ДобавитьСтрокуВДеревоПоиска(ДеревоПоискаНомераПломб, "ДеревоПоискаНомераПломб", ТекущиеДанные, "IDСтрокиИзмерителя");	
		
	КонецЕсли;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
