#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	Если ЗначениеЗаполнено(Объект.Строение) и Объект.Строение.КонтактнаяИнформация.Количество() > 0 и Объект.КонтактнаяИнформация.Количество() = 0 Тогда		
		НоваяСтрока = Объект.КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект.Строение.КонтактнаяИнформация[0]); 
		НоваяСтрока.Вид = Справочники.ВидыКонтактнойИнформации.АдресПомещения;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "КонтактнаяИнформация");
	КонецЕсли;
	
	РезультатЗапроса = РегистрыСведений.энргТехническаяВозможностьОРП.ПолучитьВозможностьОРП(Объект.Строение, Объект.Ссылка);
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		ТехническаяВозможностьПроведенияОРП = Выборка.ЕстьВозможность;
	Иначе
		ТехническаяВозможностьПроведенияОРП = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);	
		
		Если Не Отказ Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
				Отказ = Истина;	
				Если ЭтаФорма.ПодчиненныеЭлементы.КонтактнаяИнформация.ПодчиненныеЭлементы.Количество() > 0 И 
					ЭтаФорма.ПодчиненныеЭлементы.КонтактнаяИнформация.ПодчиненныеЭлементы[0].ПодчиненныеЭлементы.Количество() > 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер квартиры",,ЭтаФорма.ПодчиненныеЭлементы.КонтактнаяИнформация.ПодчиненныеЭлементы[0].ПодчиненныеЭлементы[0].Имя,,);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер квартиры");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РС = РегистрыСведений.энргТехническаяВозможностьОРП;
	РезультатЗапроса = РС.ПолучитьВозможностьОРП(Объект.Строение, Объект.Ссылка);
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ТекТехническаяВозможностьПроведенияОРП = Выборка.ЕстьВозможность;
	Иначе
		ТекТехническаяВозможностьПроведенияОРП = Ложь;
	КонецЕсли;
	
	Если ТекТехническаяВозможностьПроведенияОРП <> ТехническаяВозможностьПроведенияОРП Тогда
		РС.УстановитьВозможностьОРП(Объект.Строение, Объект.Ссылка, ТехническаяВозможностьПроведенияОРП);
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура СтроениеПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Строение) Тогда
		СтрокиКИ 							= Объект.Строение.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.АдресДома));
		Если СтрокиКИ.количество() > 0 тогда
			ОбъектТек = РеквизитФормыВЗначение("Объект");
			Если ЗначениеЗаполнено(Объект.Строение.УлицаНедобавленнаяВФИАС) Тогда
				СтрокиКИ = Объект.Строение.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.АдресДома));
				Если СтрокиКИ.количество() > 0 тогда
					НовСтр = ОбъектТек.КонтактнаяИнформация.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокиКИ[0]);
					НовСтр.Вид =   Справочники.ВидыКонтактнойИнформации.АдресПомещения;
				КонецЕсли;
			Иначе
				//УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектТек, СтрокиКИ[0].Представление, Справочники.ВидыКонтактнойИнформации.АдресПомещения);
				УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектТек, СтрокиКИ[0].Значение, Справочники.ВидыКонтактнойИнформации.АдресПомещения);
			КонецЕсли;
			УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ОбъектТек);
			ЗначениеВРеквизитФормы(ОбъектТек,"Объект");
			//Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			СтрокаАдреса = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.АдресПомещения));
			Если ЗначениеЗаполнено(СтрокаАдреса) Тогда
				Объект.Наименование = Справочники.энргПомещения.СформироватьНаименование(СтрокаАдреса[0].Значение);
			КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	СтроениеПриИзмененииНаСервере();
	УстановитьВидимостьФиктивногоПомещения();
КонецПроцедуры

&НаСервере
Процедура ИзменитьАдресНаСервере()
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда
		ВидКИ 		= Справочники.ВидыКонтактнойИнформации.АдресПомещения;	
		СтрокиКИ 	= Объект.Родитель.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКИ));
		Если СтрокиКИ.количество() > 0 тогда
			ОбъектТек = РеквизитФормыВЗначение("Объект");
			
			СтрокаJSON = СтрокиКИ[0].Значение;
			Если Объект.ТипПомещения = Перечисления.энргТипыПомещений.Комната Или Объект.ТипПомещения = Перечисления.энргТипыПомещений.КойкоМесто Тогда
				СтруктураJSON 		= УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(СтрокаJSON);
				ДанныеКомнаты 		= ПрочитатьДанныеКомнаты(ВидКИ, СокрЛП(Объект.ТипПомещения), 0); 
				СтруктураJSON.apartments.Добавить(ДанныеКомнаты);
				//Если не СтруктураJSON.Свойство("locality") Тогда
				//	СтруктураJSON.Вставить("locality", "");
				//КонецЕсли; 
				
				НаселенныйПунктДетально = РаботаСАдресамиКлиентСервер.ОписаниеНовойКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес); 
				ЗаполнитьЗначенияСвойств(НаселенныйПунктДетально, СтруктураJSON);
				
				ЗаполнениеПолейАдресаДляРанееВведенныхАдресов(НаселенныйПунктДетально);   											
				СтруктураJSON.value = РаботаСАдресамиКлиентСервер.ПредставлениеАдреса(НаселенныйПунктДетально, ВидКИ.ВключатьСтрануВПредставление);  
				СтрокаJSON 			= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSON);
			КонецЕсли;
		
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектТек, СтрокаJSON, ВидКИ);
			УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ОбъектТек);
			ЗначениеВРеквизитФормы(ОбъектТек,"Объект");
			//Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			СтрокаАдреса = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", ВидКИ));
			Если ЗначениеЗаполнено(СтрокаАдреса) Тогда
				Объект.Наименование = Справочники.энргПомещения.СформироватьНаименование(СтрокаАдреса[0].Значение);
			КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПрочитатьДанныеКомнаты(ВидКИ, ТипПомещения, НомерПоУмолчанию)
	Ответ 			= Новый Структура("type,number", СокрЛП(Объект.ТипПомещения), "0");
	КИСуществует 	= ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "КонтактнаяИнформацияОписаниеДополнительныхРеквизитов");
	Если КИСуществует Тогда
		СтрокиКИ 	= ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Вид", ВидКИ));
		Если СтрокиКИ.Количество() > 0 Тогда
			СтрокаАдреса 	= СтрокиКИ[0];
			СтруктураJSON 	= УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(СтрокаАдреса.Значение);
			Для Каждого ТекСтрокаКИ из СтруктураJSON.apartments Цикл
				Если ТекСтрокаКИ.type = ТипПомещения Тогда
					Ответ.number = ТекСтрокаКИ.number;
				КонецЕсли;			
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	ИзменитьАдресНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипПомещенияПриИзменении(Элемент)
	ИзменитьАдресНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьФиктивногоПомещения()
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ТипСтроения");
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(, Объект.Строение, Соответствие);
	//Если Соответствие["ТипСтроения"] <> ПредопределенноеЗначение("Перечисление.энргТипыСтроений.МКД") Тогда
	//	Элементы.Фиктивное.Видимость = Истина;
	//Иначе
	//	Элементы.Фиктивное.Видимость = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Закрыть(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 УстановитьВидимостьФиктивногоПомещения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
    ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);

	Если ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда
		Объект.Наименование = Справочники.энргПомещения.СформироватьНаименование(ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].Значение);
	КонецЕсли;

КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

&НаСервере
Процедура ЗаполнениеПолейАдресаДляРанееВведенныхАдресов(НаселенныйПунктДетально)
	
	Если ЗначениеЗаполнено(НаселенныйПунктДетально.value) Тогда
		
		Если ПустаяСтрока(НаселенныйПунктДетально.areaValue) Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.АдресныйКлассификатор") Тогда
			
				МодульАдресныйКлассификатор = ОбщегоНазначения.ОбщийМодуль("АдресныйКлассификатор");
			
				Если ПустаяСтрока(НаселенныйПунктДетально.areaCode) Тогда
					НаселенныйПунктДетально.areaCode = МодульАдресныйКлассификатор.КодРегионаПоНаименованию(
						УправлениеКонтактнойИнформациейКлиентСервер.СоединитьНаименованиеИТипАдресногоОбъекта(НаселенныйПунктДетально.area, 
						НаселенныйПунктДетально.areaType, Истина))
				КонецЕсли;
				
				МодульАдресныйКлассификаторСлужебный = ОбщегоНазначения.ОбщийМодуль("АдресныйКлассификаторСлужебный");
				НаселенныйПунктДетально.areaValue = МодульАдресныйКлассификаторСлужебный.ПолноеНаименованиеРегионаПоКоду(НаселенныйПунктДетально.areaCode);
				
			КонецЕсли;
		КонецЕсли;
		
		Если НаселенныйПунктДетально.munLevels.Количество() = 0 Тогда
			УровниАдреса = РаботаСАдресамиКлиентСервер.ИменаУровнейАдреса(РаботаСАдресамиКлиентСервер.МуниципальныйАдрес(), Истина);
			Для Каждого УровеньАдреса Из УровниАдреса Цикл
				Если ЗначениеЗаполнено(НаселенныйПунктДетально[УровеньАдреса]) Тогда
					НаселенныйПунктДетально.munLevels.Добавить(УровеньАдреса);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(НаселенныйПунктДетально.houseNumber) Или НаселенныйПунктДетально.buildings.Количество() > 0 Тогда
				НаселенныйПунктДетально.munLevels.Добавить("house");
			КонецЕсли;
			
		КонецЕсли;
		
		Если НаселенныйПунктДетально.admLevels.Количество() = 0 Тогда
			УровниАдреса = РаботаСАдресамиКлиентСервер.ИменаУровнейАдреса(РаботаСАдресамиКлиентСервер.АдминистративноТерриториальныйАдрес(), Истина);
			Для Каждого УровеньАдреса Из УровниАдреса Цикл
				Если ЗначениеЗаполнено(НаселенныйПунктДетально[УровеньАдреса]) Тогда
					НаселенныйПунктДетально.admLevels.Добавить(УровеньАдреса);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(НаселенныйПунктДетально.houseNumber) Или НаселенныйПунктДетально.buildings.Количество() > 0 Тогда
				НаселенныйПунктДетально.admLevels.Добавить("house");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти