#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПолучениеДанных

Функция РезультатДанныеПомещенияПоКлючу(КлючПомещения) Экспорт
		
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжКлючиПомещенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжКлючиПомещенийМенеджер"].РезультатДанныеПомещенияПоКлючу(КлючПомещения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= РегистрыСведений.энргКлючиПомещений.РезультатДанныеПомещенияПоКлючу(КлючПомещения);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ПараметрыМетода 				= Новый Структура("КлючПомещения",КлючПомещения);
		ИмяМетода 						= "энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу";
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

Функция КлючПомещенияПоСтроениюИПомещению(Строение, Помещение) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжКлючиПомещенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжКлючиПомещенийМенеджер"].КлючПомещенияПоСтроениюИПомещению(Строение, Помещение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= РегистрыСведений.энргКлючиПомещений.КлючПомещенияПоСтроениюИПомещению(Строение, Помещение);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению";
		ПараметрыМетода 			= Новый Структура("Строение, Помещение",Строение, Помещение); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КлючиПомещенийПоРодителюПомещения(Организация, Родитель) Экспорт
	Схема 				= Неопределено;
	ТаблицаИерархии 	= "ИерархияРодителяПомещения";
	ТаблицаКлючей 		= "ДанныеПомещения";	 	
	
	Справочники.энргПомещения.ПомещенияПоРодителю(Схема, ТаблицаИерархии);
	
	ПараметрыСхемы 	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица(ТаблицаИерархии, Новый Структура("Строение, Помещение", "Строение", "Помещение")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	РегистрыСведений.энргКлючиПомещений.ДанныеПомещения(Схема, ПараметрыСхемы, ТаблицаКлючей);
	Пакет 									= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 								= Пакет.Операторы[0];
	Оператор.ВыбираемыеПоля.Добавить("&Организация");
	КолонкаЗапроса  						= Пакет.Колонки[Пакет.Колонки.Количество()-1];
	КолонкаЗапроса.Псевдоним 				= "Организация"; 	
	
	ПараметрыСхемы 	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица(ТаблицаКлючей, Новый Структура("Организация, Район, КлючПомещения", "Организация", "Район", "КлючПомещения")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	РегистрыСведений.энргАбонентыПомещений.ТекущийАбонентВПомещении(Схема, ПараметрыСхемы); 	
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"	, Организация);
	ПараметрыЗапроса.Вставить("Родитель"	, Родитель);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса); 
	
	Возврат РезультатЗапроса;	
КонецФункции

#Область ДанныеОКоличествеЧеловек

Функция КоличествоПроживающихПомещения(Период, Организация, Район, КлючПомещения) Экспорт
	Схема 				= Новый СхемаЗапроса;
	ПараметрыОтбора 	= Новый Структура;
	ПараметрыЗапроса 	= Новый Структура;
	
	ПараметрыВТ 		= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения"	, "КлючПомещения")));
	
	ПараметрыОтбора.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));//Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"Период"));
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	
	РегистрыСведений.энргКоличествоПроживающих.КоличествоПроживающихПомещения(Схема, ПараметрыОтбора);
	
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(Период, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
КонецФункции

Функция КоличествоПрописанныхПомещения(Период, Организация, Район, КлючПомещения) Экспорт
	Схема 				= Новый СхемаЗапроса;
	ПараметрыОтбора 	= Новый Структура;
	ПараметрыЗапроса 	= Новый Структура;
	
	ПараметрыВТ 		= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения"	, "КлючПомещения")));
	
	ПараметрыОтбора.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));//Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"Период"));
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	
	РегистрыСведений.энргКоличествоПрописанных.КоличествоПрописанныхПомещения(Схема, ПараметрыОтбора);
	
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(Период, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
КонецФункции

Функция КоличествоСобственниковПомещения(Период, Организация, Район, КлючПомещения) Экспорт
	Схема 				= Новый СхемаЗапроса;
	ПараметрыОтбора 	= Новый Структура;
	ПараметрыЗапроса 	= Новый Структура;
	
	ПараметрыВТ 		= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения"	, "КлючПомещения")));
	
	ПараметрыОтбора.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	
	РегистрыСведений.энргКоличествоСобственников.КоличествоСобственниковПомещения(Схема, ПараметрыОтбора);
	
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(Период, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
КонецФункции
	
#КонецОбласти

#КонецОбласти

Процедура ЗаполнитьДанныеКлючаПомещения(Форма, Знач ДанныеПомещенияРезультат) Экспорт
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(Форма, ДанныеПомещенияВыборка, "Строение, Помещение, ЧастныйСектор");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Дополнить схему запроса актуальными адресами ключа помещений
//
// Параметры:
//  Схема						 - СхемаЗапроса - Схема запроса
//  ИмяВременнойТаблицыИсточника - Строка - Имя временной таблицы источника запроса с обязательными полями:
//      * КлючПомещения - Справочник.энргКлючиПомещения  - ссылка на объект,
//      * Строение - Справочник.энргСтроения  - ссылка на объект,
//      * Помещение - Справочник.энргПомещения  - ссылка на объект,
//      * ЧастныйСектор - Булево - признак частного сектора.
//
Процедура ДополнитьСхемуЗапросаАктуальнымиАдресамиКлючаПомещений(Схема, ИмяВременнойТаблицыИсточника) Экспорт	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКонтактнаяИнформацияКлючаПомещения(ИмяВременнойТаблицыИсточника));	
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	КонтактнаяИнформацияКлючаПомещения.КлючПомещения КАК КлючПомещения,
	|	КонтактнаяИнформацияКлючаПомещения.АдресОбъектаЛС КАК АдресОбъектаЛС,
	|	КонтактнаяИнформацияКлючаПомещения.ЗначениеПолейКИ КАК ЗначениеПолейКИ
	|ПОМЕСТИТЬ АктуальнаяКонтактнаяИнформацияКлючаПомещения
	|ИЗ
	|	(ВЫБРАТЬ
	|		КонтактнаяИнформацияКлючаПомещения.КлючПомещения КАК КлючПомещения,
	|		МАКСИМУМ(КонтактнаяИнформацияКлючаПомещения.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		КонтактнаяИнформацияКлючаПомещения КАК КонтактнаяИнформацияКлючаПомещения
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КонтактнаяИнформацияКлючаПомещения.КлючПомещения) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтактнаяИнформацияКлючаПомещения КАК КонтактнаяИнформацияКлючаПомещения
	|		ПО ВложенныйЗапрос.КлючПомещения = КонтактнаяИнформацияКлючаПомещения.КлючПомещения
	|			И ВложенныйЗапрос.НомерСтроки = КонтактнаяИнформацияКлючаПомещения.НомерСтроки");	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаКонтактнаяИнформацияКлючаПомещения(ИмяВременнойТаблицыИсточника) 
	Шаблон = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.АдресОбъектаЛС КАК АдресОбъектаЛС,
	|	ВложенныйЗапрос.Значение КАК ЗначениеПолейКИ,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ КонтактнаяИнформацияКлючаПомещения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыборкаКлючейПомещений.КлючПомещения КАК КлючПомещения,
	|		энргСтроенияКонтактнаяИнформация.Представление КАК АдресОбъектаЛС,
	|		энргСтроенияКонтактнаяИнформация.Значение КАК Значение,
	|		энргСтроенияКонтактнаяИнформация.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		%1 КАК ВыборкаКлючейПомещений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|			ПО ВыборкаКлючейПомещений.Строение = энргСтроенияКонтактнаяИнформация.Ссылка
	|				И (энргСтроенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргСтроенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))
	|				И (ВыборкаКлючейПомещений.ЧастныйСектор)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыборкаКлючейПомещений.КлючПомещения,
	|		энргПомещенияКонтактнаяИнформация.Представление,
	|		энргПомещенияКонтактнаяИнформация.Значение,
	|		энргПомещенияКонтактнаяИнформация.НомерСтроки
	|	ИЗ
	|		%1 КАК ВыборкаКлючейПомещений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	|			ПО ВыборкаКлючейПомещений.Помещение = энргПомещенияКонтактнаяИнформация.Ссылка
	|				И (энргПомещенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргПомещенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПомещения))
	|				И (НЕ ВыборкаКлючейПомещений.ЧастныйСектор)) КАК ВложенныйЗапрос";
	
	Результат = СтрШаблон(Шаблон, ИмяВременнойТаблицыИсточника);
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли