#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьКатегорииЗадолженности(МВТ = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНастройкаПериодовЗадолженности.КатегорияЗадолженности КАК КатегорияЗадолженности,
		|	бестНастройкаПериодовЗадолженности.От КАК От,
		|	бестНастройкаПериодовЗадолженности.До КАК До
		|ПОМЕСТИТЬ НастройкиПериодовЗадолженности
		|ИЗ
		|	РегистрСведений.бестНастройкаПериодовЗадолженности КАК бестНастройкаПериодовЗадолженности";
	
	
	Если МВТ <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МВТ;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ НастройкиПериодовЗадолженности", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
