#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ПолучитьДанныеДляПроведения(),		Движения.бестНомерПломбПриборовУчетаНП);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестИзменитьНомерПломбыПрибораУчетаИзмерители.ПриборУчета КАК ПриборУчета,
		|	бестИзменитьНомерПломбыПрибораУчета.Дата КАК Период,
		|	бестИзменитьНомерПломбыПрибораУчета.Организация КАК Организация,
		|	бестИзменитьНомерПломбыПрибораУчета.Район КАК Район,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.МестоУстановки КАК МестоУстановки,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.НомерПломбы КАК НомерПломбы,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.ДатаОперацииСПломбой КАК ДатаОперацииСПломбой,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|	бестИзменитьНомерПломбыПрибораУчета.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_Опломбировка), ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_ЗаменаПломбы)) КАК Состояние,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.ВидПломбы КАК ВидПломбы
		|ИЗ
		|	Документ.бестИзменитьНомерПломбыПрибораУчета.Измерители КАК бестИзменитьНомерПломбыПрибораУчетаИзмерители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьНомерПломбыПрибораУчета.НомераПломб КАК бестИзменитьНомерПломбыПрибораУчетаНомераПломб
		|		ПО бестИзменитьНомерПломбыПрибораУчетаИзмерители.Ссылка = бестИзменитьНомерПломбыПрибораУчетаНомераПломб.Ссылка
		|			И бестИзменитьНомерПломбыПрибораУчетаИзмерители.IDСтроки = бестИзменитьНомерПломбыПрибораУчетаНомераПломб.IDСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьНомерПломбыПрибораУчета КАК бестИзменитьНомерПломбыПрибораУчета
		|		ПО (бестИзменитьНомерПломбыПрибораУчета.Ссылка = &Ссылка)
		|			И бестИзменитьНомерПломбыПрибораУчетаИзмерители.Ссылка = бестИзменитьНомерПломбыПрибораУчета.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестИзменитьНомерПломбыПрибораУчетаИзмерители.ПриборУчета,
		|	бестИзменитьНомерПломбыПрибораУчета.Дата,
		|	бестИзменитьНомерПломбыПрибораУчета.Организация,
		|	бестИзменитьНомерПломбыПрибораУчета.Район,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.МестоУстановки,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.НомерПломбыБыло,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.ДатаОперацииСПломбой,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.ОтветственноеЛицо,
		|	ЛОЖЬ,
		|	бестИзменитьНомерПломбыПрибораУчетаНомераПломб.ВидПломбы
		|ИЗ
		|	Документ.бестИзменитьНомерПломбыПрибораУчета.Измерители КАК бестИзменитьНомерПломбыПрибораУчетаИзмерители
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьНомерПломбыПрибораУчета.НомераПломб КАК бестИзменитьНомерПломбыПрибораУчетаНомераПломб
		|		ПО бестИзменитьНомерПломбыПрибораУчетаИзмерители.Ссылка = бестИзменитьНомерПломбыПрибораУчетаНомераПломб.Ссылка
		|			И бестИзменитьНомерПломбыПрибораУчетаИзмерители.IDСтроки = бестИзменитьНомерПломбыПрибораУчетаНомераПломб.IDСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьНомерПломбыПрибораУчета КАК бестИзменитьНомерПломбыПрибораУчета
		|		ПО (бестИзменитьНомерПломбыПрибораУчета.Ссылка = &Ссылка)
		|			И бестИзменитьНомерПломбыПрибораУчетаИзмерители.Ссылка = бестИзменитьНомерПломбыПрибораУчета.Ссылка
		|ГДЕ
		|	бестИзменитьНомерПломбыПрибораУчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ИзменитьНомерПломбыПрибораУчета_ЗаменаПломбы)
		|	И бестИзменитьНомерПломбыПрибораУчетаНомераПломб.НомерПломбыБыло <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли