#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		//Объект.ДатаФактическогоСобытия = Объект.Дата;
	КонецЕсли;
  
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
	

	
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"СпособРасчетаНорматива","СпособыРасчетаНормативаСоставныхУслуг","ПараметрыСпособовРасчетаНорматива");
	// энргРаботаСоСпособамиРасчетаНорматива }

	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"Договор","ДоговорыСоставныхУслуг","ПараметрыДоговоров");
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		ИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьТекстовыеПоля();
	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорФилиал", "Видимость", Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт());

	бестЛокализацияСервер.ПриСозданииНаСервере_бестОперацияСУслугамиНП(ЭтотОбъект, Объект.Ссылка);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
	
	НезависимыйСбыт = бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаЦеноваяКатегория", "Видимость", Не НезависимыйСбыт);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТочкиУчетаНастройкиТарифа", "Видимость", НезависимыйСбыт);
	
	//Если ЗначениеЗаполнено(Объект.Договор)Тогда
	//	ЗаполнитьНастройкиТарифа(Объект.Договор);
	//КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");

	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");
	
	//энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
	ЗаполнитьТекстовыеПоля();
	
	ИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	ИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	//энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);	
	//
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	
	//	энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);		
	//	
	//	НовыеТочкиУчета						= Новый Массив;
	//	НовыеПриборыУчета 					= Новый Массив;
	//	
	//	Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
	//		Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
	//			СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
	//			НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
	//		КонецЕсли;
	//		
	//		Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
	//			СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
	//			НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
	//		КонецЕсли;			
	//	КонецЦикла;
	//	
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	//КонецЕсли; 
	
	//////////////
	
	//энргРаботаСприборамиУчетаСервер.ЗаписатьПараметрыТочек_Узлов_Приборов(Объект.ТочкиУчета, Объект.ПриборыУзловУчета, ТекущийОбъект);
	//энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

	СоответствиеСтрок 						= Новый Соответствие;	
	ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//энргРаботаСприборамиУчетаСервер.НайтиПриборыУчетаУзловПоПараметрам(ТекущийОбъект,"ПриборыУзловУчета",Отказ);		
		//
		//НовыеТочкиУчета						= Новый Массив;
		//НовыеУзлыУчета 						= Новый Массив;
		//НовыеПриборыУчета 					= Новый Массив;
		//
		//Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
		//	Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
		//		СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;
		//	
		//	//Теперь это для узлов --
		//	Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
		//		СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеУзлыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
		//	КонецЕсли;
		//	//--Теперь это для узлов					
		//	
		//КонецЦикла;
		//
		//Для Каждого СтрокаПриборовУчета Из ТекущийОбъект.ПриборыУзловУчета Цикл
		//	
		//	Если Не ПустаяСтрока(СтрокаПриборовУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаПриборовУчета.ПриборУчета) Тогда
		//		СтрокаПриборовУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
		//		НовыеПриборыУчета.Добавить(СтрокаПриборовУчета.НомерСтроки);
		//	КонецЕсли;			
		//	
		//КонецЦикла;
		// 		
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеУзлыУчета", 	НовыеУзлыУчета);
		//ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
		
		
		
			Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"ТочкиУчета",Отказ);
			Справочники.энргПриборыУчетаАбонента.НайтиПриборыУчетаПоПараметрам(ТекущийОбъект,"Измерители",Отказ);
			
			НовыеТочкиУчета						= Новый Массив;
			НовыеУзлыУчета 						= Новый Массив;
			НовыеПриборыУчета 					= Новый Массив;
			НовыеИзмерители 					= Новый Массив;
			СоответствиеПрибора 				= Новый Соответствие;
			
			Для Каждого СтрокаТочкиУчета Из ТекущийОбъект.ТочкиУчета Цикл
				Если Не ЗначениеЗаполнено(СтрокаТочкиУчета.ТочкаУчета) Тогда
					СтрокаТочкиУчета.ТочкаУчета = Справочники.энргТочкиУчета.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеТочкиУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
				КонецЕсли;
				Если Не ПустаяСтрока(СтрокаТочкиУчета.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаТочкиУчета.ПриборУчета) Тогда
					СтрокаТочкиУчета.ПриборУчета = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НовыеПриборыУчета.Добавить(СтрокаТочкиУчета.НомерСтроки);
					
					ЗаводскойНомерЗначение = СоответствиеСтрок[СтрокаТочкиУчета.IDСтроки];
					СоответствиеПрибора.Вставить(ЗаводскойНомерЗначение, СтрокаТочкиУчета.ПриборУчета);
				КонецЕсли;
					
			КонецЦикла;
						Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
				Если Не ПустаяСтрока(СтрокаИзмерителя.ОписаниеПрибора) И НЕ ЗначениеЗаполнено(СтрокаИзмерителя.ПриборУчета) Тогда
					ПриборУчетаЗначение = СоответствиеПрибора[СтрокаИзмерителя.ЗаводскойНомер];
					СоздаватьНовый 		= ПриборУчетаЗначение = Неопределено ИЛИ СтрокаИзмерителя.ВспомогательноеОборудование;
					
					Если СоздаватьНовый Тогда
						ПриборУчетаЗначение = Справочники.энргПриборыУчетаАбонента.ПолучитьСсылку(Новый УникальныйИдентификатор);
						НовыеИзмерители.Добавить(СтрокаИзмерителя.НомерСтроки);
					КонецЕсли;			
					
					СтрокаИзмерителя.ПриборУчета = ПриборУчетаЗначение;
				КонецЕсли;			
			КонецЦикла;

			
			
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеТочкиУчета", 	НовыеТочкиУчета);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеИзмерители", 	НовыеИзмерители);
			ТекущийОбъект.ДополнительныеСвойства.Вставить("НовыеПриборыУчета", 	НовыеПриборыУчета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		энргРаботаСТочкамиУчетаСервер.СоздатьТочкиУчета(ТекущийОбъект,"ТочкиУчета" ,Отказ);
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ТочкиУчета",Отказ); 		
		//энргРаботаСприборамиУчетаСервер.СоздатьПриборыУчета(ТекущийОбъект,"ПриборыУзловУчета", Отказ);
		//энргРаботаСприборамиУчетаСервер.СоздатьУзлыУчета(ТекущийОбъект,"ТочкиУчета",Отказ);
		НовыеПриборыУчета 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеПриборыУчета") Тогда
			НовыеПриборыУчета 				= ТекущийОбъект.ДополнительныеСвойства.НовыеПриборыУчета;
		КонецЕсли;
		
		НовыеИзмерители 					= Новый Массив;
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеИзмерители") Тогда
			НовыеИзмерители 				= ТекущийОбъект.ДополнительныеСвойства.НовыеИзмерители;
		КонецЕсли;
		
		Для Каждого СтрокаТочки Из ТекущийОбъект.ТочкиУчета Цикл
			Если ЗначениеЗаполнено(СтрокаТочки.ПриборУчета) Тогда
				ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеПриборыУчета, СтрокаТочки.ПриборУчета, СтрокаТочки.ОписаниеПрибора, СтрокаТочки.НомерСтроки);
			КонецЕсли;			
		КонецЦикла;
		
		Для Каждого СтрокаИзмерителя Из ТекущийОбъект.Измерители Цикл
			ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,НовыеИзмерители, СтрокаИзмерителя.ПриборУчета, СтрокаИзмерителя.ОписаниеПрибора, СтрокаИзмерителя.НомерСтроки);						
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.ОбъектРасчета);
	
	энргРаботаСТочкамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ПриборыУзловУчета");

	//энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

	ЗаполнитьСвойстваПриборовУчета(ТекущийОбъект);
	ЗаполнитьСвойстваИзмерителей(ТекущийОбъект);
		
	ЗаполнитьТекстовыеПоля();
	
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестОперацияСУслугамиНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) <> Объект.ДатаФактическогоСобытия Тогда 
			ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПроведения",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения,"Дата документа отличается от фактической даты! Провести документ?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдресОбъекта();
	ЗаполнитьМассивТочекПоставок();
КонецПроцедуры

#Конецобласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();
		ЗаполнитьМассивТочекПоставок();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	бестРаботаСВидамиОперацийКлиент.ПриИзмененииВидаОперации("бестОперацияСУслугамиНП",Объект,Параметры.Ключ);
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

#Конецобласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
 //   ТекущиеДанные			= Элементы["ТочкиУчета"				+ ПрефиксТочекУчета].ТекущиеДанные;
 //   Если ТекущиеДанные = Неопределено Тогда
 //   	Возврат;
 //   КонецЕсли;
 //   ТаблицаФормыШкал		= Элементы["ШкалыПриборовУчета"		+ ПрефиксТочекУчета];
 //   ТаблицаФормыФормул		= Элементы["ФормулыРасчетаУслуг"	+ ПрефиксТочекУчета];
 //   ТаблицаФормыШкалУслуг	= Элементы["ШкалыУслуг"				+ ПрефиксТочекУчета];
 //   
 //   // энргРаботаСВидомКанальности {
 //   энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,		"IDСтрокиТочкиУчета",	ТекущиеДанные.IDСтроки); 
 //   энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыФормул,		"IDСтроки",				ТекущиеДанные.IDСтроки);
 //   энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкалУслуг,	"IDСтроки",				ТекущиеДанные.IDСтроки);
 //   // энргРаботаСВидомКанальности }
 //
 	ТекДанные = Элементы.ТочкиУчета.ТекущиеДанные;
 	Если ТекДанные = Неопределено Тогда
	 	Возврат;
	КонецЕсли;
 
	 энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТарифныеКатегорииУслуги, Неопределено, ТекДанные.IDОбъектаРасчета);
	 энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(Элементы.ТочкиПоставки,"IDСтроки",ТекДанные.IDСтроки);
	 //Элементы.ТарифныеКатегорииУслуги.ОтборСтрок = Новый ФиксированнаяСтруктура("IDСтроки", ТекДанные.IDОбъектаРасчета);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаРасположениеПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидУслугиПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);
	
	ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
	
	// энргРаботаСПоставщиками {
	бестРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСПоставщиками } 
	
	УстановитьУсловноеОФормлениеФормыКлиент("Поставщик","ПараметрыПоставщиков");
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги,"ДоговорыСоставныхУслуг");
	УстановитьУсловноеОФормлениеФормыКлиент("Договор","ПараметрыДоговоров");
	
	Если ИспользоватьШкалыПриборовУчета Тогда
		СоставУслуги = энргРаботаСПоставщикамиСервер.ПолучитьСоставУслугиСоШкалами(ТекущиеДанные.Услуга, ТекущиеДанные.ВидКанальности);
		бестРаботаСТочкамиУчетаНПКлиент.ПриИзмененииВидаКанальности(ЭтаФорма, ТекущиеДанные, СоставУслуги, "ШкалыУслуг");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаГоловнаяПриИзменении(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСТочкамиУчетаКлиент.СозданиеНаименованияТУ(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекСтрока);
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСПоставщиками }
	
	// энргРаботаСоСпособамиРасчетаНорматива {
	бестРаботаСоСпособомРасчетаНормативаКлиент.ПередУдалением(ЭтаФорма,ТекущиеДанные);
	// энргРаботаСоСпособамиРасчетаНорматива }
	
	энргРаботаСПриборамиУчетаКлиент.ВыполнитьОчисткуЗависимыхСтрокПоIDСтроки(ТекущиеДанные.IDСтроки,Объект);
	
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ТочкиПоставки");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы);

	
	//ТаблицыФормы				= Новый Массив;	
	//ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	//ТаблицыФормы.Добавить("ФормулыРасчетаУслуг");
	//ТаблицыФормы.Добавить("ШкалыУслуг");
	//
	//ТаблицыФормыВторогоУровня	= Новый Массив;
	//ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	//энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы,,ТаблицыФормыВторогоУровня);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;
	Если не ТекСтрока.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекСтрока);
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСпособРасчетаНормативаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныНормативаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","СпособРасчетаНорматива"),"СпособыРасчетаНормативаСоставныхУслуг","бестФормаВыбораСпособаРасчетаНорматива","ПараметрыСпособовРасчетаНорматива");

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаСтруктураСетиПриИзменении(Элемент)
	ТекущиеДанные						= Элементы.ТочкиУчета.ТекущиеДанные;
	ТекущиеДанные.ДанныеРасположения 	= ПолучитьСхемуПрисоединения(ТекущиеДанные.СтруктураСети);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные 							= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;		
		ТекущиеДанные.IDСтроки					= Новый УникальныйИдентификатор;
		ТекущиеДанные.СредстваИзмерения 		= "Не заполнены";
		ТекущиеДанные.ТехническиеСвойстваТУ		= "Не заполнены";
		ТекущиеДанные.Договор					= Объект.Договор;
		ТекущиеДанные.НастройкиТарифа		    = "Не заполнены";
		ЗаполнитьРеквизитыПоДоговору(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаПоставкиПриИзменении(Элемент)
	ТекущиеДанные 						= Элементы.ТочкиУчета.ТекущиеДанные;
	ТочкаПоставки 						= ТекущиеДанные.ТочкаПоставки;
	ТекущиеДанные.СтруктураСети 		= ПолучитьСтруктуруСетиТочкиПоставки(ТочкаПоставки);
	ТекущиеДанные.ДанныеРасположения 	= ПолучитьСхемуПрисоединения(ТекущиеДанные.СтруктураСети);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.ЗагрузитьЗначения(ТочкиПоставкиОбъекта.ВыгрузитьЗначения());
КонецПроцедуры

#Конецобласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаПроведения(РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если  РезультатВопроса = КодВозвратаДиалога.Нет тогда
			Отказ = Истина;
		КонецЕсли; 		
	КонецЕсли;	
КонецПроцедуры

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

&НаСервере
Функция ПолучитьСхемуПрисоединения(ТекСтруктураСети)
	Возврат Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ТекСтруктураСети);
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСетиТочкиПоставки(ТекТочка)
	мТочек = Новый Массив;
	мТочек.Добавить(ТекТочка);
	РезультатЗапроса = РегистрыСведений.энргПараметрыТочекПоставки.АктуальныеПараметрыТочкиПоставкиПоСсылке(мТочек);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтруктураСети;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьМассивТочекПоставок()
	ПараметрыЗапроса = Новый Структура("Период, Организация, Район, ОбъектРасчета",Объект.Дата,Объект.Организация,Объект.Район,Объект.ОбъектРасчета);
	
	мТочекПоставок = бестРаботаСТочкамиУчетаНПСервер.ПолучитьМассивТочекПоставки(ПараметрыЗапроса);
	ТочкиПоставкиОбъекта.Очистить();
	ТочкиПоставкиОбъекта.ЗагрузитьЗначения(мТочекПоставок);
	
	МаксимальнаяМощность = ПолучитьМаксимальнуюМощность(Объект.Дата, мТочекПоставок);
	Элементы.ИнформацияОМощности.Заголовок = бестРаботаСТочкамиУчетаНПКлиент.ПолучитьРасшифровкуМощности(МаксимальнаяМощность);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМаксимальнуюМощность(Период, мТочекПоставок)
	  Возврат РегистрыСведений.энргПараметрыТочекПоставки.ПолучитьМаксимальнуюМощность(Период, мТочекПоставок);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДоговору(ТекущиеДанные = Неопределено)
	ДанныеДоговора = ПолучитьДанныеДоговора();
	Если ДанныеДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеДоговора, "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");	
	Иначе
		Для Каждого Строка Из Объект.ТочкиУчета Цикл 
			ЗаполнитьЗначенияСвойств(Строка, ДанныеДоговора, "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеДоговора()
	Если Не ЗначениеЗаполнено(Объект.Договор) Или Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");
КонецФункции

#Конецобласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РАБОТА_С_УЗЛАМИ

#Область ДОБАВЛЕНИЕ_ПУ_К_УЗЛАМ

&НаКлиенте
Процедура ДобавитьПриборыУчета(Команда) 
	
	ТекущиеДанные = Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипУзлаУчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить тип узла учета!");
		Возврат;		
	КонецЕсли;
	
	СтруктураОтвета = энргРаботаСПриборамиУчетаКлиент.ВернутьНачальныеПараметрыПередачиДляУзлов(ЭтаФорма, ТекущиеДанные, Объект);
	ПолучитьДанныеТабЧастей(СтруктураОтвета.ПараметрыПередачи,ТекущиеДанные.IDСтроки,ТекущиеДанные.ТипУзлаУчета,ТекущиеДанные.НачалоДействияКоммерскогоУчета,ТекущиеДанные.КонецДействияКоммерскогоУчета);
	энргРаботаСПриборамиУчетаКлиент.ДобавитьПриборыУчета(СтруктураОтвета);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТабЧастей(ПараметрыПередачи,IDСтроки,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета) 	
	энргРаботаСприборамиУчетаСервер.ПолучитьДанныеТабЧастейУзла(ПараметрыПередачи, IDСтроки, Объект,ТипУзлаУчета,НачалоДействияКоммерскогоУчета,КонецДействияКоммерскогоУчета);
КонецПроцедуры

#КонецОбласти

#Область ПЕРЕОПРЕДЕЛЕННЫЕ_ПРОЦЕДУРЫ

&НаКлиенте
Процедура НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиФормированияАвансовыхСФ(Команда)
	ЗаполнитьНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ТекТЧ	= Объект.НастройкиФормированияАвансовыхСФПоУслугамДоговоровКонтрагентов;
	НовТЗ   = Объект.ТочкиУчета.Выгрузить();
	НовТЗ.Свернуть("Услуга");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(объект.ДатаФактическогоСобытия), объект.ДатаФактическогоСобытия, объект.Дата));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Район",Объект.Район);
	Запрос.УстановитьПараметр("НовТЗ",НовТЗ);
	Запрос.Текст = "ВЫБРАТЬ
	|	НовТЗ.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	&НовТЗ КАК НовТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.Услуга КАК Услуга,
	|	ЕСТЬNULL(бестНастройкиФормированияАвансовыхСФПоУслугамСрезПоследних.Формировать, ЛОЖЬ) КАК Формировать
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНастройкиФормированияАвансовыхСФПоУслугам.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И Район = &Район) КАК бестНастройкиФормированияАвансовыхСФПоУслугамСрезПоследних
	|		ПО ВрТ0.Услуга = бестНастройкиФормированияАвансовыхСФПоУслугамСрезПоследних.Услуга";
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	ТекТЧ.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииСервер();
	ЗаполнитьМассивТочекПоставок();
КонецПроцедуры 

&НаСервере
Процедура РайонПриИзмененииСервер()
	Объект.Организация = Объект.Район.Организация;
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры	

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
	ЗаполнитьМассивТочекПоставок();
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	
	ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.IDОбъектаРасчета = ПолучитьГУИДОбъектаРасчета();
	
	ТочкиУчетаПриИзмененииСервер(ТекущиеДанные.IDОбъектаРасчета);
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТарифныеКатегорииУслуги, Неопределено, ТекущиеДанные.IDОбъектаРасчета);
КонецПроцедуры

&НаСервере
Процедура ТочкиУчетаПриИзмененииСервер(IDСтроки)	
	бестРаботаСТочкамиУчетаНПСервер.ОбновитьГруппыПотребителейУслуги(ЭтотОбъект, IDСтроки,,"IDОбъектаРасчета");	
КонецПроцедуры

&НаСервере
Функция ПолучитьГУИДОбъектаРасчета()
	Возврат Объект.ОбъектРасчета.УникальныйИдентификатор();
КонецФункции

&НаКлиенте
Процедура ТочкиУчетаНачалоДействияКоммерскогоУчетаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.КонецДействияКоммерскогоУчета) И ТекСтрока.КонецДействияКоммерскогоУчета < ТекСтрока.НачалоДействияКоммерскогоУчета  Тогда
		ТекСтрока.НачалоДействияКоммерскогоУчета = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало действия не может быть позже конца действия коммерческого учета."); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаКонецДействияКоммерскогоУчетаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.НачалоДействияКоммерскогоУчета) И ЗначениеЗаполнено(ТекСтрока.КонецДействияКоммерскогоУчета)
			И ТекСтрока.КонецДействияКоммерскогоУчета < ТекСтрока.НачалоДействияКоммерскогоУчета  Тогда
		ТекСтрока.КонецДействияКоммерскогоУчета = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Конец действия не может быть раньше начала действия коммерческого учета."); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","Договор"),"ДоговорыСоставныхУслуг","бестФормаВыбораДоговоров","ПараметрыДоговоров");

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаДоговорАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные,Новый Структура("ИмяСвойстваПоставщик","Договор"),"ДоговорыСоставныхУслуг","бестФормаВыбораДоговоров","ПараметрыДоговоров");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьАдресОбъекта();
	ЗаполнитьМассивТочекПоставок();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиПоставок

&НаКлиенте
Процедура ТочкиПоставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Выберите точку учета");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда		
		ТекущиеДанные 							= Элементы.ТочкиУчета.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Элемент.ТекущиеДанные.IDСтроки			= ТекущиеДанные.IDСтроки;
		энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(Элементы.ТочкиПоставки,"IDСтроки",ТекущиеДанные.IDСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиТочкаПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.ЗагрузитьЗначения(ТочкиПоставкиОбъекта.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура ТочкиПоставкиТочкаПоставкиПриИзменении(Элемент)
	ТекущиеДанные 						= Элементы.ТочкиУчета.ТекущиеДанные;
	СтруктураСети 						= Элементы.ТочкиПоставки.ТекущиеДанные.ТочкаПоставки;
	ТекущиеДанные.СтруктураСети 		= ПолучитьСтруктуруСетиТочкиПоставки(СтруктураСети);
	ТекущиеДанные.ДанныеРасположения 	= ПолучитьСхемуПрисоединения(ТекущиеДанные.СтруктураСети);
КонецПроцедуры


#КонецОбласти

#Область НОВАЯ_РАБОТА_С_УЗЛАМИ

&НаСервере
Процедура ОбновитьДанныеПоУслугамСервер(ПараметрыОбновления) Экспорт 
	энргРаботаСТочкамиУчетаСервер.ЗаполнитьДанныеТаблицРезультатаСредствИзмерений(Объект, ПараметрыОбновления.IDСтроки, ПараметрыОбновления.Результат, ПараметрыОбновления.ДанныеПУ);
	СтруктураДанныеПУ = ПараметрыОбновления.ДанныеПУ;
	СтруктураДанныеПУ.Удалить("НачалоДействияКоммерскогоУчета");
	СтруктураДанныеПУ.Удалить("КонецДействияКоммерскогоУчета");
	ТекСтрока = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("IDСтроки", ПараметрыОбновления.IDСтроки));
	ТекСтрока[0].КоэффициентПУ = ПараметрыОбновления.Результат.КоэффициентПУ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстовыеПоля()	
	Для Каждого ТекСтрока ИЗ Объект.ТочкиУчета Цикл
		ДанныеИзмерителей = Новый Структура("Измерители", Объект.Измерители.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекСтрока.IDСтроки)));
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстСредствИзмерений(ТекСтрока, ДанныеИзмерителей);
		ТекСтрока.ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(ТекСтрока, Объект.Потери,"ЮЛ");
		энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстДанныеРасположения(ТекСтрока);
		ТекСтрока.ДанныеРасположения = Справочники.бестСтруктураСети.ПолучитьСхемуПрисоединения(ТекСтрока.СтруктураСети);
		
		ДанныеТарифа = Новый Структура("ТипТарифа, ТарифнаяСетка, ЦеноваяКатегория, ЗначениеСкидки"); 
		ЗаполнитьЗначенияСвойств(ДанныеТарифа, ТекСтрока);
		ЗаполнитьСтрокуНастройкиТарифа(ДанныеТарифа, ТекСтрока);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПриборовУчета(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.ТочкиУчета.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.ТочкиУчета,СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваИзмерителей(Знач ТекущийОбъект)
	
	Перем мПриборыУчета, ПолучаемыеСвойстваПриборовУчета, СвойстваПриборовУчета;
	       	
	ПолучаемыеСвойстваПриборовУчета = энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();	
	мПриборыУчета 					= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекущийОбъект.Измерители.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	СвойстваПриборовУчета 			= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектов(мПриборыУчета, ПолучаемыеСвойстваПриборовУчета);
	ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Объект.Измерители, СвойстваПриборовУчета);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСвойствамПриборовУчета(Коллекция,СвойстваПриборовУчета) 
	
	СоотвествиеРеквизитовСвойств 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ПриборУчета) Тогда
			СвойстваПрибора 									= СвойстваПриборовУчета[СтрокаКоллекции.ПриборУчета];		
		Иначе
			СвойстваПрибора 									= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(СтрокаКоллекции.ОписаниеПрибора);
		КонецЕсли;
			
		Если СвойстваПрибора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитовСвойств Цикл
			Если СтрокаКоллекции.Свойство(КлючЗначение.Ключ) И СвойстваПрибора.Свойство(КлючЗначение.Значение) Тогда
				СтрокаКоллекции[КлючЗначение.Ключ] 	= СвойстваПрибора[КлючЗначение.Значение];
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТочкиУчетаСредстваИзмерения" Тогда
		СтруктураЗаполнения = энргРаботаСТочкамиУчетаКлиент.ПолучитьВходныеДанныеДляЗаполненияСредствИзмерений(ЭтотОбъект,"ЮЛ");
		энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуЗаполненияСредствИзмерений(СтруктураЗаполнения);
	ИначеЕсли Поле.Имя = "ТочкиУчетаТехническиеСвойстваТУ" Тогда
		ОткрытьФормуТехническихСвойствТУ();	
	ИначеЕсли Поле.Имя = "ТочкиУчетаНастройкиТарифа" Тогда
		ОткрытьФормуНастройкиТарифа();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыТочекИПриборовУчета(ТекущийОбъект, СоответствиеСтрок)
	
	Сч 														= 0;
	Для Каждого СтрокаТочки Из Объект.ТочкиУчета Цикл
		ЗаписываемаяСтрока  								= ТекущийОбъект.ТочкиУчета[Сч];
		
		ДанныеТочкиУчета 									= Новый Структура(бестРаботаСТочкамиУчетаНПСервер.ПолучаемыеСвойстваТочекУчета());
		СоотвествиеРеквизитов 								= бестРаботаСТочкамиУчетаНПСервер.СоотвествиеРеквизитовСвойствамТочкиУчета(); 		
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл			
			ДанныеТочкиУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];			
		КонецЦикла; 		
		ЗаписываемаяСтрока.ОписаниеТочки 					= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета);			
				
		СвойстваПрибора 									= энргРаботаСприборамиУчетаСервер.ПолучаемыеСвойстваПриборовУчета();
		ДанныеПрибораУчета 									= Новый Структура(СвойстваПрибора);
		СоотвествиеРеквизитов 								= энргРаботаСприборамиУчетаСервер.СоотвествиеРеквизитовСвойствамПрибораУчета();
		Для Каждого КлючЗначение Из СоотвествиеРеквизитов Цикл
			Если НЕ СтрокаТочки.Свойство(КлючЗначение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПрибораУчета[КлючЗначение.Значение] 		= СтрокаТочки[КлючЗначение.Ключ];						
		КонецЦикла;
		ЗаписываемаяСтрока.ОписаниеПрибора 					= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеПрибораУчета);
		
		СоответствиеСтрок.Вставить(СтрокаТочки.IDСтроки, СтрокаТочки.ЗаводскойНомер);
		Сч 													= Сч + 1;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрибораУчетаВСтроке(Отказ,Знач НовыеПриборыУчета, Знач ПриборУчета, Знач ОписаниеПрибора, Знач НомерСтроки)
		
	ЭтоНовыйПриборУчета									= НЕ НовыеПриборыУчета.Найти(НомерСтроки) = Неопределено;			
	ОписаниеОбъектаПриборУчета 							= Обработки.энргПриборыУчетаАбонентаМенеджер.ОписаниеОбъекта();
	ЗначенияРеквизитовПриборУчета						= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеПрибора);
	Для Каждого КлючЗначение Из ЗначенияРеквизитовПриборУчета Цикл
		Если ОписаниеОбъектаПриборУчета.Свойство(КлючЗначение.Ключ) Тогда
			ОписаниеОбъектаПриборУчета[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли;				
	КонецЦикла;
	ОписаниеОбъектаПриборУчета.Ссылка 					= ПриборУчета;
	Если Не Обработки.энргПриборыУчетаАбонентаМенеджер.УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъектаПриборУчета,ЭтоНовыйПриборУчета) Тогда
		Отказ											= Истина;
	КонецЕсли;	

КонецПроцедуры

#Область РаботаСТехническимиСвойствамиТУ

&НаКлиенте
Процедура ОткрытьФормуТехническихСвойствТУ()
	ТекущиеДанные		= Элементы.ТочкиУчета.ТекущиеДанные;
	КлючиДанных			= ПолучитьКлючиДанныхТехСвойств();
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ТехническиеСвойстваТУЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные, КлючиДанных", ТекущиеДанные, КлючиДанных));
	ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаТехническиеСвойстваТУ", ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных),,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


/////////////////////////////////////////////
// Получение входных данных

&НаКлиенте
Функция ПолучитьВходныеДанныеТехническихСвойствТУ(ТекущиеДанные, КлючиДанных)
	ТехническиеСвойстваТУ 	= Новый Структура(КлючиДанных.Реквизиты + ", " + КлючиДанных.Таблицы);	
	ЗаполнитьЗначенияСвойств(ТехническиеСвойстваТУ, ТекущиеДанные, КлючиДанных.Реквизиты);
		
	ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, ТекущиеДанные.IDСтроки);
	ТехническиеСвойстваТУ.Вставить("ВызывающаяПодсистема", "ЮЛ");
	ТехническиеСвойстваТУ.Вставить("ИспользоватьТарифныеЗоны", ИспользоватьТарифныеЗоны);
	
	Возврат Новый Структура("ВходныеПараметры", ТехническиеСвойстваТУ);
КонецФункции

&НаСервере
Процедура ДополнитьТаблицыВВходныеДанныеТехСвойств(ТехническиеСвойстваТУ, IDСтроки)
	ИдентификаторФормы 				= ЭтаФорма.УникальныйИдентификатор;
	Если ИспользоватьТарифныеЗоны Тогда
		Потери = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки), "ТарифнаяЗона, ФиксированныйОбъемПотерь, ПроцентПотерь");
		Шкалы = Объект.ШкалыПриборовУчета.Выгрузить(Новый Структура("IDСтрокиТочкиУчета", IDСтроки), "ВидДифференцированности");
		ТаблицаПотерь = Обработки.энргОперацияУзламиУчета.ПолучитьТаблицуПотерь(Шкалы, Потери);
	Иначе
		ТаблицаПотерь = Объект.Потери.Выгрузить(Новый Структура("IDСтроки", IDСтроки));
	КонецЕсли;
	ТехническиеСвойстваТУ.Потери = ПоместитьВоВременноеХранилище(ТаблицаПотерь, ИдентификаторФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючиДанныхТехСвойств()
	Возврат Обработки.энргОперацияУзламиУчета.ПолучитьКлючиЗаполненияТехническихСвойствТУ("ЮЛ");
КонецФункции


/////////////////////////////////////////////
// Обработка возврата результата

&НаКлиенте
Процедура ТехническиеСвойстваТУЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
	КлючиДанных 	= ДополнительныеПараметры.КлючиДанных;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат, КлючиДанных.Реквизиты);
	ТехническиеСвойстваТУ = "";
	ЗаполнитьПотериИзРезультата(ТекущиеДанные.IDСтроки, Результат, ТехническиеСвойстваТУ);
	ТекущиеДанные.ТехническиеСвойстваТУ 		= ТехническиеСвойстваТУ;//энргРаботаСТочкамиУчетаКлиент.ЗаполнитьТекстТехническихСвойств(Результат, Результат.Потери);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПотериИзРезультата(IDСтроки, Результат, ТехническиеСвойстваТУ)
	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Потери, Новый Структура("IDСтроки", IDСтроки));
	
	ПотериРезультат = ПолучитьИзВременногоХранилища(Результат.Потери);
	Для каждого Строка Из ПотериРезультат Цикл
		НоваяСтрока = Объект.Потери.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.IDСтроки = IDСтроки;
	КонецЦикла;	 	
	
	ТехническиеСвойстваТУ = энргРаботаСТочкамиУчетаСервер.ЗаполнитьТекстТехническихСвойств(Результат, ПотериРезультат,"ЮЛ");	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЦеноваяКатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДоступныеЦеновыеКатегории = бестРаботаСТочкамиУчетаНПКлиент.ПолучитьСписокЦК(МаксимальнаяМощность);
	Элемент.СписокВыбора.ЗагрузитьЗначения(ДоступныеЦеновыеКатегории);
КонецПроцедуры


#КонецОбласти

#Область РаботаСНастройкамиТарифа 

&НаКлиенте
Процедура ОткрытьФормуНастройкиТарифа() 
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	ПараметрыДоговор = Новый Структура("ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки");
	ЗаполнитьЗначенияСвойств(ПараметрыДоговор, ТекущиеДанные);

	КлючЗаполнения = "ЦеноваяКатегория, ТарифнаяСетка, ТипТарифа, ЗначениеСкидки";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеНастройкиТарифа", ЭтотОбъект, Новый Структура("ТекущаяСтрока, КлючЗаполнения", Элементы.ТочкиУчета.ТекущаяСтрока, КлючЗаполнения));
	ОткрытьФорму("Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Форма.ФормаНастроекТарифа", ПараметрыДоговор,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеНастройкиТарифа(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;		
	КонецЕсли; 
	Данные = Результат.РезультатДанные; 
	ТекущиеДанные = Объект.ТочкиУчета.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Данные, ДополнительныеПараметры.КлючЗаполнения); 
	ЗаполнитьСтрокуНастройкиТарифа(Данные, ТекущиеДанные);
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСтрокуНастройкиТарифа(Данные, ТекущиеДанные)
	СоответствиеИмени = Новый Соответствие;
	СоответствиеИмени.Вставить("ТипТарифа", "Тип тарифа");
	Если ЗначениеЗаполнено(Данные.ЦеноваяКатегория) Тогда 
		СоответствиеИмени.Вставить("ЦеноваяКатегория", "Ценовая категория");
	ИначеЕсли ЗначениеЗаполнено(Данные.ТарифнаяСетка) Тогда
		СоответствиеИмени.Вставить("ТарифнаяСетка", "Тарифная сетка");	
	КонецЕсли;
	СоответствиеИмени.Вставить("ЗначениеСкидки", "Скидка");
	
	Текст = "";
	Для Каждого ЭлементСтруктуры Из Данные Цикл
		ТекстИмя = СоответствиеИмени.Получить(ЭлементСтруктуры.Ключ);
		Если ТекстИмя = Неопределено Тогда 
			Продолжить;	
		КонецЕсли;
		СтрокаВывод = ?(ЗначениеЗаполнено(ЭлементСтруктуры.Значение), ЭлементСтруктуры.Значение, "Нет");
		Текст = Текст + ТекстИмя + " = " + СтрокаВывод + Символы.ПС;
	КонецЦикла; 
	ТекущиеДанные.НастройкиТарифа = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ЗаполнитьРеквизитыПоДоговору();
КонецПроцедуры

#КонецОбласти

#КонецОбласти