#Область ПрограммныйИнтерфейс

#Область Документы

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестЗаключениеДоговоровСЮридическимиЛицами".
//
// Параметры:
//  Форма-	ФормаКлиентскогоПриложения	-	форма объекта "бестЗаключениеДоговоровСЮридическимиЛицами".
//
Процедура ПриСозданииНаСервере_бестЗаключениеДоговоровСЮридическимиЛицами(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестАктПринятияПрибораУчетаККоммерческомуУчету".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения										-	форма объекта "бестАктПринятияПрибораУчетаККоммерческомуУчету".
//  ИсточникСсылка	-	ДокументСсылка.бестАктПринятияПрибораУчетаККоммерческомуУчету	-	ссылка на документ
//																							"бестАктПринятияПрибораУчетаККоммерческомуУчету".
//
Процедура ПриСозданииНаСервере_бестАктПринятияПрибораУчетаККоммерческомуУчету(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестДополнительныеНачисления".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестДополнительныеНачисления".
//
Процедура ПриСозданииНаСервере_бестДополнительныеНачисления(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьДанныеДляДополнительногоРасчета".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьДанныеДляДополнительногоРасчета".
//
Процедура ПриСозданииНаСервере_бестИзменитьДанныеДляДополнительногоРасчета(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьДоговорПоУслуге".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестИзменитьДоговорПоУслуге".
//  ИсточникСсылка	-	ДокументСсылка.бестИзменитьДоговорПоУслуге	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестИзменитьДоговорПоУслуге(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьФормулуРасчетаСтруктурыСети".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьФормулуРасчетаСтруктурыСети".
//
Процедура ПриСозданииНаСервере_бестИзменитьФормулуРасчетаСтруктурыСети(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестНачислениеНП".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестНачислениеНП".
//
Процедура ПриСозданииНаСервере_бестНачислениеНП(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестНачислениеПоДолевымСхемам".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестНачислениеПоДолевымСхемам".
//
Процедура ПриСозданииНаСервере_бестНачислениеПоДолевымСхемам(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестНачислениеПоСхемамСтруктурыСети".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестНачислениеПоСхемамСтруктурыСети".
//
Процедура ПриСозданииНаСервере_бестНачислениеПоСхемамСтруктурыСети(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестОперацияСПриборомУчетаНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестОперацияСПриборомУчетаНП".
//  ИсточникСсылка	-	ДокументСсылка.бестОперацияСПриборомУчетаНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестОперацияСПриборомУчетаНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестОперацияСУслугамиНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения				-	форма объекта "бестОперацияСУслугамиНП".
//  ИсточникСсылка	-	ДокументСсылка.бестОперацияСУслугамиНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестОперацияСУслугамиНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестПерерасчетНП".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестПерерасчетНП".
//
Процедура ПриСозданииНаСервере_бестПерерасчетНП(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестПочасоваяВедомость".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестПочасоваяВедомость".
//
Процедура ПриСозданииНаСервере_бестПочасоваяВедомость(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестРегистрацияПоказанийНПОбщий".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения						-	форма объекта "бестРегистрацияПоказанийНПОбщий".
//  ИсточникСсылка	-	ДокументСсылка.бестРегистрацияПоказанийНПОбщий	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестРегистрацияПоказанийНПОбщий(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестРегистрацияПоказанийНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестРегистрацияПоказанийНП".
//  ИсточникСсылка	-	ДокументСсылка.бестРегистрацияПоказанийНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестРегистрацияПоказанийНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьСпособНачисленияПоНормативуНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения									-	форма объекта "бестУстановитьСпособНачисленияПоНормативуНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьСпособНачисленияПоНормативуНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьСпособНачисленияПоНормативуНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестСуточнаяВедомость".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения				-	форма объекта "бестСуточнаяВедомость".
//  ИсточникСсылка	-	ДокументСсылка.бестСуточнаяВедомость	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестСуточнаяВедомость(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестСменаПоставщикаНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения				-	форма объекта "бестСменаПоставщикаНП".
//  ИсточникСсылка	-	ДокументСсылка.бестСменаПоставщикаНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестСменаПоставщикаНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьГруппуПотребителейНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения							-	форма объекта "бестУстановитьГруппуПотребителейНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьГруппуПотребителейНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьГруппуПотребителейНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьДатуПоверкиПУ".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестУстановитьДатуПоверкиПУ".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьДатуПоверкиПУ	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьДатуПоверкиПУ(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьЗначениеПлощадиНП".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестУстановитьЗначениеПлощадиНП".
//
Процедура ПриСозданииНаСервере_бестУстановитьЗначениеПлощадиНП(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьПотребителейГВС".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения						-	форма объекта "бестУстановитьПотребителейГВС".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьПотребителейГВС	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьПотребителейГВС(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьТочкиПоставкиНаОбъектРасчета".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестУстановитьТочкиПоставкиНаОбъектРасчета".
//
Процедура ПриСозданииНаСервере_бестУстановитьТочкиПоставкиНаОбъектРасчета(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьФормулуРасчетаТочекУчетаНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения								-	форма объекта "бестУстановитьФормулуРасчетаТочекУчетаНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьФормулуРасчетаТочекУчетаНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьФормулуРасчетаТочекУчетаНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьНомерПломбыПрибораУчета".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения							-	форма объекта "бестИзменитьНомерПломбыПрибораУчета".
//  ИсточникСсылка	-	ДокументСсылка.бестИзменитьНомерПломбыПрибораУчета	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестИзменитьНомерПломбыПрибораУчета(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьГарантированныеОбъемыНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения								-	форма объекта "бестУстановитьГарантированныеОбъемыНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьГарантированныеОбъемыНП	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьГарантированныеОбъемыНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестРегистрацияОбъемовПотребленияПриборовУчета".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения										-	форма объекта "бестРегистрацияОбъемовПотребленияПриборовУчета".
//  ИсточникСсылка	-	ДокументСсылка.бестРегистрацияОбъемовПотребленияПриборовУчета	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестРегистрацияОбъемовПотребленияПриборовУчета(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта
// "бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети".
//
Процедура ПриСозданииНаСервере_бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьТемпературуНаружногоВоздуха(".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестУстановитьТемпературуНаружногоВоздуха".
//
Процедура ПриСозданииНаСервере_бестУстановитьТемпературуНаружногоВоздуха(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьСреднемесячнуюТемпературу".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестУстановитьСреднемесячнуюТемпературу".
//
Процедура ПриСозданииНаСервере_бестУстановитьСреднемесячнуюТемпературу(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьТемпературыИсточника".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестУстановитьТемпературыИсточника".
//
Процедура ПриСозданииНаСервере_бестУстановитьТемпературыИсточника(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьПараметрыТочкиУчета".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьПараметрыТочкиУчета".
//
Процедура ПриСозданииНаСервере_бестИзменитьПараметрыТочкиУчета(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьЗначениеСбытовойНадбавки".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьЗначениеСбытовойНадбавки".
//
Процедура ПриСозданииНаСервере_бестИзменитьЗначениеСбытовойНадбавки(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьТарифНаПередачуЭлектроэнергии".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьТарифНаПередачуЭлектроэнергии".
//
Процедура ПриСозданииНаСервере_бестИзменитьТарифНаПередачуЭлектроэнергии(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта
// "бестРегистрацияБездоговорногоБезучетногоПотребления".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестРегистрацияБездоговорногоБезучетногоПотребления".
//
Процедура ПриСозданииНаСервере_бестРегистрацияБездоговорногоБезучетногоПотребления(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестНачислениеЭлектроэнергии".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестНачислениеЭлектроэнергии".
//
Процедура ПриСозданииНаСервере_бестНачислениеЭлектроэнергии(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестНачислениеПоДолевымСхемамЭлектроэнергии".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестНачислениеПоДолевымСхемамЭлектроэнергии".
//
Процедура ПриСозданииНаСервере_бестНачислениеПоДолевымСхемамЭлектроэнергии(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестАктированиеНедопускаЮЛ".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестАктированиеНедопускаЮЛ".
//
Процедура ПриСозданииНаСервере_бестАктированиеНедопускаЮЛ(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестПлатежныйДокумент".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестПлатежныйДокумент".
//
Процедура ПриСозданииНаСервере_бестПлатежныйДокумент(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестПлатежноеПоручениеВходящееЭЭЮрЛица".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестПлатежноеПоручениеВходящееЭЭЮрЛица".
//
Процедура ПриСозданииНаСервере_бестПлатежноеПоручениеВходящееЭЭЮрЛица(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестСчетФактураНаАванс".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестСчетФактураНаАванс".
//
Процедура ПриСозданииНаСервере_бестСчетФактураНаАванс(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестКорректировкаЗадолженности".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестКорректировкаЗадолженности".
//
Процедура ПриСозданииНаСервере_бестКорректировкаЗадолженности(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестПерерасчетЭЭ".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестПерерасчетЭЭ".
//
Процедура ПриСозданииНаСервере_бестПерерасчетЭЭ(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестЗаписиКнигПродажПокупок".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестЗаписиКнигПродажПокупок".
//
Процедура ПриСозданииНаСервере_бестЗаписиКнигПродажПокупок(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестСписаниеВосстановлениеЗадолженности".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестСписаниеВосстановлениеЗадолженности".
//
Процедура ПриСозданииНаСервере_бестСписаниеВосстановлениеЗадолженности(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестРегистрацияБанкротства".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестРегистрацияБанкротства".
//
Процедура ПриСозданииНаСервере_бестРегистрацияБанкротства(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестРеструктуризацияЗадолженности".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестРеструктуризацияЗадолженности".
//
Процедура ПриСозданииНаСервере_бестРеструктуризацияЗадолженности(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестУстановитьНагрузкуПоУслугам".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения						-	форма объекта "бестУстановитьНагрузкуПоУслугам".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьНагрузкуПоУслугам	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьНагрузкуПоУслугам(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта
// "бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения												-	форма объекта "бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменениеЗависимостиУзловИПриборовУчета".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения									-	форма объекта "бестИзменениеЗависимостиУзловИПриборовУчета".
//  ИсточникСсылка	-	ДокументСсылка.бестИзменениеЗависимостиУзловИПриборовУчета	-	ссылка на документ.
//
Процедура ПриСозданииНаСервере_бестИзменениеЗависимостиУзловИПриборовУчета(Форма, ИсточникСсылка) Экспорт
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестОперацияСПриборомУчетаНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестОперацияСПриборомУчетаНП".
//  ИсточникСсылка	-	ДокументСсылка.бестОперацияСПриборомУчетаНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестОперацияСПриборомУчетаНП(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры 

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестИзменитьРасчетТУПоГрафикуГП".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьРасчетТУПоГрафикуГП".
//
Процедура ПриСозданииНаСервере_бестИзменитьРасчетТУПоГрафикуГП(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта
//	"бестИзменитьПризнакРасчетаТолькоПоПоказаниям".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьПризнакРасчетаТолькоПоПоказаниям".
//
Процедура ПриСозданииНаСервере_бестИзменитьПризнакРасчетаТолькоПоПоказаниям(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестАктПринятияПрибораУчетаККоммерческомуУчету".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения										-	форма объекта "бестАктПринятияПрибораУчетаККоммерческомуУчету".
//  ИсточникСсылка	-	ДокументСсылка.бестАктПринятияПрибораУчетаККоммерческомуУчету	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестАктПринятияПрибораУчетаККоммерческомуУчету(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестИзменитьДоговорПоУслуге".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестИзменитьДоговорПоУслуге".
//  ИсточникСсылка	-	ДокументСсылка.бестИзменитьДоговорПоУслуге	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестИзменитьДоговорПоУслуге(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестОперацияСУслугамиНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения				-	форма объекта "бестОперацияСУслугамиНП".
//  ИсточникСсылка	-	ДокументСсылка.бестОперацияСУслугамиНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестОперацияСУслугамиНП(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестРегистрацияПоказанийНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестРегистрацияПоказанийНП".
//  ИсточникСсылка	-	ДокументСсылка.бестРегистрацияПоказанийНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестРегистрацияПоказанийНП(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестУстановитьСпособНачисленияПоНормативуНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения									-	форма объекта "бестУстановитьСпособНачисленияПоНормативуНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьСпособНачисленияПоНормативуНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьСпособНачисленияПоНормативуНП(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестИзменитьНомерПломбыПрибораУчета".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения							-	форма объекта "бестИзменитьНомерПломбыПрибораУчета".
//  ИсточникСсылка	-	ДокументСсылка.бестИзменитьНомерПломбыПрибораУчета	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестИзменитьНомерПломбыПрибораУчета(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестСменаПоставщикаНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения				-	форма объекта "бестСменаПоставщикаНП".
//  ИсточникСсылка	-	ДокументСсылка.бестСменаПоставщикаНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестСменаПоставщикаНП(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестСуточнаяВедомость".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения				-	форма объекта "бестСуточнаяВедомость".
//  ИсточникСсылка	-	ДокументСсылка.бестСуточнаяВедомость	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестСуточнаяВедомость(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестУстановитьГарантированныеОбъемыНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения								-	форма объекта "бестУстановитьГарантированныеОбъемыНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьГарантированныеОбъемыНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьГарантированныеОбъемыНП(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестУстановитьГруппуПотребителейНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения							-	форма объекта "бестУстановитьГруппуПотребителейНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьГруппуПотребителейНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьГруппуПотребителейНП(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестУстановитьДатуПоверкиПУ".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения					-	форма объекта "бестУстановитьДатуПоверкиПУ".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьДатуПоверкиПУ	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьДатуПоверкиПУ(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестУстановитьНагрузкуПоУслугам".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения						-	форма объекта "бестУстановитьНагрузкуПоУслугам".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьНагрузкуПоУслугам	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьНагрузкуПоУслугам(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестУстановитьПотребителейГВС".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения						-	форма объекта "бестУстановитьПотребителейГВС".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьПотребителейГВС	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьПотребителейГВС(Форма, ИсточникСсылка) Экспорт 
	
КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта
// "бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения												-	форма объекта 
//																									"бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта "бестУстановитьФормулуРасчетаТочекУчетаНП".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения								-	форма объекта "бестУстановитьФормулуРасчетаТочекУчетаНП".
//  ИсточникСсылка	-	ДокументСсылка.бестУстановитьФормулуРасчетаТочекУчетаНП	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестУстановитьФормулуРасчетаТочекУчетаНП(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПослеЗаписиНаСервере" объекта
// "бестИзменитьПризнакРасчетаТолькоПоПоказаниям".
//
// Параметры:
//  Форма			-	ФормаКлиентскогоПриложения									-	форма объекта "бестИзменитьПризнакРасчетаТолькоПоПоказаниям".
//  ИсточникСсылка	-	ДокументСсылка.бестИзменитьПризнакРасчетаТолькоПоПоказаниям	-	ссылка на документ.
//
Процедура ПослеЗаписиНаСервере_бестИзменитьПризнакРасчетаТолькоПоПоказаниям(Форма, ИсточникСсылка) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестРучнаяКорректировкаПениЭЭ".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестРучнаяКорректировкаПениЭЭ".
//
Процедура ПриСозданииНаСервере_бестРучнаяКорректировкаПениЭЭ(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта
// "бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены".
//
Процедура ПриСозданииНаСервере_бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены(Форма) Экспорт

КонецПроцедуры

#КонецОбласти

#Область РегистрыСведений

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестПериодыПриемаПоказаний".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестПериодыПриемаПоказаний".
//
Процедура ПриСозданииНаСервере_бестПериодыПриемаПоказаний(Форма) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Обработки

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестМассовоеИзменениеНагрузок".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестМассовоеИзменениеНагрузок".
//
Процедура ПриСозданииНаСервере_бестМассовоеИзменениеНагрузок(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестФормированиеПлатежныхДокументов".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестФормированиеПлатежныхДокументов".
//
Процедура ПриСозданииНаСервере_бестФормированиеПлатежныхДокументов(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестРаботаСДолжникамиЮЛ".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестРаботаСДолжникамиЮЛ".
//
Процедура ПриСозданииНаСервере_бестРаботаСДолжникамиЮЛ(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестНачислениеПениЭЭ".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестНачислениеПениЭЭ".
//
Процедура ПриСозданииНаСервере_бестНачислениеПениЭЭ(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта
// "бестЗагрузкаСредневзвешеннойНерегулируемойЦеныСАТС".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестЗагрузкаСредневзвешеннойНерегулируемойЦеныСАТС".
//
Процедура ПриСозданииНаСервере_бестЗагрузкаСредневзвешеннойНерегулируемойЦеныСАТС(Форма) Экспорт

КонецПроцедуры

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта
// "бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК".
//
Процедура ПриСозданииНаСервере_бестУстановитьДанныеДляРасчетаНерегулируемойЦеныПервойЦК(Форма) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "бестАктСверки".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "бестАктСверки".
//
Процедура ПриСозданииНаСервере_бестАктСверки(Форма) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Задачи

// Выполняет необходимые действия события "ПриСозданииНаСервере" объекта "энргЗадачаПИД".
//
// Параметры:
//  Форма	-	ФормаКлиентскогоПриложения	-	форма объекта "энргЗадачаПИД".
//
Процедура ПриСозданииНаСервере_энргЗадачаПИД(Форма) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти