#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
		
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
		
	Если ЭтотОбъект.Количество() > 0 Тогда
		ДобавитьОтложенныеДвижения(Регистратор);
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли;
	
	энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДатаРегистратора 				= ДополнительныеСвойства.ДатаРегистратора;
	Иначе
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("Организация") Тогда
		Организация 					= ДополнительныеСвойства.Организация;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Организация") Тогда
		ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
	Иначе
		ДополнительныеСвойства.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("Район") Тогда
		Район 							= ДополнительныеСвойства.Район;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Район") Тогда
		ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
	Иначе
		ДополнительныеСвойства.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("МКД") Тогда
		МКД 						= ДополнительныеСвойства.МКД;
	ИначеЕсли Регистратор.Метаданные().Реквизиты.Найти("МКД") <> Неопределено Тогда                               
		ДополнительныеСвойства.Вставить("МКД", Регистратор.МКД);
	КонецЕсли;


	РазделыЗаписи 						= Новый Массив;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестНачислениеНП") Тогда
		Если Регистратор.ТипНачисления = Перечисления.бестТипыНачисления.Начисление Тогда
			РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.бестРазделыЗаписиНП.СтабильныеПериодыНП, КонецМесяца(ДополнительныеСвойства.ДатаРегистратора)+1));
			РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.бестРазделыЗаписиНП.НачисленияПоДолевымСхемам, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));
		КонецЕсли;
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.бестНачислениеПоСхемамСтруктурыСети") Тогда
		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.бестРазделыЗаписиНП.СтабильныеПериодыНП, КонецМесяца(ДополнительныеСвойства.ДатаРегистратора)+1));
	КонецЕсли;

	ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);

	НаборыЗаписей  						= Новый Структура;
		
	Если РазделыЗаписи.Количество() > 0 Тогда
		НаборОтложенныеДвижения 			= РегистрыСведений.бестОтложенныеДвиженияДокументовНП.СоздатьНаборЗаписей();
		НаборОтложенныеДвижения.Отбор.ДокРегистратор.Установить(Регистратор);		
		НаборыЗаписей.Вставить("бестОтложенныеДвиженияДокументовНП", 		НаборОтложенныеДвижения);
				
		НачисленныйСреднийОбъем 			= РегистрыНакопления.бестНачисленныйСреднийОбъемНП.СоздатьНаборЗаписей();
		НачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		НачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);		
		НаборыЗаписей.Вставить("бестНачисленныйСреднийОбъемНП", 	НачисленныйСреднийОбъем);		
	КонецЕсли;
      		
	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);

КонецПроцедуры

Функция ДанныеВзаиморасчеты(Регистратор)
	
	Регистратор 					= ЭтотОбъект.Отбор.Регистратор.Значение;
	Запрос 							= Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", 	Регистратор);
	Запрос.УстановитьПараметр("Дата", 			ДополнительныеСвойства.ДатаРегистратора);
	Запрос.УстановитьПараметр("Организация", 	ДополнительныеСвойства.Организация);
	Запрос.УстановитьПараметр("Район", 			ДополнительныеСвойства.Район);
	Запрос.Текст 					= 
	"ВЫБРАТЬ
	|	бестОбъемНачисленийНП.СпособНачисления КАК СпособНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление) КАК ВидНачисления,
	|	бестОбъемНачисленийНП.Услуга КАК Услуга,
	|	бестОбъемНачисленийНП.ТочкаУчета КАК ТочкаУчета,
	|	бестОбъемНачисленийНП.ПриборУчета КАК ПриборУчета,
	|	бестОбъемНачисленийНП.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестОбъемНачисленийНП.ОбъемУслуги КАК ОбъемУслуги,
	|	&Организация КАК Организация,
	|	бестОбъемНачисленийНП.Договор КАК Договор,
	|	&Дата КАК Период,
	|	бестОбъемНачисленийНП.ОбъектРасчета.МКД КАК МКД,
	|	&Район КАК Район,
	|	бестОбъемНачисленийНП.НачалоПериода КАК НачалоПериода,
	|	бестОбъемНачисленийНП.КонецПериода КАК КонецПериода,
	|	бестОбъемНачисленийНП.НачальныеПоказания КАК НачальныеПоказания,
	|	бестОбъемНачисленийНП.КонечныеПоказания КАК КонечныеПоказания,
	|	бестОбъемНачисленийНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестОбъемНачисленийНП.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	бестОбъемНачисленийНП.Поставщик КАК Поставщик,
	|	бестОбъемНачисленийНП.Шкала КАК Шкала,
	|	бестОбъемНачисленийНП.Сумма КАК Сумма,
	|	бестОбъемНачисленийНП.ЗначениеТарифа КАК ЗначениеТарифа,
	|	бестОбъемНачисленийНП.НаличиеЗарегистрированногоОбъема КАК НаличиеЗарегистрированногоОбъема
	|ИЗ
	|	РегистрНакопления.бестОбъемНачисленийНП КАК бестОбъемНачисленийНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО бестОбъемНачисленийНП.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО бестОбъемНачисленийНП.Услуга = энргВидыУслуг.Ссылка
	|ГДЕ
	|	бестОбъемНачисленийНП.Регистратор = &Регистратор
	|	И бестОбъемНачисленийНП.ОбъемУслуги <> 0
	|	И (НЕ энргПриборыУчетаАбонента.РегистрируетОбъем
	|			ИЛИ энргВидыУслуг.СпособДосчётаРесурса = ЗНАЧЕНИЕ(Перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка))
	|ИТОГИ
	|	СУММА(ОбъемУслуги),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Договор),
	|	МАКСИМУМ(Период),
	|	МАКСИМУМ(Район),
	|	СУММА(ОбъемУслугиПотребленный)
	|ПО
	|	ОбъектРасчета,
	|	Услуга,
	|	ТочкаУчета"; 	
	Результат 						= Запрос.Выполнить();
	Возврат  Результат;
КонецФункции

Процедура ДобавитьОтложенныеДвижения(Регистратор)
	
	перем НаборОтложенныеДвижения;
	
	НаборыЗаписей 						= ДополнительныеСвойства.НаборыЗаписей;
	
	Если Не НаборыЗаписей.Свойство("бестОтложенныеДвиженияДокументовНП", НаборОтложенныеДвижения) Тогда
		Возврат;
	КонецЕсли;
		
	РазделыЗаписи 						= ДополнительныеСвойства.РазделыЗаписи;
		
	Для Каждого СтрокаРаздела Из РазделыЗаписи Цикл	    
		НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
		НоваяЗапись.Организация		 	= ДополнительныеСвойства.Организация;
		НоваяЗапись.ПериодНачисления 	= СтрокаРаздела.ПериодНачисления;
		НоваяЗапись.Район 				= ДополнительныеСвойства.Район;
		НоваяЗапись.МКД 				= ДополнительныеСвойства.МКД;
		НоваяЗапись.РазделЗаписи 		= СтрокаРаздела.Раздел;
		НоваяЗапись.ДокРегистратор 		= Регистратор;
		НоваяЗапись.ДатаРегистратора 	= ДополнительныеСвойства.ДатаРегистратора;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	
	перем НаборВзаиморасчеты, НачисленныйСредний;
	
	НаборыЗаписей 											= ДополнительныеСвойства.НаборыЗаписей;
		
	Если НЕ НаборыЗаписей.Свойство("бестНачисленныйСреднийОбъемНП", НачисленныйСредний) Тогда
		Возврат;
	КонецЕсли;   	
	
	Результат 												= ДанныеВзаиморасчеты(Регистратор);
	ВыборкаАбонент  										= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВидОперацииПоСреднему  									= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	ВидОперацииПоСреднемуНормативу 							= Перечисления.энргСпособНачислений.СреднееПоНормативу;
	
	Пока ВыборкаАбонент.Следующий() цикл
				
		ВыборкаУслуга  										= ВыборкаАбонент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() цикл
				
			ВыборкаТочкаУчета 								= ВыборкаУслуга.выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаТочкаУчета.следующий() цикл
							
					ДетальнаяВыборка  						= ВыборкаТочкаУчета.Выбрать();
					Пока ДетальнаяВыборка.Следующий() цикл
						// Записываем объем потреления.
						Если НЕ ДетальнаяВыборка.НаличиеЗарегистрированногоОбъема И (ДетальнаяВыборка.СпособНачисления = ВидОперацииПоСреднему или ДетальнаяВыборка.СпособНачисления = ВидОперацииПоСреднемуНормативу) тогда
							Запись  						= НачисленныйСредний.ДобавитьПриход();
							ЗаполнитьЗначенияСвойств(Запись,ДетальнаяВыборка);
							Запись.ПериодНачисления 		= НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора);
						КонецЕсли;	
						
					КонецЦикла;
				//КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

		
КонецПроцедуры

#КонецОбласти