#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления 			= энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);
		КонецЕсли;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.Организация) и Параметры.Свойство("ЗначенияЗаполнения")  Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления 			= энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Параметры.ЗначенияЗаполнения.Организация);
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Для Каждого КлючЗначение Из Параметры.ЗначенияЗаполнения Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, КлючЗначение.Ключ) Тогда
				ЭтоКоллекция 					= ТипЗнч(КлючЗначение.Значение) = Тип("Массив");
				Если ЗначениеЗаполнено(КлючЗначение.Значение) И НЕ Объект[КлючЗначение.Ключ] = КлючЗначение.Значение И Не ЭтоКоллекция Тогда
					Объект[КлючЗначение.Ключ] 	= КлючЗначение.Значение
				КонецЕсли;							
			КонецЕсли;						
		КонецЦикла;		 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			энргРаботаСЛицевымСчетомСервер.ПрочитатьДанныеПомещения(ЭтотОбъект,Объект);
			Если ЧастныйСектор Тогда
				Строение 						= Справочники.энргСтроения.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	ЗаполнитьДокумент  							= Параметры.Свойство("Основание") И ЗначениеЗаполнено(Параметры.Основание);
	
	Если НЕ ЗаполнитьДокумент И Параметры.Свойство("ЗаполнитьДокумент") И Параметры.ЗаполнитьДокумент Тогда
		ЗаполнитьДокумент 						= Истина; 		 		
	КонецЕсли;  	
	
	Если Параметры.Ключ.Пустая() и Параметры.ЗначенияЗаполнения.Свойство("Помещения") тогда
		Помещения 								= Параметры.ЗначенияЗаполнения.Помещения;
		Для Сч = 0 По Помещения.ВГраница() Цикл
			ДанныеПомещения 					= Помещения[Сч];
			СтрокиПомещения						= Объект.Помещения.НайтиСтроки(Новый Структура("КлючПомещения", ДанныеПомещения.КлючПомещения));
			Если СтрокиПомещения.Количество() = 0 Тогда
				СтрокаПомещения  				= Объект.Помещения.Добавить();
				СтрокаПомещения.КлючПомещения  	= ДанныеПомещения.КлючПомещения;
				СтрокаПомещения.Абонент		  	= ДанныеПомещения.Абонент;
				СтрокаПомещения.АбонентПосле	= ДанныеПомещения.АбонентПосле;
				
				КлючПомещений.Добавить(ДанныеПомещения.КлючПомещения);
			Иначе
				СтрокиПомещения[0].АбонентПосле = ДанныеПомещения.Абонент;
			КонецЕсли;
	КонецЦикла;
		
		энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
	ИначеЕсли Параметры.Ключ.Пустая() И Объект.Помещения.Количество() > 0 Тогда
		
		энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
		
	иначеЕсли не Параметры.Ключ.Пустая() Тогда
		
		  УстановитьПредсталениеПериода();
		
	КонецЕсли;
	
	Если ЗаполнитьДокумент тогда 
		Если Параметры.ЗначенияЗаполнения.Свойство("ДокументОснование") Тогда
			ДокументОснование  		= Параметры.ЗначенияЗаполнения.ДокументОснование;
		ИначеЕсли Параметры.Свойство("Основание") Тогда
			ДокументОснование 		= Параметры.Основание;
		КонецЕсли;  		
		Строки  					= Объект.ДокументыОснования.НайтиСтроки(Новый Структура("Документ",ДокументОснование));
		Если Строки.количество()  = 0 тогда
			Строка  				= Объект.ДокументыОснования.Добавить();
			Строка.Документ 		= ДокументОснование;
		КонецЕсли; 
		ПерерасчетСНачалаГода 		= Ложь;
		Если Параметры.ДополнительныеПараметры.Свойство("ПерерасчетСНачалаГода")
			И ЗначениеЗаполнено(Параметры.ДополнительныеПараметры.ПерерасчетСНачалаГода) Тогда
			ПерерасчетСНачалаГода 	= Параметры.ДополнительныеПараметры.ПерерасчетСНачалаГода;
		КонецЕсли;
		
		ЗаполнитьВспомогательныеДанные(ПерерасчетСНачалаГода);
	КонецЕсли;	  
	
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	СписокЭлементов = Новый Структура("РезультатПерерасчета, Расшифровка");
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, СписокЭлементов, Метаданные.Документы.энргПерерасчет);
	// -- Акимов Д.В.	
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
			
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"Помещения");
	
	НаборОбъемНачислений  = РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	НаборОбъемНачислений.Отбор.Регистратор.Установить(ТекущийОбъект.Ссылка);
	НаборОбъемНачислений.Прочитать();
	ЗначениеВРеквизитФормы(НаборОбъемНачислений,"Расшифровка");	
					
	РезультатПерерасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПраваДокументаПерерасчет(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Набор  = ТекущийОбъект.Движения.энргОбъемНачислений;
	Набор.Очистить();
	Набор.Загрузить(Расшифровка.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.Абонент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

 #Область ОбработчикиСобытийЭлементовТаблицыФормыПомещения

&НаКлиенте
Процедура ПомещенияПриИзменении(Элемент)
	
	КлючПомещений.Очистить();
	Для Каждого СтрокаПомещения Из Объект.Помещения Цикл
		КлючПомещений.Добавить(СтрокаПомещения.КлючПомещения);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияСтроениеПриИзменении(Элемент)
	
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Строение) Тогда
		ДанныеСтроения					= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(ТекущиеДанные.Строение,ТекущиеДанные.Помещение);
		ТекущиеДанные.КлючПомещения 	= ДанныеСтроения.КлючПомещения;
	Иначе
		ТекущиеДанные.Помещение			= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ТекущиеДанные.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияАбонентПриИзменении(Элемент)
	ТекСтрока = Элементы.Помещения.ТекущиеДанные;
	
	ПомещенияАбонентПриИзмененииНаСервере(ТекСтрока.Абонент, ТекСтрока.КлючПомещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКорректировкаПоказаний

&НаКлиенте
Процедура КорректировкаПоказанийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоказанийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОснования

&НаКлиенте
Процедура ДокументыОснованияПриИзменении(Элемент)
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Заполните табличную часть ""Документ-основание""",10);
		Возврат;				
	КонецЕсли;
	
	ЗаполнитьДанныеПоОснованиямСервер();
	ЗаполнитьПоказания();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура ВыбратьПериодПерерасчета(Команда)
	Диалог 			= Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период 	= Новый СтандартныйПериод(Объект.НачПериода,Объект.КонПериода);
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьПериодПерерасчетаЗавершение", ЭтаФорма));	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Заполните табличную часть ""Документ-основание""",10);
		Возврат;				
	КонецЕсли; 
	
	ОбновитьРасшифровкуНаСервере();	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьРасшифровку(Команда)
	ОбновитьРасшифровкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуНачислений(Команда)
	
	Если Элементы.Расшифровка.ВыделенныеСтроки.Количество() > 0 Тогда
		мВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.Расшифровка.ВыделенныеСтроки);
		Для Сч  = 0 ПО мВыделенныеСтроки.ВГраница() Цикл
			Расшифровка.Удалить(Расшифровка.НайтиПоИдентификатору(мВыделенныеСтроки[Сч]));			                                                           
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(Элементы.Расшифровка.ТекущаяСтрока) Тогда
		Расшифровка.Удалить(Расшифровка.НайтиПоИдентификатору(Элементы.Расшифровка.ТекущаяСтрока));
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПомещенияАбонентПриИзмененииНаСервере(Абонент, КлючПомещения)
	КлючПомещения = Абонент.КлючПомещения;
КонецПроцедуры

&НаСервере
Процедура ОбновитьРасшифровкуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.НачПериода) ИЛИ НЕ ЗначениеЗаполнено(Объект.КонПериода)
		ИЛИ Объект.НачПериода > Объект.КонПериода Тогда
		Возврат;
	КонецЕсли;
	
	Набор 								= РегистрыНакопления.энргОбъемНачислений.СоздатьНаборЗаписей();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргОбъемНачислений.Период КАК Период,
		|	энргОбъемНачислений.Организация КАК Организация,
		|	энргОбъемНачислений.Район КАК Район,
		|	энргОбъемНачислений.Распределение КАК Распределение,
		|	энргОбъемНачислений.Строение КАК Строение,
		|	энргОбъемНачислений.Помещение КАК Помещение,
		|	энргОбъемНачислений.Услуга КАК Услуга,
		|	энргОбъемНачислений.ТочкаУчета КАК ТочкаУчета,
		|	энргОбъемНачислений.ВидНачисления КАК ВидНачисления,
		|	энргОбъемНачислений.СпособНачисления КАК СпособНачисления,
		|	энргОбъемНачислений.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	энргОбъемНачислений.Измеритель КАК Измеритель,
		|	энргОбъемНачислений.ПриборУчета КАК ПриборУчета,
		|	энргОбъемНачислений.Шкала КАК Шкала,
		|	энргОбъемНачислений.ТарифнаяЗона КАК ТарифнаяЗона,
		|	энргОбъемНачислений.ЗначениеТарифа КАК ЗначениеТарифа,
		|	энргОбъемНачислений.Поставщик КАК Поставщик,
		|	энргОбъемНачислений.ПериодРасчета КАК ПериодРасчета,
		|	энргОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
		|	энргОбъемНачислений.ЧастныйСектор КАК ЧастныйСектор,
		|	энргОбъемНачислений.СверхНорматива КАК СверхНорматива,
		|	энргОбъемНачислений.Сумма КАК Сумма,
		|	энргОбъемНачислений.ОбъемУслуги КАК ОбъемУслуги,
		|	энргОбъемНачислений.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
		|	энргОбъемНачислений.СуммаПоПовышенномуКоэффициенту КАК СуммаПоПовышенномуКоэффициенту,
		|	энргОбъемНачислений.ОбъемУслугиСоцНорма КАК ОбъемУслугиСоцНорма,
		|	энргОбъемНачислений.НачалоПериода КАК НачалоПериода,
		|	энргОбъемНачислений.КонецПериода КАК КонецПериода,
		|	энргОбъемНачислений.НачальныеПоказания КАК НачальныеПоказания,
		|	энргОбъемНачислений.КонечныеПоказания КАК КонечныеПоказания,
		|	энргОбъемНачислений.КоличествоКомнат КАК КоличествоКомнат,
		|	энргОбъемНачислений.КоличествоПрописанных КАК КоличествоПрописанных,
		|	энргОбъемНачислений.ЗначениеПлощади КАК ЗначениеПлощади,
		|	энргОбъемНачислений.НормаПотребления КАК НормаПотребления,
		|	энргОбъемНачислений.КоэффициентПУ КАК КоэффициентПУ,
		|	энргОбъемНачислений.РасчетПоФормуле КАК РасчетПоФормуле,
		|	энргОбъемНачислений.ВидБлагоустройства КАК ВидБлагоустройства,
		|	энргОбъемНачислений.ТарифнаяГруппа КАК ТарифнаяГруппа,
		|	энргОбъемНачислений.ДатаПоверки КАК ДатаПоверки,
		|	энргОбъемНачислений.ОтключатьВНеполивнойСезон КАК ОтключатьВНеполивнойСезон,
		|	энргОбъемНачислений.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
		|	энргОбъемНачислений.КоэффициентФормула КАК КоэффициентФормула,
		|	энргОбъемНачислений.ВидДифференцированности КАК ВидДифференцированности,
		|	энргОбъемНачислений.ОснованиеПерерасчета КАК ОснованиеПерерасчета,
		|	энргОбъемНачислений.ОснованиеПерерасчетаДата КАК ОснованиеПерерасчетаДата,
		|	энргОбъемНачислений.ПриборЗависимой КАК ПриборЗависимой,
		|	энргОбъемНачислений.СписатьИзНормы КАК СписатьИзНормы,
		|	энргОбъемНачислений.ПовыщающийКоэффициент КАК ПовыщающийКоэффициент,
		|	энргОбъемНачислений.КоличествоСобственников КАК КоличествоСобственников,
		|	энргОбъемНачислений.КоличествоПроживающих КАК КоличествоПроживающих,
		|	энргОбъемНачислений.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
		|	энргОбъемНачислений.ПлощадьМОП КАК ПлощадьМОП,
		|	энргОбъемНачислений.ПлощадьАбонентов КАК ПлощадьАбонентов,
		|	энргОбъемНачислений.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
		|	энргОбъемНачислений.КоэффициентРаспределенияОстатка КАК КоэффициентРаспределенияОстатка,
		|	энргОбъемНачислений.ЗначениеСоциальнойНормы КАК ЗначениеСоциальнойНормы,
		|	энргОбъемНачислений.СоставнаяУслуга КАК СоставнаяУслуга,
		|	энргОбъемНачислений.НеПрименятьСезонность КАК НеПрименятьСезонность,
		|	энргОбъемНачислений.ПомещениеРодитель КАК ПомещениеРодитель,
		|	энргОбъемНачислений.ЗначениеРЭК КАК ЗначениеРЭК,
		|	энргОбъемНачислений.ТочкаУчетаРодитель КАК ТочкаУчетаРодитель,
		|	энргОбъемНачислений.ЗначениеТарифаСверхНорматива КАК ЗначениеТарифаСверхНорматива,
		|	энргОбъемНачислений.СниматьНачисленныйСреднийЗависимыхТочек КАК СниматьНачисленныйСреднийЗависимыхТочек,
		|	энргОбъемНачислений.ЕстьСреднийПоВсемТочкамУслуги КАК ЕстьСреднийПоВсемТочкамУслуги,
		|	энргОбъемНачислений.МоментВремени КАК МоментВремени,
		|	энргОбъемНачислений.Абонент КАК Абонент
		|ИЗ
		|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
		|ГДЕ
		|	энргОбъемНачислений.Период МЕЖДУ &НачПериода И &КонПериода
		|	И энргОбъемНачислений.Абонент = &Абонент
		|	И энргОбъемНачислений.Помещение = &Помещение
		|	И энргОбъемНачислений.Строение = &Строение";
	
	Запрос.УстановитьПараметр("Абонент", Объект.Помещения[0].Абонент);
	Запрос.УстановитьПараметр("КонПериода", Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация,Объект.Район, Объект.КонПериода,Ложь).ЗавершениеОП);
	Запрос.УстановитьПараметр("НачПериода", Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация,Объект.Район, Объект.НачПериода,Ложь).НачалоОП);
	Запрос.УстановитьПараметр("Помещение", Объект.Помещения[0].Помещение);
	Запрос.УстановитьПараметр("Строение", Объект.Помещения[0].Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДатаФакта = НачалоДня(Объект.ДокументыОснования[0].Документ.ДатаФактическогоСобытия);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КонецПериода = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КонецПериода), ВыборкаДетальныеЗаписи.КонецПериода, Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация,Объект.Район, ВыборкаДетальныеЗаписи.ПериодНачисления,Ложь).ЗавершениеОП);
		НачалоПериода = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НачалоПериода), ВыборкаДетальныеЗаписи.НачалоПериода, Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Объект.Организация,Объект.Район, ВыборкаДетальныеЗаписи.ПериодНачисления,Ложь).НачалоОП);
		
		Если ДатаФакта > НачалоПериода И ДатаФакта < КонецПериода Тогда
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора,ВыборкаДетальныеЗаписи);
			ЗаписьНабора.ОбъемУслуги = -ВыборкаДетальныеЗаписи.ОбъемУслуги;
			ЗаписьНабора.ОбъемУслугиПотребленный = -ВыборкаДетальныеЗаписи.ОбъемУслугиПотребленный;
			ЗаписьНабора.Сумма = -ВыборкаДетальныеЗаписи.Сумма;
			ЗаписьНабора.СуммаПоПовышенномуКоэффициенту = -ВыборкаДетальныеЗаписи.СуммаПоПовышенномуКоэффициенту;
			ЗаписьНабора.ОбъемУслугиСоцНорма = -ВыборкаДетальныеЗаписи.ОбъемУслугиСоцНорма;
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора,ВыборкаДетальныеЗаписи);
			Коэф = ((ДатаФакта - НачалоПериода)/ 86400)/ ((КонецПериода - НачалоПериода) / 86400);  
			ЗаписьНабора.КонецПериода = ДатаФакта;
			ЗаписьНабора.ОбъемУслуги = ВыборкаДетальныеЗаписи.ОбъемУслуги * Коэф;
			ЗаписьНабора.ОбъемУслугиПотребленный = ВыборкаДетальныеЗаписи.ОбъемУслугиПотребленный * Коэф;
			ЗаписьНабора.Сумма = ВыборкаДетальныеЗаписи.Сумма * Коэф;
			ЗаписьНабора.СуммаПоПовышенномуКоэффициенту = ВыборкаДетальныеЗаписи.СуммаПоПовышенномуКоэффициенту * Коэф;
			ЗаписьНабора.ОбъемУслугиСоцНорма = ВыборкаДетальныеЗаписи.ОбъемУслугиСоцНорма * Коэф;
			
			
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора,ВыборкаДетальныеЗаписи);
			ЗаписьНабора.Абонент = Объект.Помещения[0].АбонентПосле;
			Коэф = ((КонецПериода - ДатаФакта)/ 86400)/ ((КонецПериода - НачалоПериода) / 86400);  
			ЗаписьНабора.НачалоПериода = ДатаФакта;
			ЗаписьНабора.ОбъемУслуги = ВыборкаДетальныеЗаписи.ОбъемУслуги * Коэф;
			ЗаписьНабора.ОбъемУслугиПотребленный = ВыборкаДетальныеЗаписи.ОбъемУслугиПотребленный * Коэф;
			ЗаписьНабора.Сумма = ВыборкаДетальныеЗаписи.Сумма * Коэф;
			ЗаписьНабора.СуммаПоПовышенномуКоэффициенту = ВыборкаДетальныеЗаписи.СуммаПоПовышенномуКоэффициенту * Коэф;
			ЗаписьНабора.ОбъемУслугиСоцНорма = ВыборкаДетальныеЗаписи.ОбъемУслугиСоцНорма * Коэф;
			
			
		Иначе
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора,ВыборкаДетальныеЗаписи);
			ЗаписьНабора.ОбъемУслуги = -ВыборкаДетальныеЗаписи.ОбъемУслуги;
			ЗаписьНабора.ОбъемУслугиПотребленный = -ВыборкаДетальныеЗаписи.ОбъемУслугиПотребленный;
			ЗаписьНабора.Сумма = -ВыборкаДетальныеЗаписи.Сумма;
			ЗаписьНабора.СуммаПоПовышенномуКоэффициенту = -ВыборкаДетальныеЗаписи.СуммаПоПовышенномуКоэффициенту;
			ЗаписьНабора.ОбъемУслугиСоцНорма = -ВыборкаДетальныеЗаписи.ОбъемУслугиСоцНорма;
			
			ЗаписьНабора = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора,ВыборкаДетальныеЗаписи);
			ЗаписьНабора.Абонент = Объект.Помещения[0].АбонентПосле;
		КонецЕсли;
	КонецЦикла;
	
	Расшифровка.Очистить();
	
	Для Каждого СтрокаНабора Из Набор Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ОбъемУслуги) И Не ЗначениеЗаполнено(СтрокаНабора.ОбъемУслугиПотребленный) И Не ЗначениеЗаполнено(СтрокаНабора.Сумма) Тогда
			 Продолжить;
		КонецЕсли;
		
		Если СтрокаНабора.ПериодНачисления = Объект.ПериодНачисления Тогда
			Продолжить;
		КонецЕсли;
				
		ЗаполнитьЗначенияСвойств(Расшифровка.Добавить(), СтрокаНабора);		
	КонецЦикла;
	
	// сворачиваем результат
	РезультатПерерасчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВспомогательныеДанные(ПерерасчетСНачалаГода)
	Если ПерерасчетСНачалаГода Тогда
		Объект.НачПериода 					= НачалоГода(Объект.Дата);
		Объект.КонПериода 					= Объект.ПериодНачисления;
		УстановитьПредсталениеПериода();
	Иначе
		ЗаполнитьДанныеПоОснованиямСервер();
	КонецЕсли;
	ЗаполнитьПоказания();
	ОбновитьРасшифровкуНаСервере();	
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоОснованиямСервер()
		
	ИсключаемыеТипы					 	= Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргВводНачальныхОстатков"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПлатежноеПоручениеВходящие"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргОбходнойЛист"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПриходныйКассовыйОрдер"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПерерасчет"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргПоступлениеОплатыЧерезКонтроллера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.энргРегистрацияПоказанийАбонента"));
		
	Текст  								= "ВЫБРАТЬ Минимум(ВложенныйЗапрос.ДатаФактическогоСобытия) КАК ДатаФакт ИЗ (%%ТекстВложенногоЗапроса%%) КАК ВложенныйЗапрос";
	ТекстПериодНачисления 				= "ВЫБРАТЬ Минимум(ВложенныйЗапрос.ПериодНачисления) КАК ПериодНачисления ИЗ (%%ТекстЗапросаПериодНачисления%%) КАК ВложенныйЗапрос";
	ТекстВложенногоЗапроса 				= "";
	ТекстЗапросаПериодНачисления 		= "";
	Шаблон 								= "ВЫБРАТЬ Док.ДатаФактическогоСобытия ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	ШаблонПериодНачисления				= "ВЫБРАТЬ Док.ПериодНачисления ИЗ Документ.%%ИмяДокумента%% КАК Док ГДЕ Док.ссылка  В (&МассивСсылок)";
	 	
	ВозможныеТипы 						= Метаданные.Документы.энргПерерасчет.ТабличныеЧасти.ДокументыОснования.Реквизиты.Документ.Тип.типы();
	ГлавСчетчик 						= 0; 
	для Каждого Тип из ВозможныеТипы цикл
		Если Не ИсключаемыеТипы.Найти(Тип) = Неопределено ТОгда
			Продолжить;
		КонецЕсли;
		МетадДок 						= Метаданные.НайтиПоТипу(Тип);
		ИмяДок  						= МетадДок.имя;
		Если ГлавСчетчик> 0 тогда	
			ТекстВложенногоЗапроса 		= ТекстВложенногоЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
		КонецЕсли;
		
		ТекстВложенногоЗапроса 			= ТекстВложенногоЗапроса + СтрЗаменить(Шаблон,"%%ИмяДокумента%%",ИмяДок);
		ГлавСчетчик 					= ГлавСчетчик + 1;
	КонецЦикла;
	
	ГлавСчетчик 						= 0;	
	для Каждого Тип из ИсключаемыеТипы цикл
		МетадДок 						= Метаданные.НайтиПоТипу(Тип);
		ИмяДок  						= МетадДок.имя;
		Если ГлавСчетчик> 0 тогда	
			ТекстЗапросаПериодНачисления= ТекстЗапросаПериодНачисления + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
		КонецЕсли;

		ТекстЗапросаПериодНачисления 	= ТекстЗапросаПериодНачисления + СтрЗаменить(ШаблонПериодНачисления,"%%ИмяДокумента%%",ИмяДок);
		ГлавСчетчик 					= ГлавСчетчик + 1;
	КонецЦикла;
	
	Текст 								= СтрЗаменить(Текст,"%%ТекстВложенногоЗапроса%%",ТекстВложенногоЗапроса);
	Запрос 								= Новый Запрос;
	Запрос.Текст 						= Текст;
	Запрос.УстановитьПараметр("МассивСсылок",Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ"));
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	НачПерНачисления 					= Объект.ПериодНачисления;
	Если Выборка.Следующий() Тогда
		Если НЕ Выборка.ДатаФакт = null Тогда
			НачПерНачисления 			= энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Выборка.ДатаФакт,Объект.Организация);
		КонецЕсли;		
	КонецЕсли;
			
	Текст 								= СтрЗаменить(ТекстПериодНачисления,"%%ТекстЗапросаПериодНачисления%%",ТекстЗапросаПериодНачисления);
	Запрос 								= Новый Запрос;
	Запрос.Текст 						= Текст;
	Запрос.УстановитьПараметр("МассивСсылок",Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ"));
	Результат  							= Запрос.Выполнить();
	Выборка  							= Результат.Выбрать();
	НачПерНачисленияПоказания 			= Объект.ПериодНачисления;
	Если Выборка.Следующий() Тогда
		Если НЕ Выборка.ПериодНачисления = null Тогда
			НачПерНачисленияПоказания 	= Выборка.ПериодНачисления;
		КонецЕсли;		
	КонецЕсли;
		
	Объект.НачПериода 					= Мин(НачПерНачисления, НачПерНачисленияПоказания);
	Объект.КонПериода 					= НачалоМесяца(Объект.ПериодНачисления-1);
	УстановитьПредсталениеПериода();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказания() 
	Объект.КорректировкаПоказаний.Очистить();
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("КлючиПомещений", Объект.Помещения.Выгрузить().ВыгрузитьКолонку("КлючПомещения"));
	Запрос.УстановитьПараметр("НачалоПериода", 	Объект.НачПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Объект.КонПериода));
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргПоказанияПриборовУчета.КлючПомещения КАК КлючПомещения,
	|	энргПоказанияПриборовУчета.Период КАК ДатаПоказаний,
	|	энргПоказанияПриборовУчета.Регистратор КАК РегистраторПоказаний,
	|	энргПоказанияПриборовУчета.Разделитель КАК Разделитель,
	|	энргПоказанияПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчетаДо,
	|	энргПоказанияПриборовУчета.ПриборУчета КАК ПриборУчетаПосле,
	|	энргПоказанияПриборовУчета.Шкала КАК ШкалаДо,
	|	энргПоказанияПриборовУчета.Шкала КАК ШкалаПосле,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗонаДо,
	|	энргПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗонаПосле,
	|	энргПоказанияПриборовУчета.Показание КАК ПоказанияДо,
	|	энргПоказанияПриборовУчета.Показание КАК ПоказанияПосле,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказанийДо,
	|	энргПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказанийПосле,
	|	энргПоказанияПриборовУчета.КС КАК КСДо,
	|	энргПоказанияПриборовУчета.КС КАК КСПосле,
	|	энргПоказанияПриборовУчета.Переворот КАК ПереворотДо,
	|	энргПоказанияПриборовУчета.Переворот КАК ПереворотПосле,
	|	энргПоказанияПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчета КАК энргПоказанияПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|		ПО энргПоказанияПриборовУчета.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|ГДЕ
	|	энргПоказанияПриборовУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПоказанияПриборовУчета.Организация = &Организация
	|	И энргПоказанияПриборовУчета.Район = &Район
	|	И энргПоказанияПриборовУчета.КлючПомещения В (&КлючиПомещений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	ПриборУчетаДо,
	|	ДатаПоказаний,
	|	РегистраторПоказаний,
	|	Разделитель";
	
	мДокументыОснования						= Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Документ");
	
	Результат  								= Запрос.Выполнить();
	Выборка  								= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаПоказаний 					= Объект.КорректировкаПоказаний.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, Выборка);
		Если НЕ мДокументыОснования.Найти(Выборка.РегистраторПоказаний) = Неопределено Тогда
			СтрокаПоказаний.ПериодНачисления  = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Выборка.ДатаПоказаний, Объект.Организация); 
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредсталениеПериода()
	ПредставлениеПериодаРасчета = Формат(Объект.НачПериода,"ДФ='ММММ гггг'") + " - " + Формат(Объект.КонПериода,"ДФ='ММММ гггг'");
КонецПроцедуры

&НаСервере
Процедура РезультатПерерасчета()
	
	Запрос 								= Новый Запрос;
	Запрос.УстановитьПараметр("Расшифровка", Расшифровка.Выгрузить());
	Запрос.Текст 						=
	"ВЫБРАТЬ
	|	Расшифровка.ПериодНачисления КАК ПериодНачисления,
	|	Расшифровка.Строение КАК Строение,
	|	Расшифровка.Помещение КАК Помещение,
	|	Расшифровка.Услуга КАК Услуга,
	|	Расшифровка.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА Расшифровка.Было
	|			ТОГДА -Расшифровка.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.Было
	|			ТОГДА Расшифровка.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПосле,
	|	ВЫБОР
	|		КОГДА Расшифровка.Было
	|			ТОГДА -Расшифровка.ОбъемУслуги
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.Было
	|			ТОГДА Расшифровка.ОбъемУслуги
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПосле,
	|	ВЫБОР
	|		КОГДА Расшифровка.Было
	|			ТОГДА -Расшифровка.ОбъемУслугиПотребленный
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.Было
	|			ТОГДА Расшифровка.ОбъемУслугиПотребленный
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйПосле
	|ПОМЕСТИТЬ РезультатПерерасчета
	|ИЗ
	|	&Расшифровка КАК Расшифровка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатПерерасчета.Абонент КАК Абонент,
	|	РезультатПерерасчета.ПериодНачисления КАК ПериодНачисления,
	|	РезультатПерерасчета.Строение КАК Строение,
	|	РезультатПерерасчета.Помещение КАК Помещение,
	|	РезультатПерерасчета.Услуга КАК Услуга,
	|	СУММА(РезультатПерерасчета.СуммаДо) КАК СуммаДо,
	|	СУММА(РезультатПерерасчета.СуммаПосле) КАК СуммаПосле,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиДо) КАК ОбъемУслугиДо,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПосле) КАК ОбъемУслугиПосле,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПотребленныйДо) КАК ОбъемУслугиПотребленныйДо,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПотребленныйПосле) КАК ОбъемУслугиПотребленныйПосле
	|ИЗ
	|	РезультатПерерасчета КАК РезультатПерерасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатПерерасчета.Абонент,
	|	РезультатПерерасчета.ПериодНачисления,
	|	РезультатПерерасчета.Строение,
	|	РезультатПерерасчета.Помещение,
	|	РезультатПерерасчета.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Абонент,
	|	ПериодНачисления,
	|	Строение,
	|	Помещение,
	|	Услуга";
	
	РезультатПерерасчета.Очистить();
	Результат  = Запрос.Выполнить();
	Выборка  = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(РезультатПерерасчета.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура ПроверитьПраваДокументаПерерасчет(Отказ) 
	
	ЕстьПравоЧтение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Чтение"); 
	ЕстьПравоИзменение = Документы.энргПерерасчет.ПроверитьПравоДляДокумента(Объект.ВидОперации, "Изменение");
	Если Не ЕстьПравоИзменение И (Не ЕстьПравоЧтение Или ЕстьПравоЧтение И Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		Отказ = Истина;
		ВызватьИсключение "Нарушение прав доступа";
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр = ЕстьПравоЧтение И Не ЕстьПравоИзменение;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьНаОсновании", "Доступность", Не ЭтотОбъект.ТолькоПросмотр);	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодПерерасчетаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачПериода =  Период.ДатаНачала;
	Объект.КонПериода =  Период.ДатаОкончания; 
	УстановитьПредсталениеПериода();
КонецПроцедуры

#КонецОбласти