
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаФакта = ТекущаяДатаСеанса();
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Район", Район);
	Параметры.Свойство("Договор", Договор);
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Контрагент");
	бестЛокализацияСервер.ПриСозданииНаСервере_бестФормированиеПлатежныхДокументов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПД(Команда)
	СформироватьПДНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСФНаАванс(Команда)
	СформироватьСФНаАвансНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьПДНаСервере() 
	Если ТипЗадолженности = Перечисления.бестВидыРасчета.Пеня Тогда
		ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДатаФакта, Организация, Район);
		
		Структура = бестНачисленияНП.НачислитьПенюЭЭ(Организация, ПериодНачисления, Район, Договор);
	Иначе
		Структура = Обработки.бестФормированиеПлатежныхДокументов.СоздатьПД(Новый Структура("Организация, Район, Контрагент, Договор, ДатаФакта, ТипЗадолженности", Организация, Район, Контрагент, Договор, ДатаФакта, ТипЗадолженности));
	КонецЕсли;
	мПД = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, "СозданныеДокументы", Новый Массив);
	КоличествоНеПроведенныхПД = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, "КоличествоНеПроведенныхПД", 0);
	КоличествоПроведенныхПД = мПД.Количество();
	КоличествоСформированныхПД = КоличествоПроведенныхПД + КоличествоНепроведенныхПД;
	ШаблонСформированныеПД = НСтр("ru = 'Количество сформированных ПД - %1'");
	ШаблонПроведенныеПД = НСтр("ru = 'Количество проведенных ПД - %1'");
	ШаблонНеПроведенныеПД = НСтр("ru = 'Количество не проведенных ПД - %1'");
	СообщениеСформированныеПД = СтрШаблон(ШаблонСформированныеПД, КоличествоСформированныхПД);
	СообщениеПроведенныеПД = СтрШаблон(ШаблонПроведенныеПД, КоличествоПроведенныхПД);
	СообщениеНеПроведенныеПД = СтрШаблон(ШаблонНеПроведенныеПД, КоличествоНепроведенныхПД);
	ОбщегоНазначения.СообщитьПользователю(СообщениеСформированныеПД); 
	ОбщегоНазначения.СообщитьПользователю(СообщениеПроведенныеПД);
	ОбщегоНазначения.СообщитьПользователю(СообщениеНеПроведенныеПД);
	СозданныеДокументы.Очистить();
	СозданныеДокументы.ЗагрузитьЗначения(мПД);
КонецПроцедуры

&НаСервере
Процедура СформироватьСФНаАвансНаСервере()
	мСФ = Обработки.бестФормированиеПлатежныхДокументов.СоздатьСФНаАванс(Новый Структура("Организация,Район,Контрагент,Договор,ДатаФакта",Организация,Район,Контрагент,Договор,ДатаФакта));
	СозданныеСФНаАванс.Очистить();
	СозданныеСФНаАванс.ЗагрузитьЗначения(мСФ);
КонецПроцедуры

#КонецОбласти
