#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс 

Функция АктуальныеДолжники(Абонент, Дата) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапросаДолжники());
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Период", Дата);
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ТекстЗапросаДолжники() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	энргСобственникиИДолжники.Абонент КАК Абонент,
	|	энргСобственникиИДолжники.Должник КАК Должник,
	|	энргСобственникиИДолжники.Период КАК Период,
	|	энргСобственникиИДолжники.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ Должники
	|ИЗ
	|	РегистрСведений.энргСобственникиИДолжники КАК энргСобственникиИДолжники
	|ГДЕ
	|	энргСобственникиИДолжники.Период <= &Период
	|	И энргСобственникиИДолжники.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Должники.Абонент КАК Абонент,
	|	Должники.Должник КАК Должник,
	|	МАКСИМУМ(Должники.Регистратор) КАК Регистратор,
	|	Должники.Период КАК Период
	|ПОМЕСТИТЬ МаксРегистратор
	|ИЗ
	|	Должники КАК Должники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Должники.Абонент КАК Абонент,
	|			МАКСИМУМ(Должники.Период) КАК Период
	|		ИЗ
	|			Должники КАК Должники
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Должники.Абонент) КАК МаксПериод
	|		ПО Должники.Абонент = МаксПериод.Абонент
	|			И Должники.Период = МаксПериод.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Должники.Абонент,
	|	Должники.Должник,
	|	Должники.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Должники.Абонент КАК Абонент,
	|	Должники.Должник КАК Должник
	|ИЗ
	|	Должники КАК Должники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксРегистратор КАК МаксРегистратор
	|		ПО Должники.Абонент = МаксРегистратор.Абонент
	|			И Должники.Должник = МаксРегистратор.Должник
	|			И Должники.Период = МаксРегистратор.Период
	|			И Должники.Регистратор = МаксРегистратор.Регистратор
	|ГДЕ
	|	Должники.Должник <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли