#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НачПериода) ИЛИ ЗначениеЗаполнено(Объект.КонПериода) Тогда
		УстановитьПредсталениеПериода();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
			
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДокументыОснованияПриИзменении(Элемент)
	ЗаполнитьПоказания();
КонецПроцедуры

#Область КомандыФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодПерерасчет(Команда)
	Диалог 			= Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период 	= Новый СтандартныйПериод(Объект.НачПериода,Объект.КонПериода);
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьПериодПерерасчетаЗавершение", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодПерерасчетаЗавершение(Период, ДополнительныеПараметры) Экспорт 
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачПериода =  Период.ДатаНачала;
	Объект.КонПериода =  Период.ДатаОкончания; 
	УстановитьПредсталениеПериода();
КонецПроцедуры


#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПредсталениеПериода()
	ПредставлениеПериодаРасчета = Формат(Объект.НачПериода,"ДФ='ММММ гггг'") + " - " + Формат(Объект.КонПериода,"ДФ='ММММ гггг'");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	
	Набор 								= РегистрыНакопления.энргОбъемНачисленийМКД.СоздатьНаборЗаписей();
	
	энргНачисления.ДанныеПерерасчетаМКД(Объект.Организация,Объект.Район,Объект.МКД,Объект.НачПериода,Объект.КонПериода,Набор,Объект.КорректировкаПоказаний);
	
	Расшифровка.Очистить();
	
	Для Каждого СтрокаНабора Из Набор Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ОбъемУслуги) И Не ЗначениеЗаполнено(СтрокаНабора.ОбъемУслугиПотребленный) Тогда
			 Продолжить;
		КонецЕсли;
		
		Если СтрокаНабора.ПериодНачисления = Объект.ПериодНачисления Тогда
			Продолжить;
		КонецЕсли;
				
		ЗаполнитьЗначенияСвойств(Расшифровка.Добавить(), СтрокаНабора);		
	КонецЦикла;
		
	// читаем данные которые были начислены до перерасчета
	РезультатДанныеНачислений 			= ДанныеНачисленийЗаПериод();
	Выборка  							= РезультатДанныеНачислений.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Расшифровка.Добавить(), Выборка);
	КонецЦикла;	
	
	// сворачиваем результат
	РезультатПерерасчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказания() 
	Объект.КорректировкаПоказаний.Очистить();
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("МКД", 			Объект.МКД);
	Запрос.УстановитьПараметр("НачалоПериода", 	Объект.НачПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Объект.КонПериода));
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргПоказанияПриборовУчетаМКД.Период КАК ДатаПоказаний,
	|	энргПоказанияПриборовУчетаМКД.Регистратор КАК РегистраторПоказаний,
	|	энргПоказанияПриборовУчетаМКД.Разделитель КАК Разделитель,
	|	энргПоказанияПриборовУчетаМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргПоказанияПриборовУчетаМКД.ПриборУчета КАК ПриборУчетаДо,
	|	энргПоказанияПриборовУчетаМКД.ПриборУчета КАК ПриборУчетаПосле,
	|	энргПоказанияПриборовУчетаМКД.Шкала КАК ШкалаДо,
	|	энргПоказанияПриборовУчетаМКД.Шкала КАК ШкалаПосле,
	|	энргПоказанияПриборовУчетаМКД.ТарифнаяЗона КАК ТарифнаяЗонаДо,
	|	энргПоказанияПриборовУчетаМКД.ТарифнаяЗона КАК ТарифнаяЗонаПосле,
	|	энргПоказанияПриборовУчетаМКД.Показание КАК ПоказанияДо,
	|	энргПоказанияПриборовУчетаМКД.Показание КАК ПоказанияПосле,
	|	энргПоказанияПриборовУчетаМКД.СостояниеПоказаний КАК СостояниеПоказанийДо,
	|	энргПоказанияПриборовУчетаМКД.СостояниеПоказаний КАК СостояниеПоказанийПосле,
	|	энргПоказанияПриборовУчетаМКД.КС КАК КСДо,
	|	энргПоказанияПриборовУчетаМКД.КС КАК КСПосле,
	|	энргПоказанияПриборовУчетаМКД.Переворот КАК ПереворотДо,
	|	энргПоказанияПриборовУчетаМКД.Переворот КАК ПереворотПосле,
	|	энргПоказанияПриборовУчетаМКД.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РегистрСведений.энргПоказанияПриборовУчетаМКД КАК энргПоказанияПриборовУчетаМКД
	|ГДЕ
	|	энргПоказанияПриборовУчетаМКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргПоказанияПриборовУчетаМКД.Организация = &Организация
	|	И энргПоказанияПриборовУчетаМКД.Район = &Район
	|	И энргПоказанияПриборовУчетаМКД.МКД =&МКД
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	ПриборУчетаДо,
	|	ДатаПоказаний,
	|	РегистраторПоказаний,
	|	Разделитель";
	
	Результат  			= Запрос.Выполнить();
	Выборка  			= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.КорректировкаПоказаний.Добавить(), Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура РезультатПерерасчета()
	
	Запрос 								= Новый Запрос;
	Запрос.УстановитьПараметр("Расшифровка", Расшифровка.Выгрузить());
	Запрос.Текст 						=
	"ВЫБРАТЬ
	|	Расшифровка.ПериодНачисления КАК ПериодНачисления,
	|	Расшифровка.МКД КАК МКД,
	|	Расшифровка.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА Расшифровка.Было
	|			ТОГДА -Расшифровка.ОбъемУслуги
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.Было
	|			ТОГДА Расшифровка.ОбъемУслуги
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПосле,
	|	ВЫБОР
	|		КОГДА Расшифровка.Было
	|			ТОГДА -Расшифровка.ОбъемУслугиПотребленный
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйДо,
	|	ВЫБОР
	|		КОГДА НЕ Расшифровка.Было
	|			ТОГДА Расшифровка.ОбъемУслугиПотребленный
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемУслугиПотребленныйПосле
	|ПОМЕСТИТЬ РезультатПерерасчета
	|ИЗ
	|	&Расшифровка КАК Расшифровка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатПерерасчета.ПериодНачисления КАК ПериодНачисления,
	|	РезультатПерерасчета.МКД КАК МКД,
	|	РезультатПерерасчета.Услуга КАК Услуга,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиДо) КАК ОбъемУслугиДо,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПосле) КАК ОбъемУслугиПосле,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПотребленныйДо) КАК ОбъемУслугиПотребленныйДо,
	|	СУММА(РезультатПерерасчета.ОбъемУслугиПотребленныйПосле) КАК ОбъемУслугиПотребленныйПосле
	|ИЗ
	|	РезультатПерерасчета КАК РезультатПерерасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатПерерасчета.ПериодНачисления,
	|	РезультатПерерасчета.МКД,
	|	РезультатПерерасчета.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления,
	|	МКД,
	|	Услуга";
	
	РезультатПерерасчета.Очистить();
	Результат  = Запрос.Выполнить();
	Выборка  = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(РезультатПерерасчета.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДанныеНачисленийЗаПериод()
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	Запрос.УстановитьПараметр("МКД", 			Объект.МКД);
	Запрос.УстановитьПараметр("НачалоПериода", 	Объект.НачПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	?(НачалоМесяца(Объект.КонПериода) = Объект.ПериодНачисления,НачалоМесяца(Объект.КонПериода)-1,КонецМесяца(Объект.КонПериода)));

	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргОбъемНачисленийМКД.Период КАК Период,
	|	энргОбъемНачисленийМКД.Регистратор КАК Регистратор,
	|	энргОбъемНачисленийМКД.НомерСтроки КАК НомерСтроки,
	|	энргОбъемНачисленийМКД.Активность КАК Активность,
	|	энргОбъемНачисленийМКД.Организация КАК Организация,
	|	энргОбъемНачисленийМКД.Район КАК Район,
	|	энргОбъемНачисленийМКД.МКД КАК МКД,
	|	энргОбъемНачисленийМКД.Услуга КАК Услуга,
	|	энргОбъемНачисленийМКД.ТочкаУчета КАК ТочкаУчета,
	|	энргОбъемНачисленийМКД.ВидНачисления КАК ВидНачисления,
	|	энргОбъемНачисленийМКД.СпособНачисления КАК СпособНачисления,
	|	энргОбъемНачисленийМКД.ПриборУчета КАК ПриборУчета,
	|	энргОбъемНачисленийМКД.Шкала КАК Шкала,
	|	энргОбъемНачисленийМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргОбъемНачисленийМКД.Поставщик КАК Поставщик,
	|	энргОбъемНачисленийМКД.ПериодРасчета КАК ПериодРасчета,
	|	энргОбъемНачисленийМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргОбъемНачисленийМКД.ОбъемУслуги КАК ОбъемУслуги,
	|	энргОбъемНачисленийМКД.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	энргОбъемНачисленийМКД.ОбъемУслугиНорматив КАК ОбъемУслугиНорматив,
	|	энргОбъемНачисленийМКД.НачалоПериода КАК НачалоПериода,
	|	энргОбъемНачисленийМКД.КонецПериода КАК КонецПериода,
	|	энргОбъемНачисленийМКД.НачальныеПоказания КАК НачальныеПоказания,
	|	энргОбъемНачисленийМКД.КонечныеПоказания КАК КонечныеПоказания,
	|	энргОбъемНачисленийМКД.ЗначениеПлощади КАК ЗначениеПлощади,
	|	энргОбъемНачисленийМКД.ВидБлагоустройства КАК ВидБлагоустройства,
	|	энргОбъемНачисленийМКД.Бойлер КАК Бойлер,
	|	энргОбъемНачисленийМКД.НормаПотребления КАК НормаПотребления,
	|	энргОбъемНачисленийМКД.ПривязанаКШкале КАК ПривязанаКШкале,
	|	энргОбъемНачисленийМКД.СниматьНачисленныйСредний КАК СниматьНачисленныйСредний,
	|	энргОбъемНачисленийМКД.ПлощадьМОП КАК ПлощадьМОП,
	|	энргОбъемНачисленийМКД.ПлощадьАбонентов КАК ПлощадьАбонентов,
	|	энргОбъемНачисленийМКД.ПлощадьСобственнаяПоставка КАК ПлощадьСобственнаяПоставка,
	|	энргОбъемНачисленийМКД.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргОбъемНачисленийМКД.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргОбъемНачисленийМКД.Договор КАК Договор,
	|	ИСТИНА КАК Было
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийМКД КАК энргОбъемНачисленийМКД
	|ГДЕ
	|	энргОбъемНачисленийМКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргОбъемНачисленийМКД.Организация = &Организация
	|	И энргОбъемНачисленийМКД.Район = &Район
	|	И энргОбъемНачисленийМКД.МКД = &МКД
	|	И (энргОбъемНачисленийМКД.ОбъемУслуги <> 0
	|			ИЛИ энргОбъемНачисленийМКД.ОбъемУслугиПотребленный <> 0)
	|	И энргОбъемНачисленийМКД.ПериодНачисления МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Возврат Запрос.Выполнить();	
	
КонецФункции


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти