#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Элементы.Список.ТекущаяСтрока = Неопределено тогда		
		РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, Неопределено);
		РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Район"		, Неопределено);
		РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Неопределено);
		
		РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, Неопределено);
		РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Район"			, Неопределено);
		РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Неопределено);
		
		ДокументыМКД.Параметры.УстановитьЗначениеПараметра("МКД"			, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли; 
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Абоненты,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлощадиМКД,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СостояниеМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(УслугиМКД,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПриборыМКД,			"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПоказанияПУМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НежилыеПомещенияМКД,"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СостояниеПУТУМКД,	"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Помещения,			"Строение",	Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НачисленияМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКД,		"МКД",		Элементы.Список.ТекущаяСтрока);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКД,		"ОбъемУслугиПотребленный", 0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКДОстаток,		"МКД",		Элементы.Список.ТекущаяСтрока);
	
	ЗначенияРеквизитов = новый Соответствие;
	ЗначенияРеквизитов.Вставить("Организация","");
	ЗначенияРеквизитов.Вставить("Район",""); 
	ЗначенияРеквизитов.Вставить("ТипСтроения",""); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(, Элементы.Список.ТекущаяСтрока, ЗначенияРеквизитов);
	
	ОтрицательныйОбъемРаспределенияМКДОстаток.Параметры.УстановитьЗначениеПараметра("ТекДата"			, ТекущаяДата());

	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, ЗначенияРеквизитов.Получить("Организация"));
	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Район"			, ЗначенияРеквизитов.Получить("Район"));
	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Элементы.Список.ТекущаяСтрока);
	
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, ЗначенияРеквизитов.Получить("Организация"));
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Район"			, ЗначенияРеквизитов.Получить("Район"));
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, Элементы.Список.ТекущаяСтрока);
	
	ДокументыМКД.Параметры.УстановитьЗначениеПараметра("МКД"			, Элементы.Список.ТекущаяСтрока);
	
	УстановитьВидимостьВкладкаНачисления(ЗначенияРеквизитов.Получить("ТипСтроения"));
	
КонецПроцедуры 

#КонецОбласти

#Область СобытияТаблицыФормыПомещения

&НаКлиенте
Процедура ПомещенияПриАктивизацииСтроки(Элемент)
	
	 ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	 Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	 КонецЕсли;
	 
	 УстановитьДоступностьКомандТаблицыФормыПомещения(ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПомещенияПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Строки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаСписка Из Строки Цикл
		Прервать;					
	КонецЦикла;
	ЕстьСвойствоПлощадь = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаСписка.Значение.Данные, "Площадь");
	Если НЕ ЕстьСвойствоПлощадь Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Район", Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности"));
	ТаблицаДанных.Колонки.Добавить("КлючПомещения", Новый ОписаниеТипов("СправочникСсылка.энргКлючиПомещений"));
	
	ПоляЗаполнения = "Организация,Район,КлючПомещения";
	Для каждого СтрокаСписка Из Строки Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Ключ = СтрокаСписка.Ключ;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСписка.Значение.Данные);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДанных.Ключ КАК Ключ,
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.Район КАК Район,
		|	ТаблицаДанных.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ СтрокиПоиска
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияПлощадейСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргЗначенияПлощадейСрезПоследних.Площадь КАК Площадь
		|ПОМЕСТИТЬ АктуальныеЗначенияПлощадей
		|ИЗ
		|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
		|			,
		|			(Организация, Район, КлючПомещения) В
		|					(ВЫБРАТЬ
		|						СтрокиПоиска.Организация КАК Организация,
		|						СтрокиПоиска.Район КАК Район,
		|						СтрокиПоиска.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						СтрокиПоиска КАК СтрокиПоиска)
		|				И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)) КАК энргЗначенияПлощадейСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиПоиска.Ключ КАК Ключ,
		|	АктуальныеЗначенияПлощадей.Площадь КАК Площадь
		|ИЗ
		|	СтрокиПоиска КАК СтрокиПоиска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктуальныеЗначенияПлощадей КАК АктуальныеЗначенияПлощадей
		|		ПО СтрокиПоиска.КлючПомещения = АктуальныеЗначенияПлощадей.КлючПомещения";
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	ПоляЗаполнения = "Площадь";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 	
	Пока Выборка.Следующий() Цикл
		
		Для каждого СтрокаСписка Из Строки Цикл
			Если НЕ Выборка.Ключ = СтрокаСписка.Ключ Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаСписка.Значение.Данные, Выборка, ПоляЗаполнения);					
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СоздатьПомещение(Команда)
	ТекущиеДанные  = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Строение", ТекущиеДанные.Ссылка));
	ОткрытьФорму("Справочник.энргПомещения.ФормаОбъекта", ПараметрыФормы);	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияСЛицевымСчетомОткрытьФорму(Команда)
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("КлючПомещения", ТекущиеДанные.КлючПомещения));
	ОткрытьФорму("Документ.энргОперацияСЛицевымСчетом.Форма.ФормаДокументаОткрытиеЛС", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаключениеДоговораОткрытьФорму(Команда)
	ОткрытьФорму("Документ.бестЗаключениеДоговоровСЮридическимиЛицами.Форма.ФормаДокументаОткрытиеДоговора");
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеОткрытьФормуЭлемента(Команда)
	
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	КонецЕсли;
	ПараметрыОткрытия  = Новый Структура("Ключ", ТекущиеДанные.Помещение);
	ОткрытьФорму("Справочник.энргПомещения.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПометитьНаУдаление(Команда)
	
	ТекущиеДанные  = Элементы.Помещения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	КонецЕсли;
	
	УстановитьПометкуУдаленияПомещенияСервер(ТекущиеДанные.Помещение, НЕ ТекущиеДанные.ПометкаУдаления);
	
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьКомандТаблицыФормыПомещения(ТекущиеДанные) 
	
	яДоступность  				= НЕ ЗначениеЗаполнено(ТекущиеДанные.Абонент);
	ПодчиненныеЭлементыКП 		= Элементы.Помещения.КоманднаяПанель.ПодчиненныеЭлементы;
	ПодчиненныеЭлементыГруппа 	= ПодчиненныеЭлементыКП.ПомещенияГруппаСоздать;
	
	КомандаФормы 				= ПодчиненныеЭлементыГруппа.ПодчиненныеЭлементы.ПомещенияЗаключениеДоговораОткрытьФорму;
	КомандаФормы.Доступность 	= яДоступность;
	
	КомандаФормы 				= ПодчиненныеЭлементыГруппа.ПодчиненныеЭлементы.ПомещенияОткрытьЛицевойСчет;
	КомандаФормы.Доступность 	= яДоступность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПометкуУдаленияПомещенияСервер(ПомещениеСсылка, ПометкаУдаления)
	
	ПомещениеОбъект  = ПомещениеСсылка.ПолучитьОбъект();
	ПомещениеОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВкладкаНачисления(ТипСтроения)
	
	Если ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.МКД") 
		Или ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ОБЩ") Тогда
		Видимость = Истина;
	Иначе
		Видимость = Ложь;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаНачисленияМКД", "Видимость", Видимость);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыМКДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущийРегистратор = Элементы.ДокументыМКД.ТекущиеДанные.Регистратор;
	
	ПараметрыОткрытияФормы = Новый Структура("Ключ", ТекущийРегистратор);
	
	Если ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргОткрытиеМКД")  Тогда
		ВидОперации = ПолучитьВидОперацииДокумента(ТекущийРегистратор);
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОткрытиеМКД_Закрытие") тогда
			Форма = ПолучитьФорму("Документ.энргОткрытиеМКД.Форма.ФормаДокументаЗакрытиеМКД",ПараметрыОткрытияФормы);
		Иначе  		
			Форма = ПолучитьФорму("Документ.энргОткрытиеМКД.Форма.ФормаДокументаОткрытиеМКД",ПараметрыОткрытияФормы);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргРегистрацияАварийностиСтроения") Тогда
		Форма = ПолучитьФорму("Документ.энргРегистрацияАварийностиСтроения.Форма.ФормаДокумента", ПараметрыОткрытияФормы);
	ИначеЕсли ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргСоглашениеОРаспределенииСверхнормативногоОДН") Тогда
		Форма = ПолучитьФорму("Документ.энргСоглашениеОРаспределенииСверхнормативногоОДН.Форма.ФормаДокумента", ПараметрыОткрытияФормы);
	ИначеЕсли ТипЗнч(ТекущийРегистратор) = Тип("ДокументСсылка.энргУстановитьПроцентРаспределенияОтрицательногоОДН") Тогда
		Форма = ПолучитьФорму("Документ.энргУстановитьПроцентРаспределенияОтрицательногоОДН.Форма.ФормаДокумента", ПараметрыОткрытияФормы);
	КонецЕсли;
	
	Форма.открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперацииДокумента(ДокументРегистратор)

   Возврат ДокументРегистратор.ВидОперации;

КонецФункции 

#КонецОбласти