#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает текст запроса даты поверок действующих приборов учета.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаДатыПоверокДействующихПриборовУчета() Экспорт
	
	Текст  =
		"ВЫБРАТЬ
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.Район КАК Район,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	бестДатыПоверкиПрибораУчетаНПСрезПоследних.ДатаПоверки КАК ДатаПоверки
		|ПОМЕСТИТЬ ДатыПоверокДействующихПриборовУчета
		|ИЗ
		|	РегистрСведений.бестДатыПоверкиПрибораУчетаНП.СрезПоследних(
		|			&Период,
		|			(Организация, Район, ТочкаУчета, ПриборУчета) В
		|				(ВЫБРАТЬ
		|					ДействующиеПриборыУчетаПомещения.Организация,
		|					ДействующиеПриборыУчетаПомещения.Район,
		|					ДействующиеПриборыУчетаПомещения.ТочкаУчета,
		|					ДействующиеПриборыУчетаПомещения.ПриборУчета
		|				ИЗ
		|					ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения)) КАК бестДатыПоверкиПрибораУчетаНПСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли