#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Документы.энргИзменениеВидаЗадолженности.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
 	энргПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	СброситьПоследовательностьВзаиморасчетов();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	СброситьПоследовательностьВзаиморасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СброситьПоследовательностьВзаиморасчетов()
	
	Набор  = РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	Набор.Отбор.Район.Установить(Район);
	Набор.Отбор.Абонент.Установить(Абонент);	
	Набор.Прочитать();
	
	Для Каждого Строка Из Набор Цикл
		Если Строка.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности Тогда
			Строка.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли