#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСУслугамиМКД",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСУслугамиМКД",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОперацияСУслугамиМКД");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	ИнициализироватьИсходныеДанныеДокумента(Схема);
	ЗаполнитьСхемуЗапроса(Схема, Регистры);
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры = Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ИспользоватьУзлыМКД = энргРаботаСТочкамиУчетаСервер.ИспользоватьУзлыМКД();
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
	ПараметрыЗапроса.Вставить("ИспользоватьУзлыМКД", 			ИспользоватьУзлыМКД);
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции МКД закрыт'"); 
	
	ПараметрыЗапроса 							= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 								ДокументСсылка);
	ПараметрыЗапроса.Вставить("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
		
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерефейса_Проведение

Процедура ЗаполнитьСхемуЗапроса(Схема, Регистры)
		
	ДобавитьТекстЗапросаЗначениеПлощадейМКД(Схема, Регистры);
	ДобавитьТекстЗапросаВидБлагоустройствМКД(Схема, Регистры);
	
	ДобавитьТекстЗапросаВладельцыТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаУслугиТочекУчетаМКД(Схема, Регистры);	
	ДобавитьТекстЗапросаАктивностьТочекУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУДляМКД(Схема, Регистры);
	ДобавитьТекстЗапросаСпособРаспределенияОбъемаМКДНаАбонентов(Схема, Регистры);
	ДобавитьТекстЗапросаФормулыРасчетаУслугМКД(Схема, Регистры);
	
	ДобавитьТекстЗапросаПоставщикиУслугМКД(Схема, Регистры);
	ДобавитьТекстЗапросаТочкиПоставкиТочекУчетаСтроений(Схема, Регистры);	
	ДобавитьТекстЗапросаТУМКДНаСтруктуреСети(Схема, Регистры);
	
	ДобавитьТекстЗапросаПриборыТочекМКД(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеПриборовМКД(Схема, Регистры);
	ДобавитьТекстЗапросаэнргВыводПриборовУчетаМКД(Схема, Регистры);	
	ДобавитьТекстЗапросаэнргВидыДифференцированностиПриборовУчетаМКД(Схема, Регистры);
	
	ДобавитьТекстЗапросаэнргПоказанияПриборовУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаэнргНомерПломбПриборовУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаэнргКоэффциентыПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаэнргДатыПоверкиПрибораУчета(Схема, Регистры);
	ДобавитьТекстЗапросаПриборыМОП(Схема, Регистры); 	
	
	ДобавитьТекстЗапросаВспомогательноеОборудованиеУзловУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеВспомогательногоОборудованияУзловУчетаМКД(Схема, Регистры);
	ДобавитьТекстЗапросаДопускПриборовУчетаККоммерческомуУчетуМКД(Схема, Регистры);
	
	ДобавитьТекстЗапросаПараметрыИзмерителей(Схема, Регистры);   	
	
КонецПроцедуры

#Область ИнициализацияДанныхДокумента

Процедура ИнициализироватьИсходныеДанныеДокумента(Схема)
	
	ПолучитьШапкуДокумента(Схема);
	ПолучитьТаблицуТочекУчета(Схема);
	ПолучитьТаблицуИзмерителей(Схема);
	ПолучитьТаблицуШкалыПриборовУчета(Схема);
	
КонецПроцедуры

Процедура ПолучитьШапкуДокумента(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСУслугамиМКД.Ссылка КАК Ссылка,
	|	энргОперацияСУслугамиМКД.Номер КАК Номер,
	|	энргОперацияСУслугамиМКД.Дата КАК Дата,
	|	энргОперацияСУслугамиМКД.Район КАК Район,
	|	энргОперацияСУслугамиМКД.МКД КАК МКД,
	|	энргОперацияСУслугамиМКД.ВидОперации КАК ВидОперации,
	|	энргОперацияСУслугамиМКД.ПериодНачисления КАК ПериодНачисления,
	|	энргОперацияСУслугамиМКД.ДатаФактическогоСобытия КАК ДатаФактическогоСобытия,
	|	энргОперацияСУслугамиМКД.Организация КАК Организация,
	|	энргОперацияСУслугамиМКД.энргДатаПоследнегоИзменения КАК энргДатаПоследнегоИзменения,
	|	энргОперацияСУслугамиМКД.энргДатаСозданияДокумента КАК энргДатаСозданияДокумента
	|ПОМЕСТИТЬ ШапкаДокумента
	|ИЗ
	|	Документ.энргОперацияСУслугамиМКД КАК энргОперацияСУслугамиМКД
	|ГДЕ
	|	энргОперацияСУслугамиМКД.Ссылка В(&мДокументы)");
	
КонецПроцедуры  

Процедура ПолучитьТаблицуТочекУчета(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСУслугамиМКДТочкиУчета.Ссылка КАК Ссылка,
	|	энргОперацияСУслугамиМКДТочкиУчета.IDСтроки КАК IDСтроки,
	|	энргОперацияСУслугамиМКДТочкиУчета.ДатаВыпуска КАК ДатаВыпуска,
	|	энргОперацияСУслугамиМКДТочкиУчета.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
	|	энргОперацияСУслугамиМКДТочкиУчета.ДатаУстановкиСчетчика КАК ДатаУстановкиСчетчика,
	|	энргОперацияСУслугамиМКДТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОперацияСУслугамиМКДТочкиУчета.НомерПломбы КАК НомерПломбы,
	|	энргОперацияСУслугамиМКДТочкиУчета.Поставщик КАК Поставщик,
	|	энргОперацияСУслугамиМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСУслугамиМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргОперацияСУслугамиМКДТочкиУчета.Услуга КАК Услуга,
	|	энргОперацияСУслугамиМКДТочкиУчета.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
	|	энргОперацияСУслугамиМКДТочкиУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	энргОперацияСУслугамиМКДТочкиУчета.РаспределятьНаАбонентов КАК РаспределятьНаАбонентов,
	|	энргОперацияСУслугамиМКДТочкиУчета.УзелУчета КАК УзелУчета,
	|	энргОперацияСУслугамиМКДТочкиУчета.ТипУзлаУчета КАК ТипУзлаУчета,
	|	энргОперацияСУслугамиМКДТочкиУчета.НазначениеПУ КАК НазначениеПУ,
	|	энргОперацияСУслугамиМКДТочкиУчета.СтруктураСети КАК СтруктураСети,
	|	энргОперацияСУслугамиМКДТочкиУчета.НетВозможностьУстановкиОДПУ КАК НетВозможностьУстановкиОДПУ,
	|	энргОперацияСУслугамиМКДТочкиУчета.РасположениеИзмерителя КАК РасположениеИзмерителя
	|ПОМЕСТИТЬ ТаблицаТочекУчета
	|ИЗ
	|	Документ.энргОперацияСУслугамиМКД.ТочкиУчета КАК энргОперацияСУслугамиМКДТочкиУчета
	|ГДЕ
	|	энргОперацияСУслугамиМКДТочкиУчета.Ссылка В(&мДокументы)");
	
КонецПроцедуры

Процедура ПолучитьТаблицуИзмерителей(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.Ссылка КАК Ссылка,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.IDСтрокиШкалы КАК IDСтроки,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.ДатаВыпуска КАК ДатаВыпуска,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.ДатаПоверкиСчетчика КАК ДатаПоверкиСчетчика,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.КонецДействияКоммерскогоУчета КАК КонецДействияКоммерскогоУчета,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.НомерПломбы КАК НомерПломбы,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ИСТИНА КАК ВспомогательноеОборудование,
	|	NULL КАК КодАСКУЭ,
	|	NULL КАК СобственникАСКУЭ,
	|	NULL КАК ДатаИнтеграцииССистемой,
	|	NULL КАК СистемаУчетаЭлектроэнергии,
	|	NULL КАК ТипИзмерителя,
	|	NULL КАК ЗаводскойНомер,
	|	NULL КАК ДоступКПУ,
	|	NULL КАК ДатаУстановки,
	|	NULL КАК ДатаОчереднойПоверки,
	|	NULL КАК СобственникСИ,
	|	NULL КАК Фаза,
	|	NULL КАК БалансоваяПринадлежность,
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.УдалитьВидПараметра КАК УдалитьВидПараметра
	|ПОМЕСТИТЬ ТаблицаИзмерителей
	|ИЗ
	|	Документ.энргОперацияСУслугамиМКД.ПриборыУзловУчета КАК энргОперацияСУслугамиМКДПриборыУзловУчета
	|ГДЕ
	|	энргОперацияСУслугамиМКДПриборыУзловУчета.Ссылка В(&мДокументы)
	|	И НЕ &ИспользоватьУзлыМКД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргОперацияСУслугамиМКДИзмерители.Ссылка,
	|	энргОперацияСУслугамиМКДИзмерители.IDСтрокиТочкиУчета,
	|	энргОперацияСУслугамиМКДИзмерители.IDСтроки,
	|	энргОперацияСУслугамиМКДИзмерители.ДатаВыпуска,
	|	энргОперацияСУслугамиМКДИзмерители.ДатаПоверкиСчетчика,
	|	энргОперацияСУслугамиМКДИзмерители.ДатаУстановкиПломбы,
	|	энргОперацияСУслугамиМКДИзмерители.КонецДействияКоммерскогоУчета,
	|	энргОперацияСУслугамиМКДИзмерители.КоэффициентПУ,
	|	энргОперацияСУслугамиМКДИзмерители.НачалоДействияКоммерскогоУчета,
	|	энргОперацияСУслугамиМКДИзмерители.НомерПломбы,
	|	энргОперацияСУслугамиМКДИзмерители.ПриборУчета,
	|	энргОперацияСУслугамиМКДИзмерители.РасположениеИзмерителя,
	|	энргОперацияСУслугамиМКДИзмерители.РегистрируетОбъем,
	|	энргОперацияСУслугамиМКДИзмерители.ТипПрибораУчета,
	|	энргОперацияСУслугамиМКДИзмерители.ВспомогательноеОборудование,
	|	энргОперацияСУслугамиМКДИзмерители.КодАСКУЭ,
	|	энргОперацияСУслугамиМКДИзмерители.СобственникАСКУЭ,
	|	энргОперацияСУслугамиМКДИзмерители.ДатаИнтеграцииССистемой,
	|	энргОперацияСУслугамиМКДИзмерители.СистемаУчетаЭлектроэнергии,
	|	энргОперацияСУслугамиМКДИзмерители.ТипИзмерителя,
	|	энргОперацияСУслугамиМКДИзмерители.ЗаводскойНомер,
	|	энргОперацияСУслугамиМКДИзмерители.ДоступКПУ,
	|	энргОперацияСУслугамиМКДИзмерители.ДатаУстановки,
	|	энргОперацияСУслугамиМКДИзмерители.ДатаОчереднойПоверки,
	|	энргОперацияСУслугамиМКДИзмерители.СобственникСИ,
	|	энргОперацияСУслугамиМКДИзмерители.Фаза,
	|	энргОперацияСУслугамиМКДИзмерители.БалансоваяПринадлежность,
	|	энргОперацияСУслугамиМКДИзмерители.УдалитьВидПараметра
	|ИЗ
	|	Документ.энргОперацияСУслугамиМКД.Измерители КАК энргОперацияСУслугамиМКДИзмерители
	|ГДЕ
	|	энргОперацияСУслугамиМКДИзмерители.Ссылка В(&мДокументы)
	|	И &ИспользоватьУзлыМКД");	
	
КонецПроцедуры

Процедура ПолучитьТаблицуШкалыПриборовУчета(Схема)
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.Ссылка КАК Ссылка,
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.IDСтрокиТарифнаяЗона КАК IDСтрокиТарифнаяЗона,
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.Шкала КАК Шкала,
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.ВидПараметра КАК ВидПараметра,
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.ТипТемпературы КАК ТипТемпературы
	|ПОМЕСТИТЬ ТаблицаШкалыПриборовУчета
	|ИЗ
	|	Документ.энргОперацияСУслугамиМКД.ШкалыПриборовУчета КАК энргОперацияСУслугамиМКДШкалыПриборовУчета
	|ГДЕ
	|	энргОперацияСУслугамиМКДШкалыПриборовУчета.Ссылка В(&мДокументы)");	
КонецПроцедуры

#КонецОбласти

#Область Услуги

Процедура ДобавитьТекстЗапросаЗначениеПлощадейМКД(Схема, Регистры)
	
	ИмяРегистра = "энргЗначениеПлощадейМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табЗначениеПлощадей.ВидПлощади КАК ВидПлощади,
	|	табЗначениеПлощадей.Услуга КАК Услуга,
	|	табЗначениеПлощадей.Значение КАК Площадь,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.ЗначениеПлощадей КАК табЗначениеПлощадей
	|		ПО Шапка.Ссылка = табЗначениеПлощадей.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табЗначениеПлощадей.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВидБлагоустройствМКД(Схема, Регистры)
	
	ИмяРегистра = "энргВидБлагоустройствМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	энргОперацияСУслугамиМКДВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	энргОперацияСУслугамиМКДВидыБлагоустройстваТарифныеКатегории.ВидБлагоустройстваОбщедомовой КАК ВидБлагоустройства
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.ВидыБлагоустройстваТарифныеКатегории КАК энргОперацияСУслугамиМКДВидыБлагоустройстваТарифныеКатегории
	|		ПО Шапка.Ссылка = энргОперацияСУслугамиМКДВидыБлагоустройстваТарифныеКатегории.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))
	|			И (энргОперацияСУслугамиМКДВидыБлагоустройстваТарифныеКатегории.Ссылка В (&мДокументы))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область ТочкиУчета

Процедура ДобавитьТекстЗапросаВладельцыТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргВладельцыТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	Шапка.МКД КАК АбонентВладелец,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаУслугиТочекУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргУслугиТочекУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.Услуга КАК Услуга,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;

	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаАктивностьТочекУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргАктивностьТочекУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги)
	|			ТОГДА ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСостояниеТочекУчета.Включена)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.энргСостояниеТочекУчета.Отключена)
	|	КОНЕЦ КАК Состояние,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСпособРаспределенияОбъемаМКДНаАбонентов(Схема, Регистры)
	
	ИмяРегистра = "энргСпособРаспределенияОбъемаМКДНаАбонентов";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.РаспределятьНаАбонентов КАК Распределять
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаФормулыРасчетаУслугМКД(Схема, Регистры)
	
	ИмяРегистра = "энргФормулыРасчетаУслугМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	табФормулыРасчетаУслуг.Услуга КАК Услуга,
	|	табФормулыРасчетаУслуг.ФормулаРасчета КАК ФормулаРасчета,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		Шапка.Ссылка КАК Ссылка,
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		ТабТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		ТабТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК ТабТочкиУчета
	|			ПО Шапка.Ссылка = ТабТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (ТабТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.ФормулыРасчетаУслуг КАК табФормулыРасчетаУслуг
	|		ПО ВложенныйЗапрос.Ссылка = табФормулыРасчетаУслуг.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табФормулыРасчетаУслуг.IDСтрокиТочкиУчета
	|			И (табФормулыРасчетаУслуг.Ссылка В (&мДокументы))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоставщикиУслугМКД(Схема, Регистры)
	
	ИмяРегистра = "энргПоставщикиУслугМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(табПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Услуга
	|	КОНЕЦ КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ЧастьСоставной
	|			ТОГДА ЕСТЬNULL(табПоставщикиСоставныхУслуг.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка))
	|		ИНАЧЕ ВложенныйЗапрос.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.МКД КАК МКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.Услуга КАК Услуга,
	|		табТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		табТочкиУчета.Поставщик КАК Поставщик,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		Шапка.МКД КАК МКД
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.ПоставщикиСоставныхУслуг КАК табПоставщикиСоставныхУслуг
	|		ПО ВложенныйЗапрос.Ссылка = табПоставщикиСоставныхУслуг.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоставщикиСоставныхУслуг.IDСтроки";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТочкиПоставкиТочекУчетаСтроений(Схема, Регистры)
	
	ИмяРегистра = "энргТочкиПоставкиТочекУчетаСтроений";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК Строение,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиПоставок.ТочкаПоставки КАК ТочкаПоставки,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.Услуга КАК Услуга,
	|		табТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	|		табТочкиУчета.Поставщик КАК Поставщик,
	|		табТочкиУчета.IDСтроки КАК IDСтроки,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.ТочкиПоставок КАК табТочкиПоставок
	|		ПО ВложенныйЗапрос.Ссылка = табТочкиПоставок.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табТочкиПоставок.IDСтроки";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
		
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУДляМКД(Схема, Регистры)
	
	ИмяРегистра = "энргТехническаяВозможностьУстановкиПУДляМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ЕСТЬNULL(табТочкиУчета.НетВозможностьУстановкиОДПУ, ЛОЖЬ) КАК НетВозможностьУстановкиОДПУ,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТУМКДНаСтруктуреСети(Схема, Регистры)
	
	ИмяРегистра = "энргТУМКДНаСтруктуреСети";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;

	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК Строение,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.СтруктураСети КАК СтруктураСети,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	|ИЗ
	|	ТаблицаТочекУчета КАК табТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШапкаДокумента КАК Шапка
	|		ПО табТочкиУчета.Ссылка = Шапка.Ссылка
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра; 	
	
КонецПроцедуры

#КонецОбласти

#Область ОсновныеПриборыУчета

Процедура ДобавитьТекстЗапросаПриборыТочекМКД(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыТочекМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги)))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеПриборовМКД(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеПриборовМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод)
	|	КОНЕЦ КАК Состояние,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";  	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргВыводПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргВыводПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|		ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (НЕ СостояниеУзлов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ОтключениеУслуги)))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргВидыДифференцированностиПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргВидыДифференцированностиПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК АбонентВладелец,
	|	Шапка.МКД КАК МКД,
	|	Шапка.МКД КАК КлючПомещения,
	|	СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|	КоллекцияШкалПриборовУчета.Шкала КАК Шкала,
	|	СостояниеУзлов.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА КоллекцияШкалПриборовУчета.ВидДифференцированности = ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)
	|		ИНАЧЕ КоллекцияШкалПриборовУчета.ВидДифференцированности
	|	КОНЕЦ КАК ВидДифференцированности
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК КоллекцияШкалПриборовУчета
	|			ПО СостояниеУзлов.Ссылка = КоллекцияШкалПриборовУчета.Ссылка
	|				И (КоллекцияШкалПриборовУчета.Ссылка В (&мДокументы))
	|				И СостояниеУзлов.IDСтроки = КоллекцияШкалПриборовУчета.IDСтрокиТочкиУчета
	|				И (СостояниеУзлов.Ссылка В (&мДокументы))
	|		ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (НЕ СостояниеУзлов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры


Процедура ДобавитьТекстЗапросаэнргПоказанияПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргПоказанияПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВложенныйЗапрос.КС КАК КС,
	|	ВложенныйЗапрос.Переворот КАК Переворот,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.АбонентВладелец КАК АбонентВладелец,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.IDСтрокиТарифнаяЗона КАК IDСтрокиТарифнаяЗона,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ТаблицаПоказанийПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТаблицаПоказанийПриборовУчета.ТекущиеПоказания КАК Показание,
	|	ТаблицаПоказанийПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		Шапка.МКД КАК АбонентВладелец,
	|		Шапка.МКД КАК МКД,
	|		Шапка.МКД КАК КлючПомещения,
	|		СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|		СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|		ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|		ЛОЖЬ КАК КС,
	|		ЛОЖЬ КАК Переворот,
	|		КоллекцияШкалПриборовУчета.Шкала КАК Шкала,
	|		КоллекцияШкалПриборовУчета.IDСтроки КАК IDСтрокиТарифнаяЗона,
	|		СостояниеУзлов.Ссылка КАК Ссылка
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК КоллекцияШкалПриборовУчета
	|				ПО СостояниеУзлов.Ссылка = КоллекцияШкалПриборовУчета.Ссылка
	|					И (КоллекцияШкалПриборовУчета.Ссылка В (&мДокументы))
	|					И СостояниеУзлов.IDСтроки = КоллекцияШкалПриборовУчета.IDСтрокиТочкиУчета
	|					И (СостояниеУзлов.Ссылка В (&мДокументы))
	|			ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.ПоказанияПриборовУчета КАК ТаблицаПоказанийПриборовУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПоказанийПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиТарифнаяЗона = ТаблицаПоказанийПриборовУчета.IDСтроки
	|			И (ТаблицаПоказанийПриборовУчета.Ссылка В (&мДокументы))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргНомерПломбПриборовУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргНомерПломбПриборовУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;	
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	таблицаНомераПломб.КлючСтроки КАК МестоУстановки,
	|	таблицаНомераПломб.НомерПломбы КАК НомерПломбы,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ИСТИНА КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	таблицаНомераПломб.ДатаУстановкиПломбы КАК ДатаУстановкиПломбы,
	|	таблицаНомераПломб.ЛицоУстановившееПломбу КАК ЛицоУстановившееПломбу,
	|	таблицаНомераПломб.ВидПломбы КАК ВидПломбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ табШапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА табШапка.ДатаФактическогоСобытия
	|			ИНАЧЕ табШапка.Дата
	|		КОНЕЦ КАК Период,
	|		табШапка.Организация КАК Организация,
	|		табШапка.Район КАК Район,
	|		табШапка.МКД КАК МКД,
	|		ИзмерителиУзла.ПриборУчета КАК ПриборУчета,
	|		табШапка.Дата КАК ПериодРегистрации,
	|		НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|		табШапка.Ссылка КАК Ссылка,
	|		ИзмерителиУзла.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК табШапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ИзмерителиУзла
	|				ПО табТочкиУчета.Ссылка = ИзмерителиУзла.Ссылка
	|					И табТочкиУчета.IDСтроки = ИзмерителиУзла.IDСтрокиТочкиУчета
	|					И (ИзмерителиУзла.Ссылка В (&мДокументы))
	|					И (НЕ ИзмерителиУзла.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			ПО табШапка.Ссылка = табТочкиУчета.Ссылка
	|				И (табШапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (табШапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугамиМКД.НомераПломб КАК таблицаНомераПломб
	|		ПО ВложенныйЗапрос.Ссылка = таблицаНомераПломб.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = таблицаНомераПломб.IDСтрокиИзмерителя
	|			И (таблицаНомераПломб.Ссылка В (&мДокументы))"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргКоэффциентыПриборовУчета(Схема, Регистры)
	
	ИмяРегистра = "энргКоэффциентыПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	Шапка.МКД КАК КлючПомещения,
	|	СостояниеУзлов.ТочкаУчета КАК ТочкаУчета,
	|	СостояниеУзлов.ПриборУчета КАК ПриборУчета,
	|	СостояниеУзлов.Ссылка КАК Регистратор,
	|	СостояниеУзлов.КоэффициентПУ КАК Коэффициент
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК СостояниеУзлов
	|		ПО Шапка.Ссылка = СостояниеУзлов.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (СостояниеУзлов.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))
	|			И (НЕ СостояниеУзлов.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаэнргДатыПоверкиПрибораУчета(Схема, Регистры)
	
	ИмяРегистра = "энргДатыПоверкиПрибораУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	Шапка.МКД КАК МКД,
	|	Шапка.МКД КАК КлючПомещения,
	|	КоллекцияТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	КоллекцияТочекУчета.ПриборУчета КАК ПриборУчета,
	|	КоллекцияТочекУчета.Ссылка КАК Регистратор,
	|	КоллекцияТочекУчета.ДатаПоверкиСчетчика КАК ДатаПоверки
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК КоллекцияТочекУчета
	|		ПО Шапка.Ссылка = КоллекцияТочекУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (КоллекцияТочекУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))
	|			И (НЕ КоллекцияТочекУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПриборыМОП(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыМОП"; 
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.МКД КАК МКД,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	Шапка.ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	ШапкаДокумента КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))
	|			И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги)))
	|			И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (табТочкиУчета.НазначениеПУ = ЗНАЧЕНИЕ(Перечисление.энргНазначениеПУ.МОП))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаДопускПриборовУчетаККоммерческомуУчетуМКД(Схема, Регистры)
		
	ИмяРегистра = "энргДопускПриборовУчетаККоммерческомуУчетуМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаПриборыУзловУчета.НачалоДействияКоммерскогоУчета КАК НачалоДействияКоммерскогоУчета,
	|	ТаблицаПриборыУзловУчета.КонецДействияКоммерскогоУчета КАК КонецПериодаКоммерскогоУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтрокиТочкиУчета
	|			И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыИзмерителей(Схема, Регистры)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("бестБиллингПроект") Тогда
		Возврат;
	КонецЕсли;
		
	ИмяРегистра = "бестПараметрыИзмерителей";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ПриборУчета КАК Измеритель,
	|	ТаблицаШкал.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ВидПараметра КАК ВидПараметра,
	|	ВложенныйЗапрос.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	ЗНАЧЕНИЕ(Перечисление.бестТипыТемператур.ПустаяСсылка) КАК ТипТемпературы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|		ТаблицаПриборыУзловУчета.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	|		ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ТаблицаПриборыУзловУчета.IDСтрокиТочкиУчета КАК IDСтрокиШкалы,
	|		ТаблицаПриборыУзловУчета.УдалитьВидПараметра КАК ВидПараметра,
	|		ТаблицаПриборыУзловУчета.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|		ВложенныйЗапрос.Ссылка КАК Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА Шапка.ДатаФактическогоСобытия
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.МКД КАК МКД,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчета КАК УзелУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			Шапка.ПериодНачисления КАК ПериодНачисления,
	|			Шапка.Ссылка КАК Ссылка,
	|			табТочкиУчета.IDСтроки КАК IDСтроки
	|		ИЗ
	|			ШапкаДокумента КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|			ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтрокиТочкиУчета
	|				И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|				И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаШкалыПриборовУчета КАК ТаблицаШкал
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаШкал.Ссылка
	|			И ВложенныйЗапрос.IDСтрокиШкалы = ТаблицаШкал.IDСтроки
	|			И (ТаблицаШкал.Ссылка В (&мДокументы))
	|			И (ТаблицаШкал.ВидПараметра <> ЗНАЧЕНИЕ(Справочник.бестВидыПараметровИзмерителей.ПустаяСсылка))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательноеОборудование

Процедура ДобавитьТекстЗапросаВспомогательноеОборудованиеУзловУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргПриборыУзловУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|	ТаблицаПриборыУзловУчета.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК УзелУчета,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги)))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтрокиТочкиУчета
	|			И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ ВложенныйЗапрос.УзелУчета = ТаблицаПриборыУзловУчета.ПриборУчета)
	|			И (ТаблицаПриборыУзловУчета.ВспомогательноеОборудование)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВспомогательногоОборудованияУзловУчетаМКД(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеПриборовУзловУчетаМКД";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|	ТаблицаПриборыУзловУчета.ТипПрибораУчета.Родитель КАК ТипИзмерителя,
	|	ТаблицаПриборыУзловУчета.ПриборУчета КАК ПриборУчета,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Шапка.ДатаФактическогоСобытия
	|			ИНАЧЕ Шапка.Дата
	|		КОНЕЦ КАК Период,
	|		Шапка.Организация КАК Организация,
	|		Шапка.Район КАК Район,
	|		Шапка.МКД КАК МКД,
	|		табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|		табТочкиУчета.ПриборУчета КАК УзелУчета,
	|		Шапка.Дата КАК ПериодРегистрации,
	|		Шапка.ПериодНачисления КАК ПериодНачисления,
	|		Шапка.Ссылка КАК Ссылка,
	|		табТочкиУчета.IDСтроки КАК IDСтроки
	|	ИЗ
	|		ШапкаДокумента КАК Шапка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТочекУчета КАК табТочкиУчета
	|			ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|				И (Шапка.Ссылка В (&мДокументы))
	|				И (табТочкиУчета.Ссылка В (&мДокументы))
	|				И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги))
	|				И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаИзмерителей КАК ТаблицаПриборыУзловУчета
	|		ПО ВложенныйЗапрос.Ссылка = ТаблицаПриборыУзловУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПриборыУзловУчета.IDСтрокиТочкиУчета
	|			И (ТаблицаПриборыУзловУчета.Ссылка В (&мДокументы))
	|			И (НЕ ТаблицаПриборыУзловУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|			И (НЕ ВложенныйЗапрос.УзелУчета = ТаблицаПриборыУзловУчета.ПриборУчета)
	|			И (ТаблицаПриборыУзловУчета.ВспомогательноеОборудование)";
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РеализацияИнтрейфеса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргОперацияСУслугамиМКД.Ссылка КАК Ссылка,
	|	энргОперацияСУслугамиМКД.Организация КАК Организация,
	|	энргОперацияСУслугамиМКД.Район КАК Район,
	|	энргОперацияСУслугамиМКД.МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргОперацияСУслугамиМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргОперацияСУслугамиМКД.ДатаФактическогоСобытия
	|		ИНАЧЕ энргОперацияСУслугамиМКД.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргОперацияСУслугамиМКД КАК энргОперацияСУслугамиМКД
	|ГДЕ
	|	энргОперацияСУслугамиМКД.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

#КонецОбласти  

#КонецОбласти

#КонецЕсли