#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеЗначенийКонстант

Функция ЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний() Экспорт 	
	ЗначениеКонстанты		= энргОбщегоНазначения.ЗначениеКонстанты("энргКоличествоНедопусковДляОтклоненияПоказаний");
	КолвоНедопусковПодряд	= ?(ЗначениеКонстанты = 0, 99999, ЗначениеКонстанты);
	
	Возврат КолвоНедопусковПодряд;
КонецФункции

Функция ЗначениеКонстантыНачальныеПоказанияПУНеРавныКонечнымВПериодеВведенияВЭксплуатациюПУ() Экспорт 	
	ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргНачальныеПоказанияПУНеРавныКонечнымВПериодеВведенияВЭксплуатациюПУ");	
	Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу() Экспорт 	
	ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу");	
	Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыПовышающийКоэффициентНесанкционированногоПодключения() Экспорт 	
	ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргПовышающийКоэффициентНесанкционированногоПодключения");	
	Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыВидТелефонаДляПИР() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргВидТелефонаДляПИР");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыВидЭлектроногоАдресаДляПИР() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргВидЭлектроногоАдресаДляПИР");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыГраницыРасчетногоПериодаВРазрезеРайонов() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргГраницыРасчетногоПериодаВРазрезеРайонов");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыДатаНачалаВеденияУчета() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргДатаНачалаВеденияУчета");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыДеньЗавершенияРасчетногоПериода() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргДеньЗавершенияРасчетногоПериода");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыДеньНачалаПримененияНовогоТарифа() Экспорт     
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргДеньНачалаПримененияНовогоТарифа"); 
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыЗагрузкаИзВнешнихСистем() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргЗагрузкаИзВнешнихСистем");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьАбонентскиеОтделы() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьАбонентскиеОтделы");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьДопУслуги() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьДопУслуги");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьНаправленияИспользованияТУ() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьНаправленияИспользованияТУ");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьПодчиненныеТочкиУчета() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьПодчиненныеТочкиУчета");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьПрикреплениеФайловСУказаниемТипа() Экспорт     
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьПрикреплениеФайловСУказаниемТипа"); 
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьРассрочку() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьРассрочку");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьТарифныеЗоны() Экспорт     
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьТарифныеЗоны"); 
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыИспользоватьШкалыПриборовУчета() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргИспользоватьШкалыПриборовУчета");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыКаталогХраненияСудебныхДокументов() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргКаталогХраненияСудебныхДокументов");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыНастройкаИнтеграцииСПирамидой() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргНастройкаИнтеграцииСПирамидой");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыНачислятьПеню() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргНачислятьПеню");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыПерерасчетСреднихЗначенийОтражатьВНачислениях() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргПерерасчетСреднихЗначенийОтражатьВНачислениях");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыПоставщикПоУмолчанию() Экспорт     
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргПоставщикПоУмолчанию"); 
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРассчитываемаяУслугаПоУмолчанию() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРассчитываемаяУслугаПоУмолчанию");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаАдрес() Экспорт     
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаАдрес"); 
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаАдресСайта() Экспорт    
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаАдресСайта");    
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаИНН() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаИНН");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаКПП() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаКПП");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаОГРН() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаОГРН");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаОКПО() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаОКПО");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаТелефон() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаТелефон");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаФакс() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаФакс");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаЭлекАдрес() Экспорт     
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаЭлекАдрес"); 
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыРеквизитФилиалаЮридическийАдрес() Экспорт  
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргРеквизитФилиалаЮридическийАдрес");  
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыСначалаГаситьТекущиеНачисления() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргСначалаГаситьТекущиеНачисления");   
    Возврат ЗначениеКонстанты;
КонецФункции

Функция ЗначениеКонстантыУзлыУчетаФизическихЛиц() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргУзлыУчетаФизическихЛиц");   
    Возврат ЗначениеКонстанты;
КонецФункции 

Функция ЗначениеКонстантыЗапретитьПроведениеДокументовБезПоказаний() Экспорт   
    ЗначениеКонстанты = энргОбщегоНазначения.ЗначениеКонстанты("энргЗапретитьПроведениеДокументовБезПоказаний");   
    Возврат ЗначениеКонстанты;
КонецФункции

#КонецОбласти

#Область УстановкаЗначенийКонстант

Процедура УстановитьЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний(ЗначениеКонстанты) Экспорт 	
	УстановитьЗначениеКонстанты("энргКоличествоНедопусковДляОтклоненияПоказаний", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыПовышающийКоэффициентНесанкционированногоПодключения(ЗначениеКонстанты) Экспорт 	
	УстановитьЗначениеКонстанты("энргПовышающийКоэффициентНесанкционированногоПодключения", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыВидТелефонаДляПИР(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргВидТелефонаДляПИР", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыВидЭлектроногоАдресаДляПИР(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргВидЭлектроногоАдресаДляПИР", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыГраницыРасчетногоПериодаВРазрезеРайонов(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргГраницыРасчетногоПериодаВРазрезеРайонов", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыДатаНачалаВеденияУчета(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргДатаНачалаВеденияУчета", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыДеньЗавершенияРасчетногоПериода(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргДеньЗавершенияРасчетногоПериода", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыДеньНачалаПримененияНовогоТарифа(ЗначениеКонстанты) Экспорт    
    УстановитьЗначениеКонстанты("энргДеньНачалаПримененияНовогоТарифа", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыЗагрузкаИзВнешнихСистем(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргЗагрузкаИзВнешнихСистем", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьАбонентскиеОтделы(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргИспользоватьАбонентскиеОтделы", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьДопУслуги(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргИспользоватьДопУслуги", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьНаправленияИспользованияТУ(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргИспользоватьНаправленияИспользованияТУ", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьПодчиненныеТочкиУчета(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргИспользоватьПодчиненныеТочкиУчета", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьПрикреплениеФайловСУказаниемТипа(ЗначениеКонстанты) Экспорт    
    УстановитьЗначениеКонстанты("энргИспользоватьПрикреплениеФайловСУказаниемТипа", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьРассрочку(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргИспользоватьРассрочку", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьТарифныеЗоны(ЗначениеКонстанты) Экспорт    
    УстановитьЗначениеКонстанты("энргИспользоватьТарифныеЗоны", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыИспользоватьШкалыПриборовУчета(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргИспользоватьШкалыПриборовУчета", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыКаталогХраненияСудебныхДокументов(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргКаталогХраненияСудебныхДокументов", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыНастройкаИнтеграцииСПирамидой(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргНастройкаИнтеграцииСПирамидой", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыНачислятьПеню(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргНачислятьПеню", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыПерерасчетСреднихЗначенийОтражатьВНачислениях(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргПерерасчетСреднихЗначенийОтражатьВНачислениях", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыПоставщикПоУмолчанию(ЗначениеКонстанты) Экспорт    
    УстановитьЗначениеКонстанты("энргПоставщикПоУмолчанию", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРассчитываемаяУслугаПоУмолчанию(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргРассчитываемаяУслугаПоУмолчанию", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргРасчетПриОтклоненииПоказанийПоСреднемуИлиНормативу", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаАдрес(ЗначениеКонстанты) Экспорт    
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаАдрес", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаАдресСайта(ЗначениеКонстанты) Экспорт   
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаАдресСайта", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаИНН(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаИНН", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаКПП(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаКПП", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаОГРН(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаОГРН", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаОКПО(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаОКПО", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаТелефон(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаТелефон", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаФакс(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаФакс", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаЭлекАдрес(ЗначениеКонстанты) Экспорт    
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаЭлекАдрес", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыРеквизитФилиалаЮридическийАдрес(ЗначениеКонстанты) Экспорт     
    УстановитьЗначениеКонстанты("энргРеквизитФилиалаЮридическийАдрес", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыСначалаГаситьТекущиеНачисления(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргСначалаГаситьТекущиеНачисления", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыУзлыУчетаФизическихЛиц(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргУзлыУчетаФизическихЛиц", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыНачальныеПоказанияПУНеРавныКонечнымВПериодеВведенияВЭксплуатациюПУ(ЗначениеКонстанты) Экспорт  
    УстановитьЗначениеКонстанты("энргНачальныеПоказанияПУНеРавныКонечнымВПериодеВведенияВЭксплуатациюПУ", ЗначениеКонстанты);
КонецПроцедуры

Процедура УстановитьЗначениеКонстантыЗапретитьПроведениеДокументовБезПоказаний(ЗначениеКонстанты) Экспорт 	
	УстановитьЗначениеКонстанты("энргЗапретитьПроведениеДокументовБезПоказаний", ЗначениеКонстанты);
КонецПроцедуры

#КонецОбласти

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, ЗначениеКонстанты) 
	Константы[ИмяКонстанты].Установить(ЗначениеКонстанты);
КонецПроцедуры  

#КонецОбласти