
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	// СтандартныеПодсистемы.ПодключаемыеКоманды
//	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
//	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
//	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
//	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//КонецПроцедуры

//#Область ОбработчикиКомандФормы

//// СтандартныеПодсистемы.ПодключаемыеКоманды
//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКоманду(Команда)
//	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
//КонецПроцедуры

//&НаСервере
//Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
//	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ОбновитьКоманды()
//	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
//КонецПроцедуры
//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//#КонецОбласти