#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет точки поставок точек учета.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТочкиПоставокТочекУчета(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыОтбора,"ДействующиеТочкиМКД");
	Иначе	
		ЕстьДействующиеТочки 		= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочкиМКД" Тогда
				ЕстьДействующиеТочки = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда 
			РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыОтбора,"ДействующиеТочкиМКД");
		КонецЕсли;
	КонецЕсли;
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТочкиПоставокТочекУчета());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, Строение, ТочкаУчета, ТочкаПоставки";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТочкиПоставокТочекУчета()
	
	Текст =
	"ВЫБРАТЬ
	|	энргТочкиПоставкиТочекУчетаСтроенийСрезПоследних.Организация КАК Организация,
	|	энргТочкиПоставкиТочекУчетаСтроенийСрезПоследних.Район КАК Район,
	|	энргТочкиПоставкиТочекУчетаСтроенийСрезПоследних.Строение КАК Строение,
	|	энргТочкиПоставкиТочекУчетаСтроенийСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргТочкиПоставкиТочекУчетаСтроенийСрезПоследних.ТочкаПоставки КАК ТочкаПоставки
	|ИЗ
	|	РегистрСведений.энргТочкиПоставкиТочекУчетаСтроений.СрезПоследних(
	|			&Период,
	|			(Организация, Район, Строение, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ДействующиеТочкиМКД.Организация,
	|					ДействующиеТочкиМКД.Район,
	|					ДействующиеТочкиМКД.МКД,
	|					ДействующиеТочкиМКД.ТочкаУчета
	|				ИЗ
	|					ДействующиеТочкиМКД КАК ДействующиеТочкиМКД)) КАК энргТочкиПоставкиТочекУчетаСтроенийСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли