#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ)
	Если ШаблонСуществует() Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Настройки с данным шаблоном уже существуют.");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	ПервыйШаблон 	= Объект.Шаблон = ПредопределенноеЗначение("Перечисление.энргШаблоныВыгрузок.IШаблонСбербанка");
	ВторойШаблон 	= Объект.Шаблон = ПредопределенноеЗначение("Перечисление.энргШаблоныВыгрузок.IIШаблонСбербанка");	
	ВидимостьПочты 	= Объект.Шаблон = ПредопределенноеЗначение("Перечисление.энргШаблоныВыгрузок.ШаблонПочты");
	
	Элементы.НеизменнаяЧасть.Видимость 					= ПервыйШаблон или ВторойШаблон;
	Элементы.КодИдентифицирующийКлиента.НеизменнаяЧасть = ПервыйШаблон;		
	Элементы.НастройкиНеизменнойЧасти.Видимость 		= ВидимостьПочты;
КонецПроцедуры

&НаСервере
Функция ШаблонСуществует()
	Возврат Справочники.энргНастройкиШаблоновВыгрузок.ШаблонСуществует(Объект.Шаблон);
КонецФункции

#КонецОбласти


