#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 	
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);	

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестУстановитьСхемуДораспределениеОбъемаУК.Дата КАК Период,
	|	бестУстановитьСхемуДораспределениеОбъемаУК.Организация КАК Организация,
	|	бестУстановитьСхемуДораспределениеОбъемаУК.Район КАК Район,
	|	бестУстановитьСхемуДораспределениеОбъемаУК.МКД КАК МКД,
	|	бестУстановитьСхемуДораспределениеОбъемаУК.Договор КАК ДоговорВладелец,
	|	бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД.ОбъектРасчета КАК ОбъектРасчетаВладелец,
	|	бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД.Услуга КАК Услуга,
	|	бестУстановитьСхемуДораспределениеОбъемаУКСхемаРасчета.Договор КАК Договор,
	|	бестУстановитьСхемуДораспределениеОбъемаУКСхемаРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестУстановитьСхемуДораспределениеОбъемаУКСхемаРасчета.ТочкаУчета КАК ТочкаУчета,
	|	бестУстановитьСхемуДораспределениеОбъемаУКСхемаРасчета.НомерПП КАК НомерПП
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.бестУстановитьСхемуДораспределениеОбъемаУК.ОбъектыОД КАК бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестУстановитьСхемуДораспределениеОбъемаУК КАК бестУстановитьСхемуДораспределениеОбъемаУК
	|		ПО бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД.Ссылка = бестУстановитьСхемуДораспределениеОбъемаУК.Ссылка
	|			И (бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД.Ссылка = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьСхемуДораспределениеОбъемаУК.СхемаРасчета КАК бестУстановитьСхемуДораспределениеОбъемаУКСхемаРасчета
	|		ПО бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД.IDСтроки = бестУстановитьСхемуДораспределениеОбъемаУКСхемаРасчета.IDСтрокиТочкиУчета
	|			И бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД.Ссылка = бестУстановитьСхемуДораспределениеОбъемаУКСхемаРасчета.Ссылка
	|			И (бестУстановитьСхемуДораспределениеОбъемаУКОбъектыОД.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.Организация КАК Организация,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.Район КАК Район,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.МКД КАК МКД,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.ДоговорВладелец КАК ДоговорВладелец,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.ОбъектРасчетаВладелец КАК ОбъектРасчетаВладелец,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.Услуга КАК Услуга,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.Договор КАК Договор,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестСхемыДораспределенияОбъемовУКСрезПоследних.НомерПП КАК НомерПП
	|ПОМЕСТИТЬ ВТ_СтарыеФормулы
	|ИЗ
	|	РегистрСведений.бестСхемыДораспределенияОбъемовУК.СрезПоследних(
	|			&Дата,
	|			(Организация, Район, МКД, ДоговорВладелец, ОбъектРасчетаВладелец, Услуга) В
	|				(ВЫБРАТЬ
	|					вт.Организация,
	|					вт.Район,
	|					вт.МКД,
	|					вт.ДоговорВладелец,
	|					вт.ОбъектРасчетаВладелец,
	|					вт.Услуга
	|				ИЗ
	|					ВТ_ДанныеДокумента КАК вт)) КАК бестСхемыДораспределенияОбъемовУКСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Период КАК Период,
	|	ВТ_ДанныеДокумента.Организация КАК Организация,
	|	ВТ_ДанныеДокумента.Район КАК Район,
	|	ВТ_ДанныеДокумента.МКД КАК МКД,
	|	ВТ_ДанныеДокумента.ДоговорВладелец КАК ДоговорВладелец,
	|	ВТ_ДанныеДокумента.ОбъектРасчетаВладелец КАК ОбъектРасчетаВладелец,
	|	ВТ_ДанныеДокумента.Услуга КАК Услуга,
	|	ВТ_ДанныеДокумента.Договор КАК Договор,
	|	ВТ_ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТ_ДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ВТ_ДанныеДокумента.НомерПП КАК НомерПП
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВТ_СтарыеФормулы.Организация,
	|	ВТ_СтарыеФормулы.Район,
	|	ВТ_СтарыеФормулы.МКД,
	|	ВТ_СтарыеФормулы.ДоговорВладелец,
	|	ВТ_СтарыеФормулы.ОбъектРасчетаВладелец,
	|	ВТ_СтарыеФормулы.Услуга,
	|	ВТ_СтарыеФормулы.Договор,
	|	ВТ_СтарыеФормулы.ОбъектРасчета,
	|	ВТ_СтарыеФормулы.ТочкаУчета,
	|	0
	|ИЗ
	|	ВТ_СтарыеФормулы КАК ВТ_СтарыеФормулы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ПО ВТ_СтарыеФормулы.Организация = ВТ_ДанныеДокумента.Организация
	|			И ВТ_СтарыеФормулы.Район = ВТ_ДанныеДокумента.Район
	|			И ВТ_СтарыеФормулы.МКД = ВТ_ДанныеДокумента.МКД
	|			И ВТ_СтарыеФормулы.ДоговорВладелец = ВТ_ДанныеДокумента.ДоговорВладелец
	|			И ВТ_СтарыеФормулы.ОбъектРасчетаВладелец = ВТ_ДанныеДокумента.ОбъектРасчетаВладелец
	|			И ВТ_СтарыеФормулы.Услуга = ВТ_ДанныеДокумента.Услуга
	|			И ВТ_СтарыеФормулы.Договор = ВТ_ДанныеДокумента.Договор
	|			И ВТ_СтарыеФормулы.ОбъектРасчета = ВТ_ДанныеДокумента.ОбъектРасчета
	|			И ВТ_СтарыеФормулы.ТочкаУчета = ВТ_ДанныеДокумента.ТочкаУчета
	|ГДЕ
	|	ВТ_ДанныеДокумента.ТочкаУчета ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период", Дата);
	
	ДанныеДораспределения	= Запрос.Выполнить();
	
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеДораспределения,		Движения.бестСхемыДораспределенияОбъемовУК);
	
	
	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли