#Область События_Формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДинамическуюТЧ();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьТЧ();
КонецПроцедуры

#КонецОбласти

#Область События_Шапка 

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	Объект.ПериодНачисления = НачалоМесяца(Объект.ПериодНачисления);
КонецПроцедуры

#КонецОбласти

#Область События_ТЧ_РазрезыПочасовыхЗначений 

&НаКлиенте
Процедура РазрезыПочасовыхЗначенийПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.РазрезыПочасовыхЗначений.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.ТЗПочасовыеЗначения,					Неопределено,		ТекДанные.IDСтроки);
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПочасовыхЗначенийПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.РазрезыПочасовыхЗначений.ТекущиеДанные;
	ТаблицыФормы	= Новый Массив;
	ТаблицыФормы.Добавить("ПочасовыеЗначения");
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекДанные.IDСтроки, Объект, ТаблицыФормы);
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПочасовыхЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;	
	Если ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		НоваяСтрока = Объект.РазрезыПочасовыхЗначений.Добавить();
		НоваяСтрока.IDСтроки = Новый УникальныйИдентификатор;
		ЗаполнитьПочасовуюВедомость(НоваяСтрока.IDСтроки);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьДинамическуюТЧ()
	Для каждого стр из Объект.ПочасовыеЗначения Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("День", стр.День);
		ПараметрыОтбора.Вставить("IDСтроки", стр.IDСтроки);
		НайденныеСтроки = ТЗПочасовыеЗначения.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			ЗаполняемаяСтрока = ТЗПочасовыеЗначения.Добавить();
			ЗаполняемаяСтрока.День 				= стр.День;
			ЗаполняемаяСтрока.IDСтроки 			= стр.IDСтроки;
		Иначе
			ЗаполняемаяСтрока = НайденныеСтроки[0];
		КонецЕсли;
		ЗаполняемаяСтрока["Час" + стр.Час] 	= стр.Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТЧ()
	Объект.ПочасовыеЗначения.Очистить();
	Для каждого стр Из ТЗПочасовыеЗначения Цикл
		ТекущийЧас = 0;
		Пока ТекущийЧас <= 23 Цикл
			НовСтр = Объект.ПочасовыеЗначения.Добавить();
			НовСтр.День 		= стр.День;
			НовСтр.Значение 	= стр["Час" + ТекущийЧас];
			НовСтр.Час 			= ТекущийЧас;
			НовСтр.IDСтроки 	= стр.IDСтроки;
			ТекущийЧас = ТекущийЧас + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПочасовуюВедомость(IDСтроки)
	пДата 			= Объект.ПериодНачисления;
	ДобавляемыйДень = НачалоМесяца(пДата);
	Пока Месяц(ДобавляемыйДень) = Месяц(пДата) Цикл
		НовСтр 			= ТЗПочасовыеЗначения.Добавить();
		НовСтр.День 	= ДобавляемыйДень;
		НовСтр.IDСтроки = IDСтроки;
		ДобавляемыйДень = ДобавляемыйДень + 86400;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
