#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗапуститьФормированиеРегистрацииПоказаний(ДокументОснование, КоличествоПотоков, ДополнительныеПараметры = Неопределено) Экспорт 
	
	//ДанныеПотоков = Новый Массив;
	ДанныеПотоков = ДополнительныеПараметры.ДанныеПотоков;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЗагрузкаПоказанийТочкиУчета.IDСтроки КАК IDСтроки
	|ИЗ
	|	РегистрСведений.бестЗагрузкаПоказанийТочкиУчета КАК бестЗагрузкаПоказанийТочкиУчета
	|ГДЕ
	|	бестЗагрузкаПоказанийТочкиУчета.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	IDСтроки";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбщееКоличество = Выборка.Количество();		
	Если ОбщееКоличество <= КоличествоПотоков Тогда 
		Порция = ОбщееКоличество;
	Иначе 
		Порция = Цел(ОбщееКоличество / КоличествоПотоков);
		Если (ОбщееКоличество % КоличествоПотоков) > 0 Тогда			
			Порция = Порция + 1;
		КонецЕсли;
	КонецЕсли;	
	
	Итерация = 0;
	ИдентификаторыПотока = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		Если Итерация = Порция Тогда
			
			ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, ИдентификаторыПотока);
			ДанныеПотоков.Добавить(ДлительнаяОперация);
			
			ИдентификаторыПотока = Новый Массив;
			Итерация = 0;
			
		КонецЕсли;
		
		ИдентификаторыПотока.Добавить(Выборка.IDСтроки);
		
		Итерация = Итерация + 1;
	КонецЦикла; 
	
	Если ИдентификаторыПотока.Количество() > 0 Тогда 
		ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, ИдентификаторыПотока);
		ДанныеПотоков.Добавить(ДлительнаяОперация); 
	КонецЕсли;
	
	Если ДанныеПотоков.Количество() = 0 Тогда		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Все строки с показаниями обработаны'"));		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам(ДокументОснование, Идентификаторы, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗаписьЖурналаРегистрации(
	"Создание показаний ЮЛ при загрузке показаний", 
	УровеньЖурналаРегистрации.Примечание,
	Метаданные.Документы.бестЗагрузкаПоказанийИзВнешнихИсточников,
	ДокументОснование,
	"Начало " + ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЗагрузкаПоказанийТочкиУчета.ДокументОснование КАК ДокументОснование,
	|	бестЗагрузкаПоказанийТочкиУчета.IDСтроки КАК IDСтроки,
	|	бестЗагрузкаПоказанийТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестЗагрузкаПоказанийТочкиУчета.Услуга КАК Услуга,
	|	бестЗагрузкаПоказанийТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	бестЗагрузкаПоказанийТочкиУчета.ДатаДокумента КАК ДатаДокумента,
	|	бестЗагрузкаПоказанийТочкиУчета.ПериодНачисления КАК ПериодНачисления,
	|	бестЗагрузкаПоказанийТочкиУчета.Организация КАК Организация,
	|	энргДоговорыКонтрагентов.Район КАК Район,
	|	бестЗагрузкаПоказанийТочкиУчета.Договор КАК Договор,
	|	бестЗагрузкаПоказанийТочкиУчета.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ СтрокиСоздания
	|ИЗ
	|	РегистрСведений.бестЗагрузкаПоказанийТочкиУчета КАК бестЗагрузкаПоказанийТочкиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО бестЗагрузкаПоказанийТочкиУчета.Договор = энргДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	бестЗагрузкаПоказанийТочкиУчета.ДокументОснование = &ДокументОснование
	|	И бестЗагрузкаПоказанийТочкиУчета.IDСтроки В(&Идентификаторы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСоздания.ДокументОснование КАК ДокументОснование,
	|	СтрокиСоздания.IDСтроки КАК IDСтрокиТочкиУчета,
	|	СтрокиСоздания.ТочкаУчета КАК ТочкаУчета,
	|	СтрокиСоздания.Услуга КАК Услуга,
	|	СтрокиСоздания.ПриборУчета КАК ПриборУчета,
	|	СтрокиСоздания.ДатаДокумента КАК ДатаДокумента,
	|	СтрокиСоздания.ПериодНачисления КАК ПериодНачисления,
	|	СтрокиСоздания.Организация КАК Организация,
	|	СтрокиСоздания.Район КАК Район,
	|	бестЗагрузкаПоказанийШкалыПриборовУчета.IDСтроки КАК IDСтрокиШкалы,
	|	бестЗагрузкаПоказанийШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	бестЗагрузкаПоказанийШкалыПриборовУчета.Шкала КАК Шкала,
	|	СтрокиСоздания.Договор КАК Договор,
	|	СтрокиСоздания.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ТаблицаШкалыПриборовУчета
	|ИЗ
	|	СтрокиСоздания КАК СтрокиСоздания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЗагрузкаПоказанийШкалыПриборовУчета КАК бестЗагрузкаПоказанийШкалыПриборовУчета
	|		ПО СтрокиСоздания.ДокументОснование = бестЗагрузкаПоказанийШкалыПриборовУчета.ДокументОснование
	|			И СтрокиСоздания.IDСтроки = бестЗагрузкаПоказанийШкалыПриборовУчета.IDСтрокиТочкиУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаШкалыПриборовУчета.ДокументОснование КАК ДокументОснование,
	|	ТаблицаШкалыПриборовУчета.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|	ТаблицаШкалыПриборовУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаШкалыПриборовУчета.Услуга КАК Услуга,
	|	ТаблицаШкалыПриборовУчета.ПриборУчета КАК ПриборУчета,
	|	ТаблицаШкалыПриборовУчета.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаШкалыПриборовУчета.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаШкалыПриборовУчета.Организация КАК Организация,
	|	ТаблицаШкалыПриборовУчета.Район КАК Район,
	|	ТаблицаШкалыПриборовУчета.IDСтрокиШкалы КАК IDСтрокиШкалы,
	|	ТаблицаШкалыПриборовУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	ТаблицаШкалыПриборовУчета.Шкала КАК Шкала,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ЗначениеТарифа КАК ЗначениеТарифа,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.МаксимальноВозможныеПоказания КАК МаксимальноВозможныеПоказания,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.МаксимальноВозможныйОбъемПотребления КАК МаксимальноВозможныйОбъемПотребления,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.Переворот КАК Переворот,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ПереворотИзмененПользователем КАК ПереворотИзмененПользователем,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.Разница КАК Разница,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.СреднийОбъемПотребления КАК СреднийОбъемПотребления,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.СтатусИзмененПользователем КАК СтатусИзмененПользователем,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.Сумма КАК Сумма,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ТекущиеПоказания КАК ТекущиеПоказания,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.СреднийОбъемПотребления3 КАК СреднийОбъемПотребления3,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ДопустимыйОбъемОтклонений КАК ДопустимыйОбъемОтклонений,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.РасходЗаПредМесяц КАК РасходЗаПредМесяц,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.РасходЗаАналогичныйПериодПредГода КАК РасходЗаАналогичныйПериодПредГода,
	|	бестЗагрузкаПоказанийПоказанияПриборовУчета.ОбъемПочасовойВедомости КАК ОбъемПочасовойВедомости,
	|	ТаблицаШкалыПриборовУчета.Договор КАК Договор,
	|	ТаблицаШкалыПриборовУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний) КАК ВидОперации
	|ИЗ
	|	ТаблицаШкалыПриборовУчета КАК ТаблицаШкалыПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестЗагрузкаПоказанийПоказанияПриборовУчета КАК бестЗагрузкаПоказанийПоказанияПриборовУчета
	|		ПО ТаблицаШкалыПриборовУчета.ДокументОснование = бестЗагрузкаПоказанийПоказанияПриборовУчета.ДокументОснование
	|			И ТаблицаШкалыПриборовУчета.IDСтрокиТочкиУчета = бестЗагрузкаПоказанийПоказанияПриборовУчета.IDСтрокиТочкиУчета
	|			И ТаблицаШкалыПриборовУчета.IDСтрокиШкалы = бестЗагрузкаПоказанийПоказанияПриборовУчета.IDСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	IDСтрокиТочкиУчета,
	|	Шкала";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ДокументОснование",	ДокументОснование);
	ПараметрыЗаписи.Вставить("МенеджерТочек",		РегистрыСведений.бестЗагрузкаПоказанийТочкиУчета);
	ПараметрыЗаписи.Вставить("МенеджерШкал",		РегистрыСведений.бестЗагрузкаПоказанийШкалыПриборовУчета);
	ПараметрыЗаписи.Вставить("МенеджерПоказаний",	РегистрыСведений.бестЗагрузкаПоказанийПоказанияПриборовУчета);
	ПараметрыЗаписи.Вставить("ИдентификаторТочки", Неопределено);
		
	ДокументОбъект 		= Неопределено;
	Примечание 			= "Создан автоматически";
	ИсточникПоказаний 	= ПредопределенноеЗначение("Справочник.энргИсточникиПоказаний.РеестрПлатежей");
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, "ИсточникПоказаний") Тогда
		ИсточникПоказаний = ДокументОснование.ИсточникПоказаний;	
	КонецЕсли;
	
	ТекТочкаУчета 			= Неопределено;
	ТекШкала 				= Неопределено;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего 			= Выборка.Количество();
	Счетчик			= 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений	= Цел(Всего / 15);
	
	Пока Выборка.Следующий() Цикл 	 			
		
		МенеджерДокумента =  Документы.бестРегистрацияПоказанийНП;
		
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.IDСтрокиТочкиУчета Тогда			
			
			Если НЕ ДокументОбъект = Неопределено Тогда				
				ЗаписатьДокументРегистрацииПоказаний(ПараметрыЗаписи, ДокументОбъект);
			КонецЕсли;
			
			ДокументОбъект = МенеджерДокумента.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
			ДокументОбъект.Дата 				= Выборка.ДатаДокумента;
			ДокументОбъект.ИсточникПоказаний 	= ИсточникПоказаний;
			ДокументОбъект.ДокументОснование 	= ДокументОснование;
			ДокументОбъект.Примечание 			= Примечание;
			
			НоваяТочка = Истина;
			СтрокаТочкиУчета = ДокументОбъект.ТочкиУчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			IDСтрокиТочки 				= Новый УникальныйИдентификатор(Выборка.IDСтрокиТочкиУчета);
			СтрокаТочкиУчета.IDСтроки 	= IDСтрокиТочки;
			
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы = ДокументОбъект.ШкалыПриборовУчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШкалы, Выборка);
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
		КонецЕсли;
		
		СтрокаПоказаний = ДокументОбъект.ПоказанияПриборовУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоказаний, Выборка);
		СтрокаПоказаний.IDСтроки = IDСтрокиШкалы; 		
		
		ТекТочкаУчета 	= Выборка.IDСтрокиТочкиУчета;
		ПараметрыЗаписи.ИдентификаторТочки = ТекТочкаУчета;
		ТекШкала 		= Выборка.Шкала;
		
		КоличествоИтераций = КоличествоИтераций + 1;
		Счетчик = Счетчик + 1;
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент);
			КоличествоИтераций = 0;
		КонецЕсли;
		
	КонецЦикла; 		
	
	Если НЕ ДокументОбъект = Неопределено Тогда
		ЗаписатьДокументРегистрацииПоказаний(ПараметрыЗаписи, ДокументОбъект);
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации(
	"Создание показаний ЮЛ при загрузке показаний", 
	УровеньЖурналаРегистрации.Примечание,
	Метаданные.Документы.энргЗагрузкаПоказанийИзВнешнихИсточников,
	ДокументОснование,
	"Конец " + ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Обработать данные при загрузке
// Событие при загрузке данных из файла
//
// Параметры:
//  ДокументОснование	 - 	 - 
//  РезультатПакет		 - 	 - 
//  СвязанныеДокументы	 - 	 - 
//  ДокументыПроведения	 - 	 - 
//
Функция ОбработатьДанныеПриЗагрузке(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, ОчищатьТЧЛиста = Истина, ВспомогательныеПараметры = Неопределено) Экспорт 
	
	НомераПоказаний = Новый Соответствие;
	ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения,, НомераПоказаний); 	
	Результат = ПровестиМодифицированныеДокументы(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры, НомераПоказаний);
	
	Возврат Результат;
	
КонецФункции

// Процедура - Обработать исправленные данные
// Событие при исправлении ошибок в документе основания
//
// Параметры:
//  ДокументОснование	 - 	 - 
//  РезультатЗапроса	 - 	 - 
//  Успешно				 - 	 - 
//
Процедура ОбработатьИсправленныеДанные(ДокументОснование, РезультатЗапроса, Успешно, ДополнительныеПараметры = Неопределено, ВспомогательныеПараметрыДляОтклонения = Неопределено) Экспорт
	
	СвязанныеДокументы 		= Новый Соответствие;	
	ДокументыПроведения 	= Новый Массив;
	
	ДанныеДокумента = РезультатЗапроса.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.ДатаПоказаний КАК ДатаПоказаний,
	|	ДанныеДокумента.IDСтроки КАК IDСтроки,
	|	ДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДокумента.Услуга КАК Услуга,
	|	ДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ДанныеДокумента.Шкала КАК Шкала,
	|	ДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ДанныеДокумента.ТекущиеПоказанияФайла КАК ТекущиеПоказанияФайла,
	|	ДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеДокумента КАК ДанныеДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеДокумента.Организация КАК Организация,
	|	ВТДанныеДокумента.Район КАК Район,
	|	ВТДанныеДокумента.IDСтроки КАК IDСтроки,
	|	ВТДанныеДокумента.ОбъектРасчета КАК ОбъектРасчета,
	|	ВТДанныеДокумента.Договор КАК Договор,
	|	ВТДанныеДокумента.Шкала КАК Шкала,
	|	ВТДанныеДокумента.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВТДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ВТДанныеДокумента.ПриборУчета КАК ПриборУчета,
	|	ВТДанныеДокумента.ВидДифференцированности КАК ВидДифференцированности,
	|	ВТДанныеДокумента.ДатаПоказаний КАК ДатаПоказаний,
	|	ВТДанныеДокумента.Услуга КАК Услуга,
	|	ВТДанныеДокумента.ТекущиеПоказанияФайла КАК ТекущиеПоказания
	|ИЗ
	|	ВТДанныеДокумента КАК ВТДанныеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	ОбъектРасчета,
	|	ДатаПоказаний,
	|	ТочкаУчета,
	|	ПриборУчета,
	|	Шкала
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Район)
	|ПО
	|	Договор,
	|	ОбъектРасчета,
	|	ДатаПоказаний";
	
	Запрос.УстановитьПараметр("ДанныеДокумента", ДанныеДокумента);
	РезультатЗапроса = Запрос.Выполнить();		
	
	ЗафиксироватьНайденныеДанныеПриИсправленииДанных(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, Ложь); 	
	
	Успешно = Истина;
	ДополнительныеПараметры.Вставить("МассивID", Новый Массив);
	Для Каждого ТекДокументОбъект Из ДокументыПроведения Цикл
		
		ДокументОбъект = ТекДокументОбъект;  
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ДокументОбъект.ТочкиУчета.Количество() > 0 Тогда 
				ДополнительныеПараметры.МассивID.Добавить(ДокументОбъект.ТочкиУчета[0].IDСтроки);
			КонецЕсли;	
		Исключение		 	
			ИнфаОбОшибке 									= ИнформацияОбОшибке();
			ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
			ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
			ПараметрыЖурнала.ТекстПользователю 				= "Не удалось провести документы по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
			энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка показаний", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала); 
		КонецПопытки;  
	КонецЦикла; 
		
КонецПроцедуры 

Процедура ЗафиксироватьНеНайденныеДанные(ДокументОснование, РезультатЗапроса) Экспорт
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли; 	
	
	ТаблицаПриборов 	= ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказания;
	ТаблицаТарифнойЗоны = ДокументОснование.НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона;	
	
	ТаблицаПриборов.Очистить();
	ТаблицаТарифнойЗоны.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ИдентификаторСтроки = Новый УникальныйИдентификатор();			
		
		НСтрокаПрибора = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрокаПрибора, Выборка);
		НСтрокаПрибора.IDСтроки = ИдентификаторСтроки;
		
		НСтрокаТарифнойЗоны = ТаблицаТарифнойЗоны.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрокаТарифнойЗоны, Выборка);
		НСтрокаТарифнойЗоны.IDСтроки = ИдентификаторСтроки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытияОшибки()
	
	Возврат "Загрузка показаний ЮЛ";
	
КонецФункции

Функция ПровестиМодифицированныеДокументы(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры, НомераПоказаний = Неопределено)
	
	Результат = Новый Структура("Статус", Истина);
	НаборыЗаписей = ПодготовитьНаборыЗаписей(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры);
	
	МенеджерыРегистров = Новый Структура;
	МенеджерыРегистров.Вставить("ТочкиУчета",				РегистрыСведений.бестЗагрузкаПоказанийТочкиУчета);
	МенеджерыРегистров.Вставить("ШкалыПриборовУчета",		РегистрыСведений.бестЗагрузкаПоказанийШкалыПриборовУчета);
	МенеджерыРегистров.Вставить("ПоказанияПриборовУчета",	РегистрыСведений.бестЗагрузкаПоказанийПоказанияПриборовУчета);
	
	НачатьТранзакцию();	
	Попытка
		
		ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, "ТочкиУчета");
		ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, "ШкалыПриборовУчета");
		ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, "ПоказанияПриборовУчета");
		
		Для Каждого СтрокаНабора из НаборыЗаписей Цикл
			
			ТаблицыЗаписи = СтрокаНабора.Значение;
			
			ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, "ТочкиУчета");
			ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, "ШкалыПриборовУчета");
			ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, "ПоказанияПриборовУчета");		
			
			// заполнение ТЧ документа основания загруженными данными 
			ЗаполнитьТЧОснованияЗагруженнымиДанными(ДокументОснование, ТаблицыЗаписи, НомераПоказаний);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию(); 	
		
		Результат.Статус = Ложь;
		ИнфаОбОшибке 									= ИнформацияОбОшибке();
		ПараметрыЖурнала								= энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		ПараметрыЖурнала.ВыводитьСообщениеПользователю 	= Истина;
		ПараметрыЖурнала.ТекстПользователю 				= "Не удалось провести документы по причине: " + КраткоеПредставлениеОшибки(ИнфаОбОшибке);
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Загрузка показаний ЮЛ", УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнфаОбОшибке), ПараметрыЖурнала);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьНаборыЗаписей(ДокументОснование, ДокументыПроведения, ВспомогательныеПараметры)
	
	Результат = Новый Соответствие;
	Итерация = 1;
	ОписаниеТипа				= Новый ОписаниеТипов("ДокументСсылка.бестЗагрузкаПоказанийИзВнешнихИсточников");
	ОписаниеТипаОрг				= Новый ОписаниеТипов("СправочникСсылка.Организации");
	ОписаниеТипаРайон			= Новый ОписаниеТипов("СправочникСсылка.энргЗоныОтвественности");
	ОписаниеТипаДоговор			= Новый ОписаниеТипов("СправочникСсылка.энргДоговорыКонтрагентов");
	ОписаниеТипаОбъектРасчета	= Новый ОписаниеТипов("СправочникСсылка.бестОбъектыРасчета");
	ОписаниеТипаДата			= ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
	ОписаниеТипаУИ				= Новый ОписаниеТипов("УникальныйИдентификатор");
	
	МенеджерПериода = Обработки.энргГраницыПериодаНачисленияМенеджер;
	
	Для Каждого ТекДокументОбъект Из ДокументыПроведения Цикл
		ДокументОбъект = ТекДокументОбъект;
		ДокументОбъект.ПериодНачисления = МенеджерПериода.ОпределитьПериодНачисления(ДокументОбъект.Дата, ДокументОбъект.Организация, ДокументОбъект.Район);
		
		СрокаДанных = Новый Структура;
		СрокаДанных.Вставить("ТочкиУчета", ДокументОбъект.ТочкиУчета.Выгрузить());
		СрокаДанных.ТочкиУчета.Колонки.Добавить("ДокументОснование",	ОписаниеТипа);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("Организация",			ОписаниеТипаОрг);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("Район",				ОписаниеТипаРайон);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("ДатаДокумента",		ОписаниеТипаДата);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("ПериодНачисления",		ОписаниеТипаДата);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("Договор",				ОписаниеТипаДоговор);
		СрокаДанных.ТочкиУчета.Колонки.Добавить("ОбъектРасчета",		ОписаниеТипаОбъектРасчета);
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОснование.Организация,		"Организация");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОснование.Район, 			"Район");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОснование.Ссылка, 			"ДокументОснование");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОбъект.ПериодНачисления,	"ПериодНачисления");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОбъект.Дата, 				"ДатаДокумента");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОбъект.Договор, 			"Договор");
		СрокаДанных.ТочкиУчета.ЗаполнитьЗначения(ДокументОбъект.ОбъектРасчета, 		"ОбъектРасчета");
		
		СрокаДанных.Вставить("ШкалыПриборовУчета", ДокументОбъект.ШкалыПриборовУчета.Выгрузить());
		СрокаДанных.ШкалыПриборовУчета.Колонки.Добавить("ДокументОснование", ОписаниеТипа);
		СрокаДанных.ШкалыПриборовУчета.ЗаполнитьЗначения(ДокументОснование.Ссылка, "ДокументОснование");
		
		СрокаДанных.Вставить("ПоказанияПриборовУчета", ДокументОбъект.ПоказанияПриборовУчета.Выгрузить());
		СрокаДанных.ПоказанияПриборовУчета.Колонки.Добавить("ДокументОснование", ОписаниеТипа);
		СрокаДанных.ПоказанияПриборовУчета.Колонки.Добавить("IDТочкиУчета",		 ОписаниеТипаУИ);
		СрокаДанных.ПоказанияПриборовУчета.ЗаполнитьЗначения(ДокументОснование.Ссылка, "ДокументОснование");
		СрокаДанных.ПоказанияПриборовУчета.ЗаполнитьЗначения(ДокументОснование.Ссылка, "IDТочкиУчета");
		
		Результат.Вставить("Набор" + Итерация, СрокаДанных);
		Итерация = Итерация + 1;
		//ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

#Область РаботаСДокументами

Процедура ЗафиксироватьНайденныеДанные(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, ОчищатьТЧЛиста = Истина, НомераПоказаний = Неопределено) 
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	
    ВидОперации			= Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний;
	Примечание 			= ИмяСобытияОшибки();
	ИсточникПоказаний   = ДокументОснование.ИсточникПоказаний;
	сДокументОснование	= ДокументОснование.Ссылка;
	ПериодНачисления	= ДокументОснование.ПериодНачисления;
	
	ВыбораДоговора = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбораДоговора.Следующий() Цикл
		СвязанныеДокументыДоговор 	= СвязанныеДокументы[ВыбораДоговора.Договор];
		
		ВыборкаОбъектРасчета = 	ВыбораДоговора.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектРасчета.Следующий() Цикл  
			СвязанныеДокументыОбъект	= Неопределено;
			Если НЕ СвязанныеДокументыДоговор = Неопределено Тогда
				СвязанныеДокументыОбъект = СвязанныеДокументыДоговор[ВыборкаОбъектРасчета.ОбъектРасчета];
			КонецЕсли;

			ВыборкаДата = ВыборкаОбъектРасчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			Пока ВыборкаДата.Следующий() Цикл
				
				РегистрацияПоказанийОбъект = Неопределено; 
				
				Если НЕ СвязанныеДокументыОбъект = Неопределено Тогда
					РегистрацияПоказанийОбъект = СвязанныеДокументыОбъект[ВыборкаДата.ДатаПоказаний];
				КонецЕсли;					
				
				Если РегистрацияПоказанийОбъект = Неопределено Тогда 
					РегистрацияПоказанийОбъект	= Документы.бестРегистрацияПоказанийНП.СоздатьДокумент();
					
					ЗаполнитьЗначенияСвойств(РегистрацияПоказанийОбъект, ВыборкаОбъектРасчета);
					РегистрацияПоказанийОбъект.Дата 				= ВыборкаДата.ДатаПоказаний; 
					РегистрацияПоказанийОбъект.ВидОперации 			= ВидОперации;
					РегистрацияПоказанийОбъект.ИсточникПоказаний 	= ИсточникПоказаний;
					РегистрацияПоказанийОбъект.ДокументОснование 	= сДокументОснование;
					РегистрацияПоказанийОбъект.Примечание 			= Примечание;
					РегистрацияПоказанийОбъект.ПериодНачисления 	= НачалоМесяца(ВыборкаДата.ДатаПоказаний); 
					РегистрацияПоказанийОбъект.Организация = ДокументОснование.Организация;	
				Иначе
					Если ОчищатьТЧЛиста Тогда 
						РегистрацияПоказанийОбъект.ТочкиУчета.Очистить();
						РегистрацияПоказанийОбъект.ШкалыПриборовУчета.Очистить();
						РегистрацияПоказанийОбъект.ПоказанияПриборовУчета.Очистить();
					КонецЕсли;
				КонецЕсли;
				
				Выборка = ВыборкаДата.Выбрать();
				ТекТочкаУчета 								= Неопределено;
				ТекПрибор 									= Неопределено;
				ТекШкала 									= Неопределено;
				IDСтрокиТочки 								= Неопределено;
				IDСтрокиШкалы 								= Неопределено;
				
				Пока Выборка.Следующий() Цикл
					Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
						СтрокаТочкиУчета  					= РегистрацияПоказанийОбъект.ТочкиУчета.Добавить();
						IDСтрокиТочки 						= Новый УникальныйИдентификатор;
						ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
						СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
					КонецЕсли;
					
					Если НЕ ТекШкала = Выборка.Шкала ИЛИ ТекТочкаУчета <> Выборка.ТочкаУчета Тогда
						СтрокаШкалы  						= РегистрацияПоказанийОбъект.ШкалыПриборовУчета.Добавить();
						IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
						СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
						СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
						СтрокаШкалы.Шкала 					= Выборка.Шкала;
						СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
					КонецЕсли;
					
					СтрокаПоказаний 						= РегистрацияПоказанийОбъект.ПоказанияПриборовУчета.Добавить();
					СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
					СтрокаПоказаний.IDСтрокиТочкиУчета		= IDСтрокиТочки;
					СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
					СтрокаПоказаний.ТекущиеПоказания		= Выборка.ТекущиеПоказания;
															
					ТекТочкаУчета 							= Выборка.ТочкаУчета;
					ТекПрибор 								= Выборка.ПриборУчета;
					ТекШкала 								= Выборка.Шкала;     
					
					Если НомераПоказаний <> Неопределено Тогда
						НомераПоказаний.Вставить(Выборка.ПриборУчета, Выборка.НомерПоказаний);
					КонецЕсли;
				КонецЦикла;
				
				Район = ?(ЗначениеЗаполнено(РегистрацияПоказанийОбъект.Район), РегистрацияПоказанийОбъект.Район, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрацияПоказанийОбъект.Договор, "Район"));
				бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(РегистрацияПоказанийОбъект.ТочкиУчета,РегистрацияПоказанийОбъект.ШкалыПриборовУчета,РегистрацияПоказанийОбъект.ПоказанияПриборовУчета, РегистрацияПоказанийОбъект.Дата, РегистрацияПоказанийОбъект.Организация, Район, Ложь);
								
				ПоказанияПриборов = РегистрацияПоказанийОбъект.ПоказанияПриборовУчета;
				бестРаботаСПоказаниямиПриборовУчетаНПСервер.ПроверитьОшибкуПрофиля(ПоказанияПриборов);
				бестРаботаСПоказаниямиПриборовУчетаНПСервер.КонтрольОшибкиДругойЗоны(ПоказанияПриборов); 
				ОбработатьПричиныОтклоненияПоказаний(ПоказанияПриборов, РегистрацияПоказанийОбъект.Дата);
				
				ДокументыПроведения.Добавить(РегистрацияПоказанийОбъект);
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры 

Процедура ОбработатьПричиныОтклоненияПоказаний(ПоказанияПриборовУчета, ДатаДокумента)
	
	Для Каждого СтрокаПоказаний Из ПоказанияПриборовУчета Цикл
		бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(СтрокаПоказаний, ДатаДокумента, Ложь);	
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьТЧОснованияЗагруженнымиДанными(ДокументОснование, ТаблицыТЧ, НомераПоказаний = Неопределено) 
	
	ТочкиУчетаОснование = ДокументОснование["ТочкиУчета"];
	ШкалыОснование = ДокументОснование["ШкалыПриборовУчета"];
	ПриборыУчетаОснование = ДокументОснование["ПоказанияПриборовУчета"];
	
	Для Каждого ТочкаУчета Из ТаблицыТЧ.ТочкиУчета Цикл 
		
		ДатаДокумента = ТочкаУчета.ДатаДокумента;
		Организация = ТочкаУчета.Организация;
		Район = ?(ЗначениеЗаполнено(ТочкаУчета.Район), ТочкаУчета.Район, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаУчета.Договор, "Район")); 
		
		СтрокаТУЗагрузка = ТочкиУчетаОснование.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТУЗагрузка, ТочкаУчета);
		СтрокаТУЗагрузка.ДатаПоказаний = ТочкаУчета.ДатаДокумента;
		
		НомерПоказанияИзФайла = НомераПоказаний.Получить(ТочкаУчета.ПриборУчета);
		Если НомерПоказанияИзФайла <> Неопределено Тогда
			СтрокаТУЗагрузка.НомерПоказаний = НомерПоказанияИзФайла;
		КонецЕсли;    
		
		СтрокаТУЗагрузка.ПриборУчетаИзФайла = СтрокаТУЗагрузка.ПриборУчета;
		СтрокаТУЗагрузка.СостояниеИсправления = 0;
		
		Шкалы = ТаблицыТЧ.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТочкаУчета.IDСтроки));
		Для Каждого Шкала Из Шкалы Цикл 
			СтрокаШкалыЗагрузка = ШкалыОснование.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШкалыЗагрузка, Шкала);
			
			Показания = ТаблицыТЧ.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТочкаУчета.IDСтроки));
			Для Каждого ПоказанияПУ Из Показания Цикл
				СтрокаПУЗагрузка = ПриборыУчетаОснование.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПУЗагрузка, ПоказанияПУ);
			КонецЦикла;
		КонецЦикла;  
		
	КонецЦикла; 
	
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(ТочкиУчетаОснование, ШкалыОснование, ПриборыУчетаОснование,ДатаДокумента,Организация,Район,Ложь);
	
КонецПроцедуры

#Область РаботаСОтработкойОшибок

Процедура ЗафиксироватьНайденныеДанныеПриИсправленииДанных(ДокументОснование, РезультатЗапроса, СвязанныеДокументы, ДокументыПроведения, ОчищатьТЧЛиста = Истина) 
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	МенеджерПериода 	= Обработки.энргГраницыПериодаНачисленияМенеджер;
	МенеджерДокумента	= Документы.бестРегистрацияПоказанийНП;
	
	Примечание 			= "Создан автоматически при исправлении данных";
	ИсточникПоказаний   = ДокументОснование.ИсточникПоказаний;
	сДокументОснование	= ДокументОснование.Ссылка;
	ПериодНачисления	= ДокументОснование.ПериодНачисления;
	ВидОперации			= Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний;
	
	ВыбораДоговора = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбораДоговора.Следующий() Цикл
		СвязанныеДокументыДоговор 	= СвязанныеДокументы[ВыбораДоговора.Договор];
		
		ВыборкаОбъектРасчета = 	ВыбораДоговора.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектРасчета.Следующий() Цикл  
			СвязанныеДокументыОбъект	= Неопределено;
			Если НЕ СвязанныеДокументыДоговор = Неопределено Тогда
				СвязанныеДокументыОбъект = СвязанныеДокументыДоговор[ВыборкаОбъектРасчета.ОбъектРасчета];
			КонецЕсли;
			
			ВыборкаДата = ВыборкаОбъектРасчета .Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			Пока ВыборкаДата.Следующий() Цикл
				
				ДокументОбъект = Неопределено; 
				
				Если НЕ СвязанныеДокументыОбъект = Неопределено Тогда
					ДокументОбъект = СвязанныеДокументыОбъект[ВыборкаДата.ДатаПоказаний];
				КонецЕсли;
				
				Если ДокументОбъект = Неопределено Тогда 
					ДокументОбъект	= Документы.бестРегистрацияПоказанийНП.СоздатьДокумент();
					
					ЗаполнитьЗначенияСвойств(ДокументОбъект, ВыборкаОбъектРасчета);
					ДокументОбъект.Дата 				= ВыборкаДата.ДатаПоказаний; 
					ДокументОбъект.ВидОперации 			= ВидОперации;
					ДокументОбъект.ИсточникПоказаний 	= ИсточникПоказаний;
					ДокументОбъект.ДокументОснование 	= сДокументОснование;
					ДокументОбъект.Примечание 			= Примечание;
					ДокументОбъект.ПериодНачисления 	= ПериодНачисления
				КонецЕсли;
				
				ТекТочкаУчета 								= Неопределено;
				ТекПрибор 									= Неопределено;
				ТекШкала 									= Неопределено;
				IDСтрокиТочки 								= Неопределено;
				IDСтрокиШкалы 								= Неопределено;		
				
				Выборка = ВыборкаДата.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
						СтрокаТочкиУчета  					= ДокументОбъект.ТочкиУчета.Добавить();
						IDСтрокиТочки 						= Выборка.IDСтроки;
						ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
						СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
					КонецЕсли;
					
					Если НЕ ТекШкала = Выборка.Шкала ИЛИ ТекТочкаУчета <> Выборка.ТочкаУчета Тогда
						СтрокаШкалы  						= ДокументОбъект.ШкалыПриборовУчета.Добавить();
						IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
						СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
						СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
						СтрокаШкалы.Шкала 					= Выборка.Шкала;
						СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
					КонецЕсли;
					
					СтрокаПоказаний 						= ДокументОбъект.ПоказанияПриборовУчета.Добавить();
					СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
					СтрокаПоказаний.IDСтрокиТочкиУчета		= IDСтрокиТочки;
					СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
					СтрокаПоказаний.ТекущиеПоказания		= Выборка.ТекущиеПоказания;
					
					ТекТочкаУчета 							= Выборка.ТочкаУчета;
					ТекПрибор 								= Выборка.ПриборУчета;
					ТекШкала 								= Выборка.Шкала;
					
				КонецЦикла;                                   
				
				бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(ДокументОбъект.ТочкиУчета,ДокументОбъект.ШкалыПриборовУчета,ДокументОбъект.ПоказанияПриборовУчета,ДокументОбъект.Дата,ДокументОбъект.Организация,ДокументОбъект.Район,Ложь);
				
				ПоказанияПриборов = ДокументОбъект.ПоказанияПриборовУчета;
				бестРаботаСПоказаниямиПриборовУчетаНПСервер.ПроверитьОшибкуПрофиля(ПоказанияПриборов);
				бестРаботаСПоказаниямиПриборовУчетаНПСервер.КонтрольОшибкиДругойЗоны(ПоказанияПриборов); 
				ОбработатьПричиныОтклоненияПоказаний(ПоказанияПриборов, ДокументОбъект.Дата);

				ДокументыПроведения.Добавить(ДокументОбъект); 
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаСРегистрами

Процедура ОчиститьЗаписанныеДанныеРегистра(ДокументОснование, МенеджерыРегистров, ИмяНабора)
	
	Набор = МенеджерыРегистров[ИмяНабора].СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);	
	Набор.Отбор.ДокументОснование.Установить(ДокументОснование.Ссылка);	
	Набор.Записать();
	
КонецПроцедуры

Процедура ЗаписатьНаборДанных(ДокументОснование, МенеджерыРегистров, ТаблицыЗаписи, ИмяНабора)
	
	Набор = МенеджерыРегистров[ИмяНабора].СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.Загрузить(ТаблицыЗаписи[ИмяНабора]); 
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РазборОчередиПоказаний

Процедура ЗаписатьДокументРегистрацииПоказаний(ПараметрыЗаписи, ДокументОбъект)
	
	НаборТочек = ПараметрыЗаписи.МенеджерТочек.СоздатьНаборЗаписей();
	НаборТочек.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборТочек.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборТочек.Отбор.IDСтроки.Установить(ПараметрыЗаписи.ИдентификаторТочки);
	
	НаборШкал = ПараметрыЗаписи.МенеджерШкал.СоздатьНаборЗаписей();
	НаборШкал.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборШкал.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборШкал.Отбор.IDСтрокиТочкиУчета.Установить(ПараметрыЗаписи.ИдентификаторТочки);
	
	НаборПоказаний = ПараметрыЗаписи.МенеджерПоказаний.СоздатьНаборЗаписей();
	НаборПоказаний.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	НаборПоказаний.Отбор.ДокументОснование.Установить(ПараметрыЗаписи.ДокументОснование);
	НаборПоказаний.Отбор.IDСтрокиТочкиУчета.Установить(ПараметрыЗаписи.ИдентификаторТочки);	
	
	НачатьТранзакцию();
	Попытка
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НаборТочек.Записать();	
		НаборШкал.Записать();
		НаборПоказаний.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию(); 
		
		Инфо = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(
		"Создание показаний ЮЛ при загрузке показаний", 
		УровеньЖурналаРегистрации.Ошибка,,,
		"Идентификатор точки: " + ПараметрыЗаписи.ИдентификаторТочки + " причина: " + ПодробноеПредставлениеОшибки(Инфо));	
		
	КонецПопытки;
	
КонецПроцедуры

Функция ЗапуститьФоновоеЗаданиеСервер(ДокументОснование, Идентификаторы)
	
	Шаблон = "ru = '%1'";
	НаимДок = "Создание регистрации показаний ЮЛ. Основание: " + ДокументОснование;
	ИмяФункции = "бестРаботаСПоказаниямиПриборовУчетаНПСервер.ЗапуститьФормированиеРегистрацииПоказанийПоИдентификаторам";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр(СтрШаблон(Шаблон, НаимДок));
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
	ПараметрыВыполнения, 
	ИмяФункции,
	ДокументОснование,
	Идентификаторы);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли