#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Ответственный = Пользователи.ТекущийПользователь();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);	
	УстановитьСостояниеСвязанныхДокументов();
	          	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПериодНачисления = Дата(1, 1, 1);
	ОчиститьТабличныеЧасти();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСостояниеСвязанныхДокументов()
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргОбходнойЛист.Ссылка КАК Ссылка,
		|	энргОбходнойЛист.ПометкаУдаления КАК ПометкаУдаления,
		|	энргОбходнойЛист.Проведен КАК Проведен
		|ИЗ
		|	Документ.энргОбходнойЛист КАК энргОбходнойЛист
		|ГДЕ
		|	энргОбходнойЛист.ДокументОснование = &ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	энргРегистрацияПоказанийАбонента.Ссылка,
		|	энргРегистрацияПоказанийАбонента.ПометкаУдаления,
		|	энргРегистрацияПоказанийАбонента.Проведен
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РежимПроведение = РежимЗаписиДокумента.Проведение;
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ПометкаУдаления Тогда
			УстановитьПометкуСвязанногоДокумента(Выборка);
		Иначе 
			ПровестиСвязанныйДокумент(Выборка, РежимПроведение);
		КонецЕсли; 		
		
	КонецЦикла;
		
КонецПроцедуры

Процедура УстановитьПометкуСвязанногоДокумента(Выборка)
	
	Если Выборка.ПометкаУдаления Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	ДокументОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

Процедура ПровестиСвязанныйДокумент(Выборка, РежимПроведение)
	
	Если Выборка.Проведен Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Если ДокументОбъект.ПометкаУдаления Тогда 
		ДокументОбъект.УстановитьПометкуУдаления(Ложь);
	КонецЕсли;
	ДокументОбъект.Записать(РежимПроведение);
	
КонецПроцедуры

Процедура ОчиститьТабличныеЧасти()
	
	ПоказанияПриборовУчета.Очистить();
	ТочкиУчета.Очистить();
	ШкалыПриборовУчета.Очистить();
	НеЗагруженныеДанныеНеЗагруженныеПоказания.Очистить();
	НеЗагруженныеДанныеНеЗагруженныеПоказанияТарифнаяЗона.Очистить();
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли