#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьУслугуТочкиУчета(Период, Организация, Район, ОбъектРасчета, ТочкаУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестУслугиТочекУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестУслугиТочекУчетаНПСрезПоследних.Район КАК Район,
		|	бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестУслугиТочекУчетаНПСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектРасчета", 	ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("ТочкаУчета", 	ТочкаУчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли