#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет номера пломб введенных приборов действующих точек.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НомераПломбВведенныхПриборовДействующихТочек(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "НомераПломбВведенныхПриборовДействующихТочек") Экспорт
	ПредыдущееИмяТаблицы = "ДействующиеПриборыУчетаПомещения";
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы);		
	Иначе
		ЕстьДействующиеНомераПозицииПломб	= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = ПредыдущееИмяТаблицы Тогда
				ЕстьДействующиеНомераПозицииПломб = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеНомераПозицииПломб Тогда
			РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, ПараметрыОтбора, ПредыдущееИмяТаблицы);		
		КонецЕсли; 		 		
	КонецЕсли;
	
	ЕстьТекущийСоставУзла		 		= Ложь;
	Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
		Если яПакет.ТаблицаДляПомещения  = "ТекущийСоставУзла" Тогда
			ЕстьТекущийСоставУзла = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если НЕ ЕстьТекущийСоставУзла Тогда
		РегистрыСведений.энргСоставУзлаУчетаПомещения.ТекущийСоставУзла(Схема, ПараметрыОтбора, "ТекущийСоставУзла");		
	КонецЕсли;
		
	Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНомераПломбВведенныхПриборовДействующихТочек());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Запрос.Операторы[0].Источники[0].Источник.Параметры;	
	ПараметрыВторойТаблицы				= Источник.Запрос.Операторы[1].Источники[0].Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	ПараметрПериодВторойТаблицы			= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 				= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
		ПараметрПериодВторойТаблицы.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 							= ОператорВыбора.Отбор;		
		ДоступныеПараметры 				= "Организация, Район, КлючПомещения, ПриборУчета, МестоУстановки";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
	
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНомераПломбВведенныхПриборовДействующихТочек()
	
	//Текст  =
	//"ВЫБРАТЬ
	//|	энргНомерПломбПриборовУчетаСрезПоследних.Организация КАК Организация,
	//|	энргНомерПломбПриборовУчетаСрезПоследних.Район КАК Район,
	//|	энргНомерПломбПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	//|	энргНомерПломбПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	//|	энргНомерПломбПриборовУчетаСрезПоследних.МестоУстановки КАК МестоУстановки,
	//|	энргНомерПломбПриборовУчетаСрезПоследних.НомерПломбы КАК НомерПломбы
	//|ИЗ
	//|	РегистрСведений.энргНомерПломбПриборовУчета.СрезПоследних(
	//|			,
	//|			(Организация, Район, КлючПомещения, ПриборУчета, МестоУстановки) В
	//|				(ВЫБРАТЬ
	//|					ДействующиеНомераПозицииПломб.Организация,
	//|					ДействующиеНомераПозицииПломб.Район,
	//|					ДействующиеНомераПозицииПломб.КлючПомещения,
	//|					ДействующиеНомераПозицииПломб.ПриборУчета,
	//|					ДействующиеНомераПозицииПломб.МестоУстановки
	//|				ИЗ
	//|					ДействующиеНомераПозицииПломб КАК ДействующиеНомераПозицииПломб)) КАК энргНомерПломбПриборовУчетаСрезПоследних";
	
	Текст  =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.МестоУстановки КАК МестоУстановки,
	|	ВложенныйЗапрос.НомерПломбы КАК НомерПломбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргНомерПломбПриборовУчетаСрезПоследних.Период КАК Период,
	|		энргНомерПломбПриборовУчетаСрезПоследних.Организация КАК Организация,
	|		энргНомерПломбПриборовУчетаСрезПоследних.Район КАК Район,
	|		энргНомерПломбПриборовУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|		энргНомерПломбПриборовУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	|		энргНомерПломбПриборовУчетаСрезПоследних.МестоУстановки КАК МестоУстановки,
	|		энргНомерПломбПриборовУчетаСрезПоследних.НомерПломбы КАК НомерПломбы
	|	ИЗ
	|		РегистрСведений.энргНомерПломбПриборовУчета.СрезПоследних(
	|				,
	|				(Организация, Район, КлючПомещения, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ДействующиеПриборыУчетаПомещения.Организация,
	|						ДействующиеПриборыУчетаПомещения.Район,
	|						ДействующиеПриборыУчетаПомещения.КлючПомещения,
	|						ДействующиеПриборыУчетаПомещения.ПриборУчета
	|					ИЗ
	|						ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения)) КАК энргНомерПломбПриборовУчетаСрезПоследних
	|	ГДЕ
	|		энргНомерПломбПриборовУчетаСрезПоследних.Состояние
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргНомерПломбПриборовУчетаСрезПоследних.Период,
	|		энргНомерПломбПриборовУчетаСрезПоследних.Организация,
	|		энргНомерПломбПриборовУчетаСрезПоследних.Район,
	|		энргНомерПломбПриборовУчетаСрезПоследних.КлючПомещения,
	|		энргНомерПломбПриборовУчетаСрезПоследних.ПриборУчета,
	|		энргНомерПломбПриборовУчетаСрезПоследних.МестоУстановки,
	|		энргНомерПломбПриборовУчетаСрезПоследних.НомерПломбы
	|	ИЗ
	|		РегистрСведений.энргНомерПломбПриборовУчета.СрезПоследних(
	|				,
	|				(Организация, Район, КлючПомещения, ПриборУчета) В
	|					(ВЫБРАТЬ
	|						ТекущийСоставУзла.Организация,
	|						ТекущийСоставУзла.Район,
	|						ТекущийСоставУзла.КлючПомещения,
	|						ТекущийСоставУзла.Измеритель
	|					ИЗ
	|						ТекущийСоставУзла КАК ТекущийСоставУзла)) КАК энргНомерПломбПриборовУчетаСрезПоследних
	|	ГДЕ
	|		энргНомерПломбПриборовУчетаСрезПоследних.Состояние) КАК ВложенныйЗапрос";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли