
#Область СлужебныйПрограммныйИнтерфейс

#Область ФоновоеВыполнениеЗадачиСменаЗависимыхРеквизитов

Функция ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(Форма, ОповещениеОЗавершении, ДокументОснование, ЗависимыеРеквизиты, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассоваяРегистрацияПоказаний.ЗапуститьФоновоеЗаданиеСменаЗависимыхРеквизитов(ДокументОснование, ЗависимыеРеквизиты);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиПроведениеПоказаний

Функция ЗапуститьФоновоеЗаданиеПроведениеПоказаний(Форма, ОповещениеОЗавершении, ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассоваяРегистрацияПоказаний.ЗапуститьФоновоеЗаданиеПроведениеПоказаний(ДокументОснование);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиОтменаПроведенияПоказаний

Функция ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказаний(Форма, ОповещениеОЗавершении, ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассоваяРегистрацияПоказаний.ЗапуститьФоновоеЗаданиеОтменаПроведенияПоказаний(ДокументОснование);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#Область ФоновоеВыполнениеЗадачиУстановкаПометкиУдаленияПоказаний

Функция ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказаний(Форма, ОповещениеОЗавершении, ДокументОснование, ДополнительныеПараметры = Неопределено) Экспорт 
	
	// 1. Запуск фонового задания на сервере.
	ДлительнаяОперация = энргМассоваяРегистрацияПоказаний.ЗапуститьФоновоеЗаданиеУстановкаПометкиУдаленияПоказаний(ДокументОснование);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ПараметрыОжидания", Неопределено);
	Если ПараметрыОжидания = Неопределено Тогда 
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	КонецЕсли;	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецФункции

#КонецОбласти

#КонецОбласти

