#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестРегистрацияБанкротства(ЭтотОбъект);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьПараметрыСудебныеЗаседания();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьПараметрыСудебныеЗаседания();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаОперацииПриИзменении(Элемент)
	ЗаполнитьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ЗаполнитьТЧ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТЧ()
	Объект.ДанныеЗадолженности.Очистить();
	
	Если Объект.ВидОперации = Перечисления.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом Тогда
		
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьФактическуюЗадолженностьПоПериодам(Объект.Организация,Объект.Район,Объект.Договор,,,Объект.ДатаОперации);
		Выборка = Результат.выбрать();
		Пока Выборка.Следующий() Цикл 
			НовСтр = Объект.ДанныеЗадолженности.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			НовСтр.Сумма = Выборка.Задолженность;
		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.бестВидыОпераций.РегистрацияБанкротства_ОтменаБанкротства Тогда
		Результат = бестВзаиморасчетыЮрЛицаСервер.ПолучитьМораторнуюЗадолженность(Объект.Организация,Объект.Район,Объект.Договор,Объект.ДатаОперации);
		Выборка = Результат.выбрать();
		Пока Выборка.Следующий() Цикл 
			НовСтр = Объект.ДанныеЗадолженности.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.РегистрацияБанкротства_ПризнаниеБанкротом") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОперации", "Заголовок", "Дата принятия к рассмотрению дела судом");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бестВидыОпераций.РегистрацияБанкротства_ОтменаБанкротства") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаОперации", "Заголовок", "Дата отмены банкротства");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПубликации", "Видимость", Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСудебныеЗаседания()
	ПолеДело = Новый ПолеКомпоновкиДанных("Дело");
	Для каждого ТекЭлем Из СудебныеЗаседания.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТекЭлем.ЛевоеЗначение = ПолеДело Тогда
			ТекЭлем.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти