#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ЗначениеОтбора 		= Новый Структура("ДокументОснование", ПараметрКоманды);
	//ПараметрыПередачи 	= Новый Структура("Отбор", ЗначениеОтбора);
	//ОткрытьФорму("Документ.энргОбходнойЛист.ФормаСписка", ПараметрыПередачи, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ПараметрыПередачи 	= Новый Структура("ДокументОснование", ПараметрКоманды);
	ОткрытьФорму(
		"Документ.энргЗагрузкаПоказанийИзВнешнихИсточников.Форма.ФормаСпискаПодчиненныхДокументов", 
		ПараметрыПередачи, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти