#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуЗапросаДействующихПриборовУчетаПомещения_безКлючаПомещения(Схема, Параметры) Экспорт 
	
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема,Параметры,"ВведенныеПриборыДействующихТочек");
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема,Параметры,"УслугиДействующихТочек");
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема,Параметры,"НаправлениеИспользованияДействующихТочек");
	РегистрыСведений.энргВидыДифференцированностиПриборовУчета.ВидДифференцированностиВведенныхПриборов(Схема,Параметры,"ВидДифференцированностиВведенныхПриборов");
	РегистрыСведений.энргРасчетныеСпособыТочекУчета.ДействующиеТочкиТочкиПоФормуле(Схема,Параметры,"ДействующиеТочкиТочкиПоФормуле");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВведенныеПриборыДействующихТочек.Организация КАК Организация,
	|		ВведенныеПриборыДействующихТочек.Район КАК Район,
	|		ВведенныеПриборыДействующихТочек.КлючПомещения КАК КлючПомещения,
	|		ВведенныеПриборыДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|		ВведенныеПриборыДействующихТочек.ПриборУчета КАК ПриборУчета,
	|		энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем
	|	ИЗ
	|		ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО ВведенныеПриборыДействующихТочек.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона
	|ИЗ
	|	(ВЫБРАТЬ
	|		Вложенныйзапрос.Организация КАК Организация,
	|		Вложенныйзапрос.Район КАК Район,
	|		Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
	|		Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|		Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|		Вложенныйзапрос.Шкала КАК Шкала,
	|		Вложенныйзапрос.Услуга КАК Услуга,
	|		Вложенныйзапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|		Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		Вложенныйзапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		Вложенныйзапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|		ЕСТЬNULL(энргВидыУслуг.СоставнаяУслуга, ЛОЖЬ) КАК СоставнаяУслуга
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДанныеПоПриборам.Организация КАК Организация,
	|			ДанныеПоПриборам.Район КАК Район,
	|			ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
	|			ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|			ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|			ДанныеПоПриборам.Шкала КАК Шкала,
	|			ДанныеПоПриборам.РегистрируетОбъем КАК РегистрируетОбъем,
	|			ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|			ЕСТЬNULL(НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ,
	|			НЕ ДействующиеТочкиТочкиПоФормуле.ТочкаУчета ЕСТЬ NULL КАК РасчетПоФормуле,
	|			ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности
	|		ИЗ
	|			ДанныеПоПриборам КАК ДанныеПоПриборам
	|				ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = УслугиДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = УслугиДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = УслугиДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = НаправлениеИспользованияДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = НаправлениеИспользованияДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеТочкиТочкиПоФормуле КАК ДействующиеТочкиТочкиПоФормуле
	|				ПО ДанныеПоПриборам.Организация = ДействующиеТочкиТочкиПоФормуле.Организация
	|					И ДанныеПоПриборам.Район = ДействующиеТочкиТочкиПоФормуле.Район
	|					И ДанныеПоПриборам.КлючПомещения = ДействующиеТочкиТочкиПоФормуле.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = ДействующиеТочкиТочкиПоФормуле.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
	|				ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
	|					И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
	|					И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
	|					И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
	|					И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО Вложенныйзапрос.Услуга = энргВидыУслуг.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО ВложенныйЗапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала");
	
КонецПроцедуры

Функция ДействующиеТочкиИИхПриборы_БезКлючаПомещения(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ПараметрыОтбора = Неопределено) Экспорт 
	
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"		, "Организация")	, Неопределено));
	//ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"			, "Район")			, Неопределено));	
	//ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")	, Неопределено));
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета"	, "ТочкаУчета")		, Неопределено));
	КонецЕсли;
	
	Если НЕ КлючПомещения = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения"	, "КлючПомещения")		, Неопределено));
	КонецЕсли;
	
	Если НЕ Район = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"	, "Район")		, Неопределено));
	КонецЕсли;


	Если ПараметрыОтбора = Неопределено Тогда
		Параметры 		= Новый Структура;	
	Иначе
		Параметры		= ПараметрыОтбора;
	КонецЕсли;
	
	Параметры.Вставить("Период", 			Новый Структура("ИмяПараметра,ТипПараметра", "Период" ,"ТипПараметраГраницаИсключая"));
	Если ТипЗнч(Период) = Тип("Дата") и НЕ ЗначениеЗаполнено(Период) Тогда
		 Параметры.Удалить("Период");
	КонецЕсли;
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	
	энргСостояниеТочекУчета.ЗаполнитьСхемуДействующиеТочкиИИхПриборы(Схема, Параметры);
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПоПриборамИтог.Организация КАК Организация,
		|	ДанныеПоПриборамИтог.Район КАК Район,
		|	ДанныеПоПриборамИтог.КлючПомещения КАК КлючПомещения,
		|	ДанныеПоПриборамИтог.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеПоПриборамИтог.ПриборУчета КАК ПриборУчета,
		|	ДанныеПоПриборамИтог.РодительТочкиУчета КАК РодительТочкиУчета,
		|	ДанныеПоПриборамИтог.Шкала КАК Шкала,
		|	ДанныеПоПриборамИтог.Услуга КАК Услуга,
		|	ДанныеПоПриборамИтог.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ДанныеПоПриборамИтог.ВидДифференцированности КАК ВидДифференцированности,
		|	ДанныеПоПриборамИтог.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеПоПриборамИтог.РасчетПоФормуле КАК РасчетПоФормуле,
		|	ДанныеПоПриборамИтог.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеПоПриборамИтог.Поставщик КАК Поставщик,
		|	ДанныеПоПриборамИтог.НомерПломбы КАК НомерПломбы,
		|	ДанныеПоПриборамИтог.ДатаПоверки КАК ДатаПоверки,
		|	ДанныеПоПриборамИтог.СоставнаяУслуга КАК СоставнаяУслуга
		|ИЗ
		|	ДанныеПоПриборамИтог КАК ДанныеПоПриборамИтог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Район,
		|	КлючПомещения,
		|	РодительТочкиУчета,
		|	ТочкаУчета,
		|	Шкала"); 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Район",			Район);
	ПараметрыЗапроса.Вставить("Организация",	Организация);
	ПараметрыЗапроса.Вставить("КлючПомещения",	КлючПомещения);	
	
	Если Параметры.Свойство("Период") Тогда
		ПараметрыЗапроса.Вставить("Период",		Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",		ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",	ТочкаУчета);
	КонецЕсли;
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
			
КонецФункции

#КонецОбласти

#КонецЕсли