#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	ПроверитьВведенныеПоказания(Отказ);
	ПроверитьДокументыРегистрацииПоказаний(Отказ, РежимЗаписи, РежимПроведения);
	Ответственный = Пользователи.ТекущийПользователь();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект); 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПериодНачисления = Дата(1, 1, 1);
	ДокументОснование = Документы.энргЗагрузкаПоказанийИзВнешнихИсточников.ПустаяСсылка();
	ОчиститьТабличныеЧасти();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаВведенныхПоказаний

Процедура ПроверитьВведенныеПоказания(Отказ)
	
	ПоказанияПриняты = Перечисления.энргСостояниеПоказаний.Приняты;
	
	ОтборШкал = Новый Структура("IDСтроки", Новый УникальныйИдентификатор);
	ОтборТочек = Новый Структура("IDСтроки", Новый УникальныйИдентификатор);
	Для Каждого СтрПоказания из ПоказанияПриборовУчета Цикл 
		
		Если СтрПоказания.ПоказанияПредоставлены И СтрПоказания.СостояниеПоказаний = ПоказанияПриняты 
				И СтрПоказания.ПредыдущиеПоказания > 0 и СтрПоказания.ТекущиеПоказания = 0 Тогда
				
			Постфикс = "";
			ОтборШкал.IDСтроки = СтрПоказания.IDСтроки;
			СтрокиШкал = ШкалыПриборовУчета.НайтиСтроки(ОтборШкал);
			Если СтрокиШкал.Количество() > 0 Тогда
				СтрокаШкал = СтрокиШкал[0];
				
				ОтборТочек.IDСтроки = СтрокаШкал.IDСтрокиТочкиУчета;
				СтрокиТочек = ТочкиУчета.НайтиСтроки(ОтборТочек);
				Если СтрокиТочек.Количество() > 0 Тогда
					СтрокаТочек = СтрокиТочек[0];
					Постфикс = " в строке: " + СтрокаТочек.НомерСтроки;	
				КонецЕсли;				
				
			КонецЕсли;
			
			ТекстСообщения = "Конечные показания не заполнены" + Постфикс;	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область РаботаССостояниемДокументовПоказаний

Процедура ПроверитьДокументыРегистрацииПоказаний(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ОтменитьПроверкуДокументовРегистрацииПоказаний") Тогда
		Возврат;
	КонецЕсли; 	
	
	ЭтоПроведение = НЕ ПометкаУдаления;
	ЭтоОтменаПроведения = ПометкаУдаления;
	
	Если Не ЭтоПроведение и НЕ ЭтоОтменаПроведения Тогда
		Возврат;
	КонецЕсли; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И энргРегистрацияПоказанийАбонента.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	Если ЭтоПроведение Тогда 
		
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И энргРегистрацияПоказанийАбонента.Проведен",
			"И НЕ энргРегистрацияПоказанийАбонента.Проведен
			|	И НЕ энргРегистрацияПоказанийАбонента.ПометкаУдаления");
		
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПроведение Тогда
		
		Отказ = Истина;
		Комментарий = "Перед записью текущего документа, необходимо провести связанные документы регистрации показаний";
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий; 
		
	КонецЕсли;
	
	Если ЭтоОтменаПроведения Тогда
		
		Отказ = Истина;
		Комментарий = "Перед пометкой на удаление текущего документа, необходимо отменить проведение связанных документов регистрации показаний";
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
		ВызватьИсключение Комментарий; 
		
	КонецЕсли;
	
	
КонецПроцедуры
	
#КонецОбласти

Процедура ОчиститьТабличныеЧасти()
	
	ПоказанияПриборовУчета.Очистить();
	ТочкиУчета.Очистить();
	ШкалыПриборовУчета.Очистить();
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли