#Область ОбработчикиСобытий

&НаСервере
Функция  ПроверитьНаличиеДокумента()
	ЕстьДок = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЭтапПретензионноИсковойДеятельности.Ссылка КАК Документ
		|ИЗ
		|	Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
		|ГДЕ
		|	энргЭтапПретензионноИсковойДеятельности.Дата МЕЖДУ &НачПериода И &КонПериода
		|	И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ЭтапПИД";
	
	Запрос.УстановитьПараметр("ЭтапПИД", Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Уведомление);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.Дата));
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Отчет.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕстьДок = ИСТИНА;
	КонецЦикла;
	
	Возврат ЕстьДок;	

КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	ЕстьДок = ПроверитьНаличиеДокумента();
	ЕСЛИ ЕстьДок ТОГДА
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.АвтоМасштаб = ИСТИНА;
		ТабДок.ОтображатьСетку = ЛОЖЬ;
		
		СформироватьТабДок(ТабДок).Показать();	
		
	ИНАЧЕ 
		Предупреждение("Документа ""Уведомления"" по данному абоненту не существует"); 
	КОНЕЦЕСЛИ;
	

КонецПроцедуры


Функция СформироватьТабДок(ТабДок)
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Справка");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.Дата = Формат(Отчет.Дата,"ДЛФ=DD");
	
	// Изменить на если Соц гарантии Тогда!! после слияния с основной конфой!
	Если не Отчет.ЗаполнятьСумму Тогда 
		ОбластьШапка.Параметры.Сумма = "________";
	Иначе		
		ОбластьШапка.Параметры.Сумма = ПолучитьСумму();
	КонецЕсли;
	
	ОбластьШапка.Параметры.Абонент = Отчет.Абонент;
	Для каждого Стр Из Отчет.Абонент.КонтактнаяИнформация Цикл 
		Если Стр.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда			
			ОбластьШапка.Параметры.Адрес = Стр.Представление;
		КонецЕсли;
	КонецЦикла;
	
	ОбластьШапка.Параметры.Контрагент 	= Отчет.Поставщик;
	ОбластьШапка.Параметры.ЛС 			= Отчет.Абонент.ЛицевойСчет;
	ОбластьШапка.Параметры.Организация 	= Отчет.Организация;
	

	ТабДок.Вывести(ОбластьШапка);
	
	Возврат ТабДок;
КонецФункции


&НаСервере
Функция ПолучитьСумму()
	
	Сумма = 0;
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(энргВзаиморасчетыОстатки.СуммаОстаток, 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты.Остатки(
		|			&Период,
		|			Абонент = &Абонент) КАК энргВзаиморасчетыОстатки";
		//|				И Поставщик = &Поставщик) КАК энргВзаиморасчетыОстатки";
	
	Запрос.УстановитьПараметр("Абонент", Отчет.Абонент);
	Запрос.УстановитьПараметр("Период", Отчет.Дата);
	// Запрос.УстановитьПараметр("Поставщик", Отчет.Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции


#КонецОбласти
