#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вставляет в дополнительные свойства массив приборов.
// 
Функция МассивПриборов() Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка",Ссылка);
	Запрос.Текст  	= 
	"ВЫБРАТЬ
	|	энргСменаПоставщикаМКДТочкиУчета.Ссылка.ПериодНачисления КАК ПериодНачисления,
	|	энргСменаПоставщикаМКДПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргСменаПоставщикаМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	ЛОЖЬ КАК ВыводПрибораУчета,
	|	""ПоказанияПриборовУчета"" КАК ИмяТабЧасти,
	|	0 КАК Разделитель
	|ИЗ
	|	Документ.энргСменаПоставщикаМКД.ПоказанияПриборовУчета КАК энргСменаПоставщикаМКДПоказанияПриборовУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ШкалыПриборовУчета КАК энргСменаПоставщикаМКДШкалыПриборовУчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ТочкиУчета КАК энргСменаПоставщикаМКДТочкиУчета
	|			ПО энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка = энргСменаПоставщикаМКДТочкиУчета.Ссылка
	|				И энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтрокиТочкиУчета = энргСменаПоставщикаМКДТочкиУчета.IDСтроки
	|				И (НЕ энргСменаПоставщикаМКДТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|		ПО энргСменаПоставщикаМКДПоказанияПриборовУчета.Ссылка = энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка
	|			И энргСменаПоставщикаМКДПоказанияПриборовУчета.IDСтроки = энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтроки
	|ГДЕ
	|	энргСменаПоставщикаМКДПоказанияПриборовУчета.Ссылка = &Ссылка
	|	И энргСменаПоставщикаМКДТочкиУчета.Ссылка = &Ссылка
	|	И энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка = &Ссылка";
	
	ДополнительныеСвойства.Вставить("МассивПриборов",Запрос.Выполнить());
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
	МассивПриборов();
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 	
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	ДанныеШапки 		= ДанныеШапки();
	
	СоотвествиеКолонок 	= Новый Структура;
	СоотвествиеКолонок.Вставить("ПриборУчета",				"ПриборУчета");
	СоотвествиеКолонок.Вставить("ТекущиеПоказания",			"ТекущиеПоказания");
	СоотвествиеКолонок.Вставить("ТочкаУчета",				"ТочкаУчета");
	
	Пакет = ПолучитьДанныеТЧ();	
	ДанныеПриборовТУ				= Пакет[0]; 
	ДанныеПриборовВывод				= Пакет[1];
	ДанныеПоказанийПриборовУчета	= Пакет[2];
	
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовТУ,	Движения.энргПоставщикиУслугМКД);
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПоказанийПриборовУчета, Движения.энргПоказанияПриборовУчетаМКД);
	энргПроведениеСервер.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПриборовВывод, Движения.энргВыводПриборовУчетаМКД);
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Дата, Организация, Район);	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого СтрокаТЧ Из ТочкиУчета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПоставщикПосле) Тогда
			Если СтрокаТЧ.ЭтоСоставнаяУслуга Тогда
				Для каждого СтрокаСоставныхуслуг Из ПоставщикиСоставныхУслуг Цикл
					Если СтрокаТЧ.IDСтроки = СтрокаСоставныхуслуг.IDСтроки Тогда
						Если НЕ ЗначениеЗаполнено(СтрокаСоставныхуслуг.ПоставщикПосле)  Тогда	
							Отказ = истина;
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""ПоставщикПосле"" по услуге: " + СтрокаСоставныхуслуг.ЧастьСоставнойУслуги,ЭтотОбъект,"УслугиОбъектов["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла;
			Иначе
				Отказ = истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + СтрокаТЧ.НомерСтроки + " не заполнено поле ""ПоставщикПосле"" по услуге: " + СтрокаТЧ.Услуга,ЭтотОбъект,"УслугиОбъектов["+(СтрокаТЧ.НомерСтроки-1)+"].Услуга");				
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки() 	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",					?(ЗначениеЗаполнено(ДатаФактическогоСобытия),КонецДня(ДатаФактическогоСобытия),Дата));
	ДанныеШапки.Вставить("Район",					Район); 
	ДанныеШапки.Вставить("Организация",				Организация);
	ДанныеШапки.Вставить("ПериодРегистрации",		Дата);
	ДанныеШапки.Вставить("ПериодНачисления",		ПериодНачисления); 	
	ДанныеШапки.Вставить("МКД", 					МКД);
	ДанныеШапки.Вставить("ТочкиУчета",				ТочкиУчета);
	ДанныеШапки.Вставить("Документ",				Ссылка);  	
	ДанныеШапки.Вставить("ИмяДокумента",			"энргСменаПоставщикаМКД");
	Возврат ДанныеШапки;	
КонецФункции

Функция ПолучитьДанныеТЧ()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("мДокументы",				Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.МКД КАК МКД,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.ЧастьСоставной
	               |			ТОГДА ЕСТЬNULL(энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка))
	               |		ИНАЧЕ ВложенныйЗапрос.Услуга
	               |	КОНЕЦ КАК Услуга,
	               |	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.ЧастьСоставной
	               |			ТОГДА ЕСТЬNULL(энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.ПоставщикПосле, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка))
	               |		ИНАЧЕ ВложенныйЗапрос.ПоставщикПосле
	               |	КОНЕЦ КАК Поставщик,
	               |	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.Ссылка КАК Ссылка,
	               |	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ВТ_ТУ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА НЕ энргСменаПоставщикаМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА энргСменаПоставщикаМКД.ДатаФактическогоСобытия
	               |			ИНАЧЕ энргСменаПоставщикаМКД.Дата
	               |		КОНЕЦ КАК Период,
	               |		энргСменаПоставщикаМКД.Организация КАК Организация,
	               |		энргСменаПоставщикаМКД.Район КАК Район,
	               |		энргСменаПоставщикаМКД.МКД КАК МКД,
	               |		энргСменаПоставщикаМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	               |		энргСменаПоставщикаМКДТочкиУчета.Услуга КАК Услуга,
	               |		энргСменаПоставщикаМКДТочкиУчета.ЭтоСоставнаяУслуга КАК ЧастьСоставной,
	               |		энргСменаПоставщикаМКДТочкиУчета.IDСтроки КАК IDСтроки,
	               |		энргСменаПоставщикаМКД.Дата КАК ПериодРегистрации,
	               |		НАЧАЛОПЕРИОДА(энргСменаПоставщикаМКД.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	               |		энргСменаПоставщикаМКД.Ссылка КАК Регистратор,
	               |		энргСменаПоставщикаМКДТочкиУчета.ПоставщикПосле КАК ПоставщикПосле,
	               |		энргСменаПоставщикаМКДТочкиУчета.ПриборУчета КАК ПриборУчета
	               |	ИЗ
	               |		Документ.энргСменаПоставщикаМКД КАК энргСменаПоставщикаМКД
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ТочкиУчета КАК энргСменаПоставщикаМКДТочкиУчета
	               |			ПО энргСменаПоставщикаМКД.Ссылка = энргСменаПоставщикаМКДТочкиУчета.Ссылка
	               |				И (энргСменаПоставщикаМКД.Ссылка В (&мДокументы))
	               |				И (энргСменаПоставщикаМКДТочкиУчета.Ссылка В (&мДокументы))) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ПоставщикиСоставныхУслуг КАК энргСменаПоставщикаМКДПоставщикиСоставныхУслуг
	               |		ПО ВложенныйЗапрос.Регистратор = энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = энргСменаПоставщикаМКДПоставщикиСоставныхУслуг.IDСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТУ.Период КАК Период,
	               |	ВТ_ТУ.Организация КАК Организация,
	               |	ВТ_ТУ.Район КАК Район,
	               |	ВТ_ТУ.МКД КАК МКД,
	               |	ВТ_ТУ.ПериодРегистрации КАК ПериодРегистрации,
	               |	ВТ_ТУ.ПериодНачисления КАК ПериодНачисления,
	               |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Вывод) КАК Состояние,
	               |	ВТ_ТУ.ТочкаУчета КАК ТочкаУчета,
	               |	ВТ_ТУ.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ВТ_ПУ
	               |ИЗ
	               |	ВТ_ТУ КАК ВТ_ТУ
	               |ГДЕ
	               |	НЕ ВТ_ТУ.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТУ.Период,
	               |	ВТ_ТУ.Организация,
	               |	ВТ_ТУ.Район,
	               |	ВТ_ТУ.МКД,
	               |	ВТ_ТУ.ПериодРегистрации,
	               |	ВТ_ТУ.ПериодНачисления,
	               |	ВТ_ТУ.ТочкаУчета,
	               |	ВТ_ТУ.ПриборУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Период КАК Период,
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Район КАК Район,
	               |	ВложенныйЗапрос.МКД КАК МКД,
	               |	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	               |	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	               |	энргСменаПоставщикаМКДПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	               |	ВЫБОР
	               |		КОГДА НЕ ВложенныйЗапрос.РегистрируетОбъем
	               |			ТОГДА энргСменаПоставщикаМКДПоказанияПриборовУчета.ТекущиеПоказания
	               |		ИНАЧЕ энргСменаПоставщикаМКДПоказанияПриборовУчета.Разница
	               |	КОНЕЦ КАК Показание,
	               |	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	               |	ЛОЖЬ КАК КС,
	               |	ЛОЖЬ КАК Переворот,
	               |	энргСменаПоставщикаМКДПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	               |	ВложенныйЗапрос.Шкала КАК Шкала
	               |ПОМЕСТИТЬ ВТ_ПоказанияПУ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Период КАК Период,
	               |		ВложенныйЗапрос.Организация КАК Организация,
	               |		ВложенныйЗапрос.Район КАК Район,
	               |		ВложенныйЗапрос.МКД КАК МКД,
	               |		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	               |		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	               |		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	               |		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	               |		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	               |		ВложенныйЗапрос.Регистратор КАК Регистратор,
	               |		энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	               |		энргСменаПоставщикаМКДШкалыПриборовУчета.Шкала КАК Шкала,
	               |		ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ВЫБОР
	               |				КОГДА НЕ энргСменаПоставщикаМКД.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	               |					ТОГДА КОНЕЦПЕРИОДА(энргСменаПоставщикаМКД.ДатаФактическогоСобытия, ДЕНЬ)
	               |				ИНАЧЕ энргСменаПоставщикаМКД.Дата
	               |			КОНЕЦ КАК Период,
	               |			энргСменаПоставщикаМКД.Организация КАК Организация,
	               |			энргСменаПоставщикаМКД.Район КАК Район,
	               |			энргСменаПоставщикаМКД.МКД КАК МКД,
	               |			энргСменаПоставщикаМКДТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	               |			энргСменаПоставщикаМКДТочкиУчета.ПриборУчета КАК ПриборУчета,
	               |			энргСменаПоставщикаМКД.Дата КАК ПериодРегистрации,
	               |			НАЧАЛОПЕРИОДА(энргСменаПоставщикаМКД.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	               |			энргСменаПоставщикаМКДТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	               |			энргСменаПоставщикаМКД.Ссылка КАК Регистратор,
	               |			энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем
	               |		ИЗ
	               |			Документ.энргСменаПоставщикаМКД КАК энргСменаПоставщикаМКД
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ТочкиУчета КАК энргСменаПоставщикаМКДТочкиУчета
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	               |					ПО энргСменаПоставщикаМКДТочкиУчета.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	               |				ПО энргСменаПоставщикаМКД.Ссылка = энргСменаПоставщикаМКДТочкиУчета.Ссылка
	               |					И (энргСменаПоставщикаМКД.Ссылка В (&мДокументы))
	               |					И (энргСменаПоставщикаМКДТочкиУчета.Ссылка В (&мДокументы))
	               |					И (НЕ энргСменаПоставщикаМКДТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ШкалыПриборовУчета КАК энргСменаПоставщикаМКДШкалыПриборовУчета
	               |			ПО ВложенныйЗапрос.Регистратор = энргСменаПоставщикаМКДШкалыПриборовУчета.Ссылка
	               |				И ВложенныйЗапрос.IDСтрокиТочкиУчета = энргСменаПоставщикаМКДШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСменаПоставщикаМКД.ПоказанияПриборовУчета КАК энргСменаПоставщикаМКДПоказанияПриборовУчета
	               |		ПО ВложенныйЗапрос.Регистратор = энргСменаПоставщикаМКДПоказанияПриборовУчета.Ссылка
	               |			И ВложенныйЗапрос.IDСтроки = энргСменаПоставщикаМКДПоказанияПриборовУчета.IDСтроки";
	
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли